[
    {
        "title": "American Airlines Group Announces Pricing of Unsecured Senior Notes",
        "subtitle": "",
        "date": "Feb 20, 2020 4:30PM EST",
        "content": "FORT WORTH, Texas, Feb.  20, 2020  (GLOBE NEWSWIRE) -- American Airlines Group Inc. (NASDAQ: AAL) (the “Company”) today announced that it priced $500.0 million aggregate principal amount of unsecured senior notes due 2025 (the “notes”). The notes will have an interest rate of 3.75% per annum and are being issued at a price equal to 100% of their face value. The notes will be guaranteed on a senior unsecured basis by the Company’s direct wholly-owned subsidiary, American Airlines, Inc.The Company intends to use the net proceeds from the offering to fund contributions to its pension plans. The notes are being offered and sold only to persons reasonably believed to be qualified institutional buyers, as defined in, and in reliance on Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”) and to non-U.S. persons in offshore transactions outside the United States in reliance on Regulation S under the Securities Act. The notes will not be registered under the Securities Act or any other securities laws of any jurisdiction and will not have the benefit of any exchange offer or other registration rights. The notes may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.This press release does not constitute an offer to sell or the solicitation of an offer to buy any of the notes nor shall there be any sale of the notes in any jurisdiction in which such offer, solicitation or sale would be unlawful. This news release is being issued pursuant to and in accordance with Rule 135c under the Securities Act.Forward-Looking StatementsCertain of the statements contained or referred to herein, including those regarding the proposed offering of the notes, represent the Company’s expectations or beliefs concerning future events and should be considered “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to a number of factors that could cause actual results to differ from the Company’s expectations, including but not limited to, factors described in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019 and the Company’s other filings with the Securities and Exchange Commission. Any forward-looking statements speak only as of the date of this release or as of the dates indicated in the statements. The Company does not assume any obligation to publicly update or supplement any forward-looking statement to reflect actual results, changes in assumptions or changes in other factors affecting such statements other than as required by law.Investor Relations682-278-0999investor.relations@aa.com "
    },
    {
        "title": "American Airlines Group Announces Proposed Offering of Unsecured Senior Notes",
        "subtitle": "",
        "date": "Feb 20, 2020 7:10AM EST",
        "content": "FORT WORTH, Texas, Feb.  20, 2020  (GLOBE NEWSWIRE) -- American Airlines Group Inc. (the “Company”) today announced a proposed private offering of $500.0 million aggregate principal amount of unsecured senior notes due 2025.The Company intends to use the net proceeds from the offering to fund contributions to its pension plans.The notes will be offered and sold only to persons reasonably believed to be qualified institutional buyers, as defined in, and in reliance on Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”) and to non-U.S. persons in offshore transactions outside the United States in reliance on Regulation S under the Securities Act. The notes will not be registered under the Securities Act or any other securities laws of any jurisdiction and will not have the benefit of any exchange offer or other registration rights. The notes may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.This press release does not constitute an offer to sell or the solicitation of an offer to buy any of the notes nor shall there be any sale of the notes in any jurisdiction in which such offer, solicitation or sale would be unlawful. This news release is being issued pursuant to and in accordance with Rule 135c under the Securities Act.Forward-Looking StatementsCertain of the statements contained or referred to herein, including those regarding the proposed offering of the notes, represent the Company’s expectations or beliefs concerning future events and should be considered “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to a number of factors that could cause actual results to differ from the Company’s expectations, including but not limited to, factors described in the Company’s Annual Report on Form 10-K for the year ended December 31, 2019  and the Company’s other filings with the Securities and Exchange Commission. Any forward-looking statements speak only as of the date of this release or as of the dates indicated in the statements. The Company does not assume any obligation to publicly update or supplement any forward-looking statement to reflect actual results, changes in assumptions or changes in other factors affecting such statements other than as required by law.  Investor Relations682-278-0999investor.relations@aa.com"
    },
    {
        "title": "Alaska Airlines, American Airlines Announce New West Coast International Alliance: Alaska’s West Coast Network to Connect With American’s Long-Haul Flying to Create More Choice for Travelers",
        "subtitle": "",
        "date": "Feb 13, 2020 8:45AM EST",
        "content": "SEATTLE and FORT WORTH, Texas, Feb.  13, 2020  (GLOBE NEWSWIRE) -- Today, Alaska Airlines and American Airlines announce an alliance to create more choice for West Coast customers. The expanded relationship between the airlines will offer customers several benefits, including:The alliance will give West Coast travelers more choices when traveling internationally, offer seamless access across a broader network and provide strategic growth for both airlines.“Alaska has always been proud to serve Seattle, the city that we call home. We’re thrilled to give our guests more choice, broader use of loyalty benefits, and seamless global service with American and oneworld,” said Ben Minicucci, president of Alaska Airlines. “Additionally, international service to global business and tech hubs Heathrow and Bangalore is a tremendous win for the growing Seattle region and the West Coast.”“Alaska Airlines has been an outstanding partner for nearly 40 years, and we’re excited to expand West Coast international service together,” said Robert Isom, president of American Airlines. “By connecting American’s strength in long-haul international flying and Alaska’s presence across the West Coast, we will build a better network for our customers than either airline could build alone. Together, we will deliver more value, benefits and choice for customers across the U.S. and around the globe.”Alaska seeks full oneworld membershipAlaska intends to join oneworld, the world’s fastest growing and most highly rated global airline alliance. Once approved, oneworld membership will allow Alaska Mileage Plan loyalty members to earn and redeem miles through oneworld’s more than 1,200 international destinations. The alliance enables reciprocal benefits on other member airlines, such as priority check-in and boarding, access to preferred seats and free checked bags.Seattle: An international gateway Seattle’s first-ever direct flight to BLR will be available for purchase later this month, with daily flights beginning October 2020. Daily service between SEA and LHR will be available for purchase in May 2020 for flights starting March 2021.“Beginning West Coast international service from Seattle will complement American’s strong existing international network from LAX,” said Vasu Raja, American’s Senior Vice President, Network Strategy. “India is a grossly underserved market, despite the number of businesses with a major presence in both India and the West Coast. By adding Seattle to Bangalore, we’re giving customers from more than 70 U.S. cities access to India in one stop or less — versus the two, three or four stops they’d have to make to get there in the past.”Codeshare and Frequent Flier Benefits: More options for customersAlaska and American will continue their domestic codeshare relationship, which was scheduled to shrink in March of 2020. The airlines will expand codeshare to West Coast international routes from SEA and LAX for broader international access and choice for customers. Codeshare gives customers seamless access to more destinations and reciprocal frequent flyer program benefits. Customers with lounge membership will enjoy shared access to nearly 50 American Admirals Club lounges worldwide and seven Alaska Lounges in the U.S. for same-day travel on American or Alaska flights.“This alliance further opens the world for Alaska Airlines guests, whether traveling for business or pleasure,” said Andrew Harrison, executive vice president and Chief Commercial Officer of Alaska Airlines. “And importantly for our employees, and the communities we serve, this West Coast international alliance enables Alaska’s continued independent growth. As we’ve shared, we’re focused on delivering for our guests over the long-term – which means continued profitable growth to enable new aircraft and new opportunities. This supports those goals, and is an important step on the path.”The implementation of the expanded relationship and other arrangements described herein is subject to the negotiation and execution of definitive documentation and governmental review.Cautionary Statement Regarding Forward-Looking Statements and InformationCertain of the statements contained in this press release should be considered forward-looking statements within the meaning of the Securities Act of 1933, as amended (the Securities Act), the Securities Exchange Act of 1934, as amended (the Exchange Act), and the Private Securities Litigation Reform Act of 1995. These forward-looking statements may be identified by words such as “may,” “will,” “expect,” “intend,” “anticipate,” “believe,” “estimate,” “plan,” “project,” “could,” “should,” “would,” “continue,” “seek,” “target,” “guidance,” “outlook,” “if current trends continue,” “optimistic,” “forecast” and other similar words. Such statements include, but are not limited to, statements about our plans, objectives, expectations, intentions, estimates and strategies for the future, and other statements that are not historical facts. These forward-looking statements are based on our current objectives, beliefs and expectations, and they are subject to significant risks and uncertainties that may cause actual results and financial position and timing of certain events to differ materially from the information in the forward-looking statements. These risks and uncertainties include, but are not limited to, those risks and uncertainties set forth from time to time in our filings with the Securities and Exchange Commission. There may be other factors of which we are not currently aware that may affect matters discussed in the forward-looking statements and may also cause actual results to differ materially from those discussed. We do not assume any obligation to publicly update or supplement any forward-looking statement to reflect actual results, changes in assumptions or changes in other factors affecting these forward-looking statements other than as required by law. Any forward-looking statements speak only as of the date of this press release or as of the dates indicated in the statement.About Alaska AirlinesAlaska Airlines and its regional partners fly 47 million guests a year to more than 116 destinations with an average of 1,300 daily flights across the United States and to Mexico, Canada and Costa Rica. With Alaska and Alaska Global Partners, guests can earn and redeem miles on flights to more than 800 destinations worldwide. Alaska Airlines ranked \"Highest in Customer Satisfaction Among Traditional Carriers in North America\" in the J.D. Power North America Airline Satisfaction Study for 12 consecutive years from 2008 to 2019. Learn about Alaska's award-winning service at newsroom.alaskaair.com and blog.alaskaair.com. Alaska Airlines and Horizon Air are subsidiaries of Alaska Air Group (NYSE: ALK).About American Airlines Group American Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life's journey, American's 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company's stock is included in the S&P 500. Learn more about what's happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines."
    },
    {
        "title": "American Airlines and GOL Announce Codeshare Agreement to Offer More Daily Service Between South America and the U.S. Than Any Other Airline Partnership",
        "subtitle": "",
        "date": "Feb 4, 2020 6:03AM EST",
        "content": "FORT WORTH, Texas and RIO DE JANEIRO, Brazil, Feb.  04, 2020  (GLOBE NEWSWIRE) -- American Airlines and GOL, Brazil’s largest airline, today announced a new reciprocal codeshare agreement, giving customers access to 20 new destinations in South America. American will also increase service from Miami (MIA) to Rio de Janeiro (GIG), adding a second daily flight this winter. The airline also plans to provide more opportunities to bring customers to Latin America through MIA by adding 12 flights from six U.S. cities.American’s expansion in Miami and Latin America includes:“We are proud of our strong presence in Latin America, which includes 170 daily flights to the region, Admirals Club lounges and dedicated Premium Guest Services teams in Mexico City, Buenos Aires, Rio de Janeiro and Sao Paulo,” said American Airlines President Robert Isom.Codeshare to deliver significant customer benefits After it is approved by authorities in the United States and Brazil, American and GOL’s new codeshare will allow customers to connect seamlessly to 53 GOL flights beyond GIG, Sao Paulo (GRU), Brasilia (BSB), Manaus (MAO) and Fortaleza (FOR).“We have a long and rich history in South America, and this new relationship with GOL further enhances our presence in the region,” said Vasu Raja, Senior Vice President of Network Strategy. “Our customers will continue to have access to places they’ve always loved to travel on American like Rio, Sao Paulo and Brasilia, and will gain access to new destinations on their wish list. We’ll continue to evaluate our network and seek strategic partnerships that benefit our customers and enhance our network.”“As two of the leading airlines in Brazil and the U.S., GOL and American Airlines will offer the best experience for customers on the largest number of flights and destinations in the Americas,” said GOL CEO Paulo Kakinoff. “This will strengthen GOL’s presence in international markets and accelerate our long-term growth.”The new codeshare destinations in South America not currently served by American include Asuncion, Paraguay (ASU); Curitiba, Brazil (CWB) and Foz do Iguaçu, Brazil (IGU), pending government approvals. American anticipates GOL’s code to be placed on select flights. The relationship will allow for future frequent flyer redemption and accrual during the first half of 2020.“GOL and American Airlines will now offer the most convenient flights between South America and the United States,” said Eduardo Bernardes, Vice President of Commercial and Marketing at GOL. “We have strengthened our presence in major airports to better serve our customers. The codeshare partnership will soon increase to more than 30 destinations in the U.S.”Largest airline in Miami adds even more flying, more connections to Latin AmericaAmerican recently set a record at its MIA hub by carrying 30.3 million passengers last year. The airline plans to carry more passengers this summer, adding 12 new flights from six cities across the U.S. beginning June 4:All new flights will be operated daily on mainline aircraft, with optimal flight times for connections to Latin America and the Caribbean from MIA. American already increased flights from Austin, Texas (AUS), with one additional flight, and New York City (JFK), with three additional flights, to MIA starting summer 2020.“As the hometown airline in Miami, we look forward to welcoming more business and leisure customers to sunny South Florida or to connect them to places like Montevideo, where we’re the only airline in the market,” Raja said. “We will continue to meet growing demand in Latin America with strategic partnerships and more service.”As American partners with GOL and increases service to MIA, the airline is also adding a second daily flight from MIA to GIG during the peak winter season from Jan. 7 through March 28. Flights will operate on the state-of-the-art Boeing 787-8, for a new total of 507 seats per day between MIA and GIG, including 57 seats in Flagship Business and 52 in Premium Economy.Increased American Airlines flights to MIA The leader to Latin AmericaAmerican has served Latin America since 1942 and currently employs more than 3,300 team members, with four flight attendant bases in the region: Bogota, Buenos Aires, Santiago and Lima. American flies up to 170 daily flights to 55 destinations in 18 countries in Latin America, from eight hub airports, as well as from Boston (BOS). The airline recently announced increased service on the heels of celebrating Miami’s 30th anniversary as its leading Latin America hub. The new service includes more daily flights to Lima, Peru (LIM), beginning April 7; increased service to Santiago, Chile (SCL); and an additional flight to GRU beginning winter 2020. Those new flights are available for purchase now.About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life's journey, American's 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company's stock is included in the S&P 500. Learn more about what's happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.About GOL AirlinesGOL Airlines is the largest airline in Brazil, transporting more than 33 million customers per year. It’s also a leader in both leisure and corporate travel markets in the country. In 19 years of history, the airline has a key role in the democratization of the air transport in Brazil, becoming the largest low-cost airline in the industry with the best rate of Latin America. Currently, it offers 750 daily flights to more than 100 destinations — in Brazil, South America, the Caribbean and, and the United States — with a standardized fleet of 125 aircraft Boeing 737. The company maintains strategic alliances with Air France and KLM, besides offering to customers 14 codeshare and 77-plus interline agreements, bringing more convenience and ease in connections to anyplace served by these partnerships. Aiming at being the First for All, GOL has continuously invested in products, services, and customer service to deliver the best travel experience. #NovaGOL strengthens this concept, presenting a company that leads in different aspects — punctuality and comfort with the increased supply of seats and more room between seats; connectivity and entertainment, offering the most complete platform with Internet, movies, and complimentary live TV; the offering of VIP Lounges for domestic and international flights; the best loyalty program in the market — Smiles; and a customer service recognized and awarded by various organizations, such as Brazilian’s ANAC (the National Civil Aviation Agency of Brazil), consumer advocate website Reclame Aqui, and the Brazilian Forum of Relationship with the Customer. As for cargo transport and logistics, GOLLOG enables the acquisition, distribution, and delivery of parcels for various regions of the country and abroad. Internally, GOL relies on a team of 15,000 aviation professionals — highly qualified employees who are always focused on safety, the airline's number one value. More information at www.voegol.com.br.Corporate Communications817-967-1577mediarelations@aa.com"
    },
    {
        "title": "American Airlines and TWU-IAM Association Reach Tentative Agreements for Joint Collective Bargaining Agreements",
        "subtitle": "",
        "date": "Jan 30, 2020 8:28PM EST",
        "content": "FORT WORTH, Texas, Jan.  30, 2020  (GLOBE NEWSWIRE) -- American Airlines and the TWU-IAM Association reached tentative agreements this week for new joint collective bargaining agreements that cover more than 31,000 team members.The tentative agreements are subject to ratification by Maintenance & Related and Fleet Service team members represented by the Association. The association will communicate details of the agreements to its members in the coming weeks.“Our Maintenance & Related and Fleet Service team members are the very best in the business and work incredibly hard to care for our customers,” American Chairman and CEO Doug Parker said. “They deserve contracts that include meaningful improvements in pay, quality of life and job protections. The tentative agreements deliver on all of these — and more. We appreciate the Association and company negotiators who worked so hard to get us to this day, as well as the National Mediation Board for their guidance.”About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life’s journey, American’s 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company’s stock is included in the S&P 500. Learn more about what’s happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Corporate Communications817-967-1577mediarelations@aa.com "
    },
    {
        "title": "American Airlines Group Reports Fourth-Quarter and Full-Year 2019 Profit",
        "subtitle": "",
        "date": "Jan 23, 2020 7:30AM EST",
        "content": "FORT WORTH, Texas, Jan.  23, 2020  (GLOBE NEWSWIRE) -- American Airlines Group Inc. (NASDAQ: AAL) today reported its fourth-quarter and full-year 2019 financial results, including these highlights:“During the fourth quarter, we made important progress to address the issues that impacted our business in 2019, and, thanks to our incredible team, we ended the year with our strongest operational quarter on record,” said American Airlines Chairman and CEO Doug Parker.“While our results for the quarter reflect this progress, we know there is more work to be done. Looking to 2020, we are focused on three key areas. First, we will continue to deliver operational excellence and build on our strong fourth-quarter results. Our team has done a tremendous job, and we will keep driving improvement in key operational metrics in the year ahead. Second, we will deliver those results while growing where we have a competitive advantage in our most profitable hubs. And third, these initiatives combined with our capital plan will enable us to drive significant free cash flow in 2020 and beyond.”Fourth-Quarter Revenue and ExpensesPre-tax earnings were $571 million in the fourth quarter of 2019. Pre-tax earnings excluding net special items for the fourth quarter of 2019 were $679 million, a $90 million increase from the fourth quarter of 2018, or 15.1% year-over-year increase from the same period last year.Continued strength in passenger demand and a record passenger load factor drove a 3.4% year-over-year increase in fourth-quarter 2019 total revenue to a record $11.3 billion. Driven by a 2.4% increase in passenger load factor, passenger revenue per available seat mile (PRASM) grew 0.9% to 14.72 cents, a record for the fourth quarter. Cargo revenue was down 18.3% to $216 million due primarily to a 15.6% decline in cargo volume. Other revenue was up 5.4% to $750 million due primarily to higher loyalty revenue. Fourth-quarter total revenue per available seat mile (TRASM) increased by 0.5% compared to the fourth quarter of 2018 on a 2.9% increase in total available seat miles.Total fourth-quarter 2019 operating expenses were $10.6 billion, up 2.1% year over year, driven primarily by higher salaries and benefits, maintenance, and regional expenses. Total fourth-quarter 2019 cost per available seat mile (CASM) was 15.06 cents, down 0.8% from fourth-quarter 2018. Excluding fuel and net special items, consolidated fourth-quarter CASM was 11.59 cents, up 2% year over year.12020 Priorities              In 2020, American is focused on operational excellence, efficient and profitable growth, and generating significant free cash flow.Operational ExcellenceOver the past several months, American’s operational performance has shown significant improvement, including the company’s best-ever performance for both the holiday peak travel period and the entire fourth quarter of 2019. American achieved record results for combined mainline and regional on-time departures, on-time arrivals and completion factor.“We are very pleased with the trajectory of our operation and are well on our way to delivering operational excellence,” said American Airlines President Robert Isom. “As we look ahead to 2020, we will continue to strengthen our operation and expect to see continued improvements in our reliability metrics.”Efficient and Profitable GrowthAmerican is committed to growing its network efficiently and profitably. In 2019, the company added 15 new gates at Dallas Fort Worth International Airport. This growth resulted in a 21% increase in city pairs served and strong unit revenue. The company also added four new gates at Charlotte Douglas International Airport, with plans for three additional gates beginning in 2020. In addition, the company expects to upgauge 14 gates at Ronald Reagan Washington National Airport with dual-class regional jets when the new regional concourse opens in 2021.Significant Free Cash Flow, Share Repurchases and DividendsWith American’s historic fleet renewal program winding down, the company’s level of capital investment is expected to decline. The company is committed to generating significant free cash flow for its shareholders in 2020 and beyond and presently expects to generate approximately $6 billion in free cash flow3 over the next two years. In the fourth quarter of 2019, American returned $285 million to shareholders through the repurchase of 9.9 million shares of common stock and also paid $44 million in dividends. As of Dec. 31, 2019, the company had $565 million remaining of its existing $2 billion share repurchase authorization.4 In aggregate, American has returned more than $13.5 billion to shareholders over the past five years through share repurchases and dividends, including $1.3 billion in 2019.American declared a dividend of $0.10 per share to be paid Feb. 19, 2020, to stockholders of record as of Feb. 5, 2020.Fleet Update On March 13, 2019, a directive from the Federal Aviation Administration grounded all U.S.-registered Boeing 737 MAX aircraft. American’s fleet currently includes 24 MAX aircraft with an additional 76 aircraft on order. As a result of this directive, American canceled approximately 10,000 flights in the fourth quarter of 2019.The company has removed all MAX flying from its flight schedule through June 3, 2020, and will continue to asses this timeline.Guidance and Investor UpdateAmerican expects its first-quarter 2020 pre-tax margin excluding net special items to be approximately flat year over year.5 Based on today’s guidance, the company expects its 2020 diluted earnings per share excluding net special items to be between $4.00 and $6.00.5For additional financial forecasting detail, please refer to the company’s investor update, furnished with this release with the SEC on Form 8-K. This filing will be available at aa.com/investorrelations.Conference Call / Webcast DetailsThe company will conduct a live audio webcast of its earnings call today at 7:30 a.m. CT, which will be available to the public on a listen-only basis at aa.com/investorrelations. An archive of the webcast will be available on the website through Feb. 23.NotesSee the accompanying notes in the Financial Tables section of this press release for further explanation, including a reconciliation of all GAAP to non-GAAP financial information.             About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life's journey, American's 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $30 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company's stock is included in the S&P 500. Learn more about what's happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Cautionary Statement Regarding Forward-Looking Statements and InformationCertain of the statements contained in this report should be considered forward-looking statements within the meaning of the Securities Act of 1933, as amended (the Securities Act), the Securities Exchange Act of 1934, as amended (the Exchange Act), and the Private Securities Litigation Reform Act of 1995. These forward-looking statements may be identified by words such as “may,” “will,” “expect,” “intend,” “anticipate,” “believe,” “estimate,” “plan,” “project,” “could,” “should,” “would,” “continue,” “seek,” “target,” “guidance,” “outlook,” “if current trends continue,” “optimistic,” “forecast” and other similar words. Such statements include, but are not limited to, statements about our plans, objectives, expectations, intentions, estimates and strategies for the future, and other statements that are not historical facts. These forward-looking statements are based on our current objectives, beliefs and expectations, and they are subject to significant risks and uncertainties that may cause actual results and financial position and timing of certain events to differ materially from the information in the forward-looking statements. These risks and uncertainties include, but are not limited to, those set forth in our Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 (especially in Part I, Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations, and Part II, Item 1A. Risk Factors), and other risks and uncertainties listed from time to time in our other filings with the Securities and Exchange Commission. There may be other factors of which we are not currently aware that may affect matters discussed in the forward-looking statements and may also cause actual results to differ materially from those discussed. We do not assume any obligation to publicly update or supplement any forward-looking statement to reflect actual results, changes in assumptions or changes in other factors affecting these forward-looking statements other than as required by law. Any forward-looking statements speak only as of the date hereof or as of the dates indicated in the statement.    "
    },
    {
        "title": "UATP Reports Back-To-Back Record-Breaking Years",
        "subtitle": "The results reflect continuous growth across Key Performance Indicators",
        "date": "Jan 14, 2020 1:35PM EST",
        "content": "WASHINGTON, Jan. 14, 2020 /PRNewswire/ -- The UATP payment network is pleased to announce another multi-record-breaking year in 2019.UATP's Network Charge Volume grew 3% year-over-year while transactions grew by a healthy 15% resulting in all-time records.  \"We are thrilled to start 2020 with back-to-back record-breaking years.  In addition to the continuous growth across key metrics, UATP's Alternative Payment Processing business set an astounding record of 24% year-over-year growth,\" said Ralph Kaiser, president and CEO, UATP. \"UATP continues to deliver sophisticated payment solutions that create value for our Shareholders and Stakeholders.\"  Kaiser continued, \"Our hard work has successfully positioned the Network to accomplish these excellent results allowing UATP to flourish and work towards yet another highly successful year in 2020.\"  UATP's core program consists of the Network Charge Card and AFP Processing business lines.  UATP's offerings allow airlines to reduce the high cost of credit card use and provide important data for accurate travel management. UATP provides corporate data tools, DataStream® and DataMine®, to ensure accurate travel management and supply Level III Data.For more information, visit UATP.com.ABOUT UATPUATP is a global payment network owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP connects airlines to Alternative Forms of Payment which can expand reach and generate incremental sales globally. UATP offers easy-to-use data tools, DataStream® and DataMine®, which provide comprehensive account details to Issuers and corporate travel buyers for accurate travel management.Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE:AC); Air New Zealand (ANZFF.PK); Air Niugini; Air Serbia; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines;  Sichuan Airlines; Southwest Airlines; Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NYSE: UAL) and WestJet.AirPlus International issues the UATP-based Company Account for Lufthansa German Airlines.Contact:UATP Corporate CommunicationsWendy Ward, wward@uatp.com +1 202 774 5017  View original content to download multimedia:http://www.prnewswire.com/news-releases/uatp-reports-back-to-back-record-breaking-years-300986838.htmlSOURCE  Universal Air Travel Plan, Inc. (UATP)"
    },
    {
        "title": "American Airlines Group Announces Webcast of Fourth-Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 9, 2020 10:00AM EST",
        "content": "FORT WORTH, Texas, Jan.  09, 2020  (GLOBE NEWSWIRE) -- American Airlines Group (NASDAQ: AAL) will webcast a live audio feed of its fourth-quarter 2019 financial results conference call with financial analysts and journalists Thursday, Jan. 23 at 7:30 a.m. CT.The webcast will be available to the public on a listen-only basis at aa.com/investorrelations. An archive of the call will be available on the website through Feb. 23.About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life's journey, American's 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company's stock is included in the S&P 500. Learn more about what's happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Corporate Communications 817-967-1577 mediarelations@aa.com"
    },
    {
        "title": "New Flights From Austin to Boston and San Jose Start This Spring",
        "subtitle": "",
        "date": "Dec 10, 2019 9:30AM EST",
        "content": "FORT WORTH, Texas, Dec.  10, 2019  (GLOBE NEWSWIRE) -- American Airlines is giving customers a treat this holiday season with the announcement of two new routes from the vibrant and eclectic city of Austin, Texas (AUS), to the capital of Silicon Valley, San Jose, California (SJC), and to the historical city of Boston (BOS). These new routes will operate twice daily beginning in April.The airline is also introducing unique service in support of special events like golf tournaments in Augusta, Georgia (AGS), music festivals in Palm Springs, California (PSP), and the annual visit to one of the nation’s biggest shareholder meetings with increased service to Omaha, Nebraska (OMA). Austin flights will be available for purchase starting Dec. 16 and special events flights will be available for purchase starting Dec. 22.New Austin flights takeoff in AprilAmerican’s newest service is in response to strong demand from customers who need to travel between one of the nation’s largest tech cities, Austin, to the tech centers in San Jose and Boston.“Our customers have expressed the desire for more routes between major tech cities, and we’re pleased to respond to their needs by helping them reach these important destinations with ease,” said Alison Taylor, Senior Vice President of Global Sales and Distribution. “These new routes reflect our commitment to partnering with customers to seamlessly support their travel needs.”Flights will operate twice daily, Monday through Friday, on a Boeing 737-800, year-round. The aircraft features high-speed Wi-Fi, access to power at every seat and 16 first class seats, providing additional comfort while commuting. With convenient flight times, customers flying the new service can get to meetings early and get back home in time for dinner. The airline has also recently renovated the Admirals Club to relax before flights, and, by the end of the year, American will have five contiguous gates at AUS.“We added these routes with our customers top of mind to bring them closer to the places they value the most when conducting business,” said Vasu Raja, Senior Vice President of Network Strategy. “While it’s not our traditional hub and spoke routing, we understand the importance of travel for the tech community and look forward to offering these new flights to our loyal customers.”And, for a quick weekend beach escape from the capital of Texas, American will also introduce the only service from AUS to Los Cabos, Mexico (SJD) on Saturday and Sunday, starting May 9.Flight times are subject to change.Special flights for special eventsIn addition to the yearly increase in service for special events, American is also adding more unique flights that will make it easier than ever to attend must-see special events such as sports tournaments, concerts and meetings. American is adding direct service from Los Angeles (LAX) to PSP in April, for a faster way to get to one of the biggest music festivals of the year. The airline is also adding new service to AGS from BOS on an Embraer E175, and upgauging existing service from Chicago (ORD) to Augusta on a 737-800 to help customers who want a front row seat to golf’s biggest championship tournament. And in May, American will have the most seats to Louisville, Kentucky (SDF), for one of the most unique sporting events under the Twin Spires at Churchill Downs, from BOS, CLT, DCA, DFW, LAX, LGA, MIA, ORD and PHL. American also has customers covered who care more about investing with the only service from BOS to OMA, as well as new flights from New York City (LGA) and Ronald Reagan Washington National Airport (DCA) to OMA on an E175 on May 1.“It’s important to spend time and resources on memorable experiences, and we want to make sure our customers have options when it comes to the most important events around the country throughout the year,” Raja said. “We’re adding more seats, introducing new routes and making sure that our customers are taken care of throughout their travel journey.”Special Events Schedule* *Flight schedules change dailyAbout American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life's journey, American's 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company's stock is included in the S&P 500. Learn more about what's happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Corporate Communications817-967-1577mediarelations@aa.com"
    },
    {
        "title": "20 New Routes for Summer 2020",
        "subtitle": "",
        "date": "Nov 21, 2019 9:00AM EST",
        "content": "FORT WORTH, Texas, Nov.  21, 2019  (GLOBE NEWSWIRE) -- American Airlines customers will have a lot to be thankful for as the airline plans to launch an additional eight new domestic routes this summer, offering customers a total of 20 new seasonal routes in summer 2020. The new routes include service to Martha’s Vineyard (MVY) and Nantucket (ACK) in Massachusetts and new service from Jackson, Mississippi (JAN) and Des Moines, Iowa (DSM) to Miami (MIA), the airline’s gateway to Latin America and the Caribbean.“Every year, we evaluate our network and look to create more routes and serve unique destinations whether we’re entering new markets like Casablanca or adding more service to places like Traverse City, Michigan,” said Vasu Raja, American’s Senior Vice President of Network Strategy. “We continue to deliver the best network with the most options for our customers domestically and internationally during the most popular vacation time of the year.”Domestic additionsBeginning in June, American will add two new ways to get to the lighthouses and sandy beaches of Martha’s Vineyard from two connecting hubs on the East Coast — Philadelphia (PHL) and Charlotte (CLT). The airline will also introduce a new route to the cobblestone streets of Nantucket with Saturday service from PHL. All three flights will be operated on an Embraer 175, featuring 12 First Class seats and 64 Main Cabin seats. Next summer, Traverse City (TVC) will see direct service from PHL and Ronald Reagan Washington National Airport (DCA), giving customers access to the shores of Lake Michigan’s Grand Traverse Bay every Saturday. The airline will also introduce new Saturday service from Dallas-Fort Worth (DFW) to the waterfront city of Portland, Maine (PWM) operated on an Airbus 319 aircraft.MIA is American’s gateway to Latin America and the Caribbean, and, next summer, customers flying from JAN and DSM will have nonstop service to MIA on Saturday and Sunday from June through August. Flight times will complement one-stop connections to vacation favorites like Bonaire, St. Vincent, and Montego Bay, Jamaica.American previously announced seasonal service to National Parks in Kalispell (FCA) and Bozeman (BZN), Montana, and increased service to Alaska, including a new destination, Fairbanks (FAI), which will begin operating in May.A summer overseasIn August, American announced an international expansion that includes entering Africa  for the first time with service to Casablanca, Morocco (CMN), from PHL and seasonal service from Chicago (ORD) to Krakow, Poland (KRK); Prague, Czech Republic (PRG); and Budapest, Hungary (BUD). American will be the only US carrier providing service to KRK, BUD and PRG from ORD.“Our future is bright, and we see summer 2020 as an opportunity for growth in the leisure destinations our customers truly value,” Raja continued. “We have 20 new seasonal routes to choose from — narrowing down where to go will be the hardest part.”New flights will be available for purchase Nov. 25.20 New Routes for 2020 About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life's journey, American's 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company's stock is included in the S&P 500. Learn more about what's happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines. Corporate Communications 817-967-1577 mediarelations@aa.com"
    },
    {
        "title": "American Airlines to Webcast Presentation at Baird Global Industrial Conference",
        "subtitle": "",
        "date": "Oct 30, 2019 10:00AM EDT",
        "content": "FORT WORTH, Texas, Oct.  30, 2019  (GLOBE NEWSWIRE) -- American Airlines Group Inc. (NASDAQ: AAL) Chairman and Chief Executive Officer Doug Parker will present at the 2019 Baird Global Industrial Conference Wednesday, Nov. 6, at 9 a.m. CT. A live audio webcast will be available at aa.com/investorrelations.About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life’s journey, American’s 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company’s stock is included in the S&P 500. Learn more about what’s happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines. Investor Relations817-931-3423investor.relations@aa.com "
    },
    {
        "title": "American Airlines Becomes the Only Carrier to Fly From the U.S. to the South Island of New Zealand",
        "subtitle": "",
        "date": "Oct 28, 2019 6:00AM EDT",
        "content": "FORT WORTH, Texas, Oct.  28, 2019  (GLOBE NEWSWIRE) -- A trip to the breathtaking landscape of the majestic Southern Alps will become much shorter when American Airlines launches the only nonstop service from Los Angeles International Airport (LAX) to Christchurch, New Zealand (CHC), next October. The airline is also adding the only direct service between Dallas Fort Worth International Airport (DFW) and Auckland, New Zealand (AKL), which will increase connecting opportunities for more customers across the United States. These routes are a direct result of the recently approved joint business with Qantas, which delivers new customer benefits like enhanced codeshare opportunities and increased frequent flyer benefits for American and Qantas customers.The gateway to the South IslandChristchurch is the largest city in the South Island of New Zealand, and as the only carrier to operate this route, American will introduce its customers to one of the world’s most unique destinations.“The South Island sums up everything that our customers are looking for in New Zealand — adventure, culture and wildlife found no where else,” said Vasu Raja, American’s Senior Vice President of Network Strategy. “We want to make their lifelong dreams a reality and bring New Zealand’s beauty even closer as the gateway to the South Island where you can drive, hike, cruise and fly to a variety of classic New Zealand experiences.”American will fly to CHC three times per week from October 2020 through March 2021 on a Boeing 787-8. The 787-8 features 20 Flagship Business seats and 28 Premium Economy seats, providing additional comfort for the 13-hour flight. The aircraft offers a variety of entertainment options for customers, with access to power at every seat, live television, and hundreds of movies, music, games and TV shows.LAX to CHC creates unique one-stop connections to the South Island not previously available by any other carrier. Qantas and Jetstar will connect passengers from CHC on to Wellington and Melbourne — some of the most popular destinations in the Pacific.A new way to New ZealandAmerican currently operates seasonal service from LAX to AKL and will add new service from DFW next year. Flights will be operated with American’s state-of-the-art 787-9, with 30 Flagship Business seats and 21 Premium Economy seats. New flights from DFW to AKL will enable new one-stop connections to New Zealand from more than 70 cities across the United States.  “Now, we’re able to get customers from places like Louisville, Savannah or Monterrey, Mexico, all the way to New Zealand with just one stop,” said Raja.As American enhances its commitment to the region, seasonal LAX to AKL service will resume earlier next year — Oct. 7 — adding three weeks of service to the increasingly popular destination.“The South Island is a must-see for any international visitor to New Zealand,” said Stephen England-Hall, Tourism New Zealand’s Chief Executive. “Thanks to the new non-stop flights from Los Angeles to Christchurch and Dallas-Fort Worth to Auckland, it’s is now easier than ever before to experience all that unique and welcoming New Zealand has to offer.”Benefits of the Qantas Joint BusinessAmerican and Qantas recently received final approval to form a joint business, which promises significant customer benefits not possible through any other form of cooperation. The carriers have already rolled out improved frequent flyer benefits, including higher earning rates for points and status credits on each airline’s network, and have expanded codeshare routes on each other’s network. Qantas will also increase from six weekly flights between Sydney, Australia (SYD) and DFW to daily service by mid-2020. Additionally, Qantas announced new service from San Francisco International Airport (SFO) and Chicago O’Hare International Airport (ORD) to Brisbane, Australia (BNE), which will launch in February and April respectively. Qantas will have its code on American’s new flights to New Zealand, giving Qantas frequent flyers more opportunities to earn and redeem Qantas points and status credits on American. Next year, American and Qantas will provide the most service to Australia and New Zealand from the U.S.LAX–AKL flights beginning in Oct. 2020 will be available for purchase starting Nov. 9. New LAX–CHC and DFW–AKL flights will be available for purchase starting Nov. 30.About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life’s journey, American’s 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company’s stock is included in the S&P 500. Learn more about what’s happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines. Corporate Communications817-967-1577mediarelations@aa.com"
    },
    {
        "title": "CORRECTING and REPLACING -- American Airlines Group Reports Third-Quarter 2019 Profit",
        "subtitle": "",
        "date": "Oct 24, 2019 9:44AM EDT",
        "content": "FORT WORTH, Texas, Oct.  24, 2019  (GLOBE NEWSWIRE) -- In a release issued under the same headline earlier today by American Airlines Group Inc. (NASDAQ: AAL), please note that in the first table the columns should be labeled as 3Q19 and 3Q18, not 2Q19 and 2Q18 as previously stated. The corrected release follows:American Airlines Group Inc. (NASDAQ: AAL) today reported its third-quarter 2019 results, including these highlights:“We are pleased to report an earnings increase of 15% and earnings per share growth of 20% for the third quarter, excluding net special items,” said Chairman and CEO Doug Parker. “However, we know that our results should have been better. Our third quarter was impacted by the continued grounding of the Boeing 737 MAX and the operational challenges resulting from ongoing labor contract negotiations. These challenges affected our customers, our shareholders and our team members, who we thank for their hard work and perseverance.”“We are taking decisive action to correct this performance and are excited about our prospects for 2020 and beyond. As we look forward, we are committed to restoring operational excellence, growing efficiently and profitably, and generating significant free cash flow for our investors.”Third-Quarter Revenue and ExpensesPre-tax earnings excluding net special items for the third quarter of 2019 were $835 million, a 16% year-over-year increase from the third quarter of 2018. Excluding net special items, net income was $630 million, or $1.42 per diluted share.Strong passenger demand drove a 3% year-over-year increase in third-quarter 2019 total revenue to a record $11.9 billion. Driven by a 3 percentage point increase in total passenger load factor, passenger revenue per available seat mile (PRASM) grew 3% to a record 14.50 cents. Cargo revenue decreased 20% to $208 million due primarily to a 17% decrease in cargo ton miles. Other revenue was down 4% to $708 million. Third-quarter 2019 TRASM increased by 2% year over year to a record 15.71 cents on a 1% increase in total available seat miles, marking the 12th consecutive quarter of growth.Total third-quarter 2019 operating expenses were $11.1 billion, up 2% year over year. Total operating cost per available seat mile (CASM) was 14.64 cents in the third quarter of 2019, up 1% from the third quarter of 2018. Excluding fuel and net special items, third-quarter 2019 CASM was 11.07 cents, up 5% year over year due primarily to higher salaries and benefits, maintenance and regional expense, and lower than planned capacity.DFW 900Earlier this summer, American embarked on a network expansion project by adding approximately 100 daily departures at its largest hub, Dallas Fort Worth International Airport (DFW). The results have surpassed initial expectations, and, in the third quarter, the company grew domestic capacity at DFW by 9% and produced PRASM growth of 3.5% compared to 2018. This is the largest expansion of capacity at any hub in the U.S. in more than a decade and sets a positive precedent for American’s planned expansions next year at Charlotte Douglas International Airport and Ronald Reagan Washington National Airport in 2021.Fleet UpdateOn March 13, a directive from the Federal Aviation Administration (FAA) grounded all U.S.-registered Boeing 737 MAX aircraft. The American fleet currently includes 24 MAX aircraft with an additional 76 aircraft on order, of which five were scheduled to be delivered in the third quarter. As a result of this directive, American canceled 9,475 flights in the third quarter of 2019. The company estimates that the cancellations in the third quarter negatively impacted pre-tax income by approximately $140 million.The company has removed all MAX flying from its flight schedule through Jan. 15, 2020. With the flight cancellations extending through the remainder of 2019, the company now expects the MAX cancellations will negatively impact its full-year 2019 pre-tax income by approximately $540 million.OperationsAmerican has seen recent improvement in key operational metrics, including on-time departures and arrivals. The company’s on-time performance in September was its best performance in almost two years, and this improvement has continued into October.American Airlines President Robert Isom said, “We continue to strengthen our operations with ongoing enhancements, including retiring older aircraft, simplifying our fleet and schedule, and fortifying our maintenance and airport resources. Our underlying execution is solid, and we are committed to returning American to a position of operational excellence.”Share Repurchases and DividendsAmerican returned $200 million to shareholders through the repurchase of 7.3 million shares and also paid $44 million in dividends in the third quarter. The company has approximately $850 million remaining of its existing $2 billion share repurchase authorization2. In aggregate, American has returned more than $13 billion to shareholders over the past five years through share repurchases and dividends.American also declared a dividend of 10 cents per share to be paid Nov. 20 to stockholders of record as of Nov. 6, 2019.Guidance and Investor UpdateAmerican expects its fourth-quarter 2019 TRASM to be flat to up 2% year over year. The company also expects its fourth-quarter 2019 pre-tax margin excluding net special items to be between 5% and 7%3. Based on today’s guidance, American expects its 2019 diluted earnings per share excluding net special items to be between $4.50 and $5.503.For additional financial forecasting detail, please refer to the company’s investor update, filed with this release with the SEC on Form 8-K. This filing will be available at aa.com/investorrelations.Conference Call/Webcast DetailsThe company will conduct a live audio webcast of its earnings call today at 7:30 a.m. CT, which will be available to the public on a listen-only basis at aa.com/investorrelations. An archive of the webcast will be available on the website through Nov. 24.NotesSee the accompanying notes in the Financial Tables section of this press release for further explanation, including a reconciliation of all GAAP to non-GAAP financial information.About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life’s journey, American’s 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company’s stock is included in the S&P 500. Learn more about what’s happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Cautionary Statement Regarding Forward-Looking Statements and InformationCertain of the statements contained in this report should be considered forward-looking statements within the meaning of the Securities Act of 1933, as amended (the Securities Act), the Securities Exchange Act of 1934, as amended (the Exchange Act), and the Private Securities Litigation Reform Act of 1995. These forward-looking statements may be identified by words such as “may,” “will,” “expect,” “intend,” “anticipate,” “believe,” “estimate,” “plan,” “project,” “could,” “should,” “would,” “continue,” “seek,” “target,” “guidance,” “outlook,” “if current trends continue,” “optimistic,” “forecast” and other similar words. Such statements include, but are not limited to, statements about the company’s plans, objectives, expectations, intentions, estimates and strategies for the future, and other statements that are not historical facts. These forward-looking statements are based on the company’s current objectives, beliefs and expectations, and they are subject to significant risks and uncertainties that may cause actual results and financial position and timing of certain events to differ materially from the information in the forward-looking statements. These risks and uncertainties include, but are not limited to, those set forth in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 (especially in Part I, Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations, and Part II, Item 1A. Risk Factors), and other risks and uncertainties listed from time to time in the company’s other filings with the Securities and Exchange Commission. There may be other factors of which the company is not currently aware that may affect matters discussed in the forward-looking statements and may also cause actual results to differ materially from those discussed. The company does not assume any obligation to publicly update or supplement any forward-looking statement to reflect actual results, changes in assumptions or changes in other factors affecting these forward-looking statements other than as required by law. Any forward-looking statements speak only as of the date hereof or as of the dates indicated in the statement."
    },
    {
        "title": "BCD Travel becomes first travel management company to issue UATP",
        "subtitle": "",
        "date": "Oct 24, 2019 8:00AM EDT",
        "content": "ATLANTA and WASHINGTON, Oct. 24, 2019 /PRNewswire/ -- BCD Travel has become the first travel management company to issue UATP accounts. BCD will launch the payment program internally with a test group before making it available to all clients as early as Q1 2020.UATP represents an innovative approach to travel payment, offering a focused payment and settlement process with hospitality industry players and touchpoints. Travelers can also use the cards for virtual payment solutions to book hotels.  \"At BCD Travel we're continually looking to innovate in technology, business models, processes and corporate culture,\" said Cees Batenburg, BCD Travel Global Chief Financial Officer. \"Becoming the first TMC to issue UATP accounts is part of our broader effort to bring innovation to travel payment to improve both the traveler and travel buyer experience.\"\"The TMC Issuer Program was a next logical step in UATP's growth strategy, because TMCs are uniquely positioned to discuss form of payment with travel buyers,\" said Ralph Kaiser, president and CEO, UATP. \"We worked with BCD Travel as our first TMC Issuer based on their payment process expertise and technological maturity. We anticipate the program will result in greater spend volume, an increased number of Subscribers and more entrenched relationships with key travel agency partners.\"UATP payment is accepted by most of the world's airlines, several rail carriers, more than 30,000 ARC-accredited U.S. travel agency locations and 130,000 other agency locations around the globe.Under the new UATP program, BCD's clients will instruct the TMC through traveler profiles to use their UATP account when booking travel with relevant merchants. Similar to UATP's Airline Issuers, BCD will help manage their clients' UATP program and provide customer service. The program is currently available only to subscribers in the U.S.About BCD TravelBCD Travel helps companies make the most of what they spend on travel. We give travelers innovative tools that keep them safe and productive and help them make good choices on the road. We partner with travel and procurement leaders to simplify the complexities of business travel, drive savings and satisfaction, and move whole companies toward their goals. In short, we help our clients travel smart and achieve more. We make this happen in 109 countries with almost 13,800 creative, committed and experienced people. And it's how we maintain the industry's most consistent client retention rate, with 2018 sales of US$27.1 billion. For more information, visit www.bcdtravel.com.About BCD GroupBCD Group is a market leader in the travel industry. The privately-owned company was founded in 1975 by John Fentener van Vlissingen and consists of BCD Travel (global corporate travel management), BCD Meetings & Events (global meetings and events agency), Travix (online travel: CheapTickets, Vliegwinkel, BudgetAir, Flugladen and Vayama), Park 'N Fly (off-airport parking) and Airtrade (consolidation and fulfillment). BCD Group employs over 14,900 people and operates in 109 countries with total sales of US$29.8 billion in 2018, including US$10.7 billion partner sales. For more information, visit www.bcdgroup.com.About UATPUATP is a global payment solution owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP connects airlines to Alternative Forms of Payment which can expand reach and generate incremental sales globally. UATP offers easy-to-use data tools, DataStream℠ and DataMine℠, which provide comprehensive account details to Issuers and Corporate Subscribers for accurate travel management. Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE:AC); Air New Zealand (ANZFF.PK); Air Niugini; Air Serbia; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines;  Sichuan Airlines; Southwest Airlines; Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NYSE: UAL) and WestJet. AirPlus International issues the UATP-based Company Account for Lufthansa German Airlines. View original content:http://www.prnewswire.com/news-releases/bcd-travel-becomes-first-travel-management-company-to-issue-uatp-300944624.htmlSOURCE  UATP"
    },
    {
        "title": "American Airlines Group Reports Third-Quarter 2019 Profit",
        "subtitle": "",
        "date": "Oct 24, 2019 7:30AM EDT",
        "content": "FORT WORTH, Texas, Oct.  24, 2019  (GLOBE NEWSWIRE) -- American Airlines Group Inc. (NASDAQ: AAL) today reported its third-quarter 2019 results, including these highlights:“We are pleased to report an earnings increase of 15% and earnings per share growth of 20% for the third quarter, excluding net special items,” said Chairman and CEO Doug Parker. “However, we know that our results should have been better. Our third quarter was impacted by the continued grounding of the Boeing 737 MAX and the operational challenges resulting from ongoing labor contract negotiations. These challenges affected our customers, our shareholders and our team members, who we thank for their hard work and perseverance.”“We are taking decisive action to correct this performance and are excited about our prospects for 2020 and beyond. As we look forward, we are committed to restoring operational excellence, growing efficiently and profitably, and generating significant free cash flow for our investors.”Third-Quarter Revenue and ExpensesPre-tax earnings excluding net special items for the third quarter of 2019 were $835 million, a 16% year-over-year increase from the third quarter of 2018. Excluding net special items, net income was $630 million, or $1.42 per diluted share.Strong passenger demand drove a 3% year-over-year increase in third-quarter 2019 total revenue to a record $11.9 billion. Driven by a 3 percentage point increase in total passenger load factor, passenger revenue per available seat mile (PRASM) grew 3% to a record 14.50 cents. Cargo revenue decreased 20% to $208 million due primarily to a 17% decrease in cargo ton miles. Other revenue was down 4% to $708 million. Third-quarter 2019 TRASM increased by 2% year over year to a record 15.71 cents on a 1% increase in total available seat miles, marking the 12th consecutive quarter of growth.Total third-quarter 2019 operating expenses were $11.1 billion, up 2% year over year. Total operating cost per available seat mile (CASM) was 14.64 cents in the third quarter of 2019, up 1% from the third quarter of 2018. Excluding fuel and net special items, third-quarter 2019 CASM was 11.07 cents, up 5% year over year due primarily to higher salaries and benefits, maintenance and regional expense, and lower than planned capacity.DFW 900Earlier this summer, American embarked on a network expansion project by adding approximately 100 daily departures at its largest hub, Dallas Fort Worth International Airport (DFW). The results have surpassed initial expectations, and, in the third quarter, the company grew domestic capacity at DFW by 9% and produced PRASM growth of 3.5% compared to 2018. This is the largest expansion of capacity at any hub in the U.S. in more than a decade and sets a positive precedent for American’s planned expansions next year at Charlotte Douglas International Airport and Ronald Reagan Washington National Airport in 2021.Fleet UpdateOn March 13, a directive from the Federal Aviation Administration (FAA) grounded all U.S.-registered Boeing 737 MAX aircraft. The American fleet currently includes 24 MAX aircraft with an additional 76 aircraft on order, of which five were scheduled to be delivered in the third quarter. As a result of this directive, American canceled 9,475 flights in the third quarter of 2019. The company estimates that the cancellations in the third quarter negatively impacted pre-tax income by approximately $140 million.The company has removed all MAX flying from its flight schedule through Jan. 15, 2020. With the flight cancellations extending through the remainder of 2019, the company now expects the MAX cancellations will negatively impact its full-year 2019 pre-tax income by approximately $540 million.OperationsAmerican has seen recent improvement in key operational metrics, including on-time departures and arrivals. The company’s on-time performance in September was its best performance in almost two years, and this improvement has continued into October.American Airlines President Robert Isom said, “We continue to strengthen our operations with ongoing enhancements, including retiring older aircraft, simplifying our fleet and schedule, and fortifying our maintenance and airport resources. Our underlying execution is solid, and we are committed to returning American to a position of operational excellence.”Share Repurchases and DividendsAmerican returned $200 million to shareholders through the repurchase of 7.3 million shares and also paid $44 million in dividends in the third quarter. The company has approximately $850 million remaining of its existing $2 billion share repurchase authorization2. In aggregate, American has returned more than $13 billion to shareholders over the past five years through share repurchases and dividends.American also declared a dividend of 10 cents per share to be paid Nov. 20 to stockholders of record as of Nov. 6, 2019.Guidance and Investor UpdateAmerican expects its fourth-quarter 2019 TRASM to be flat to up 2% year over year. The company also expects its fourth-quarter 2019 pre-tax margin excluding net special items to be between 5% and 7%3. Based on today’s guidance, American expects its 2019 diluted earnings per share excluding net special items to be between $4.50 and $5.503.For additional financial forecasting detail, please refer to the company’s investor update, filed with this release with the SEC on Form 8-K. This filing will be available at aa.com/investorrelations.Conference Call/Webcast DetailsThe company will conduct a live audio webcast of its earnings call today at 7:30 a.m. CT, which will be available to the public on a listen-only basis at aa.com/investorrelations. An archive of the webcast will be available on the website through Nov. 24.NotesSee the accompanying notes in the Financial Tables section of this press release for further explanation, including a reconciliation of all GAAP to non-GAAP financial information.About American Airlines GroupAmerican Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life’s journey, American’s 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company’s stock is included in the S&P 500. Learn more about what’s happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Cautionary Statement Regarding Forward-Looking Statements and InformationCertain of the statements contained in this report should be considered forward-looking statements within the meaning of the Securities Act of 1933, as amended (the Securities Act), the Securities Exchange Act of 1934, as amended (the Exchange Act), and the Private Securities Litigation Reform Act of 1995. These forward-looking statements may be identified by words such as “may,” “will,” “expect,” “intend,” “anticipate,” “believe,” “estimate,” “plan,” “project,” “could,” “should,” “would,” “continue,” “seek,” “target,” “guidance,” “outlook,” “if current trends continue,” “optimistic,” “forecast” and other similar words. Such statements include, but are not limited to, statements about the company’s plans, objectives, expectations, intentions, estimates and strategies for the future, and other statements that are not historical facts. These forward-looking statements are based on the company’s current objectives, beliefs and expectations, and they are subject to significant risks and uncertainties that may cause actual results and financial position and timing of certain events to differ materially from the information in the forward-looking statements. These risks and uncertainties include, but are not limited to, those set forth in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 (especially in Part I, Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations, and Part II, Item 1A. Risk Factors), and other risks and uncertainties listed from time to time in the company’s other filings with the Securities and Exchange Commission. There may be other factors of which the company is not currently aware that may affect matters discussed in the forward-looking statements and may also cause actual results to differ materially from those discussed. The company does not assume any obligation to publicly update or supplement any forward-looking statement to reflect actual results, changes in assumptions or changes in other factors affecting these forward-looking statements other than as required by law. Any forward-looking statements speak only as of the date hereof or as of the dates indicated in the statement."
    },
    {
        "title": "UATP Announces 2019 Third Quarter Results",
        "subtitle": "The results illustrate UATP's continuous quarter over quarter growth",
        "date": "Oct 17, 2019 9:49AM EDT",
        "content": "WASHINGTON, Oct. 17, 2019 /PRNewswire/ -- UATP, the airline-owned payment network, announced today its third quarter financial results. \"UATP's growth continues to impress our Network members as the year progresses; we have had another very strong quarter,\" said Ralph Kaiser, president and CEO, UATP.UATP's Transaction Count increased 14% year-over-year, a 2% growth from second quarter. The Average Transaction Value reduced 11%; however, the overall Network Charge Volume grew 2%, an additional 1% from the previous quarter. \"We are thrilled with our growing Alternative Payment Processing business which has grown 19% year-over-year, an increase of 5% from the previous quarter,\" Kaiser continued. \"These achievements are the result of UATP's hardworking employees and incredible partnerships. We expect 2019 to be another stellar year for UATP.\" For more information, visit UATP.com.ABOUT UATPUATP is a global payment solution owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP connects airlines to Alternative Forms of Payment which can expand reach and generate incremental sales globally. UATP offers easy-to-use data tools, DataStream℠ and DataMine℠, which provide comprehensive account details to Issuers and Corporate Subscribers for accurate travel management.Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE:AC) Air New Zealand (ANZFF.PK); Air Niugini; Air Serbia; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines; Sichuan Airlines; Southwest Airlines; Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NASDAQ: UAL) and WestJet.AirPlus International issues the UATP-based Company Account for Lufthansa German Airlines.Contact: UATP Corporate Communications Wendy Ward, wward@uatp.com +1 202 774 5017 View original content to download multimedia:http://www.prnewswire.com/news-releases/uatp-announces-2019-third-quarter-results-300940583.htmlSOURCE  UATP"
    },
    {
        "title": "Travelers Across Asia Award American Top Honors Among North American Airlines",
        "subtitle": "",
        "date": "Oct 15, 2019 12:22PM EDT",
        "content": "FORT WORTH, Texas and SINGAPORE, Oct.  15, 2019  (GLOBE NEWSWIRE) -- Customers named American Best Airline — North America through the Travel Weekly Asia 2019 Readers’ Choice Awards in an award ceremony held today in Singapore. This distinction follows closely behind multiple industry awards recognizing the company’s heightened customer experience, which results from significant investments into the business over the last six years.Travel Weekly Asia voters, which comprises the publication’s nearly 40,000 subscribers and 90,000 eNewsletter readers, recognized American for customer service, product and punctuality in the region.“We’re proud to award American Airlines Best Airline — North America for pushing boundaries in the pursuit of excellence,” said Irene Chua, Vice President and Group Publisher, Asia, for Northstar Travel Group. “The airline’s commitment to delivering a great passenger experience sets an inspiring example for the industry and has earned the respect from both its customers and peers.”The airline also received its second distinction in 2019 from the American Society of Travel Advisors (ASTA), one of the leading global advocates for travel advisors, the travel industry and the traveling public. ASTA awarded American both the ASTA 2019 Small Business Network Airline Award for the small business category, and the Airline of the Year distinction in the individual supplier category. Awards were given to companies that best support the advisor community, as voted on by the ASTA membership. The awards recognize individuals and organizations making meaningful contributions to the industry.“We’re pleased to recognize American Airlines for the company’s exemplary service to customers,” said Zane Kerby, President and Chief Executive Officer for ASTA. “Our travel advisors voted to determine the recipients of this year’s awards, and American Airlines was a clear choice for their commitment and dedication to the traveling public and the travel advisors who serve them.”American also won gold and silver distinctions in this year's Travel Weekly Magellan Awards, taking home more than any other carrier in the Airlines and Airports category. The awards honor outstanding companies in the travel and hospitality industry, and American received the following six distinctions:Gold AwardsSilver Awards  “These distinctions affirm that we are well on our way to being the easiest airline to do business with,” said Alison Taylor, Senior Vice President of Global Sales and Distribution at American. “We’re honored to be recognized by travel advisors and customers for our devotion to providing a world-class experience on the ground and in the air. I congratulate the teams led by Director of Leisure and Specialty Channel Sales Louis de Joux and Managing Director of Asia Pacific Sales Shane Hodges who’ve worked tirelessly to help us strengthen our business.”In addition, American was also ranked Best Overall Vacation Experience by Apple Vacations. The airline previously announced recognition as Best North American Airline in Asia Pacific for the second year in a row by Business Traveller Asia-Pacific and Five Star Global Airline by the Airline Passenger Experience Association (APEX).About American Airlines Group American Airlines and American Eagle offer an average of nearly 6,700 flights per day to nearly 350 destinations in more than 50 countries. American has hubs in Charlotte, Chicago, Dallas/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. American is a founding member of the oneworld® alliance, whose members serve more than 1,000 destinations with about 14,250 daily flights to over 150 countries. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL. In 2015, its stock joined the S&P 500 index. Connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Corporate Communications817-967-1577mediarelations@aa.com"
    },
    {
        "title": "UATP Partners With EBANX To Address Growing Latin American Market Payment Needs",
        "subtitle": "Latin America has benefited from continuous growth since 2017",
        "date": "Oct 10, 2019 12:50PM EDT",
        "content": "WASHINGTON, Oct. 10, 2019 /PRNewswire/ -- UATP is pleased to partner with online payment provider, EBANX, to connect airline Merchants to Latin America. \"Through this partnership, EBANX will work closely with UATP to provide demand-driven payment solutions to airlines that have routes in Latin America,\" said Matthew Nutting, Head of Travel, EBANX. \"We offer more than 100 local payment options in 8 countries that will now be available to UATP's Merchant airlines.\"EBANX offers a fully localized payment solution that connects directly between more than 50 banks and processors. Airlines will have the ability to collect locally and settle globally with unified reconciliations for all countries. \"Latin America is a highly sought-after region that is forecasted to grow 2.4% by 2020,\" said Rachel Morowitz, Vice President Alternative Forms of Payment, UATP. \"EBANX is a leader in this region, making them an ideal partner to work with. This partnership will benefit our member airlines by giving their travelers access to their preferred local payment in Latin America.\"For more information, visit UATP.com.ABOUT UATPUATP is a global payment solution owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP connects airlines to Alternative Forms of Payment which can expand reach and generate incremental sales globally. UATP offers easy-to-use data tools, DataStream℠ and DataMine℠, which provide comprehensive account details to Issuers and Corporate Subscribers for accurate travel management.Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE:AC) Air New Zealand (ANZFF.PK); Air Niugini; Air Serbia; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines; Sichuan Airlines; Southwest Airlines; Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NASDAQ: UAL) and WestJet.AirPlus International issues the UATP-based Company Account for Lufthansa German Airlines.About EBANXEBANX is a leading global fintech company with Latin American DNA. It has operations in Brazil, Mexico, Argentina, Colombia, Chile, Peru, Ecuador, and Bolivia, and offices in Brazil, Mexico, Uruguay, United States, and the United Kingdom. EBANX was founded in 2012 to bridge the access gap between Latin Americans and international websites, by offering an end-to-end payment solution across the entire cross-border ecommerce transaction flow, providing over 100 Latin American local payment options to global merchants eager to expand throughout the region. The company has already helped over 50 million Latin Americans access global services and products with over 1,000 merchants expand to Latin America. AliExpress, Pipedrive, Airbnb, and Spotify (these two in a partnership with Worldline) are some of the companies that use EBANX solutions. For more information, please visit https://business.ebanx.com/en/press-room.Contact: UATP Corporate Communications Wendy Ward, wward@uatp.com +1 202 774 5017  View original content to download multimedia:http://www.prnewswire.com/news-releases/uatp-partners-with-ebanx-to-address-growing-latin-american-market-payment-needs-300936676.htmlSOURCE  UATP"
    },
    {
        "title": "Kerry Philipovitch Announces Retirement; American Airlines Realigns Operations and Commercial Leadership Teams",
        "subtitle": "",
        "date": "Oct 10, 2019 11:30AM EDT",
        "content": "FORT WORTH, Texas, Oct.  10, 2019  (GLOBE NEWSWIRE) -- American Airlines announced today that Kerry Philipovitch, Senior Vice President of Customer Experience, will retire from the airline at the end of 2019. Philipovitch’s retirement is part of a long-planned personal desire to move into a new phase of her life and the airline has been preparing for this day for some time.“Kerry is one of the very best leaders I have had the privilege of working with,” said American Airlines President Robert Isom. “She is a great advisor, consummate team player and champion of those we serve inside and outside the company. She led the industry’s largest reservations system cutover and has been at the helm of numerous efficiency projects critical to our integration. American is far better because of Kerry’s contributions, including her work to promote passengers’ rights, support our diversity and inclusion initiatives, and launch innovative customer service training for team members. We will miss her, but Kerry has more than earned the right to do what is best for her and her family. Thankfully she has trained a stellar group of leaders who will carry on her legacy to drive operational excellence with the utmost care for our team.”Philipovitch began her aviation career in 1996 as a pricing analyst at Northwest Airlines before joining US Airways and later American. She has held leadership roles in Revenue Management, Network and Schedule Planning, Airport Customer Service and Reservations. At American, Philipovitch has overseen all aspects of the customer experience, including Airport Operations, Customer Planning, Flight Service, Reservations, Premium Services, Service Recovery and Cargo. Philipovitch will remain with the airline through the end of the year to assist with the transition.Operations and Commercial RealignmentWith this announcement, American is realigning its Operations and Commercial teams around four key pillars of the business: Operations, Network Strategy, Revenue and Customer Experience. The following four leaders will assume responsibility for these teams and each individual will report to Isom:“This is an opportunity to sharpen our focus on the key parts of our airline: running a reliable operation, expanding the world’s best network, maximizing all aspects of revenue to ensure American thrives forever, and delivering a superior customer journey as we create a world-class customer experience,” continued Isom. “This restructure puts innovative and extremely capable leaders at the forefront of these initiatives.”OperationsDavid Seymour will expand his responsibilities and assume leadership for all of American’s operations, furthered by two key changes to his organization. Jim Butler has been named Senior Vice President of Airport Operations and Cargo. Butler previously led the airline’s International Airport Operations and Cargo teams and will now assume responsibility for the airline’s domestic airports.In addition, Devon May has been named to the new role of Senior Vice President of American Eagle and Operations Planning. May will have responsibility for American’s regional operation and will lead the airline’s operations planning teams.Both Butler and May will report to Seymour. Kevin Brickner, Senior Vice President of Technical Operations; Kimball Stone, Senior Vice President of Flight and Integrated Operations Center and Ron Thomas, Vice President of Safety, will continue reporting to Seymour. Together this group will move past American’s integration milestones and work to optimize the airline’s operational excellence.Network StrategyVasu Raja is being promoted to Senior Vice President of Network Strategy. In this role, he will retain his responsibilities for American’s global network and will assume oversight of alliances and partnerships. Joe Mohan, Vice President of Alliances and Partnerships, will now report to Raja. This team will focus on maximizing the efficiencies of American’s current network and partnership structure, while ensuring American continues to provide customers with the industry’s preeminent network.RevenueDon Casey will lead the team responsible for the airline’s revenue. Jim Fox, Vice President of Pricing & Yield Management, will continue reporting to Casey. Casey’s oversight will expand to include the sales and distributions teams, working closely with Alison Taylor, Senior Vice President of Global Sales & Distribution, who will now report to Casey. This new structure will facilitate improved long-term customer partnerships and agility in responding to the ever-changing market needs of American’s customers. Combining these two best-in-class revenue organizations will also ensure revenue outperformance and faster speed to market and delivery of the airline’s revenue initiatives.Customer ExperienceKurt Stache will assume responsibility for the many touchpoints along the customer journey. As part of this new structure, Jill Surdek is being promoted to Senior Vice President of Flight Service. Surdek served as Vice President of Flight Service for the past three years, and over that time, managed one of the airline’s largest integration projects to bring all 28,000 flight attendants onto one operational platform. With this project’s successful completion, Surdek will now play a key role in leading the airline’s customer experience strategy.Additionally, Alice Curry, Vice President of Customer Care, and her team will move to this group. Surdek and Curry join Janelle Anderson, Vice President of Global Marketing; Bridget Blaise-Shamai, Vice President of Customer Loyalty and Insights and John Gustafson, Vice President of Digital Customer Experience, in reporting to Stache. Together this team will focus on creating a seamless customer journey and improving guests’ likelihood to recommend American.Operations and Commercial Leadership TeamIsom’s leadership team will include his four direct reports of David Seymour, Vasu Raja, Don Casey and Kurt Stache, as well as Alison Taylor and Devon May. This team will bring the necessary visibility and accountability to the efforts and initiatives needed to excel in operations, revenue, network and customer experience.“American’s team members are what set us apart,” concluded Isom. “They’re the difference between just a flight and an experience. Our job is to give them the tools to care for customers on their journeys with us, and we know with this superb group of six leaders at the helm, we will deliver.”David Seymour has more than 20 years of major airline operations experience at America West, US Airways and American. He holds a bachelor’s degree from the U.S. Military Academy and a Master of Management degree from Northwestern University. Seymour is an Army Ranger School graduate and served as an officer in the Army’s 82nd Airborne Division. He serves as a director of the Congressional Medal of Honor Foundation.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/22f58567-90e2-4b2a-8f66-0034308c6cc3Vasu Raja has been with American for 15 years and has worked in Sales, Corporate Planning, Revenue Management and Network Planning and Analysis. He holds a bachelor’s degree from The University of Texas at Austin, a master’s degree in teaching from Johns Hopkins University and an MBA from Georgetown University. Raja began his career with Teach for America in 1999, and was named one of the Top 50 Executives under 50 by Diversity MBA Magazine in 2013.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/381c1bcc-e082-4763-b55d-27e2b76bacc4Don Casey joined American in 2000 after leading Planning at Canadian Airlines. He has overseen American’s Revenue Management activity since 2009 and helped develop the airline’s bilateral alliance relationships. Casey holds a bachelor’s degree from the University of Alberta and a Master of Science in Business Administration from the University of British Columbia. He is the recipient of Aviation Week & Space Technology’s Laurels Award for outstanding contributions to the field of commercial transportation.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/dbc2897b-4fc9-49a1-8fa8-ef76d2636030Kurt Stache has 24 years of airline management experience at American, including leadership positions in AAdvantage Marketing, Global Sales, International, and Strategic Alliances. Most recently he has overseen the airline’s marketing strategy and implementation across all channels, as well as the company’s loyalty, digital and sales organizations. Stache holds a bachelor’s degree from Santa Clara University and an MBA from Harvard Business School. A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/9f4a4265-bf81-48a9-9080-0849ece4a976Devon May has nearly 20 years of airline experience in finance, commercial and operational roles. Since 2017, he has overseen American’s regional operations along with Network Planning and Alliances. Previously he served in leadership positions at American and US Airways in Finance and Network Planning. May holds a bachelor’s degree from the University of Lethbridge in Alberta, Canada, and an MBA from Embry-Riddle Aeronautical University in Daytona Beach.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/88e75505-4161-48fe-aaaf-89cabc23de99Alison Taylor leads American’s Global Sales team and is responsible for developing all sales and distribution policies worldwide, as well as managing the airline’s relationships with corporate, agent and group customers. Prior to joining American, she held a similar role at Starwood Hotels & Resorts Worldwide. Taylor has lived and worked in nine countries, including more than 20 years in Asia, and is a board member of both the Association of Corporate Travel Executives and Women In Travel by GBTA. She holds a bachelor’s of business degree from Victoria University in Melbourne, Australia.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/789274a5-367b-4d81-9171-e19de39f3335About American Airlines Group American Airlines offers customers 6,800 daily flights to more than 365 destinations in 61 countries from its hubs in Charlotte, Chicago, Dallas-Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix and Washington, D.C. With a shared purpose of caring for people on life’s journey, American’s 130,000 global team members serve more than 200 million customers annually. Since 2013, American has invested more than $28 billion in its product and people and now flies the youngest fleet among U.S. network carriers, equipped with industry-leading high-speed Wi-Fi, lie-flat seats, and more inflight entertainment and access to power. American also has enhanced food and beverage options in the air and on the ground in its world-class Admirals Club and Flagship lounges. American was recently named a Five Star Global Airline by the Airline Passenger Experience Association and Airline of the Year by Air Transport World. American is a founding member of oneworld®, whose members serve 1,100 destinations in 180 countries and territories. Shares of American Airlines Group Inc. trade on Nasdaq under the ticker symbol AAL and the company’s stock is included in the S&P 500. Learn more about what’s happening at American by visiting news.aa.com and connect with American on Twitter @AmericanAir and at Facebook.com/AmericanAirlines.Corporate Communications817- 967- 1577mediarelations@aa.com"
    },
    {
        "title": "UATP Appoints David Jimenez As New Chief Commercial Officer",
        "subtitle": "Jimenez is a proven payments expert with a passion for driving a winning culture",
        "date": "Oct 8, 2019 10:58AM EDT",
        "content": "WASHINGTON, Oct. 8, 2019 /PRNewswire/ -- UATP is pleased to welcome David Jimenez as Chief Commercial Officer. Jimenez brings over 20 years of commercial experience that will help UATP continue to thrive. \"Airlines today are looking for a payment partner who can help them navigate the payment options globally\", says David Jimenez, Chief Commercial Officer, UATP. \"UATP has both the reach and experience to deliver on that promise. I look forward to being an integral part of this growing Network.\"Jimenez's career spans 25 years in Commercial Development and Sales Leadership with Chase Paymentech, Ingenico & CenPOS. Jimenez effectively led the global sales team of Ingenico ePayments and was a member of the Executive Committee that successfully headed the transaction of GlobalCollect to Ingenico. Prior to Payments, Jimenez worked at MCI Worldcom and Global Crossing applying technology and communications to the Financial Services sector. \"We are pleased to be strengthening our leadership team with the addition of David Jimenez,\" said Ralph Kaiser, president and CEO, UATP. \"He has proven expertise in leading sales teams and growing businesses and associated revenue. I am confident that he will be a strong addition to our robust team by helping to pursue UATP's strategic plan and future growth.\"For more information, visit UATP.com.ABOUT UATPUATP is a global payment solution owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP connects airlines to Alternative Forms of Payment which can expand reach and generate incremental sales globally. UATP offers easy-to-use data tools, DataStream℠ and DataMine℠, which provide comprehensive account details to Issuers and Corporate Subscribers for accurate travel management.Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE:AC) Air New Zealand (ANZFF.PK); Air Niugini; Air Serbia; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines; Sichuan Airlines; Southwest Airlines; Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NYSE: UAL) and WestJet.AirPlus International issues the UATP-based Company Account for Lufthansa German Airlines.Contact:UATP Corporate CommunicationsWendy Ward, wward@uatp.com +1 202-250-4665 View original content to download multimedia:http://www.prnewswire.com/news-releases/uatp-appoints-david-jimenez-as-new-chief-commercial-officer-300933986.htmlSOURCE  UATP"
    }
]