[
    {
        "title": "Investor Update on Quarterly Guidance",
        "subtitle": "",
        "date": "Feb 17, 2020 4:00PM EST",
        "content": "    CUPERTINO, Calif.--(BUSINESS WIRE)--\nAs the public health response to COVID-19 continues, our thoughts remain with the communities and individuals most deeply affected by the disease, and with those working around the clock to contain its spread and to treat the ill. Apple® is more than doubling our previously announced donation to support this historic public health effort.\n\nOur quarterly guidance issued on January 28, 2020 reflected the best information available at the time as well as our best estimates about the pace of return to work following the end of the extended Chinese New Year holiday on February 10. Work is starting to resume around the country, but we are experiencing a slower return to normal conditions than we had anticipated. As a result, we do not expect to meet the revenue guidance we provided for the March quarter due to two main factors.\n\nThe first is that worldwide iPhone® supply will be temporarily constrained. While our iPhone manufacturing partner sites are located outside the Hubei province — and while all of these facilities have reopened — they are ramping up more slowly than we had anticipated. The health and well-being of every person who helps make these products possible is our paramount priority, and we are working in close consultation with our suppliers and public health experts as this ramp continues. These iPhone supply shortages will temporarily affect revenues worldwide.\n\nThe second is that demand for our products within China has been affected. All of our stores in China and many of our partner stores have been closed. Additionally, stores that are open have been operating at reduced hours and with very low customer traffic. We are gradually reopening our retail stores and will continue to do so as steadily and safely as we can. Our corporate offices and contact centers in China are open, and our online stores have remained open throughout.\n\nOutside of China, customer demand across our product and service categories has been strong to date and in line with our expectations.\n\nThe situation is evolving, and we will provide more information during our next earnings call in April. Apple is fundamentally strong, and this disruption to our business is only temporary. Our first priority — now and always — is the health and safety of our employees, supply chain partners, customers and the communities in which we operate. Our profound gratitude is with those on the front lines of confronting this public health emergency.\n\nThis update contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about the Company’s expected future financial results. These statements involve risks and uncertainties, and actual results may differ. Risks and uncertainties include without limitation: the effect of global and regional economic conditions on the Company’s business, including effects on purchasing decisions by consumers and businesses; the ability of the Company to compete in markets that are highly competitive and subject to rapid technological change; the ability of the Company to manage frequent introductions and transitions of products and services, including delivering to the marketplace, and stimulating customer demand for, new products, services and technological innovations on a timely basis; the effect that shifts in the mix of products and services and in the geographic, currency or channel mix, component cost increases, increases in the cost of acquiring and delivering content for the Company’s services, price competition, or the introduction of new products or services, including new products or services with higher cost structures, could have on the Company’s gross margin; the dependency of the Company on the performance of distributors of the Company’s products, including cellular network carriers and other resellers; the risk of write-downs on the value of inventory and other assets and purchase commitment cancellation risk; the continued availability on acceptable terms, or at all, of certain components, services and new technologies essential to the Company’s business, including components and technologies that may only be available from single or limited sources; the dependency of the Company on manufacturing and logistics services provided by third parties, many of which are located outside of the US and which may affect the quality, quantity or cost of products manufactured or services rendered to the Company; the effect of product and services design and manufacturing defects on the Company’s financial performance and reputation; the dependency of the Company on third-party intellectual property and digital content, which may not be available to the Company on commercially reasonable terms or at all; the dependency of the Company on support from third-party software developers to develop and maintain software applications and services for the Company’s products; the impact of unfavorable legal proceedings, such as a potential finding that the Company has infringed on the intellectual property rights of others; the impact of complex and changing laws and regulations worldwide, which expose the Company to potential liabilities, increased costs and other adverse effects on the Company’s business; the ability of the Company to manage risks associated with the Company’s retail stores; the ability of the Company to manage risks associated with the Company’s investments in new business strategies and acquisitions; the impact on the Company’s business and reputation from information technology system failures, network disruptions or losses or unauthorized access to, or release of, confidential information; the ability of the Company to comply with laws and regulations regarding data protection; the continued service and availability of key executives and employees; political events, international trade disputes, war, terrorism, natural disasters, public health issues, including the outbreak of COVID-19, and other business interruptions that could disrupt supply or delivery of, or demand for, the Company’s products; financial risks, including risks relating to currency fluctuations, credit risks and fluctuations in the market value of the Company’s investment portfolio; and changes in tax rates and exposure to additional tax liabilities. More information on these risks and other potential factors that could affect the Company’s financial results is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to further update its guidance for the second quarter ending March 28, 2020, or any other forward-looking statements or information, which speak as of their respective dates.\n\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s four software platforms — iOS, macOS, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042.\n\n© 2020 Apple Inc. All rights reserved. Apple, the Apple logo and iPhone are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200217005467/en/\nApple\nPress Contact:\nKristin Huguet Quayle, (408) 974-2414\nkhuguet@apple.com\n\nInvestor Relations Contact:\nTejas Gala, (669) 227-2402\ntgala@apple.com \nSource: Apple Inc."
    },
    {
        "title": "Apple Reports Record First Quarter Results",
        "subtitle": "",
        "date": "Jan 28, 2020 4:30PM EST",
        "content": "\niPhone, Wearables & Services Drive All-Time Record Revenue and Earnings\n    CUPERTINO, Calif.--(BUSINESS WIRE)--\nApple® today announced financial results for its fiscal 2020 first quarter ended December 28, 2019. The Company posted quarterly revenue of $91.8 billion, an increase of 9 percent from the year-ago quarter and an all-time record, and quarterly earnings per diluted share of $4.99, up 19 percent, also an all-time record. International sales accounted for 61 percent of the quarter’s revenue.\n\n“We are thrilled to report Apple’s highest quarterly revenue ever, fueled by strong demand for our iPhone 11 and iPhone 11 Pro models, and all-time records for Services and Wearables,” said Tim Cook, Apple’s CEO. “During the holiday quarter our active installed base of devices grew in each of our geographic segments and has now reached over 1.5 billion. We see this as a powerful testament to the satisfaction, engagement and loyalty of our customers — and a great driver of our growth across the board.”\n\n“Our very strong business performance drove an all-time net income record of $22.2 billion and generated operating cash flow of $30.5 billion,” said Luca Maestri, Apple’s CFO. “We also returned nearly $25 billion to shareholders during the quarter, including $20 billion in share repurchases and $3.5 billion in dividends and equivalents, as we maintain our target of reaching a net cash neutral position over time.”\n\nApple is providing the following guidance for its fiscal 2020 second quarter:\n\n• revenue between $63.0 billion and $67.0 billion\n• gross margin between 38.0 percent and 39.0 percent\n• operating expenses between $9.6 billion and $9.7 billion\n• other income/(expense) of $250 million\n• tax rate of approximately 16.5 percent\n\nApple’s board of directors has declared a cash dividend of $0.77 per share of the Company’s common stock. The dividend is payable on February 13, 2020 to shareholders of record as of the close of business on February 10, 2020.\n\nApple will provide live streaming of its Q1 2020 financial results conference call beginning at 2:00 p.m. PT on January 28, 2020 at www.apple.com/investor/earnings-call/. This webcast will also be available for replay for approximately two weeks thereafter.\n\nApple periodically provides information for investors on its corporate website, apple.com, and its investors relations website, investor.apple.com. This includes press releases and other information about financial performance, reports filed or furnished with the SEC, information on corporate governance and details related to its annual meeting of shareholders.\n\nThis press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation those about the Company’s estimated revenue, gross margin, operating expenses, other income/(expense), tax rate, and plans for return of capital. These statements involve risks and uncertainties, and actual results may differ. Risks and uncertainties include without limitation: the effect of global and regional economic conditions on the Company’s business, including effects on purchasing decisions by consumers and businesses; the ability of the Company to compete in markets that are highly competitive and subject to rapid technological change; the ability of the Company to manage frequent introductions and transitions of products and services, including delivering to the marketplace, and stimulating customer demand for, new products, services and technological innovations on a timely basis; the effect that shifts in the mix of products and services and in the geographic, currency or channel mix, component cost increases, increases in the cost of acquiring and delivering content for the Company’s services, price competition, or the introduction of new products or services, including new products or services with higher cost structures, could have on the Company’s gross margin; the dependency of the Company on the performance of distributors of the Company’s products, including cellular network carriers and other resellers; the risk of write-downs on the value of inventory and other assets and purchase commitment cancellation risk; the continued availability on acceptable terms, or at all, of certain components, services and new technologies essential to the Company’s business, including components and technologies that may only be available from single or limited sources; the dependency of the Company on manufacturing and logistics services provided by third parties, many of which are located outside of the US and which may affect the quality, quantity or cost of products manufactured or services rendered to the Company; the effect of product and services design and manufacturing defects on the Company’s financial performance and reputation; the dependency of the Company on third-party intellectual property and digital content, which may not be available to the Company on commercially reasonable terms or at all; the dependency of the Company on support from third-party software developers to develop and maintain software applications and services for the Company’s products; the impact of unfavorable legal proceedings, such as a potential finding that the Company has infringed on the intellectual property rights of others; the impact of complex and changing laws and regulations worldwide, which expose the Company to potential liabilities, increased costs and other adverse effects on the Company’s business; the ability of the Company to manage risks associated with the Company’s retail stores; the ability of the Company to manage risks associated with the Company’s investments in new business strategies and acquisitions; the impact on the Company’s business and reputation from information technology system failures, network disruptions or losses or unauthorized access to, or release of, confidential information; the ability of the Company to comply with laws and regulations regarding data protection; the continued service and availability of key executives and employees; political events, international trade disputes, war, terrorism, natural disasters, public health issues, and other business interruptions that could disrupt supply or delivery of, or demand for, the Company’s products; financial risks, including risks relating to currency fluctuations, credit risks and fluctuations in the market value of the Company’s investment portfolio; and changes in tax rates and exposure to additional tax liabilities. More information on these risks and other potential factors that could affect the Company’s financial results is included in the Company’s filings with the SEC, including in the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s most recently filed periodic reports on Form 10-K and Form 10-Q and subsequent filings. The Company assumes no obligation to update any forward-looking statements or information, which speak as of their respective dates.\n\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s four software platforms — iOS, macOS, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042.\n\n© 2020 Apple Inc. All rights reserved. Apple and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005823/en/\nApple\nPress Contact:\nKristin Huguet Quayle, (408) 974-2414\nkhuguet@apple.com \n\nInvestor Relations Contact:\nTejas Gala, (669) 227-2402\ntgala@apple.com \nSource: Apple Inc."
    },
    {
        "title": "Thinking about buying stock in Apple, Axsome Therapeutics, Crocs, Lululemon Athletica, or Tilray?",
        "subtitle": "",
        "date": "Jan 13, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 13, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, AXSM, CROX, LULU, and TLRY.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-axsome-therapeutics-crocs-lululemon-athletica-or-tilray-300985635.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Apple, Kohl's, Rite Aid, Square, or Wix.Com?",
        "subtitle": "",
        "date": "Jan 9, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 9, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, KSS, RAD, SQ, and WIX.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-kohls-rite-aid-square-or-wixcom-300984331.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Citigroup, Lockheed Martin, NVIDIA, or Roku?",
        "subtitle": "",
        "date": "Jan 6, 2020 9:31AM EST",
        "content": " NEW YORK, Jan. 6, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, C, LMT, NVDA, and ROKU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-citigroup-lockheed-martin-nvidia-or-roku-300981618.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Apple, Best Buy, Canopy Growth Corp, LYFT, or Oncolytics Biotech?",
        "subtitle": "",
        "date": "Dec 31, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 31, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BBY, CGC, LYFT, and ONCY.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-best-buy-canopy-growth-corp-lyft-or-oncolytics-biotech-300980136.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Amazon.com, Citigroup, FedEx, or Universal Display Corp?",
        "subtitle": "",
        "date": "Dec 27, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 27, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, AMZN, C, FDX, and OLED.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-amazoncom-citigroup-fedex-or-universal-display-corp-300979530.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Boeing, Mastercard, QUALCOMM, or Skyworks Solutions?",
        "subtitle": "",
        "date": "Dec 12, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 12, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BA, MA, QCOM, and SWKS.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-boeing-mastercard-qualcomm-or-skyworks-solutions-300974051.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Apple Makes History with Multiple Golden Globe Nominations for “The Morning Show”",
        "subtitle": "",
        "date": "Dec 9, 2019 1:21PM EST",
        "content": "\nApple TV+ Becomes First Streaming Service to Earn Nominations in its Launch Year\n    CUPERTINO, Calif.--(BUSINESS WIRE)--\nApple® today received its first-ever Golden Globe nominations from the Hollywood Foreign Press Association (HFPA), including Best Television Series, Drama, for Apple’s global hit “The Morning Show” and dual nominations for Best Performance by an Actress in a Television Series, Drama, for “The Morning Show” stars and executive producers Jennifer Aniston and Reese Witherspoon. The awards will be presented at the 77th Annual Golden Globe Awards on January 5, 2020.\n\nWith today’s nominations for “The Morning Show,\" Apple TV+ became the first streaming platform to receive recognition from the HFPA in its launch year, with the service launching only one month ago. These are also the first drama TV actress nominations for both Aniston and Witherspoon. Aniston is now only the fourth person in history to receive Golden Globe nominations for both TV Comedy and Drama, Lead Actress.\n\nThe multiple nominations received by Apple this morning include:\n\nBest TV Series - Drama - “The Morning Show”\nBest Performance by an Actress in a Television Series - Drama - Jennifer Aniston in “The Morning Show”\nBest Performance by an Actress in a Television Series - Drama - Reese Witherspoon in “The Morning Show”\n\n“Thank you to the Hollywood Foreign Press Association for today’s historic nominations,” said Zack Van Amburg, Apple’s head of Worldwide Video. “After the debut of Apple TV+ just last month, today’s nominations are a true testament to the powerful storytelling that went into ‘The Morning Show,’ as well as all of our Apple Originals.”\n\n“‘The Morning Show’ is resonating with audiences all around the world and today’s recognition from the Hollywood Foreign Press Association further reinforces how timely and special this series is,” said Jamie Erlicht, Apple’s head of Worldwide Video. “Congrats to Jennifer Aniston, Reese Witherspoon, Michael Ellenberg, Kerry Ehrin, Mimi Leder and the unparalleled cast and creative minds behind this project. We cannot wait to continue exploring the world of ‘The Morning Show’ into season two.”\n\n“I'm incredibly proud that the show was nominated, and it’s so rewarding to see the hard work and talent of Reese and Jen recognized,” said Kerry Ehrin, executive producer and showrunner of “The Morning Show.” “Mimi, Michael and I could not be more delighted and grateful to the HFPA for this honor, and to Apple for all their support.”\n\n“What a beautiful morning for ‘The Morning Show!’ Feeling grateful to be able to bring this story to light alongside a most brilliant group of artists — our cast and crew who worked passionately from their hearts and souls to continue the conversation of power, greed and toxicity in the workplace,” said Mimi Leder, director and executive producer of “The Morning Show.” “It is an important time, and a privilege, to be able to tell stories and create art that reflects the times we are living in. Thank you HFPA for this incredible honor and for also recognizing Jennifer and Reese. Working with them is a dream come true. Kerry, Michael and I are blown away!”\n\n“I am so grateful to the members of the Hollywood Foreign Press Association for recognizing ‘The Morning Show’ and Jennifer Aniston and Reese Witherspoon’s outstanding performances,” said Michael Ellenberg, executive producer of “The Morning Show.” “A huge thank you to Apple TV+ for their incredible partnership and the remarkable cast and crew, who I’m honored to share this nomination with.”\n\nCustomers can watch “The Morning Show” exclusively on Apple TV+ on the Apple TV® app, with new episodes premiering worldwide every Friday. The season finale premieres Friday, December 20.\n\n“The Morning Show” explores the cutthroat world of morning news and the lives of the people who help America wake up in the morning. Told through the lens of two complicated women working to navigate the minefield of high-octane jobs while facing crises in both their personal and professional lives, “The Morning Show” is an unapologetically candid drama that looks at the power dynamics between women and men, and women and women, in the workplace. The series is executive produced by Michael Ellenberg through Media Res, which also serves as the studio, along with Jennifer Aniston and Kristin Hahn through Echo Films; Reese Witherspoon and Lauren Neustadter through Hello Sunshine; and Mimi Leder, who also directs several episodes. The series is developed by Kerry Ehrin, who serves as showrunner and is an executive producer.\n\nApple TV+ is now available on the Apple TV app on iPhone®, iPad®, Apple TV, iPod touch®, Mac®, as well as select Samsung smart TVs, Roku and Amazon Fire TV devices and at https://tv.apple.com, for $4.99 per month with a seven-day free trial. Customers who purchase a new iPhone, iPad, Apple TV, iPod touch or Mac can enjoy one year of Apple TV+ for free.1\n\n1$4.99/month after free trial. One subscription per Family Sharing group. Offer good for three months after eligible device activation. Plan automatically renews until cancelled. Restrictions and other terms apply. Visit https://www.apple.com/promo/ for more information.\n\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s four software platforms — iOS, macOS, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042.\n\n© 2019 Apple Inc. All rights reserved. Apple, the Apple logo, Apple TV, iPhone, iPad, iPod touch and Mac are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005686/en/\nApple\nRita Cooper Lee, (424) 326-4515\nrcooperlee@apple.com \n\nAlexandra Finegersh, (424) 325-8069\nafinegersh@apple.com\nSource: Apple Inc."
    },
    {
        "title": "Thinking about trading options or stock in Apple, Bank of America, FedEx, General Motors, or Wayfair?",
        "subtitle": "",
        "date": "Dec 9, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 9, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BAC, FDX, GM, and W.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-bank-of-america-fedex-general-motors-or-wayfair-300971380.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Alibaba, Bank of America, Walt Disney, or NVIDIA?",
        "subtitle": "",
        "date": "Dec 4, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 4, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BABA, BAC, DIS, and NVDA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-alibaba-bank-of-america-walt-disney-or-nvidia-300969163.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Apple, General Electric, Macy's, Nio, or Teva Pharmaceutical?",
        "subtitle": "",
        "date": "Nov 27, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 27, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, GE, M, NIO, and TEVA.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-general-electric-macys-nio-or-teva-pharmaceutical-300966125.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Celgene, Lowe's, NVIDIA, or Target?",
        "subtitle": "",
        "date": "Nov 21, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 21, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, CELG, LOW, NVDA, and TGT.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-celgene-lowes-nvidia-or-target-300963029.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Apple Expands in Austin",
        "subtitle": "",
        "date": "Nov 20, 2019 7:15AM EST",
        "content": "\nCompany Breaks Ground on New Campus, Begins Production of All-New Mac Pro\n    AUSTIN, Texas--(BUSINESS WIRE)--\nApple® today announced the start of construction on its new campus in Austin, Texas, as part of its broad expansion in the city. At a production facility just a short distance away, Apple is preparing to ship the all-new Mac Pro® to customers starting in December.\n\n“Building the Mac Pro, Apple’s most powerful device ever, in Austin is both a point of pride and a testament to the enduring power of American ingenuity,” said Tim Cook, Apple’s CEO. “With the construction of our new campus in Austin now underway, Apple is deepening our close bond with the city and the talented and diverse workforce that calls it home. Responsible for 2.4 million American jobs and counting, Apple is eager to write our next chapter here and to keep contributing to America’s innovation story.”\n\nThe all-new Mac Pro was unveiled at Apple’s annual Worldwide Developer Conference in June. Mac Pro units are now in production in Austin and will soon ship to customers across the Americas. The 244,000-square-foot Mac Pro facility employs more than 500 people in a range of roles, including electrical engineers and electronics assemblers, who build each unique unit to customers’ specifications.\n\nApple’s growth in Austin is part of the company’s nationwide expansion — announced in January 2018 — to increase its investment in manufacturing, engineering and other jobs across the US. Apple is on track to contribute $350 billion to the US economy between 2018 and 2023, and during that time will hire an additional 20,000 employees in cities across the country.\n\nApple in Austin\n\nApple has broken ground on its new $1 billion, 3-million-square-foot campus. The campus will initially house 5,000 employees, with the capacity to grow to 15,000, and is expected to open in 2022.\n\nApple is steadily growing in Austin with approximately 7,000 employees in the city — more than a 50 percent increase in the past five years alone.\n\nAs part of its commitment to respecting the historical and geographical significance of the area, Apple is partnering with Austin-based Bartlett Tree Experts to preserve and increase the diversity of native trees on the 133-acre property. Thousands of trees spanning over 20 varieties native to Texas are planned for the campus — significantly more than were on the site before construction started. Additionally, the site will be designed to maximize green space, with landscaping covering over 60 percent of the campus, including a 50-acre nature and wildlife preserve that will be open to the public. Like all Apple facilities, the new Austin campus will run on 100 percent renewable energy, including from solar power generated on site.\n\nEarlier this year, Apple launched its Community Education Initiative in Austin, partnering with Austin Community College, Austin area public schools and other community partners to bring Swift™ coding into the classroom. In addition, Austin Community College was one of the first community colleges in the country to offer App Development with Swift to train its students to design and develop apps.\n\nMaking Mac Pro in the US\n\nThe all-new Mac Pro is Apple's most powerful machine ever, and 15,000 times faster than the original Mac®. Apple and its manufacturing partners invested over $200 million in the Mac Pro facility in Austin, building out the complex assembly line where the Mac Pro is produced. Each Mac Pro travels a distance of 1,000 feet along the production line, with some components requiring precision placement within the width of a human hair.\n\nLike all Apple products, Mac Pro is designed and engineered in California. Apple uses 9,000 suppliers across all 50 states, and Mac Pro contains hundreds of components from companies in 19 states: Arizona, California, Colorado, Connecticut, Florida, Idaho, Illinois, Kansas, Maine, Massachusetts, Michigan, Minnesota, New Mexico, New York, Oregon, Pennsylvania, Texas, Vermont and Washington. This includes computer processors from Arizona and Oregon and graphics processors from New York, as well as electrical components from Maine, Pennsylvania and Texas.\n\nThe Mac Pro manufacturing site is UL Zero Waste to Landfill Gold certified, and has been recognized by Austin Water for Excellence in Water Conservation and Excellence in Environmental Stewardship.\n\nApple in the US\n\nApple is on track to reach its 2018 commitment of contributing $350 billion to the US economy by 2023, and will spend $30 billion in capital expenditures during that same period. The company supports 2.4 million jobs across the US, including 450,000 manufacturing and operations jobs and 90,000 direct employees in all 50 states.\n\nMore than $1 billion from Apple’s $5 billion Advanced Manufacturing Fund has already been invested in American companies to foster innovation and growth in the US manufacturing sector. That includes $450 million distributed to Corning Incorporated in Harrodsburg, Kentucky, to support its research and development into state-of-the-art glass processes, equipment and materials integral to the delivery of next-generation consumer devices; $390 million awarded to Finisar in Sherman, Texas, to exponentially increase its R&D spending and high-volume production of vertical-cavity surface-emitting lasers; and $10 million allocated to the Elysis aluminum partnership to bring revolutionary advancements in green aluminum manufacturing to the commercial market.\n\nApple also continues its expansion in Boulder, Culver City, New York, Pittsburgh, San Diego and Seattle.\n\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s four software platforms — iOS, macOS, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042.\n\n© 2019 Apple Inc. All rights reserved. Apple, the Apple logo, Mac Pro, Swift and Mac are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005255/en/\nApple\nJosh Rosenstock, (408) 862-1142\njrosenstock@apple.com\nFred Sainz, (669) 227-0492\nsainz@apple.com\nApple Media Helpline, (408) 974-2042\nmedia.help@apple.com\nSource: Apple Inc."
    },
    {
        "title": "Thinking about trading options or stock in Apple, Alibaba, JPMorgan Chase, NVIDIA, or PepsiCo?",
        "subtitle": "",
        "date": "Nov 18, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 18, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BABA, JPM, NVDA, and PEP.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-alibaba-jpmorgan-chase-nvidia-or-pepsico-300959948.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Alibaba, Walt Disney Co, Facebook, or Tesla?",
        "subtitle": "",
        "date": "Nov 14, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 14, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BABA, DIS, FB, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-alibaba-walt-disney-co-facebook-or-tesla-300958429.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Apple Launches Three Innovative Studies Today in the New Research App",
        "subtitle": "",
        "date": "Nov 14, 2019 8:45AM EST",
        "content": "\nThe Apple Heart and Movement, Women’s Health and Hearing Studies Now Open for Enrollment\n    CUPERTINO, Calif.--(BUSINESS WIRE)--\nApple® today announced that customers in the US can enroll in three landmark health studies — the Apple Women’s Health Study, the Apple Heart and Movement Study, and the Apple Hearing Study. Conducted in partnership with leading academic and research institutions, these multi-year longitudinal studies are available in the new Research app, which can be downloaded today from the App Store®. Now participants can contribute to potentially groundbreaking medical discoveries with iPhone® and Apple Watch®, and help create the next generation of innovative health products.1\n\n“Today marks an important moment as we embark on research initiatives that may offer incredible learnings in areas long sought after by the medical community,” said Jeff Williams, Apple’s chief operating officer. “Participants in the Research app have the opportunity to make a tremendous impact that could lead to new discoveries and help millions lead healthier lives.”\n\nNow it’s easier than ever to contribute to medical research through a streamlined enrollment process and engaging tasks in a straightforward and secure app. After enrolling in a study, participants using Apple Watch and iPhone can contribute useful data around movement, heart rate and noise levels — captured during everyday activities, from taking a walk to attending a concert. The Research app joins Apple’s lineup of products and services that enable medical discovery on a scale never before attempted, including iPhone, Apple Watch, ResearchKit® and HealthKit™.\n\nThe Apple Women’s Health Study\n\nThere is a great opportunity to better understand menstrual cycles and how they relate to women’s health. The Apple Women’s Health Study is the first long-term study of this scale and scope; it aims to advance the understanding of menstrual cycles and their relationship to various health conditions, including polycystic ovary syndrome (PCOS), infertility, osteoporosis and menopausal transition. Conducted in partnership with Harvard T.H. Chan School of Public Health and the NIH’s National Institute of Environmental Health Sciences (NIEHS), the study will use iPhone and Apple Watch to collect study-specific data like cycle tracking information, and use monthly surveys to understand each participant’s unique menstrual experience. The study seeks to analyze the impact of certain behaviors and habits on a wide breadth of reproductive health topics.\n\nThe Apple Heart and Movement Study\n\nMeasuring the quality and quantity of a person’s movement can provide insight into their current and future health status. The Apple Heart and Movement Study is a broad study of factors that affect heart health and potentially cause deterioration in mobility or overall well-being, in an effort to promote healthy movement and improved cardiovascular health. Users can participate by using the Research app on their iPhone and recording workouts on their Apple Watch Series 1 or later. With Brigham and Women’s Hospital and the American Heart Association, Apple is taking on this study to understand how certain mobility signals and details about heart rate and rhythm could serve as potential early warning signs of atrial fibrillation (AFib), heart disease or declining mobility, to build new interventions that could help consumers lead longer, healthier and more active lives.2\n\nThe Apple Hearing Study\n\nThe impact of sound exposure on hearing health and stress levels over time is not well understood. The Apple Hearing Study will collect headphone usage and environmental sound exposure data through iPhone and the Noise app on Apple Watch, in order to explore how both can impact hearing over time. Alongside the University of Michigan, the study will also determine how long-term sound exposure can impact stress levels and cardiovascular health. Participants will be randomly assigned to two groups within the study to assess if receiving Health app notifications when loud sound exposure is detected can motivate users to modify their listening behaviors. Data from the study will also be shared with the World Health Organization (WHO)’s Make Listening Safe initiative to raise awareness of safe listening practices with the aim of reducing hearing loss.\n\nAs one of its core values, Apple believes that privacy is a fundamental human right. Therefore privacy is built into all products and services from the beginning. The Research app was carefully created to only share data with the chosen studies when the user approves. It also includes a clear enrollment flow with detailed consent that explains how data will be used and allows a user to control the type of data shared with each study.\n\n1 The Research app is available on iPhone 6s or later with iOS 13.2 or later.\n2 The Apple Heart and Movement Study requires Apple Watch Series 1 or later with watchOS 6.1 or later.\n\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch and Apple TV. Apple’s four software platforms — iOS, macOS, watchOS and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042.\n\n© 2019 Apple Inc. All rights reserved. Apple, the Apple logo, App Store, iPhone, Apple Watch, ResearchKit and HealthKit are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191114005442/en/\nApple\nSemonti Stephens, (408) 974-8473\nsemonti_stephens@apple.com\nSource: Apple Inc."
    },
    {
        "title": "Thinking about buying stock in Apple, Bristol-Myers Squibb, Cronos Group, Coca-Cola, or Walgreens Boots Alliance?",
        "subtitle": "",
        "date": "Nov 12, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 12, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BMY, CRON, KO, and WBA.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-bristol-myers-squibb-cronos-group-coca-cola-or-walgreens-boots-alliance-300956374.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Baidu, JPMorgan Chase, Micron Technology, or Yum! Brands?",
        "subtitle": "",
        "date": "Nov 7, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 7, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BIDU, JPM, MU, and YUM.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-baidu-jpmorgan-chase-micron-technology-or-yum-brands-300953924.htmlSOURCE  InvestorsObserver"
    }
]