[
    {
        "title": "Thinking about trading options or stock in Adobe, Boeing, Roku, Verizon, or Western Digital?",
        "subtitle": "",
        "date": "Dec 16, 2019 9:31AM EST",
        "content": " NEW YORK, Dec. 16, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ADBE, BA, ROKU, VZ, and WDC.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-adobe-boeing-roku-verizon-or-western-digital-300975278.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Adobe, TD Ameritrade, American Express, CSX, or Lowe's?",
        "subtitle": "",
        "date": "Oct 22, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 22, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ADBE, AMTD, AXP, CSX, and LOW.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-adobe-td-ameritrade-american-express-csx-or-lowes-300943002.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Adobe, Axalta, Foresight Autonomous Holdings, or Lyft?",
        "subtitle": "",
        "date": "Jun 19, 2019 9:31AM EDT",
        "content": "NEW YORK, June 19, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, ADBE, AXTA, FRSX, and LYFT.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-adobe-axalta-foresight-autonomous-holdings-or-lyft-300871263.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Creative Cloud Innovation at NAB 2019 Meets Heavy Demands of Today’s Video Professionals",
        "subtitle": "",
        "date": "Apr 3, 2019 9:00AM EDT",
        "content": "Latest Video Release Brings Increased Performance and Added Creative PowerSAN JOSE, Calif.--(BUSINESS WIRE)-- Ahead of the 2019 NAB Show, Adobe (Nasdaq:ADBE) today announced performance updates and new innovations for video and audio tools in Adobe Creative Cloud to improve efficiency in video production. From a wide range of film, TV, broadcast and streaming projects including Clemency, Fox Sports, The Last Black Man in San Francisco, Native Son, The Peanut Butter Falcon, Wu-Tang Clan: Of Mics and Men andVICE Media, Adobe Creative Cloud powers the world's best video apps and services by providing the most integrated product workflows.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190403005279/en/Available today, new features include ground-breaking Content-Aware Fill for video, powered by Adobe Sensei, the company's artificial intelligence (AI) and machine learning technology, along with new capabilities for titles and graphics, crafting animations, refining audio mixing, and organizing and preparing project media. Some of the hundreds of performance improvements include faster Mask Tracking for effects and color workflows, dual GPU optimization and improved hardware acceleration for HEVC and H.264 formats in Premiere Pro. In After Effects, enhancements include GPU-accelerated effects, such as Change Color and Roughen Edges.\"Thanks to Adobe Creative Cloud, we're delivering 200 pieces of content this year to over seven million online followers in record time,\" said Niko Pueringer and Sam Gorski, co-founders of Corridor Digital. \"With the new performance improvements in today's Premiere Pro release, we're excited to see dual GPU support to speed up export times, do lighting fast edits, and become better creators.\"\"Video consumption is exploding across broadcast, film, streaming services and digital marketing, resulting in a spike in content creation demands,\" said Steven Warner, vice president of digital video and audio, Adobe. \"Through optimized performance and intelligent new features powered by Adobe Sensei, Creative Cloud helps video professionals eliminate the most tedious production tasks so they can focus on storytelling and executing on their creative vision.\"Smarter Tools for Richer StorytellingAttendees at this year's NAB Show can get a closer look at the newly available features and hear from industry experts at the Adobe booth (#SL5610, South Hall in the Las Vegas Convention Center) and at over 100 partner booths from April 8-11. Tune in to Facebook Live with Jason Levine on April 4 at 9 a.m. PST to hear about what's new.New features in today's release enable users to:Pricing and AvailabilityThe new features for Adobe Creative Cloud announced at NAB are now available with the latest version of Creative Cloud. For more information on pricing, visit https://www.adobe.com/creativecloud/plans.html. Multiple subscription plans for Adobe Stock are available at https://stock.adobe.com/plans.Helpful Links:About AdobeAdobe is changing the world through digital experiences. For more information, visit www.adobe.com.© 2019 Adobe Inc. All rights reserved. Adobe and the Adobe logo are either registered trademarks or trademarks of Adobe in the United States and/or other countries. All other trademarks are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190403005279/en/Source: Adobe"
    },
    {
        "title": "Adobe and Drift Launch Industry-First Conversational Account-Based Experience for Marketo Engage",
        "subtitle": "",
        "date": "Mar 28, 2019 9:00AM EDT",
        "content": "Conversational ABM™ for Marketo Engage Empowers B2B Marketers to Advance Personalization Beyond Content, Powering Real-time Conversations with Target Accounts at Every Stage of a Brand's Digital JourneyLAS VEGAS--(BUSINESS WIRE)-- Adobe (Nasdaq:ADBE) and Drift, the leading conversational marketing platform, today announced Conversational ABM™ for Marketo Engage, a first-ever conversational capability for account-based experiences (ABX) — a new way to identify, understand and engage B2B customer buying teams. Conversational ABM™ for Marketo Engage will be available to customers of Marketo Engage, part of Adobe Experience Cloud, enabling marketers to personalize every website visit from a target account with a personalized conversation in real-time.\"Optimizing the end-to-end business buying experience for marketers is at the heart of our mission. Finally extending personalization to one-on-one, real-time interactions across any account has been a critical need for every B2B marketer investing in account-based experiences — which is why, together with Drift, we are thrilled to unlock that capability for the first time,\" said Steve Lucas, senior vice president, Digital Experience business, Adobe. \"Conversational ABM™ for Marketo Engage takes personalization beyond content, allowing marketers using ABX to have personalized, live conversations with the right strategic accounts at the right time, every time.\"\"Customers have more options and information than ever before, so they have all the power in the buying process today, not companies,\" said David Cancel, CEO, Drift. \"As a result, whoever makes it easier to buy, wins — yet most B2B websites add friction and force buyers to jump through hoops just to talk to someone. With Marketo Engage and Drift together, marketers will be able to have personalized account-based conversations at scale with website visitors at any stage of the buying process and provide the VIP experience that buyers expect today.\"By simply connecting target account lists with Drift, Marketo Engage customers will be able to target each website visitor with a chatbot, a relevant piece of ABX content or give them a fast lane to connect directly to a sales representative. Conversational ABM™ for Marketo Engage brings live chat — one of the fastest growing channels for B2B marketers — to Marketo Engage's ABX solution and enables Marketo Engage and Drift users to:Additionally, Marketo Engage announced that Verticurl, a Global Platinum Marketo Partner and WPP company, is a preferred global partner to help accelerate integration of Conversational ABM™ for Marketo Engage directly into marketers' current marketing technology stack, customer experience strategy and marketing operations processes. Marketo Engage customers will benefit from Verticurl's global team of marketing technology and ABX consultants in over 20 countries.Conversational ABM™for Marketo Engage is available for customers using Marketo Engage and Drift now. To learn more, visit https://www.drift.com/integrations/marketo/ or https://www.adobe.com/marketing/marketo.html.About DriftDrift is the new way businesses buy from businesses. With its quickly evolving set of tools and playbooks, Drift is the world's leading conversational marketing platform, trusted by top enterprise businesses like Marketo, an Adobe company, MongoDB, Okta, Outreach, Vidyard, and over 150,000 other businesses. Sales and marketing teams rely on Drift to connect now with the customers who are ready to buy now. Based in Boston, Drift was founded by serial marketing technology entrepreneurs David Cancel and Elias Torres and is backed by leading venture capitalists including CRV, General Catalyst, and Sequoia. Learn more at www.drift.com.About AdobeAdobe is changing the world through digital experiences. For more information, visit www.adobe.com.© 2019 Adobe Inc. All rights reserved. Adobe and the Adobe logo are either registered trademarks or trademarks of Adobe in the United States and/or other countries. All other trademarks are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190328005176/en/Source: Adobe"
    },
    {
        "title": "Adobe, Microsoft and SAP Announce New Open Data Initiative Details",
        "subtitle": "",
        "date": "Mar 27, 2019 1:00PM EDT",
        "content": "Global Industry Partners Join Effort to Connect Data and Gather Powerful Insights Fueled by AI and Intelligent ServicesLAS VEGAS--(BUSINESS WIRE)-- Today at Adobe Summit, the industry's leading customer experience conference, Adobe (Nasdaq:ADBE) CEO Shantanu Narayen and Microsoft (Nasdaq \"MSFT\" @microsoft) CEO Satya Nadella revealed additional details about the Open Data Initiative (ODI). As originally announced last September, Adobe, Microsoft and SAP (NYSE:SAP) have embarked on a new approach to business data that will help companies transform their customer experiences through real-time insights delivered from the cloud.The three partners outlined a common approach and set of resources for customers in an initial announcement last September, with the ambition of helping customers create new connections across previously siloed data, more seamlessly garner intelligence, and ultimately better serve brands with an improved view of their customer interactions.From the beginning, the ODI has been focused on enhancing interoperability between the applications and platforms of the three partners through a common data model with data stored in a customer-chosen data lake. This unified data lake is intended to allow customers their choice of development tools and applications to build and deploy services.To improve that process, the three companies plan to deliver in the coming months a new approach for publishing, enriching and ingesting initial data feeds from Adobe Experience Platform, activated through Adobe Experience Cloud, Microsoft Dynamics 365 and Office 365 and SAP C/4HANA, into a customer's data lake. This will enable a new level of AI and machine learning enrichment to garner new insights and better serve customers.Unilever, a mutual customer and one of the early global brands to express support and excitement about the ODI, today announced their intention to simplify a previously complex business outcome based on these data connections.At Adobe Summit, Unilever is demonstrating how they plan to bring together disparate customer, product and resource data and use AI-driven insights to help reduce their plastic packaging and encourage consumer recycling. By eliminating the silos of data, Unilever will be able to tie inventory and plastics data into Adobe data to enhance customer experiences and encourage participation.To accelerate development of the initiative, Adobe, Microsoft and SAP also announced today plans to convene a Partner Advisory Council consisting of over a dozen companies including Accenture, Amadeus, Capgemini, Change Healthcare, Cognizant, EY, Finastra, Genesys, Hootsuite, InMobi, Sprinklr and WPP. These organizations span myriad industries and customer segments and believe there is significant opportunity in the ODI for them to drive net new value to their customers.\"Our customers are all trying to integrate behavioural, CRM, ERP and other internal data sets to have a comprehensive understanding of each consumer, and they're struggling with the challenges of integrating this data,\" said Stephan Pretorius, CTO of WPP. \"We're excited about the initiative Adobe, Microsoft and SAP have taken in this area, and we see a lot of opportunity to contribute to the development of the ODI.\"About AdobeAdobe is changing the world through digital experiences. For more information, visit www.adobe.com.About MicrosoftMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.Note to editors: For more information, news and perspectives from Microsoft, please visit the Microsoft News Center at http://news.microsoft.com. Web links, telephone numbers and titles were correct at time of publication but may have changed. For additional assistance, journalists and analysts may contact Microsoft's Rapid Response Team or other appropriate contacts listed at http://news.microsoft.com/microsoft-public-relations-contacts.About SAPAs market leader in enterprise application software, SAP (NYSE:SAP) helps companies of all sizes and industries run better. From back office to boardroom, warehouse to storefront, desktop to mobile device - SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable more than 404,000 business and public sector customers to operate profitably, adapt continuously, and grow sustainably. For more information, visit www.sap.com.© 2019 Adobe Inc. All rights reserved. Adobe and the Adobe logo are either registered trademarks or trademarks of Adobe in the United States and/or other countries. All other trademarks are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190327005203/en/Source: Adobe"
    },
    {
        "title": "Financialbuzz.com: 'Earnings Recap' Week Ending March 15th, 2019",
        "subtitle": "",
        "date": "Mar 15, 2019 9:00AM EDT",
        "content": "NEW YORK, March 15, 2019 /PRNewswire/ --U.S. markets experienced a strong week, despite the fatal accident of Boeing's (NYSE:BA) 737 MAX flight on Sunday. A 737-flight operated by Ethiopian Airlines crashed, coming just months after another 737 accident in Indonesia. While markets opened weaker on Monday morning following the incident, stocks rebounded quickly, primarily led by a major tech stock rally. The Dow Jones rallied by 368.7 points or 1.4% throughout Monday. However, markets dragged lower on Tuesday following Boeing's slump. Boeing shares continued to fall throughout the week, as the stock price had shed 11.4% leading into Thursday morning. Concerns over Boeing's aircraft safety and infrastructure afflicted many, which caused a string of countries to ground and temporarily ban 737 flights. Countries such as Australia, Canada, China, France, the U.K., and the U.S. have already taken action against the aircraft. Overall, the mixed market reaction can be attributed to the U.S.-China trade deal being stalled, weaker industrial output data in China, the grounding of Boeing 737s, and the Brexit votes in the U.K. The Dow Jones Industrial Average gained 482.41 points or 1.9% from Monday's opening bell into midday Thursday. The S&P 500 gained 89.7 points or 3.2% in the same period, while the Nasdaq Composite rose by 304.1 points or 4.1%. Stitch Fix, Inc. (NASDAQ:SFIX), Cloudera, Inc. (NYSE:CLDR), MongoDB, Inc. (NASDAQ:MDB), Domo, Inc. (NASDAQ:DOMO), Adobe Inc. (NASDAQ:ADBE)\"After a few quiet days outside of Boeing and Brexit to kick off the week, the flow of news is a bit more active this morning [Thursday],\" wrote Paul Hickey of Bespoke Investment Group, in a Thursday note to clients, via MarketWatch. \"Positive sentiment in equity futures has quickly worn off this morning as headlines indicate that the U.S. and China have put off a planned meeting between President Trump and President Xi later this month,\" he added. \"The meeting now won't occur until April at least. Sticking points like the treatment of intellectual property remain unresolved. The delay shouldn't be entirely surprising given the president's comments just yesterday that he was in no rush to sign a deal.\"For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=K4P1RPW86jMStitch Fix, Inc. (NASDAQ:SFIX) reported its second quarter financial results after market close on Monday and beat earnings estimates, sending shares surging as high as 30% on Tuesday morning. For the quarter, Stitch Fix reported earnings of USD 12 cents per share on revenue of USD 370 Million while analysts expected earnings of USD 5 cents per share on revenue of USD 365 Million. Stitch Fix also provided a higher-than-expected third-quarter and full-year guidance. The Company expects revenues between USD 388 Million and USD 398 Million, while analysts projected USD 384 Million for the third quarter. As for the full-year, Stitch Fix reported a full-year revenue guidance between USD 1.53 Billion and USD 1.56 Billion, higher than estimates of USD 1.51 Billion.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=K4P1RPW86jMCloudera, Inc. (NYSE:CLDR) shares plunged by 15% on Thursday morning after providing a disappointing forecast in its fourth quarter financial results release. Cloudera reported its fourth-quarter results during Wednesday's extended trading hours. Cloudera, which closed its acquisition of its rival Hortonworks in January, reported fourth-quarter earnings loss of USD 45 cents per share on revenue of USD 144.5 Million. Analysts had expected an adjusted loss of 11 cents per share on revenue of USD 121 Million. Cloudera also forecast that the earnings loss will continue to be a problem going into the next quarter, as the Company forecasts a loss of USD 32 cents to USD 36 cents per share, on revenue in the range of USD 835 Million to USD 855 Million. Analysts are, meanwhile, expecting an earnings loss of USD 26 cents per share.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=K4P1RPW86jMMongoDB, Inc. (NASDAQ:MDB) stock price soared by over 25% on Thursday after crushing its fourth-quarter earnings result. For the quarter, MongoDB reported an earnings loss of USD 17 cents per share on revenue of USD 85.5 Million, whereas analysts had expected earnings loss of USD 38 cents per share on revenue of USD 74 Million. MongoDB's stronger quarter was driven by the number of companies adopting its database platform to drive their business performances. The Company reported that its subscription revenue increased by 73% to USD 80.6 Million for the quarter while services revenue grew by 37% year-over-year to USD 4.9 Million.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=K4P1RPW86jMDomo, Inc.(NASDAQ:DOMO) reported its fourth quarter financial results after market close on Wednesday and surpassed its estimates, sending shares 26.8% higher at the opening on Thursday. For the quarter, Domo reported an earnings loss of USD 94 cents per share on revenue of USD 39.4 Million. Analysts' forecast had pointed to an earnings loss of USD 1.24 per share on revenue of USD 37.76 Million. For the next quarter, Domo forecast its net loss per share to be in the range of USD 1.26 to USD 1.30, on revenue expectations between USD 40.0 Million to USD 41.0 Million.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=K4P1RPW86jMAdobe Inc. (NASDAQ:ADBE) reported its first quarter financial results after market close on Thursday. Adobe beat both earnings and revenue estimates for the quarter. For the fourth quarter, Adobe reported earnings of USD 1.71 per share on record quarterly revenue of USD 2.6 Billion. Analysts had only expected earnings of USD 1.62 per share on revenues of USD 2.59 Billion. For the second quarter, Adobe expects earnings of USD 1.77 per share on revenue of USD 2.7 Billion, primarily led by the growth in its digital media and digital experience segments.Subscribe Now! Watch us report LIVE https://www.youtube.com/FinancialBuzzMediaFollow us on Twitter for real time Financial News Updates: https://twitter.com/financialbuzzFollow and talk to us on Instagram: https://www.instagram.com/financialbuzzFacebook Like Us to receive live feeds: https://www.facebook.com/Financialbuzz/About FinancialBuzz.comFinancialBuzz.com, a leading financial news informational web portal designed to provide the latest trends in Market News, Investing News, Personal Finance, Politics, Entertainment, in-depth broadcasts on Stock News, Market Analysis and Company Interviews. A pioneer in the financially driven digital space, video production and integration of social media, FinancialBuzz.com creates 100% unique original content. FinancialBuzz.com also provides financial news PR dissemination, branding, marketing and advertising for third parties for corporate news and original content through our unique media platform that includes Newswire Delivery, Digital Advertising, Social Media Relations, Video Production, Broadcasting, and Financial Publications.Please Note: FinancialBuzz.com is not a financial advisory or advisor, investment advisor or broker-dealer and do not undertake any activities that would require such registration. The information provided on http://www.FinancialBuzz.com (the \"site\") is either original financial news or paid advertisements provided [exclusively] by our affiliates (sponsored content), FinancialBuzz.com, a financial news media and marketing firm enters into media buys or service agreements with the companies which are the subject to the articles posted on the Site or other editorials for advertising such companies. FinancialBuzz.com has not been compensated directly by any of the companies mentioned here in this editorial. We are not an independent news media provider and therefore do not represent or warrant that the information posted on the Site is accurate, unbiased or complete. FinancialBuzz.com receives fees for producing and presenting high quality and sophisticated content on FinancialBuzz.com along with other financial news PR media services. FinancialBuzz.com does not offer any personal opinions or bias commentary as we purely incorporate public market information along with financial and corporate news. FinancialBuzz.com only aggregates or regurgitates financial or corporate news through our unique financial newswire and media platform. For this release, FinancialBuzz.com has not been compensated for financial news dissemination and PR services by any parties. Our fees may be either a flat cash sum or negotiated number of securities of the companies featured on this editorial or site, or a combination thereof. The securities are commonly paid in segments, of which a portion is received upon engagement and the balance is paid on or near the conclusion of the engagement. FinancialBuzz.com will always disclose any compensation in securities or cash payments for financial news PR advertising. FinancialBuzz.com does not undertake to update any of the information on the editorial or Site or continue to post information about any companies the information contained herein is not intended to be used as the basis for investment decisions and should not be considered as investment advice or a recommendation. The information contained herein is not an offer or solicitation to buy, hold or sell any security. FinancialBuzz.com, members and affiliates are not responsible for any gains or losses that result from the opinions expressed on this editorial or Site, company profiles, quotations or in other materials or presentations that it publishes electronically or in print. Investors accept full responsibility for any and all of their investment decisions based on their own independent research and evaluation of their own investment goals, risk tolerance, and financial condition. FinancialBuzz.com. By accessing this editorial and website and any pages thereof, you agree to be bound by the Terms of Use and Privacy Policy, as may be amended from time to time. None of the content issued by FinancialBuzz.com constitutes a recommendation for any investor to purchase, hold or sell any particular security, pursue a particular investment strategy or that any security is suitable for any investor. This publication is provided by FinancialBuzz.com. Each investor is solely responsible for determining whether a particular security or investment strategy is suitable based on their objectives, other securities holdings, financial situation needs, and tax status. You agree to consult with your investment advisor, tax and legal consultant before making any investment decisions. We make no representations as to the completeness, accuracy or timeless of the material provided. All materials are subject to change without notice. Information is obtained from sources believed to be reliable, but its accuracy and completeness are not guaranteed. For our full disclaimer, disclosure and Terms of Use, please visit: http://www.FinancialBuzz.com.For further information:Media Contact:info@financialbuzz.com+1-877-601-1879Url: http://www.FinancialBuzz.com View original content:http://www.prnewswire.com/news-releases/financialbuzzcom-earnings-recap-week-ending-march-15th-2019-300813056.htmlSOURCE FinancialBuzz.com"
    },
    {
        "title": "Fox Set to Join S&P 500; Adobe to Join S&P 100",
        "subtitle": "",
        "date": "Mar 14, 2019 5:46PM EDT",
        "content": "NEW YORK, March 14, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") will make the following changes to the S&P 500 & S&P 100:Fox Corp. operates as a news, sports, and entertainment company. Headquartered in New York, NY, the company will be added to the S&P 500 (Global Industry Classification Standard) GICS Broadcasting Sub-Industry index effective prior to the open of trading on Wednesday, March 20.Adobe operates as a diversified software company and is headquartered in San Jose, CA.Following is a summary of the changes:\n  \n\n  \n    \n      S&P 500 INDEX - MARCH 19, 2019\n              \n                      COMPANY\n                      GICS ECONOMIC SECTOR\n                      GICS SUB-INDUSTRY\n                  ADDED\n                      Fox \n                      Communication Services\n                      Broadcasting*\n                  *GICS effective March 20\n                      \n                      \n                      \n                  \n  \n  \n  \n\n  \n    \n      S&P 500 INDEX - MARCH 20, 2019\n              \n                      COMPANY\n                      GICS ECONOMIC SECTOR\n                      GICS SUB-INDUSTRY\n                  DELETED\n                      Twenty-First Century Fox\n                      Communication Services\n                      Movies & Entertainment\n                  \n  \n  \n  \n\n  \n    \n      S&P 100 INDEX - MARCH 20, 2019\n              \n                      COMPANY\n                      GICS ECONOMIC SECTOR\n                      GICS SUB-INDUSTRY\n                  ADDED\n                      Adobe\n                      Information Technology\n                      Application Software\n                  DELETED\n                      Twenty-First Century Fox\n                      Communication Services\n                      Movies & Entertainment\n                  \n  \n  For more information about S&P Dow Jones Indices, please visit www.spdji.comABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has become home to over 1,000,000 indices across the spectrum of asset classes that have helped define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE:SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit www.spdji.com.FOR MORE INFORMATION:David BlitzerManaging Director and Chairman of the Index CommitteeNew York, USA(+1) 212 438 3907david.blitzer@spglobal.comS&P Dow Jones Indicesindex_services@spglobal.comMedia Inquiriesspdji_communications@spglobal.com View original content:http://www.prnewswire.com/news-releases/fox-set-to-join-sp-500-adobe-to-join-sp-100-300812869.htmlSOURCE S&P Dow Jones Indices"
    },
    {
        "title": "Yext Collaborates with Adobe to Drive Website Discovery",
        "subtitle": "",
        "date": "Mar 13, 2019 8:59AM EDT",
        "content": "NEW YORK, March 13, 2019 /PRNewswire/ -- Yext, Inc. (NYSE:YEXT), the leader in Digital Knowledge Management (DKM), today announced a new collaboration with Adobe (NASDAQ:ADBE). Yext has launched four integrations with the Adobe Experience Cloud to easily connect Yext knowledge to properties and assets created and managed with Adobe. These integrations will enable businesses to use their brand data stored in Yext across websites, mobile apps, email systems, and the Internet of Things. Adobe customers can now leverage Yext to increase discoverability of their Adobe experiences and give them control of their brand across the internet.\"As search transforms from results to answers, the importance of structuring critical brand information to supply verified, direct answers to consumers is only continuing to grow,\" said Howard Lerman, Founder and CEO of Yext. \"We are proud to collaborate with Adobe to provide new ways for brands to provide an excellent customer experience powered by intelligence.\"\"In the context of a changing customer journey fueled by changing technology, businesses need to think strategically about how to structure the facts that consumers seek out about them in order to make themselves discoverable,\" said Cody Crnkovich, Head of Platform Partners and Strategy, Adobe Experience Cloud. \"We're excited to bring the power of Yext knowledge to Adobe customers so that even more people can discover the compelling digital experiences they build with us.\"Yext has launched integrations with the following four Adobe products:\"Adobe is the global leader in content delivery and management, and with these integrations, we're giving businesses an easy way to power their digital experiences with the structured data they manage with Yext and increase their online discoverability and brand control,\" said Marc Ferrentino, Chief Strategy Officer of Yext. \"These integrations represent a major step forward in ensuring that the websites and other experiences brands create show up in searches across search engines, voice assistants, maps, and apps that consumers use every day.\"To learn more about Yext's collaboration with Adobe, visit yext.com/adobe.About Yext:Yext, Inc. (NYSE: YEXT) is the leading Digital Knowledge Management (DKM) platform. Our mission is to give companies control over their brand experiences across the digital universe of maps, apps, search engines, voice assistants, and other intelligent services that drive consumer discovery, decision, and action. Today, thousands of businesses including brands like Taco Bell, Rite Aid, and Steward Health Care use the Yext Knowledge Engine™ to manage their digital knowledge in order to boost brand engagement, drive foot traffic, and increase sales.Yext has been named a Best Place to Work by Fortune and Great Place to Work® as well as a Best Workplace for Women. Yext is headquartered in New York City with offices in Berlin, Chicago, Dallas, Geneva, London, Paris, San Francisco, Shanghai, Tokyo and the Washington, D.C. Area. For more information, visit yext.com.About Adobe Experience CloudAdobe is reimagining Customer Experience Management (CXM) with Adobe Experience Cloud, the industry's only end-to-end solution for experience creation, marketing, advertising, analytics and commerce. Unlike legacy enterprise platforms with static, siloed customer profiles, Adobe Experience Cloud helps companies deliver consistent, continuous and compelling experiences across customer touchpoints and channels - all while accelerating business growth. Industry analysts have named Adobe a leader in over 20 major reports focused on experience - more than any other technology company. View original content to download multimedia:http://www.prnewswire.com/news-releases/yext-collaborates-with-adobe-to-drive-website-discovery-300810355.htmlSOURCE Yext, Inc."
    },
    {
        "title": "Adobe to Webcast Q1 FY2019 Earnings Conference Call",
        "subtitle": "",
        "date": "Mar 11, 2019 1:00PM EDT",
        "content": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Adobe (Nasdaq:ADBE) today announced it will webcast its first quarter fiscal year 2019 earnings conference call to be held later this week.\n  \n\n  \n    \n       What: \n                   Adobe First Quarter Fiscal Year 2019 Earnings Conference Call \n               When: \n                      \n                      \n                      \n                       2 p.m. Pacific Time, Thursday, March 14, 2019 \n                   Where: \n                      \n                      \n                      \n                      www.adobe.com/ADBE\n                   How: \n                      \n                      \n                      \n                       Live over the Internet; simply connect to the meeting room on the webpage above \n                   Questions: \n                      \n                      \n                      \n                      Contact Adobe Investor Relations at 408-536-4416 or ir@adobe.com\n                  \n  \n  The live webcast will last for approximately one hour. An archive of the call will be made available for approximately 45 days.Adobe uses its website as a channel of distribution of material company information. Financial, product and other material information regarding Adobe is routinely posted on and accessible at www.adobe.com or www.adobe.com/ADBE.About AdobeAdobe is changing the world through digital experiences. For more information, visit www.adobe.com.© 2019 Adobe Inc. All rights reserved. Adobe and the Adobe logo are either registered trademarks or trademarks of Adobe in the United States and/or other countries. All other trademarks are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190311005175/en/Source: Adobe"
    },
    {
        "title": "Investor Advisory: Adobe Announces Webcast of Investor Conference Participation",
        "subtitle": "",
        "date": "Feb 5, 2019 1:00PM EST",
        "content": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Adobe (Nasdaq:ADBE) today announced its upcoming participation in the following investor event:Goldman Sachs Tech and Internet ConferenceSan Francisco, CAWednesday, Feb. 13, 2019, 5 p.m. Eastern TimeMike Saviage, VP, Investor RelationsAudio of this presentation will be webcast live from Adobe's Investor Relations website at www.adobe.com/ADBE. Conference presentation times are subject to change at the discretion of the conference host. An archive of the webcast will be available for a limited time.Adobe uses its website as a channel of distribution of material company information. Financial, product and other material information regarding Adobe is routinely posted on and accessible at www.adobe.com, www.adobe.com/ADBE and theblog.adobe.com.About AdobeAdobe is changing the world through digital experiences. For more information, visit www.adobe.com.© 2019 Adobe Inc. All rights reserved. Adobe and the Adobe logo are either registered trademarks or trademarks of Adobe in the United States and/or other countries. All other trademarks are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190205005190/en/Source: Adobe"
    },
    {
        "title": "OmniSci Hires Ray Falcione Jr. as Vice President of U.S. Federal Business",
        "subtitle": "",
        "date": "Jan 17, 2019 11:30AM EST",
        "content": "SAN FRANCISCO, Jan. 17, 2019 /PRNewswire/ -- OmniSci, the pioneer in GPU-accelerated analytics, today announced the hiring of Ray Falcione Jr. as its new Vice President of U.S. Federal Business. Falcione, a technology industry veteran with over 25 years of experience in the federal government space, will focus on expanding the OmniSci presence within the U.S. government market, deepening partnerships and ensuring customers are successful in adopting OmniSci technology.Falcione comes to OmniSci from Adobe, Inc., where he was Director of Federal Programs, serving national security, law enforcement, Homeland Security and military intelligence customers. Prior to Adobe, he held the position of Vice President at Software AG Government Solutions, an enterprise software company. Falcione has also served in senior management positions with Brocade, Oracle and Sun Microsystems.\"We are thrilled to have Ray join our leadership team. He has a deep understanding of the real-world needs of customers throughout the federal government,\" said Todd Mostak, co-founder and CEO of OmniSci. \"His insights, leadership skills and dedication to solving the government's most difficult mission challenges through data analytics will be of immense value for our customers and OmniSci.\"Throughout his career in information technology, Falcione has focused on delivering solutions, systems and repeatable processes to satisfy the mission needs of federal agencies. He has extensive experience in engineering, business management and leadership, and has successfully led large teams to meet company and customer goals.\"Federal agencies are dealing with increasingly massive amounts of data on a daily basis. One of their top priorities is how to get better use of that data—an objective for which OmniSci is truly a game-changer,\" stated Falcione. \"The OmniSci platform, driven by ultrafast GPU-accelerated analytics processing, gives analysts and data scientists the power to query and visualize massive, multi-billion row datasets in seconds. Because it 'lowers the cost of curiosity,' it is redefining the limits of speed and scale in Big Data analytics.\"OmniSci achieves ground-breaking, real-time analytics and data visualization outcomes in use cases as diverse as geospatial intelligence (GEOINT), battlefield information dominance, fleet telematics, logistics operations, telecommunication network operations and investment management.Falcione's diverse background includes experience teaching courses in customer service and effective feedback to federal government personnel. He graduated from the University of Maryland, College Park with a Bachelor of Science degree in industrial technologies.About OmniSci:OmniSci (formerly MapD) is the pioneer in GPU-accelerated analytics. The OmniSci platform is used in business and government to find insights in data beyond the limits of mainstream analytics tools. Harnessing the massive parallel computing power of GPUs, the platform is available in the cloud (OmniSci Cloud and leading public cloud providers) and on-premise (OmniSci Core and Enterprise Edition). OmniSci originated from research at Harvard and MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). OmniSci is funded by GV, In-Q-Tel, New Enterprise Associates (NEA), NVIDIA, Tiger Global Management, Vanedge Capital and Verizon Ventures. The company is headquartered in San Francisco. Learn more about OmniSci at www.omnisci.com.MEDIA CONTACT:Rose LeeSSPR703/371-5840rlee@sspr.com View original content to download multimedia:http://www.prnewswire.com/news-releases/omnisci-hires-ray-falcione-jr-as-vice-president-of-us-federal-business-300780031.htmlSOURCE OmniSci"
    }
]