[
    {
        "title": "Analog Devices to Participate in Raymond James Institutional Investors Conference",
        "subtitle": "",
        "date": "Feb 27, 2020 4:00PM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI) today announced that the Company’s Senior Vice President, Finance and Chief Financial Officer, Prashanth Mahendra-Rajah, will speak at the Raymond James 41st Annual Institutional Investors Conference in Orlando, FL on Monday, March 2, 2020, at 9:50 a.m. Eastern time.\n\nThe audio webcast and presentation for the conference may be accessed live via the Investor Relations section of Analog Devices’ website at investor.analog.com. An archived replay will also be available shortly following the webcast.\n\nAbout Analog Devices, Inc.\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\n(ADI-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005916/en/\nMichael Lucarelli\nSenior Director of Investor Relations\nAnalog Devices, Inc.\n781-461-3282\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Reports First Quarter Fiscal 2020 Results",
        "subtitle": "",
        "date": "Feb 19, 2020 8:00AM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI), a leading global high-performance analog technology company, today announced financial results for its first quarter of fiscal 2020, which ended February 1, 2020.\n\n“ADI’s first quarter results were in-line with our expectations. Encouragingly, demand across our end markets has stabilized and is beginning to show signs of improvement as we enter our fiscal second quarter,” said Vincent Roche, President and CEO. “We are building on this momentum by executing on our 2020 priorities – deepening our customer-centricity, deploying our capital efficiently, and capitalizing on secular trends to expand our addressable markets and drive diversified growth. Further, we raised our quarterly dividend by 15%, reflecting the stability of our cash flows and our optimism regarding ADI’s future.”\n\nRoche continued, “I believe the demand for ADI’s solutions will be unprecedented as technological innovation underpinned by ubiquitous sensing, hyper-scale and edge computing, and pervasive connectivity continues to grow at an exponential pace. Our diversified business model combined with our leading technology portfolio position ADI to deliver sustainable long-term growth and strong shareholder returns in the years ahead.”\n\nPerformance for the First Quarter of Fiscal 2020 \n\nOutlook for the Second Quarter of Fiscal Year 2020\n\nFor the second quarter of fiscal 2020, we are forecasting revenue of $1.35 billion, +/- $50 million. While the effects of the coronavirus are difficult to estimate and the situation remains dynamic, we have reduced our revenue guidance by $70 million to account for its potential impact. At the midpoint of this revenue outlook, we expect reported operating margins of approximately 26.0%, +/-150 bps, and adjusted operating margins of approximately 37.5%, +/-100 bps. We are planning for reported EPS to be $0.73, +/-$0.08, and adjusted EPS to be $1.10, +/-$0.08.\n\nOur second quarter fiscal 2020 outlook is based on current expectations and actual results may differ materially, as a result of, among other things, the important factors discussed at the end of this release. These statements supersede all prior statements regarding our business outlook set forth in prior ADI news releases, and ADI disclaims any obligation to update these forward-looking statements.\n\nThe adjusted results and adjusted anticipated results above are financial measures presented on a non-GAAP basis. Reconciliations of these non-GAAP financial measures to their most directly comparable GAAP financial measures are provided in the financial tables included in this press release. See also “Non-GAAP Financial Information” section for additional information.\n\nDividend Payment\n\nThe ADI Board of Directors has declared a quarterly cash dividend of $0.62 per outstanding share of common stock. The dividend will be paid on March 10, 2020 to all shareholders of record at the close of business on February 28, 2020.\n\nConference Call Scheduled for Today, Wednesday, February 19, 2020 at 10:00 am ET\n\nADI will host a conference call to discuss our first quarter fiscal 2020 results and short-term outlook today, beginning at 10:00 am ET. Investors may join via webcast, accessible at investor.analog.com, or by telephone (call 800-859-9560, or 706-634-7193 for international calls, ten minutes before the call begins and provide the password \"ADI\").\n\nA replay will be available two hours after the completion of the call. The replay may be accessed for up to two weeks by dialing 855-859-2056 (replay only) and providing the conference ID: 7263078, or by visiting investor.analog.com.\n\nNon-GAAP Financial Information\n\nThis release includes non-GAAP financial measures that are not in accordance with, nor an alternative to, generally accepted accounting principles (GAAP) and may be different from non-GAAP measures presented by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. These non-GAAP measures have material limitations in that they do not reflect all of the amounts associated with the Company’s results of operations as determined in accordance with GAAP and should not be considered in isolation from, or as a substitute for, the Company’s financial results presented in accordance with GAAP. The Company’s use of non-GAAP measures, and the underlying methodology when including or excluding certain items, is not necessarily an indication of the results of operations that may be expected in the future, or that the Company will not, in fact, record such items in future periods. You are cautioned not to place undue reliance on these non-GAAP measures. Reconciliations of these non-GAAP measures to the most directly comparable financial measures calculated and presented in accordance with GAAP are provided in the financial tables included in this release.\n\nManagement uses non-GAAP measures internally to evaluate the Company’s operating performance from continuing operations against past periods and to budget and allocate resources in future periods. These non-GAAP measures also assist management in evaluating the Company’s core business and trends across different reporting periods on a consistent basis. Management also uses these non-GAAP measures as the primary performance measurement when communicating with analysts and investors regarding the Company’s earnings results and outlook and believes that the presentation of these non-GAAP measures is useful to investors because it provides investors with the operating results that management uses to manage the Company and enables investors and analysts to evaluate the Company’s core business. Management also believes that the non-GAAP liquidity measure free cash flow is useful both internally and to investors because it provides information about the amount of cash generated after capital expenditures that is then available to repay debt obligations, make investments and fund acquisitions, and for certain other activities.\n\nThe non-GAAP financial measures referenced by ADI in this release include: adjusted gross margin, adjusted gross margin percentage, adjusted operating expenses, adjusted operating expenses percentage, adjusted operating income, adjusted operating margin, adjusted income before income taxes, adjusted provision for income taxes, adjusted tax rate, adjusted diluted earnings per share (EPS), free cash flow, and free cash flow margin percentage.\n\nAdjusted gross margin is defined as gross margin, determined in accordance with GAAP, excluding certain acquisition-related expenses1 which are described further below. Adjusted gross margin percentage represents adjusted gross margin divided by revenue.\n\nAdjusted operating expenses is defined as operating expenses, determined in accordance with GAAP, excluding: certain acquisition-related expenses1; restructuring related expense2; and charitable foundation contribution3 which are described further below. Adjusted operating expenses percentage represents adjusted operating expenses divided by revenue.\n\nAdjusted operating income is defined as operating income, determined in accordance with GAAP, excluding: acquisition-related expenses1; restructuring related expense2; and charitable foundation contribution3 which are described further below. Adjusted operating margin represents adjusted operating income divided by revenue.\n\nAdjusted income before income taxes is defined as income before income taxes, determined in accordance with GAAP, excluding: acquisition-related expenses1; restructuring related expense2; and charitable foundation contribution3 which are described further below.\n\nAdjusted provision for income taxes is defined as provision for income taxes, determined in accordance with GAAP, excluding tax related items4 which are described further below. Adjusted tax rate represents adjusted provision for income taxes divided by adjusted income before income taxes.\n\nAdjusted diluted EPS is defined as diluted EPS, determined in accordance with GAAP, excluding: acquisition-related expenses1; restructuring related expense2; charitable foundation contribution3; and tax related items4 which are described further below.\n\nFree cash flow is defined as net cash provided by operating activities, determined in accordance with GAAP, less additions to property, plant and equipment, net. Free cash flow margin percentage represents free cash flow divided by revenue.\n\n1Acquisition-Related Expenses: Expenses incurred as a result of current and prior period acquisitions and primarily include expenses associated with the fair value adjustments to inventory, property, plant and equipment and amortization of acquisition related intangibles, which include acquired intangibles such as purchased technology and customer relationships. Expenses also include severance payments, equity award accelerations, and the fair value adjustment associated with the replacement of share-based awards related to the Linear Technology acquisition. We excluded these costs from our non-GAAP measures because they relate to specific transactions and are not reflective of our ongoing financial performance.\n\n2Restructuring-Related Expense: Expenses incurred in connection with facility closures, consolidation of manufacturing facilities, severance, other accelerated stock-based compensation expense and other cost reduction efforts. We excluded these expenses from our non-GAAP measures because apart from ongoing expense savings as a result of such items, these expenses have no direct correlation to the operation of our business in the future.\n\n3Charitable Foundation Contribution: Expenses incurred in connection with a one time contribution of registered shares of common stock to the Analog Devices Foundation. We excluded this expense from our non-GAAP measures because this expense has no direct correlation to the operation of our business in the future.\n\n4Tax-Related Items: Income tax effect of the non-GAAP items discussed above and income tax from certain discrete tax items related to the impact of the Tax Cuts and Jobs Act of 2017. We excluded these tax-related items from our non-GAAP measures because they are not associated with the tax expense on our current operating results.\n\nAbout Analog Devices\n\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\nForward Looking Statements\n\nThis press release contains forward-looking statements, which address a variety of subjects including, for example, our statements regarding expected revenue, operating margin, tax rate, earnings per share, and other financial results, expected market trends, market share gains, operating leverage, production and inventory levels, and expected customer demand and order rates for our products, expected product offerings, product development and marketing position. Statements that are not historical facts, including statements about our beliefs, plans and expectations, are forward-looking statements. Such statements are based on our current expectations and are subject to a number of factors and uncertainties, which could cause actual results to differ materially from those described in the forward-looking statements. The following important factors and uncertainties, among others, could cause actual results to differ materially from those described in these forward-looking statements: political and economic uncertainty, including any faltering in global economic conditions or the stability of credit and financial markets, erosion of consumer confidence and declines in customer spending, unavailability of raw materials, services, supplies or manufacturing capacity, changes in geographic, product or customer mix; changes in export classifications, import and export regulations or duties and tariffs; changes in our estimates of our expected tax rate based on current tax law; our ability to successfully integrate acquired businesses and technologies; the risk that expected benefits, synergies and growth prospects of acquisitions may not be fully achieved in a timely manner, or at all; adverse results in litigation matters; and the risk that we will be unable to retain and hire key personnel. For additional information about factors that could cause actual results to differ materially from those described in the forward-looking statements, please refer to our filings with the Securities and Exchange Commission (“SEC”), including the risk factors contained in our most recent Quarterly Report on Form 10-Q and Annual Report on Form 10-K. Forward-looking statements represent management’s current expectations and are inherently uncertain. Except as required by law, we do not undertake any obligation to update forward-looking statements made by us to reflect subsequent events or circumstances.\n\nAnalog Devices and the Analog Devices logo are registered trademarks or trademarks of Analog Devices, Inc. All other trademarks mentioned in this document are the property of their respective owners.\n\n(ADI-WEB)\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005249/en/\nInvestor Contact:\nAnalog Devices, Inc.\nMr. Michael Lucarelli, 781-461-3282\nSr. Director of Investor Relations\ninvestor.relations@analog.com\n\nMedia Contacts:\nTeneo\nMs. Andrea Calise, 917-826-3804\nandrea.calise@teneo.com\n\nTeneo\nMs. Megan Fenton, 917-860-0356\nmegan.fenton@teneo.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Raises Quarterly Dividend By 15%",
        "subtitle": "",
        "date": "Feb 18, 2020 4:40PM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI) today announced that its Board of Directors has voted to increase its quarterly dividend from $0.54 per outstanding share of common stock to $0.62, which is the equivalent of $2.48 annually. The new dividend represents an increase of 15% and marks the Company's 17th increase in the last 16 years. ADI has paid a dividend for 65 consecutive quarters, totaling $6.1 billion of cash returned to shareholders through dividends.\n\n\"Our robust cash flow generation places us in the top 10% of companies in the S&P 500 and we are committed to returning 100% of our free cash flow to shareholders after debt repayments,” said Vincent Roche, President and CEO. “I am confident that we are well positioned to drive sustained growth over the long-term due to our leading-edge technology and diverse business across customers, products and applications.”\n\nThe increase is effective with the dividend payable on March 10, 2020 to shareholders of record as of the close of business on February 28, 2020. The payment of any future quarterly dividends, or a future increase in the quarterly dividend amount, will be at the discretion of the Board and will be dependent upon ADI's financial position, results of operations, outlook, liquidity, and other factors deemed relevant by the Board.\n\nAbout Analog Devices\n\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\n(ADI-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200218006090/en/\nMichael Lucarelli\n781-461-3282\nSr. Director of Investor Relations\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices, Inc. to Report First Quarter Fiscal Year 2020 Financial Results on Wednesday, February 19, 2020",
        "subtitle": "",
        "date": "Jan 24, 2020 4:00PM EST",
        "content": "\nPress release scheduled for 8 a.m. Eastern time on February 19, 2020\n    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI) today announced it will release financial results for the first quarter fiscal year 2020 at 8 a.m. Eastern time on Wednesday, February 19, 2020. Following the press release, the Company will host a conference call at 10:00 a.m. Eastern time, the same day. Vincent Roche, President and Chief Executive Officer, Prashanth Mahendra-Rajah, Senior Vice President, Finance and Chief Financial Officer, and Michael Lucarelli, Director of Investor Relations will discuss ADI’s results and business outlook.\n\nThe conference call can be accessed live on the internet on Analog Devices’ Investor Relations website at investor.analog.com, or by telephone as follows:\n\nDial-in: (800) 859-9560; International: (706) 634-7193\n\nParticipant Passcode: ADI\n\nA replay of the conference call will be available approximately two hours after the call concludes and may be accessed for up to two weeks, by dialing 855-859-2056 and entering the conference ID: 7263078.\n\nBoth the press release and archived version of the webcast will be available at investor.analog.com.\n\nAbout Analog Devices\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\n(ADI-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200124005012/en/\nMichael Lucarelli\nInvestor Relations\nAnalog Devices, Inc.\n781.461.3282\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Collaborates with Hyundai Motor Company to Launch Industry’s First All-Digital Road Noise Cancellation System",
        "subtitle": "",
        "date": "Jan 22, 2020 8:00AM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (ADI) today announced a strategic collaboration with Hyundai Motor Company (HMC) where Hyundai plans to launch the automotive industry’s first all-digital road noise cancellation system leveraging ADI’s Automotive Audio Bus (A2B®) technology. Hyundai also intends to more broadly adopt ADI’s A2B technology for its fundamental audio connectivity and infotainment applications across its automotive fleet.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200122005099/en/Analog Devices Collaborates with Hyundai Motor Company to Launch Industry’s First All-Digital Road Noise Cancellation System. (Photo: Business Wire)\n“As an early A2B adopter, we realized the potential of this technology for not only our Road-noise Active Noise Control (RANC) systems but also for other vehicle applications fundamental to passenger and driver experience,” said Dr. Kang-Duck Ih, Research Fellow, Hyundai. “The low latency guaranteed by A2B enabled us to implement this groundbreaking RANC technology and accelerate its deployment to mass production.” \n\nHyundai’s RANC system dramatically reduces noise within the cabin of a vehicle. The system can analyze various types of noise in real-time and produce inverted soundwaves. For example, there are different types of road noises that the new technology can process, such as resonant sounds created between tires and wheels or rumble sounds coming up from the road.\n\n“We have collaborated closely with Hyundai to architect its all-digital RANC system that leverages our A2B technology to reduce equipment cost, weight, and design complexity, and in turn, improve overall fuel efficiency – helping solve several challenges of the electronic RANC system,” said Patrick Morgan, Vice President, Automotive Electrification and Infotainment, Analog Devices. “ADI’s work with Hyundai demonstrates A2B’s increasing viability and further distinguishes Hyundai’s vehicles in today’s marketplace.”\n\nA2B reduces cabling weight by up to 75 percent and improves automotive fuel efficiency and total system costs. ADI’s A2B is the industry’s lowest latency, high-speed digital interconnect technology distributing audio and control data together with clock and power over a single, unshielded twisted-pair wire. Current deployment of automotive road noise cancellation systems has been constrained by the availability of a cost-effective, low latency networking technology that efficiently connects required input sensors to a central processing unit. ADI’s A2B technology significantly reduces associated wiring harness cost and complexity found in traditional analog-based road noise cancellation system deployments. For more information about A2B, visit: www.analog.com/a2b\n\nADI’s collaboration with Hyundai emphasizes the growing importance of A2B for automotive manufacturers in emerging wiring intensive and latency sensitive applications, including road noise cancellation, in-car communications, and personalized audio or sound zones.\n\nAbout Analog Devices\n\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\nAbout Hyundai Motor Group\n\nHyundai Motor Group is a global corporation that has created a value chain based on automobiles, steel, and construction and includes logistics, finance, IT and service. With about 250,000 employees worldwide, the Group’s automobile brands include Hyundai Motor Co. and Kia Motors Corp and Genesis. Armed with creative thinking, cooperative communication and the will to take on all challenges, we are working to create a better future for all. For more information about Hyundai Motor Group, please visit www.hyundaimotorgroup.com.\n\nForward-Looking Statements\n\nThis release may be deemed to contain forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, among other things, our statements regarding the expected opportunities, benefits and developments associated with the collaboration between Analog Devices, Inc. and Hyundai Motor Company, including the anticipated advancements in technologies, solutions and product development efforts and offerings relating to Hyundai’s use of Analog Devices’ A2B technology, that are based on current expectations, beliefs, assumptions, estimates, forecasts, and projections about the industry and markets in which the companies operate. The statements contained in this release are not guarantees of future performance, are inherently uncertain, involve certain risks, uncertainties, and assumptions that are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed in such forward-looking statements, and such statements should not be relied upon as representing Analog Devices' or Hyundai’s expectations or beliefs as of any date subsequent to the date of this press release. Important factors that could cause actual results to differ materially from the results described, implied or projected in any forward-looking statements include difficulty or delay in our design, development, production and marketing of products, technologies and solutions, including those associated with the collaboration and other risk factors described in the most recent filings of Analog Devices with the Securities and Exchange Commission. Analog Devices does not undertake any obligation to update forward-looking statements made by us.\n\nA2B is a registered trademark of Analog Devices, Inc.\n\nFollow ADI on Twitter at http://www.twitter.com/ADI_News \n\nRead and subscribe to Analog Dialogue, ADI’s monthly technical journal, at: http://www.analog.com/analog-dialogue.html\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200122005099/en/\nLinda Kincaid\nAnalog Devices, Inc.\nLinda.Kincaid@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices to Participate in the J.P. Morgan Tech/Auto Forum",
        "subtitle": "",
        "date": "Jan 3, 2020 4:00PM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI), a leading global high performance analog technology company, today announced that the Company’s Senior Vice President, Finance and Chief Financial Officer, Prashanth Mahendra-Rajah, will speak at the J.P. Morgan 18th Annual Tech/Auto Forum at the 2020 International Consumer Electronics Show in Las Vegas, Nevada on Tuesday, January 7, 2020, at 11:50 a.m. Pacific Time.\n\nThe audio webcast for the conference may be accessed live via the Investor Relations section of Analog Devices’ website at investor.analog.com. An archived replay will also be available shortly following the webcast.\n\nAbout Analog Devices, Inc.\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\n(ADI-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200103005005/en/\nFor more information, please contact:\nMichael Lucarelli\nDirector of Investor Relations\nAnalog Devices, Inc.\n781-461-3282\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Files Patent Infringement Lawsuit Against Xilinx",
        "subtitle": "",
        "date": "Dec 5, 2019 8:00AM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI), a leading global high-performance analog technology company, today announced that it has filed a patent infringement lawsuit against Xilinx, Inc. (Nasdaq: XLNX). The lawsuit focuses on the unauthorized use by Xilinx of several important ADI patents relating to converter technology in at least two of Xilinx’s High End Zynq UltraScale+ RFSoC products.\n\n“ADI is a market leader in analog, mixed-signal and power integrated circuit technologies and has one of the leading patent portfolios in the semiconductor industry. We have built this global leadership position through the diligent work of our employees throughout our company’s 55-year history, and our continued investment in research and development which totaled over $1 billion in the last fiscal year,” said Larry Weiss, Senior Vice President and General Counsel, Analog Devices. “We are committed to defending and protecting our intellectual property, which creates long-term value for all our stakeholders.”\n\nThe lawsuit, filed in the United States District Court for the District of Delaware, seeks damages and an injunction that prevents Xilinx from selling any products that infringe ADI’s patents. The complaint can be viewed at https://www.analog.com/~/media/analog/en/about-adi/corporate/adi-complaint-120419.pdf\n\nAbout Analog Devices\nAnalog Devices is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005174/en/\nMichael DelRossi\nDirector of Public Relations\nAnalog Devices, Inc.\nTel: +1.781.937.1429\nEmail: Michael.DelRossi@analog.com\n\nAnuj Baveja\nFleishmanHillard\nTel: +1.919.334.3782\nEmail: Anuj.Baveja@fleishman.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Rimac Chooses Analog Devices to Enable Precision Battery Management in High Performance Electric Vehicles",
        "subtitle": "",
        "date": "Dec 2, 2019 8:00AM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (ADI) today announced that Rimac Automobili is planning to incorporate ADI’s precision battery management system (BMS) integrated circuits (ICs) into Rimac’s BMS. ADI’s technology provides Rimac’s BMS with the ability to extract maximum energy and capacity out of its batteries by calculating reliable State of Charge and other battery parameters at any given time.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191202005139/en/Rimac Chooses Analog Devices to Enable Precision Battery Management in High Performance Electric Vehicles (Photo: Business Wire)\n\"Rimac is a technology powerhouse in the field of high-performance electric vehicles,” said Rimac CEO Mate Rimac. “We develop and manufacture key electrification systems for many global automotive companies and raise the bar for performance electric vehicles with our own hypercars. Our application of BMS is among the most demanding in the world, requiring the highest accuracy, massive current and voltage draws over very short time scales, and rapid dynamic adjustment within the battery management control system. We have decided to adopt the Analog Devices portfolio of battery management ICs across our complete product line of battery management systems. ADI’s ICs are an integral part of our in-house developed BMS that we are using in our own vehicles, but also for many global car brands. We have benchmarked these ICs in the market and selected Analog Devices for superior precision measurement accuracy and product robustness over the lifetime of the vehicle. We look forward to working with Analog Devices in the future to achieve high performance BMS in our vehicles and battery packs.”\n\nThe Rimac C_Two is a fully electric hypercar capable of speeds of up to 258 miles per hour. With 1,914 horsepower under the hood, the C_Two accelerates 0-60 mph in 1.85 seconds and 0-186 mph in 11.8 seconds. To support these high-performance outputs, the Rimac team designs and engineers superior underlying technologies, such as electric drivetrain and battery packs.\n\nBMS technology acts as the “brains” behind battery packs by managing the output, charging and discharging as well as providing precision measurements during vehicle operation. A BMS also provides vital safeguards to protect the battery from damage. A battery pack consists of groups of individual battery cells that work seamlessly together to deliver maximum power output to the car. If the cells go out of balance, the cells can get stressed leading to premature charge termination and a reduction in the battery’s overall lifetime. ADI’s battery management ICs deliver the highly accurate measurements, resulting in safer vehicle operation and maximizing vehicle range per charge.\n\n“High performance electric vehicles require high precision electronics,” said Patrick Morgan, Vice President, Automotive Electrification and Infotainment, Analog Devices. “Precision accuracy directly translates to maximizing battery capacity and range with fast charging time. We are pleased to support Rimac with our precision battery management ICs for its leading-edge electric vehicle systems with the goal of achieving some of the best performance in the world.”\n\nAnalog Devices offers a broad portfolio of precision battery management ICs serving multiple cell configurations and battery types across a wide range of applications in multiple industries. In addition to electric vehicle battery management systems, applications include on-board chargers (OBCs), high power electrical storage systems (ESS), backup battery systems, and high voltage data acquisition systems.\n\nTo learn more about Analog Devices’ battery management solutions, visit https://www.analog.com/en/products/power-management/battery-management/multicell-battery-stack-monitor.html\n\nAbout Analog Devices\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\nAbout Rimac Automobili\nRimac Automobili was founded in 2009 by Mate Rimac (then 21 y/o), converting his first Guinness-World-Record breaking electric car in a garage. Today, Rimac develops and manufactures key electrification systems for many global automotive companies, and at the same time, raises the bar for performance EVs with their own electric hypercars. This technology powerhouse with headquarters on the outskirts of Zagreb, Croatia, employs around 600 people, with plans for strong future growth. The company is vertically integrated with many of the components produced in-house. The next challenge is to grow from a low volume manufacturer of complex high-end electrification components, to an established Tier-1 supplier for the industry. Rimac plans to open new high-volume production lines for battery packs, powertrain systems and the C_Two hypercar for production starting in 2020 at new facilities currently being established. More information on Rimac Automobili: www.rimac-automobili.com.\n\nForward-Looking Statements\nThis release may be deemed to contain forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. All statements other than historical facts are considered forward-looking statements, including, without limitation, statements regarding Rimac’s plans to incorporate ADI’s products into its electric vehicle systems. The statements contained in this press release are not guarantees of future performance, are inherently uncertain, involve certain risks, uncertainties, and assumptions that are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed in such forward-looking statements, and such statements should not be relied upon as representing Analog Devices' expectations or beliefs as of any date subsequent to the date of this press release. Important factors that could cause actual results to differ materially from the results described, implied or projected in any forward-looking statements include Rimac’s decision to use ADI as a supplier and other risk factors described in ADI’s most recent filings with the Securities and Exchange Commission. We do not undertake any obligation to update forward-looking statements made by us.\n\nFollow ADI on Twitter at http://www.twitter.com/ADI_News \n\nRead and subscribe to Analog Dialogue, ADI’s monthly technical journal, at: http://www.analog.com/analog-dialogue.html\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005139/en/\nLinda Kincaid\nAnalog Devices, Inc.\nLinda.Kincaid@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices to Participate in the Credit Suisse Technology Conference",
        "subtitle": "",
        "date": "Nov 27, 2019 4:00PM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI) today announced that the Company’s President and Chief Executive Officer, Vincent Roche, will speak at the Credit Suisse 23rd Annual Technology Conference in Scottsdale, AZ on Tuesday, December 3rd, at 8:45 a.m. Mountain time.\n\nThe audio webcast for the conference may be accessed live via the Investor Relations section of Analog Devices’ website at investor.analog.com. An archived replay will also be available shortly following the webcast.\n\nAbout Analog Devices, Inc.\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\n(ADI-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191127005615/en/\nMichael Lucarelli\nDirector of Investor Relations\nAnalog Devices, Inc.\n781-461-3282\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Appoints Dr. Susie Wee to Board of Directors",
        "subtitle": "",
        "date": "Nov 26, 2019 4:05PM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI) today announced the appointment of Dr. Susie Wee to the Board of Directors as an independent director, effective November 29, 2019. Dr. Wee is the Senior Vice President and General Manager of DevNet and CX Ecosystem Success at Cisco Systems and will serve on the Board’s Compensation Committee.\n\n“We are pleased to welcome Susie to the ADI Board. Her extensive experience in information technology and application development, together with her established track record of driving software innovation at global technology companies, will be of great value to ADI and our customers,” said Ray Stata, ADI Chairman of the Board. “We look forward to her contributions as ADI continues to play an increasingly important role at the intersection of the physical and digital domains.”\n\nAt Cisco, Dr. Wee leads the DevNet and CX Ecosystem Success group, which is building the ecosystem of customers, partners, IT professionals, and software developers who innovate with Cisco platforms. She also oversees Cisco’s professional training and certification program and founded and leads DevNet, the company’s developer program. Under her leadership, DevNet has become a critical element of Cisco’s transformation strategy to a software company and has grown to a vibrant community of over 500,000 developers. Prior to this, Dr. Wee was the Senior Vice President and Chief Technology Officer of Cisco DevNet and the Vice President & Chief Technology and Experience Officer of Cisco’s Collaboration Technology Group. Before joining Cisco in 2012, Dr. Wee had a 15-year career at Hewlett Packard, where she held a number of leadership positions, including Vice President and General Manager of Experience Software Business, Chief Technology Officer of Client Cloud Services, and Lab Director at HP Labs.\n\nShe is the recipient of many industry awards, including the Red Dot Design Concept Award (2015), Forbes’ 100 Most Powerful Women list (2012), Women in Technology’s Hall of Fame Award (2010), ComputerWorld’s Top 40 Innovators Under 40 (2007), and INCIT’s Technical Excellence Award (2007), among others. She became an IEEE Fellow in 2009 for her contributions in multimedia technology and has more than 50 international publications and 60 granted patents.\n\nDr. Wee earned her S.B., S.M. and Ph.D. degrees in Electrical Engineering and Computer Science from the Massachusetts Institute of Technology.\n\nAbout Analog Devices\n\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005833/en/\nMichael Lucarelli\n781-461-3282\nDirector of Investor Relations\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Reports Fourth Quarter and Fiscal 2019 Results",
        "subtitle": "",
        "date": "Nov 26, 2019 8:00AM EST",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI), a leading global high-performance analog technology company, today announced financial results for its fourth quarter and fiscal 2019, which ended November 2, 2019.\n\n“ADI delivered solid fourth quarter and full-year results amidst continued trade and macro uncertainty,” said Vincent Roche, President and CEO. “Over the course of the year, we generated revenue of $6 billion and effectively managed costs, while continuing to prioritize strategic investments to drive innovation. Our strong margins and cash flow reflect the resiliency of our business model, which enabled us to return nearly $1.4 billion to shareholders, or over 120% of free cash flow after debt payments.”\n\n“Looking ahead, the underlying fundamentals and long-term outlook for ADI are strong. Our diverse product portfolio of cutting-edge technologies is well positioned to solve customers’ challenges and aligned with attractive secular trends that will shape the industry’s future. As such, I believe we are in a superior competitive position as demand returns to deliver our next chapter of growth.”\n\nPerformance for the Fourth Quarter of Fiscal 2019\n\nOutlook for the First Quarter of Fiscal Year 2020 \n\nFor the first quarter of fiscal 2020, we are forecasting revenue of $1.30 billion, +/- $50 million. At the midpoint of this revenue outlook, we expect reported operating margins of approximately 23.7%, and adjusted operating margins of approximately 36.7%. We are planning for reported EPS to be $0.61, +/- $0.07, and adjusted EPS to be $1.00, +/- $0.07.\n\nOur first quarter fiscal 2020 outlook is based on current expectations and actual results may differ materially, as a result of, among other things, the important factors discussed at the end of this release. These statements supersede all prior statements regarding our business outlook set forth in prior ADI news releases, and ADI disclaims any obligation to update these forward-looking statements.\n\nThe adjusted results and adjusted anticipated results above are financial measures presented on a non-GAAP basis. Reconciliations of these non-GAAP financial measures to their most directly comparable GAAP financial measures are provided in the financial tables included in this press release. See also “Non-GAAP Financial Information” section for additional information.\n\nDividend Payment \n\nThe ADI Board of Directors has declared a quarterly cash dividend of $0.54 per outstanding share of common stock. The dividend will be paid on December 17, 2019 to all shareholders of record at the close of business on December 6, 2019.\n\nConference Call Scheduled for Today, Tuesday, November 26, 2019 at 10:00 am ET\n\nADI will host a conference call to discuss our fourth quarter fiscal 2019 results and short-term outlook today, beginning at 10:00 am ET. Investors may join via webcast, accessible at investor.analog.com, or by telephone (call 706-634-7193 ten minutes before the call begins and provide the password \"ADI\").\n\nA replay will be available two hours after the completion of the call. The replay may be accessed for up to two weeks by dialing 855-859-2056 (replay only) and providing the conference ID: 9099003, or by visiting investor.analog.com.\n\nNon-GAAP Financial Information \n\nThis release includes non-GAAP financial measures that are not in accordance with, nor an alternative to, generally accepted accounting principles (GAAP) and may be different from non-GAAP measures presented by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. These non-GAAP measures have material limitations in that they do not reflect all of the amounts associated with the Company’s results of operations as determined in accordance with GAAP and should not be considered in isolation from, or as a substitute for, the Company’s financial results presented in accordance with GAAP. The Company’s use of non-GAAP measures, and the underlying methodology when including or excluding certain items, is not necessarily an indication of the results of operations that may be expected in the future, or that the Company will not, in fact, record such items in future periods. You are cautioned not to place undue reliance on these non-GAAP measures. Reconciliations of these non-GAAP measures to the most directly comparable financial measures calculated and presented in accordance with GAAP are provided in the financial tables included in this release.\n\nManagement uses non-GAAP measures internally to evaluate the Company’s operating performance from continuing operations against past periods and to budget and allocate resources in future periods. These non-GAAP measures also assist management in evaluating the Company’s core business and trends across different reporting periods on a consistent basis. Management also uses these non-GAAP measures as the primary performance measurement when communicating with analysts and investors regarding the Company’s earnings results and outlook and believes that the presentation of these non-GAAP measures is useful to investors because it provides investors with the operating results that management uses to manage the Company and enables investors and analysts to evaluate the Company’s core business. Management also believes that the non-GAAP liquidity measure free cash flow is useful both internally and to investors because it provides information about the amount of cash generated after capital expenditures that is then available to repay debt obligations, make investments and fund acquisitions, and for certain other activities.\n\nThe non-GAAP financial measures referenced by ADI in this release include: adjusted gross margin, adjusted gross margin percentage, adjusted operating expenses, adjusted operating expenses percentage, adjusted operating income, adjusted operating margin, adjusted income before income taxes, adjusted provision for income taxes, adjusted tax rate, adjusted diluted earnings per share (EPS), free cash flow, and free cash flow margin percentage.\n\nAdjusted gross margin is defined as gross margin, determined in accordance with GAAP, excluding certain acquisition-related expenses1 which are described further below. Adjusted gross margin percentage represents adjusted gross margin divided by revenue.\n\nAdjusted operating expenses is defined as operating expenses, determined in accordance with GAAP, excluding: certain acquisition-related expenses1; acquisition-related transaction costs2; accelerated stock-based compensation expense3; and restructuring related expense4 which are described further below. Adjusted operating expenses percentage represents adjusted operating expenses divided by revenue.\n\nAdjusted operating income is defined as operating income, determined in accordance with GAAP, excluding: acquisition-related expenses1; acquisition-related transaction costs2; accelerated stock-based compensation expense3; and restructuring related expense4 which are described further below. Adjusted operating margin represents adjusted operating income divided by revenue.\n\nAdjusted income before income taxes is defined as income before income taxes, determined in accordance with GAAP, excluding: acquisition-related expenses1; acquisition-related transaction costs2; accelerated stock-based compensation expense3; and restructuring related expense4 which are described further below.\n\nAdjusted provision for income taxes is defined as provision for income taxes, determined in accordance with GAAP, excluding tax related items5 described further below. Adjusted tax rate represents adjusted provision for income taxes divided by adjusted income before income taxes.\n\nAdjusted diluted EPS is defined as diluted EPS, determined in accordance with GAAP, excluding: acquisition-related expenses1; acquisition-related transaction costs2; accelerated stock-based compensation expense3; restructuring related expense4; and tax related items5 which are described further below.\n\nFree cash flow is defined as net cash provided by operating activities, determined in accordance with GAAP, less additions to property, plant and equipment, net. Free cash flow margin percentage represents free cash flow divided by revenue.\n\n1Acquisition-Related Expenses: Expenses incurred as a result of current and prior period acquisitions and primarily include expenses associated with the fair value adjustments to inventory, property, plant and equipment and amortization of acquisition related intangibles, which include acquired intangibles such as purchased technology and customer relationships. Expenses also include severance payments, equity award accelerations and the fair value adjustment associated with the replacement of share-based awards related to the Linear Technology acquisition. We excluded these costs from our non-GAAP measures because they relate to specific transactions and are not reflective of our ongoing financial performance.\n\n2Acquisition-Related Transaction Costs: Costs directly related to the Linear Technology acquisition, including legal, accounting and other professional fees, as well as integration-related costs. We excluded these costs from our non-GAAP measures because they relate to a specific transaction and are not reflective of our ongoing financial performance.\n\n3Accelerated Stock-Based Compensation Expense: Stock-based compensation expense for one former executive officer due to the accelerated vesting of restricted stock units and stock options resulting from a reduction in the requisite service period for each in accordance with the terms of the applicable agreements. We excluded these costs because accelerated stock-based compensation expense and the related tax effect have no direct correlation to the operation of our business in the future.\n\n4Restructuring-Related Expense: Expenses incurred in connection with facility closures, consolidation of manufacturing facilities, severance, other accelerated stock-based compensation expense and other cost reduction efforts. We excluded these expenses from our non-GAAP measures because apart from ongoing expense savings as a result of such items, these expenses have no direct correlation to the operation of our business in the future.\n\n5Tax-Related Items: Tax adjustments associated with the non-GAAP items discussed above, discrete tax items including tax expense or benefit related to prior periods, income tax from prior period tax credits, income tax on certain inventory intra-entity transfers, tax expense or benefit related to the impact of the Tax Cuts and Jobs Act of 2017 and other deferred tax recalibration adjustments, income tax from state valuation allowance adjustments, income tax from certain uncertain tax positions, and the impact of a voluntary accounting policy change. We excluded these tax-related items from our non-GAAP measures because they are not associated with the tax expense on our current operating results.\n\nAbout Analog Devices\n\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\nForward Looking Statements \n\nThis press release contains forward-looking statements, which address a variety of subjects including, for example, our statements regarding expected revenue, operating margin, tax rate, earnings per share, and other financial results, expected market trends, market share gains, operating leverage, production and inventory levels, and expected customer demand and order rates for our products, expected product offerings, product development and marketing position. Statements that are not historical facts, including statements about our beliefs, plans and expectations, are forward-looking statements. Such statements are based on our current expectations and are subject to a number of factors and uncertainties, which could cause actual results to differ materially from those described in the forward-looking statements. The following important factors and uncertainties, among others, could cause actual results to differ materially from those described in these forward-looking statements: political and economic uncertainty, including any faltering in global economic conditions or the stability of credit and financial markets, erosion of consumer confidence and declines in customer spending, unavailability of raw materials, services, supplies or manufacturing capacity, changes in geographic, product or customer mix; changes in export classifications, import and export regulations or duties and tariffs; changes in our estimates of our expected tax rate based on current tax law; our ability to successfully integrate acquired businesses and technologies; the risk that expected benefits, synergies and growth prospects of acquisitions may not be fully achieved in a timely manner, or at all; adverse results in litigation matters; and the risk that we will be unable to retain and hire key personnel. For additional information about factors that could cause actual results to differ materially from those described in the forward-looking statements, please refer to our filings with the Securities and Exchange Commission (“SEC”), including the risk factors contained in our most recent Quarterly Report on Form 10-Q and Annual Report on Form 10-K. Forward-looking statements represent management’s current expectations and are inherently uncertain. Except as required by law, we do not undertake any obligation to update forward-looking statements made by us to reflect subsequent events or circumstances.\n\nAnalog Devices and the Analog Devices logo are registered trademarks or trademarks of Analog Devices, Inc. All other trademarks mentioned in this document are the property of their respective owners.\n\n(ADI-WEB)\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005249/en/\nInvestor Contact:\nAnalog Devices, Inc.\nMr. Michael Lucarelli, 781-461-3282\nDirector of Investor Relations\ninvestor.relations@analog.com\n\nMedia Contacts:\nTeneo\nAndrea Calise, 917-826-3804\nandrea.calise@teneo.com\n\nTeneo\nMegan Fenton, 917-860-0356\nmegan.fenton@teneo.com \nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices, Inc. to Report Fourth Quarter and Fiscal Year 2019 Financial Results on Tuesday, November 26, 2019",
        "subtitle": "",
        "date": "Oct 31, 2019 4:00PM EDT",
        "content": "\n- Press release scheduled for 8 a.m. Eastern time on November 26, 2019\n    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (Nasdaq: ADI) today announced it will release financial results for the fourth quarter and fiscal year 2019 at 8 a.m. Eastern time on Tuesday, November 26, 2019. Following the press release, the Company will host a conference call at 10:00 a.m. Eastern time, the same day. Vincent Roche, President and Chief Executive Officer, Prashanth Mahendra-Rajah, Senior Vice President, Finance and Chief Financial Officer, and Michael Lucarelli, Director of Investor Relations will discuss ADI’s results and business outlook.\n\nThe conference call can be accessed live on the internet on Analog Devices’ Investor Relations website at investor.analog.com, or by telephone as follows:\n\nDial-in: (800) 859-9560; International: (706) 634-7193\n\nParticipant Passcode: ADI\n\nA replay of the conference call will be available approximately two hours after the call concludes and may be accessed for up to two weeks, by dialing 855-859-2056 and entering the conference ID: 9099003.\n\nBoth the press release and archived version of the webcast will be available at investor.analog.com.\n\nAbout Analog Devices\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\n(ADI-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191031005824/en/\nMichael Lucarelli\nInvestor Relations\nAnalog Devices, Inc.\n781.461.3282\ninvestor.relations@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Analog Devices Acquires Test Motors to Expand Condition-Based Monitoring Offerings for Industry 4.0",
        "subtitle": "",
        "date": "Oct 29, 2019 11:00AM EDT",
        "content": "    NORWOOD, Mass.--(BUSINESS WIRE)--\nAnalog Devices, Inc. (ADI) today announced the acquisition of Test Motors, a company specializing in predictive maintenance of electric motors and generators. Based in Barcelona, Spain, Test Motors offers products and services that detect faults in electric motors before they cause damage to production cycles and advises on how and when to repair them. The acquisition expands ADI’s portfolio of condition-based monitoring solutions capable of identifying equipment faults before downtime and catastrophic failure occur.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191029005751/en/Analog Devices Acquires Test Motors to Expand Condition-Based Monitoring Offerings for Industry 4.0 (Photo: Business Wire)\nThis acquisition builds on Analog Devices’ 2018 addition of OtoSense, a startup that developed “sensing interpretation” software able to learn and recognize sounds or vibration and identify potential problems in a factory machine or a car’s engine before they become severe. OtoSense’s artificial intelligence (AI) platform is dedicated to sensing interpretation and enabling the monitoring of any asset, wherever located. Analog Devices plans to combine software from OtoSense with Test Motors’ monitoring capabilities to create solutions that offer an advanced, wholistic snapshot of machine health by capturing a wider breadth of potential faults.\n\n“Machine maintenance relies heavily on experienced technicians and engineers able to detect and diagnose issues that can lead to unplanned downtime,” said Kevin Carlin, Vice President Automation and Energy Group, Analog Devices. “There are not enough trained professionals, however, to keep up with the demand as the number of machines to maintain rapidly grows. ADI’s condition-based monitoring applications, driven by the acquisitions of Test Motors and OtoSense, will tackle this expert resource challenge by providing customers with a system able to perform complete and early detection of anomalies to avoid unexpected and costly machine downtime.”\n\nThe Test Motors team will join ADI’s Automation and Energy Group and operate as a key technology group. Financial terms of the acquisition were not disclosed.\n\n“We are excited to become part of Analog Devices and work with its team of industrial technology experts,” said Emili Valero, Test Motors’ former CEO. “The combining of our technology and expertise will enable us to develop the next generation of condition-based monitoring solutions designed to greatly extend manufacturing equipment life for electrical and non-electrical rotating machines and deliver significant cost savings that benefit both businesses and consumers.”\n\nADI’s Condition-based Monitoring Solutions\n\nCondition-based monitoring is not about any single technology but instead a system-level solution that requires a combination of technologies and solution considerations. Analog Devices’ technology portfolio enables these solutions with breakthroughs in MEMS (microelectromechanical systems) sensors, flexible signal conditioning and data conversion technologies, processing and communications solutions with the power portfolio to deliver optimized wireless and wired condition-based monitoring solutions. Combining these technologies into a deployable solution requires domain expertise in the form of asset and application insights, mechanical design and attachment considerations, and the ability to convert the information into diagnostic algorithms.\n\nAbout Analog Devices\n\nAnalog Devices (Nasdaq: ADI) is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\nAbout Test Motors\n\nTest Motors is a company located in Barcelona, ​​Spain, which is dedicated to developing high-tech solutions for the detection of any type of failure in rotary electric machines of any type. In this way, we allow our customers to save maintenance costs and avoid unforeseen stops in the production process. Visit http://www.testmotors.com/en/.\n\nForward-Looking Statements\n\nThis release may be deemed to contain forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, among other things, our statements regarding the expected opportunities, benefits and product developments associated with the acquisitions of Test Motors and OtoSense, including the anticipated advancements in technologies, solutions and product development efforts and offerings, that are based on our current expectations, beliefs, assumptions, estimates, forecasts, and projections about the industry and markets in which Analog Devices operates. The statements contained in this release are not guarantees of future performance, are inherently uncertain, involve certain risks, uncertainties, and assumptions that are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed in such forward-looking statements, and such statements should not be relied upon as representing Analog Devices' expectations or beliefs as of any date subsequent to the date of this press release. Important factors that could cause actual results to differ materially from the results described, implied or projected in any forward-looking statements include difficulty or delay in our design, development, production and marketing of products, technologies and solutions and other risk factors described in our most recent filings with the Securities and Exchange Commission. We do not undertake any obligation to update forward-looking statements made by us.\n\nFollow ADI on Twitter at http://www.twitter.com/ADI_News\n\nSubscribe to Analog Dialogue, ADI’s monthly technical journal, at: http://www.analog.com/analog-dialogue/\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005751/en/\nLinda Kincaid\nAnalog Devices, Inc.\nlinda.kincaid@analog.com\nSource: Analog Devices, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Analog Devices, ConocoPhillips, JPMorgan Chase, Microsoft, or Tesla?",
        "subtitle": "",
        "date": "Oct 8, 2019 9:31AM EDT",
        "content": " NEW YORK, Oct. 8, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ADI, COP, JPM, MSFT, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-analog-devices-conocophillips-jpmorgan-chase-microsoft-or-tesla-300933870.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Analog Garage to Hold Event on Autonomous Driving’s Future",
        "subtitle": "",
        "date": "Sep 24, 2019 1:00PM EDT",
        "content": "    BOSTON--(BUSINESS WIRE)--\nFew technology innovations are creating as much buzz as autonomous vehicles—remarkably complex cars combining radar, LIDAR, GPS and vision to revolutionize transportation. As a global technology innovation hub, Boston is on the frontline of driving autonomous vehicles from concept to reality. Last October, Analog Devices, Inc. (ADI) and BostInno came together to host an Autonomous Vehicle State of Innovation event. One year later both return to host a second event to update the Boston innovation community on the technical, regulatory and business challenges surrounding these vehicles, as well as share insights on when fully autonomous vehicles will become a reality.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190924005787/en/\nThe autonomous driving event will take place on October 3 from 5:30 PM – 8:00 PM at Analog Garage, ADI’s technology incubator. The event will feature a panel discussion moderated by Gabi Zijderveld, Chief Marketing Officer and Head of Product Strategy at Affectiva. Panelists include:\n\nThe event is open to the public and tickets can be purchased in advance at https://www.eventbrite.com/autonomous-vehicles. Analog Devices is located at 125 Summer St. in Boston, conveniently located near Boston’s South Station. Parking is also available.\n\nAbout Analog Garage\nAnalog Garage helps turn disruptive ideas into tomorrow’s realities, providing entrepreneurs with a path to propose, explore, and scale new technologies and business models. The incubator partners, mentors, and finances entrepreneurs with ideas that solve hard problems in the real world; the noisy, the messy, the difficult: the analog world.\n\nAbout Analog Devices\nAnalog Devices is a leading global high-performance analog technology company dedicated to solving the toughest engineering challenges. We enable our customers to interpret the world around us by intelligently bridging the physical and digital with unmatched technologies that sense, measure, power, connect and interpret. Visit http://www.analog.com.\n\nFollow ADI on Twitter at http://www.twitter.com/ADI_News\n\nSubscribe to Analog Dialogue, ADI’s monthly technical journal, at: http://www.analog.com/analog-dialogue/ \nView source version on businesswire.com: https://www.businesswire.com/news/home/20190924005787/en/\nLinda Kincaid\nAnalog Devices, Inc.\nlinda.kincaid@analog.com\nSource: Analog Devices, Inc."
    }
]