[
    {
        "title": "ADP National Employment Report: Private Sector Employment Increased by 183,000 Jobs in February",
        "subtitle": "",
        "date": "Mar 4, 2020 8:15AM EST",
        "content": "ROSELAND, N.J., March 4, 2020 /PRNewswire/ -- Private sector employment increased by 183,000 jobs from January to February according to the February ADP National Employment Report®.  Broadly distributed to the public each month, free of charge, the ADP National Employment Report is produced by the ADP Research Institute® in collaboration with Moody's Analytics.  The report, which is derived from ADP's actual payroll data, measures the change in total nonfarm private employment each month on a seasonally-adjusted basis.  February 2020 Report Highlights*View the ADP National Employment Report Infographic at www.adpemploymentreport.com.Total U.S. Nonfarm Private Employment:     183,000By Company Size - Small businesses:      24,000- Medium businesses:      26,000 - Large businesses:      133,000 By Sector- Goods-producing:      11,000- Service-providing:      172,000* Sum of components may not equal total, due to rounding. - Franchise Employment****Complete details on franchise employment can be found here.\"The labor market remains firm, as private-sector payrolls continued to expand in February,\" said Ahu Yildirmaz, vice president and co-head of the ADP Research Institute. \"Job creation remained heavily concentrated in large companies, which continue to be the strongest performer.\"Mark Zandi, chief economist of Moody's Analytics, said, \"COVID-19 will need to break through the job market firewall if it is to do significant damage to the economy. The firewall has some cracks, but judging by the February employment gain it should be strong enough to weather most scenarios.\"The matched sample used to develop the ADP National Employment Report was derived from ADP payroll data, which represents 460,000 U.S. clients employing nearly 26 million workers in the U.S.  The January total of jobs added was revised down from 291,000 to 209,000. In February's report, the following scheduled annual revisions have been reflected in the estimates of employment shown in the ADP National Employment Report: Beginning with its March 4, 2020 report, the ADP National Employment Report's methodology was updated. To reference, please visit the Frequently Asked Questions document. To obtain additional information about the ADP National Employment Report, including additional charts, supporting data and the schedule of future release dates, or to subscribe to the monthly email alerts and RSS feeds, please visit www.adpemploymentreport.com.The March 2020 ADP National Employment Report will be released at 8:15 a.m. ET on April 1, 2020.About the ADP National Employment Report®The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 26 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights. We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About Moody's Analytics Moody's Analytics provides financial intelligence and analytical tools to help business leaders make better, faster decisions. Our deep risk expertise, expansive information resources, and innovative application of technology help our clients confidently navigate an evolving marketplace. We are known for our industry-leading and award-winning solutions, made up of research, data, software, and professional services, assembled to deliver a seamless customer experience. We create confidence in thousands of organizations worldwide, with our commitment to excellence, open mindset approach, and focus on meeting customer needs.About ADP (NASDAQ – ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll. Informed by data and designed for people.   Learn more at ADP.comADP, the ADP logo, and Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report, and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2020 ADP, LLC.  All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-national-employment-report-private-sector-employment-increased-by-183-000-jobs-in-february-301016313.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "February 2020 ADP National Employment Report®, ADP Small Business Report® and ADP National Franchise Report® to be Released on Wednesday, March 4, 2020",
        "subtitle": "",
        "date": "Feb 26, 2020 8:15AM EST",
        "content": "ROSELAND, N.J., Feb. 26, 2020 /PRNewswire/ --WHAT: ADP Research Institute® will release the February findings of the ADP National Employment Report, ADP Small Business Report and ADP National Franchise Report on Wednesday, March 4, 2020 at 8:15 a.m. ET. Due to the important contribution that small businesses make to economic growth, ADP Research Institute issues the ADP Small Business Report independently of the ADP National Employment Report.  The ADP Small Business Report offers detailed private sector employment data that are specific to businesses with 49 or fewer employees.Broadly distributed to the public each month, free of charge, the ADP National Employment Report and ADP Small Business Report are derived from ADP payroll data representing 411,000 U.S. clients and nearly 24 million workers, and are published by the ADP Research Institute in collaboration with Moody's Analytics.The ADP National Franchise Report measures monthly changes in franchise employment.  The matched sample used to develop the ADP National Franchise Report is derived from ADP payroll data, which represents 15,000 franchisors and franchisees employing nearly one million U.S. workers.WHEN: Wednesday, March 4, 2020, 8:15 a.m. ET Conference Call for Media to follow at 8:30 a.m. ET:Following the release of the ADP National Employment Report, Moody's Analytics Chief Economist Mark Zandi will provide context on the employment data and answer questions from media during a conference call. Journalists are invited to access the call by dialing: 1-800-675-6207NOTE: This is an operator-assisted conference call dial-in number and there is no passcode required.About the ADP National Employment Report®:The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 24 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute:  The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights.  We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About ADP (NASDAQ: ADP): Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits, and Payroll. Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners.Copyright © 2020 ADP, LLC. All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/february-2020-adp-national-employment-report-adp-small-business-report-and-adp-national-franchise-report-to-be-released-on-wednesday-march-4-2020-301011359.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "ADP National Employment Report: Private Sector Employment Increased by 291,000 Jobs in January",
        "subtitle": "",
        "date": "Feb 5, 2020 8:15AM EST",
        "content": "ROSELAND, N.J., Feb. 5, 2020 /PRNewswire/ -- Private sector employment increased by 291,000 jobs from December to January according to the January ADP National Employment Report®.  Broadly distributed to the public each month, free of charge, the ADP National Employment Report is produced by the ADP Research Institute® in collaboration with Moody's Analytics.  The report, which is derived from ADP's actual payroll data, measures the change in total nonfarm private employment each month on a seasonally-adjusted basis.  January 2020 Report Highlights*View the ADP National Employment Report Infographic at www.adpemploymentreport.com.Total U.S. Nonfarm Private Employment:     291,000By Company Size - Small businesses:     94,000- Medium businesses:     128,000- Large businesses:     69,000By Sector- Goods-producing:     54,000- Service-providing:     237,000* Sum of components may not equal total, due to rounding. - Franchise Employment****Complete details on franchise employment can be found here.\"The labor market experienced expanded payrolls in January,\" said Ahu Yildirmaz, vice president and co-head of the ADP Research Institute. \"Goods producers added jobs, particularly in construction and manufacturing, while service providers experienced a large gain, led by leisure and hospitality. Job creation was strong among midsized companies, though small companies enjoyed the strongest performance in the last 18 months.\"Mark Zandi, chief economist of Moody's Analytics, said, \"Mild winter weather provided a significant boost to the January employment gain. The leisure and hospitality and construction industries in particular experienced an outsized increase in jobs. Abstracting from the vagaries of the data underlying job growth is close to 125,000 per month, which is consistent with low and stable unemployment.\"The matched sample used to develop the ADP National Employment Report was derived from ADP payroll data, which represents 411,000 U.S. clients employing nearly 24 million workers in the U.S.  The December total of jobs added was revised down from 202,000 to 199,000.To obtain additional information about the ADP National Employment Report, including additional charts, supporting data and the schedule of future release dates, or to subscribe to the monthly email alerts and RSS feeds, please visit www.adpemploymentreport.com.The February 2020 ADP National Employment Report will be released at 8:15 a.m. ET on March 4, 2020.About the ADP National Employment Report® The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 24 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute  The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights. We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About Moody's Analytics Moody's Analytics provides financial intelligence and analytical tools to help business leaders make better, faster decisions. Our deep risk expertise, expansive information resources, and innovative application of technology help our clients confidently navigate an evolving marketplace. We are known for our industry-leading and award-winning solutions, made up of research, data, software, and professional services, assembled to deliver a seamless customer experience. We create confidence in thousands of organizations worldwide, with our commitment to excellence, open mindset approach, and focus on meeting customer needs.About ADP (NASDAQ – ADP) Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll. Informed by data and designed for people.   Learn more at ADP.comADP, the ADP logo, and Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report, and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2020 ADP, LLC.  All rights reserved.ADP-Media View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-national-employment-report-private-sector-employment-increased-by-291-000-jobs-in-january-300999446.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "ADP Research Institute® Report Reveals the Gig Workforce is Filling a Void in the Tight Labor Market",
        "subtitle": "",
        "date": "Feb 4, 2020 8:30AM EST",
        "content": "ROSELAND, N.J., Feb. 4, 2020 /PRNewswire/ -- While technology and innovation are transforming the way we work, they are also directly impacting why, when and where we work. In a first-of-its-kind study, the ADP Research Institute puts the spotlight on the gig workforce in organizations, often described as a hidden or 'shadow workforce.'  The research report titled, Illuminating the Shadow Workforce: Insights into the Gig Workforce in Businesses, reveals tenured workers and retirees are capitalizing on the tight U.S. labor market and the need for skilled workers, by turning to gig work.  The report also found 1 in 6 enterprise workers are actually gig workers paid as either 1099-MISC (1099-M) workers or short-term W-2 employees working one to six months.  The report takes a close look at their compensation, varied skill sets, and motivations. Backed by anonymized payroll data of 18 million workers from 75,000 companies, coupled with 16,800 direct survey responses from traditional employees and gig workers, and 21 C-level executive interviews, the research shows that this changing composition of the workforce has significant talent management, budget and compliance implications for businesses of all sizes. In addition, the ADP Research Institute identified two worlds of gig workers in businesses.  The first is comprised of 1099-M contractors who are independent contractors, often hired for their skillset on a project basis.  These skilled, tenured workers tend to be older, highly educated and choose to work on what they enjoy.  In fact, 30% of 1099-M gig workers are aged 55 or older. For some, their gig work is supplemental income to their retirement savings.  The second includes short-term W-2 employees who are younger, less educated, have a lower income, and are typically working on a seasonal or on-call hire basis. \"It is clear there is a fundamental shift in the workforce as innovation continues to transform work, increasing the demand for skilled workers,\" said Ahu Yildirmaz, co-head of the ADP Research Institute.  \"To bridge the talent gap in today's tight labor market, many companies are hiring skilled workers at a premium. Our research shows that companies are turning to tenured, skilled workers and retirees on a gig-basis to meet this growing demand.\" Spotlight on the Gig Employment and Key Findings Following are additional takeaways from the report: Added Yildirmaz, \"While the term 'gig worker' has seamlessly integrated into our vernacular and culture, there has been no real data-driven insight into the gig workforce in the enterprise space.  This 'shadow workforce' is comprised of workers with vast skillsets, who work across all industries and in all regions of the U.S.  Additionally, we have found that the majority of these workers are doing gig work out of preference.\"To see the detailed report, Illuminating the Shadow Workforce: Insights into the Gig Workforce in Businesses, including all data and insights, please download the report here.About the ADP Research Institute The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights.  We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About ADP (NASDAQ: ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits, and Payroll. Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, Always Designing for People and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners.Copyright © 2020 ADP, LLC. All rights reserved.ADP-Media View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-research-institute-report-reveals-the-gig-workforce-is-filling-a-void-in-the-tight-labor-market-300998593.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "January 2020 ADP National Employment Report®, ADP Small Business Report® and ADP National Franchise Report® to be Released on Wednesday, February 5, 2020",
        "subtitle": "",
        "date": "Jan 29, 2020 8:15AM EST",
        "content": "ROSELAND, N.J., Jan. 29, 2020 /PRNewswire/ -- WHAT:  ADP Research Institute® will release the January findings of the ADP National Employment Report, ADP Small Business Report and ADP National Franchise Report on Wednesday, February 5, 2020 at 8:15 a.m. ET. Due to the important contribution that small businesses make to economic growth, ADP Research Institute issues the ADP Small Business Report independently of the ADP National Employment Report.  The ADP Small Business Report offers detailed private sector employment data that are specific to businesses with 49 or fewer employees.Broadly distributed to the public each month, free of charge, the ADP National Employment Report and ADP Small Business Report are derived from ADP payroll data representing 411,000 U.S. clients and nearly 24 million workers, and are published by the ADP Research Institute in collaboration with Moody's Analytics.The ADP National Franchise Report measures monthly changes in franchise employment.  The matched sample used to develop the ADP National Franchise Report is derived from ADP payroll data, which represents 15,000 franchisors and franchisees employing nearly one million U.S. workers.WHEN:  Wednesday, February 5, 2020, 8:15 a.m. ET Conference Call for Media to follow at 8:30 a.m. ET:Following the release of the ADP National Employment Report, Moody's Analytics Chief Economist Mark Zandi will provide context on the employment data and answer questions from media during a conference call. Journalists are invited to access the call by dialing: 1-800-675-6207NOTE: This is an operator-assisted conference call dial-in number and there is no passcode required.About the ADP National Employment Report®:The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 24 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute:  The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights.  We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About ADP (NASDAQ: ADP): Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits, and Payroll. Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners.Copyright © 2020 ADP, LLC. All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/january-2020-adp-national-employment-report-adp-small-business-report-and-adp-national-franchise-report-to-be-released-on-wednesday-february-5-2020-300994915.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "Ventana Research Ranks ADP Number One Leader in 2020 Value Index on Payroll Software",
        "subtitle": "",
        "date": "Jan 27, 2020 9:00AM EST",
        "content": "ROSELAND, N.J., Jan. 27, 2020 /PRNewswire/ -- ADP, a leading global technology company providing human capital management (HCM) solutions, has been ranked first Leader Overall in Ventana Research's 2020 Value Index on Payroll Software.  Covering both product and customer assurance categories, the Index highlights ADP's robust set of capabilities and payroll coverage as well as its advanced analytics for benchmarking and machine learning.  Additionally, ADP was ranked a Leader in the Product, Usability, Manageability, Reliability, and Capability categories. The Ventana Value Index for Payroll Software is both an analytical and graphic representation of vendor offerings based on an evaluation of how well vendors meet buyer requirements for software that enables and supports the payroll function.  The index evaluates the software in seven key categories that align to either Product or Customer Assurance.  Five categories align to Product, including Usability, Manageability, Reliability, Capability, and Adaptability.  Two categories align to Customer Assurance, including Vendor Validation and Total Cost of Ownership & Return on Investment. \"ADP has been a longtime leader in the payroll software and services market, and its ranking in our just published Payroll Software Value Index research largely justifies its reputation,\" said Steve Goldberg, VP and research director at Ventana Research.  \"ADP was ranked overall Value Index leader and a leader across our aggregated Product categories due to its modern payroll capabilities and areas of differentiation, as well as its robust technology platform attributes.  ADP DataCloud also allows organizations to leverage best-in-class benchmarking and related analytics, which also factored into ADP's position as overall Value Index leader for Payroll Software.\"\"We are honored to be named the top overall Leader by Ventana Research in the 2020 Value Index on Payroll Software,\" said Don Weinstein, corporate vice president of global product and technology for ADP.  \"From the demand for flexible pay to the gig economy and evolving compliance requirements, the needs of the workforce are changing, and businesses must adapt.  We are continuously innovating to provide clients with integrated solutions and valuable analytics that can help them successfully navigate the future of work and achieve their full potential.\"      Among ADP's strengths, Ventana Research noted ADP's significant industry expertise and payroll coverage across 140 countries, highlighting its acquisition of Celergo last year.  The evaluation additionally noted ADP's modern capabilities, including its DataCloud analytics platform, which can be leveraged to benchmark salaries and identify any equity gaps, as well as WorkMarket, an ADP company, which provides a freelance workforce management solution. To access Ventana Research's 2020 Value Index for Payroll Software covering ADP's payroll solutions, please visit here. About ADP (NASDAQ: ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, and Always Designing for People, are trademarks of ADP, LLC.  All other marks are the property of their respective owners.Copyright © 2020 ADP, LLC.  All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/ventana-research-ranks-adp-number-one-leader-in-2020-value-index-on-payroll-software-300993512.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "ADP Achieves a Perfect Score in Workplace Equality for 11th Straight Year",
        "subtitle": "",
        "date": "Jan 23, 2020 10:25AM EST",
        "content": "ROSELAND, N.J., Jan. 23, 2020 /PRNewswire/ -- ADP, a leading global technology company providing human capital management (HCM) solutions, received a 100 percent rating in the 2020 Human Rights Campaign Foundation's (HRC) Corporate Equality Index (CEI), earning the designation as a Best Place to Work for LGBTQ Equality.  This marks the 11th consecutive year ADP has earned a perfect score in the HRC CEI.The 2020 CEI evaluates LGBTQ-related policies and practices including non-discrimination workplace protections, domestic partner benefits, transgender-inclusive health care benefits, competency programs, and public engagement with the LGBTQ community.  This year, ADP was once again recognized by the HRC as a preeminent employer for its commitment to workplace equality and its ability to offer safe and fair working environments for employees of every sexual orientation, gender identity and expression.  In all criteria for the 2020 CEI, ADP received the highest possible rating.\"Creating a better world of work where everyone feels engaged and empowered to achieve their full potential is core to our purpose at ADP,\" said Aisha Thomas-Petit, chief diversity, inclusion and corporate social responsibility officer of ADP.  \"We believe an engaged, inclusive and diverse workforce attracts top talent, galvanizes our creativity, drives innovation and leads to better products and services.  We are extremely proud to see that our efforts have earned a perfect score on the 2020 CEI.\" \"The impact of the Human Rights Campaign's Corporate Equality Index over its 18-year history is profound.  In this time, the corporate community has worked with us to adopt LGBTQ-inclusive policies, practices and benefits, establishing the Corporate Equality Index as a primary driving force for LGBTQ workplace inclusion in America and across the globe,\" said HRC President Alphonso David.  \"These companies know that protecting their LGBTQ employees and customers from discrimination is not just the right thing to do -- it is also the best business decision.  In addition, many of these leaders are also advocating for the LGBTQ community and equality under the law in the public square.  From supporting LGBTQ civil rights protections in the U.S. through HRC's Business Coalition for the Equality Act, to featuring transgender and non-binary people in an ad in Argentina, to advocating for marriage equality in Taiwan -- businesses understand their LGBTQ employees and customers deserve to be seen, valued and respected not only at work, but in every aspect of daily life.\"Added Thomas-Petit, \"This recognition only encourages us to remain as committed as ever to championing workplace equality.  Actions speak louder than words, and we remain steadfast in our efforts to create a better, more just world of work.\"The announcement comes on the heels of ADP's inclusion in Bloomberg's 2020 Gender Equality Index (GEI), a global study on gender equality examining data on 325 companies across 42 countries and regions.For more information on the 2020 Corporate Equality Index, or to download a free copy of the report, visit www.hrc.org/cei. To learn more about ADP's commitment to corporate social responsibility, visit http://sustainability.adp.com/. About Human Rights Campaign FoundationThe Human Rights Campaign Foundation is the educational arm of America's largest civil rights organization working to achieve equality for lesbian, gay, bisexual transgender and queer people. HRC envisions a world where LGBTQ people are embraced as full members of society at home, at work and in every community.About ADP (NASDAQ: ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, and Always Designing for People, are trademarks of ADP, LLC.  All other marks are the property of their respective owners.Copyright © 2020 ADP, LLC.  All rights reserved.ADP-Media View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-achieves-a-perfect-score-in-workplace-equality-for-11th-straight-year-300992235.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "U.S. Wage Growth Remained at 3.2 Percent for Fourth Quarter 2019",
        "subtitle": "",
        "date": "Jan 22, 2020 9:00AM EST",
        "content": "ROSELAND, N.J., Jan. 22, 2020 /PRNewswire/ -- Wages for U.S. workers grew 3.2 percent over the last year, increasing the average wage level by $0.88 to $28.93 an hour, according to the ADP Research Institute® Workforce Vitality Report (WVR) released today. The wage growth of 3.2 percent corresponds to the Bureau of Labor and Statistics (BLS) numbers of 2.9 percent which was published this month. \"The final quarter of 2019 was marked with a slight deceleration in job growth and wage growth was unchanged,\" said Ahu Yildirmaz, co-head of the ADP Research Institute. \"Wage growth for holders and entrants decelerated, whereas switchers experienced acceleration.\" Earlier this year, job holders, job switchers, and entrants saw wage growth of 5 percent or better; however, job holders are now seeing only 4.6 percent growth, entrants stand at 4.9 percent, and switchers came in at 5 percent.  Wage growth across industries had been tightly clustered between 3.5 percent and 4.5 percent; however, the differences are becoming clearer. Resources and mining continues to be the weakest performer, with wages falling year-over-year. Education and health services also experienced low wage growth at 1.8 percent, less than half the rate from one year ago. However, job holder wage growth in education and health services remains above 4 percent and employment growth is among the strongest of any industry, indicating that overall wage growth is likely being weighed down by changes in industry worker composition. Table 1: Wage and Employment Growth by Industry – December 2019Workers in the Midwest outpaced other regions with 3.9 percent wage growth, although the hourly wage rate was the lowest at $27. The Midwest also experienced the lowest employment growth at 0.8 percent. Job switchers fared best in the West experiencing a wage growth of 6.7 percent, while job entrants in the Northeast fared the best with wage growth of 6.2 percent. By firm size, workers at large firms had the highest wage growth rate at 3.4 percent, with employment growth at 3 percent. Table 2: Wage and Employment Growth by Region and Firm Size – December 2019About the ADP Workforce Vitality ReportThe ADP Workforce Vitality Report (WVR) was developed by the ADP Research Institute. It is an unprecedented, in-depth monthly analysis (published quarterly) of the vitality of the U.S. labor market based on actual data that identifies labor market trends and dynamics across multiple dimensions.  These dimensions include employment growth, job switching, wage growth and hours worked.  In addition to the macro data presented in the report, there are also segment-specific findings by industry, state, gender, age, experience, and pay level.  Established in October 2014, the report methodology was updated in April 2018 utilizing monthly data to include additional data points and deeper insights.  For more information about the report, please visit http://workforcereport.adp.com/.  Type of WorkforceHolders: Workers who were employed by the same company for the past 12 months.  The wage growth is the rate of change in wages in that time period.Switchers: Workers who changed employers between consecutive months.  The wage growth is calculated from the 12 month moving average of wage growth.Entrants: First time workers who are less than 25 years-old.  The wage growth is calculated from the 12 month moving average of wages. To see detailed results from the ADP Workforce Vitality Report for the fourth quarter of 2019, including data broken down by region, firm size, industry, gender, and age visit http://workforcereport.adp.com/.   The first quarter 2020 ADP Workforce Vitality Report will be released on Wednesday, April 22, 2020.About the ADP Research Institute The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights. We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About ADP (NASDAQ-ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.com.ADP, the ADP logo, Always Designing for People and ADP Research Institute are registered trademarks of ADP, LLC.   All other marks are the property of their respective owners.  Copyright © 2020 ADP, LLC.ADP - Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/us-wage-growth-remained-at-3-2-percent-for-fourth-quarter-2019--300991251.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "ADP Recognized on FORTUNE Magazine's 2020 \"World's Most Admired Companies\" List for 14th Consecutive Year",
        "subtitle": "",
        "date": "Jan 21, 2020 9:15AM EST",
        "content": "ROSELAND, N.J., Jan. 21, 2020 /PRNewswire/ -- ADP, a leading global technology company providing human capital management (HCM) solutions, has been named by FORTUNE® magazine as one of the \"World's Most Admired Companies\" in 2020.  This marks the 14th consecutive year the company has been recognized on the annual list, which spotlights companies with consistently strong performance and reputations amid a time of dynamic change.\"We are extremely proud to see our organization once again be recognized among the most admired companies in the world,\" said Carlos Rodriguez, president and chief executive officer of ADP.  \"At ADP, we are always designing for people. With the world of work changing at such a rapid pace, we are continuously innovating to provide our associates and clients the tools they need to reach their full potential.  We are honored to have the opportunity to help build a better world of work for everyone.\"FORTUNE collaborates with partner Korn Ferry Hay Group on this corporate reputation survey, which evaluates approximately 1,500 companies, including the 1,000 largest U.S. companies ranked by revenue and non-U.S. companies in the FORTUNE Global 500® database with revenues of $10 billion or more.  Korn Ferry Hay Group surveys 680 companies from 30 countries to select the largest for each international and U.S. industry.  Executives, directors and analysts are then asked to rate companies in their own industry on nine criteria, from investment value to social responsibility, and this vote results in the 52 industry lists.  The complete list appears in the February issue of the magazine, available on newsstands now.  To learn more about FORTUNE magazine's list of the \"World's Most Admired Companies,\" please visit here.About ADP (NASDAQ: ADP) Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, and Always Designing for People, are trademarks of ADP, LLC.  All other marks are the property of their respective owners.Copyright © 2020 ADP, LLC.  All rights reserved.ADP-Media View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-recognized-on-fortune-magazines-2020-worlds-most-admired-companies-list-for-14th-consecutive-year-300990268.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "Media Alert: December 2019 ADP Canada National Employment Report to be released on Thursday, January 16, 2020",
        "subtitle": "",
        "date": "Jan 9, 2020 8:30AM EST",
        "content": " TORONTO, Jan. 9, 2020 /PRNewswire/ --WHAT: The ADP Research Institute® will issue the December 2019 ADP® Canada National Employment Report, on Thursday, January 16, 2020. Broadly distributed to the public each month, free of charge, the ADP Canada National Employment Report is produced by the ADP Research Institute.  The report, which is derived from actual ADP payroll data, measures the change in total nonfarm payroll employment each month on a seasonally-adjusted basis.   WHEN: Thursday, January 16, 2020, 8:30a.m. ETAhu Yildirmaz, Vice President and co-head of the ADP Research Institute, will be available for interviews immediately after the report is published. About the ADP Canada National Employment ReportThe ADP Canada National Employment Report is a monthly measure of the change in total Canadian nonfarm payroll employment derived from actual, anonymous payroll data of client companies served by ADP Canada. The report, which measures more than two million workers in Canada, is produced by the ADP Research Institute, a specialized group within the company that provides insights around employment trends and workforce strategy.Each month, the ADP Research Institute issues the ADP Canada National Employment Report as part of the company's commitment to adding deeper insights into the labour market in Canada and providing businesses, governments and others with a new source of credible and valuable information.  The ADP Canada National Employment Report is broadly distributed to the public each month, free of charge.For a description of the underlying data and the statistical model used to create this report, please see \"ADP Canada National Employment Report: Development Methodology\".About ADP (NASDAQ: ADP) Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Benefits and Payroll. Informed by data and designed for people.  Learn more at ADP.com. For more information about ADP Canada, visit ADP.ca.ADP, the ADP logo and the ADP Research Institute are registered trademarks of ADP, LLC.  All other marks are the property of their respective owners. Copyright © 2020 ADP, LLC.  All rights reserved. SOURCE  ADP, LLC"
    },
    {
        "title": "ADP National Employment Report: Private Sector Employment Increased by 202,000 Jobs in December",
        "subtitle": "",
        "date": "Jan 8, 2020 8:15AM EST",
        "content": "ROSELAND, N.J., Jan. 8, 2020 /PRNewswire/ -- Private sector employment increased by 202,000 jobs from November to December according to the December ADP National Employment Report®.  Broadly distributed to the public each month, free of charge, the ADP National Employment Report is produced by the ADP Research Institute® in collaboration with Moody's Analytics.  The report, which is derived from ADP's actual payroll data, measures the change in total nonfarm private employment each month on a seasonally-adjusted basis.  December 2019 Report Highlights*View the ADP National Employment Report Infographic at www.adpemploymentreport.com.Total U.S. Nonfarm Private Employment:     202,000By Company Size - Small businesses:     69,000- Medium businesses:     88,000- Large businesses:     45,000By Sector- Goods-producing:     29,000- Service-providing:     173,000* Sum of components may not equal total, due to rounding. Franchise Employment****Complete details on franchise employment can be found here.\"As 2019 came to a close, we saw expanded payrolls in December,\" said Ahu Yildirmaz, vice president and co-head of the ADP Research Institute. \"The service providers posted the largest gain since April, driven mainly by professional and business services. Job creation was strong across companies of all sizes, led predominantly by midsized companies.\"Mark Zandi, chief economist of Moody's Analytics, said, \"Looking through the monthly vagaries of the data, job gains continue to moderate. Manufacturers, energy producers and small companies have been shedding jobs. Unemployment is low, but will begin to rise if job growth slows much further.\"The matched sample used to develop the ADP National Employment Report was derived from ADP payroll data, which represents 411,000 U.S. clients employing nearly 24 million workers in the U.S.  The November total of jobs added was revised up from 67,000 to 124,000.To obtain additional information about the ADP National Employment Report, including additional charts, supporting data and the schedule of future release dates, or to subscribe to the monthly email alerts and RSS feeds, please visit www.adpemploymentreport.com.The January 2020 ADP National Employment Report will be released at 8:15 a.m. ET on February 5, 2020.About the ADP National Employment Report® The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 24 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights. We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About Moody's Analytics Moody's Analytics provides financial intelligence and analytical tools to help business leaders make better, faster decisions. Our deep risk expertise, expansive information resources, and innovative application of technology help our clients confidently navigate an evolving marketplace. We are known for our industry-leading and award-winning solutions, made up of research, data, software, and professional services, assembled to deliver a seamless customer experience. We create confidence in thousands of organizations worldwide, with our commitment to excellence, open mindset approach, and focus on meeting customer needs.About ADP (NASDAQ – ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll. Informed by data and designed for people.   Learn more at ADP.comADP, the ADP logo, and Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report, and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2020 ADP, LLC.  All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-national-employment-report-private-sector-employment-increased-by-202-000-jobs-in-december-300983483.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "ADP to Announce Second Quarter Fiscal 2020 Financial Results on January 29, 2020",
        "subtitle": "",
        "date": "Dec 19, 2019 4:05PM EST",
        "content": "ROSELAND, N.J., Dec. 19, 2019 /PRNewswire/ -- ADP (Nasdaq: ADP), a leading global provider of Human Capital Management (HCM) solutions, is scheduled to release its financial results for the second fiscal quarter ending December 31, 2019 before the opening of the Nasdaq on Wednesday, January 29, 2020.ADP will also be hosting a conference call at 8:30 a.m. ET on January 29, 2020 to discuss these results.  Carlos Rodriguez, President and Chief Executive Officer, Kathleen Winters, Chief Financial Officer and Christian Greyenbuhl, Vice President of Investor Relations, will be participating on the call.Please note that ADP no longer publishes its financial results over a news wire service. Instead, the results will be posted on the Investor Relations section of adp.com. The company will issue an alert over a news wire to indicate the earnings materials are publicly available, including a link to those documents.Investors and interested participants are invited to listen to the conference call and view the accompanying slide presentation via live webcast.  The conference call will be webcast live on ADP's website at investors.adp.com and will be available for replay following the call.  The slide presentation will be available shortly before the webcast.About ADP (NASDAQ – ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, and Always Designing for People are trademarks of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2019 ADP, LLC. All rights reserved.ADP-Investor RelationsContact:973.974.5858Investor.Mail@ADP.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-to-announce-second-quarter-fiscal-2020-financial-results-on-january-29-2020-300977922.htmlSOURCE  ADP - IR"
    },
    {
        "title": "Media Alert: November 2019 ADP Canada National Employment Report to be released on Thursday, December 19, 2019",
        "subtitle": "",
        "date": "Dec 12, 2019 8:30AM EST",
        "content": " TORONTO, Dec. 12, 2019 /PRNewswire/ -- WHAT: The ADP Research Institute® will issue the November 2019 ADP® Canada National Employment Report, on Thursday, December 19, 2019. Broadly distributed to the public each month, free of charge, the ADP Canada National Employment Report is produced by the ADP Research Institute. The report, which is derived from actual ADP payroll data, measures the change in total nonfarm payroll employment each month on a seasonally-adjusted basis.   WHEN: Thursday, December 19, 2019, 8:30a.m. ETAhu Yildirmaz, Vice President and co-head of the ADP Research Institute, will be available for interviews immediately after the report is published. About the ADP Canada National Employment ReportThe ADP Canada National Employment Report is a monthly measure of the change in total Canadian nonfarm payroll employment derived from actual, anonymous payroll data of client companies served by ADP Canada. The report, which measures more than two million workers in Canada, is produced by the ADP Research Institute, a specialized group within the company that provides insights around employment trends and workforce strategy.Each month, the ADP Research Institute issues the ADP Canada National Employment Report as part of the company's commitment to adding deeper insights into the labour market in Canada and providing businesses, governments and others with a new source of credible and valuable information. The ADP Canada National Employment Report is broadly distributed to the public each month, free of charge.For a description of the underlying data and the statistical model used to create this report, please see \"ADP Canada National Employment Report: Development Methodology\".About ADP (NASDAQ: ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Benefits and Payroll. Informed by data and designed for people.  Learn more at ADP.com. For more information about ADP Canada, visit ADP.ca.ADP, the ADP logo and the ADP Research Institute are registered trademarks of ADP, LLC.  All other marks are the property of their respective owners. Copyright © 2019 ADP, LLC.  All rights reserved. SOURCE  ADP, LLC"
    },
    {
        "title": "ADP Deciphers Changes to Form W-4 and its Impact on the Workforce",
        "subtitle": "Leader in human capital management (HCM) solutions advises close collaboration between employers and employees to avoid likely areas of confusion",
        "date": "Dec 5, 2019 10:30AM EST",
        "content": "ROSELAND, N.J., Dec. 5, 2019 /PRNewswire/ -- The Internal Revenue Service (IRS) today released a substantially revised Form W-4, Employee's Withholding Certificate, which will feature a refreshed look and several new input fields that will replace the familiar \"withholding allowances\" box. Workers could be surprised with a tax bill if the form is filled out incorrectly, making it imperative that employers and employees understand the new form and how they can avoid mistakes. \"While the updated form may initially elicit some confusion for employees, these important changes will ultimately simplify the ability to set and adjust withholding to achieve desired results, such as a specific tax refund amount,\" said Pete Isberg, vice president of government affairs of ADP.  \"That being said, the form may require employees to remember specifics from their most recent tax return to properly fill out the form and avoid any issues. The 2020 Form W-4 features significant improvements and simplification for those with multiple jobs and two-earner families.\" Important factors regarding the 2020 Form W-4 include: Recognizing Major Changes: The IRS 2020 Form W-4 shifts several computations from the employee to the employer.  It features a new checkbox for multiple jobs and two-earner households, replacing a difficult and potentially confusing nine-step worksheet in the 2019 version.  If this box is checked, the tax tables divide the standard deduction and tax brackets equally between two jobs, so tax rates apply at roughly half of the income threshold that normally applies.  The updated form will also contain new payroll inputs including full-year child and dependent tax credits, full-year other income and full-year deductions.  These new inputs will simplify the process for employees, but will require employers to convert full-year expected tax credits to reduce per-payroll tax withholding and use full-year deductions to reduce per-payroll wages subject to withholding. Day-One Employee Implications: On their first day of employment, employees are often asked to fill out a handful of forms (i.e., I-9, W-4, direct deposit authorization, etc.).  With the new IRS 2020 Form W-4 changes, employees may need more time to complete the form; e.g., to call their accountant or their spouse to look up details from last year's return, such as total deductions, tax credits or other income.  Of note, if existing employees are happy with their current withholding, they can leave their 2019 or prior Form W-4 in effect.  All new employees hired after January 1, 2020, must use the new form.Mistakes to Avoid: There are some potential areas of confusion as employees and employers become familiar with the IRS 2020 Form W-4.  For example, the document asks for \"deductions other than the standard deduction.\"  Employees will want to ensure they enter expected deductions over the standard deduction amount, rather than total deductions.  Additionally, if an employee is in a two-earner household and they opt to check the box in Step 2, both spouses should check the box, but only one of them should fill out Step 3 and Step 4 of the form. For more information on navigating the IRS 2020 Form W-4, visit www.adp.com/W42020. About ADP (NASDAQ – ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, and Always Designing for People are trademarks of ADP, LLC.Copyright © 2019 ADP, LLC. All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-deciphers-changes-to-form-w-4-and-its-impact-on-the-workforce-300970063.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "ADP National Employment Report: Private Sector Employment Increased by 67,000 Jobs in November",
        "subtitle": "",
        "date": "Dec 4, 2019 8:15AM EST",
        "content": "ROSELAND, N.J., Dec. 4, 2019 /PRNewswire/ -- Private sector employment increased by 67,000 jobs from October to November according to the November ADP National Employment Report®.  Broadly distributed to the public each month, free of charge, the ADP National Employment Report is produced by the ADP Research Institute® in collaboration with Moody's Analytics.  The report, which is derived from ADP's actual payroll data, measures the change in total nonfarm private employment each month on a seasonally-adjusted basis.  November 2019 Report Highlights*View the ADP National Employment Report Infographic at www.adpemploymentreport.com.Total U.S. Nonfarm Private Employment:     67,000By Company Size - Small businesses:     11,000- Medium businesses:     29,000- Large businesses:     27,000By Sector- Goods-producing:     -18,000- Service-providing:     85,000* Sum of components may not equal total, due to rounding. - Franchise Employment****Complete details on franchise employment can be found here.\"In November, the labor market showed signs of slowing,\" said Ahu Yildirmaz, vice president and co-head of the ADP Research Institute. \"The goods producers still struggled; whereas, the service providers remained in positive territory driven by healthcare and professional services. Job creation slowed across all company sizes; however, the pattern remained largely the same, as small companies continued to face more pressure than their larger competitors.\"  Mark Zandi, chief economist of Moody's Analytics, said, \"The job market is losing its shine. Manufacturers, commodity producers, and retailers are shedding jobs. Job openings are declining and if job growth slows any further unemployment will increase.\"The matched sample used to develop the ADP National Employment Report was derived from ADP payroll data, which represents 411,000 U.S. clients employing nearly 24 million workers in the U.S. The October total of jobs added was revised down from 125,000 to 121,000.To obtain additional information about the ADP National Employment Report, including additional charts, supporting data and the schedule of future release dates, or to subscribe to the monthly email alerts and RSS feeds, please visit www.adpemploymentreport.com.The December 2019 ADP National Employment Report will be released at 8:15 a.m. ET on January 8, 2020.About the ADP National Employment Report®The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 24 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights. We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About Moody's Analytics Moody's Analytics provides financial intelligence and analytical tools to help business leaders make better, faster decisions. Our deep risk expertise, expansive information resources, and innovative application of technology help our clients confidently navigate an evolving marketplace. We are known for our industry-leading and award-winning solutions, made up of research, data, software, and professional services, assembled to deliver a seamless customer experience. We create confidence in thousands of organizations worldwide, with our commitment to excellence, open mindset approach, and focus on meeting customer needs.About ADP (NASDAQ – ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll. Informed by data and designed for people.   Learn more at ADP.comADP, the ADP logo, and Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report, and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2019 ADP, LLC.  All rights reserved.ADP-Media  View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-national-employment-report-private-sector-employment-increased-by-67-000-jobs-in-november-300969102.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "November 2019 ADP National Employment Report®, ADP Small Business Report® and ADP National Franchise Report® to be Released on December 4, 2019",
        "subtitle": "",
        "date": "Nov 27, 2019 8:15AM EST",
        "content": "ROSELAND, N.J., Nov. 27, 2019 /PRNewswire/ --WHAT: ADP Research Institute® will release the November findings of the ADP National Employment Report, ADP Small Business Report and ADP National Franchise Report on Wednesday, December 4, 2019 at 8:15 a.m. ET.     Due to the important contribution that small businesses make to economic growth, ADP Research Institute issues the ADP Small Business Report independently of the ADP National Employment Report.  The ADP Small Business Report offers detailed private sector employment data that are specific to businesses with 49 or fewer employees.Broadly distributed to the public each month, free of charge, the ADP National Employment Report and ADP Small Business Report are derived from ADP payroll data representing 411,000 U.S. clients and nearly 24 million workers, and are published by the ADP Research Institute in collaboration with Moody's Analytics.The ADP National Franchise Report measures monthly changes in franchise employment.  The matched sample used to develop the ADP National Franchise Report is derived from ADP payroll data, which represents 15,000 franchisors and franchisees employing nearly one million U.S. workers.WHEN: Wednesday, December 4, 2019, 8:15 a.m. ET Conference Call for Media to follow at 8:30 a.m. ET:Following the release of the ADP National Employment Report, Moody's Analytics Chief Economist Mark Zandi will provide context on the employment data and answer questions from media during a conference call. Journalists are invited to access the call by dialing: 1-800-675-6207NOTE: This is an operator-assisted conference call dial-in number and there is no passcode required.About the ADP National Employment Report®:The ADP National Employment Report® is a monthly measure of the change in total U.S. nonfarm private employment derived from actual, anonymous payroll data of client companies served by ADP®, a leading provider of human capital management solutions.  The report, which measures nearly 24 million U.S. workers, is produced by the ADP Research Institute®, a specialized group within the company that provides insights around employment trends and workforce strategy, in collaboration with Moody's Analytics, Inc.Each month, ADP Research Institute issues the ADP National Employment Report as part of the company's commitment to adding deeper insights into the U.S. labor market and providing businesses, governments and others with a source of credible and valuable information.  The ADP National Employment Report is broadly distributed to the public each month, free of charge.The data for this report is collected for pay periods that can be interpolated to include the week of the 12th of each month, and processed with statistical methodologies similar to those used by the U.S. Bureau of Labor Statistics to compute employment from its monthly survey of establishments.  Due to this processing, this subset is modified to make it indicative of national employment levels; therefore, the resulting employment changes computed for the ADP National Employment Report are not representative of changes in ADP's total base of U.S. business clients.For a description of the underlying data and the statistical model used to create this report, please see the ADP National Employment Report: Development Methodology.About the ADP Research Institute:  The mission of the ADP Research Institute is to generate data-driven discoveries about the world of work, and to derive reliable economic indicators from these insights.  We offer these findings to the world at large as our unique contribution to making the world of work better and more productive, and to bring greater awareness to the economy at large.About ADP (NASDAQ: ADP): Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits, and Payroll. Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, Always Designing for People, ADP National Employment Report, ADP Small Business Report, ADP National Franchise Report and ADP Research Institute are registered trademarks of ADP, LLC. All other marks are the property of their respective owners.Copyright © 2019 ADP, LLC. All rights reserved.ADP-Media View original content to download multimedia:http://www.prnewswire.com/news-releases/november-2019-adp-national-employment-report-adp-small-business-report-and-adp-national-franchise-report-to-be-released-on-december-4-2019-300965703.htmlSOURCE  ADP, LLC"
    },
    {
        "title": "Human Resources Magazine Recognizes ADP as \"HR Vendors of the Year 2019\" in Singapore",
        "subtitle": "",
        "date": "Nov 26, 2019 7:00PM EST",
        "content": "SINGAPORE, Nov. 27, 2019 /PRNewswire/ -- Human Resources, a leading HR magazine in Asia, has honored ADP® with its annual 'HR Vendors of the Year 2019' award in Singapore. ADP won Silver in 'Best Payroll Software'' in Singapore. The result was announced during a gala night on November 14.HR Vendors of the Year is an annual vendor rankings report published by Human Resources magazine since 2005. It is the regional award program dedicated to recognizing and celebrating Asia's best providers of HR products and services. The awards include a range of categories and are evaluated by a panel of respected HR professionals in Asia. \"Having been assessed by a stringent jury on the parameters of performance, product, people and perspectives, ADP has emerged strong in 2019,\" said Naomi Cranswick, regional publisher of Human Resources magazine. \"This testifies to its intuitive payroll solutions, as well as customer-centricity, both of which are crucial to winning at the coveted HR Vendors of the Year awards.\"\"We are honored and delighted that our expertise in payroll has been recognized by such a prestigious organization,\" said Peter Hadley, President ADP Asia-Pacific. \"This year marks ADP's 70th anniversary. Leveraging our rich history and long legacy of innovation in the field of human capital management, we look forward to bringing more advanced technologies and better experiences at work for businesses and employees in Asia.\"ADP serves clients across the Asia Pacific region from Australia up to India, across Southeast Asia, to markets in North Asia including mainland China, Hong Kong (SAR), and Japan. Learn more about ADP payroll solutions here. About ADP (NASDAQ – ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Benefits, Payroll and Compliance informed by data and designed for people.  Learn more at www.adp.sgADP, the ADP logo, and Always Designing for People are trademarks of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2019 ADP, LLC. All rights reserved.Photo - https://mma.prnewswire.com/media/1036040/ADP_Team_at_HR_Vendors_of_the_Year_2019_Award_Singapore.jpg SOURCE  ADP"
    },
    {
        "title": "ADP Anticipates 2020 to Deliver Smart and Personalized Work Experiences for Workers and Employers",
        "subtitle": "Cross-functional team support, personalization, compliance agility, data-informed decision making and adaptable technology, among leading trends driving the workforce",
        "date": "Nov 25, 2019 8:30AM EST",
        "content": "ROSELAND, N.J., Nov. 25, 2019 /PRNewswire/ -- Regardless of age, industry or geographic location, as the workforce continues to evolve, so do the needs of workers, businesses and HR leaders. To better understand those needs, ADP®, a leading global technology company providing human capital management (HCM) solutions, uncovered the five HCM realities that will shape the workplace in 2020 and beyond. Among these realities, personalization and the ability to provide relevant and actionable solutions will be increasingly sought by companies as they strive to engage their workforce and strategically propel their business forward. \"The world of work has reached an inflection point, punctuated by a tight labor market and stabilizing wage growth,\" said Don Weinstein, corporate vice president, global product and technology at ADP.  \"Amidst this landscape, we are seeing a business-critical convergence of technology and data in the workplace. In 2020, companies will look to leverage customizable tech solutions that meet the needs of their organization, their teams, and their workers to provide a more engaging and productive work environment.\"  Trends Impacting and Informing the Workforce in 2020:A team-based approach will change how work gets done.Personalization will become paramount. Compliance complexity will grow. Data scientists and business owners will adopt a shared mindset.Today's evolving workforce will require adaptable technology. In addition to broad-based trends in the workforce, ADP has also identified several vertical-specific trends impacting the gig economy, accounting industry, franchise industry, benefits and brokers, etc. For a more detailed look at all of the 2020 trends, please visit Spark.About ADP (NASDAQ: ADP)Designing better ways to work through cutting-edge products, premium services and exceptional experiences that enable people to reach their full potential.  HR, Talent, Time Management, Benefits and Payroll.  Informed by data and designed for people.  Learn more at ADP.comADP, the ADP logo, and Always Designing for People are trademarks of ADP, LLC.Copyright © 2019 ADP, LLC.  All rights reserved.ADP-Media View original content to download multimedia:http://www.prnewswire.com/news-releases/adp-anticipates-2020-to-deliver-smart-and-personalized-work-experiences-for-workers-and-employers-300964300.htmlSOURCE  ADP, LLC"
    }
]