[
    {
        "title": "Autodesk to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Feb 28, 2020 5:00PM EST",
        "content": "SAN RAFAEL, Calif., Feb. 28, 2020 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced its executives will be speaking at the following investor conference: -- Morgan Stanley Conference, March 5, 2020, San Francisco, CAA live webcast, replay and podcast of the presentations will be available through Autodesk's Investor Relations Website at www.autodesk.com/investors. Please go to the Website 15 minutes early to register, download and install any necessary software. For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk uses its investors.autodesk.com website as a means of disclosing material non-public information, announcing upcoming investor conferences and for complying with its disclosure obligations under Regulation FD. Accordingly, you should monitor our investor relations website in addition to following our press releases, SEC filings and public conference calls and webcasts.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2020 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-to-present-at-upcoming-investor-conference-301013620.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk, Inc. Announces Fiscal 2020 Fourth Quarter And Full-Year Results",
        "subtitle": "",
        "date": "Feb 27, 2020 4:01PM EST",
        "content": "SAN RAFAEL, Calif., Feb. 27, 2020 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today reported financial results for the fourth quarter of fiscal 2020.All growth rates are compared to the fourth quarter of fiscal 2019 unless otherwise noted. A reconciliation of GAAP to non-GAAP results is provided in the accompanying tables. For definitions, please view the Glossary of Terms later in this document.\"We ended fiscal 2020 on a very strong note with revenue, earnings, and free cash flow coming in above expectations. We are entering the sustainable growth phase of our subscription journey with great momentum,\" said Andrew Anagnost, Autodesk president and CEO. \"Our construction business had a landmark year, we continue to gain share in manufacturing, and are making steady progress in monetizing non-compliant users. We are highly confident in our long-term growth drivers and fiscal 2023 targets.\"\"We delivered strong results across the board in fiscal 2020 and are reiterating our fiscal 2021 and 2023 targets,\" said Scott Herren, Autodesk CFO. \"In fiscal 2020, we delivered ARR growth of 25 percent while expanding non-GAAP operating margin by 12 percentage points. Our resilient business model combined with multiple growth drivers, positions us well to deliver on our goals.\"Fourth Quarter Fiscal 2020 Financial HighlightsNet Revenue by Geographic AreaNet Revenue by Product FamilyOur product offerings are focused in four primary product families: Architecture, Engineering and Construction (\"AEC\"), AutoCAD and AutoCAD LT, Manufacturing (\"MFG\"), and Media and Entertainment (\"M&E\").Fiscal 2020 Financial HighlightsNet Revenue by Geographic AreaNet Revenue by Product FamilyOur product offerings are focused in four primary product families: AEC, AutoCAD and AutoCAD LT, MFG, and M&E.Business OutlookThe following are forward-looking statements based on current expectations and assumptions, and involve risks and uncertainties, some of which are set forth below under \"Safe Harbor Statement.\"  Autodesk's business outlook for the first quarter and full year fiscal 2021 takes into consideration the current economic environment and foreign exchange currency rate environment.  A reconciliation between the fiscal 2021 GAAP and non-GAAP estimates is provided below or in the tables following this press release.First Quarter Fiscal 2021Full Year Fiscal 2021The first quarter and full year fiscal 2021 outlook assume a projected annual effective tax rate of 21 percent and 16 percent for GAAP and non-GAAP results, respectively.  Shifts in geographic profitability continue to impact the annual effective tax rate due to significant differences in tax rates in various jurisdictions.  Thus, assumptions for the annual effective tax rate are evaluated regularly and may change based on the projected geographic mix of earnings.Earnings Conference Call and WebcastAutodesk will host its fourth quarter conference call today at 5:00 p.m. ET. The live broadcast can be accessed at http://www.autodesk.com/investor. A transcript of the opening commentary will also be available following the conference call.A replay of the broadcast will be available at 7:00 p.m. ET at http://www.autodesk.com/investor. This replay will be maintained on Autodesk's website for at least 12 months.Investor Presentation DetailsAn investor presentation providing additional information can be found at http://www.autodesk.com/investor.Key Performance MetricsIn order to help better understand our financial performance we use several key performance metrics including billings, recurring revenue, ARR, net revenue retention rate (\"NR3\"), ARPS, and subscriptions. These metrics are key performance metrics and should be viewed independently of revenue and deferred revenue. These metrics are not intended to be combined with those items. We use these metrics to monitor the strength of our recurring business. We believe these metrics are useful to investors because they can help in monitoring the long-term health of our business. Our determination and presentation of these metrics may differ from that of other companies. The presentation of these metrics is meant to be considered in addition to, not as a substitute for or in isolation from, our financial measures prepared in accordance with GAAP.Glossary of TermsAnnualized Recurring Revenue (ARR): Represents the annualized value of total monthly recurring revenue for the preceding three months. \"Maintenance plan ARR\" captures ARR relating to traditional maintenance attached to perpetual licenses. \"Subscription plan ARR\" captures ARR relating to subscription offerings. Refer to the definition of recurring revenue below for more details on what is included within ARR. Recurring revenue acquired with the acquisition of a business is captured when total subscriptions are captured in our systems and may cause variability in the comparison of this calculation. Annualized Revenue Per Subscription (ARPS): Is calculated by dividing ARR by Total Subscriptions.Billings: Total revenue plus the net change in deferred revenue from the beginning to the end of the period.Cloud Service Offerings: Represents individual term-based offerings deployed through web browser technologies or in a hybrid software and cloud configuration. Cloud service offerings that are bundled with other product offerings are not captured as a separate cloud service offering.Constant Currency (CC) Growth Rates: We attempt to represent the changes in the underlying business operations by eliminating fluctuations caused by changes in foreign currency exchange rates as well as eliminating hedge gains or losses recorded within the current and comparative periods. We calculate constant currency growth rates by (i) applying the applicable prior period exchange rates to current period results and (ii) excluding any gains or losses from foreign currency hedge contracts that are reported in the current and comparative periods.Core Business: Represents the combination of maintenance, product subscription, and EBAs.  Enterprise Business Agreements (EBAs): Represents programs providing enterprise customers with token-based access or a fixed maximum number of seats to a broad pool of Autodesk products over a defined contract term.Free Cash Flow: Cash flow from operating activities minus capital expenditures.Maintenance Plan: Our maintenance plans provide our customers with a cost effective and predictable budgetary option to obtain the productivity benefits of our new releases and enhancements when and if released during the term of their contracts. Under our maintenance plans, customers are eligible to receive unspecified upgrades when and if available, and technical support. We recognize maintenance revenue over the term of the agreements, generally one year.   Net Revenue Retention Rate (NR3): Measures the year-over-year change in ARR for the population of customers that existed one year ago (\"base customers\").  Net revenue retention rate is calculated by dividing the current period ARR related to base customers by the total ARR from one year ago related to the same base customers.  ARR is based on USD reported revenue, and fluctuations caused by changes in foreign currency exchange rates and hedge gains or losses have not been eliminated.  ARR related to acquired companies is excluded from the calculation for at least one year from integration.Other Revenue: Consists of revenue from consulting, training and other services, and is recognized over time as the services are performed. Other Revenue also includes software license revenue from the sale of products that do not incorporate substantial cloud services and is recognized up front. Product Subscription: Provides customers the most flexible, cost-effective way to access and manage 3D design, engineering, and entertainment software tools. Our product subscriptions currently represent a hybrid of desktop and cloud functionality, which provides a device-independent, collaborative design workflow for designers and their stakeholders. Recurring Revenue: Consists of the revenue for the period from our traditional maintenance plans and revenue from our subscription plan offerings. It excludes subscription revenue related to consumer product offerings, select Creative Finishing product offerings, education offerings, and third party products. Recurring revenue acquired with the acquisition of a business is captured when total subscriptions are captured in our systems and may cause variability in the comparison of this calculation.  Remaining Performance Obligations: The sum of total short-term, long-term, and unbilled deferred revenue. Current remaining performance obligations is the amount of revenue we expect to recognize in the next twelve months. Spend: The sum of cost of revenue and operating expenses.Subscription Plan: Comprises our term-based product subscriptions, cloud service offerings, and EBAs. Subscriptions represent a combined hybrid offering of desktop software and cloud functionality which provides a device-independent, collaborative design workflow for designers and their stakeholders. With subscription, customers can use our software anytime, anywhere, and get access to the latest updates to previous versions. Subscription Revenue: Includes subscription fees from product subscriptions, cloud service offerings, and EBAs. Total Subscriptions: Consists of subscriptions from our maintenance plans and subscription plan offerings that are active and paid as of the fiscal year end date. For certain cloud service offerings and EBAs, subscriptions represent the monthly average activity reported within the last three months of the fiscal quarter end date.  Total subscriptions do not include education offerings, consumer product offerings, select Creative Finishing product offerings, Autodesk Buzzsaw, Autodesk Constructware, and third party products.  Subscriptions acquired with the acquisition of a business are captured once the data conforms to our subscription count methodology and when added, may cause variability in comparison of this calculation.Unbilled Deferred Revenue: Unbilled deferred revenue represents contractually stated or committed orders under early renewal and multi-year billing plans for subscription, services and maintenance for which the associated deferred revenue has not been recognized. Under FASB Accounting Standards Codification (\"ASC\") Topic 606, unbilled deferred revenue is not included as a receivable or deferred revenue on our Condensed Consolidated Balance Sheet. Safe Harbor StatementThis press release contains forward-looking statements that involve risks and uncertainties, including quotations from management, statements in the paragraphs under \"Business Outlook\" above and other statements about our short-term and long-term goals, and other statements regarding our strategies, market and product positions, performance and results. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: failure to achieve our revenue and profitability objectives; failure to successfully manage transitions to new business models and markets; failure to maintain cost reductions or otherwise control our expenses; difficulty in predicting revenue from new businesses and the potential impact on our financial results from changes in our business models; general market, political, economic, and business conditions; any imposition of new tariffs or trade barriers; the impact of non-cash charges on our financial results; fluctuation in foreign currency exchange rates; the success of our foreign currency hedging program; our performance in particular geographies, including emerging economies; the ability of governments around the world to meet their financial and debt obligations, and finance infrastructure projects; weak or negative growth in the industries we serve; slowing momentum in subscription billings or revenues; difficulties encountered in integrating new or acquired businesses and technologies; the inability to identify and realize the anticipated benefits of acquisitions; the financial and business condition of our reseller and distribution channels; dependence on and the timing of large transactions; pricing pressure; unexpected fluctuations in our annual effective tax rate; significant effects of tax legislation and judicial or administrative interpretation of tax regulations, including the Tax Cuts and Jobs Act; the timing and degree of expected investments in growth and efficiency opportunities; changes in the timing of product releases and retirements; and any unanticipated accounting charges. Our estimates as to tax rate are based on current tax law, including current interpretations of the Tax Cuts and Jobs Act, and could be affected by changing interpretations of that Act, as well as additional legislation and guidance around that Act.Further information on potential factors that could affect the financial results of Autodesk are included in Autodesk's reports on Form 10-K and Form 10-Q, which are on file with the U.S. Securities and Exchange Commission. Autodesk disclaims any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk uses its investors.autodesk.com website as a means of disclosing material non-public information, announcing upcoming investor conferences and for complying with its disclosure obligations under Regulation FD. Accordingly, you should monitor our investor relations website in addition to following our press releases, SEC filings and public conference calls and webcasts.Autodesk, AutoCAD, AutoCAD LT, BIM 360 and Fusion 360 are registered trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and service offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document.© 2020 Autodesk, Inc. All rights reserved.      View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-inc-announces-fiscal-2020-fourth-quarter-and-full-year-results-301012907.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Extends Invitation to Join Financial Results Conference Call",
        "subtitle": "",
        "date": "Feb 3, 2020 8:00AM EST",
        "content": "SAN RAFAEL, Calif., Feb. 3, 2020 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced that it will broadcast its fourth quarter fiscal 2020 financial results conference call live via its website Thursday, February 27, 2020, at 2:00 p.m. Pacific Time. Autodesk will host a live webcast call at www.autodesk.com/investors. An audio replay webcast and podcast will also be available after 5:00 p.m. Pacific Time on Autodesk's website at www.autodesk.com/investors. For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2020 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-extends-invitation-to-join-financial-results-conference-call-300992473.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk, Inc. Recommends Rejection of TRC Capital's \"Mini-Tender\" Offer",
        "subtitle": "",
        "date": "Jan 15, 2020 4:25PM EST",
        "content": "SAN RAFAEL, Calif., Jan. 15, 2020 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced that it has been notified of an unsolicited \"mini-tender\" offer by TRC Capital Investment Corporation to purchase up to 1 million shares, or approximately 0.45 percent of outstanding shares, of Autodesk's common stock at $176.00 per share, which was approximately 4.84 percent below the closing share price of Autodesk's common stock on Jan. 3, 2020 ($184.95), the last trading day prior to the date of TRC Capital's mini-tender offer, and approximately 8.00 percent below the closing share price of Autodesk common stock on Jan. 14, 2020 ($191.11), the day prior to this release.Autodesk does not endorse TRC Capital's offer and recommends that Autodesk stockholders reject the offer and not tender their shares in response to TRC Capital's unsolicited mini-tender offer. This mini-tender offer is at a price below the market price for Autodesk shares (as of today's date) and is subject to numerous conditions, including TRC Capital's ability to obtain financing. Autodesk is not associated in any way with TRC Capital, its mini-tender offer or the offer documentation.TRC Capital has made similar, unsolicited mini-tender offers for shares of other publicly traded companies. Mini-tender offers are designed to seek to acquire less than 5 percent of a company's outstanding shares, thereby avoiding many disclosure and procedural requirements of the Securities and Exchange Commission (\"SEC\") that apply to tender offers for more than 5 percent of a company's outstanding shares. As a result, mini-tender offers do not provide investors with the same level of protections as provided by larger tender offers under United States securities laws.The SEC's guidance to investors on mini-tender offers is available at www.sec.gov/investor/pubs/minitend.htm. This alert advises that mini-tender offers \"have been increasingly used to catch investors off guard. Many investors who hear about mini-tender offers surrender their securities without investigating the offer, assuming that the price offered includes the premium usually present in larger, traditional tender offers. But they later learn that they cannot withdraw from the offer and may end up selling their securities at below-market prices.\"Like TRC Capital's other offers, this one puts individual investors at risk because they may not realize they are selling their shares at a discount. Autodesk urges investors to obtain current market quotations for their shares, review the conditions to the offer, consult with their broker or financial adviser and to exercise caution with respect to TRC Capital's mini-tender offer. Autodesk recommends that stockholders who have not responded to TRC's offer take no action. Autodesk stockholders who have already tendered are advised that they may withdraw their shares by providing the written notice described in the TRC Capital offering documents prior to the expiration of the offer, which is currently scheduled at 12:01 a.m. New York City time on Wednesday, Feb. 5, 2020.Autodesk encourages brokers and dealers, as well as other market participants, to review the SEC's letter regarding broker-dealer mini-tender offer dissemination and disclosures at www.sec.gov/divisions/marketreg/minitenders/sia072401.htm and the NASD Notice to Members 99-53 issued in July 1999, regarding guidance to members forwarding mini-tender offers to their customers, which can be found at http://www.finra.org/web/groups/industry/@ip/@reg/@notice/documents/notices/p004221.pdf.Autodesk requests that a copy of this press release be included with all distributions of materials relating to TRC Capital's offer.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and service offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document.© 2020 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-inc-recommends-rejection-of-trc-capitals-mini-tender-offer-300987837.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Prices $500 Million Notes Offering",
        "subtitle": "",
        "date": "Jan 7, 2020 7:19PM EST",
        "content": "SAN RAFAEL, Calif., Jan. 7, 2020 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced the pricing of its notes in an aggregate principal amount of $500 million in an underwritten, registered public offering. The notes will mature on January 15, 2030 and will bear interest at an annual rate of 2.850 percent. The notes are Autodesk's senior unsecured obligations. The offering is expected to close on January 14, 2020, subject to customary closing conditions.Autodesk intends to use the net proceeds from the sale of the notes for general corporate purposes, which will include repaying $450 million in aggregate principal amount of its 3.125 percent notes due June 15, 2020, plus accrued and unpaid interest thereon together with a redemption premium.BofA Securities, Inc., Citigroup Global Markets Inc. and J.P. Morgan Securities LLC acted as joint book-running managers for the offering.The offering of the notes is being made pursuant to an effective shelf registration statement filed with the U.S. Securities and Exchange Commission (the \"SEC\"). The offering of the notes will be made only by means of a prospectus supplement and accompanying prospectus, copies of which may be obtained from:These documents will also be filed with the SEC and will be available on the SEC's website at http://www.sec.gov.This press release does not constitute an offer to sell or the solicitation of an offer to buy any of the notes, nor shall there be any sale of these notes in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.Cautionary StatementThis press release contains forward-looking statements within the meaning of the federal securities laws. These statements involve risks and uncertainties that could cause actual results to differ materially, including, but not limited to, the satisfaction of customary closing conditions with respect to the offering of the notes, prevailing market conditions, and the anticipated use of the proceeds of the offering of the notes which could change as a result of market conditions or for other reasons, and corporate considerations and the impact of general economic, industry or political conditions in the United States or internationally. Additional risks and uncertainties relating to the offering, Autodesk and its business can be found under the heading \"Risk Factors\" in Autodesk's Quarterly Report on Form 10-Q for the quarter ended October 31, 2019, in the preliminary prospectus supplement relating to the offering and the accompanying prospectus filed with the SEC.Autodesk disclaims any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and service offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document.© 2020 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-prices-500-million-notes-offering-300983182.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk, Inc. Announces Fiscal 2020 Third Quarter Results",
        "subtitle": "-Record Last Twelve Months Operating and Free Cash Flow of $1.03 billion and $972 million, Respectively",
        "date": "Nov 26, 2019 4:01PM EST",
        "content": "SAN RAFAEL, Calif., Nov. 26, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today reported financial results for the third quarter of fiscal 2020.All growth rates are compared to the third quarter of fiscal 2019 unless otherwise noted. A reconciliation of GAAP to non-GAAP results is provided in the accompanying tables. For definitions, please view the Glossary of Terms later in this document.\"Our strong performance continued in Q3 as revenue, billings, ARR, earnings and free cash flow came in above expectations,\" said Andrew Anagnost, Autodesk president and CEO. \"We continue to demonstrate the cash generating power of our business model, and this quarter drove a record last twelve months free cash flow of nearly $1 billion. The breadth and depth of our product portfolio in Construction paved the way for another strong quarter. In Manufacturing, we continue to displace competitors and grow faster than the overall market.\"\"Third quarter results were driven by all regions and products, and once again drove robust margin expansion,\" said Scott Herren, Autodesk CFO. \"Outstanding execution, our resilient subscription business model and steady demand for our products produced billings over $1 billion, a 55 percent year-over-year growth.\"Third Quarter Fiscal 2020 Financial Highlights Net Revenue by Product FamilyOur product offerings are focused in four primary product families: Architecture, Engineering and Construction (\"AEC\"), AutoCAD and AutoCAD LT, Manufacturing (\"MFG\"), and Media and Entertainment (\"M&E\").Business OutlookThe following are forward-looking statements based on current expectations and assumptions, and involve risks and uncertainties, some of which are set forth below under \"Safe Harbor Statement.\"  Autodesk's business outlook for the full year fiscal 2020 and fourth quarter takes into consideration the current economic environment and foreign exchange currency rate environment.  A reconciliation between the fiscal 2020 GAAP and non-GAAP estimates is provided below or in the tables following this press release.Full Year Fiscal 2020Fourth Quarter Fiscal 2020The full year fiscal 2020 and fourth quarter outlook assume a projected annual effective tax rate of 38 percent and 18 percent for GAAP and non-GAAP results, respectively.  Shifts in geographic profitability continue to impact the annual effective tax rate due to significant differences in tax rates in various jurisdictions.  Thus, assumptions for the annual effective tax rate are evaluated regularly and may change based on the projected geographic mix of earnings.Earnings Conference Call and WebcastAutodesk will host its third quarter conference call today at 5:00 p.m. ET. The live broadcast can be accessed at http://www.autodesk.com/investor. A transcript of the opening commentary will also be available following the conference call.A replay of the broadcast will be available at 7:00 p.m. ET at http://www.autodesk.com/investor. This replay will be maintained on Autodesk's website for at least 12 months.Investor Presentation DetailsAn investor presentation providing additional information can be found at http://www.autodesk.com/investor.Glossary of TermsAnnualized Recurring Revenue (ARR): Represents the annualized value of our average monthly recurring revenue for the preceding three months. \"Maintenance plan ARR\" captures ARR relating to traditional maintenance attached to perpetual licenses. \"Subscription plan ARR\" captures ARR relating to subscription offerings. Refer to the definition of recurring revenue below for more details on what is included within ARR. Recurring revenue acquired with the acquisition of a business is captured when total subscriptions are captured in our systems and may cause variability in the comparison of this calculation. ARR is currently one of our key performance metrics to assess the health and trajectory of our business. ARR should be viewed independently of revenue and deferred revenue as ARR is a performance metric and is not intended to be combined with any of these items.Billings: Total revenue plus the net change in deferred revenue from the beginning to the end of the period.Cloud Service Offerings: Represents individual term-based offerings deployed through web browser technologies or in a hybrid software and cloud configuration. Cloud service offerings that are bundled with other product offerings are not captured as a separate cloud service offering.Constant Currency (CC) Growth Rates: We attempt to represent the changes in the underlying business operations by eliminating fluctuations caused by changes in foreign currency exchange rates as well as eliminating hedge gains or losses recorded within the current and comparative periods. We calculate constant currency growth rates by (i) applying the applicable prior period exchange rates to current period results and (ii) excluding any gains or losses from foreign currency hedge contracts that are reported in the current and comparative periods.Core Business: Represents the combination of maintenance, product, and EBA.  Enterprise Business Agreements (EBAs): Represents programs providing enterprise customers with token-based access or a fixed maximum number of seats to a broad pool of Autodesk products over a defined contract term.Free Cash Flow: Cash flow from operating activities minus capital expenditures.Maintenance Plan: Our maintenance plans provide our customers with a cost effective and predictable budgetary option to obtain the productivity benefits of our new releases and enhancements when and if released during the term of their contracts. Under our maintenance plans, customers are eligible to receive unspecified upgrades when and if available, and technical support. We recognize maintenance revenue over the term of the agreements, generally one year.   Net Revenue Retention Rate (NR3): Measures the year-over-year change in ARR for the population of customers that existed one year ago (\"base customers\").  Net revenue retention rate is calculated by dividing the current period ARR related to base customers by the total ARR from one year ago.  ARR is based on USD reported revenue, and fluctuations caused by changes in foreign currency exchange rates and hedge gains or losses have not been eliminated.  ARR related to acquired companies is excluded from the calculation for at least one year from integration.Other Revenue: Consists of revenue from consulting, training and other services, and is recognized over time as the services are performed. Other Revenue also includes software license revenue from the sale of products that do not incorporate substantial cloud services and is recognized up front. Product Subscription: Provides customers the most flexible, cost-effective way to access and manage 3D design, engineering, and entertainment software tools. Our product subscriptions currently represent a hybrid of desktop and SaaS functionality, which provides a device-independent, collaborative design workflow for designers and their stakeholders. Recurring Revenue: Consists of the revenue for the period from our traditional maintenance plans and revenue from our subscription plan offerings. It excludes subscription revenue related to consumer product offerings, select Creative Finishing product offerings, education offerings, and third party products. Recurring revenue acquired with the acquisition of a business is captured when total subscriptions are captured in our systems and may cause variability in the comparison of this calculation.  Remaining Performance Obligations: The sum of total short-term, long-term, and unbilled deferred revenue. Current remaining performance obligations is the amount of revenue we expect to recognize in the next twelve months. Spend: The sum of cost of revenue and operating expenses.Subscription Plan: Comprises our term-based product subscriptions, cloud service offerings, and EBAs. Subscriptions represent a combined hybrid offering of desktop software and cloud functionality which provides a device-independent, collaborative design workflow for designers and their stakeholders. With subscription, customers can use our software anytime, anywhere, and get access to the latest updates to previous versions. Subscription Revenue: Includes subscription fees from product subscriptions, cloud service offerings, and EBAs. Unbilled Deferred Revenue: Unbilled deferred revenue represents contractually stated or committed orders under early renewal and multi-year billing plans for subscription, services and maintenance for which the associated deferred revenue has not been recognized. Under FASB Accounting Standards Codification (\"ASC\") Topic 606, unbilled deferred revenue is not included as a receivable or deferred revenue on our Condensed Consolidated Balance Sheet. Safe Harbor StatementThis press release contains forward-looking statements that involve risks and uncertainties, including quotations from management, statements in the paragraphs under \"Business Outlook\" above and other statements about our short-term and long-term goals, and other statements regarding our strategies, market and product positions, performance and results. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: failure to achieve our revenue and profitability objectives; failure to successfully manage transitions to new business models and markets; failure to maintain cost reductions or otherwise control our expenses; difficulty in predicting revenue from new businesses and the potential impact on our financial results from changes in our business models; general market, political, economic, and business conditions; any imposition of new tariffs or trade barriers; the impact of non-cash charges on our financial results; fluctuation in foreign currency exchange rates; the success of our foreign currency hedging program; our performance in particular geographies, including emerging economies; the ability of governments around the world to meet their financial and debt obligations, and finance infrastructure projects; weak or negative growth in the industries we serve; slowing momentum in subscription billings or revenues; difficulties encountered in integrating new or acquired businesses and technologies; the inability to identify and realize the anticipated benefits of acquisitions; the financial and business condition of our reseller and distribution channels; dependence on and the timing of large transactions; pricing pressure; unexpected fluctuations in our annual effective tax rate; significant effects of tax legislation and judicial or administrative interpretation of tax regulations, including the Tax Cuts and Jobs Act; the timing and degree of expected investments in growth and efficiency opportunities; changes in the timing of product releases and retirements; and any unanticipated accounting charges. Our estimates as to tax rate are based on current tax law, including current interpretations of the Tax Cuts and Jobs Act, and could be affected by changing interpretations of that Act, as well as additional legislation and guidance around that Act.Further information on potential factors that could affect the financial results of Autodesk are included in Autodesk's reports on Form 10-K and Form 10-Q, which are on file with the U.S. Securities and Exchange Commission. Autodesk disclaims any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk uses its investors.autodesk.com website as a means of disclosing material non-public information, announcing upcoming investor conferences and for complying with its disclosure obligations under Regulation FD. Accordingly, you should monitor our investor relations website in addition to following our press releases, SEC filings and public conference calls and webcasts.Autodesk, AutoCAD, AutoCAD LT, BIM 360 and Fusion 360 are registered trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and service offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.      View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-inc-announces-fiscal-2020-third-quarter-results-300965656.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 25, 2019 8:00AM EST",
        "content": " SAN RAFAEL, Calif., Nov. 25, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced its executives will be speaking at the following investor conferences: -- Credit Suisse Tech Conference, December 3, Scottsdale, AZ-- Wells Fargo Tech Summit, December 3, Las Vegas, NV-- Barclays Global Tech Conference, December 12, San Francisco, CAA live webcast, replay and podcast of the presentations will be available through Autodesk's Investor Relations Website at www.autodesk.com/investors. Please go to the Website 15 minutes early to register, download and install any necessary software. For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk uses its investors.autodesk.com website as a means of disclosing material non-public information, announcing upcoming investor conferences and for complying with its disclosure obligations under Regulation FD. Accordingly, you should monitor our investor relations website in addition to following our press releases, SEC filings and public conference calls and webcasts.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-to-present-at-upcoming-investor-conferences-300964242.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk And Virgin Hyperloop One Announce Joint-Effort To Explore Advanced Route Optimization, Transportation Design, And Construction Technology",
        "subtitle": "",
        "date": "Nov 20, 2019 11:00AM EST",
        "content": " LAS VEGAS, Nov. 20, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) and Virgin Hyperloop One, a leader of hyperloop technology and the evolution of how the world moves people and goods, announced an alliance to explore new opportunities in extending the value of Building Information Modeling (BIM) for transportation route optimization and improved digital engineering and construction workflows. \"Virgin Hyperloop One is pushing the boundaries of transportation efficiency,\" said Josh Giegel, Co-Founder and Chief Technology Officer of Virgin Hyperloop One. \"Together, with our global teams and shared customers, Virgin Hyperloop One and Autodesk will explore ways to optimize hyperloop routing and operations – in a way that not only propels the hyperloop industry forward, but also has ancillary benefits to more traditional forms of transportation such as railway and highway route optimization.\"Virgin Hyperloop One's visionary technology features depressurized tubes that carry on-demand passenger or cargo pods at speeds of up to 670 miles per hour, powered by magnetic-levitation and electric propulsion. Its depressurized tube infrastructure eliminates the impacts of air-drag and friction, requiring less energy and cost to operate, and allows travel to occur at exceptionally high speeds.\"Autodesk technology is in the DNA of much of the built world everywhere – and I mean everywhere,\" said Nicolas Mangon, Vice President of AEC Business Strategy at Autodesk. \"With the global population expected to hit 10 billion by 2050, the way infrastructure is designed and constructed, and how we move people and goods, must change. We have a choice to either accommodate the expected growth or become overwhelmed by it. I believe Virgin Hyperloop One and Autodesk together will help to tackle the challenges ahead.\" Since 1984, Autodesk continues to be a recognized leader in BIM and an innovator of technology used by architects, engineers, and construction teams globally. Autodesk technology connects all stakeholders on infrastructure and building projects from design through construction to operations and maintenance.  Autodesk technology has been used on some of the most complex building and infrastructure projects on the planet, including Pan Borneo Highway Sarawak, New York Metropolitan Transit Authority's East Side Access, the San Francisco Airport Terminal 1 redevelopment, Dubai's Museum of the Future, and the world's tallest skyscrapers including the Shanghai Tower, and many others around the world.By bringing in the context of the real world into the design and engineering phases of a project, Autodesk and Virgin Hyperloop One hope to more efficiently calculate costs across the entire lifespan of a project – design, construction, operations, and maintenance. More advanced design and engineering tools may allow for simpler optioneering. For example, quickly determining whether a hyperloop system should be placed adjacent to an existing highway or beneath the ground or above – and how these decisions may impact the adjacent cities or communities. Virgin Hyperloop One currently leverages many Autodesk solutions in design, including Civil 3D, InfraWorks, Revit and Inventor.  Virgin Hyperloop One is also adopting Autodesk's BIM 360 project delivery platform and global cloud collaboration tools.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.About Virgin Hyperloop One Virgin Hyperloop One is the only company in the world that has successfully tested its hyperloop technology at scale, launching the first new mode of mass transportation in over 100 years. The company successfully operated a full-scale hyperloop vehicle using electric propulsion and electromagnetic levitation under near-vacuum conditions, realizing a fundamentally new form of transportation that is faster, safer, cheaper, and more sustainable than existing modes. The company is now working with governments, partners, and investors around the world to make hyperloop a reality in years, not decades. They currently have projects underway in Missouri, Texas, Colorado, the Midwest, India, and the UAE. Learn more about Virgin Hyperloop One's technology, vision, and ongoing projects here.Autodesk, BIM 360, Civil 3D, InfraWorks, Inventor, and Revit are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-and-virgin-hyperloop-one-announce-joint-effort-to-explore-advanced-route-optimization-transportation-design-and-construction-technology-300961115.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Ushers in New Era of Connected Construction with Autodesk Construction Cloud",
        "subtitle": "More than 50 new enhancements and powerful integrations unveiled across construction management solutions enable the construction industry to improve collaboration, reduce risk and increase profitability",
        "date": "Nov 18, 2019 2:05PM EST",
        "content": " LAS VEGAS, Nov. 18, 2019 /PRNewswire/ -- Autodesk University - Today at Connect & Construct Summit, Autodesk, Inc. (Nasdaq: ADSK) unveiled Autodesk Construction Cloud™, which combines advanced technology, a unique builders network and predictive insights to connect people and data across the entire building lifecycle, from design through operations. Experience the interactive Multichannel News Release here: https://www.multivu.com/players/English/8625351-autodesk-construction-cloud-construction-management-software/ At the center of Autodesk Construction Cloud are best-of-breed construction solutions Assemble, BuildingConnected, BIM 360 and PlanGrid. Autodesk Construction Cloud brings these solutions together, and with Autodesk's established design authoring tools, connects headquarters, office and field teams to increase collaboration and productivity.Autodesk Construction Cloud includes more than 50 new product enhancements, as well as deeper integrations between each product to allow data to flow across all stages of construction. It also includes powerful new artificial intelligence functionality that helps construction teams identify and mitigate design risks before problems occur — reducing delays, rework and costs.Autodesk Construction Cloud includes three core elements that give construction companies a competitive advantage in the industry:\"Despite the tremendous challenges construction companies face to connect huge volumes of data and people, no one has delivered on the promise of unified construction from design to operations — until now,\" said Jim Lynch, vice president and general manager, Autodesk Construction Solutions. \"With Autodesk Construction Cloud, we're introducing a new era of connected construction and offering unrivaled integration between headquarters, office and field teams. We've never been more dedicated nor clearer in our mission to empower designers, contractors and owners to meet the world's rapidly expanding construction needs, while helping to make building more predictable, safe and sustainable.\" \"We need to be able to measure ourselves, look to the future and anticipate project risk. This insight is what's missing today, and is a key driver in moving the industry forward,\" said Jenny Moshea, head of technology at Sellen Construction. \"Autodesk Construction Cloud brings together advanced technology—which Autodesk has always been known for—with the network of the building community—which is the core of what we do as an industry—underpinned by predictive insights. This is the next evolution, the connected tissue that brings it all together so the construction lifecycle is no longer disjointed.\"1. Autodesk Construction Cloud increases technology depth with 50+ new enhancements and makes data flow with integrations across all productsAs part of the launch of Autodesk Construction Cloud, the company is unveiling more than 50 new product enhancements that span the entire building lifecycle from design through operations. Most enhancements are available today, with a few rolling out over the next several weeks. Highlights of the new innovations include:To empower construction teams to reduce miscommunication, errors and rework, Autodesk is focused on providing the entire construction team with access to crucial data whenever it's needed. Over the past 18 months, the company has rolled out 18 different integrations, allowing data to flow between all its construction products. These include integrations between Revit and PlanGrid, BIM 360 Design and Civil 3D, BuildingConnected and PlanGrid, and BIM 360 and Assemble, to name just a few.Built with BIM 360's common data environment (CDE), Autodesk Construction Cloud ensures the whole team is collaborating on an integrated record set. Beyond the current capabilities, Autodesk is investing in supporting our customers in meeting ISO-19650.Learn more about other major product enhancements unveiled today on the new Autodesk Construction Cloud blog.2.  Industry's largest network of construction professionals helps bring together the right teams Autodesk Construction Cloud encompasses the industry's largest ecosystem of owners, designers, builders and trades, including nearly one million subcontractors who use BuildingConnected. The Builders Network enables owners and builders to connect to the right partners to create the best teams for any project anywhere — reducing risk, decreasing rework and increasing profitability. 3.  AI-powered analytics identifies risks before they become rework Autodesk Construction Cloud encompasses powerful artificial intelligence that helps construction teams identify and mitigate risks before problems occur — helping to reduce delays, rework and cost. Technology such as TradeTapp, which arms general contractors with subcontractor risk analysis during the planning phase, and Construction IQ, which uses algorithms to prioritize the highest risk projects, subcontractors and issues that need attention during the build phase, gives teams the insight and confidence to make informed decisions and build right the first time.For example, according to Autodesk's data science team, more than 70 percent of RFIs in construction are attributed to design issues or documentation errors, which often escalate into costly change orders and even larger litigation disputes. Design Risk Management applies Construction IQ's machine learning capabilities to the design review process that happens within BIM 360's Document Management module, enabling GCs to easily identify and predict as early as possible the design and constructability issues that may turn into costly RFI's. \"Autodesk's end-to-end system for the entire building lifecycle — from design through to long-term maintenance — is giving us a competitive advantage. Using the advanced technology and predictive insights of Autodesk Construction Cloud, we achieved a 20 percent gain in quality and safety on a high profile project,\" said Michael Murphy, digital construction operations manager at BAM Ireland. \"Autodesk Construction Cloud is bringing us one step closer to a unified solution with all our data in the same platform, so that information is no longer in a silo or lost. We're strongly aligned with Autodesk in pursuit of better construction across the globe.\"About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Safe Harbor StatementWe may make statements regarding planned or future development efforts for our existing or new products and services. We wish to caution you that such statements reflect our current expectations, estimates and assumptions based on factors currently known to us and that actual events or results could differ materially. These statements are not intended to be a promise or guarantee of future delivery of products, services or features but merely reflect our current plans, which may change. Purchasing decisions should not be made based upon reliance on these statements. The Company assumes no obligation to update these forward-looking statements to reflect events that occur or circumstances that exist or change after the date on which they were made.Autodesk, the Autodesk logo, Autodesk Construction Cloud, AutoCAD, BIM 360, BuildingConnected, Navisworks, PlanGrid, and Revit are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names, or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.      View original content:http://www.prnewswire.com/news-releases/autodesk-ushers-in-new-era-of-connected-construction-with-autodesk-construction-cloud-300960197.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "The Opportunity for Better Starts at Autodesk University 2019",
        "subtitle": "Thousands to explore how the age of automation and converging industries support a better and brighter future",
        "date": "Nov 18, 2019 9:00AM EST",
        "content": "LAS VEGAS, Nov. 18, 2019 /PRNewswire/ -- Autodesk University – Today marks the start of annual Autodesk, Inc. (NADSAQ: ADSK) user conference Autodesk University (AU), connecting over 12,000 global professionals from construction, manufacturing, architecture, engineering and media creation. With four days of comprehensive classroom learning sessions and networking experiences, AU aims to arm its attendees with the knowledge needed to enact a better future of making.The conference will kick off with an opening keynote from Autodesk President and CEO Andrew Anagnost, who will revisit Autodesk's ongoing commitment to providing industries with tools to do more, with less negative impact on the planet. At this year's conference, the themes of more and less culminate to focus on the important opportunity for better – better workflows, outcomes and world – as industries continue to evolve. He will be joined by guest speakers, including Build Change founder and CEO Dr. Elizabeth Hausler, as well as Walt Disney Imagineering executive creative director Asa Kalama.\"AU Las Vegas is a celebration of the very real ways our customers are using technology to make an impact and embrace the opportunity for better,\" says Anagnost. \"We're hoping attendees leave this year's conference feeling inspired and empowered to do the same within their respective industries.\"Two further keynotes during the conference will focus on the latest developments for customers in the architecture, engineering and construction (AEC) industry, and the design and manufacturing industry, respectively. While these large-scale sessions will showcase technology and customer partners proprietary to each respective industry, they will also provide in-depth explorations of the ways these areas are converging to enable better cross-industry innovation.Throughout the event, conference attendees will get to learn outside of the classroom with hands-on experiences at the AU Las Vegas Expo, featuring the technologies that are actively changing how our customers design, make and build. Examples include the first mass-produced chair created by human designers using AI technology; the world's largest, AR-enhanced hybrid manufacturing machine; digital and data-driven innovations within sustainable water infrastructure design; and space dedicated to a high-performance basketball and entertainment center with community at its core.AU will also provide attendees with the opportunity to engage with the Autodesk Community Team in officially launching its new Autodesk Group Network. Formed with 80+ existing global groups and leaders, this program is designed to better support and amplify user efforts, innovation and performance across industries and software applications.Autodesk is excited to name Build Change as the recipient of the AU Las Vegas 2019 Donation Drive. Build Change saves lives in earthquakes and windstorms through the construction of disaster-resilient homes and schools. It addresses the technology, financial and people-focused challenges that, without a global effort, will leave a third of the world's population stuck in unsafe housing by 2030. The Autodesk Foundation, currently celebrating its five-year anniversary, has worked with Build Change since 2014, providing access to software licenses, trainings and more. In addition, to further scale its impact and support of nonprofits like Build Change and others, Autodesk is targeting to contribute 1% of operating margin to the Autodesk Foundation.For the fifth consecutive year, AU Las Vegas 2019 will be a carbon neutral event. This sustainable effort is reinforced and expanded by Autodesk's commitment to achieve carbon neutrality in 2020 by applying its carbon price and investing in efficiency, renewables and carbon offset projects with customers.Throughout the conference, Autodesk will share details on new product advances, partnerships and initiatives that will help its customers embrace the opportunity for better. Posts to Autodesk's company blog, ADSK News, will report on news as it is announced.Autodesk University Reaches Customers WorldwideAutodesk University (AU) is a series of conferences and an online learning destination focused on inspiring, challenging and energizing Autodesk software users, partners, and industry leaders about the future of design and engineering. The AU conferences bring together more than 22,000 participants at live events in 8 countries through classes, forums, and keynotes with industry experts and thought leaders. More than 2.5 million more engage with AU on the web, which offers free year-round access to learning content, professional development, and inspirational industry talks from the AU conference events. More information is available at the Autodesk University website, or by following @AutodeskU, #AU2019.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/the-opportunity-for-better-starts-at-autodesk-university-2019-300959455.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Extends Invitation to Join Financial Results Conference Call",
        "subtitle": "Third Quarter Fiscal 2020 Financial Results Conference Call to be Held Tuesday, November 26, 2:00 p.m. Pacific Time",
        "date": "Nov 1, 2019 8:00AM EDT",
        "content": " SAN RAFAEL, Calif., Nov. 1, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced that it will broadcast its third quarter fiscal 2020 financial results conference call live via its website Tuesday, November 26, 2019 at 2:00 p.m. Pacific Time. Autodesk will host a live webcast call at www.autodesk.com/investors. An audio replay webcast and podcast will also be available after 5:00 p.m. Pacific Time on Autodesk's website at www.autodesk.com/investors. For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk uses its investors.autodesk.com website as a means of disclosing material non-public information, announcing upcoming investor conferences and for complying with its disclosure obligations under Regulation FD. Accordingly, you should monitor our investor relations website in addition to following our press releases, SEC filings and public conference calls and webcasts.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-extends-invitation-to-join-financial-results-conference-call-300940468.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk BIM 360 Design Now Offers Anytime, Anywhere, Cloud Collaboration On Projects With Both Infrastructure And Building Features",
        "subtitle": "An Industry First, Autodesk's Fastest-Growing Cloud Product, BIM 360 Design, Enables Cross-Discipline Collaboration Across Teams and Locations on Projects with Vertical and Horizontal Structures",
        "date": "Oct 30, 2019 8:00AM EDT",
        "content": " SAN RAFAEL, Calif., Oct. 30, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) announces the expansion of Autodesk BIM 360 Design, Autodesk's fastest-growing cloud solution, to include Autodesk Civil 3D. With this announcement, Autodesk now offers one of the most comprehensive solutions enabling teams to collaborate on complex projects with horizontal and vertical structures, nearly anytime, anywhere in a single connected cloud platform.Collaboration for Civil 3D, now included with a BIM 360 Design subscription, allows subscribers of BIM 360 Design and Civil 3D to work collaboratively with project partners at anytime and from anywhere, regardless of team locations and disciplines, including architects, engineers, and contractors. With the existing Revit Cloud Worksharing capabilities and the addition of Collaboration for Civil 3D to the same platform, designing airports, rail stations, and other complex projects with vertical and horizontal structures is simpler and more efficient. Not only can customers collaborate using streamlined workflows on a unified platform, they can also perform their day-to-day data management activities in the same place. \"Complex projects often require similarly complex teams spread across offices, multiple companies, and perhaps across time zones, and include both horizontal and vertical features,\" said Nicolas Mangon, vice president, Autodesk AEC Business Strategy and Marketing. \"Adding Civil 3D to BIM 360 Design responds to the cross-discipline challenges our customers are facing on projects which include building and infrastructure features. Autodesk strives to meet our customers' changing needs, and this is a major shift in how they will be able to get their work done and hopefully win more business.\"The 2018 launch of BIM 360 Design for Revit brought Autodesk customers a compelling new way to work on Revit building design projects by allowing them to collaborate in real-time and co-author Revit models, and then connect design data downstream to the jobsite because all project information is centralized on the BIM 360 project delivery platform. Customers are already experiencing extraordinary return on investment using BIM 360 Design for Revit.Customer FeedbackAECOM is one of the world's premier global infrastructure firms, delivering professional services throughout the project lifecycle – from planning, design and engineering to consulting and construction management. AECOM is committed to enabling and increasing collaboration with all stakeholders across the project lifecycle. Global AECOM staff participated in the beta-program testing of the BIM 360 design collaboration tool for Civil 3D.\"Collaboration for Civil 3D on BIM 360 Design has proven to align our site development and civil design teams so they can use BIM 360 holistically across all disciplines,\" said Russ Dalton, AECOM's BIM Director for the Americas. \"By expanding the collaboration capabilities of BIM 360 we can align with other disciplines in real time at a point in the lifecycle when decision making is key. This will ensure we're in immediate step with all disciplines including civil, which will benefit the entire project team.\" Pennoni is a leading US-based consulting engineering firm with more than fifty years of experience helping communities and private sector clients navigate the ever-changing technological advancements available and discover how best to integrate these into the current landscape.  Pennoni is increasing collaboration with all stakeholders across the project lifecycle and has actively participated in the BIM 360 Design collaboration tool for Civil 3D beta-program.  \"Autodesk's launch of Collaboration for Civil 3D for BIM 360 Design connects our horizontal infrastructure teams with other project stakeholders, allowing real-time design collaboration across all lines of service,\" said Stacey Morykin, Design Technology Manager, Pennoni. \"The ability to incorporate horizontal design with vertical design teams has made a monumental impact on making the right decisions for our partners at vital moments during the project life-cycle.\"Key benefits of Collaboration for Civil 3D for BIM 360 DesignAnytime, anywhere collaboration. The ability to collaborate across multiple locations and companies, securely and in real time. Connected data throughout the project lifecycle. Now architects, engineers, contractors and extended project team stakeholders can seamlessly collaborate to improve project outcomes.  Visualize Design Changes. Experience how new information will impact ongoing work to improve decision-making.  Single Source of Truth. Centralized collaboration and data management on a common data platform removes silos and keeps teams on the same page with the most up to date information. Easy Team Handoff.  Fast adoption from one team to the next, accessible historical data, and collaboration and data management in the field with mobile connectivity.Save on IT maintenance and benefit from the cloud. Scale up and down as project needs change. No more wasting time on uploads, downloads, or costly server maintenance.Begin your design collaboration now. About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk, BIM 360, BIM 360 Design, Civil 3D, Collaboration for Civil 3D, and Revit are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document.© 2019 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-bim-360-design-now-offers-anytime-anywhere-cloud-collaboration-on-projects-with-both-infrastructure-and-building-features-300947392.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Unveils Robust New Features for BIM 360",
        "subtitle": "Enhanced BIM 360 Layout app empowers construction teams to speed up layout workflows, and additional feature advancements aim to simplify daily tasks",
        "date": "Oct 9, 2019 8:00AM EDT",
        "content": "SAN RAFAEL, Calif., Oct. 9, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced enhancements to BIM 360, including a newly designed Layout app for mobile devices on Android operating systems. Autodesk also unveiled new BIM 360 features that make the project set-up process easier and increase collaboration between the field and the office, with expanded machine learning capabilities to better identify risk.Traditionally, construction layout and verification tasks were handled by one or two trained individuals who had access to siloed point information and knew how to operate complex layout equipment. BIM 360 Layout solves this major pain point by making the layout process easy for any construction team member. With model data accessible directly from within Layout via the cloud, anyone on a project team can now collaborate across the BIM 360 unified platform. BIM 360 Layout also enables construction teams to connect a coordinated model directly to the layout process with Robotic Total Stations and GPS devices, increasing jobsite productivity, and reducing rework and waste while improving the accuracy of staked or installed building components.Features in the enhanced BIM 360 Layout app include:\"The BIM 360 Layout app gives us the freedom to make changes and manipulate points or specific parts of a model or drawing,\" said Robert Boggs, project coordinator and total station operator at Helix Electric. \"It also allows us to post multiple files for a building. Instead of having one big centralized model, we now have the option to break the model data apart however we need, whether it's by floor or by filtering point views by status or elevation. Layout is now a quick and much more simple process for us.\"New BIM 360 features automate routine tasks and increases communication between office and field teams Additional BIM 360 features recently launched include updates to automate the project set-up process, making workflows easier for construction teams and providing the right level of access to team members. These updates to the BIM 360 platform include:BIM 360 Construction IQ capabilities are also now available to any BIM 360 field management module user. With the expansion of this availability, more teams are now able to access a wider range of project data and obtain a more holistic view of company-wide project metrics. \"The industry is demanding powerful yet easy-to-use technology that seamlessly connects data and supports collaboration through all phases of construction,\" said Ilai Rotbaein, director, BIM 360 products at Autodesk. \"With tools such as BIM 360 Layout, which simplifies workflows and improves project efficiency, we're providing a common data platform for both design and construction and connecting the entire project team wherever they work and from whatever device they access information.\" Learn more about how BIM 360 Layout empowering construction teams to build more efficiently on the Autodesk Connect & Construct blog.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Safe Harbor StatementWe may make statements regarding planned or future development efforts for our existing or new products and services. These statements are not intended to be a promise or guarantee of future delivery of products, services or features but merely reflect our current plans, which may change. Purchasing decisions should not be made based upon reliance on these statements. The Company assumes no obligation to update these forward-looking statements to reflect events that occur or circumstances that exist or change after the date on which they were made.Autodesk, the Autodesk logo, and BIM 360 are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names, or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-unveils-robust-new-features-for-bim-360-300934433.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk to Present at Citi Global Technology Conference",
        "subtitle": "",
        "date": "Aug 28, 2019 8:00AM EDT",
        "content": " SAN RAFAEL, Calif., Aug. 28, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) will present at the Citi Global Technology Conference in New York, on Wednesday, September 4 at 9:30 a.m. Eastern Time. A live webcast, replay and podcast of the presentations will be available through Autodesk's Investor Relations Website at investors.autodesk.com. Please go to the Website at least 15 minutes early to register, download and install necessary software. For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved. View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-to-present-at-citi-global-technology-conference-300907331.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Integrates BuildingConnected with PlanGrid to Streamline Workflows Between Preconstruction and Field Teams",
        "subtitle": "Building on momentum of product consolidation, new Autodesk integration instantly pushes critical preconstruction data from BuildingConnected to PlanGrid, saving time and reducing mistakes",
        "date": "Aug 13, 2019 8:00AM EDT",
        "content": "SAN RAFAEL, Calif., Aug. 13, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced it has integrated BuildingConnected bid management solutions with PlanGrid technology, enabling the seamless transfer of data from preconstruction to the building process. The integration allows construction project managers to automatically push design and preconstruction files from BuildingConnected to PlanGrid, saving time, reducing errors and further enhancing the cost savings associated with using both platforms. With this integration, project managers can also easily connect field workers with project planning and estimation workflows used throughout the building process.Integrating BuildingConnected with PlanGrid solves a major problem for project managers, who typically use the same designs, plans, estimates and other documentation during preconstruction as in the construction phase. Historically, managers have needed to manually transfer these files and documents into field collaboration software, a time-consuming and repetitive process that can result in missing files or data errors – and ultimately, miscommunications and project delays. Now, project managers can create PlanGrid projects directly in BuildingConnected. With a simple \"push to PlanGrid\" button, all project files in BuildingConnected are automatically sent to PlanGrid where they can be accessed immediately from mobile devices in the field. By transferring design and preconstruction files into PlanGrid, managers can sidestep manual project creation and ensure that accurate and holistic data is available to field teams.\"Successful project execution starts the moment we win a deal. Our team immediately goes into overdrive to make sure we maximize efficiency throughout the entire build process, connecting workflows and seamlessly transferring complex data from the design and planning phase into the hands of workers on the jobsite,\" said Mike Mehrwin, VDC manager, CRB. \"By taking advantage of the BuildingConnected and PlanGrid integration, we'll be able to close the gap between the preconstruction and building process and enable deeper collaboration between our office and field teams.\" \"The construction industry has struggled with transferring information from one project to another, and across the different phases of a building project. It's easy to feel insecure about the logistics of kicking off a job when the right tools to facilitate workflows don't exist,\" said Dustin DeVan, vice president, preconstruction products at Autodesk. \"By reducing errors and the need for rework, this integration will help to mitigate overall project risk and help to ensure more predictable outcomes. Project managers can now feel more confident as they transition from precon to site construction.\"Autodesk positions construction teams for success with product integrations The BuildingConnected integration with PlanGrid follows quickly on the heels of other integrations between the construction solutions Autodesk has acquired in the last 12 months, such as:\"By connecting our portfolio of construction solutions, we're empowering customers to realize meaningful workflows across the entire project lifecycle, whether it's delivering design files from the office to the field or referencing an accurate as-built during building operations,\" said Jim Lynch, vice president and general manager, Autodesk Construction Solutions. \"Autodesk is reimagining the construction business for the digital age, and we look forward to the positive impact this integration will have for our customers.\"About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Safe Harbor Statement We may make statements regarding planned or future development efforts for our existing or new products and services. These statements are not intended to be a promise or guarantee of future delivery of products, services or features but merely reflect our current plans, which may change. Purchasing decisions should not be made based upon reliance on these statements. The Company assumes no obligation to update these forward-looking statements to reflect events that occur or circumstances that exist or change after the date on which they were made.Autodesk, the Autodesk logo, Assemble, BIM 360, BuildingConnected, Navisworks, PlanGrid, and Revit are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names, or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-integrates-buildingconnected-with-plangrid-to-streamline-workflows-between-preconstruction-and-field-teams-300900342.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "BNBuilders Turns to Autodesk to Manage Complex Construction Projects Throughout the Building Lifecycle",
        "subtitle": "By standardizing on BuildingConnected and PlanGrid, leading general contractor maximizes collaboration and simplifies data management",
        "date": "Aug 6, 2019 3:01AM EDT",
        "content": "SAN RAFAEL, Calif., Aug. 6, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced BNBuilders, a U.S.-based general contractor trusted by Fortune 500 clients, has adopted Autodesk construction solutions BuildingConnected and PlanGrid across the company. BNBuilders is using BuildingConnected's preconstruction solution to simplify the early planning stages of projects, and PlanGrid's easy-to-use field collaboration software to manage project data during construction and operations. The company's increased investment in Autodesk construction solutions complements its existing use of Autodesk AutoCAD®, Civil 3D®, Navisworks® and Revit® software for design and model development, collaboration and review across the entire building lifecycle. \"Simplifying the way we work is critical for our success given the complexity of our clients' projects,\" said Melissa Gomez, project engineer, BNBuilders. \"Even before we break ground, we need to make sure everyone on the team is working towards a common goal and making decisions quickly and effectively. BuildingConnected and PlanGrid empower us to build the right teams, easily collaborate and effectively manage both the people and the data we work with during preconstruction and construction. At turn over, we're then able to deliver complete data packages to owners so they can successfully maintain their facilities long after construction is complete.\"BNBuilders provides comprehensive preconstruction services and leads ground-up construction, as well as complex build-outs in a wide variety of private and public segments, particularly life science, high technology and bio-tech. Projects often entail solving highly technical issues such as installing specialized equipment and systems, maintaining strict quality control and validation requirements, and managing complex phasing. Dozens of subcontractors are often involved in projects, requiring meticulous coordination and communication from project start to finish. The Seattle-based general contractor selected BuildingConnected and PlanGrid to streamline collaboration and project data across construction phases, ensuring all stakeholders have immediate access to critical data and coordination is streamlined. Using both BuildingConnected and PlanGrid together, BNBuilders is able to select the most qualified subcontractors and keep them coordinated with all stakeholders across the field and the office. To prepare for construction, BuildingConnected enables construction teams to effortlessly manage bid invites, level bids and qualify vendors in one place. Relying on BuildingConnected during preconstruction, BNBuilders is able to start building with the right subcontractor teams in place, reduce risks upfront and operate within approved estimates. During construction, PlanGrid seamlessly keeps office and field teams in sync on the latest project data by automating tedious tasks such as distributing updates, creating file folders and hyperlinking documents. Everyone is able to work off of the same set of data, important details and changes are not overlooked, and rework, material waste and schedule overruns are minimized. PlanGrid's comprehensive activity log also allows BNBuilders to easily turn over accurate as-builts to clients.\"Construction projects are becoming increasingly complex, as new technologies are integrated into facilities and more subcontractors are required onsite to finish the build,\" said Jim Lynch, vice president and general manager, Autodesk construction solutions. \"BuildingConnected and PlanGrid, together with Autodesk design and modeling solutions, are enabling general contractors such as BNBuilders to seamlessly connect teams throughout the building lifecycle and build right the first time.\"About BNBuildersFounded in 2000 in Seattle, BNBuilders is a West Coast general contractor that specializes in complex projects for clients in the life sciences, education, healthcare, public, and technology sectors. They are known for their innovative solutions to highly technical issues, comprehensive preconstruction services, passion for sustainable construction practices, and commitment to the communities in which they do business. With four offices, 600+ employees, and a strong presence in the California and Washington construction markets, BNBuilders is a leader and preferred contractor on the West Coast. For more information, visit www.bnbuilders.com.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Safe Harbor Statement We may make statements regarding planned or future development efforts for our existing or new products and services. These statements are not intended to be a promise or guarantee of future delivery of products, services or features but merely reflect our current plans, which may change. Purchasing decisions should not be made based upon reliance on these statements. The Company assumes no obligation to update these forward-looking statements to reflect events that occur or circumstances that exist or change after the date on which they were made.Autodesk, the Autodesk logo, BuildingConnected and PlanGrid are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names, or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/bnbuilders-turns-to-autodesk-to-manage-complex-construction-projects-throughout-the-building-lifecycle-300895940.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk Extends Invitation to Join Financial Results Conference Call",
        "subtitle": "Second Quarter Fiscal 2020 Financial Results Conference Call to be Held Tuesday, August 27, 2:00 p.m. Pacific Time",
        "date": "Aug 1, 2019 8:00AM EDT",
        "content": "SAN RAFAEL, Calif., Aug. 1, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) today announced that it will broadcast its second quarter fiscal 2020 financial results conference call live via its website Tuesday, August 27, 2019 at 2:00 p.m. Pacific Time. Autodesk will host a live webcast call at www.autodesk.com/investors. An audio replay webcast and podcast will also be available after 5:00 p.m. Pacific Time on Autodesk's website at www.autodesk.com/investors. For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-extends-invitation-to-join-financial-results-conference-call-300894112.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Factory_OS Receives Strategic Investments from Autodesk, Citi to Help Address Affordable Housing Crisis in Bay Area and Beyond",
        "subtitle": "",
        "date": "Jul 10, 2019 9:00AM EDT",
        "content": " MARE ISLAND, Calif., July 10, 2019 /PRNewswire/ -- Factory_OS, a leader in revolutionizing home construction by building multifamily homes more affordably and sustainably while creating jobs, and funding innovation, received strategic investments from Autodesk, Inc. (NASDAQ: ADSK) and Citi (NYSE: C) to address the growing affordable housing crisis in the San Francisco Bay Area and beyond. With this investment, Autodesk expands its existing relationship with Factory_OS by supporting the build out of the Factory Floor Learning Center, a space dedicated to education and research on industrialized construction and changes needed in public policy to optimize its benefits. This work will be led by the Terner Center for Housing Innovation. The investment will also help establish a team to scope and build a new Rapid Response Factory. This second factory space offers an opportunity to both explore additional machining techniques and to meet the demand of quick turnaround housing needed after natural disasters and emergencies. Together, Autodesk and Factory_OS will provide greater software collaboration to streamline design, fabrication and supply chain management. Citi is backing Factory_OS through its Spread Products Investment Technologies (SPRINT) initiative within the ICG division, which formed in 2018 to invest and engage new technology partners, and Citi Community Capital, the bank unit through which Citi works to finance all types of affordable housing and community development projects. In 2018, Citi reported over $6 billion of lending to finance affordable rental housing projects and was recognized as the Country's largest affordable housing lender for the ninth consecutive year.\"Autodesk and Citi are playing a critical role in our continued growth and expansion,\" said Rick Holliday, CEO of Factory_OS. \"We're proud to stand alongside two companies that share our vision for transforming the construction industry, and care deeply about addressing the housing crisis that exists not only in our backyard but also in urban centers nationwide.\"Added Andrew Anagnost, CEO of Autodesk: \"Factory_OS is a pioneer that is revolutionizing the approach to modularized homebuilding and making the dream of affordable housing in cities, a reality. We're honored to support their mission, in collaboration with Citi, of giving families safe and affordable homes to call their own. I have no doubt our continued collaboration will serve as a springboard to addressing the growing housing crisis nationwide.\"  \"Bringing innovation to affordable housing is critical in addressing one of the nation's most pressing challenges,\" said Matt Zhang, Head of Spread Products Investment Technologies at Citi. \"We're excited to be part of this envisioning process and together, with Factory OS, we can help bring transformational changes to meet the growing demand for safe, high-quality affordable housing.\"To learn more about today's announcement, please visit ADSK NEWS.About Factory OSFactory OS is a volumetric modular construction start-up in the SF Bay Area with considerable potential to displace conventional construction practices for affordable multi-unit residential properties in this region and other U.S. urban centers. Founded by industry veterans, they're committed to growing their business in a sustainable way and being the disruptive force to the industry that they know is needed. For more information visit factoryos.com. About Autodesk, Inc. Autodesk makes software for people who make things.  If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk. View original content to download multimedia:http://www.prnewswire.com/news-releases/factoryos-receives-strategic-investments-from-autodesk-citi-to-help-address-affordable-housing-crisis-in-bay-area-and-beyond-300882286.htmlSOURCE  Autodesk, Inc.; Factory_OS"
    },
    {
        "title": "Autodesk Introduces PlanGrid Advanced RFIs and Project Hub to Boost Project Visibility and Extend Workflows to the Field",
        "subtitle": "New products enable construction teams to resolve issues faster so they can stay on track and reduce project risk",
        "date": "Jun 18, 2019 3:00AM EDT",
        "content": "SAN RAFAEL, Calif, June 18, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK), today announced availability of PlanGrid Advanced RFIs and Project Hub, two powerful new additions in the PlanGrid platform that give construction teams greater visibility into a project's progress and unforeseen challenges. Advanced RFIs automate the Request for Information (RFI) workflow to speed up the process, and Project Hub provides an actionable picture of key project activity in one central location within PlanGrid's software. Together, these new capabilities enable construction teams to identify and resolve issues faster and keep projects on track. \"Construction is a massive logistical challenge involving hundreds of people, and the flow of information on a jobsite can sometimes be like a game of telephone. Crucial data can get lost as it travels, whether it's between the field and the office or between team members, and decisions then get bottlenecked,\" said Sameer Merchant, head of products, site construction, Autodesk Construction Solutions. \"The innovations we're introducing today, Advanced RFIs and Project Hub, provide greater visibility across a project, boost collaboration and help teams move forward faster. By automating and streamlining the flow of data, Autodesk Construction Solutions is empowering the construction industry to make decisions more effectively and keep projects on track.\"\"On a typical project, we're managing vast quantities of information, and we need a way to make this information manageable and easily accessible. If my team doesn't have the insights we need, work stalls out and it can cause a domino effect on interrelated resources across the project,\" said Rob Winklepleck, General Manager, West Brothers Construction. \"The new features in PlanGrid not only help speed up the building process but also show me exactly what needs to happen to move the project forward. My team is able to get a quick response to pressing issues, and I spend less time calling or walking back and forth from the trailer to the field to verify work.\"Advanced RFIs help the field get answers faster The Request for Information (RFI) process resolves questions that come from drawings, specs, contracts and other construction documents that aren't fully coordinated. Ideally, an RFI moves from one person to the next: from the field to the office and then on to a design team reviewer, who provides insight and sends it back. While the flow of information should be straightforward, when the RFI process is not streamlined, it often involves multiple conversations and can take several weeks to get resolved. Information also can get lost along the way and schedules may be delayed.PlanGrid's Advanced RFIs automate the process and gives construction teams a visual and structured workflow to manage and distribute questions and answers efficiently and intuitively. Any project member can quickly draft a question from a log or sheet and attach photos, and then track RFI progress all from within PlanGrid. Reviewers are notified and can respond by email, and answers are immediately distributed to all critical team members. Responses are also automatically added to the RFI history within PlanGrid's platform to decrease miscommunication.PlanGrid will continue making the flow of data on a construction project seamless, with features in the future that allow change orders to be efficiently managed from start to finish. Along with Advanced RFIs and PlanGrid Submittals, these features empower the field to get answers faster and provide the office with insights to make better decisions. Project Hub gives the trailer and office a real-time pulse of what's happening in the field With thousands of documents to track and large teams to coordinate, project managers and engineers can struggle to have a clear understanding of what is happening across a project.Project Hub is a centralized place within PlanGrid's platform where project engineers and managers can get a pulse of their project in real-time and take action on the most critical field operations. With an uncluttered interface that is easy-to-use and simple to navigate, Project Hub delivers a holistic picture of all project activity, providing instant answers to questions such as, \"What has changed on the project? Does everyone have the most up-to-date information? What tasks need to be assigned or are still incomplete?\" Project Hub features include:With Project Hub, managers in the office and trailer can immediately understand risk factors in the field, such as what is at risk of complications or of not being built correctly, and act quickly to address the highest priorities. For more insights on Advanced RFIs and Project Hub, join the webinar on the following dates; to register, please visit here.About PlanGridPlanGrid, an Autodesk company, builds simple, beautiful software that construction teams love to use. As part of Autodesk Construction Solutions, whose mission is to seamlessly connect the office, trailer and the field across the entire construction project lifecycle, PlanGrid's mobile-first solutions empower general contractors, subcontractors, owners and architects to provide fast, accurate information to the field. With unparalleled adoption by field workers, PlanGrid is used on projects as the single source of truth for all construction data — including drawings, photos, and other critical documents. As a result, critical workflows are streamlined, efficiency is improved and field teams can take on more work and get more done. PlanGrid's software and other Autodesk Construction Solutions products enable a complete data set to move seamlessly through each phase of a building's lifecycle — from design and preconstruction to construction, turnover and operations. PlanGrid is used on more 1.5 million construction projects in 100+ countries. Headquartered in San Francisco and founded in 2011, PlanGrid was acquired by Autodesk in 2018. Visit us at www.plangrid.com.About AutodeskAutodesk makes software for people who make things. If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything. For more information visit autodesk.com or follow @autodesk.Safe Harbor Statement We may make statements regarding planned or future development efforts for our existing or new products and services. These statements are not intended to be a promise or guarantee of future delivery of products, services or features but merely reflect our current plans, which may change. Purchasing decisions should not be made based upon reliance on these statements.The Company assumes no obligation to update these forward-looking statements to reflect events that occur or circumstances that exist or change after the date on which they were made.Autodesk, the Autodesk logo and PlanGrid are registered trademarks or trademarks of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names, or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-introduces-plangrid-advanced-rfis-and-project-hub-to-boost-project-visibility-and-extend-workflows-to-the-field-300869986.htmlSOURCE  Autodesk, Inc."
    },
    {
        "title": "Autodesk to Present at the Berenberg Design Software Conference",
        "subtitle": "",
        "date": "Jun 6, 2019 1:42PM EDT",
        "content": "SAN RAFAEL, Calif., June 6, 2019 /PRNewswire/ -- Autodesk, Inc. (NASDAQ: ADSK) will present at the Berenberg Design Software Conference in London, on Wednesday, June 12 at 12:45 p.m. British Summer Time.  A live webcast, replay and podcast of the presentations will be available through Autodesk's Investor Relations Website at www.autodesk.com/investors.  Please go to the Website at least 15 minutes early to register, download and install any necessary software.  For more information, please call Autodesk Investor Relations at 415-507-6373.About AutodeskAutodesk makes software for people who make things.  If you've ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you've experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything.  For more information visit autodesk.com or follow @autodesk.Autodesk is a registered trademark of Autodesk, Inc., and/or its subsidiaries and/or affiliates in the USA and/or other countries. All other brand names, product names or trademarks belong to their respective holders. Autodesk reserves the right to alter product and services offerings, and specifications and pricing at any time without notice, and is not responsible for typographical or graphical errors that may appear in this document. © 2019 Autodesk, Inc. All rights reserved.  View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-to-present-at-the-berenberg-design-software-conference-300863495.htmlSOURCE  Autodesk, Inc."
    }
]