[
    {
        "title": "Align Technology to Acquire Global Dental CAD/CAM Software Leader Exocad",
        "subtitle": "",
        "date": "Mar 4, 2020 4:00PM EST",
        "content": "SAN JOSE, Calif. and DARMSTADT, Germany, March  04, 2020  (GLOBE NEWSWIRE) -- Align Technology, Inc. (Align) (Nasdaq: ALGN) today announced that it has signed a definitive agreement to acquire privately held exocad Global Holdings GmbH (exocad) for approximately EUR376 million in cash. exocad is a global leader in the dental CAD/CAM software market and offers fully integrated workflows to dental labs and dental practices via a broad customer base of partners, and resellers in over 150 countries.The acquisition of exocad strengthens the Align digital platform that delivers innovative tools and features for diagnostic, restorative, implant, and orthodontic workflows. The acquisition brings exocad’s expertise in restorative dentistry, implantology, guided surgery, and smile design to the Align technology portfolio, extending Align’s Invisalign and iTero digital solutions and paving the way for new, seamless cross-discipline dentistry in lab and at chairside. exocad also broadens Align’s platform reach in digital dentistry with close to 200 partners and more than 35,000 licenses installed worldwide.“Dentistry today is evolving digitally, with technology advances and consumer awareness driving new opportunities in ortho-restorative and comprehensive treatment. Align is in a unique position to lead the digital transformation of dentistry by reimagining comprehensive treatment planning and by reinventing the way orthodontists and GPs practice with our digital platform for transforming smiles,” said Joe Hogan, Align Technology president and CEO. “exocad allows us to broaden and deepen Align’s digital platform by addressing restorative needs in our end-to-end digital platform that facilitate ortho-restorative and comprehensive dentistry and accelerates adoption of Invisalign treatment among the more than 300 million potential patients worldwide.”This acquisition is a natural next step in the collaboration between Align and exocad that started in 2017 with the seamless integration of Align’s iTero intraoral scanners and exocad Chairside CAD software.  The collaboration later expanded to a fully-validated workflow that enabled in-house milling of dental restoration on any compatible milling machine, and most recently, at the Chicago Midwinter Meeting 2020, we announced the unique exocad Connector.“I am excited by the enormous growth opportunity for exocad and its customers that comes with being a part of Align Technology,” said Tillmann Steinbrecher, CEO and co-founder of exocad. “Together, we will further strengthen exocad’s position as a key technology provider for the dental CAD/CAM industry and drive continuous innovation with the open and integrated approach that is the foundation of our company.”exocad will continue to operate as it exists today, enabling it to support a broad ecosystem of partners and end-users and continue to deliver hardware-independent software solutions. exocad co-founders Tillmann Steinbrecher and Maik Gerth, along with their team, are expected to remain after the transaction closes and report into John Morici, Align Technology, senior vice president and CFO.“The acquisition of exocad adds a talented and passionate team as well as a highly innovative, industry-leading product suite to our portfolio, providing an excellent complement to our current workflow solutions,” said Morici. “We will continue to invest in and build on exocad’s leadership in the dental CAD/CAM market and look to them to make significant contributions to Align’s overall strategy.”Under the terms of the agreement, Align will pay approximately EUR376 million in cash to acquire exocad, which is majority owned by Carlyle Europe Technology Partners (CETP.) The acquisition is expected to close during the second quarter of 2020. Goldman Sachs & Co. LLC is serving as exclusive financial advisor to Align. UBS Investment Bank is serving as exclusive financial advisor to exocad and funds managed or advised by CETP.Align anticipates that the acquisition of exocad is expected to be gross margin accretive, reflecting the strength of exocad’s software business. We expect GAAP EPS to be dilutive for the fiscal year 2020, due to acquisition-related costs.Align Web Cast and Conference CallAlign will host a conference call today, March 4, 2020 at 4:30 p.m. ET, 1:30 p.m. PT, to discuss the acquisition of exocad. The conference call will also be web cast live via the Internet.  To access the webcast, go to the “Events & Presentations” section under Company Information on Align’s Investor Relations web site at http://investor.aligntech.com.  To access the conference call, please dial 201-689-8261. An archived audio web cast will be available beginning approximately one hour after the call's conclusion and will remain available for approximately one month. Additionally, a telephonic replay of the call can be accessed by dialing 877-660-6853 with conference number 13699954 followed by #. For international callers, please dial 201-612-7415 and use the same conference number referenced above. The telephonic replay will be available through 5:30 p.m. ET on March 18, 2020.About Non-GAAP Financial MeasuresTo supplement our condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (“GAAP”), we use certain non-GAAP financial measures including, non-GAAP gross profit, gross margin, operating expenses, income from operations, operating margin, effective tax rate, net income and diluted EPS, which exclude certain items that may not be indicative of our fundamental operating performance including discrete cash and non-cash charges or gains that are included in the most directly comparable GAAP measure. Non-GAAP measures may exclude the effects of acquisition related costs such as amortization of acquired intangibles and certain other transaction-related costs, stock-based compensation, non-cash deferred tax assets and associated amortization related to intra-entity transfer of non-inventory assets, impairments and other (gains) charges, and litigation settlement gains, and, if applicable, any associated tax impacts.We use non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. Management believes these non-GAAP financial measures provide meaningful supplemental information regarding our recurring core operating performance. We believe that both management and investors benefit from referring to these non-GAAP financial measures in assessing our performance and when planning, forecasting and analyzing future periods. These non-GAAP financial measures also facilitate management's internal evaluation of period-to-period comparisons. We believe these non-GAAP financial measures are useful to investors both because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they are provided to and used by our institutional investors and the analyst community to help them analyze the performance of our business.There are limitations to using non-GAAP financial measures, though, because they are not prepared in accordance with GAAP and may be different from non-GAAP financial measures used by other companies. The non-GAAP financial measures are limited in value because they exclude certain items that may have a material impact upon our reported financial results. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which charges are excluded from the non-GAAP financial measures. We compensate for these limitations by analyzing current and future results on a GAAP as well as a non-GAAP basis and also by providing GAAP measures in our public disclosures. The presentation of non-GAAP financial information is meant to be considered in addition to, not as a substitute for or in isolation from, the directly comparable financial measures prepared in accordance with GAAP. We urge investors to review the reconciliation of our GAAP financial measures to the comparable Non-GAAP financial measures as presented, and not to rely on any single financial measure to evaluate our business. For more information on these non-GAAP financial measures, please see http://investor.aligntech.com/index.php/static-files/3303d8d7-163b-42f1-8856-9468f474428a.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com. About exocad GmbHexocad GmbH is a dynamic and innovative software company committed to expanding the possibilities of digital dentistry and providing OEMs (Original Equipment Manufacturers) with flexible, reliable, and easy-to-use CAD/CAM software for dental labs and dental practices. exocad software has been chosen by leading OEMs worldwide for integration into their dental CAD/CAM offerings, and thousands of exocad DentalCAD licenses are sold each year. For more information and a list of exocad reseller partners, please visit www.exocad.com. Forward-Looking StatementsThis news release, including the tables below and other information publicly disseminated by us, contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including quotations from management, statements regarding (i) expected transaction benefits and synergies as a result of the acquisition, (ii)  anticipated dilution and accretion, respectively, from the transaction, and (iii) expectations regarding the purchase price and timing of the transaction,  in addition to other matters discussed in this press release that are not purely historical data. We do not assume any obligation to update or revise any such forward-looking statements, whether as the result of new developments or otherwise.  Forward-looking statements contained in this news release and the tables below relating to expectations about future events or results are based upon information available to Align as of the date hereof. Readers are cautioned that these forward-looking statements are only predictions and are subject to risks, uncertainties and assumptions that are difficult to predict. As a result, actual results may differ materially and adversely from those expressed in any forward-looking statement.Among the factors that could cause actual results to differ materially from those contemplated include, without limitation: The foregoing and other risks are detailed from time to time in our periodic reports filed with the Securities and Exchange Commission, including, but not limited to, our Annual Report on Form 10-K for the year ended December 31, 2019, which was filed with the Securities and Exchange Commission (SEC) on February 28, 2020. Securities and Exchange Commission filings can be accessed over the Internet at http://www.sec.gov/edgar/searchedgar/companysearch.html. We undertake no obligation to revise or update publicly any forward-looking statements for any reason. "
    },
    {
        "title": "Align Technology Launches ClinCheck® “In-Face” Visualization Tool for the Invisalign Go System",
        "subtitle": "",
        "date": "Feb 20, 2020 8:30AM EST",
        "content": "SAN JOSE, Calif., Feb.  20, 2020  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) announced today the launch of the ClinCheck “In-Face” Visualization tool for the Invisalign Go system, Align’s innovative tooth movement system designed for general dentists. The ClinCheck In-Face Visualization tool enhances the digital treatment planning experience for doctors and their patients by incorporating a front-facing smile image of a patient’s face into their ClinCheck treatment plan. Initially available with the Invisalign Go system, the visualization tool will roll out across the Invisalign portfolio throughout the year as the technology is optimized for Align’s extensive network of over 100,000 doctors.“Sharing my treatment plan vision within an actual image of the patient’s face is a powerful, emotional moment, unlike any I have experienced chairside,” noted Dr. Chiann Gibson, DMD, of Naperville, IL. “This is truly a superior digital treatment planning experience for both me and my patients.”Align’s proprietary ClinCheck software for customized treatment planning provides practitioners with 3D images of planned tooth movements throughout the treatment journey. With the visualization tool, doctors can generate a compelling, clinical visualization of their patient’s teeth within an image of their face. Doctors can then use the visual as a guide in consultations with patients to educate patients, highlight the benefits of teeth straightening and visualize and discuss the optimal Invisalign clear aligner treatment option for each individual patient.“Align’s ClinCheck In-Face Visualization tool leverages our digital analysis and treatment protocols to help doctors develop and share their treatment plans,” said Zelko Relic, Align Technology, chief technology officer, senior vice president, Global R&D. “It’s a great fit into our end-to-end digital platform that starts with an iTero scan followed by Invisalign treatment and a healthy beautiful smile.”Intuitive Digital Design for a Powerful ExperienceAccessing the In-Face Visualization tool requires use of the Invisalign Photo Uploader application (available on iOS and Android) to capture digital photos of a patient. Photos are automatically uploaded to the Invisalign Doctor Site where the tool merges the patient’s front-facing smile photo with the ClinCheck treatment plan model. Doctors can then compare side-by-side before and after photos, share multiple treatment plans, and adjust the treatment plan and refresh the “in-face” view.The ClinCheck In-Face Visualization tool is currently available to doctors using the Invisalign Go system in the United Kingdom and Ireland. It will be available to doctors using the Invisalign Go system in the United States and Canada on March 9th, 2020.Attendees at the 155th Chicago Midwinter Meeting, February 20 - 22 are invited to visit the Align booth # 4430 to demo the visualization tool.For more information, please visit https://info.aligntech.com/lp/invisalign-go.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align's products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com.For additional information about iTero digital scanning system, please visit www.itero.com."
    },
    {
        "title": "Align Technology Announces Fourth Quarter and Fiscal 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 29, 2020 4:00PM EST",
        "content": "SAN JOSE, Calif., Jan.  29, 2020  (GLOBE NEWSWIRE) -- Align Technology, Inc. (Nasdaq: ALGN) today reported financial results for the fourth quarter (Q4’19) and year ended December 31, 2019 (2019). Q4’19 total revenues were $649.8 million, up 21.7% year-over-year. Q4’19 clear aligner revenues were $543.6 million, up 22.0% year-over-year and Q4’19 scanner and services revenues were $106.2 million, up 20.2% year-over-year. Q4’19 Invisalign volume was 413.7 thousand cases, up 23.9% year-over-year. For the Americas and International regions, Q4’19 Invisalign volume was up 19.3% and 30.1% year-over-year, respectively. Q4’19 Invisalign volume for teenage patients was 116 thousand cases, up 33.1% year-over-year. Q4’19 operating income of $151.2 million was up 25.5% year-over-year resulting in an operating margin of 23.3%. Q4’19 net income was $121.3 million, or $1.53 per diluted share.For 2019, total revenues were a record $2.4 billion, up 22.4% year-over-year.  Record 2019 clear aligner revenues were $2.0 billion, up 19.8% year-over-year and Invisalign case shipments were 1.5 million, up 24.2% year-over-year. Record 2019 iTero scanner and services revenue were $381.0 million, up 38.5% year-over-year with record volume, up 29.7% year-over-year. 2019 Invisalign cases for teenage patients were 446.7 thousand, up 34.1% year-over-year.  2019 net profit was $442.8 million, or $5.53 per diluted share.Commenting on Align’s Q4’19 and 2019 results, Align Technology President and CEO Joe Hogan said, “Our fourth quarter was a strong finish to a great year with record revenues and volumes. Q4’19 Invisalign shipments increased 23.9% year-over-year and marked another major milestone with our 8 millionth Invisalign patient who started treatment in December. Q4’19 iTero scanner and services revenues increased 20.2% year-over-year with strong growth especially from international doctors. For the full year, revenues of $2.4 billion reflect record revenues and volumes for both Invisalign clear aligners and iTero scanners. During the year, over 1.5 million people started treatment with Invisalign clear aligners, including 447 thousand teens and younger patients which increased 34.1%.”GAAP Summary Financial ComparisonsFourth Quarter Fiscal 2019Fiscal 2019Note: Changes and percentages are based on actual values and may affect totals due to rounding1 Invisalign shipments do not include SmileDirectClub (“SDC“) aligners.2 Clear aligner revenues include Invisalign clear aligners and SDC aligners.  The supply agreement with SDC terminated December 31, 2019 and was not renewed.  In 2019, the overwhelming majority of aligners declared by SDC were not manufactured by Align.3 2019 results before tax include a $51.0 million gain from the settlement of the Straumann litigation ($45.7M net of tax or approximately $0.57 EPS benefit), impairments of $23.0 million ($17.2M net of tax or approximately $0.21 EPS impact) related to closing Invisalign Stores as a result of the arbitrator’s decision regarding SDC announced March 5, 2019, and other gains of $15.8M ($10.7M net of tax or approximately $0.13 EPS benefit) from the sale of our investment in SDC.As of December 31, 2019, Align had $868.6 million in cash, cash equivalents and marketable securities compared to $744.5 million as of December 31, 2018. In Q4’19, we repurchased approximately 389K shares of our common stock at an average price of $258.67 per share and have $100.0 million remaining available for repurchase under the May 2018 Repurchase Program.Align 2019 Highlights:CorporateProductQ1 2020 (Q1’20) Business OutlookAs a result of the corporate structure reorganization to relocate our European headquarters from the Netherlands to Switzerland in Q1’20, our Q1’20 GAAP tax rate will reflect a significant one-time tax benefit associated with the recognition of a deferred tax asset related to the intra-entity sale of certain intellectual property rights. This deferred tax benefit will be amortized starting in 2020 and continue into subsequent quarters and years. The period over which this tax benefit will be recognized depends on the profitability of our Swiss headquarters and therefore is uncertain at this time.  Management ordinarily assesses the health of our business without regard to these types of one-time events and believes this reorganization will make it difficult for investors to assess our core underlying financial performance were we to report solely based on GAAP. Therefore, we will supplement our GAAP information with non-GAAP measures going forward. Beginning in Q1’20, in addition to our GAAP results we will present non-GAAP measures that exclude the aforementioned tax impact, along with certain other items that may not be indicative of our fundamental operating performance including discrete cash and non-cash charges in order to present investors with greater transparency into our core business operations.  A reconciliation of GAAP to non-GAAP outlook is provided at the end of this release.The following statements are forward-looking statements based on current expectations and assumptions, and involve risk and uncertainties, some of which are set forth below under “Forward-Looking Statements.”Novel Coronavirus in ChinaAs reported by news agencies worldwide, the recent outbreak of the novel coronavirus in Wuhan, the capital of the Hubei Province in China, is a serious situation.  China is one of our largest country markets and represents roughly 8% of our total revenues. The situation in China is very fluid and we are closely monitoring it. We are in contact with various relevant agencies globally. Thus far, the Chinese government has implemented travel bans and has essentially shutdown public transportation in Wuhan.  It has also issued public warnings to avoid all non-essential medical and dental procedures for the time-being.While we do not believe there are any concerns regarding the safety of our products due to the stringent health and safety procedures of our manufacturing processes, we are taking additional precautions across China to minimize the risk of spreading illness to our internal teams, including additional protections and health screening procedures as well as travel bans/restrictions.Given this increased uncertainty and disruption to our employees, customers/doctors’ practices, their patients and consumers, we believe it is prudent to reduce our outlook for Q1’20. Therefore, for Q1’20, our outlook reflects approximately 20,000 to 25,000 fewer Invisalign case shipments and approximately $30.0 million to $35.0 million less revenues for Invisalign and iTero products sold in China. In addition, we are also absorbing $3.0 million to $4.0 million in idle China plant capacity costs which we expect will result in approximately a 0.5% gross margin impact.Commenting on Align’s first quarter outlook, Hogan continued, “As we kick off 2020, we are very concerned for the safety and health of our employees, customers/doctors and their patients in China.  Their wellbeing is our top priority and we are doing everything we can to ensure that they are in good hands. We are working with our local team to donate medical supplies and provide funding to help combat the outbreak. While we are mindful of the increased uncertainty in China and its impact on our first quarter outlook, it’s important to take a step back and remember that our business is broad and deep. We have strong growth in other regions, and are seeing strong momentum in the Americas, across EMEA and in all other countries in APAC especially Japan, Australia/New Zealand, Southeast Asia, Taiwan and Korea.”For Q1’20, Align provides the following guidance:Align Web Cast and Conference CallAlign will host a conference call today, January 29, 2020 at 4:30 p.m. ET, 1:30 p.m. PT, to review its fourth quarter and fiscal 2019 results, discuss future operating trends and the business outlook. The conference call will also be web cast live via the Internet.  To access the webcast, go to the “Events & Presentations” section under Company Information on Align’s Investor Relations web site at http://investor.aligntech.com.  To access the conference call, please dial 201-689-8261. An archived audio web cast will be available beginning approximately one hour after the call's conclusion and will remain available for approximately one month. Additionally, a telephonic replay of the call can be accessed by dialing 877-660-6853 with conference number 13697560 followed by #. For international callers, please dial 201-612-7415 and use the same conference number referenced above. The telephonic replay will be available through 5:30 p.m. ET on February 12, 2020.About Non-GAAP Financial MeasuresTo supplement our condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (“GAAP”), we intend to provide investors with certain non-GAAP financial measures beginning in Q1’20 including, non-GAAP gross profit, gross margin, operating expenses, income from operations, operating margin, effective tax rate, net income and diluted EPS, which exclude certain items that may not be indicative of our fundamental operating performance including discrete cash and non-cash charges or gains that are included in the most directly comparable GAAP measure. Non-GAAP measures will exclude the effects of stock-based compensation, non-cash deferred tax assets and associated amortization related to intra-entity transfer of non-inventory assets, impairments and other (gains) charges, and litigation settlement gains, and, if applicable, any associated tax impacts.We use non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. Our management believes that these non-GAAP financial measures provide meaningful supplemental information regarding our recurring core operating performance. We believe that both management and investors benefit from referring to these non-GAAP financial measures in assessing our performance and when planning, forecasting and analyzing future periods. These non-GAAP financial measures also facilitate management's internal evaluation of period-to-period comparisons. We believe these non-GAAP financial measures are useful to investors both because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they will be provided to and used by our institutional investors and the analyst community to help them analyze the performance of our business.There are limitations to using non-GAAP financial measures, though, because they are not prepared in accordance with GAAP and may be different from non-GAAP financial measures used by other companies. The non-GAAP financial measures are limited in value because they exclude certain items that may have a material impact upon our reported financial results. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which charges are excluded from the non-GAAP financial measures. We compensate for these limitations by analyzing current and future results on a GAAP as well as a non-GAAP basis and also by providing GAAP measures in our public disclosures. The presentation of non-GAAP financial information is meant to be considered in addition to, not as a substitute for or in isolation from, the directly comparable financial measures prepared in accordance with GAAP. We urge investors to review the reconciliation of our GAAP financial measures to the comparable Non-GAAP financial measures included in this presentation, and not to rely on any single financial measure to evaluate our business. For more information on these non-GAAP financial measures, please see the tables captioned \"Q1’20 Reconciliation of GAAP to Non-GAAP\" and \"Business Outlook Summary\" included at the end of this release.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.Forward-Looking StatementsThis news release, including the tables below, contains forward-looking statements, including quotations from management, statements in the paragraphs under Q1 2020 (Q1’20) Business Outlook and Novel Coronavirus in China regarding certain business metrics on either or both a GAAP or non-GAAP basis for the first quarter of 2020, including, but not limited to, anticipated net revenues, operating margin, tax rates, benefits and amortization, case shipments, and expected declines in Invisalign case shipments, Invisalign and iTero revenues, idle operations and gross margins from the effects of the novel coronavirus in China as well as the strength of our business, its growth and momentum in regions outside China. Forward-looking statements contained in this news release and the tables below relating to expectations about future events or results are based upon information available to Align as of the date hereof. Readers are cautioned that these forward-looking statements are only predictions and are subject to risks, uncertainties and assumptions that are difficult to predict. As a result, actual results may differ materially and adversely from those expressed in any forward-looking statement.Factors that might cause such a difference include, but are not limited to, difficulties predicting customer and consumer purchasing behavior, adverse impacts to our operations in China stemming from measures we may take to ensure the health and safety of our employees, consumers, contractors, suppliers and their families from viral outbreaks in China on top of governmental efforts to minimize the spread of illness, a tougher consumer demand environment in China generally, especially for manufacturers and service providers whose headquarters or primarily operations are not based in China, expectations regarding the continued growth of our international markets, increasing competition from existing and new competitors, rapidly evolving and groundbreaking advances that are fundamentally changing the dental industry and the way new and existing participants market and provide products and services to consumers, the ability to protect our intellectual property rights, continued compliance with regulatory requirements, our expectations regarding sales growth of our intra-oral scanner sales in international markets, our belief that technology features and functionality of the iTero scanners will increase adoption of Invisalign and increase sales of our intra-oral scanners, our expectations regarding the financial and strategic benefits of establishing regional order acquisition, treatment planning and manufacturing facilities, the willingness and ability of our customers to maintain and/or increase product utilization in sufficient numbers, the possibility that the development and release of new products or enhancements to existing products do not proceed in accordance with the anticipated timeline or may themselves contain bugs or errors requiring remediation, the possibility that the market for the sale of these new or enhanced products may not develop as expected, or that the expected benefits of new or existing business relationships will not be achieved as anticipated, our expectations concerning additional costs related to the corporate structure reorganization, including the relocation of our European headquarters from the Netherlands to Switzerland, the risks relating to our ability to sustain or increase profitability or revenue growth in future periods while controlling expenses, the expected impact additional sales representatives will have on our sales, growth related risks, including excess or constrained capacity at our manufacturing and treat operations facilities and pressure on our internal systems and personnel, the compromise of customer and/or patient data for any reason, and system integration and implementation issues, continued customer demand for our existing and new products, changes in consumer spending habits as a result of, among other things, prevailing economic conditions, levels of employment, salaries and wages and consumer confidence, the timing of case submissions from our doctors within a quarter as well as an increased manufacturing costs per case, acceptance of our products by consumers and dental professionals, foreign operational, political and other risks relating to our international manufacturing operations, our ability to develop and successfully introduce new products and product enhancements and the loss of key personnel.The foregoing and other risks are detailed from time to time in our periodic reports filed with the Securities and Exchange Commission, including, but not limited to, our Annual Report on Form 10-K for the year ended December 31, 2018, which was filed with the Securities and Exchange Commission (SEC) on February 28, 2019 and our latest Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, which was filed with the SEC on October 31, 2019. We undertake no obligation to revise or update publicly any forward-looking statements for any reason.  "
    },
    {
        "title": "Align Technology to Announce Fourth Quarter and 2019 Results on January 29, 2020",
        "subtitle": "",
        "date": "Jan 2, 2020 8:30AM EST",
        "content": "SAN JOSE, Calif., Jan.  02, 2020  (GLOBE NEWSWIRE) -- Align Technology, Inc. (Nasdaq: ALGN) announced today that the Company will report fourth quarter and 2019 financial results on Wednesday, January 29, 2020, after the close of market.  Financial results will be released at 4:00 p.m. ET (1:00 p.m. PT) and will be available on the Investor Relations section of the Company’s website at http://investor.aligntech.com.Following the press release, the Company will host a conference call to discuss its financial results.  The conference call will begin at 4:30 p.m. ET (1:30 p.m. PT) and will also be available as an audio webcast live via the Internet.  To access the webcast, please visit http://investor.aligntech.com.  To access the conference call, please dial 201-689-8261 approximately fifteen minutes prior to the start of the call.An archived audio webcast will be available beginning approximately one hour after the call's conclusion and will remain available for one month. Additionally, a telephonic replay of the call can be accessed by dialing 877-660-6853 with conference number 13697560 followed by #. The replay must be accessed from international locations by dialing 201-612-7415 and using the same account and conference numbers referenced above. The telephonic replay will be available through 5:30 p.m. ET on February 12, 2020.For planning purposes, Align Technology is also announcing tentative earnings release dates for fiscal 2020. The official earnings date for each quarter will be announced separately with the corresponding conference call information.Fiscal Quarter Tentative DateFirst quarter 2020 (Q1'20) Wednesday, April 22, 2020Second quarter 2020 (Q2'20) Wednesday, July 22, 2020Third quarter 2020 (Q3'20) Wednesday, October 21, 2020About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com.For additional information about iTero digital scanning system, please visit www.itero.com."
    },
    {
        "title": "International Trade Commission Affirms ALJ Finding That 3Shape Infringes Three Align Patents but Declines to Find Section 337 Violation",
        "subtitle": "",
        "date": "Nov 27, 2019 11:01AM EST",
        "content": "SAN JOSE, Calif., Nov.  27, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) announced today that on November 22, 2019 the United States International Trade Commission (ITC) issued an Opinion reviewing an Administrative Law Judge’s Initial Determination in his investigation of 3Shape’s infringement of Align’s patents. Like the ALJ, the Commission Opinion determined that 3Shape infringes four claims from three Align patents, but declined to find a violation of Section 337 because, based on the ALJ’s adopted claim construction, it found that Align’s own products do not practice the claims (a requirement unique to the ITC) and that certain claims are invalid.“While we are pleased that both the ALJ and now the full Commission have found that 3Shape infringes multiple claims from multiple Align patents, we are disappointed that the Commission decision results in no exclusion order for 3Shape’s infringement. We are considering all appropriate options, including a possible appeal to the Federal Circuit,” said Julie Coletti, senior vice president, chief legal and regulatory officer. “The Commission decision confirms our belief that 3Shape infringes Align’s core patents regarding color intraoral scanning technology. As always, we remain committed to protecting our significant investment in innovation.”The parallel federal district court case filed by Align in Delaware, alleging infringement of the same patents but where the requirement that Align practice the patents does not apply, will remain stayed pending any related appeals. Five other patent infringement cases in Delaware federal district court alleging infringement of different Align patents not included in this ITC investigation are not stayed and are in active litigation, with the first trials scheduled for April and June 2020.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align's products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about the iTero digital scanning system, please visit www.itero.com."
    },
    {
        "title": "Align Technology Appoints Frank Quinn to Vice President and General Manager, United States",
        "subtitle": "",
        "date": "Nov 26, 2019 4:00PM EST",
        "content": "SAN JOSE, Calif., Nov.  26, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) today announced that Frank Quinn, vice president, Marketing, Americas, will move to the role of vice president and general manager of the United States. The new role takes effect on Monday, December 9, 2019.“Frank is a long-standing member of the Align organization who has served in multiple roles and made a positive and lasting impact during each step of his Align career,” said Simon Beard, senior vice president and managing director for the Americas region. “Over the past year, as leader of Americas Marketing, Frank has been instrumental in the evolution of our marketing strategy and programs to drive awareness of doctor delivered clear aligner treatment.”In this new role, Mr. Quinn will be responsible for driving continued growth and profitability within the United States, overseeing the US Sales, Marketing, Dental Service Organizations (DSOs), Commercial Excellence and functional leaders supporting the US commercial organization.Since joining Align in 2013, Mr. Quinn has held several leadership roles throughout the organization. Most recently, he served as the vice president of Marketing, Americas. Earlier, Mr. Quinn served as Align’s vice president of Special Markets, Business Development and Education, Americas and senior sales director of Special Markets, iTero Sales and Business Development.Mr. Quinn is a Board Member of the Americas Association of Orthodontics Foundation (AAOF) and the American Academy of Clear Aligners (AACA). About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align's products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com."
    },
    {
        "title": "Align Technology - Driving Analog to Digital Transformation of Dental Practices - Announces Website Listing Intraoral Scanners for Invisalign® Aligner Case Submission",
        "subtitle": "",
        "date": "Nov 21, 2019 11:30AM EST",
        "content": "SAN JOSE, Calif., Nov.  21, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) today updated its website to include the list of third-party intraoral scanners that are qualified for Invisalign clear aligner case submission, in addition to the iTero family of intraoral scanners.Align’s iTero Element intraoral scanner delivers speed, reliability, intuitive operations and outstanding visualization capabilities, all in a compact footprint. iTero Element scans are engineered to work with the Invisalign system and include the exclusive Invisalign Outcome Simulator and Progress Assessment tool.“For over 22 years, Align Technology has helped drive analog to digital transformation of dental practices,” said Zelko Relic, Chief Technology Officer and senior vice president, Global Research & Development, Align Technology. “Our goal is to enable doctors to treat more patients with advanced clear aligner technology, and use intraoral scanners to scan patients at every visit. We believe the future of dentistry is digital, and we could not be more proud to be partnering with doctors to bring this vision closer to reality.”Align previously qualified third party scanners for Invisalign clear aligner case submission. Below is a comprehensive list of third-party intraoral scanners that can be used for Invisalign case submission:Information regarding third-party scanner interoperability is published and maintained on Align’s website at Third-party scanner interoperability. Align will update this information if and when interoperability relationships change. Doctors who have questions about third-party interoperability for Invisalign clear aligner case submission should contact their sales representative or call 1-888-822-5446.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system, or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.Align, Invisalign and iTero are trademarks of Align Technology, Inc., registered in the U.S. and other countries.Other company and product names mentioned herein are trademarks of their respective companies. Mention of third-party products is for informational purposes only and constitutes neither an endorsement nor a recommendation. Align Technology assumes no responsibility with regard to the performance or use of these products.                                                                                                                                                                                                                                                                         "
    },
    {
        "title": "Align Technology to Award Research Programs Advancing Orthodontic and Dental Patient Care",
        "subtitle": "",
        "date": "Nov 12, 2019 4:00PM EST",
        "content": "SAN JOSE, Calif., Nov.  12, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) today announced the opening of its 2020 Research Award Program to support clinical and scientific dental research in universities across the globe. This year, up to $300,000 will be awarded to university faculty for scientific and technological research initiatives to advance patient care in the fields of orthodontics and dentistry.Through its Research Award Program, Align Technology has funded approximately $2 million in research awards since its inception in 2010, providing insights that include intra-oral scanning and patient experience, quality of life changes, as well as insights into the biochemical markers of bone metabolism during early orthodontic tooth movement with clear aligners.Research awards have been provided to 28 North American and 65 international research institutions. Universities that have received the most research awards from Align Technology to-date include:“Align is committed to partnering with academic research institutions to advance the fields of orthodontics and dentistry with the goal to ultimately improve treatment outcomes,” said Zelko Relic, Chief Technology Officer and senior vice president, Global Research & Development,  Align Technology. “We are proud of the research findings that have been shared in peer reviewed journals, scientific conferences and presentations as a result of Align’s Research Award Program and look forward to reviewing this year’s submissions.”Awards available for dental research at universities are available in the following regions:Eligible applicants for  dental research awards include full- and part-time faculty involved in dental or scientific research at universities at which Invisalign® treatment is available. All applications are reviewed by an independent academic committee that forwards its recommendations to Align Technology for final selection. Program details, instructions, and application forms for prospective applicants can be found at https://learn.invisalign.com/researchawards (for Americas applicants) and https://learn.invisalign.com/internationalresearch (for EMEA and APAC applicants). Research proposals and completed applications must be received by 5:00 p.m. Pacific Standard Time on March 6, 2020. Award recipients will be notified by June 1, 2020.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com."
    },
    {
        "title": "Align Technology Launches Invisalign Moderate to Help Doctors Capture Increasing Consumer Demand for Clear Aligners With Superior Invisalign Treatment",
        "subtitle": "",
        "date": "Oct 31, 2019 4:00PM EDT",
        "content": "SAN JOSE, Calif., Oct.  31, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) today announced a new Invisalign product offering to empower doctors with new tools and technology to better serve the rapidly expanding market for clear aligner treatment, especially with consumers who are looking for more moderate teeth straightening options.  “The market for clear aligners continues to expand beyond the 12 million annual orthodontic case starts, driven by trends in digital technology, 3D printing, beauty, fashion and a new consumer demographic that prioritizes convenience,” said Raj Pudipeddi, Align Technology senior vice president and chief marketing, product and business development officer. “Today, there are over 300 million people worldwide who have malocclusion and are candidates for Invisalign clear aligner treatment. The Invisalign Moderate Package provides Align and its doctor customers with an incremental growth opportunity by addressing consumer needs that often fall 'in between' more limited and more comprehensive treatment options. Consumers get the benefit of proven Invisalign technology with doctor administered treatment at a price that reflects the scope of treatment.”The Invisalign Moderate Package is a 20-stage treatment option with an optional set of additional aligners. It is designed for consumers whose treatment goals fall between the existing Invisalign Lite and Invisalign Comprehensive Packages and can be completed in the range of 5 to 12 months. The Invisalign Moderate Package includes superior functionality of SmartTrack® material, SmartForce attachments, and customizable options such as compliance indicators, precision cuts, bite ramps, and inter-proximal reduction (IPR) that are part of the Invisalign Comprehensive package, but with fewer stages. This combination offers doctors and their patients more flexibility in using Invisalign clear aligner treatment to match patient needs.“The Invisalign Moderate Package gives me the confidence to meet my patients’ demands while allowing for flexibility of tooth movement capabilities needed for moderate treatment cases,” said Dr. Jonathan Nicozisis, an orthodontist based in Princeton, NJ. “In today’s market with cost conscious consumers evaluating DIY or direct to consumer treatment, Align is once again partnering with doctors and offering an Invisalign solution to capture this DIY market demand. The Invisalign Moderate Package will help doctors be properly positioned and address more limited teeth straightening options through our offices, which is where treatment should be rendered.”Continued Pudipeddi, “Align has always been committed to providing our doctor customers with innovative treatment options that meet evolving consumer needs. That means offering more options to address a wider scope of treatment goals and budgets, using proven Invisalign aligners. No other clear aligners have been used with over 7.5 million patients worldwide to treat adults, teenagers, and kids as young as 7 years old, and are backed by 22 years and $2 billion in research and development. Consumer awareness of Invisalign treatment and clear aligners overall is higher than it has ever been and consumer friendly product options will provide doctors with the tools they need to help more of their patients.”Align also announced an upgrade of its MyInvisalign mobile app, which includes several new features to help potential patients who are seeking information about teeth straightening treatment. Consumers considering treatment can visualize how their smile would transform after Invisalign treatment by taking a selfie and using the Invisalign® SmileView™ smile simulation tool. This powerful visualization app was developed using an algorithm based on the 7.5 million plus treated Invisalign cases. The app also includes new educational content on how Invisalign treatment works, why it delivers great patient outcomes as well as average cost for Invisalign treatment. It also includes a personalized doctor locator tool that helps a potential patient find the nearest Invisalign doctor for a consultation. Current Invisalign patients will notice an upgraded look and feel to the app that makes it easy to view and share treatment progress, track appointments, and receive reminders and motivational content to support their journey to a new smile.The Invisalign Moderate Package is now available in the United States and Canada.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system, or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visitwww.itero.com.Align Technology                                                                   Madelyn Homick                                                                   mhomick@aligntech.com                                                    408.470.1180                                                                          Zeno GroupSarah Johnsonsarah.johnson@zenogroup.com828.551.4201 "
    },
    {
        "title": "Align Technology to Speak at Upcoming Financial Conferences",
        "subtitle": "",
        "date": "Oct 30, 2019 4:00PM EDT",
        "content": "SAN JOSE, Calif., Oct.  30, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (Nasdaq: ALGN) today announced that the company is scheduled to speak at upcoming financial conferences. The presentations, as noted below, will be webcast live via the Investor Relations section of Align Technology's website at http://investor.aligntech.com. An archived replay will remain on the website for approximately three months.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.Investor Relations Contact                                              Madelyn Homick                                                              Align Technology, Inc.                                                     (408) 470-1180                                                                mhomick@aligntech.com                                                Press Contact                      Shannon Mangum HendersonEthos Communication, Inc.(678) 261-7803align@ethoscommunication.com "
    },
    {
        "title": "Align Technology Announces Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 23, 2019 4:00PM EDT",
        "content": "SAN JOSE, Calif., Oct.  23, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (Nasdaq: ALGN) today reported financial results for the third quarter ended September 30, 2019. Q3’19 Invisalign volume was 385.4 thousand cases, up 20.7% year-over-year. For the Americas and International regions, Q3’19 Invisalign volume was up 13.0% and 32.1% year-over-year, respectively. Q3’19 Invisalign volume for teenage patients was 129.6 thousand cases, up 31.5% year-over-year. Q3’19 total revenues were $607.3 million, up 20.2% year-over-year, and Q3’19 scanner and services revenues were $91.1 million, up 16.5% year-over-year.Q3’19 operating income was $127.2 million or operating margin of 20.9%. Q3’19 net profit was $102.5 million, or $1.28 per diluted EPS. Q3’19 operating expenses included a $6.8 million benefit from the settlement of our Invisalign Store leases, which increased Q3’19 operating margin by approximately 1.1 points and benefited diluted EPS by $0.06. This compares to Q2’19 operating income of $176.5 million or operating margin of 29.4% and Q2’19 net profit of $147.1 million, or $1.83 per diluted EPS. Q2’19 operating expenses included a $51.0 million benefit from the ClearCorrect settlement with Straumann, which increased Q2’19 operating margin by approximately 8 points and benefited diluted EPS by $0.57.Commenting on Align’s third quarter results, Align Technology President and CEO Joe Hogan said, “I’m pleased to report revenues, volume, and earnings above our third quarter outlook driven by better than expected volume across the Invisalign portfolio in Asia Pacific and Latin America, reflecting record highs for both regions and improving trends in the North American orthodontic channel. Notwithstanding EMEA summer seasonality, we saw continued adoption from teens and especially younger patients using Invisalign First across the board. Q3 Invisalign volumes were up 20.7% year-over-year driven by growth across the product portfolio, as well as expansion of our customer base, which increased by 6,000 new Invisalign doctors for a total of 63,000 active doctors worldwide. The iTero scanner and services business was up 16.5% year over year reflecting continue growth across each region, and down sequentially as expected coming off a record second quarter.”As of September 30, 2019, Align had $782.4 million in cash, cash equivalents and marketable securities compared to $765.9 million as of June 30, 2019. In July 2019, we entered into an accelerated stock repurchase agreement (“ASR”) to repurchase $200.0 million of our common stock which was completed in September 2019. We received a total of approximately 1.1 million shares for an average price of $176.61 per share. We have $200.5 million remaining available for repurchase under the May 2018 Repurchase Program.     Align Announcement HighlightsThe following highlights recap Align’s recent announcements: CorporateProductQ4 2019 Business Outlook For the fourth quarter of 2019 (Q4’19), Align provides the following guidance:Align Web Cast and Conference CallAlign will host a conference call today, October 23, 2019 at 4:30 p.m. ET, 1:30 p.m. PT, to review its third quarter 2019 results, discuss future operating trends and the business outlook. The conference call will also be web cast live via the Internet. To access the webcast, go to the “Events & Presentations” section under Company Information on Align’s Investor Relations web site at http://investor.aligntech.com. To access the conference call, please dial 201-689-8261. An archived audio web cast will be available beginning approximately one hour after the call's conclusion and will remain available for approximately 12 months. Additionally, a telephonic replay of the call can be accessed by dialing 877-660-6853 with conference number 13694915 followed by #. For international callers, please dial 201-612-7415 and use the same conference number referenced above. The telephonic replay will be available through 5:30 p.m. ET on November 6, 2019.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.Forward-Looking StatementThis news release, including the tables below, contains forward-looking statements, including statements regarding certain business metrics for the fourth quarter of 2019, including, but not limited to, anticipated net revenues, gross margin, operating expenses, operating profit, capital expenditures, depreciation and amortization, diluted earnings per share, tax rate, case shipments, and our expectations regarding stock repurchases during the quarter. Forward-looking statements contained in this news release and the tables below relating to expectations about future events or results are based upon information available to Align as of the date hereof. Readers are cautioned that these forward-looking statements are only predictions and are subject to risks, uncertainties and assumptions that are difficult to predict. As a result, actual results may differ materially and adversely from those expressed in any forward-looking statement. Factors that might cause such a difference include, but are not limited to, difficulties predicting customer and consumer purchasing behavior, including Align’s predictions related to a tougher consumer demand environment in China, especially for U.S. based products and services, Align’s expectations regarding the continued growth of our international markets, Align's ability to protect its intellectual property rights, continued compliance with regulatory requirements, competition from existing and new competitors, Align’s expectations regarding the sales growth of its intra-oral scanner sales in international markets, its belief that technology features and functionality of the iTero scanners will increase adoption of Invisalign and increase sales of Align’s intra-oral scanners, Align’s expectations regarding the financial and strategic benefits of establishing regional order acquisition, treatment planning and manufacturing facilities, the willingness and ability of our customers to maintain and/or increase product utilization in sufficient numbers, the possibility that the development and release of new products does not proceed in accordance with the anticipated timeline, the possibility that the market for the sale of these new products may not develop as expected, or that the expected benefits of new or existing business relationships will not be achieved as anticipated, Align’s expectation to incur additional costs related to the planned corporate structure reorganization, the risks relating to Align's ability to sustain or increase profitability or revenue growth in future periods while controlling expenses, the expected impact additional sales representatives will have on our sales, growth related risks, including excess or constrained capacity at our manufacturing and treat operations facilities and pressure on our internal systems and personnel, the security of customer and/or patient data is compromised for any reason, system integration and implementation issues, continued customer demand for our existing and new products, changes in consumer spending habits as a result of, among other things, prevailing economic conditions, levels of employment, salaries and wages and consumer confidence, the timing of case submissions from our doctors within a quarter as well as an increased manufacturing costs per case, acceptance of our products by consumers and dental professionals, foreign operational, political and other risks relating to Align's international manufacturing operations, Align's ability to develop and successfully introduce new products and product enhancements and the loss of key personnel. These and other risks are detailed from time to time in Align's periodic reports filed with the Securities and Exchange Commission, including, but not limited to, its Annual Report on Form 10-K for the year ended December 31, 2018, which was filed with the Securities and Exchange Commission (SEC) on February 28, 2019 and its latest Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, which was filed with the SEC on August 1, 2019. Align undertakes no obligation to revise or update publicly any forward-looking statements for any reason.ALIGN TECHNOLOGY, INC.BUSINESS OUTLOOK SUMMARY(unaudited)The outlook figures provided below and elsewhere in this press release are approximate in nature since Align’s business outlook is difficult to predict. Align’s future performance involves numerous risks and uncertainties and the company’s results could differ materially from the outlook provided. Some of the factors that could affect Align’s future financial performance and business outlook are set forth under “Forward Looking Information” above in this press release.  "
    },
    {
        "title": "Align Technology’s Invisalign Brand Selected as Official Smile Partner of the Toronto Raptors",
        "subtitle": "",
        "date": "Oct 23, 2019 11:29AM EDT",
        "content": "SAN JOSE, Calif. and TORONTO, Oct.  23, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN), makers of the Invisalign clear aligner system, today announced a multi-year agreement that makes the Invisalign brand the “official smile” of the 2019 NBA champions, the Toronto Raptors.“The Toronto Raptors and Align share a passion for creating winning smiles,” noted Sian Roberts, Vice President & General Manager, Canada, Align Technology.  “We look forward to working with this championship team, their fans and the community overall to give them another reason to smile.”The sponsorship will launch with branding at Scotiabank Arena, including social media campaigns and other brand activations throughout the season at home games and beyond, to bring more information about the benefits of straighter smiles.“This agreement is a great example of winning teams coming together,” commented Frank Quinn, Vice President, Marketing, Americas.  “Align brings more than 22 years of innovation to support doctors in creating more than 7.2 million smiles with our Invisalign clear aligner system.”“Our passionate fans come from all different backgrounds and can be found all over the world,” said Jordan Vader, Vice President of Global Partnerships, MLSE. “With the help of Align, Toronto Raptors can bring a winning smile to a fan no matter where they are cheering the team on during the 2019-2020 season.”About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.This release may contain forward-looking statements within the meaning of applicable securities laws. In the United States, these statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements involve a number of known and unknown risks and uncertainties, many of which are outside our control that could cause our future results, performance or achievements to differ significantly from the results, performance or achievements expressed or implied by such forward-looking statements. Important factors that could cause or contribute to such differences include risks detailed in our public filings with the SEC. Except as required by applicable law, Align undertakes no obligation to update any forward-looking or other statements herein, whether as a result of new information, future events or otherwise.Source: Align Technology, Inc."
    },
    {
        "title": "Align Technology’s Invisalign Brand Becomes the Official Smile of the New England Patriots and New England Revolution",
        "subtitle": "",
        "date": "Oct 21, 2019 4:00PM EDT",
        "content": "SAN JOSE, Calif., Oct.  21, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN), makers of the Invisalign clear aligner system, today announced an agreement with the New England Patriots, making the Invisalign brand the official smile of the New England Patriots football team and a sponsor of the New England Revolution professional soccer club. The collaboration will help build awareness for “winning smiles” and the benefits of Invisalign treatment among the millions of New England Patriots and New England Revolution fans through in-stadium branding and digital marketing, social media activation, and sponsorship of the New England Patriots televised post-game show. Align will also become a sponsor of the Revolution Academy, one of the country’s most innovative skills development programs in youth soccer, with more than 44,000 participants.“We’re excited and proud to be working with the six-time Super Bowl champion New England Patriots and the New England Revolution, an MLS charter club,” said Frank Quinn, vice president, Americas Marketing and Sales, Align Technology. “Our brands have great synergy in terms of our shared commitment to excellence and a great history of creating winning smiles – for fans of both teams and for the more than 7 million Invisalign patients worldwide.”“The New England Patriots and Revolution believe in the power of a winning smile and look forward to working with Align Technology and the Invisalign brand to share that message with our fans,” said Murray Kohl, New England Patriots vice president of corporate sponsorship sales.As part of the agreement, football fans and soccer fans in New England will see new co-branded signage and promotional campaigns focused on “Winning smiles start here.” Outside of the stadium, Align and the New England Patriots and New England Revolution will collaborate on social media awareness and activation for followers of both brands, including content from athletes sharing their “winning smiles.”About the New England PatriotsThe New England Patriots are a six-time Super Bowl champion franchise in the National Football League (NFL). Founded in 1960 as the eighth and final American Football League franchise in the league’s inaugural season, the Patriots merged with the NFL in 1970 and moved to Foxborough, Mass. in 1971. In 1994, Robert Kraft purchased the team and transformed it into one of the league’s premier franchises. Since Kraft’s arrival, every Patriots home game has sold out, propelling the Patriots to more overall wins, division titles, conference crowns and Super Bowl championships than any other team in the past 25 years. Since 2002, when the Patriots moved into the privately-financed Gillette Stadium, the team has celebrated one of the most dominant eras in professional sports by establishing one of the greatest home-field records of all-time. For more information, visit www.patriots.com or follow @Patriots on Twitter.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.This release may contain forward-looking statements within the meaning of applicable securities laws. In the United States, these statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements involve a number of known and unknown risks and uncertainties, many of which are outside our control that could cause our future results, performance or achievements to differ significantly from the results, performance or achievements expressed or implied by such forward-looking statements. Important factors that could cause or contribute to such differences include risks detailed in our public filings with the SEC. Except as required by applicable law, Align undertakes no obligation to update any forward-looking or other statements herein, whether as a result of new information, future events or otherwise.Source: Align Technology, Inc.Photos accompanying this announcement are available at https://www.globenewswire.com/NewsRoom/AttachmentNg/dd2e060e-47f3-4738-ac21-2ba449c6a9eehttps://www.globenewswire.com/NewsRoom/AttachmentNg/9deae70a-ee9d-45f7-8482-78a7e0409c9e"
    },
    {
        "title": "Align Technology’s Invisalign Brand Announced as Official Smile of the Carolina Hurricanes",
        "subtitle": "",
        "date": "Oct 21, 2019 4:00PM EDT",
        "content": "SAN JOSE, Calif., Oct.  21, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN), makers of the Invisalign clear aligner system, announced today a new agreement with the NHL’s Carolina Hurricanes, bringing together two powerful brands based in the Raleigh, North Carolina area. Through this new multi-year agreement, the Invisalign brand will work with the 2006 Stanley Cup winning Carolina Hurricanes to build awareness of “winning smiles” through in-stadium and digital co-branding, and sponsorship of the youth hockey program.“The Hurricanes and Align are all about creating winning smiles – on the ice and off,” said Frank Quinn, vice president, marketing, Americas. “This partnership gives both organizations an opportunity to build awareness for the power of a great smile and to help bring those benefits to the amazing fan base of all ages that the Hurricanes have built in the Raleigh community and beyond.”  As part of the agreement, Carolina Hurricanes fans will have multiple opportunities to interact with the Invisalign brand, including in-stadium branding and fan engagement at PNC Arena,  social media activation, and live event opportunities to bring together Hurricanes fans and Align team members in Raleigh.  The Invisalign brand will also become the title sponsor for the Carolina Hurricanes Youth Hockey Game and Summer Youth Hockey Camp, reflecting both organizations’ commitment to supporting teen programs.“Align Technology’s Invisalign brand has become one of our most important partners, helping our team take major strides over the past few years,” said Don Waddell, President and General Manager of the National Hockey League's Carolina Hurricanes. “We are proud to continue to work with this great company that has a strong presence in the Triangle.”About the Carolina HurricanesThe Carolina Hurricanes were established in Raleigh in 1997 after relocating from Connecticut, where the National Hockey League franchise was originally founded in 1979. Since their arrival in North Carolina, the Hurricanes have captured three division championships, two Eastern conference titles and the 2006 Stanley Cup championship. The team also hosted the 2004 NHL Draft and the 2011 NHL All-Star Weekend at PNC Arena, where it plays its home games. Individual-game tickets for all 41 of the Hurricanes’ regular-season home games are sold at the PNC Arena Box Office and via Ticketmaster. For information on Hurricanes ticket packages, please call 1-866-NHL-CANES, or visit Hurricanes.com/tickets.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visitwww.itero.com.This release may contain forward-looking statements within the meaning of applicable securities laws. In the United States, these statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements involve a number of known and unknown risks and uncertainties, many of which are outside our control that could cause our future results, performance or achievements to differ significantly from the results, performance or achievements expressed or implied by such forward-looking statements. Important factors that could cause or contribute to such differences include risks detailed in our public filings with the SEC. Except as required by applicable law, Align undertakes no obligation to update any forward-looking or other statements herein, whether as a result of new information, future events or otherwise.Source: Align Technology, Inc.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/90fce251-0c7f-4c2d-aea9-3251789db1fd"
    },
    {
        "title": "Material Solution Jointly Developed by Align Technology and Covestro To Be Showcased at K 2019 Plastics Trade Fair",
        "subtitle": "",
        "date": "Oct 16, 2019 8:00AM EDT",
        "content": "LEVERKUSEN, Germany and SAN JOSE, Calif., Oct.  16, 2019  (GLOBE NEWSWIRE) -- Covestro AG (EXCHANGE) and Align Technology, Inc. (NASDAQ: ALGN) announced today that the Invisalign clear aligner system for straightening teeth, made with patented SmartTrack material, will be showcased at the K 2019 Plastics Trade Fair in Düsseldorf, Germany, scheduled for October 16 – 23, 2019.The Invisalign system from Align Technology is a clear aligner system for straightening teeth, and the most advanced clear aligner treatment available. It is available through Invisalign trained dentists and orthodontists.Align Technology pioneered the clear aligner orthodontic segment 22 years ago with the launch of the Invisalign system. Through continuous innovation, the Invisalign system is a leading solution in the field of clear aligner orthodontics.At the Covestro booth (Stand A75 in Hall 6), visitors will have the opportunity to learn more about Align Technology’s cutting-edge innovations, as well as view interactive videos, see and touch sample aligners.On October 18, 2019 at 12:00-12:30 pm at the Covestro booth, Markus Sebastian, Senior Vice President & Managing Director at Align Technology EMEA, will deliver a keynote address, followed by a Q&A session about the Invisalign system.  The Invisalign System with SmartTrack materialThe patented SmartTrack material, used to produce Invisalign clear aligners is a multilayer, highly elastic, transparent material, jointly developed with Covestro, designed specifically for the Invisalign system to achieve more predictable orthodontic treatments*.The multi-layer, transparent material, engineered over a span of eight years with more than 260 material variations developed and evaluated, exerts gentle, constant force that enables doctors to better control tooth movements.Orthodontic treatment with clear aligners is preceded by a patient assessment by the treating doctor who takes a digital scan or manual impression of a patient’s teeth. A digital treatment plan is then created and – once approved by the doctor – the individual aligners are produced and shipped. The treatment plan is digitally staged, and custom-made digital aligners are manufactured so that the patient's malpositioned teeth are corrected in small steps to a better smile. The patient is required to change the aligners at regular intervals as directed by the doctor, and take them out for eating and drinking. Comfort and functionality\"The Invisalign system with SmartTrack material, SmartForce® features and SmartStage® technology enables tooth misalignments to be corrected with greater than 75 percent  improvement* in overall tooth movement predictability,\" said Zelko Relic, Chief Technology Officer and Senior Vice President, Global R&D at Align Technology. “This clear, highly elastic material makes Invisalign aligners easily inserted and removed by patients of all ages, from growing patients who have a mixture of primary and permanent teeth, to teens and adults.”\"The Invisalign system with patented SmartTrack material is a combination of an individual, digitally planned treatment and individually customized aligners by thermoforming films, which are manufactured by Covestro,\" said Dr. Thorsten Dreier, Global Head of Specialty Films at Covestro, the SmartTrack supplier to the Invisalign system. \"Thanks to our joint materials research with Align Technology, we're providing foundation for a new, bright smile for millions of new patients across Europe and worldwide.\"Align Technology Senior Vice President and Managing Director, EMEA, Markus Sebastian, adds: “I would like to thank Covestro for inviting us to be part of this exciting showcase here at the K 2019 Trade Show in Düsseldorf. I am looking forward to sharing our cutting-edge technology that has enabled Invisalign trained doctors to create beautiful smiles for over 7 million people worldwide, including over 1 million patients in the EMEA region.”*/**Data on file, Align Technology.About Covestro:With 2018 sales of EUR 14.6 billion, Covestro is among the world’s largest polymer companies. Business activities are focused on the manufacture of high-tech polymer materials and the development of innovative solutions for products used in many areas of daily life. The main segments served are the automotive, construction, wood processing and furniture, and electrical and electronics industries. Other sectors include sports and leisure, cosmetics, health and the chemical industry itself. Covestro has 30 production sites worldwide and employs approximately 16,800 people (calculated as full-time equivalents) at the end of 2018.About Align Technology: Align Technology designs and manufactures the Invisalign system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.About SmartTrack Material SmartTrack aligner material has been specifically designed to provide better tooth movement control and aligner-patient fit for improved clinical outcomes.About SmartForce FeaturesSmartForce attachments are small tooth-colored shapes that are attached to patients' teeth before or during their Invisalign treatment.They can be automatically incorporated to treatment plan to increase the control and predictability of tooth movements.About SmartStage Technology The SmartStage technology applied in the development of Invisalign treatments leads to a more precise control of individual and multiple tooth movements.INVISALIGN, SMARTTRACK, SMARTFORCE, SMARTSTAGE and ALIGN, among others, are trademarks and/or service marks of Align Technology, Inc. or one of its subsidiaries or affiliated companies and may be registered in the U.S. and/or other countries.Forward-looking statementsThis news release may contain forward-looking statements based on current assumptions and forecasts made by Covestro AG. Various known and unknown risks, uncertainties and other factors could lead to material differences between the actual future results, financial situation, development or performance of the company and the estimates given here. These factors include those discussed in Covestro’s public reports. These reports are available at www.covestro.com. The company assumes no liability whatsoever to update these forward-looking statements or to make them conform to future events or developments.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/0795b0a7-4428-4689-bfc6-3d6fa8b0197a"
    },
    {
        "title": "Align Technology’s Invisalign Brand Selected as Official Smile Partner of the San Francisco 49ers",
        "subtitle": "",
        "date": "Oct 7, 2019 3:00PM EDT",
        "content": "SAN JOSE, Calif., Oct.  07, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN), makers of the Invisalign clear aligner system, today announced a multi-year agreement with the San Francisco 49ers, making the Invisalign brand the official smile partner of the 49ers. The collaboration focuses on building awareness of “winning smiles” through in-stadium and digital co-branding, and supporting 49ers-led programs for youth education and sports.As part of the agreement, attendees at 49ers home games in Levi’s Stadium in Santa Clara, California, will see new co-branded signage and promotional campaigns focused on “Winning smiles start here.” Outside of the stadium, the two companies will collaborate on social media awareness and activation for followers of both brands. Align will also add Invisalign brand support to the 49ers Cal-Hi Sports Report, the nation’s most watched high school sports television program, to highlight and support high school athletes across the San Francisco Bay Area and share their stories.“As a medical device company founded and headquartered in the Bay Area, just minutes away from Levi’s Stadium, we’re excited to partner with a fellow hometown brand, the five-time Super Bowl champion 49ers,” said Frank Quinn, vice president, Americas Marketing and Sales, Align Technology. “Both the 49ers and the Invisalign brand are all about creating winning smiles, so we’re looking forward to finding ways to do that together. We also appreciate the 49ers’ commitment to community involvement and we look forward to working to support these programs together.”“We are proud to collaborate with Align Technology and the Invisalign brand as the official smile partner of the 49ers and appreciate their support of our work in the community and on behalf of Bay Area high school athletes through our Cal-Hi Sports Report,” said Brent Schoeb, 49ers Chief Revenue Officer. “Their Bright Smile Award will honor individuals doing good work to help support their local teams, recognition that we are always working to spotlight throughout Bay Area communities.About the San Francisco 49ersThe San Francisco 49ers, owned by Denise and John York, currently play in the NFC West division and have won five Super Bowl trophies including Super Bowl XVI, XIX, XXIII, XXIV and XXIX. The franchise also has six conference championships and 19 divisional championships and was the first major league professional sports team to be based in San Francisco more than 70 years ago. Please visit www.49ers.com and follow the 49ers on Facebook and Twitter @49ers.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visitwww.itero.com.This release may contain forward-looking statements within the meaning of applicable securities laws. In the United States, these statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements involve a number of known and unknown risks and uncertainties, many of which are outside our control that could cause our future results, performance or achievements to differ significantly from the results, performance or achievements expressed or implied by such forward-looking statements. Important factors that could cause or contribute to such differences include risks detailed in our public filings with the SEC. Except as required by applicable law, Align undertakes no obligation to update any forward-looking or other statements herein, whether as a result of new information, future events or otherwise.Source: Align Technology, Inc.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/335d401a-1117-4740-9e14-72b2b9751ce5 "
    },
    {
        "title": "Align Technology to Announce Third Quarter 2019 Results on October 23, 2019",
        "subtitle": "",
        "date": "Oct 1, 2019 8:30AM EDT",
        "content": "SAN JOSE, Calif., Oct.  01, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (Nasdaq: ALGN) announced today that the Company will report third quarter 2019 financial results on Wednesday, October 23, 2019, after the close of market.  Financial results will be released at 4:00 p.m. ET (1:00 p.m. PT) and will be available on the Investor Relations section of the Company’s website at http://investor.aligntech.com.Following the press release, the Company will host a conference call to discuss its financial results.  The conference call will begin at 4:30 p.m. ET (1:30 p.m. PT) and will also be available as an audio webcast live via the Internet.  To access the webcast, please visit http://investor.aligntech.com.  To access the conference call, please dial 201-689-8261 approximately fifteen minutes prior to the start of the call.An archived audio webcast will be available beginning approximately one hour after the call's conclusion and will remain available for approximately 12 months. Additionally, a telephonic replay of the call can be accessed by dialing 877-660-6853 with conference number 13694915 followed by #. The replay must be accessed from international locations by dialing 201-612-7415 and using the same account and conference numbers referenced above. The telephonic replay will be available through 5:30 p.m. ET on November 6, 2019.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com.For additional information about iTero digital scanning system, please visit www.itero.com.Align TechnologyShirley Stacy(408) 470-1150sstacy@aligntech.comEthos CommunicationShannon Mangum Henderson(678) 261-7803align@ethoscommunication.com "
    },
    {
        "title": "Align Technology Further Advances Digital Dentistry in China With the Launch of the iTero Element 2 Scanner",
        "subtitle": "",
        "date": "Sep 25, 2019 12:15AM EDT",
        "content": "NANJING, China, Sept.  25, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) today announced commercial availability of the iTero Element 2 scanner in China at the 2019 International Orthodontic Conference and the 18th Annual Meeting of the Chinese Orthodontic Society in Nanjing, China. The launch exemplifies Align’s continued innovation and investment to advance digital dentistry in China.Align received China’s National Medical Products Administration’s approval to sell the iTero Element 2 scanner in China and manufacture it at the company’s state-of-the-art product manufacturing facility in Ziyang, Sichuan. This will allow Align to provide localized technology and manufacturing capabilities to better serve the Chinese market as well as expand into new market opportunities. The iTero Element 2 scanner is the digital gateway for a broad range of dental, restorative and orthodontic procedures and this launch extends our technology leadership and will help increase utilization of Invisalign clear aligners in China.“Align is committed to bringing global innovations to China and localizing them for patients’ needs. As we lead in digital dentistry, we want to deliver the best treatment outcome for patients and continue to support dentists’ efforts to grow their practices,” said Julie Tay, Align senior vice president and managing director, Asia Pacific. “We're dedicated to delivering innovations more rapidly in China, and expanding the iTero portfolio with iTero Element 2 scanner shortly after we introduced iTero Element scanner in 2018 is an example of our commitment. It is also a significant milestone for us to be able to manufacture the new iTero Element 2 scanner in China as we continue to localize our technology and manufacturing capabilities to better serve Chinese doctors and patients.” The iTero Element 2 scanner launch and China manufacturing approval follows multiple key initiatives announced in China in the last two years. This includes the opening of the first treatment planning facility and Invisalign clinical training institute in Chengdu; the development of an Asian clear aligner treatment protocol application designed specifically for Asian patients worldwide; a comprehensive Asia-centric marketing campaign that addresses the preferences of local market consumers; and, most recently, “Align University Training Institute”, the second training facility in Shanghai.The iTero Element 2 scanner is designed for greater performance with 2X faster start-up and 25% faster scan processing time compared to the iTero Element scanner. It provides doctors with the imaging precision, intuitive chairside visualization and patient communication tools that enable efficient workflows for a full range of case assessment and restorative and orthodontic treatment. An integrated lithium-ion battery provides easy mobility from operatory to operatory without the need to plug in for power or reboot.1“As we’re growing our practice in digital dentistry, we need more powerful technology to improve the overall digital workflow for us,” said Professor Yanheng Zhou, Department of Orthodontics of Peking University School of Stomatology, founder and chief orthodontic specialist, Sunny Dental. “With the new manufacturing site built in Sichuan, Chinese doctors could benefit from the latest technology and bring better treatment to our patients.”iTero Element 2 scanner is now commercially available in China. For more information, please visit www.itero.com.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.Align Technology          Jasmine Chng            +65 6690 3957             jchng@aligntech.comZeno GroupSarah Johnson+1 828 551 4201sarah.johnson@zenogroup.com1 With a fully charged battery, the user can scan for 30 minutes without having to plug in for power. A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/40c2ba9d-9c9f-4d66-8460-d9fbbbe6c8a7"
    },
    {
        "title": "Align Technology Announces Global Distribution Agreement With Zimmer Biomet Dental For Itero Element® Intraoral Scanners",
        "subtitle": "",
        "date": "Sep 19, 2019 4:15PM EDT",
        "content": " Partners with Global Implant and Restorative Dentistry Leader to Increase Penetration of iTero Scanners SAN JOSE, Calif., Sept.  19, 2019  (GLOBE NEWSWIRE) -- Align Technology, Inc. (NASDAQ: ALGN) today announced a global distribution agreement for the award-winning iTero Element family of intraoral scanners with Zimmer Biomet Dental, a division of Zimmer Biomet (NYSE and SIX: ZBH) and a global dental industry leader and provider of implant and restorative solutions and continuing education for dental professionals.This agreement enables the company to leverage Zimmer Biomet Dental’s extensive direct global salesforce and network of dental clinicians and laboratories to help drive further penetration of iTero® scanners and services in the growing digital restorative market. The collaboration also offers Zimmer Biomet Dental customers access to Invisalign® clear aligners through the iTero platform to facilitate a comprehensive interdisciplinary treatment approach.“We are excited to be partnering with Zimmer Biomet Dental to demonstrate our companies’ commitment to supporting dental professionals on their journey to digital dentistry,” said Yuval Shaked, senior vice president and managing director, iTero scanner and services. “A key differentiator in the evolution to a digital practice and dental ecosystem is clinical education. Through this collaboration, the iTero scanner becomes the exclusive intraoral scanner used in the US and European Zimmer Biomet Institutes, which train thousands of doctors annually in an interactive learning environment with the ultimate goal of improved clinical outcomes.”Together, the iTero Element scanner and Zimmer Biomet Dental solutions will deliver multiple digital workflows for dental professionals and laboratories so they can collaborate more efficiently and offer patients a faster and more effective treatment experience.“Zimmer Biomet’s aim is to offer best-in-class solutions and technology tailored to dental professionals’ needs, and this partnership with Align Technology to complement our end-to-end fully digital solution portfolio is another step in that direction,” said Pedro Malha, President, Zimmer Biomet Dental.iTero Element scanners and services are now available through Zimmer Biomet Dental in select countries in Europe, with distribution expanding to the US, Canada and Japan starting in October 2019.Align Technology and Zimmer Biomet will participate together at the Japan Society of Oral Implantology meeting in Fukuoka, Japan September 21 – 22 and the EAO (European Association of Osseointegration) in Lisbon, Portugal September 26 – 28, where the iTero intraoral scanners will be showcased.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align’s products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system, or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.About Zimmer BiometFounded in 1927 and headquartered in Warsaw, Indiana, Zimmer Biomet is a global leader in musculoskeletal healthcare. We design, manufacture and market orthopedic reconstructive products; sports medicine, biologics, extremities and trauma products; office-based technologies; spine, craniomaxillofacial and thoracic products; dental implants; and related surgical products.We collaborate with healthcare professionals around the globe to advance the pace of innovation. Our products and solutions help treat patients suffering from disorders of, or injuries to, bones, joints or supporting soft tissues. Together with healthcare professionals, we help millions of people live better lives.We have operations in more than 25 countries around the world and sell products in more than 100 countries. For more information, visit www.zimmerbiomet.com, or follow Zimmer Biomet on Twitter at www.twitter.com/zimmerbiomet."
    },
    {
        "title": "Zimmer Biomet Announces Multinational Distribution Agreement with Align Technology for iTero Element® Intraoral Scanners",
        "subtitle": "Expands Zimmer Biomet's Global Digital Restorative Dentistry Solutions",
        "date": "Sep 19, 2019 4:15PM EDT",
        "content": "WARSAW, Ind., Sept. 19, 2019 /PRNewswire/ -- Zimmer Biomet Holdings, Inc. (NYSE and SIX: ZBH), a global leader in musculoskeletal healthcare, today announced a multinational distribution agreement with Align Technology, Inc. (NASDAQ: ALGN), for the award-winning iTero Element family of intraoral scanners. Terms of the agreement have not been disclosed. The agreement expands Zimmer Biomet's global footprint in the rapidly growing market for digital restorative dentistry solutions.  \"Zimmer Biomet is committed to offering best-in-class solutions and technology tailored to dental professionals' needs, and this partnership with Align Technology to complement our portfolio of fully digital solutions is another important step in that direction,\" said Pedro Malha, President, Zimmer Biomet Dental. Together, the iTero Element scanner and Zimmer Biomet's dental solutions will deliver multiple digital workflows for dental professionals and laboratories, enabling efficient business-to-business collaboration and offering patients an optimal treatment experience.\"We are excited to be partnering with Zimmer Biomet to demonstrate our companies' commitment to supporting dental professionals on their journey to digital dentistry,\" said Yuval Shaked, Senior Vice President and Managing Director, iTero Scanner and Services. \"A key differentiator in the evolution to a digital practice and dental ecosystem is clinical education. Through this partnership, the iTero scanner becomes the preferred intraoral scanner used in the U.S. and European Zimmer Biomet Institutes, which train thousands of dental professionals annually in an interactive learning environment with the ultimate goal of improved clinical outcomes.\"   iTero Element scanners and services are now available through Zimmer Biomet Dental in Europe, with distribution expanding to the U.S., Canada and Japan starting in October 2019.About Zimmer BiometFounded in 1927 and headquartered in Warsaw, Indiana, Zimmer Biomet is a global leader in musculoskeletal healthcare. We design, manufacture and market orthopedic reconstructive products; sports medicine, biologics, extremities and trauma products; office-based technologies; spine, craniomaxillofacial and thoracic products; dental implants; and related surgical products.We collaborate with healthcare professionals around the globe to advance the pace of innovation. Our products and solutions help treat patients suffering from disorders of, or injuries to, bones, joints or supporting soft tissues. Together with healthcare professionals, we help millions of people live better lives.We have operations in more than 25 countries around the world and sell products in more than 100 countries. For more information, visit www.zimmerbiomet.com, or follow Zimmer Biomet on Twitter at www.twitter.com/zimmerbiomet.About Align Technology, Inc.Align Technology designs and manufactures the Invisalign® system, the most advanced clear aligner system in the world, and iTero® intraoral scanners and services. Align's products help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients. Visit www.aligntech.com for more information.For additional information about the Invisalign system, or to find an Invisalign doctor in your area, please visit www.invisalign.com. For additional information about iTero digital scanning system, please visit www.itero.com.Cautionary Statement Regarding Forward-Looking StatementsThis release contains forward-looking statements within the meaning of federal securities laws, including, among others, statements concerning Zimmer Biomet's expectations, plans, prospects, and product and service offerings. Such statements are based upon the current beliefs, expectations and assumptions of management and are subject to significant risks, uncertainties and changes in circumstances that could cause actual outcomes and results to differ materially from the forward-looking statements. For a list and description of some of such risks and uncertainties, see Zimmer Biomet's periodic reports filed with the U.S. Securities and Exchange Commission (SEC), including its Annual Report on Form 10-K for the year ended December 31, 2018. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in Zimmer Biomet's filings with the SEC. Forward-looking statements speak only as of the date they are made, and Zimmer Biomet expressly disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers of this release are cautioned not to rely on these forward-looking statements, since there can be no assurance that these forward-looking statements will prove to be accurate. This cautionary statement is applicable to all forward-looking statements contained in this release.ZBH-Corp View original content to download multimedia:http://www.prnewswire.com/news-releases/zimmer-biomet-announces-multinational-distribution-agreement-with-align-technology-for-itero-element-intraoral-scanners-300921808.htmlSOURCE  Zimmer Biomet Holdings, Inc."
    }
]