[
    {
        "title": "Alexion Announces Launch of Alexion Charitable Foundation and Calls for Grantees",
        "subtitle": "",
        "date": "Feb 27, 2020 8:30AM EST",
        "content": "\n- Ahead of Rare Disease Day, new support becomes available to the rare community -\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced the launch of the Alexion Charitable Foundation to provide further support for the rare disease community and for local communities which the company serves. The key components of the Foundation are the Rare Belonging™ and Local Needs Grants focus areas. Rare Belonging seeks to advance emotional well-being and educational opportunities, and provide relief for critical needs, especially for those living with or affected by a rare disease. The Foundation seeks eligible, disease-agnostic nonprofit organizations to help create and execute programs aligned with these priorities.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200227005210/en/\n“Alexion understands that the impact of living with a rare disease goes far beyond the disease itself. It affects families, caregivers and has broad reaching implications in terms of mental health, education, and even job security,” said Rana Strellis, Senior Vice President, Global Culture and Corporate Social Responsibility at Alexion. “Through Rare Belonging, we hope to work with eligible, disease-agnostic nonprofits to help alleviate some of these challenges.”\n\nRare Belonging, to be funded through grants made by the Foundation to other, disease-agnostic nonprofit organizations, is designed to benefit people affected by any of the 6,000 diseases identified in the Global Genes' RARE list,1 including patients, their families and caregivers by providing funding for:\n\nThe Foundation, through its Local Needs Grants, will also contribute a portion of its funding to organizations in the communities where Alexion has a major presence and that align with the mission of the Foundation. Local Needs Grants are focused on helping organizations that serve disadvantaged or disenfranchised people, with a focus on advancing emotional well-being, educational opportunities and the cause of diversity in society and critical institutions.\n\nTo learn more about eligibility requirements and/or to apply for a grant from the Alexion Charitable Foundation, visit https://alexion.com/our-commitment/alexion-charitable-foundation.\n\nAbout the Alexion Charitable Foundation\nThe Alexion Charitable Foundation, a nonprofit* foundation, is organized and operated exclusively for charitable and educational purposes. Its mission is to offer promise and cultivate a sense of belonging — particularly for people affected by a rare disease — through initiatives that advance emotional well-being, educational opportunities and economic relief. The Alexion Charitable Foundation is separate from Alexion Pharmaceuticals, Inc. and its corporate giving, patient support programs and direct engagement with various patient organizations. The Alexion Charitable Foundation makes grants on a disease-agnostic basis and does not provide funding for the costs of clinical care to treat rare diseases, such as the cost of prescription medicines. To learn more, visit https://alexion.com/our-commitment/alexion-charitable-foundation.\n\n*The Alexion Charitable Foundation has applied for and is currently awaiting confirmation of its 501(c)(3) status.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing medicines. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a copper-binding agent for Wilson disease, an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases and an oral Factor D inhibitor as well as several early-stage therapies, including one for light chain (AL) amyloidosis, a second oral Factor D inhibitor and a third complement inhibitor. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\n1 | https://globalgenes.org/rare-list/\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005210/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion to Present at the 40th Annual Cowen Health Care Conference",
        "subtitle": "",
        "date": "Feb 26, 2020 6:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals (Nasdaq:ALXN) today announced that management will present at the Cowen Health Care Conference in Boston, MA on Tuesday, March 3rd, 2020 at 9:20 a.m. ET.\n\nAn audio webcast of the presentation will be available live. You can access the webcast at: http://ir.alexion.com. An archived version of the remarks will also be available through the Company’s website for a limited time following the conference.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005018/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals"
    },
    {
        "title": "Alexion to Present at the 9th Annual SVB Leerink Global Healthcare Conference",
        "subtitle": "",
        "date": "Feb 20, 2020 4:01PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals (Nasdaq:ALXN) today announced that management will present at the SVB Leerink Global Healthcare Conference in New York, NY on Tuesday, February 25th, 2020 at 9:30 a.m. ET.\n\nAn audio webcast of the presentation will be available live. You can access the webcast at: http://ir.alexion.com. An archived version of the remarks will also be available through the Company’s website for a limited time following the conference.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005805/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals"
    },
    {
        "title": "Alexion Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Jan 30, 2020 6:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced financial results for the fourth quarter and full year of 2019. Total revenues for the full year of 2019 were $4,991.1 million, a 21 percent increase compared to 2018. The negative impact of foreign currency on total revenues year-over-year was 1 percent, or $45.1 million, inclusive of hedging activities. On a GAAP basis, diluted EPS for the full year of 2019 was $10.70, inclusive of one-time tax benefits related to intra-entity asset transfers of intellectual property, compared to $0.35 in the prior year, inclusive of $1,183.0 million of expense related to the value of the in-process research and development assets acquired in 2018. Non-GAAP diluted EPS for the full year of 2019 was $10.53, a 33 percent increase versus the prior year.\n\nTotal revenues in the fourth quarter were $1,384.3 million, a 23 percent increase compared to the same period in 2018. The negative impact of foreign currency on total revenues year-over-year was 1 percent, or $13.1 million, inclusive of hedging activities. On a GAAP basis, diluted EPS in the quarter was $4.00, inclusive of one-time tax benefits related to intra-entity asset transfers of intellectual property, compared to $(0.20) in the prior year, inclusive of $379.3 million of expense related to the value of the in-process research and development asset acquired in connection with our acquisition of Syntimmune in the fourth quarter of 2018. Non-GAAP diluted EPS for the fourth quarter of 2019 was $2.71, a 27 percent increase versus the fourth quarter of 2018.\n\n\"In 2019, we continued to strengthen the foundation of our business by executing on our strategy to lead, expand and diversify. Our key achievements include establishing ULTOMIRIS as the market leader in PNH within the first year of launch, expanding our C5 portfolio to make neurology our largest franchise in the U.S., and further diversifying our pipeline with seven business development deals adding five clinical-stage assets to our portfolio,\" said Ludwig Hantson, Ph.D., Chief Executive Officer of Alexion. \"I am confident we are well positioned for the future and will build on our momentum in 2020, with a continued focus on delivering long-term shareholder value by advancing our mission of developing and delivering transformative medicines for people with rare diseases.\"\n\nFull Year 2019 Financial Highlights\n\nFourth Quarter 2019 Financial Highlights\n\nResearch and Development\n\nPHASE 3\n\nPHASE 1/2\n\nPRE-CLINICAL\n\n2020 Financial Guidance\n\n2020 financial guidance assumes a GAAP effective tax rate of 15.5 to 16.5 percent and a non-GAAP effective tax rate of 16.0 to 17.0 percent for the year. The 2020 GAAP and non-GAAP tax rates do not benefit from one-time events that benefited the tax rates in 2019.\n\nUpdated guidance includes the financial impact of the recently announced agreement to acquire Achillion, which closed in January 2020.\n\nAlexion’s financial guidance is based on current foreign exchange rates net of hedging activities and does not include the effect of acquisitions, license and other strategic agreements, intangible asset impairments, litigation charges, changes in fair value of contingent consideration, gains or losses related to strategic equity investments or restructuring and related activity outside of the previously announced activities that may occur after the issuance of this press release.\n\nConference Call/Webcast Information:\n\nAlexion will host a conference call/audio webcast to discuss the fourth quarter and full-year 2019 results today at 7:30 a.m. Eastern Time. To participate in the call, dial 866-762-3111 (USA) or 210-874-7712 (International), conference ID 3571658 shortly before 7:30 a.m. Eastern Time. A replay of the call will be available for a limited period following the call. The audio webcast can be accessed on the Investor page of Alexion’s website at: http://ir.alexion.com.\n\nAbout Alexion\n\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing medicines. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a copper-binding agent for Wilson disease, an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases and an oral Factor D inhibitor as well as several early-stage therapies, including one for light chain (AL) amyloidosis, a second anti-FcRn therapy, a second oral Factor D inhibitor and a third complement inhibitor. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-E]\n\nForward-Looking Statement\n\nThis press release contains forward-looking statements, including statements related to: guidance regarding anticipated financial results for 2020 (and the assumptions related to such guidance); the strength of our business and continued growth; plans to expand the Company's pipeline; Company's goal of continuing to build on momentum as the year progresses; future plans for, and the timing for, the commencement of future clinical trials and the expected timing of the receipt of results of certain clinical trials and studies, including clinical programs for ULTOMIRIS in aHUS, NMOSD, HSCT-TMA, ALS, PNH, gMG, PPMS, a subcutaneous administration in PNH and aHUS, a higher concentration formulation of ULTOMIRIS, SOLIRIS in NMOSD and gMG, ALXN1840 in Wilson Disease, CAEL-101 in light chain (AL) amyloidosis, AG10 in ATTR-PN, danicopan in C3G and PNH patients with EVH, ACH-5228 for PNH and for ALXN1830 in WAIHA and gMG; potential benefits of current products and products under development and in clinical trials; plans for development programs with third parties including, Eidos, Affibody, Dicerna, Zealand, and Complement Pharma; the potential to treat a broad range of complement mediated diseases with the products to be developed with Zealand and Dicerna and the potential advantages of novel peptide therapies; the potential for the anti-eotaxin-1 antibody from Immune Pharma to treat inflammatory diseases; the potential for CP010 to treat multiple neurological disorders; and Alexion's future clinical, regulatory, and commercial plans for ULTOMIRIS and other products and product candidates. Forward-looking statements are subject to factors that may cause Alexion's results and plans to differ materially from those forward-looking statements, including for example: our dependence on sales from our principal product (SOLIRIS); our ability to facilitate the timely conversion of from SOLIRIS to ULTOMIRIS; payer, physician and patient acceptance of ULTOMIRIS as an alternative to SOLIRIS; appropriate pricing for ULTOMIRIS; future competition from biosimilars and novel products; decisions of regulatory authorities regarding the adequacy of our research, marketing approval or material limitations on the marketing of our products; delays or failure of product candidates to obtain regulatory approval; delays or the inability to launch product candidates due to regulatory restrictions, anticipated expense or other matters; interruptions or failures in the manufacture and supply of our products and our product candidates; failure to satisfactorily address matters raised by the FDA and other regulatory agencies; results in early stage clinical trials may not be indicative of full results or results from later stage or larger clinical trials (or broader patient populations) and do not ensure regulatory approval; the possibility that results of clinical trials are not predictive of safety and efficacy and potency of our products (or we fail to adequately operate or manage our clinical trials) which could cause us to halt trials, delay or prevent us from making regulatory approval filings or result in denial of approval of our product candidates; unexpected delays in clinical trials; unexpected concerns that may arise from additional data or analysis obtained during clinical trials; future product improvements may not be realized due to expense or feasibility or other factors; uncertainty of long-term success in developing, licensing or acquiring other product candidates or additional indications for existing products; inability to complete planned acquisitions due to failure of regulatory approval or material changes in target or otherwise; inability to complete acquisitions and investments due to increased competition for technology; the possibility that current rates of adoption of our products are not sustained; the adequacy of our pharmacovigilance and drug safety reporting processes; failure to protect and enforce our data, intellectual property and proprietary rights and the risks and uncertainties relating to intellectual property claims, lawsuits and challenges against us (including intellectual property lawsuits relating to ULTOMIRIS brought by third parties against Alexion and inter partes review petitions submitted by third parties); the risk that third party payors (including governmental agencies) will not reimburse or continue to reimburse for the use of our products at acceptable rates or at all; failure to realize the benefits and potential of investments, collaborations, licenses and acquisitions; the possibility that expected tax benefits will not be realized; assessment of impact of recent accounting pronouncements; potential declines in sovereign credit ratings or sovereign defaults in countries where we sell our products; delay of collection or reduction in reimbursement due to adverse economic conditions or changes in government and private insurer regulations and approaches to reimbursement; uncertainties surrounding legal proceedings, company investigations and government investigations, including investigations of Alexion by the U.S. Securities and Exchange Commission (SEC) and U.S. Department of Justice; the risk that estimates regarding the number of patients with PNH, aHUS, gMG, NMOSD, HPP and LAL-D and other future indications we are pursuing are inaccurate; the risks of changing foreign exchange rates; risks relating to the potential effects of the Company's restructuring; risks related to the acquisition of companies and co-development and collaboration efforts; and a variety of other risks set forth from time to time in Alexion's filings with the SEC, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the period ended September 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\n\nIn addition to financial information prepared in accordance with GAAP, this press release also contains non-GAAP financial measures that Alexion believes, when considered together with the GAAP information, provide investors and management with supplemental information relating to performance, trends and prospects that promote a more complete understanding of our operating results and financial position during different periods. Alexion also uses these non-GAAP financial measures to establish budgets, set operational goals and to evaluate the performance of the business. The non-GAAP results, determined in accordance with our internal policies, exclude the impact of the following GAAP items (see reconciliation tables below for additional information): share-based compensation expense, fair value adjustment of inventory acquired, amortization of purchased intangible assets, changes in fair value of contingent consideration, restructuring and related expenses, upfront payments related to licenses and other strategic agreements, acquired in-process research and development, impairment of purchased intangible assets, gains and losses related to strategic equity investments, litigation charges, gain or loss on sale of a business or asset, gain or loss related to purchase options, contingent milestone payments associated with acquisitions of legal entities accounted for as asset acquisitions, acquisition-related costs and certain adjustments to income tax expense. These non-GAAP financial measures are not intended to be considered in isolation or as a substitute for, or superior to, the financial measures prepared and presented in accordance with GAAP, and should be reviewed in conjunction with the relevant GAAP financial measures. Please refer to the attached Reconciliations of GAAP to non-GAAP Financial Results and GAAP to non-GAAP 2020 Financial Guidance for explanations of the amounts adjusted to arrive at non-GAAP net income and non-GAAP earnings per share amounts for the three and twelve month periods ended December 31, 2019 and 2018 and projected twelve months ending December 31, 2020.\n\n(1) The following table summarizes the total restructuring and related expenses recorded by type of activity and the classification within the Reconciliation of GAAP to non-GAAP Financial Results:\n\n(2) During the three months ended December 31, 2019, we recorded expense of $27.1 million in connection with upfront payments on strategic agreements that we entered into with Stealth BioTherapeutics Corp. (Stealth) and Immune Pharmaceuticals (Immune Pharma). During the twelve months ended December 31, 2019, we recorded expense of $103.4 million in connection with upfront payments on strategic agreements that we entered into with Stealth, Immune Pharma, Eidos Therapeutics, Inc., Affibody AB and Zealand Pharma A/S.\n\n(3) During the second and fourth quarters of 2018, we completed the acquisitions of Wilson Therapeutics AB (Wilson) and Syntimmune, Inc. (Syntimmune), respectively. The acquisitions were both accounted for as asset acquisitions, as substantially all of the fair value of the gross assets acquired were concentrated in a single asset. The value of the acquired in-process research and development assets was expensed during the quarters the acquisitions were completed due to the stage of development of the assets. In connection with the agreement of the final working capital adjustment for the Syntimmune acquisition, we recognized a benefit of $4.1 million associated with previously acquired in-process research and development in the second quarter of 2019.\n\n(4) Changes in the fair value of contingent consideration expense for the three and twelve months ended December 31, 2019 as well as the three months ended December 31, 2018 include the impact of changes in the expected timing of achieving contingent milestones, in addition to the interest component related to the passage of time. For the twelve months ended December 31, 2018, the change in the fair value of contingent consideration expense was primarily due to amending certain contingent milestone payments due under our prior merger agreement with Enobia Pharma Corp. in September 2018 as well as due to increases in the likelihood and anticipated timing of payments for contingent consideration.\n\n(5) On December 9, 2019, we sold our Moderna Therapeutics Inc. strategic equity investment. We received $114.7 million in net proceeds, resulting in a realized gain of $77.2 million on our initial investment. During the three and twelve months ended December 31, 2019, we recognized a net gain of $19.7 million and $32.8 million in investment income, respectively, relating to our Moderna investment. Additionally, during the three and twelve months ended December 31, 2019, we recognized an unrealized gain of $19.3 million and $26.9 million, respectively, in investment income to adjust our remaining strategic equity investments to fair value. During the three and twelve months ended December 31, 2018, we recognized unrealized gains of $57.7 million and $43.1 million, respectively, in investment income to adjust our strategic equity investments to fair value.\n\n(6) In December 2019, we amended the terms of our agreement with Caelum Biosciences (Caelum) with respect to the option to acquire the remaining equity in Caelum. In conjunction with this amendment, we recognized a gain of $32.0 million in other income and (expense), which reflects an increase in the fair value of the option, less incremental upfront funding and the change in the fair value of contingent payments which we also modified as part of the amendment.\n\n(7) Alexion's non-GAAP income tax expense for the three and twelve months ended December 31, 2019 and 2018 excludes the tax effect of pre-tax adjustments to GAAP profit. Non-GAAP income tax expense for the three and twelve months ended December 31, 2019 excludes a one-time tax benefit of $382.2 million related to the intra-entity asset transfer of intellectual property within our captive foreign partnership. Non-GAAP income tax expense for the twelve months ended December 31, 2019 also excludes certain one-time tax benefits of $95.7 million and $30.3 million associated with a tax election made with respect to intellectual property of Wilson and a release of an existing valuation allowance, respectively, and excludes a one-time tax expense of $10.2 million related to the July 1, 2019 integration of Wilson intellectual property into the Alexion corporate structure. Non-GAAP income tax expense for the three and twelve months ended December 31, 2018 excludes adjustments to provisional estimates of the impact of Tax Cuts and Jobs Act we recorded in fourth quarter 2017.\n\n(1) In February 2016, the Financial Accounting Standards Board issued a new standard that requires lessees to recognize leases on-balance sheet. We adopted the new standard on January 1, 2019 using the modified retrospective approach. The December 31, 2019 condensed consolidated balance sheet is presented under the new standard, while the December 31, 2018 condensed consolidated balance sheet is not adjusted and continues to be reported under the accounting standards in effect for that period. Upon adoption of the new lease standard, we derecognized $472.8 million of property, plant and equipment and other assets and $372.2 million of facility lease obligations associated with previously existing build-to-suit arrangements which resulted in a decrease of $90.3 million to retained earnings, net of tax. In addition, we capitalized $326.1 million and $255.3 million of right of use assets and lease liabilities, respectively, within our condensed consolidated balance sheet upon adoption.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005195/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion Completes Acquisition of Achillion",
        "subtitle": "",
        "date": "Jan 28, 2020 9:29AM EST",
        "content": "\n– Acquisition adds two clinical-stage Factor D inhibitors to Alexion’s pipeline and provides promising development platform for additional complement-mediated diseases –\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced it has completed its acquisition of Achillion Pharmaceuticals, Inc. The acquisition adds two clinical-stage oral small molecule Factor D inhibitors to Alexion’s pipeline and provides the foundation and expertise for a broader oral Factor D inhibition development platform with the potential to treat numerous additional complement-mediated diseases.\n\n“The acquisition of Achillion adds two clinical-stage Factor D inhibitors to our growing pipeline, representing important continued momentum in expanding and diversifying our portfolio and advancing our mission of transforming the lives of people with rare diseases,” said Ludwig Hantson, Ph.D., Chief Executive Officer of Alexion. “We believe oral Factor D inhibition holds great promise in treating people with multiple rare, complement-mediated diseases, providing the opportunity to significantly expand our portfolio into new therapeutic areas and to help many more patients. We look forward to the expertise the Achillion team brings to Alexion, which, combined with our own complement biology and rare disease development and commercialization experience, will enable us to collectively accelerate progress of the development programs. We are committed to maintaining continuity in the programs currently underway and will be moving quickly to advance Achillion's efforts.”\n\nAlexion will continue development of Achillion’s oral Factor D inhibitor portfolio, which includes two clinical-stage medicines-in-development – danicopan (ACH-4471) and ACH-5228 – as well as multiple compounds in preclinical development. Phase 3 development is being initiated for danicopan as an add-on therapy for PNH patients with extravascular hemolysis (EVH). Danicopan is also in Phase 2 development for C3G, and ACH-5228 is in Phase 2 development for PNH.\n\nAbout Factor D\nFactor D is an essential serine protease and critical control point in the alternative pathway (AP) of the complement system, a part of the innate immune system. Achillion’s complement platform is focused on advancing oral small molecules that inhibit the AP and can potentially be used in the treatment of immune-related diseases in which complement AP plays a critical role. Potential indications currently being evaluated for these compounds include paroxysmal nocturnal hemoglobinuria (PNH) and C3 glomerulopathy (C3G).\n\nAbout Paroxysmal Nocturnal Hemoglobinuria (PNH)\nParoxysmal nocturnal hemoglobinuria (PNH) is a chronic, progressive, debilitating and life-threatening ultra-rare blood disorder characterized by hemolysis (destruction of red blood cells) that is mediated by uncontrolled activation of the complement system, a component of the body’s immune system. Patients with PNH may experience a wide range of signs and symptoms, such as fatigue, difficulty swallowing, shortness of breath, abdominal pain, erectile dysfunction, dark-colored urine and anemia. The most devastating consequence of chronic hemolysis is thrombosis, which can occur in blood vessels throughout the body, damaging vital organs and causing premature death. PNH is primarily a disease of intravascular hemolysis (IVH), where the red blood cell destruction occurs within the blood vessels. C5 inhibition addresses the complications of IVH and the increases in LDH that cause thrombosis and even death in patients with PNH. However, a small portion of patients – less than 10 percent – receiving a C5 inhibitor continue to experience clinical extravascular hemolysis (EVH), where the red blood cell destruction occurs outside the blood vessels. As a result, these patients are transfusion dependent despite treatment but do not have bone marrow failure or aplastic anemia. Inhibiting Factor D in the alternative pathway (AP) of the complement system offers the possibility of selectively blocking AP activity and protecting against the destruction of red blood cells, while leaving the rest of the complement system intact to fight infection.\n\nAbout C3 Glomerulopathy (C3G)\nC3G is an ultra-rare kidney disease for which there is no approved treatment. The disease is characterized by the deposition of C3 protein fragments in the filtering units (glomeruli) of the kidney, caused by overactivation of the complement alternative pathway (AP). Over time, the chronic deposition of C3 fragments results in permanent kidney damage and kidney failure. Today, C3G patients are treated with steroids and broad-acting immunosuppressants to slow the progression of kidney damage. Oral Factor D inhibitors have demonstrated proof-of-mechanism to interrupt the overactivation of the AP and reduce C3 fragment deposition, providing a potential treatment approach for targeting the underlying cause of C3G.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing medicines. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AChR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a copper-binding agent for Wilson disease, an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases and an oral Factor D inhibitor as well as several early-stage therapies, including one for light chain (AL) amyloidosis, a second anti-FcRn therapy, a second oral Factor D inhibitor and a third complement inhibitor. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nForward-Looking Statement\nThis press release includes forward-looking statements related to Alexion’s acquisition of Achillion, including: the acquisition provides the foundation for a broader oral Factor D inhibition development platform with the potential to treat numerous additional complement-mediated diseases; the acquisition of Achillion represents important continued momentum in expanding and diversifying our portfolio; oral Factor D inhibition holds great promise in treating multiple rare, complement-mediated diseases, providing the opportunity to significantly expand our portfolio into new therapeutic areas; we are committed to maintaining continuity in the programs currently underway and will be moving quickly to accelerate Achillion’s efforts; and Alexion will continue development of Achillion’s oral Factor D inhibitor portfolio. A number of important factors could cause actual results to differ materially from those indicated by such forward-looking statements, including: the anticipated benefits of the Achillion platform and therapies not being realized; future clinical trials of Achillion products not proving that the therapies are safe and effective to the level required by regulators; decisions of regulatory authorities regarding the adequacy of the research and clinical tests, marketing approval or material limitations on the marketing of Achillion products; delays or failure of product candidates to obtain regulatory approval; delays or the inability to launch product candidates due to regulatory restrictions; unanticipated expenses; interruptions or failures in the manufacture and supply of products and product candidates; failure to satisfactorily address matters raised by the FDA and other regulatory agencies; the possibility that results of clinical trials are not predictive of safety and efficacy results of products in broader patient populations; the possibility that clinical trials of product candidates could be delayed or terminated prior to completion for a number of reasons; the adequacy of pharmacovigilance and drug safety reporting processes; and a variety of other risks set forth from time to time in Alexion’s or Achillion’s filings with the SEC, including but not limited to the risks discussed in Alexion’s Quarterly Report on Form 10-Q for the period ended September 30, 2019 and in its other filings with the SEC and the risks discussed in Achillion’s Quarterly Report on Form 10-Q for the period ended September 30, 2019 and in its other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005516/en/\nAlexion Contacts:\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "UPDATED TIME: Alexion Fourth Quarter and Full Year 2019 Results Conference Call at 7:30am ET on Thursday, January 30, 2020",
        "subtitle": "",
        "date": "Jan 24, 2020 6:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (Nasdaq: ALXN) today announced that it has updated the time of its fourth quarter and full year 2019 earnings call on January 30, 2020 to 7:30 a.m. Eastern Time. The call had previously been scheduled for 8:00 a.m. ET. All other aspects of the call remain unchanged.\n\nThe Company will report its financial results for the fourth quarter and full year ended December 31, 2019 before the US financial markets open on January 30, 2020.\n\nTo participate in the conference call, dial (866) 762-3111 (USA) or (210) 874-7712 (International), conference ID 3571658 shortly before 7:30 a.m. ET. The audio webcast can be accessed on the Investor page of http://ir.alexion.com and an archived version will be available for a limited time following the presentation.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200124005075/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion to Report Fourth Quarter and Full Year 2019 Results on Thursday, January 30, 2020",
        "subtitle": "",
        "date": "Jan 17, 2020 6:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (Nasdaq: ALXN) today announced that the Company will report its financial results for the fourth quarter and full year ended December 31, 2019 before the US financial markets open on January 30, 2020. Following the release of the financial results, Alexion management will conduct a conference call and audio webcast at 8:00 a.m. Eastern Time (ET).\n\nTo participate in this conference call, dial (866) 762-3111 (USA) or (210) 874-7712 (International), conference ID 3571658 shortly before 8:00 a.m. ET. The audio webcast can be accessed on the Investor page of http://ir.alexion.com and an archived version will be available for a limited time following the presentation.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200117005033/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion Announces Planned Initiation of Pivotal Phase 3 Study of ULTOMIRIS® (ravulizumab) in ALS",
        "subtitle": "",
        "date": "Jan 14, 2020 8:30AM EST",
        "content": "\n- 50-week global study to enroll ~350 patients across broad ALS population -\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced the planned initiation of a pivotal Phase 3 study of ULTOMIRIS® (ravulizumab) in amyotrophic lateral sclerosis (ALS). The 50-week global study, called CHAMPION-ALS, will evaluate approximately 350 adults across a broad patient population, and the primary endpoint will be change in ALS functional rating scale-revised (ALSFRS-R) score. Alexion submitted an investigational new drug application (IND) for ULTOMIRIS in ALS to the FDA in the fourth quarter of 2019 and plans to initiate the Phase 3 study this quarter.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200114005254/en/\n“Given the significant need for new and improved treatments for ALS, we are committed to advancing this clinical program with urgency,” said John Orloff, M.D., Executive Vice President and Head of Research & Development at Alexion. “Based on preclinical data and the significant role complement activation is known to play in other neuromuscular diseases, we believe ULTOMIRIS has the potential to inhibit complement-mediated damage in people with ALS, which may slow disease progression. We thank the ALS community for their involvement in designing this Phase 3 program and look forward to continued close collaboration as we move it forward.”\n\n“We’ve made great progress advancing ALS research in recent years, but there is still more work to be done to ensure patients benefit from these advances in the form of new treatments,” said Calaneet Balas, CEO and President of The ALS Association. “It’s great that Alexion, which has an established record of bringing new treatments to patients with devastating rare diseases, is joining the fight against ALS.”\n\nAbout the Phase 3 CHAMPION-ALS Study\nThe Phase 3 CHAMPION-ALS trial is a randomized, double-blind, placebo-controlled multicenter global study designed to evaluate the efficacy and safety of ULTOMIRIS across a broad ALS population. The study will enroll approximately 350 adults with sporadic or familial ALS who have had disease onset (in the form of first motor symptoms) within the prior 36 months, demonstrate a slow vital capacity (SVC) of at least 65 percent predicted, and are not dependent on respiratory support.\n\nStudy participants will be randomized on a 2:1 basis to receive ULTOMIRIS or placebo every 8 weeks following an initial loading dose and may continue to receive their existing standard of care treatment for ALS. After 50 weeks, all patients will receive ULTOMIRIS in a 2-year open-label extension phase of the study. The study will be conducted at approximately 90 clinical trial sites across North America, Europe and Asia-Pacific.\n\nThe primary study endpoint will be change from baseline in ALS functional rating scale-revised (ALSFRS-R) score. Secondary endpoints will include ventilation assistance-free survival (VAFS), respiratory capacity, muscle strength, neurofilament light chain (NfL) serum concentrations and safety.\n\nAbout ALS\nAmyotrophic lateral sclerosis (ALS) is a neurological disorder characterized by progressive degeneration of nerve cells (motor neurons) in the brain and the spinal cord that control muscles throughout the body. When the nerve cells die, the brain can no longer initiate and control muscle movement, which results in severe disability, paralysis and eventually death.\n\nALS is a relentlessly progressive disorder. People with ALS may lose the ability to speak, eat, move and breathe. The rate of progression between individuals is variable and the natural history generally reflects progressive worsening over time until death occurs. The average life expectancy from symptom onset is between two and five years. Currently approved medications may slow disease progression, but ALS management is mostly supportive, palliative and symptom based.\n\nAn estimated 15,000 to 20,000 people are living with ALS across the United States, France, Germany, Italy, Spain, the United Kingdom and Japan. There are two different types of ALS, sporadic and familial. Sporadic, which is the most common form of the disease, accounts for 85 to 90 percent of cases and may affect anyone, anywhere. Familial ALS, the inherited form of the disease, accounts for 10 to 15 percent of cases.\n\nAbout ULTOMIRIS® (ravulizumab-cwvz)\nULTOMIRIS® (ravulizumab-cwvz) is the first and only approved long-acting C5 complement inhibitor. It is administered intravenously every eight weeks or every four weeks for pediatric patients less than 20 kg, following a loading dose. ULTOMIRIS works by inhibiting the C5 protein in the terminal complement cascade, a part of the body’s immune system. The terminal complement cascade, when activated in an uncontrolled manner, plays a role in severe ultra-rare disorders. ULTOMIRIS is approved in the U.S., Japan, and the EU as a treatment for adults with PNH and in the U.S. for aHUS to inhibit complement-mediated thrombotic microangiopathy (TMA) in adult and pediatric (one month of age and older) patients.\n\nINDICATIONS & IMPORTANT SAFETY INFORMATION FOR ULTOMIRIS (ravulizumab-cwvz) 300 mg / 30 mL injection for intravenous use\nINDICATIONS\nULTOMIRIS is a prescription medicine called a monoclonal antibody. ULTOMIRIS is used to treat adults with a disease called Paroxysmal Nocturnal Hemoglobinuria (PNH). ULTOMIRIS is used to treat adults and children 1 month of age and older with a disease called atypical Hemolytic Uremic Syndrome (aHUS). ULTOMIRIS is not used in treating people with Shiga toxin E. coli related hemolytic uremic syndrome (STEC-HUS). It is not known if ULTOMIRIS is safe and effective in children with PNH. It is not known if ULTOMIRIS is safe and effective in children younger than 1 month of age in aHUS.\n\nIMPORTANT SAFETY INFORMATION\nULTOMIRIS is a medicine that affects the immune system. ULTOMIRIS can lower the ability of the immune system to fight infections. ULTOMIRIS increases the chance of getting serious and life-threatening meningococcal infections. Meningococcal infections may quickly become life-threatening and cause death if not recognized and treated early.\n\nMeningococcal vaccines must be received at least 2 weeks before the first dose of ULTOMIRIS if one has not already had this vaccine. If one’s doctor decides that urgent treatment with ULTOMIRIS is needed, meningococcal vaccination should be administered as soon as possible. If one has not been vaccinated and ULTOMIRIS therapy must be initiated immediately, 2 weeks of antibiotics should also be administered with the vaccinations. If one had a meningococcal vaccine in the past, additional vaccination might be needed before starting ULTOMIRIS. One’s doctor will decide if additional meningococcal vaccination is needed. Meningococcal vaccines reduce the risk of meningococcal infection but do not prevent all meningococcal infections. Call one’s doctor or get emergency medical care right away if any of these signs and symptoms of a meningococcal infection occur: headache with nausea or vomiting, headache and fever, headache with a stiff neck or stiff back, fever, fever and a rash, confusion, muscle aches with flu-like symptoms, and eyes sensitive to light. One’s doctor will give a Patient Safety Card about the risk of meningococcal infection. Carry the card at all times during treatment and for 8 months after your the ULTOMIRIS dose.\n\nULTOMIRIS is only available through a program called the ULTOMIRIS REMS.\n\nULTOMIRIS may also increase the risk of other types of serious infections. People who take ULTOMIRIS may have an increased risk of getting infections caused by Streptococcus pneumoniae and Haemophilus influenzae. Certain people may also have an increased risk of gonorrhea infection. To find out if one is at risk for gonorrhea infection, about gonorrhea prevention, and regular testing, talk to the doctor. Call the doctor right away if one has any new signs or symptoms of infection.\n\nDo not receive ULTOMIRIS if one has a meningococcal infection, or has not been vaccinated against meningococcal infection unless the doctor decides that urgent treatment with ULTOMIRIS is needed.\n\nBefore one receives ULTOMIRIS, tell the doctor about all of the medical conditions, including if one: has an infection or fever, are pregnant or plan to become pregnant, and are breastfeeding or plan to breastfeed. It is not known if ULTOMIRIS will harm an unborn baby. It is not known if ULTOMIRIS passes into the breast milk. One should not breastfeed during treatment and for 8 months after one’s final dose of ULTOMIRIS.\n\nTell the doctor about all the medicines one takes, including prescription and over-the-counter medicines, vitamins, and herbal supplements. ULTOMIRIS and other medicines can affect each other causing side effects. Know the medicines one takes and the vaccines one receives. Keep a list of them to show the doctor and pharmacist when one gets a new medicine.\n\nIf one has PNH and stops receiving ULTOMIRIS, the doctor will need to monitor closely for at least 16 weeks after one stops ULTOMIRIS. Stopping ULTOMIRIS may cause breakdown of the red blood cells due to PNH. Symptoms or problems that can happen due to red blood cell breakdown include: drop in the red blood cell count, tiredness, blood in the urine, stomach-area (abdomen) pain, shortness of breath, blood clots, trouble swallowing, and erectile dysfunction (ED) in males. If one has aHUS, the doctor will need to monitor closely for at least 12 months after stopping treatment for signs of worsening aHUS symptoms or problems related to a type of abnormal clotting and breakdown of the red blood cells called thrombotic microangiopathy (TMA). Symptoms or problems that can happen with TMA may include: confusion or loss of consciousness, seizures, chest pain (angina), difficulty breathing, and blood clots or stroke. If one misses an ULTOMIRIS infusion, call the doctor right away.\n\nULTOMIRIS can cause serious side effects including infusion reactions. Infusion reactions may happen during one’s ULTOMIRIS infusion. Symptoms of an infusion reaction with ULTOMIRIS may include lower back pain, pain with the infusion, feeling faint or discomfort in the arms or legs. Tell the doctor or nurse right away if these symptoms develop, or any other symptoms during the ULTOMIRIS infusion that may mean one is having a serious infusion reaction, including: chest pain, trouble breathing or shortness of breath, swelling of the face, tongue, or throat, and feel faint or pass out. One’s doctor will treat the symptoms as needed.\n\nThe most common side effects of ULTOMIRIS in people treated for PNH are upper respiratory infection and headache. The most common side effects of ULTOMIRIS in people with aHUS are upper respiratory infections, diarrhea, nausea, vomiting, headache, high blood pressure, and fever.\n\nPlease see the accompanying full Prescribing Information and Medication Guide for ULTOMIRIS, including Boxed WARNING regarding serious and life-threatening meningococcal infections/sepsis.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AChR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nFor patient or advocacy inquiries please contact patientadvocacy@alexion.com.\n\nForward-Looking Statement\nThis press release contains forward-looking statements, including statements related to: Alexion’s future plans to initiate a pivotal Phase 3 study of ULTOMIRIS® (ravulizumab) in ALS; ULTOMIRIS has the potential to inhibit complement-mediated damage in people with ALS, which may slow disease progression, based on preclinical data and the significant role complement activation is known to play in other neuromuscular diseases; the potential benefits of ULTOMIRIS to people with ALS; anticipated future continued close collaboration with the ALS community as Alexion moves forward with the clinical trial; the protocol and method of the ULTOMIRIS clinical trial; and the timing of anticipated completion of clinical trials. Forward-looking statements involve risks and uncertainties relating to future events and the future performance of Alexion and are subject to factors that may cause Alexion's results and plans to differ materially from those expected by these forward looking statements, including for example: drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product; the initiation of a pivotal Phase 3 study of ULTOMIRIS in ALS may be delayed or may never be initiated; the results of the pivotal Phase 3 study of ULTOMIRIS in ALS may not result in regulatory approval necessary to commercialize ULTOMIRIS for this indication (or regulatory authorities may require additional trials to confirm safety and efficacy of ULTOMIRIS in ALS prior to approval which would be expensive and time-consuming); ULTOMIRIS may not gain market acceptance and/or may not be recognized by patients and physicians as a treatment for ALS; the benefits (including safety and efficacy), if any, of ULTOMIRIS evidenced in clinical trials may not be witnessed in a broader patient population; any potential post-approval restrictions that regulatory authorities may impose on ULTOMIRIS as a treatment for ALS; future competition from biosimilars and other products; decisions of regulatory authorities regarding the adequacy of our research, marketing approval or material limitations on the marketing of our products; delays or the inability to launch product candidates due to regulatory restrictions, anticipated expense or other matters; interruptions or failures in the manufacture and supply of our products and our product candidates; failure to satisfactorily address matters raised by regulatory agencies with respect to product candidates; results in early stage clinical trials may not be indicative of full results or results from later stage or larger clinical trials (or broader patient populations) and do not ensure regulatory approval; the possibility that results of clinical trials are not predictive of safety and efficacy and potency of our products (or we may fail to adequately operate or manage our clinical trials) which could cause us to halt trials, delay or prevent us from making regulatory approval filings or result in denial of approval of our product candidates; unexpected delays in clinical trials; the adequacy of our pharmacovigilance and drug safety reporting processes; failure to protect and enforce our data, intellectual property and proprietary rights and the risks and uncertainties relating to intellectual property claims and challenges against us (including intellectual property lawsuits relating to ULTOMIRIS brought by third parties against Alexion); the risk that third party payers (including governmental agencies) will not reimburse or continue to reimburse for the use of our products at acceptable rates or at all; uncertainties surrounding legal proceedings (including intellectual property suits initiated against Alexion and our products), company investigations and government investigations, including investigations of Alexion by the U.S. Securities and Exchange Commission (SEC) and U.S. Department of Justice; the risks of changing foreign exchange rates; and a variety of other risks set forth from time to time in Alexion's filings with the SEC, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the period ended September 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005254/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion to Present at the 38th Annual J.P Morgan Healthcare Conference",
        "subtitle": "",
        "date": "Jan 6, 2020 6:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals (Nasdaq:ALXN) today announced that management will present at the 38th Annual J.P Morgan Healthcare Conference in San Francisco, CA on Tuesday, January 14th, 2019 at 7:30 a.m, PT. A breakout question and answer session will immediately follow the formal presentation.\n\nAn audio webcast of the presentation will be available live. You can access the webcast at: http://ir.alexion.com. An archived version of the remarks will also be available through the Company’s website for a limited time following the conference.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005288/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals"
    },
    {
        "title": "Alexion Exercises Option for Two Additional GalXC™ RNAi Programs for Complement-Mediated Targets Under Collaboration With Dicerna™",
        "subtitle": "",
        "date": "Dec 16, 2019 8:00AM EST",
        "content": "\n– Option Exercise Triggers $20 Million Payment to Dicerna –\n    BOSTON & LEXINGTON, Mass.--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) and Dicerna™ Pharmaceuticals, Inc. (NASDAQ:DRNA) today announced that Alexion has exercised its option for exclusive rights to two additional targets within the complement pathway for the discovery and development of GalXC™ RNAi molecules. This expands the companies’ existing research collaboration and license agreement to now encompass four targets within the complement pathway. In connection with the option exercise, Alexion will pay Dicerna a total of $20 million, or $10 million in option exercise fees per additional new target.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191216005150/en/\n“Our collaboration with Dicerna to discover and develop GalXC RNAi therapies, which have the potential to inhibit uncontrolled activation of the complement system in new ways, represents an exciting opportunity for Alexion to expand its leadership in developing new medicines for complement-mediated diseases,” said John Orloff, M.D., Executive Vice President and Head of Research & Development at Alexion. “We are encouraged by the collaboration’s progress and the strong relationship our teams have developed over the past year, and we are pleased to expand our efforts to include additional targets in the complement pathway.”\n\n“With more than 20 years of experience, Alexion is a clear leader in the field of complement biology, and we are very pleased by our collaboration’s success to date in identifying potential new GalXC RNAi-based therapeutic approaches to treating complement-related diseases. Alexion’s decision to exercise its option, along with our other new collaborations in different therapeutic areas, underscores the growing recognition of the significant potential for RNAi therapies as a new modality in the treatment of a broad range of diseases,” said Douglas M. Fambrough, Ph.D., President and Chief Executive Officer of Dicerna. “We are very proud to be at the forefront of RNAi innovation and look forward to continued advancement of our core development portfolio and progress across our collaborative programs in 2020.”\n\nThe collaboration between Alexion and Dicerna, which was initiated in October 2018, is focused on the discovery and development of subcutaneously delivered GalXC RNAi molecules directed to a total of four complement pathway targets for the treatment of complement-mediated diseases. Dicerna is leading the joint discovery and research efforts through the preclinical stage, and Alexion will lead development efforts beginning with Phase 1 studies. The agreement provides Alexion with exclusive worldwide licenses and commercial rights to the GalXC RNAi molecules developed in the collaboration in exchange for development- and approval-related milestones, sales milestones and mid-single to low-double-digit royalties on future product sales.\n\nAbout the Complement System\n\nThe complement system is a part of the immune system that enhances, or complements, the ability of antibodies to clear small organisms or damaged cells from an organism, promote inflammation and attack the pathogen’s cell membrane. While the complement system is essential to maintaining health, it can also become over-activated, contributing to the development of numerous devastating diseases.\n\nAbout Dicerna's GalXC™ RNAi Technology Platform\n\nDicerna’s proprietary RNA interference (RNAi) technology platform, called GalXC™, aims to advance the development of next-generation RNAi-based therapies designed to silence disease-driving genes in the liver and other tissues. Liver-targeted GalXC-based compounds enable subcutaneous delivery of RNAi therapies that are designed to bind specifically to receptors on liver cells, leading to internalization and access to the RNAi machinery within the cells. The GalXC approach seeks to optimize the activity of the RNAi pathway so that it operates in the most specific and potent fashion. Compounds produced via GalXC are intended to be broadly applicable across multiple therapeutic areas, including both liver and non-liver indications.\n\nAbout Alexion\n\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AChR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nAbout DicernaTM Pharmaceuticals, Inc.\n\nDicerna™ Pharmaceuticals, Inc., is a biopharmaceutical company using ribonucleic acid interference (RNAi) to develop medicines that silence genes that cause disease. The company is applying its proprietary GalXC™ technology to develop potent, selective and safe RNAi therapies for treatment of rare diseases, chronic liver diseases, cardiovascular diseases, neurodegenerative diseases, pain and viral infectious disease. Dicerna aims to treat disease by addressing the underlying causes of illness with capabilities that extend beyond the liver to address a broad range of diseases, focusing on target genes where connections between gene and disease are well understood and documented. Dicerna intends to discover, develop and commercialize novel therapies either on its own or in collaboration with pharmaceutical partners. Dicerna has strategic collaborations with Novo Nordisk A/S*, Roche*, Eli Lilly and Company, Alexion Pharmaceuticals, Inc. and Boehringer Ingelheim International GmbH. For more information, please visit www.dicerna.com.\n\n[DRNA]\n\nForward-Looking Statements\n\nThis press release includes forward-looking statements. Such forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in such statements. Examples of forward-looking statements include, among others, statements we make regarding: (i) the receipt of option exercise fees; (ii) the therapeutic and commercial potential of GalXC™, including its potential to inhibit uncontrolled activation of the complement system in new ways; (iii) research and development plans of Alexion related to GalXC; (iv) the potential of RNAi therapies for the treatment of complement-mediated diseases and a broad range of diseases; & (v) the potential for the collaboration between Alexion and Dicerna and this collaboration representing an exciting opportunity for Alexion to expand its leadership in developing new medicines for complement-mediated diseases. The process by which an early-stage platform such as GalXC could potentially lead to an approved product is long and subject to highly significant risks, particularly with respect to a preclinical research collaboration and the anticipated benefits of the platform may not be realized. In addition, the four targets of the collaboration may not result in any product and this may be after significant investments by the parties to the collaboration. Applicable risks and uncertainties include those relating to preclinical research and other risks identified under the heading \"Risk Factors\" included in Alexion’s and Dicerna’s most recent Form 10-Q filings and in other future filings with the SEC. The forward-looking statements contained in this press release reflect Alexion’s and Dicerna's current views with respect to future events, and neither Alexion nor Dicerna undertakes and specifically disclaims any obligation to update any forward-looking statements, except as required by law.\n\n* Novo Nordisk A/S and Roche transactions are subject to clearance under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 and other customary closing conditions.\n\nDicerna™ and GalXC™ are trademarks of Dicerna Pharmaceuticals, Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191216005150/en/\nAlexion\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\n\nDicerna\nMedia\nDicerna Pharmaceuticals, Inc.\nAmy Trevvett, 617-612-6253\natrevvett@dicerna.com\nor\nSmithSolve\nAlex Van Rees, 973-442-1555 ext. 111\nalex.vanrees@smithsolve.com\n\nInvestors\nStern Investor Relations, Inc.\nLauren Stival, 212-362-1200\nLauren.stival@sternir.com\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion Issues Statement on Path to Value Creation",
        "subtitle": "",
        "date": "Dec 6, 2019 8:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today issued the following statement on behalf of the Board of Directors and management team:\n\n\"The Board and management team are focused on delivering long-term shareholder value by advancing our mission of developing and delivering transformative medicines for people with rare diseases.\n\nAs part of this commitment, we maintain an active dialogue with shareholders and welcome all constructive input. We have a history of seeking, considering and incorporating feedback from all our shareholders. In that spirit, at their request, we have recently engaged in good faith with Elliott Advisors (UK) Limited, an affiliate of Elliott Management, to listen to their point of view, including their recommendation that we immediately launch a proactive sale process. Consistent with its fiduciary duties, the Board unanimously decided that conducting a proactive sale process would not be in the best interest of shareholders and the patients we serve at this time. However, in the interest of transparency, we feel it is important for all our stakeholders to hear about our decision directly from us.\n\nRefreshed, Independent and Experienced Board Committed to Fiduciary Duties and Good Governance\n\nOur Board regularly reviews our strategy and underlying assumptions to ensure that Alexion is on the best path to creating shareholder value. In considering Elliott’s recommendation, we have had the benefit of our Board’s exceptional industry backgrounds, investment experience and M&A leadership, including evaluating, negotiating and executing on numerous mergers, acquisitions and sales of major companies throughout their careers. Since 2017, Alexion has added five new directors, including a new Chief Executive Officer, and several of these new directors with desirable skillsets, independence and expertise were added with the benefit of input from Elliott and other investors.\n\nIn deciding that it would be inadvisable to follow Elliott’s recommendation, our Board considered, among other factors, that it is highly unusual, if not unprecedented, for a biopharmaceutical company of our size and maturity to proactively launch a sale process. We do not believe this approach is the best path for driving shareholder value.\n\nTo eliminate confusion and inaccurate information in the marketplace, to-date, Alexion has not received any indications of interest to acquire the Company nor have we rejected any such inbound proposals. As we have a strong commitment to transparency, we believe that our public disclosures provide significant detail into the state of our business sufficient to allow shareholders or a potential strategic partner to understand our current and future prospects. Were we to ever receive legitimate and actionable proposals, the Board would evaluate them in accordance with their fiduciary duties and act in the best interest of all shareholders.\n\nAlexion Poised to Significantly Increase Shareholder Value\n\nAn important factor in the Board’s consideration of Elliott’s recommendation is that we firmly believe the Company has established a strong foundation to drive growth, create value and improve patients’ lives. In the past 2.5 years, Alexion has:\n\nWe are not done. We believe significant potential value growth lies ahead for Alexion and our shareholders. As we look to the future, we expect to drive that growth and durability through three key priorities – facilitated conversion to ULTOMIRIS, expansion of our current assets into new diseases, and further diversification of our portfolio, while maintaining a strong culture of compliance and transparency. Our rebuilt and expanded pipeline – which includes 22 clinical-stage development programs planned across 11 assets – has the potential to deliver at least 10 additional launches by 2023, supported by a revamped and strengthened R&D organization and disciplined business development initiatives.\n\nOver the course of our engagement, Elliott has been extremely complimentary of our Board, management team and business. We appreciate Elliott’s recognition of the uniqueness and strength of Alexion’s business, the quality and independence of the refreshed Board and management team, prospects for attractive top-line and bottom-line growth, and our strong operational and financial performance, consistently delivering on the ambitious strategy we laid out a few years ago. Finally, we share Elliott’s view that the current market price substantially undervalues the Company today.\n\nWorking Together with Urgency and Focus\n\nOur Board and management team continue to work with urgency and focus to deliver shareholder value. We understand that there are risks and uncertainties in the biopharmaceutical business and the path to value creation is often not smooth and linear. But in that context, we remain committed to providing the best outcomes we can to all our stakeholders. We are very proud of what our employees globally have accomplished over the past few years transforming the organization. We look forward to working together, alongside physicians and patients, to deliver on our mission of developing transformative medicines for people with rare diseases.\n\nWe hope this communication has been helpful to you, underscoring the respect we have for our investors and all stakeholders. We look forward to reporting on our continued business progress and maintaining an open dialogue with all our shareholders and other stakeholders.\"\n\nAbout Alexion \n\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AChR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nForward-Looking Statement \n\nThis press release contains forward-looking statements. Words such as “anticipates,” ‘may,” “forecasts,” “expects,” “intends,” “plans,” “potentially,” “believes,” “seeks,” “estimates,” and variations of such words and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. Forward-looking statements are not guarantees of future performance and are subject to certain risks, uncertainties, and assumptions that are difficult to predict; therefore, actual results may differ materially from those expressed or forecasted in any such statements. Such forward-looking statements are based on current expectations, estimates and projections about our industry and business, management’s beliefs, and certain assumptions made by our management, and may include, but are not limited to, statements regarding: the strength of our business and continued growth; plans to expand Alexion’s pipeline; potential value growth lies ahead for Alexion; Alexion’s goal of continuing to build on momentum in the future; future plans for, and the timing for, the commencement of future clinical trials and the expected timing of the receipt of results of certain clinical trials and studies; potential benefits of current products and products under development and in clinical trials; plans for development programs with third parties; the potential to treat a broad range of diseases with assets acquired or licensed through our business development activities; the anticipated closing of the Achillion acquisition; and Alexion’s future clinical, regulatory, and commercial plans for ULTOMIRIS and other products and product candidates. Forward-looking statements are subject to risks and uncertainties that may cause Alexion’s results and plans to differ materially from those forward-looking statements. Such risks and uncertainties include, but are not limited to, increased competition, actions by regulatory agencies, product candidates not receiving regulatory approvals, the possibility that expected tax benefits will not be realized, assessment of impact of recent accounting pronouncements, potential declines in sovereign credit ratings or sovereign defaults in countries where we sell our products, delay of collection or reduction in reimbursement due to adverse economic conditions or changes in government and private insurer regulations and approaches to reimbursement, uncertainties surrounding legal proceedings, company investigations and government investigations and assessments, and the effect of shifting foreign exchange rates, as well as other risks and uncertainties discussed in Alexion’s Quarterly Report on Form 10-Q for the period ended September 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of the statements in this release to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191206005218/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion to Present at the 2019 Evercore ISI HealthCONx",
        "subtitle": "",
        "date": "Nov 26, 2019 4:31PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals (Nasdaq:ALXN) today announced that management will present at the 2019 Evercore ISI HealthCONx in Boston, MA on Tuesday, December 3rd, 2019 at 8:45 a.m. ET.\n\nAn audio webcast of the presentation will be available live. You can access the webcast at: http://ir.alexion.com. An archived version of the remarks will also be available through the Company’s website for a limited time following the conference.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005628/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals"
    },
    {
        "title": "SOLIRIS® (eculizumab) Receives Approval in Japan for the Prevention of Relapse in Patients with Neuromyelitis Optica Spectrum Disorder (NMOSD)",
        "subtitle": "",
        "date": "Nov 22, 2019 8:30AM EST",
        "content": "\n- SOLIRIS® (eculizumab) is the first and only approved medication for NMOSD in Japan -\n\n- 98% of adult anti-aquaporin-4 (AQP4) antibody-positive patients treated with SOLIRIS were relapse free compared to 63% receiving placebo at 48 weeks -\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced that Japan’s Ministry of Health, Labour and Welfare (MHLW) has approved the extension of the current marketing authorization of SOLIRIS® (eculizumab) to include the prevention of relapse in patients with anti-aquaporin-4 (AQP4) antibody-positive neuromyelitis optica spectrum disorder (NMOSD), including neuromyelitis optica.\n\n“We are pleased that the Japanese health authorities have approved SOLIRIS as a new treatment for patients suffering from this complex and unpredictable disease,” said John Orloff, M.D., Executive Vice President and Head of Research and Development at Alexion. “Nearly all patients treated with SOLIRIS were relapse free at 48 weeks in the Phase 3 PREVENT study, providing new hope for Japanese patients with NMOSD and their clinicians.”\n\nNMOSD is a rare, devastating, complement-mediated disorder of the central nervous system characterized by relapses, also referred to as attacks. Each attack can result in stepwise accumulation of disability, including blindness and paralysis and sometimes premature death. NMOSD disproportionately strikes young women in the prime of their lives, with the average age of first onset at just 39 years. Previously known as Devic’s Disease, NMOSD is often confused with other neurological illnesses such as multiple sclerosis (MS), which can lead to delays in diagnosis and treatment with medicines that can worsen disease progression.\n\n“The understanding of NMOSD has rapidly evolved in recent years since complement activation by AQP4 antibodies was identified as an underlying cause of the disease,” said Kazuo Fujihara, Professor, Fukushima Medical University, Director of the Multiple Sclerosis & Neuromyelitis Optica Center at Southern Tohoku Research Institute and a principal investigator in the PREVENT trial of SOLIRIS in anti-AQP4 antibody-positive NMOSD. “With the first approved medicine for NMOSD in Japan, SOLIRIS will provide highly effective treatment to prevent future relapses in these patients.”\n\nThe approval of SOLIRIS was based on comprehensive results from the Phase 3 randomized, double-blind placebo controlled PREVENT trial, which were published in The New England Journal of Medicine and a long-term extension study (ECU-NMO-302), which is still underway. In the PREVENT study, patients with NMOSD who were anti-AQP4 antibody-positive were treated with SOLIRIS (n=96) or placebo (n=47). The study met its primary endpoint of prolonging the time to first adjudicated relapse and reducing the risk of relapse. At 48 weeks, 98 percent of patients treated with SOLIRIS were relapse free compared to 63 percent of patients receiving placebo. Of the approximately one quarter of patients treated solely with SOLIRIS monotherapy, without receiving other immunosuppressive therapies, 100 percent were relapse free at 48 weeks compared to 61 percent in the placebo group. Sustained effects of SOLIRIS were observed through 144 weeks of treatment.\n\nThe safety profile of SOLIRIS was consistent with that seen for SOLIRIS in other clinical studies and real-world use in its three approved indications. The most common adverse events observed in the PREVENT study were upper respiratory tract infection (29 percent of patients in the SOLIRIS group vs. 13 percent in the placebo group), headache (23 vs. 23 percent), nasopharyngitis (21 vs. 19 percent) and nausea (17 vs. 26 percent). The serious adverse events that were reported for more than one patient in either group were pneumonia (three patients in the SOLIRIS group vs. one patient in the placebo group) and cellulitis, sepsis and urinary tract infection (two patients for each event in the SOLIRIS group vs. no patient in the placebo group). One patient receiving SOLIRIS and concomitant supportive IST died from a pulmonary empyema. The patient had an extensive history of pulmonary disease and was an active smoker. No cases of meningococcal infection were observed in the study.\n\nSOLIRIS was approved for the treatment of NMOSD in adult patients who are anti-AQP4 antibody-positive by the U.S. Food and Drug Administration (FDA) in June 2019 and by the European Commission (EC) in August 2019. SOLIRIS received Orphan Drug Designation (ODD) for the treatment of NMOSD in the U.S., EU and Japan.\n\nAbout NMOSD\nNMOSD is a rare and severe, autoimmune, inflammatory disorder that attacks the central nervous system (CNS), in which complement activation due to anti-aquaporin-4 (AQP4) antibodies plays a significant role in the disease process. Patients with NMOSD experience unpredictable attacks, also referred to as relapses, which can cause irreversible damage to the optic nerve and spinal cord and can lead to long-term disability. The most common symptoms of NMOSD are optic neuritis and transverse myelitis. Optic neuritis can cause visual problems including blindness; transverse myelitis can cause mobility problems including paralysis. The disease primarily affects women, often in the prime of their lives, with an average age of onset of 39 years. The prevalence of NMOSD may be more common and more severe in non-Caucasian populations worldwide.\n\nApproximately three quarters (73%) of all patients with NMOSD have AQP4 auto-antibodies. In patients with anti-AQP4 antibody-positive NMOSD, the body’s own immune system can turn against itself to produce auto-antibodies against AQP4, a protein on certain cells in the optic nerve, brain and spinal cord that are critical for the survival of nerve cells. The binding of these anti-AQP4 auto-antibodies activates the complement cascade, another part of the immune system. Complement activation by anti-AQP4 auto-antibodies can cause destruction of vital cells in the CNS, leading to demyelination and to the death of neurons, predominantly in the spinal cord and optic nerve.\n\nAbout SOLIRIS®\nSOLIRIS® (eculizumab) is a first-in-class complement inhibitor that works by inhibiting the C5 protein in the terminal part of the complement cascade, a part of the immune system. The terminal complement cascade, when activated in an uncontrolled manner, plays a role in severe rare and ultra-rare disorders. SOLIRIS, an intravenously administered therapy, is approved in the U.S., EU, Japan and other countries as a treatment for adult patients with PNH and for adults and children with aHUS. SOLIRIS is not indicated for the treatment of patients with Shiga-toxin E. coli-related hemolytic uremic syndrome (STEC-HUS). In the U.S., SOLIRIS is also approved for the treatment of generalized MG (gMG) in adult patients who are anti-AChR antibody-positive and for the treatment of neuromyelitis optica spectrum disorder (NMOSD) in adult patients who are anti-AQP4 antibody-positive. In the EU, SOLIRIS is approved as the first and only treatment of refractory gMG in adults who are anti-AChR antibody-positive and for the treatment of NMOSD in adult patients who are anti-aquaporin-4 (AQP4) antibody-positive with a relapsing course of the disease. In Japan SOLIRIS is approved for the treatment of patients with gMG who are anti-AChR antibody-positive and whose symptoms are difficult to control with high-dose intravenous immunoglobulin (IVIG) therapy or plasmapheresis (PLEX).\n\nImportant Safety Information\n\nINDICATIONS & IMPORTANT SAFETY INFORMATION FOR SOLIRIS® (eculizumab)\n\nINDICATIONS \n\nWhat is SOLIRIS?\nSOLIRIS is a prescription medicine called a monoclonal antibody. SOLIRIS is used to treat patients with a disease called Paroxysmal Nocturnal Hemoglobinuria (PNH). SOLIRIS is used to treat adults and children with a disease called atypical Hemolytic Uremic Syndrome (aHUS). SOLIRIS is not for use in treating people with Shiga toxin E. coli related hemolytic uremic syndrome (STEC-HUS). SOLIRIS is used to treat adults with a disease called generalized myasthenia gravis (gMG) who are anti-acetylcholine receptor (AChR) antibody positive. SOLIRIS is used to treat adults with a disease called neuromyelitis optica spectrum disorder (NMOSD) who are anti-aquaporin-4 (AQP4) antibody positive. It is not known if SOLIRIS is safe and effective in children with PNH, gMG, or NMOSD.\n\nIMPORTANT SAFETY INFORMATION \n\nSOLIRIS is a medicine that affects the immune system. SOLIRIS can lower the ability of the immune system to fight infections. SOLIRIS increases the chance of getting serious and life-threatening meningococcal infections. Meningococcal infections may quickly become life-threatening and cause death if not recognized and treated early.\n\nMeningococcal vaccines must be received at least two weeks before the first dose of SOLIRIS if one has not already had this vaccine. If one’s doctor decided that urgent treatment with SOLIRIS is needed, meningococcal vaccination should be administered as soon as possible. If one has not been vaccinated and SOLIRIS therapy must be initiated immediately, two weeks of antibiotics should also be administered with the vaccinations. If one had a meningococcal vaccine in the past, additional vaccination might be needed before starting SOLIRIS. Patients should ask their doctor if an additional meningococcal vaccination is needed. Meningococcal vaccines reduce the risk of meningococcal infection but do not prevent all meningococcal infections. Call one’s doctor or get emergency medical care right away if any of these signs and symptoms of a meningococcal infection occur: headache with nausea or vomiting, headache and fever, headache with a stiff neck or stiff back, fever, fever and a rash, confusion, muscle aches with flu-like symptoms, and eyes sensitive to light. One’s doctor will provide a Patient Safety Card about the risk of meningococcal infection. Carry the card at all times during treatment and for 3 months after the last SOLIRIS dose.\n\nSOLIRIS is only available through a program called the SOLIRIS REMS.\n\nSOLIRIS may also increase the risk of other types of serious infections. If one’s child is treated with SOLIRIS, make sure that the child receives vaccinations against Streptococcus pneumoniae and Haemophilus influenzae type b (Hib). Certain people may be at risk of serious infections with gonorrhea. Talk to the doctor about whether one is at risk for gonorrhea infection, about gonorrhea prevention, and regular testing. Certain fungal infections (Aspergillus) may also happen if one takes SOLIRIS and has a weak immune system or a low white blood cell count.\n\nDo not receive SOLIRIS if one has a meningococcal infection, or has not been vaccinated against meningitis infection unless one’s doctor decides that urgent treatment with SOLIRIS is needed.\n\nBefore one receives SOLIRIS, tell the doctor about all of the medical conditions, including if one: has an infection or fever, is pregnant or plans to become pregnant, and is breastfeeding or plans to breastfeed. It is not known if SOLIRIS will harm an unborn baby or if SOLIRIS passes into the breast milk.\n\nTell the doctor about all the medicines one takes, including prescription and over-the-counter medicines, vitamins, and herbal supplements. SOLIRIS and other medicines can affect each other, causing side effects. It is important that one: has all recommended vaccinations before starting SOLIRIS, receives 2 weeks of antibiotics if one immediately starts SOLIRIS, and stays up-to-date with all recommended vaccinations during treatment with SOLIRIS. Know the medications one takes and the vaccines one receives. Keep a list of them to show the doctor and pharmacist when one gets a new medicine.\n\nIf one has PNH, the doctor will need to monitor closely for at least 8 weeks after stopping SOLIRIS. Stopping treatment with SOLIRIS may cause breakdown of the red blood cells due to PNH. Symptoms or problems that can happen due to red blood cell breakdown include: drop in the number of the red blood cell count, drop in the platelet counts, confusion, kidney problems, blood clots, difficulty breathing, and chest pain. If one has aHUS, the doctor will need to monitor closely during and for at least 12 weeks after stopping treatment for signs of worsening aHUS symptoms or problems related to abnormal clotting (thrombotic microangiopathy). Symptoms or problems that can happen with abnormal clotting may include: stroke, confusion, seizure, chest pain (angina), difficulty breathing, kidney problems, swellings in arms or legs, and a drop in the platelet count. SOLIRIS can cause serious side effects including serious allergic reactions. Serious allergic reactions can happen during one’s SOLIRIS infusion. Tell the doctor or nurse right away if one gets any of these symptoms during the SOLIRIS infusion: chest pain, trouble breathing or shortness of breath, swelling of the face, tongue, or throat, and feeling faint or pass out. If one has an allergic reaction to SOLIRIS, the doctor may need to infuse SOLIRIS more slowly, or stop SOLIRIS.\n\nThe most common side effects in people with PNH treated with SOLIRIS include: headache, pain or swelling of the nose or throat (nasopharyngitis), back pain, and nausea. The most common side effects in people with aHUS treated with SOLIRIS include: headache, diarrhea, high blood pressure (hypertension), common cold (upper respiratory infection), stomach-area (abdominal) pain, vomiting, pain or swelling of the nose or throat (nasopharyngitis), low red blood cell count (anemia), cough, swelling of legs or feet (peripheral edema), nausea, urinary tract infections, and fever. The most common side effects in people with gMG treated with SOLIRIS include: muscle and joint (musculoskeletal) pain. The most common side effects in people with NMOSD treated with SOLIRIS include: common cold (upper respiratory infection); pain or swelling of the nose or throat (nasopharyngitis); diarrhea; back pain; dizziness; flu like symptoms (influenza) including fever, headache, tiredness, cough, sore throat, and body aches; joint pain (arthralgia); throat irritation (pharyngitis), and bruising (contusion).\n\nPlease see the accompanying full Prescribing Information and Medication Guide for SOLIRIS, including BOXED WARNING regarding serious and life-threatening meningococcal infections.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AChR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, metabolic disorders and cardiology. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nForward-Looking Statement\nThis press release contains forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Alexion, including statements related to: the potential benefits of SOLIRIS as a treatment and prevention of relapse in adult patients with anti-aquaporin-4 (AQP4) antibody-positive neuromyelitis optica spectrum disorder (NMOSD) and the potential impact of SOLIRIS on patients suffering from NMOSD; and that Soliris can help prevent future relapses. Forward-looking statements are subject to factors that may cause Alexion's results and plans to differ materially from those expected by these forward looking statements, including for example: the anticipated benefits of SOLIRIS for NMOSD patients may not be realized (and the results of the clinical trials may not be indicative of the results once approved for use in the European Union); results of clinical trials may not be sufficient to satisfy any other regulatory authority in order to approve SOLIRIS as a treatment for NMOSD (or they may request additional trials or additional information); results in clinical trials may not be indicative of results from later stage or larger clinical trials (or in broader patient populations); the possibility that results of clinical trials are not predictive of safety and efficacy and potency of our products (or we fail to adequately operate or manage our clinical trials) which could cause us to discontinue sales of the product (or halt trials, delay or prevent us from making regulatory approval filings or result in denial of approval of our product candidates); unexpected delays in clinical trials; unexpected concerns regarding products and product candidates that may arise from additional data or analysis obtained during clinical trials or obtained once used by patients following product approval; future product improvements may not be realized due to expense or feasibility or other factors; delays (expected or unexpected) in the time it takes regulatory agencies to review and make determinations on applications for the marketing approval of our products; inability to timely submit (or failure to submit) future applications for regulatory approval for our products and product candidates; inability to timely initiate (or failure to initiate) and complete future clinical trials due to safety issues, IRB decisions, CMC-related issues, expense or unfavorable results from earlier trials (among other reasons); our dependence on sales from Soliris, our principle product; future competition from biosimilars and novel products; decisions of regulatory authorities regarding the adequacy of our research, marketing approval or material limitations on the marketing of our products; delays or the inability to launch product candidates due to regulatory restrictions, anticipated expense or other matters; interruptions or failures in the manufacture and supply of our products and our product candidates; failure to satisfactorily address matters raised by the European Commission and other regulatory agencies regarding products and product candidates; uncertainty of long-term success in developing, licensing or acquiring other product candidates or additional indications for existing products; inability to complete acquisitions or grow the product pipeline through acquisitions (including due to failure to obtain antitrust approvals); the possibility that current rates of adoption of our products are not sustained; the adequacy of our pharmacovigilance and drug safety reporting processes; failure to protect and enforce our data, intellectual property and proprietary rights and the risks and uncertainties relating to intellectual property claims, lawsuits and challenges against us (including intellectual property lawsuits relating to Ultomiris brought by third parties and inter partes reviews of existing patents); the risk that third party payors (including governmental agencies) will not reimburse or continue to reimburse for the use of our products at acceptable rates or at all; failure to realize the benefits and potential of investments, collaborations, licenses and acquisitions; the possibility that expected tax benefits will not be realized; potential declines in sovereign credit ratings or sovereign defaults in countries where we sell our products; delay of collection or reduction in reimbursement due to adverse economic conditions or changes in government and private insurer regulations and approaches to reimbursement; uncertainties surrounding legal proceedings, company investigations and government investigations, including investigations of Alexion by the U.S. Securities and Exchange Commission (SEC) and U.S. Department of Justice; the risk that estimates regarding the number of patients with PNH, aHUS, gMG, NMOSD, HPP and LAL-D and other indications we are pursuing are inaccurate; the risks of changing foreign exchange rates; risks relating to the potential effects of the Company's restructuring; risks related to the acquisition of Syntimmune and other companies and co-development efforts; and a variety of other risks set forth from time to time in Alexion's filings with the SEC, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191122005192/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion to Present at the 2019 Stifel Healthcare Conference",
        "subtitle": "",
        "date": "Nov 13, 2019 6:30AM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals (Nasdaq:ALXN) today announced that management will present at the 2019 Stifel Healthcare Conference in New York, NY on Tuesday, November 19th, 2019 at 8:35 a.m. ET.\n\nAn audio webcast of the presentation will be available live. You can access the webcast at: http://ir.alexion.com. An archived version of the remarks will also be available through the Company’s website for a limited time following the conference.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191113005082/en/\nInvestors\nSusan Altschuller, Ph.D.\nVice President, Investor Relations\n(857) 338-8788\nSource: Alexion Pharmaceuticals"
    },
    {
        "title": "Alexion Announces Data Presentations at 61st American Society of Hematology Annual Meeting",
        "subtitle": "",
        "date": "Nov 6, 2019 10:30AM EST",
        "content": "\n- Accepted abstracts include presentations of ULTOMIRIS® (ravulizumab-cwvz) Phase 3 PNH data through 52 weeks -\n\n- ULTOMIRIS is the first and only long-acting C5 complement inhibitor, now available in the U.S. for the treatment of PNH and aHUS -\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced that five scientific data presentations from the company’s complement program will be showcased during the annual meeting of the American Society of Hematology (ASH) in Orlando, Fla., from Dec. 7 to 10, 2019. During the Congress, researchers will present new, long-term safety and efficacy findings through 52 weeks of treatment from the Phase 3 trial of ULTOMIRIS® (ravulizumab-cwvz) in adult patients with paroxysmal nocturnal hemoglobinuria (PNH) who had previously received eculizumab treatment, as well as data on breakthrough hemolysis in patients treated with ULTOMIRIS during the extension phase (weeks 27-52) of the two Phase 3 studies involving adult patients with PNH, which together comprise the largest PNH clinical program ever conducted. Collectively, the breadth of the data to be presented at ASH demonstrates the company’s continued commitment to improving the care for people living with rare, complement-mediated diseases.\n\nULTOMIRIS is approved in the United States (U.S.), Canada, European Union (EU) and Japan for the treatment of adult patients with PNH. ULTOMIRIS was also recently approved by the U.S. Food and Drug Administration for the treatment of atypical hemolytic uremic syndrome (aHUS) to inhibit complement-mediated thrombotic microangiopathy (TMA) in adult and pediatric (one month of age and older) patients. ULTOMIRIS is the first and only long-acting complement inhibitor that provides immediate and complete C5 inhibition sustained with every eight-week dosing in adult patients.\n\nThe accepted abstracts are listed below and are now available on the ASH website.\n\nParoxysmal Nocturnal Hemoglobinuria (PNH) Abstracts\nBreakthrough Hemolysis in Adult Patients with Paroxysmal Nocturnal Hemoglobinuria Treated with Ravulizumab: Results of a 52-Week Extension from Two Phase 3 Studies. Abstract ID#: 952 – Poster Presentation, Dec. 7, 2019, 5:30 – 7:30 p.m. EST, Hall B.\n\nOne-Year Efficacy and Safety from A Phase 3 Trial of Ravulizumab in Adult Patients with Paroxysmal Nocturnal Hemoglobinuria Receiving Prior Eculizumab Treatment. Abstract ID#: 2231 – Poster Presentation, Dec. 8, 2019, 6:00 – 8:00 p.m. EST, Hall B.\n\nComparison of Lost Productivity Due to Eculizumab and Ravulizumab Treatments for Paroxysmal Nocturnal Hemoglobinuria in France, Germany, Italy, Russia, Spain, the United Kingdom, and the United States. Available online.\n\nProphylactic Antibiotic Use and Risk of Meningococcal Infections in Patients with Paroxysmal Nocturnal Hemoglobinuria (PNH) Treated with Eculizumab Who Received Meningococcal Vaccination: Results from the International PNH Registry. Available online.\n\nAtypical Hemolytic Uremic Syndrome (aHUS) Abstracts\nDiscordance between Free C5 and CH50 Complement Assays in Measuring Complement C5 Inhibition in Patients with aHUS Treated with Ravulizumab. Abstract ID#: 1099 – Poster Presentation, Dec. 7, 2019, 5:30 – 7:30 p.m. EST, Hall B.\n\nAbout Paroxysmal Nocturnal Hemoglobinuria (PNH)\nParoxysmal nocturnal hemoglobinuria (PNH) is a serious ultra-rare blood disorder with potentially devastating consequences. It is characterized by the destruction of red blood cells, which is also referred to as hemolysis. PNH occurs when the complement system, a part of the body’s immune system, over-responds, leading the body to attack its own healthy cells. PNH often goes unrecognized, with delays in diagnosis from one to more than five years. Patients with PNH may experience a range of symptoms, such as fatigue, difficulty swallowing, shortness of breath, abdominal pain, erectile dysfunction, dark-colored urine and anemia. The most devastating consequence of chronic hemolysis is the formation of blood clots, which can occur in blood vessels throughout the body, damage vital organs, and potentially lead to premature death. PNH can strike men and women of all races, backgrounds and ages without warning, with an average age of onset in the early 30s. Patients with certain types of hemolytic anemia, bone marrow disorders and unexplained venous or arterial thrombosis are at increased risk of PNH.\n\nAbout Atypical Hemolytic Uremic Syndrome (aHUS)\nAtypical hemolytic uremic syndrome (aHUS) is an ultra-rare disease that affects both children and adults and can lead to potentially irreversible damage to kidneys and other vital organs, sudden or progressive kidney failure (requiring dialysis or transplant) and premature death. aHUS is characterized by inflammation and the formation of blood clots in small blood vessels throughout the body (thrombotic microangiopathy [TMA]) mediated by chronic, uncontrolled activation of the complement system, which is part of the body’s immune system. TMA consists of reduced platelet count (thrombocytopenia), hemolytic anemia (as a result of hemolysis [destruction of red blood cells]) and acute kidney injury (AKI). If left untreated, significant proportions of adults (46 percent) and children (16 percent) can progress to end-stage renal disease (ESRD) or die during first clinical manifestations of aHUS despite supportive care, including plasma exchange or plasma infusion (PE/PI). One year following clinical manifestations, 56 percent of adults and 29 percent of children can progress to ESRD or die, if left untreated. Early and careful diagnosis of aHUS is critical, as many coexisting diseases and events are known or suspected to activate the complement cascade, and as patients may not necessarily present with the classic TMA triad of thrombocytopenia, hemolytic anemia and renal impairment or may have less severe renal involvement. Available tests can help distinguish aHUS from other hemolytic diseases with similar symptoms such as HUS caused by Shiga toxin-producing Escherichia coli (STEC-HUS) and thrombotic thrombocytopenic purpura (TTP).\n\nAbout ULTOMIRIS® (ravulizumab-cwvz)\nULTOMIRIS (ravulizumab-cwvz) is the first and only long-acting C5 complement inhibitor. It is administered intravenously every eight weeks or every four weeks for pediatric patients less than 20 kg, following a loading dose. ULTOMIRIS works by inhibiting the C5 protein in the terminal complement cascade, a part of the body’s immune system. The terminal complement cascade, when activated in an uncontrolled manner, plays a role in severe ultra-rare disorders. ULTOMIRIS is approved in the U.S., Japan, and the EU as a treatment for adults with PNH and in the U.S. for aHUS to inhibit complement-mediated thrombotic microangiopathy (TMA) in adult and pediatric (one month of age and older) patients.\n\nYou can read more about the study results for this clinical program on www.alexion.com.\n\nAbout SOLIRIS® (eculizumab)\nSOLIRIS® (eculizumab) is a first-in-class complement inhibitor that works by inhibiting the C5 protein in the terminal part of the complement cascade, a part of the immune system. The terminal complement cascade, when activated in an uncontrolled manner, plays a role in severe rare and ultra-rare disorders. SOLIRIS, an intravenously administered therapy, is approved in the U.S., EU, Japan and other countries as a treatment for adult patients with PNH and for adults and children with aHUS. SOLIRIS is not indicated for the treatment of patients with Shiga-toxin E. coli-related hemolytic uremic syndrome (STEC-HUS). In the U.S., SOLIRIS is also approved for the treatment of generalized MG (gMG) in adult patients who are anti-AchR antibody-positive and for the treatment of neuromyelitis optica spectrum disorder (NMOSD) in adult patients who are anti-AQP4 antibody-positive, in the EU as the first and only treatment for refractory gMG in adults who are anti-AchR antibody-positive and for the treatment of NMOSD in adult patients who are anti-AQP4 antibody-positive with a relapsing course of the disease, and in Japan for the treatment of patients with gMG who are anti-AChR antibody-positive and whose symptoms are difficult to control with high-dose intravenous immunoglobulin (IVIG) therapy or plasmapheresis (PLEX).\n\nINDICATIONS & IMPORTANT SAFETY INFORMATION FOR ULTOMIRIS® (ravulizumab-cwvz) 300 mg / 30 mL injection for intravenous use\n\nINDICATIONS\nULTOMIRIS is a prescription medicine called a monoclonal antibody. ULTOMIRIS is used to treat adults with a disease called Paroxysmal Nocturnal Hemoglobinuria (PNH). ULTOMIRIS is used to treat adults and children 1 month of age and older with a disease called atypical Hemolytic Uremic Syndrome (aHUS). ULTOMIRIS is not used in treating people with Shiga toxin E. coli related hemolytic uremic syndrome (STEC-HUS). It is not known if ULTOMIRIS is safe and effective in children with PNH. It is not known if ULTOMIRIS is safe and effective in children younger than 1 month of age.\n\nIMPORTANT SAFETY INFORMATION\nULTOMIRIS is a medicine that affects the immune system. ULTOMIRIS can lower the ability of the immune system to fight infections. ULTOMIRIS increases the chance of getting serious and life-threatening meningococcal infections. Meningococcal infections may quickly become life-threatening and cause death if not recognized and treated early.\n\nMeningococcal vaccines must be received at least 2 weeks before the first dose of ULTOMIRIS if one has not already had this vaccine. If one’s doctor decided that urgent treatment with ULTOMIRIS is needed, meningococcal vaccination should be administered as soon as possible. If one has not been vaccinated and ULTOMIRIS therapy must be initiated immediately, 2 weeks of antibiotics should also be administered with the vaccinations. If one had a meningococcal vaccine in the past, additional vaccination might be needed before starting ULTOMIRIS. One’s doctor will decide if additional meningococcal vaccination is needed. Meningococcal vaccines reduce the risk of meningococcal infection but do not prevent all meningococcal infections. Call one’s doctor or get emergency medical care right away if any of these signs and symptoms of a meningococcal infection occur: headache with nausea or vomiting, headache and fever, headache with a stiff neck or stiff back, fever, fever and a rash, confusion, muscle aches with flu-like symptoms, and eyes sensitive to light. One’s doctor will give a Patient Safety Card about the risk of meningococcal infection. Carry the card at all times during treatment and for 8 months after the last ULTOMIRIS dose.\n\nULTOMIRIS is only available through a program called the ULTOMIRIS REMS.\n\nULTOMIRIS may also increase the risk of other types of serious infections. People who take ULTOMIRIS may have an increased risk of getting infections caused by Streptococcus pneumoniae and Haemophilus influenzae. Certain people may also have an increased risk of gonorrhea infection. To find out if one is at risk for gonorrhea infection, about gonorrhea prevention, and regular testing, talk to the doctor. Call the doctor right away if one has any new signs or symptoms of infection.\n\nDo not receive ULTOMIRIS if one has a meningococcal infection, or has not been vaccinated against meningococcal infection unless the doctor decides that urgent treatment with ULTOMIRIS is needed.\n\nBefore one receives ULTOMIRIS, tell the doctor about all of the medical conditions, including if one: has an infection or fever, are pregnant or plan to become pregnant, and are breastfeeding or plan to breastfeed. It is not known if ULTOMIRIS will harm an unborn baby. It is not known if ULTOMIRIS passes into the breast milk. One should not breastfeed during treatment and for 8 months after one’s final dose of ULTOMIRIS.\n\nTell the doctor about all the medicines one takes, including prescription and over-the-counter medicines, vitamins, and herbal supplements. ULTOMIRIS and other medicines can affect each other causing side effects. Know the medicines one takes and the vaccines one receives. Keep a list of them to show the doctor and pharmacist when one gets a new medicine.\n\nIf one has PNH and stops receiving ULTOMIRIS, the doctor will need to monitor closely for at least 16 weeks after one stops ULTOMIRIS. Stopping ULTOMIRIS may cause breakdown of the red blood cells due to PNH. Symptoms or problems that can happen due to red blood cell breakdown include: drop in the red blood cell count, tiredness, blood in the urine, stomach-area (abdomen) pain, shortness of breath, blood clots, trouble swallowing, and erectile dysfunction (ED) in males. If one has aHUS, the doctor will need to monitor closely for at least 12 months after stopping treatment for signs of worsening aHUS symptoms or problems related to a type of abnormal clotting and breakdown of the red blood cells called thrombotic microangiopathy (TMA). Symptoms or problems that can happen with TMA may include: confusion or loss of consciousness, seizures, chest pain (angina), difficulty breathing, and blood clots or stroke. If one misses an ULTOMIRIS infusion, call the doctor right away.\n\nULTOMIRIS can cause serious side effects including infusion reactions. Infusion reactions may happen during one’s ULTOMIRIS infusion. Symptoms of an infusion reaction with ULTOMIRIS may include lower back pain, pain with the infusion, feeling faint or discomfort in the arms or legs. Tell the doctor or nurse right away if these symptoms develop, or any other symptoms during the ULTOMIRIS infusion that may mean one is having a serious infusion reaction, including: chest pain, trouble breathing or shortness of breath, swelling of the face, tongue, or throat, and feel faint or pass out. One’s doctor will treat the symptoms as needed.\n\nThe most common side effects of ULTOMIRIS in people treated for PNH are upper respiratory infection and headache. The most common side effects of ULTOMIRIS in people with aHUS are upper respiratory infections, diarrhea, nausea, vomiting, headache, high blood pressure, and fever.\n\nPlease see the accompanying full Prescribing Information and Medication Guide for ULTOMIRIS, including Boxed WARNING regarding serious and life-threatening meningococcal infections/sepsis.\n\nINDICATIONS & IMPORTANT SAFETY INFORMATION FOR SOLIRIS® (eculizumab) 300 mg / 30 mL injection for intravenous use \n\nINDICATIONS\nWhat is SOLIRIS?\nSOLIRIS is a prescription medicine called a monoclonal antibody. SOLIRIS is used to treat patients with a disease called Paroxysmal Nocturnal Hemoglobinuria (PNH). SOLIRIS is used to treat adults and children with a disease called atypical Hemolytic Uremic Syndrome (aHUS). SOLIRIS is not for use in treating people with Shiga toxin E. coli related hemolytic uremic syndrome (STEC-HUS). SOLIRIS is used to treat adults with a disease called generalized myasthenia gravis (gMG) who are anti-acetylcholine receptor (AchR) antibody positive. SOLIRIS is used to treat adults with a disease called neuromyelitis optica spectrum disorder (NMOSD) who are anti-aquaporin-4 (AQP4) antibody positive. It is not known if SOLIRIS is safe and effective in children with PNH, gMG, or NMOSD.\n\nIMPORTANT SAFETY INFORMATION\nSOLIRIS is a medicine that affects the immune system. SOLIRIS can lower the ability of the immune system to fight infections. SOLIRIS increases the chance of getting serious and life-threatening meningococcal infections. Meningococcal infections may quickly become life-threatening and cause death if not recognized and treated early.\n\nMeningococcal vaccines must be received at least two weeks before the first dose of SOLIRIS if one has not already had this vaccine. If one’s doctor decided that urgent treatment with SOLIRIS is needed, meningococcal vaccination should be administered as soon as possible. If one has not been vaccinated and SOLIRIS therapy must be initiated immediately, two weeks of antibiotics should also be administered with the vaccinations. If one had a meningococcal vaccine in the past, additional vaccination might be needed before starting SOLIRIS. Patients should ask their doctor if an additional meningococcal vaccination is needed. Meningococcal vaccines reduce the risk of meningococcal infection but do not prevent all meningococcal infections. Call one’s doctor or get emergency medical care right away if any of these signs and symptoms of a meningococcal infection occur: headache with nausea or vomiting, headache and fever, headache with a stiff neck or stiff back, fever, fever and a rash, confusion, muscle aches with flu-like symptoms, and eyes sensitive to light. One’s doctor will provide a Patient Safety Card about the risk of meningococcal infection. Carry the card at all times during treatment and for 3 months after the last SOLIRIS dose.\n\nSOLIRIS is only available through a program called the SOLIRIS REMS.\n\nSOLIRIS may also increase the risk of other types of serious infections. If one’s child is treated with SOLIRIS, make sure that the child receives vaccinations against Streptococcus pneumoniae and Haemophilus influenzae type b (Hib). Certain people may be at risk of serious infections with gonorrhea. Talk to the doctor about whether one is at risk for gonorrhea infection, about gonorrhea prevention, and regular testing. Certain fungal infections (Aspergillus) may also happen if one takes SOLIRIS and has a weak immune system or a low white blood cell count.\n\nDo not receive SOLIRIS if one has a meningococcal infection, or has not been vaccinated against meningitis infection unless one’s doctor decides that urgent treatment with SOLIRIS is needed.\n\nBefore one receives SOLIRIS, tell the doctor about all of the medical conditions, including if one: has an infection or fever, is pregnant or plans to become pregnant, and is breastfeeding or plans to breastfeed. It is not known if SOLIRIS will harm an unborn baby or if SOLIRIS passes into the breast milk.\n\nTell the doctor about all the medicines one takes, including prescription and over-the-counter medicines, vitamins, and herbal supplements. SOLIRIS and other medicines can affect each other, causing side effects.\n\nIt is important that one: has all recommended vaccinations before starting SOLIRIS, receives 2 weeks of antibiotics if one immediately starts SOLIRIS, and stays up-to-date with all recommended vaccinations during treatment with SOLIRIS. Know the medications one takes and the vaccines one receives. Keep a list of them to show the doctor and pharmacist when one gets a new medicine.\n\nIf one has PNH, the doctor will need to monitor closely for at least 8 weeks after stopping SOLIRIS. Stopping treatment with SOLIRIS may cause breakdown of the red blood cells due to PNH. Symptoms or problems that can happen due to red blood cell breakdown include: drop in the number of the red blood cell count, drop in the platelet counts, confusion, kidney problems, blood clots, difficulty breathing, and chest pain. If one has aHUS, the doctor will need to monitor closely during and for at least 12 weeks after stopping treatment for signs of worsening aHUS symptoms or problems related to abnormal clotting (thrombotic microangiopathy). Symptoms or problems that can happen with abnormal clotting may include: stroke, confusion, seizure, chest pain (angina), difficulty breathing, kidney problems, swellings in arms or legs, and a drop in the platelet count.\n\nSOLIRIS can cause serious side effects including serious allergic reactions. Serious allergic reactions can happen during one’s SOLIRIS infusion. Tell the doctor or nurse right away if one gets any of these symptoms during the SOLIRIS infusion: chest pain, trouble breathing or shortness of breath, swelling of the face, tongue, or throat, and feeling faint or pass out. If one has an allergic reaction to SOLIRIS, the doctor may need to infuse SOLIRIS more slowly, or stop SOLIRIS.\n\nThe most common side effects in people with PNH treated with SOLIRIS include: headache, pain or swelling of the nose or throat (nasopharyngitis), back pain, and nausea. The most common side effects in people with aHUS treated with SOLIRIS include: headache, diarrhea, high blood pressure (hypertension), common cold (upper respiratory infection), stomach-area (abdominal) pain, vomiting, pain or swelling of the nose or throat (nasopharyngitis), low red blood cell count (anemia), cough, swelling of legs or feet (peripheral edema), nausea, urinary tract infections, and fever. The most common side effects in people with gMG treated with SOLIRIS include: muscle and joint (musculoskeletal) pain. The most common side effects in people with NMOSD treated with SOLIRIS include: common cold (upper respiratory infection); pain or swelling of the nose or throat (nasopharyngitis); diarrhea; back pain; dizziness; flu like symptoms (influenza) including fever, headache, tiredness, cough, sore throat, and body aches; joint pain (arthralgia); throat irritation (pharyngitis), and bruising (contusion).\n\nPlease see the accompanying full Prescribing Information and Medication Guide for SOLIRIS, including Boxed WARNING regarding serious and life-threatening meningococcal infections.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS) as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders. Alexion has been named to the Forbes’ list of the World’s Most Innovative Companies seven years in a row and is headquartered in Boston, Massachusetts’ Innovation District. The company also has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191106005676/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 23, 2019 6:30AM EDT",
        "content": "    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced financial results for the third quarter of 2019. Total revenues in the third quarter were $1,263.1 million, a 23 percent increase compared to the same period in 2018. The negative impact of foreign currency on total revenues year-over-year was less than 1 percent, or $2.5 million, inclusive of hedging activities. On a GAAP basis, diluted EPS in the quarter was $2.08, a 41 percent increase versus the prior year. Non-GAAP diluted EPS for the third quarter of 2019 was $2.79, a 38 percent increase versus the third quarter of 2018.\n\n\"With consistent and strong execution, we have delivered another record performance in the third quarter, building on our momentum from the first half of 2019. Our teams continued to demonstrate launch excellence across the globe, with very rapid starts to the German and Japanese ULTOMIRIS PNH launches, where conversion is progressing ahead of the best-in-class U.S. launch at the same time points, as well as a strong start to the SOLIRIS NMOSD launch in the U.S.,\" said Ludwig Hantson, Ph.D., Chief Executive Officer of Alexion. \"We also continued to expand our portfolio with two additional approvals - ULTOMIRIS for atypical HUS in the U.S. and SOLIRIS for NMOSD in the EU - and three new business development transactions that further diversify our pipeline, including an agreement to acquire Achillion. By continuing to deliver on the ambitious transformation plan we laid out two-and-a-half years ago, we have successfully established a strong foundation for the future and look forward to building on this progress as we advance our mission of delivering life-changing therapies to people with rare diseases.\"\n\nThird Quarter 2019 Financial Highlights\n\nResearch and Development\n\nPHASE 3\n\nPHASE 1/2\n\nPRE-CLINICAL\n\nShare Repurchase Authorization\n\nIn October 2019, the Board of Directors approved a new share repurchase authorization of $1 billion. The repurchase program does not have an expiration date and we are not obligated to acquire a particular number of shares of common stock.\n\n2019 Financial Guidance\n\nAlexion is increasing revenues and EPS guidance. Full guidance updates are outlined below.\n\nUpdated 2019 financial guidance assumes a GAAP effective tax rate of 5 to 6 percent and a non-GAAP effective tax rate of 13 to 14 percent for the year.\n\nUpdated guidance excludes the financial impact of the recently announced agreement to acquire Achillion as it is anticipated to close in the first half of 2020.\n\nAlexion’s financial guidance is based on current foreign exchange rates net of hedging activities and does not include the effect of acquisitions, license and collaboration agreements, intangible asset impairments, litigation charges, changes in fair value of contingent consideration or restructuring and related activity outside of the previously announced activities that may occur after the issuance of this press release.\n\nConference Call/Webcast Information:\n\nAlexion will host a conference call/audio webcast to discuss the third quarter 2019 results today at 8:00 a.m. Eastern Time. To participate in the call, dial 866-762-3111 (USA) or 210-874-7712 (International), conference ID 6281803 shortly before 8:00 a.m. Eastern Time. A replay of the call will be available for a limited period following the call. The audio webcast can be accessed on the Investor page of Alexion’s website at: http://ir.alexion.com.\n\nAbout Alexion\n\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology and metabolic disorders. Alexion has been named to the Forbes' list of the World’s Most Innovative Companies seven years in a row and is headquartered in Boston, Massachusetts’ Innovation District. The company also has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-E]\n\nForward-Looking Statement\n\nThis press release contains forward-looking statements, including statements related to: guidance regarding anticipated financial results for 2019 (and the assumptions related to such guidance); the strength of our business and continued growth; plans to expand the Company's pipeline; Company's goal of continuing to build on momentum as the year progresses; future plans for, and the timing for, the commencement of future clinical trials and the expected timing of the receipt of results of certain clinical trials and studies, including clinical programs for ULTOMIRIS in aHUS, NMOSD, HSCT-TMA, ALS, PPMS and a subcutaneous administration in PNH and aHUS and for ALXN1830 in WAIHA and gMG; potential benefits of current products and products under development and in clinical trials; plans for development programs with third parties including, Eidos, Affibody, Dicerna, Zealand, Stealth and Complement Pharma; the potential to treat a broad range of complement mediated diseases with the product to be developed with Zealand; the anticipated closings of the Achillion acquisition and the Immune Pharma asset acquisition; and Alexion's future clinical, regulatory, and commercial plans for ULTOMIRIS and other products and product candidates. Forward-looking statements are subject to factors that may cause Alexion's results and plans to differ materially from those forward-looking statements, including for example: our dependence on sales from our principal product (SOLIRIS); our ability to facilitate the timely conversion from SOLIRIS to ULTOMIRIS; payer, physician and patient acceptance of ULTOMIRIS as an alternative to SOLIRIS; appropriate pricing for ULTOMIRIS; future competition from biosimilars and novel products; decisions of regulatory authorities regarding the adequacy of our research, marketing approval or material limitations on the marketing of our products; delays or failure of product candidates to obtain regulatory approval; delays or the inability to launch product candidates due to regulatory restrictions, anticipated expense or other matters; interruptions or failures in the manufacture and supply of our products and our product candidates; failure to satisfactorily address matters raised by the FDA and other regulatory agencies; results in early stage clinical trials may not be indicative of full results or results from later stage or larger clinical trials (or broader patient populations) and do not ensure regulatory approval; the possibility that results of clinical trials are not predictive of safety and efficacy and potency of our products (or we fail to adequately operate or manage our clinical trials) which could cause us to halt trials, delay or prevent us from making regulatory approval filings or result in denial of approval of our product candidates; unexpected delays in clinical trials; unexpected concerns that may arise from additional data or analysis obtained during clinical trials; future product improvements may not be realized due to expense or feasibility or other factors; uncertainty of long-term success in developing, licensing or acquiring other product candidates or additional indications for existing products; inability to complete planned acquisitions due to failure of regulatory approval or material changes in target or otherwise; inability to complete acquisitions and investments due to increased competition for technology; the possibility that current rates of adoption of our products are not sustained; the adequacy of our pharmacovigilance and drug safety reporting processes; failure to protect and enforce our data, intellectual property and proprietary rights and the risks and uncertainties relating to intellectual property claims, lawsuits and challenges against us (including intellectual property lawsuits relating to ULTOMIRIS brought by third parties against Alexion and inter partes review petitions submitted by third parties); the risk that third party payors (including governmental agencies) will not reimburse or continue to reimburse for the use of our products at acceptable rates or at all; failure to realize the benefits and potential of investments, collaborations, licenses and acquisitions; the possibility that expected tax benefits will not be realized; assessment of impact of recent accounting pronouncements; potential declines in sovereign credit ratings or sovereign defaults in countries where we sell our products; delay of collection or reduction in reimbursement due to adverse economic conditions or changes in government and private insurer regulations and approaches to reimbursement; uncertainties surrounding legal proceedings, company investigations and government investigations, including investigations of Alexion by the U.S. Securities and Exchange Commission (SEC) and U.S. Department of Justice; the risk that estimates regarding the number of patients with PNH, aHUS, gMG, NMOSD, HPP and LAL-D and other future indications we are pursuing are inaccurate; the risks of changing foreign exchange rates; risks relating to the potential effects of the Company's restructuring; risks related to the acquisition of companies and co-development and collaboration efforts; and a variety of other risks set forth from time to time in Alexion's filings with the SEC, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the period ended June 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\n\nIn addition to financial information prepared in accordance with GAAP, this press release also contains non-GAAP financial measures that Alexion believes, when considered together with the GAAP information, provide investors and management with supplemental information relating to performance, trends and prospects that promote a more complete understanding of our operating results and financial position during different periods. The non-GAAP results exclude the impact of the following GAAP items (see reconciliation tables below for additional information): share-based compensation expense, fair value adjustment of inventory acquired, amortization of purchased intangible assets, changes in fair value of contingent consideration, restructuring and related expenses, upfront payments related to licenses and collaborations, acquired in-process research and development assets, impairment of intangible assets, change in value of strategic equity investments, litigation charges, gain or loss on sale of a business or asset and certain adjustments to income tax expense. These non-GAAP financial measures are not intended to be considered in isolation or as a substitute for, or superior to, the financial measures prepared and presented in accordance with GAAP, and should be reviewed in conjunction with the relevant GAAP financial measures. Please refer to the attached Reconciliations of GAAP to non-GAAP Financial Results and GAAP to non-GAAP 2019 Financial Guidance for explanations of the amounts adjusted to arrive at non-GAAP net income and non-GAAP earnings per share amounts for the three and nine month periods ended September 30, 2019 and 2018 and projected twelve months ending December 31, 2019.\n\n(Tables Follow)\n\n(1) The following table summarizes the total restructuring and related expenses recorded by type of activity and the classification within the Reconciliation of GAAP to non-GAAP Financial Results:\n\n(2) During the three months ended September 30, 2019, we recorded an upfront license payment of $30.1 million in connection with an agreement that we entered into with Eidos Therapeutics, Inc. (Eidos). During the nine months ended September 30, 2019, we recorded upfront license payments of $76.3 million in connection with agreements that we entered into with Eidos, Affibody AB and Zealand Pharma A/S.\n\n(3) In connection with the agreement of the final working capital adjustment for the Syntimmune acquisition, we recognized a benefit of $4.1 million associated with previously acquired in-process research and development in the second quarter of 2019.\n\n(4) Changes in the fair value of contingent consideration expense for the three and nine months ended September 30, 2019 include the impact of changes in the expected timing of achieving contingent milestones, in addition to the interest component related to the passage of time. For the three and nine months ended September 30, 2018, changes in the fair value of contingent consideration expense was primarily due to amending certain contingent milestone payments due under our prior merger agreement with Enobia Pharma Corp. in September 2018 as well as due to increases in the likelihood and anticipated timing of payments for contingent consideration.\n\n(5) During the three and nine months ended September 30, 2019, we recognized an unrealized gain of $12.0 million and $20.6 million, respectively, in investment income to adjust our strategic equity investments to fair value. The nine months ended September 30, 2018 included the recognition of an unrealized gain of $100.8 million on our investment in Moderna Therapeutics, Inc. following the completion of a new round of equity financing in the first quarter 2018.\n\n(6) Alexion's non-GAAP income tax expense for the three and nine months ended September 30, 2019 and 2018 excludes the tax effect of pre-tax adjustments to GAAP profit. Non-GAAP income tax expense for the three and nine months ended September 30, 2019 excludes a one-time tax expense of $10.2 million related to the July 1, 2019 integration of Wilson Therapeutics intellectual property into the Alexion corporate structure. Non-GAAP income tax expense for the nine months ended September 30, 2019 also excludes certain one-time tax benefits of $95.7 million and $30.3 million associated with a tax election made with respect to intellectual property of Wilson Therapeutics and a release of an existing valuation allowance, respectively. Non-GAAP income tax expense for the three and nine months ended September 30, 2018 excludes adjustments to provisional estimates of the impact of Tax Cuts and Jobs Act we recorded in fourth quarter 2017.\n\nAmounts may not foot due to rounding.\n\n(1) In February 2016, the Financial Accounting Standards Board issued a new standard that requires lessees to recognize leases on-balance sheet. We adopted the new standard on January 1, 2019 using the modified retrospective approach. The September 30, 2019 condensed consolidated balance sheet is presented under the new standard, while the December 31, 2018 condensed consolidated balance sheet is not adjusted and continues to be reported under the accounting standards in effect for that period. Upon adoption of the new lease standard, we derecognized $472.8 million of property, plant and equipment and other assets and $372.2 million of facility lease obligations associated with previously existing build-to-suit arrangements which resulted in a decrease of $90.3 million to retained earnings, net of tax. In addition, we capitalized $326.1 million and $255.3 million of right of use assets and lease liabilities, respectively, within our condensed consolidated balance sheet upon adoption.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191023005211/en/\nAlexion:\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "Alexion Receives FDA Approval for ULTOMIRIS® (ravulizumab-cwvz) for Atypical Hemolytic Uremic Syndrome (aHUS)",
        "subtitle": "",
        "date": "Oct 18, 2019 7:45PM EDT",
        "content": "\n- At 26 weeks, 54% of adults and 71% of children treated with ULTOMIRIS demonstrated Complete Thrombotic Microangiopathy (TMA) Response -\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced that the U.S. Food and Drug Administration (FDA) approved ULTOMIRIS® (ravulizumab-cwvz) for the treatment of atypical hemolytic uremic syndrome (aHUS) to inhibit complement-mediated thrombotic microangiopathy (TMA) for adult and pediatric (one month of age and older) patients. This is the first pediatric approval for ULTOMIRIS. Atypical HUS is an ultra-rare disease that can cause progressive injury to vital organs, primarily the kidneys, via damage to the walls of blood vessels and blood clots. Atypical HUS can cause sudden organ failure or a slow loss of function over time—potentially resulting in the need for a transplant, and in some cases, death.\n\n“The primary approach to treatment is to prevent the body from attacking itself, through the inhibition of uncontrolled complement activation, referred to as C5 inhibition,” said Spero Cataland, M.D., Professor of Clinical Internal Medicine, Wexner Medical Center, The Ohio State University College of Medicine. “Clinical study results showed adult and pediatric patients had complete C5 inhibition following the first dose of ULTOMIRIS. C5 inhibition was sustained over time with only six or seven infusions a year in adults—and that is important to consider for my patients.”\n\nAtypical HUS affects both adults and children and many patients present in critical condition, often requiring supportive care, including dialysis, in an intensive care unit. The prognosis of aHUS can be poor in many cases, so a timely and accurate diagnosis—in addition to treatment—is critical to improving patient outcomes.\n\n“The consequences of uncontrolled complement activation, like organ failure and potentially death, create significant challenges and uncertainty for people and families facing aHUS,” said John Orloff, M.D., Executive Vice President and Head of Research and Development at Alexion. “Based on the Phase 3 data, which demonstrated clinically meaningful benefits in people with aHUS, we believe ULTOMIRIS has the potential to become the new standard of care for this devastating disease.”\n\nThe FDA approval is based on data from two global, single-arm open-label studies of ULTOMIRIS – one in adults and one in children, referred to as pediatrics in the study – with aHUS. The pediatric study is ongoing and a total of 14 out of 16 children were enrolled and included in the interim analysis. Efficacy evaluation of Complete TMA Response was defined by hematologic normalization parameters (platelet count and LDH) and improved kidney function (as measured by ≥ 25 percent improvement in serum creatinine from baseline). In the initial 26-week treatment periods, 54 percent of adults and 71 percent (interim data) of children demonstrated Complete TMA Response. Treatment with ULTOMIRIS resulted in reduced thrombocytopenia (low blood platelet count) in 84 percent of adults and 93 percent of children, reduced hemolysis (the destruction of red blood cells) in 77 percent of adults and 86 percent of children, and improved kidney function in 59 percent of adults and 79 percent (interim data) of children (for patients on dialysis at enrollment, baseline was established after they had come off dialysis).\n\nThe most frequently observed adverse reactions reported in these studies were upper respiratory tract infection, diarrhea, nausea, vomiting, headache, hypertension and pyrexia. Serious meningococcal infections have occurred in patients treated with ULTOMIRIS. To minimize the risk for patients, specific risk-mitigation plans, including a REMS, have been established for ULTOMIRIS.\n\nRegulatory filings for marketing authorizations of ULTOMIRIS for the treatment of aHUS in the European Union (EU) and Japan are under review with regulators.\n\nAbout aHUS\nAtypical hemolytic uremic syndrome (aHUS) is an ultra-rare disease that affects both children and adults and can lead to potentially irreversible damage to kidneys and other vital organs, sudden or progressive kidney failure (requiring dialysis or transplant) and premature death. aHUS is characterized by inflammation and the formation of blood clots in small blood vessels throughout the body (thrombotic microangiopathy [TMA]) mediated by chronic, uncontrolled activation of the complement system, which is part of the body’s immune system. TMA consists of reduced platelet count (thrombocytopenia), hemolytic anemia (as a result of hemolysis [destruction of red blood cells]) and acute kidney injury (AKI). If left untreated, significant proportions of adults (46 percent) and children (16 percent) can progress to end-stage renal disease (ESRD) or die during first clinical manifestations of aHUS despite supportive care, including plasma exchange or plasma infusion (PE/PI). One year following clinical manifestations, 56 percent of adults and 29 percent of children can progress to ESRD or die, if left untreated. Early and careful diagnosis of aHUS is critical, as many coexisting diseases and events are known or suspected to activate the complement cascade, and as patients may not necessarily present with the classic TMA triad of thrombocytopenia, hemolytic anemia and renal impairment or may have less severe renal involvement. Available tests can help distinguish aHUS from other hemolytic diseases with similar symptoms such as HUS caused by Shiga toxin-producing Escherichia coli (STEC-HUS) and thrombotic thrombocytopenic purpura (TTP).\n\nAbout ULTOMIRIS\nULTOMIRIS (ravulizumab-cwvz) is the first and only long-acting C5 complement inhibitor. It is administered intravenously every eight weeks or every four weeks for pediatric patients less than 20 kg, following a loading dose. ULTOMIRIS works by inhibiting the C5 protein in the terminal complement cascade, a part of the body’s immune system. The terminal complement cascade, when activated in an uncontrolled manner, plays a role in severe ultra-rare disorders. ULTOMIRIS is approved in the U.S., Japan, and the EU as a treatment for adults with PNH and in the U.S. for aHUS to inhibit complement-mediated thrombotic microangiopathy (TMA) in adult and pediatric (one month of age and older) patients.\n\nYou can read more about the study results for this clinical program on alexion.com.\n\nINDICATIONS & IMPORTANT SAFETY INFORMATION FOR ULTOMIRIS (ravulizumab-cwvz) 300 mg / 30 mL injection for intravenous use \n\nINDICATIONS\nULTOMIRIS is a prescription medicine called a monoclonal antibody. ULTOMIRIS is used to treat adults with a disease called Paroxysmal Nocturnal Hemoglobinuria (PNH). ULTOMIRIS is used to treat adults and children 1 month of age and older with a disease called atypical Hemolytic Uremic Syndrome (aHUS). ULTOMIRIS is not used in treating people with Shiga toxin E. coli related hemolytic uremic syndrome (STEC-HUS). It is not known if ULTOMIRIS is safe and effective in children with PNH. It is not known if ULTOMIRIS is safe and effective in children younger than 1 month of age.\n\nIMPORTANT SAFETY INFORMATION\nULTOMIRIS is a medicine that affects the immune system. ULTOMIRIS can lower the ability of the immune system to fight infections. ULTOMIRIS increases the chance of getting serious and life-threatening meningococcal infections. Meningococcal infections may quickly become life-threatening and cause death if not recognized and treated early.\n\nMeningococcal vaccines must be received at least 2 weeks before the first dose of ULTOMIRIS if one has not already had this vaccine. If one’s doctor decided that urgent treatment with ULTOMIRIS is needed, meningococcal vaccination should be administered as soon as possible. If one has not been vaccinated and ULTOMIRIS therapy must be initiated immediately, 2 weeks of antibiotics should also be administered with the vaccinations. If one had a meningococcal vaccine in the past, additional vaccination might be needed before starting ULTOMIRIS. One’s doctor will decide if additional meningococcal vaccination is needed. Meningococcal vaccines reduce the risk of meningococcal infection but do not prevent all meningococcal infections. Call one’s doctor or get emergency medical care right away if any of these signs and symptoms of a meningococcal infection occur: headache with nausea or vomiting, headache and fever, headache with a stiff neck or stiff back, fever, fever and a rash, confusion, muscle aches with flu-like symptoms, and eyes sensitive to light. One’s doctor will give a Patient Safety Card about the risk of meningococcal infection. Carry the card at all times during treatment and for 8 months after your the ULTOMIRIS dose.\n\nULTOMIRIS is only available through a program called the ULTOMIRIS REMS.\n\nULTOMIRIS may also increase the risk of other types of serious infections. People who take ULTOMIRIS may have an increased risk of getting infections caused by Streptococcus pneumoniae and Haemophilus influenzae. Certain people may also have an increased risk of gonorrhea infection. To find out if one is at risk for gonorrhea infection, about gonorrhea prevention, and regular testing, talk to the doctor. Call the doctor right away if one has any new signs or symptoms of infection.\n\nDo not receive ULTOMIRIS if one has a meningococcal infection, or has not been vaccinated against meningococcal infection unless the doctor decides that urgent treatment with ULTOMIRIS is needed.\n\nBefore one receives ULTOMIRIS, tell the doctor about all of the medical conditions, including if one: has an infection or fever, are pregnant or plan to become pregnant, and are breastfeeding or plan to breastfeed. It is not known if ULTOMIRIS will harm an unborn baby. It is not known if ULTOMIRIS passes into the breast milk. One should not breastfeed during treatment and for 8 months after one’s final dose of ULTOMIRIS.\n\nTell the doctor about all the medicines one takes, including prescription and over-the-counter medicines, vitamins, and herbal supplements. ULTOMIRIS and other medicines can affect each other causing side effects. Know the medicines one takes and the vaccines one receives. Keep a list of them to show the doctor and pharmacist when one gets a new medicine.\n\nIf one has PNH and stops receiving ULTOMIRIS, the doctor will need to monitor closely for at least 16 weeks after one stops ULTOMIRIS. Stopping ULTOMIRIS may cause breakdown of the red blood cells due to PNH. Symptoms or problems that can happen due to red blood cell breakdown include: drop in the red blood cell count, tiredness, blood in the urine, stomach-area (abdomen) pain, shortness of breath, blood clots, trouble swallowing, and erectile dysfunction (ED) in males. If one has aHUS, the doctor will need to monitor closely for at least 12 months after stopping treatment for signs of worsening aHUS symptoms or problems related to a type of abnormal clotting and breakdown of the red blood cells called thrombotic microangiopathy (TMA). Symptoms or problems that can happen with TMA may include: confusion or loss of consciousness, seizures, chest pain (angina), difficulty breathing, and blood clots or stroke. If one misses an ULTOMIRIS infusion, call the doctor right away.\n\nULTOMIRIS can cause serious side effects including infusion reactions. Infusion reactions may happen during one’s ULTOMIRIS infusion. Symptoms of an infusion reaction with ULTOMIRIS may include lower back pain, pain with the infusion, feeling faint or discomfort in the arms or legs. Tell the doctor or nurse right away if these symptoms develop, or any other symptoms during the ULTOMIRIS infusion that may mean one is having a serious infusion reaction, including: chest pain, trouble breathing or shortness of breath, swelling of the face, tongue, or throat, and feel faint or pass out. One’s doctor will treat the symptoms as needed.\n\nThe most common side effects of ULTOMIRIS in people treated for PNH are upper respiratory infection and headache. The most common side effects of ULTOMIRIS in people with aHUS are upper respiratory infections, diarrhea, nausea, vomiting, headache, high blood pressure, and fever.\n\nPlease see the accompanying full Prescribing Information and Medication Guide for ULTOMIRIS, including Boxed WARNING regarding serious and life-threatening meningococcal infections/sepsis.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS) as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders. Alexion has been named to the Forbes’ list of the World’s Most Innovative Companies seven years in a row and is headquartered in Boston, Massachusetts’ Innovation District. The company also has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nFor patient or advocacy inquiries please contact patientadvocacy@alexion.com.\n\nForward-Looking Statement\nThis press release contains forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Alexion, including statements related to: the potential benefits of ULTOMIRIS as a treatment for patients with aHUS, the impact of aHUS on patients, the benefits of diagnosing aHUS in patients; the timing for regulatory filings for marketing authorizations of ULTOMIRIS for the treatment of aHUS in the EU and Japan; and that ULTOMIRIS can provide benefits for patients with aHUS. Forward-looking statements are subject to factors that may cause Alexion's results and plans to differ materially from those expected by these forward looking statements, including for example: the anticipated benefits of ULTOMIRIS for aHUS patients may not be realized; results of clinical trials may not be sufficient to satisfy any other regulatory authority in order to approve ULTOMIRIS as a treatment for aHUS or TMA (or they may request additional trials or additional information); results in clinical trials may not be indicative of results from later stage or larger clinical trials (or in broader patient populations once the product is approved for use by regulatory agencies); the possibility that results of clinical trials are not predictive of safety and efficacy and potency of our products (or we fail to adequately operate or manage our clinical trials) which could cause us to discontinue sales of the product (or halt trials, delay or prevent us from making regulatory approval filings or result in denial of approval of our product candidates); unexpected delays in clinical trials; unexpected concerns regarding products and product candidates that may arise from additional data or analysis obtained during clinical trials or obtained once used by patients following product approval; future product improvements may not be realized due to expense or feasibility or other factors; delays (expected or unexpected) in the time it takes regulatory agencies to review and make determinations on applications for the marketing approval of our products; inability to timely submit (or failure to submit) future applications for regulatory approval for our products and product candidates; inability to timely initiate (or failure to initiate) and complete future clinical trials due to safety issues, IRB decisions, CMC-related issues, expense or unfavorable results from earlier trials (among other reasons); our dependence on sales from our principal product (SOLIRIS); future competition from biosimilars and novel products; decisions of regulatory authorities regarding the adequacy of our research, marketing approval or material limitations on the marketing of our products; delays or failure of product candidates to obtain regulatory approval; delays or the inability to launch product candidates due to regulatory restrictions, anticipated expense or other matters; interruptions or failures in the manufacture and supply of our products and our product candidates; failure to satisfactorily address matters raised by regulatory agencies regarding products and product candidates; uncertainty of long-term success in developing, licensing or acquiring other product candidates or additional indications for existing products; inability to complete acquisitions or grow the product pipeline through acquisitions (including due to failure to obtain antitrust approvals); the possibility that current rates of adoption of our products are not sustained; the adequacy of our pharmacovigilance and drug safety reporting processes; failure to protect and enforce our data, intellectual property and proprietary rights and the risks and uncertainties relating to intellectual property claims, lawsuits and challenges against us (including intellectual property lawsuits relating to ULTOMIRIS brought by third parties and inter partes review petitions submitted by third parties); the risk that third party payors (including governmental agencies) will not reimburse or continue to reimburse for the use of our products at acceptable rates or at all; failure to realize the benefits and potential of investments, collaborations, licenses and acquisitions; the possibility that expected tax benefits will not be realized; potential declines in sovereign credit ratings or sovereign defaults in countries where we sell our products; delay of collection or reduction in reimbursement due to adverse economic conditions or changes in government and private insurer regulations and approaches to reimbursement; uncertainties surrounding legal proceedings, company investigations and government investigations, including investigations of Alexion by the U.S. Securities and Exchange Commission (SEC) and U.S. Department of Justice; the risk that estimates regarding the number of patients with PNH, aHUS, gMG, NMOSD, HPP and LAL-D and other indications we are pursuing are inaccurate; the risks of changing foreign exchange rates; risks relating to the potential effects of the Company's restructuring; risks related to the acquisition of Syntimmune and other companies and co-development efforts; and a variety of other risks set forth from time to time in Alexion's filings with the SEC, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the quarter ended June 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191018005600/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\n\nInvestors\nSusan Altschuller, Ph.D., 857-338-8788\nVice President, Investor Relations\nSource: Alexion Pharmaceuticals, Inc."
    },
    {
        "title": "SHAREHOLDER ALERT: WeissLaw LLP Investigates Achillion Pharmaceuticals, Inc.",
        "subtitle": "",
        "date": "Oct 18, 2019 4:50PM EDT",
        "content": "NEW YORK, Oct. 18, 2019 /PRNewswire/ -- WeissLaw LLP is investigating possible breaches of fiduciary duty and other violations of law by the Board of Achillion Pharmaceuticals, Inc. (\"ACHN\" or the \"Company\") (NASDAQ: ACHN) in connection with the proposed acquisition of the Company by Alexion Pharmaceuticals, Inc. (\"ALXN\") (NASDAQ: ALXN).  Under the terms of the acquisition agreement, ACHN shareholders will receive $6.30 cash for each ACHN share they own.  If you own ACHN shares and wish to discuss this investigation or have any questions concerning this notice or your rights or interests, visit our website:http://www.weisslawllp.com/achillion-pharmaceuticals-inc/ Or please contact:Joshua Rubin, Esq.WeissLaw LLP1500 Broadway, 16th FloorNew York, NY  10036(212) 682-3025(888) 593-4771stockinfo@weisslawllp.com WeissLaw is investigating whether ACHN's Board acted to maximize shareholder value prior to entering into the acquisition agreement.  Notably, the Company currently has two clinical stage treatments in development, including Danicopan, a lead drug candidate which has been designated as a Breakthrough Therapy by the U.S. Food and Drug Administration (\"FDA\") for treatment of patients with a rare blood disorder called paroxysmal nocturnal hemoglobinuria, or PNH.  Receiving Breakthrough Therapy designation from the FDA indicates preliminary clinical evidence has demonstrated the drug may provide substantial improvement on at least one clinically significant endpoint compared with currently available therapy.Given these facts, WeissLaw is concerned whether the proposed acquisition undervalues the Company, and whether all material information related to the proposed acquisition is fully and fairly disclosed.  WeissLaw LLP has litigated hundreds of stockholder class and derivative actions for violations of corporate and fiduciary duties.  We have recovered over a billion dollars for defrauded clients and obtained important corporate governance relief in many of these cases.  If you have information or would like legal advice concerning possible corporate wrongdoing (including insider trading, waste of corporate assets, accounting fraud, or materially misleading information), consumer fraud (including false advertising, defective products, or other deceptive business practices), or anti-trust violations, please email us at stockinfo@weisslawllp.com. View original content to download multimedia:http://www.prnewswire.com/news-releases/shareholder-alert-weisslaw-llp-investigates-achillion-pharmaceuticals-inc-300941386.htmlSOURCE  WeissLaw LLP"
    },
    {
        "title": "Achillion (ACHN) Alert: Johnson Fistel Investigates Proposed Sale of Achillion Pharmaceuticals; Are Shareholders Getting a Fair Deal?",
        "subtitle": "",
        "date": "Oct 16, 2019 8:50AM EDT",
        "content": "SAN DIEGO, Oct. 16, 2019 /PRNewswire/ -- Shareholder rights law firm Johnson Fistel, LLP has launched an investigation into whether the board members of Achillion Pharmaceuticals, Inc. (NASDAQ: ACHN) (\"Achillion\") breached their fiduciary duties in connection with the proposed sale of the Company to Alexion Pharmaceuticals, Inc. (NASDAQ: ALXN) (\"Alexion\").On October 16, 2019, Achillion announced that it had signed a definitive merger agreement with Alexion. Under terms of the deal, Alexion will pay $6.30 for each Achillion share outstanding. The deal also includes an additional payment for Achillion shares in the form of contingent value rights (CVRs) to be paid if certain clinical and regulatory milestones are achieved. The CVRs include $1 a share for U.S. Food and Drug Administration approval of danicopan and $1 a share for ACH-5228 phase 3 initiation. The investigation concerns whether the Achillion board failed to satisfy its duties to the Company shareholders, including whether the board adequately pursued alternatives to the acquisition and whether the board obtained the best price possible for Achillion shares of common stock. Nationally recognized Johnson Fistel is investigating whether the proposed deal represents adequate consideration, especially given one Wall Street analyst has an $11.00 price target on the stock and the Company's strong balance sheet, which includes over $200 million in cash. If you are a shareholder of Achillion and believe the proposed buyout price is too low or you're interested in learning more about the investigation or your legal rights and remedies, please contact lead analyst Jim Baker (jimb@johnsonfistel.com) at 619-814-4471. If emailing, please include a phone number.Additionally, you can [Click here to join this action]. There is no cost or obligation to you.About Johnson Fistel, LLP:Johnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York, and Georgia. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits. For more information about the firm and its attorneys, please visit https://www.johnsonfistel.com. Attorney advertising. Past results do not guarantee future outcomes.Contact:Johnson Fistel, LLPJim Baker, 619-814-4471jimb@johnsonfistel.com[Click here to join this action] View original content:http://www.prnewswire.com/news-releases/achillion-achn-alert-johnson-fistel-investigates-proposed-sale-of-achillion-pharmaceuticals-are-shareholders-getting-a-fair-deal-300939631.htmlSOURCE  Johnson Fistel, LLP"
    },
    {
        "title": "Alexion Announces Appointment of Tanisha Carino, Ph.D., as Chief Corporate Affairs Officer",
        "subtitle": "",
        "date": "Oct 10, 2019 4:01PM EDT",
        "content": "\n- Dr. Carino to head up newly integrated Corporate Affairs function including global government affairs, public policy and communications -\n    BOSTON--(BUSINESS WIRE)--\nAlexion Pharmaceuticals, Inc. (NASDAQ:ALXN) today announced the appointment of Tanisha Carino, Ph.D., as Executive Vice President and the company’s first Chief Corporate Affairs Officer. Dr. Carino will join Alexion on November 4, 2019 and will serve on the company’s Executive Committee. In her role, Dr. Carino will oversee the creation of a newly integrated Corporate Affairs function that encompasses Alexion’s corporate affairs activities, including high-level relations with domestic and international governments and global communications.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191010005839/en/(Photo: Business Wire)\n“I am delighted that Tanisha will be joining Alexion and our Executive Committee. Her extensive experience advocating for the development of medicines for rare diseases and the rare disease community will be instrumental as Alexion enters our next chapter, with our significantly expanded and diversified pipeline that provides the opportunity to serve more patients than ever before,” said Ludwig Hantson, Ph.D., Chief Executive Officer at Alexion. “The creation of this new role represents our continued commitment to elevating our leadership in rare disease and our desire for enhanced engagement with governments and other stakeholders to support the role transformative science brings to people affected by rare diseases.”\n\n“For nearly 30 years, Alexion has been at the forefront of developing medicines for rare diseases,” said Dr. Carino. “I am excited to join a company with such an unwavering focus on patients and look forward to helping advance the company’s mission of transforming the lives of people with rare diseases.”\n\nThroughout her distinguished career, Dr. Carino has been at the forefront of collaborative efforts to promote policies, research, and business practices supporting the fight against disease and improving the lives of patients. Prior to joining Alexion, Dr. Carino served as the Executive Director of FasterCures, a Center of the Milken Institute, whose mission is to put patients in the center of the healthcare system, break down unnecessary barriers to innovation, and accelerate biomedical research. Prior to leading FasterCures, Dr. Carino was an executive at GlaxoSmithKline where she led the United States policy function and prior to that, spent over a decade with Avalere Health, a strategic advisory services organization, where she worked with senior leaders of life sciences companies to maximize opportunities and mitigate challenges related to biomedical research and patient access. Dr. Carino is a Fulbright Fellow, earned her Ph.D. in health policy from Johns Hopkins University, and is associate faculty at the Johns Hopkins Bloomberg School of Public Health.\n\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) as well as the first and only approved complement inhibitor to treat atypical hemolytic uremic syndrome (aHUS), anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing several mid-to-late-stage therapies, including a second complement inhibitor, a copper-binding agent for Wilson disease and an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases as well as several early-stage therapies, including one for light chain (AL) amyloidosis and a second anti-FcRn therapy. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders. Alexion has been named to the Forbes’ list of the World’s Most Innovative Companies seven years in a row and is headquartered in Boston, Massachusetts’ Innovation District. The company also has offices around the globe and serves patients in more than 50 countries. This press release and further information about Alexion can be found at: www.alexion.com.\n\n[ALXN-G]\n\nForward-Looking Statement\nThis press release contains forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Alexion, including statements related to: Alexion’s commitment to elevating its leadership in rare disease and its desire for enhanced partnership with governments and other stakeholders to support the role transformative science brings to people affected by rare diseases; Alexion’s significantly expanded and diversified pipeline provides the opportunity to serve more patients than ever before; and Alexion’s ambition to be a global leader. Forward-looking statements are subject to factors that may cause Alexion's results and plans to differ materially from those expected by these forward looking statements, including for example: Alexion may be unable to elevate its leadership in rare disease due to, among other reasons, the continued reliance on complement therapies (Soliris and Ultomiris) for much of its revenues and the inability to expand its product pipeline or obtain regulatory approval and commercialize products currently in the pipeline; Alexion’s plan for enhanced engagement with governments and other stakeholders to support the role transformative science brings to people affected by rare diseases may not be realized as a result of, among other factors, government policies regarding health care and reimbursement are shifting; ; the anticipated benefits of our products and product candidates may not be realized; the possibility that results of clinical trials are not predictive of safety and efficacy and potency of our products (or we fail to adequately operate or manage our clinical trials) which could cause us to discontinue sales of the product (or halt trials, delay or prevent us from making regulatory approval filings or result in denial of approval of our product candidates); unexpected delays in clinical trials; unexpected concerns regarding products and product candidates that may arise from additional data or analysis obtained during clinical trials or obtained once used by patients following product approval; future product improvements may not be realized due to expense or feasibility or other factors; inability to timely submit (or failure to submit) future applications for regulatory approval for our products and product candidates; inability to timely initiate (or failure to initiate) and complete future clinical trials due to safety issues, IRB decisions, CMC-related issues, expense or unfavorable results from earlier trials (among other reasons); future competition from biosimilars and novel products; decisions of regulatory authorities regarding the adequacy of our research, marketing approval or material limitations on the marketing of our products; delays or failure of product candidates to obtain regulatory approval; delays or the inability to launch product candidates due to regulatory restrictions, anticipated expense or other matters; interruptions or failures in the manufacture and supply of our products and our product candidates; failure to satisfactorily address matters raised by regulatory agencies regarding products and product candidates; uncertainty of long-term success in developing, licensing or acquiring other product candidates or additional indications for existing products; inability to complete acquisitions or grow the product pipeline through acquisitions (including due to failure to obtain antitrust approvals); the possibility that current rates of adoption of our products are not sustained; the adequacy of our pharmacovigilance and drug safety reporting processes; failure to protect and enforce our data, intellectual property and proprietary rights and the risks and uncertainties relating to intellectual property claims, lawsuits and challenges against us (including intellectual property lawsuits relating to ULTOMIRIS brought by third parties and inter partes review petitions initiated by third parties); the risk that third party payors (including governmental agencies) will not reimburse or continue to reimburse for the use of our products at acceptable rates or at all; failure to realize the benefits and potential of investments, collaborations, licenses and acquisitions; the possibility that expected tax benefits will not be realized; delay of collection or reduction in reimbursement due to adverse economic conditions or changes in government and private insurer regulations and approaches to reimbursement; uncertainties surrounding legal proceedings, company investigations and government investigations, including investigations of Alexion by the U.S. Securities and Exchange Commission (SEC) and U.S. Department of Justice; the risk that estimates regarding the number of patients with PNH, aHUS, gMG, NMOSD, HPP and LAL-D and other indications we are pursuing are inaccurate; the risks of changing foreign exchange rates; risks relating to the potential effects of the Company's restructuring; risks related to the acquisition of Syntimmune and other companies and co-development efforts; and a variety of other risks set forth from time to time in Alexion's filings with the SEC, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the quarter ended June 30, 2019 and in our other filings with the SEC. Alexion disclaims any obligation to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005839/en/\nMedia\nMegan Goulart, 857-338-8634\nSenior Director, Corporate Communications\nSource: Alexion Pharmaceuticals, Inc."
    }
]