[
    {
        "title": "Applied Materials Receives Intel’s Preferred Quality Supplier Award",
        "subtitle": "",
        "date": "Mar 5, 2020 11:05AM EST",
        "content": "SANTA CLARA, Calif., March  05, 2020  (GLOBE NEWSWIRE) -- Applied Materials, Inc. has been recognized by Intel as a recipient of a 2019 Preferred Quality Supplier (PQS) Award. The PQS Award recognizes companies like Applied that Intel believes have relentlessly pursued excellence and conducted business with resolute professionalism.“I am pleased to recognize the winners of Intel’s Preferred Quality Supplier Award for 2019,” said Dr. Randhir Thakur, head of Global Supply Chain at Intel. “The commitment to continuous improvement and the rich collaboration with these suppliers remain crucial factors in enabling Intel to bring exciting products to market and meet the needs of our customers.”To qualify for PQS status, suppliers must exceed high expectations and uncompromising performance goals while scoring at least 80 percent on an integrated report card that assesses performance throughout the year. Suppliers must also achieve 80 percent or greater on a challenging continuous improvement plan and demonstrate solid quality and business systems.Additional information is available at the Intel Newsroom.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977Intel and the Intel logo are trademarks of Intel Corporation in the United States and other countries.*Other names and brands may be claimed as the property of others.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/2b083b08-fee2-46c5-b6b2-04918b440c12The photo is also available at Newscom, www.newscom.com, and via AP PhotoExpress.  "
    },
    {
        "title": "Applied Materials Announces First Quarter 2020 Results",
        "subtitle": "",
        "date": "Feb 12, 2020 4:01PM EST",
        "content": "SANTA CLARA, Calif., Feb.  12, 2020  (GLOBE NEWSWIRE) -- Applied Materials, Inc. (NASDAQ: AMAT) today reported results for its first quarter ended Jan. 26, 2020.First Quarter ResultsApplied generated revenue of $4.16 billion. On a GAAP basis, the company recorded gross margin of 44.6 percent, operating income of $1.04 billion or 25.0 percent of net sales, and earnings per share (EPS) of $0.96.On a non-GAAP adjusted basis, the company reported gross margin of 44.9 percent, operating income of $1.07 billion or 25.7 percent of net sales, and EPS of $0.98.The company returned $392 million to shareholders including $200 million in share repurchases and dividends of $192 million.“Applied Materials’ first quarter earnings exceeded the top-end of our guidance, giving us great momentum entering 2020,” said Gary Dickerson, president and CEO. “We believe we can deliver strong double-digit growth in our semiconductor business this year as our unique solutions accelerate our customers’ success in the AI-Big Data era.”Quarterly Results SummaryA reconciliation of the GAAP and non-GAAP adjusted results is provided in the financial tables included in this release. See also “Use of Non-GAAP Adjusted Financial Measures” section.Business OutlookIn the second quarter of fiscal 2020, Applied expects net sales to be approximately $4.34 billion, plus or minus $200 million. Non-GAAP adjusted diluted EPS is expected to be in the range of $0.98 to $1.10.This outlook for non-GAAP adjusted diluted EPS excludes known charges related to completed acquisitions of $0.01 per share, includes the normalized tax benefit of share-based compensation of $0.01 per share and net income tax benefit related to intra-entity intangible asset transfers of $0.03 per share, but does not reflect any items that are unknown at this time, such as any additional charges related to acquisitions or other non-operational or unusual items, as well as other tax related items, which we are not able to predict without unreasonable efforts due to their inherent uncertainty.First Quarter Reportable Segment InformationUse of Non-GAAP Adjusted Financial MeasuresApplied provides investors with certain non-GAAP adjusted financial measures, which are adjusted for the impact of certain costs, expenses, gains and losses, including certain items related to mergers and acquisitions; restructuring charges and any associated adjustments; impairments of assets, or investments; gain or loss on sale of strategic investments; tax effect of share-based compensation; certain income tax items and other discrete adjustments. Additionally, non-GAAP results exclude estimated discrete income tax expense items associated with changes to U.S. tax legislation. Reconciliations of these non-GAAP measures to the most directly comparable financial measures calculated and presented in accordance with GAAP are provided in the financial tables included in this release.Management uses these non-GAAP adjusted financial measures to evaluate the company’s operating and financial performance and for planning purposes, and as performance measures in its executive compensation program. Applied believes these measures enhance an overall understanding of its performance and investors’ ability to review the company’s business from the same perspective as the company’s management, and facilitate comparisons of this period’s results with prior periods on a consistent basis by excluding items that management does not believe are indicative of Applied's ongoing operating performance. There are limitations in using non-GAAP financial measures because the non-GAAP financial measures are not prepared in accordance with generally accepted accounting principles, may be different from non-GAAP financial measures used by other companies, and may exclude certain items that may have a material impact upon our reported financial results. The presentation of this additional information is not meant to be considered in isolation or as a substitute for the directly comparable financial measures prepared in accordance with GAAP.Webcast InformationApplied Materials will discuss these results during an earnings call that begins at 1:30 p.m. Pacific Time today. A live webcast will be available at www.appliedmaterials.com. A replay will be available on the website beginning at 5:00 p.m. Pacific Time today.Forward-Looking StatementsThis press release contains forward-looking statements, including those regarding anticipated growth and trends in our businesses and markets, industry outlooks and demand drivers, technology transitions, our business and financial performance and market share positions, our capital allocation, our investment and growth strategies, our development of new products and technologies, our business outlook for the second quarter of fiscal 2020 and beyond, the impact of the coronavirus outbreak on our operations and financial results; and other statements that are not historical facts. These statements and their underlying assumptions are subject to risks and uncertainties and are not guarantees of future performance. Factors that could cause actual results to differ materially from those expressed or implied by such statements include, without limitation: the level of demand for our products; global economic and industry conditions; the effects of regional or global health epidemics; global trade issues and changes in trade policies; consumer demand for electronic products; the demand for semiconductors; customers’ technology and capacity requirements; the introduction of new and innovative technologies, and the timing of technology transitions; our ability to develop, deliver and support new products and technologies; the concentrated nature of our customer base;  changes in income tax laws; our ability to expand our current markets, increase market share and develop new markets; market acceptance of existing and newly developed products; our ability to obtain and protect intellectual property rights in key technologies; our ability to achieve the objectives of operational and strategic initiatives, align our resources and cost structure with business conditions, and attract, motivate and retain key employees; the variability of operating expenses and results among products and segments, and our ability to accurately forecast future results, market conditions, customer requirements and business needs;  and other risks and uncertainties described in our SEC filings, including our recent Forms 10-K and 8-K. All forward-looking statements are based on management’s current estimates, projections and assumptions, and we assume no obligation to update them.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977 APPLIED MATERIALS, INC.UNAUDITED CONSOLIDATED CONDENSED STATEMENTS OF OPERATIONSAPPLIED MATERIALS, INC.UNAUDITED CONSOLIDATED CONDENSED BALANCE SHEETSAPPLIED MATERIALS, INC.UNAUDITED CONSOLIDATED CONDENSED STATEMENTS OF CASH FLOWSAPPLIED MATERIALS, INC.UNAUDITED SUPPLEMENTAL INFORMATION  APPLIED MATERIALS, INC.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED RESULTSAPPLIED MATERIALS, INC.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED RESULTSAPPLIED MATERIALS, INC.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED RESULTSNote: The reconciliation of GAAP and non-GAAP adjusted segment results above does not include certain revenues, costs of products sold and operating expenses that are reported within corporate and other and included in consolidated operating income.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED EFFECTIVE INCOME TAX RATE"
    },
    {
        "title": "Applied Materials to Participate in Goldman Sachs Technology and Internet Conference",
        "subtitle": "",
        "date": "Feb 6, 2020 7:30AM EST",
        "content": "SANTA CLARA, Calif., Feb.  06, 2020  (GLOBE NEWSWIRE) -- Applied Materials, Inc. announced today that Gary Dickerson, President and CEO, and Dan Durn, Senior Vice President and CFO, will participate in a fireside chat at the Goldman Sachs Technology and Internet Conference in San Francisco on Thursday, Feb. 13 beginning at 8 a.m. PT / 11 a.m. ET.A live audio webcast of the session will be available on the Applied Materials website at http://www.appliedmaterials.com/company/investor-relations, and a replay will be available on the same day.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977"
    },
    {
        "title": "Applied Materials Announces Q1 FY2020 Earnings Webcast",
        "subtitle": "",
        "date": "Jan 31, 2020 7:30AM EST",
        "content": "SANTA CLARA, Calif., Jan.  31, 2020  (GLOBE NEWSWIRE) -- Applied Materials, Inc. will hold a webcast to discuss its first quarter of fiscal 2020 financial results, along with its business outlook, on Wednesday, Feb. 12, 2020 at 4:30 p.m. ET / 1:30 p.m. PT.The live webcast will be accessible via the Applied Materials website at: http://www.appliedmaterials.com/company/investor-relations. A replay will be available on the same day beginning at 8:00 p.m. ET / 5:00 p.m. PT.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977"
    },
    {
        "title": "Thinking about trading options or stock in Applied Materials, Amazon.com, Baidu, Lam Research, or NVIDIA?",
        "subtitle": "",
        "date": "Jan 10, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 10, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMAT, AMZN, BIDU, LRCX, and NVDA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast. (Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-applied-materials-amazoncom-baidu-lam-research-or-nvidia-300984887.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Applied Materials Announces Cash Dividend",
        "subtitle": "",
        "date": "Dec 5, 2019 5:00PM EST",
        "content": "SANTA CLARA, Calif., Dec.  05, 2019  (GLOBE NEWSWIRE) -- Applied Materials, Inc. today announced that its Board of Directors has approved a quarterly cash dividend of $0.21 per share payable on the company’s common stock. The dividend is payable on March 11, 2020 to shareholders of record as of Feb. 19, 2020.The quarterly cash dividend is a key component of Applied’s capital allocation strategy. In fiscal 2019, Applied returned nearly $3.2 billion to shareholders through dividends and share repurchases. The company had approximately $1.9 billion remaining in its share buyback authorization at fiscal year-end.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977"
    },
    {
        "title": "Applied Materials Announces Fourth Quarter and Fiscal Year 2019 Results",
        "subtitle": "",
        "date": "Nov 14, 2019 4:01PM EST",
        "content": "SANTA CLARA, Calif., Nov.  14, 2019  (GLOBE NEWSWIRE) -- Applied Materials, Inc. (NASDAQ:AMAT) today reported results for its fourth quarter and fiscal year ended Oct. 27, 2019.Fourth Quarter ResultsApplied generated revenue of $3.75 billion. On a GAAP basis, the company recorded gross margin of 43.5 percent, operating income of $864 million or 23.0 percent of net sales, and earnings per share (EPS) of $0.75.On a non-GAAP adjusted basis, the company reported gross margin of 43.8 percent, operating income of $888 million or 23.7 percent of net sales, and EPS of $0.80.The company returned $694 million to shareholders including $500 million in share repurchases and dividends of $194 million.Full Year ResultsIn fiscal 2019, Applied generated revenue of $14.61 billion. On a GAAP basis, the company recorded gross margin of 43.7 percent, operating income of $3.35 billion or 22.9 percent of net sales, and EPS of $2.86.On a non-GAAP adjusted basis, the company reported gross margin of 44.0 percent, operating income of $3.43 billion or 23.5 percent of net sales, and EPS of $3.04.The company generated $3.25 billion in cash from operations, paid dividends of $771 million and used $2.40 billion to repurchase 60 million shares of common stock.“Applied Materials’ fourth quarter results reflect a healthy uptick in demand for semiconductor equipment, combined with strong execution across the company,” said Gary Dickerson, president and CEO. “The semiconductor industry is increasingly adopting a new playbook for improving chip performance, power, area and cost, and we are investing in unique solutions to enable our customers’ success in the AI-Big Data era.”Results SummaryApplied adopted Accounting Standards Update 2014-09, Revenue from Contracts with Customers (ASC 606), as of the first day of fiscal 2019 using the full retrospective method. Applied also adopted Accounting Standards Update 2017-07, Compensation—Retirement Benefits, as of the first day of fiscal 2019 using the retrospective method. All prior periods included in the unaudited consolidated condensed balance sheet as of Oct. 28, 2018, and the unaudited consolidated condensed statements of operations and cash flows for the three and twelve months ended Oct. 28, 2018, were restated under the new standards.A reconciliation of the GAAP and non-GAAP adjusted results is provided in the financial tables included in this release. See also “Use of Non-GAAP Adjusted Financial Measures” section.Business OutlookIn the first quarter of fiscal 2020, Applied expects net sales to be approximately $4.10 billion, plus or minus $150 million. Non-GAAP adjusted diluted EPS is expected to be in the range of $0.87 to $0.95.This outlook for non-GAAP adjusted diluted EPS excludes known charges related to completed acquisitions of $0.01 per share and includes net income tax benefit related to intra-entity intangible asset transfers of $0.03 per share, but does not reflect any items that are unknown at this time, such as any additional charges related to acquisitions or other non-operational or unusual items, as well as other tax related items, which we are not able to predict without unreasonable efforts due to their inherent uncertainty.Fourth Quarter and Fiscal Year Reportable Segment InformationUse of Non-GAAP Adjusted Financial MeasuresApplied provides investors with certain non-GAAP adjusted financial measures, which are adjusted for the impact of certain costs, expenses, gains and losses, including certain items related to mergers and acquisitions; restructuring charges and any associated adjustments; impairments of assets, or investments; gain or loss on sale of strategic investments; tax effect of share-based compensation; certain income tax items and other discrete adjustments. Additionally, non-GAAP results exclude estimated discrete income tax expense items associated with changes to recent U.S. tax legislation. Reconciliations of these non-GAAP measures to the most directly comparable financial measures calculated and presented in accordance with GAAP are provided in the financial tables included in this release.Management uses these non-GAAP adjusted financial measures to evaluate the company’s operating and financial performance and for planning purposes, and as performance measures in its executive compensation program. Applied believes these measures enhance an overall understanding of its performance and investors’ ability to review the company’s business from the same perspective as the company’s management, and facilitate comparisons of this period’s results with prior periods on a consistent basis by excluding items that management does not believe are indicative of Applied's ongoing operating performance. There are limitations in using non-GAAP financial measures because the non-GAAP financial measures are not prepared in accordance with generally accepted accounting principles, may be different from non-GAAP financial measures used by other companies, and may exclude certain items that may have a material impact upon our reported financial results. The presentation of this additional information is not meant to be considered in isolation or as a substitute for the directly comparable financial measures prepared in accordance with GAAP.Webcast InformationApplied Materials will discuss these results during an earnings call that begins at 1:30 p.m. Pacific Time today. A live webcast will be available at www.appliedmaterials.com. A replay will be available on the website beginning at 5:00 p.m. Pacific Time today.Forward-Looking StatementsThis press release contains forward-looking statements, including those regarding anticipated growth and trends in our businesses and markets, industry outlooks and demand drivers, technology transitions, our business and financial performance and market share positions, our capital allocation, our investment and growth strategies, our development of new products and technologies, our business outlook for the first quarter of fiscal 2020 and beyond, and other statements that are not historical facts. These statements and their underlying assumptions are subject to risks and uncertainties and are not guarantees of future performance. Factors that could cause actual results to differ materially from those expressed or implied by such statements include, without limitation: the level of demand for our products; global economic and industry conditions; global trade issues and changes in trade policies; consumer demand for electronic products; the demand for semiconductors; customers’ technology and capacity requirements; the introduction of new and innovative technologies, and the timing of technology transitions; our ability to develop, deliver and support new products and technologies; the concentrated nature of our customer base; changes in income tax laws; our ability to expand our current markets, increase market share and develop new markets; market acceptance of existing and newly developed products; our ability to obtain and protect intellectual property rights in key technologies; our ability to achieve the objectives of operational and strategic initiatives, align our resources and cost structure with business conditions, and attract, motivate and retain key employees; the variability of operating expenses and results among products and segments, and our ability to accurately forecast future results, market conditions, customer requirements and business needs; and other risks and uncertainties described in our SEC filings, including our recent Forms 10-Q and 8-K. All forward-looking statements are based on management’s current estimates, projections and assumptions, and we assume no obligation to update them.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977APPLIED MATERIALS, INC.UNAUDITED CONSOLIDATED CONDENSED STATEMENTS OF OPERATIONSAPPLIED MATERIALS, INC.UNAUDITED CONSOLIDATED CONDENSED BALANCE SHEETSAPPLIED MATERIALS, INC.UNAUDITED CONSOLIDATED CONDENSED STATEMENTS OF CASH FLOWSAPPLIED MATERIALS, INC.UNAUDITED SUPPLEMENTAL INFORMATIONCorporate and Other Additional Information APPLIED MATERIALS, INC.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED RESULTSAPPLIED MATERIALS, INC.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED RESULTSAPPLIED MATERIALS, INC.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED RESULTSNote: The reconciliation of GAAP and non-GAAP adjusted segment results above does not include certain revenues, costs of products sold and operating expenses that are reported within corporate and other and included in consolidated operating income.UNAUDITED RECONCILIATION OF GAAP TO NON-GAAP ADJUSTED EFFECTIVE INCOME TAX RATE"
    },
    {
        "title": "Applied Materials to Participate in Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 13, 2019 7:30AM EST",
        "content": "SANTA CLARA, Calif., Nov.  13, 2019  (GLOBE NEWSWIRE) -- Applied Materials, Inc. announced today that Gary Dickerson, President and CEO, and Dan Durn, Senior Vice President and CFO, will participate in upcoming investor conferences.Mr. Dickerson will participate in a fireside chat at the Credit Suisse Technology Conference in Scottsdale, Arizona on Tuesday, Dec. 3 beginning at 5:00 a.m. PST / 8:00 a.m. EST.Mr. Durn will participate in a fireside chat at the UBS Global TMT Conference in New York on Monday, Dec. 9 beginning at 8:30 a.m. PST / 11:30 a.m. EST.A live audio webcast of these sessions will be available on the Applied Materials website at http://www.appliedmaterials.com/company/investor-relations and a replay of each event will be available on the same day.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977 "
    },
    {
        "title": "Applied’s New Materials Engineering Technology Accelerator is Open for Collaboration",
        "subtitle": "",
        "date": "Nov 8, 2019 7:30AM EST",
        "content": "State-of-the-art R&D facility provides Applied Materials customers and ecosystem partners with unique capabilities to pioneer breakthrough technologiesSANTA CLARA, Calif., Nov.  08, 2019  (GLOBE NEWSWIRE) -- Applied Materials, Inc. today announced the opening of the Materials Engineering Technology Accelerator (META Center), a first-of-its-kind facility aimed at speeding customer prototyping of new materials, process technologies and devices. As chipmaking becomes increasingly challenging, the META Center extends Applied’s ability to collaborate with customers to pioneer new ways of improving chip performance, power and cost.Located at the State University of New York Polytechnic Institute (SUNY Poly) campus in Albany, New York, the META Center’s cleanroom provides customers and partners access to state-of-the-art process systems to help shorten the time from lab to fab.“We are excited to open the doors of the META Center and invite the industry to collaborate with us to accelerate innovation, from materials to systems,” said Steve Ghanayem, senior vice president of New Markets and Alliances at Applied Materials.“Applied Materials welcomes innovators from established and emerging fields to work with us at the META Center to speed the commercialization of new technologies for the AI Era,” said Om Nalamasu, CTO of Applied Materials and president of Applied Ventures.“The META Center further establishes SUNY Poly as a world-class hub for advanced technology research and development,” said SUNY Chancellor Kristina M. Johnson. “We are excited to work with Applied Materials to spur new collaboration opportunities throughout the technology sector and across the SUNY network.”“New York State is home to a thriving high-tech ecosystem and the opening of the META Center will keep us at the forefront of technology innovation,” said Empire State Development Acting Commissioner, and President & CEO-designate Eric Gertler. “The partnership we’ve developed with NY CREATES, SUNY and Applied Materials will create the building blocks to bring new business, research, jobs and educational opportunities to the state for years to come.”At the META Center, engineers can evaluate novel chip materials, structures and devices, testing them in a robust pilot manufacturing environment and accelerating their readiness for customer high-volume manufacturing facilities. Among the first chip devices under evaluation at the META Center is a new magnetic random-access memory (MRAM) targeted at Internet of Things devices, providing low-power, nonvolatile code storage and high-density working memory. Applied’s recently launched Endura® CloverTM MRAM PVD platform is among the systems at the META Center enabling this capability.    The META Center is a strategic addition to Applied’s global R&D environment. It complements Applied’s Maydan Technology Center in Silicon Valley where new process systems are developed, along with the company’s Advanced Materials Lab and Advanced Packaging Development Center, both located in Singapore. Applied’s global R&D environment demonstrates the company’s commitment to a new playbook for industry innovation and collaboration, from materials to systems.About Applied Materials Applied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/03f2431a-e79e-4737-b302-bf06ffd20250"
    },
    {
        "title": "Applied Materials Announces Q4 and FY2019 Earnings Webcast",
        "subtitle": "",
        "date": "Nov 1, 2019 7:30AM EDT",
        "content": "SANTA CLARA, Calif., Nov.  01, 2019  (GLOBE NEWSWIRE) -- Applied Materials, Inc. will hold a webcast to discuss its fourth quarter and fiscal 2019 financial results, along with its business outlook, on Thursday, Nov. 14, 2019 at 4:30 p.m. EST / 1:30 p.m. PST.The live webcast will be accessible via the Applied Materials website at: http://www.appliedmaterials.com/company/investor-relations. A replay will be available on the same day beginning at 8:00 p.m. EST / 5:00 p.m. PST.About Applied MaterialsApplied Materials, Inc. (Nasdaq: AMAT) is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future. Learn more at www.appliedmaterials.com.Contact:Ricky Gradwohl (editorial/media) 408.235.4676Michael Sullivan (financial community) 408.986.7977"
    },
    {
        "title": "Chicago Quantum Summit to gather international experts",
        "subtitle": "Industry and academic leaders from US, Australia, Canada, UK to share research, discuss workforce development and build toward a global quantum alliance",
        "date": "Oct 10, 2019 4:50PM EDT",
        "content": "CHICAGO, Oct. 10, 2019 /PRNewswire/ -- Top experts in quantum technology from around the globe will gather at the University of Chicago on Oct. 25 to discuss the future of quantum information science and strategies to build a quantum workforce.The second annual Chicago Quantum Summit, hosted by the Chicago Quantum Exchange, will engage scientific and government leaders and the industries that will drive the applications of emerging quantum information science. Speakers include technology leaders at IBM (NYSE: IBM), Intel (NASDAQ: INTC), Boeing, Applied Materials (NASDAQ: AMAT), Toshiba Research Europe, the University of Waterloo, the University of New South Wales, Australia, and the Quantum Economic Development Consortium. \"The Summit provides an opportunity to build and strengthen collaborations that span beyond our national and academic boundaries,\" said David Awschalom, director of the Chicago Quantum Exchange. \"Through joint research projects with industry and national laboratories, we can leverage the unique capabilities of each organization to accelerate progress and push the boundaries of quantum science and engineering.\"Chicago is increasingly seen as a world-leading hub for quantum information science. It is home to the Chicago Quantum Exchange, a catalyst for advancing academic and industrial efforts in the science and engineering of quantum information. Headquartered at the University of Chicago's Pritzker School of Molecular Engineering, the Chicago Quantum Exchange is a partnership between the University of Chicago, Argonne National Laboratory, Fermi National Accelerator Laboratory, the University of Illinois at Urbana-Champaign, the University of Wisconsin-Madison and Northwestern University. It is home to one of the world's largest collaborative teams working on quantum science. The Chicago Quantum Exchange also has six industry partners – IBM, Boeing, Applied Materials, Inc., ColdQuanta, Inc., HRL Laboratories LLC and Quantum Opus LLC – that enable industry-academic collaborations and provide opportunities to future quantum scientists and engineers. During the Oct. 25 daytime program leaders will discuss their organization's work in quantum research and technology, progress in relevant quantum fields, and opportunities to develop the quantum workforce. At 6 p.m. on Oct. 24, the Chicago Quantum Exchange will also host a public event titled \"Solving Unsolvable Problems: The Future of Quantum Computing,\" at the Chicago Symphony Center in Chicago. The event features a keynote talk by Talia Gershon, IBM's director of research strategy and growth initiatives, and a conversation with Gershon and Awschalom moderated by Gizmodo writer Ryan Mandelbaum. More information, including a registration page for the public event, is available on the Chicago Quantum Exchange website. The Summit and public event will be webcast. View original content to download multimedia:http://www.prnewswire.com/news-releases/chicago-quantum-summit-to-gather-international-experts-300936873.htmlSOURCE  The University of Chicago"
    },
    {
        "title": "Thinking about trading options or stock in Applied Materials, eBay, Kohl's, Marathon Petroleum, or Micron Technology?",
        "subtitle": "",
        "date": "Jun 27, 2019 9:31AM EDT",
        "content": "\n    \n  NEW YORK, June 27, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMAT, EBAY, KSS, MPC, and MU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-applied-materials-ebay-kohls-marathon-petroleum-or-micron-technology-300876136.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Applied Materials, Iovance Biotherapeutics, NVIDIA, or Under Armour?",
        "subtitle": "",
        "date": "May 17, 2019 9:31AM EDT",
        "content": "NEW YORK, May 17, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, AMAT, IOVA, NVDA, and UAA.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-applied-materials-iovance-biotherapeutics-nvidia-or-under-armour-300852409.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Snow Appoints New CEO and Expands Executive Leadership Team",
        "subtitle": "",
        "date": "Jan 30, 2019 11:00AM EST",
        "content": "Vishal Rao transitions to President & Chief Executive Officer, with Rachel Mooney and James Denena joining as Chief People & Culture Officer and Chief Financial Officer respectivelySTOCKHOLM & AUSTIN, Texas--(BUSINESS WIRE)-- Snow Software, the global leader in technology intelligence and automation solutions, today announced the appointment of Vishal Rao as Chief Executive Officer. He succeeds founder Axel Kling, who is stepping down as CEO after growing the company into a market leader with over 4,000 customers worldwide. Kling will remain on the Board of Directors. The company also named Rachel Mooney as Chief People & Culture Officer and James Denena as Chief Financial Officer. These appointments round out a globally diverse management team with the experience needed to support Snow's next era of growth and maturity. In 2018, the company added several other key executives, including Ken Schock as Chief Revenue Officer, Sanjay Castelino as Chief Marketing Officer, and Alastair Pooley as Chief Information Officer.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190130005477/en/Vishal Rao, Snow Software Chief Executive Officer. (Photo: Business Wire)\"This is an important growth stage for the company, and I am humbled to lead Snow at such an exciting time,\" said Rao. \"Our opportunity continues to expand with the mass adoption of enterprise cloud services, IaaS, IoT, and edge computing. We are uniquely positioned to empower businesses to gain complete visibility into their technology stack, then use those insights to optimize efficiency and effectiveness while ensuring regulatory compliance and data protection. I would like to thank the Board and Axel for this opportunity, and I am excited for us to build on Snow's successes and momentum as we move the company forward.\"Vishal Rao, Chief Executive OfficerRao previously served as the President & Chief Operating Officer at Snow. He joined Snow's Board of Directors in 2016, and in 2018 took on an operating role overseeing all functions of the business. During that period, Rao contributed to the company crossing the $100 million revenue mark and made several executive appointments to further accelerate growth. Prior to Snow, he held leadership positions at Splunk (NASDAQ:SPLK) and Cloudera (NYSE:CLDR), both of which realized material revenue milestones and successful IPOs during his tenure. Rao will remain on Snow's Board of Directors.\"I'm delighted to welcome Vishal as the next CEO of Snow,\" said Kling. \"Having invited Vishal to join our Board three years ago, I know he brings the drive and experience needed to take the company to the next level. The past fifteen years have been an incredible journey, and I very much look forward to working with Vishal and supporting Snow as a Board member.\"\"In 2018 we brought Vishal into an operating role to help Snow take the next step in its evolution, growing beyond $100 million in revenue and becoming one of the most admired companies in enterprise software,\" said Mike Risman, Chairman of the Board at Snow and Managing Partner at Vitruvian Partners. \"I'm thrilled to support Vishal in this final step of transitioning to CEO. I want to thank Axel for his leadership and passion as CEO, and I look forward to our continued collaboration on the Board of Directors as we partner to support the Snow team.\"\"We are excited by the momentum that Snow has shown under Vishal's operating leadership,\" said George Kadifa, board member and Managing Director at Sumeru Equity Partners. \"As he takes on the expanded role of CEO, we are confident that the team will realize the opportunity in front of them, helping customers around the world maximize the promise of digital transformation.\"In addition to Rao's appointment, two new executives joined Snow's leadership team.Rachel Mooney, Chief People & Culture OfficerMooney will be responsible for global HR strategy and operations, enhancing and aligning employee experience across the organization, and enabling Snow to attract, retain and develop top talent. She joins Snow from Vodafone (NASDAQ:VOD), where she led strategic and operational HR for group corporate functions and global shared services, driving enhanced productivity and effectiveness across Sales, Marketing, Finance and Technology. Previously, Mooney led organizational culture for Google (NASDAQ:GOOGL) across EMEA as well as the company's human resources function in Ireland, with a relentless focus on accelerated growth and innovation. Mooney will be based in the U.K.James Denena, Chief Financial OfficerDenena comes to Snow with extensive financial and business development experience and a proven record for driving growth within public global organizations. Most recently, Denena was Vice President of Global Finance & Corporate Development for PROS (NYSE:PRO), a cloud software company with customers in more than 40 industries and 55 countries. He also served more than a decade at Applied Materials (NASDAQ:AMAT) in various senior finance, business development, and M&A roles. During his career, Denena has led multiple equity capital raises and completed more than 20 M&A and capital formation transactions. Denena will be based in the U.S.\"We're assembling a highly capable and well-rounded executive team ready to take Snow to the next level and I'm pleased to welcome Rachel and James as the newest members of the team,\" said Rao.\"In Rachel, we gain an accomplished business executive who understands the critical link between developing great people and a company's ability to grow and transform,\" he continued. \"She brings both passion and expertise in the full breadth of people and organizational capabilities, operating within start-ups, scaling and established businesses - key to our growth journey.\"\"James is an equally critical hire for us at this juncture,\" said Rao. \"As CFO, he brings tremendous experience building out strong finance teams and leading strategic initiatives. James is equal parts financial disciplinarian and growth-minded leader, which makes him ideally suited for Snow as we expand and optimize the business.\"About Snow SoftwareSnow Software is the global leader in Technology Intelligence & Automation solutions, ensuring the trillions spent on all forms of technology is optimized to drive maximum value. More than 4,000 organizations around the world rely on Snow's platform to provide complete visibility, optimize usage and spend, and minimize regulatory risk. Headquartered in Stockholm, Snow has more local offices and regional support centers than any other software asset and cloud management provider, delivering unparalleled results to our customers and partners. To find out more about Snow, visit www.snowsoftware.com.View source version on businesswire.com: https://www.businesswire.com/news/home/20190130005477/en/Source: Snow Software"
    }
]