[
    {
        "title": "Amgen Announces Global Diagnostic Collaborations To Expand Molecular Testing For Patients With Non-Small Cell Lung Cancer",
        "subtitle": "First Company Developing a KRAS(G12C) Inhibitor to Announce Multi-Platform Companion Diagnostics",
        "date": "Jan 13, 2020 4:20PM EST",
        "content": "THOUSAND OAKS, Calif., Jan. 13, 2020 /PRNewswire/ -- Amgen (NASDAQ: AMGN) today announced strategic collaborations with leading diagnostic companies Guardant Health, Inc. and QIAGEN N.V. to develop blood- and tissue-based companion diagnostics (CDx), respectively, for investigational cancer treatment AMG 510. AMG 510 is the first KRASG12C inhibitor to advance to the clinic for investigation in treatment of multiple tumor types. KRAS G12C is one of the most frequently mutated oncogenes in human cancers. The agreements with both companies will initially focus on CDx tests for non-small cell lung cancer (NSCLC) but allow for further development of the diagnostic tests for Amgen's other oncology clinical development programs.\"Amgen is committed to driving broad accessibility to biomarker testing in order to select appropriate patients who will directly benefit from targeted treatments,\" said David M. Reese, M.D., executive vice president of Research and Development at Amgen. \"With one in eight patients with NSCLC having KRAS G12C, there's a critical need to improve access to high quality diagnostics and more routine screening. Collaborating with QIAGEN and Guardant Health to have both tissue- and blood-based diagnostic tests available will help to identify patients with NSCLC who may benefit from AMG 510.\"Amgen will work with QIAGEN to develop a tissue-based diagnostic test utilizing its therascreen® platform to identify patients whose cancers have the KRAS G12C mutation. QIAGEN will also pursue global regulatory approvals, including Pre-Market Approval (PMA) from the U.S. Food and Drug Administration (FDA). To enable biomarker testing in patients for whom insufficient tissue remains a challenge, Amgen is also collaborating with Guardant Health to develop a liquid biopsy CDx. Guardant360 CDx is a multi-tumor comprehensive NGS (Next Generation Sequencing) test that is being developed to identify patients with actionable alterations, in this instance with the KRAS G12C mutation in NSCLC. Guardant Health will seek global regulatory approvals for the test, including a PMA from the FDA. AMG 510 is currently enrolling patients in a potentially registrational Phase 2 study (CodeBreak™ 100). The FDA granted Orphan Drug Designation to AMG 510 for previously treated metastatic NSCLC and colorectal cancer with KRAS G12C mutation and Fast Track Designation for previously treated metastatic NSCLC with KRAS G12C mutation. Amgen established RAS as the first actionable biomarker in metastatic colorectal cancer and is now pioneering the development of KRAS mutation specific inhibitors in lung cancer and other solid tumors with AMG 510.About KRAS                  The subject of almost four decades of research, the RAS gene family are the most frequently mutated oncogenes in human cancers.1,2 Within this family, KRAS is the most prevalent variant and is particularly common in solid tumors.2 A specific mutation known as KRAS G12C is found in approximately 13% of non-small cell lung cancers, three to five percent of colorectal cancers and one to two percent of numerous other solid tumors.3 KRASG12C has been considered \"undruggable\" due to a lack of traditional small molecule binding pockets on the protein.4 Amgen is exploring the potential of KRASG12C inhibition across a broad variety of tumor types.About Amgen Oncology Amgen Oncology is searching for and finding answers to incredibly complex questions that will advance care and improve lives for cancer patients and their families. Our research drives us to understand the disease in the context of the patient's life – not just their cancer journey – so they can take control of their lives.For the last four decades, we have been dedicated to discovering the firsts that matter in oncology and to finding ways to reduce the burden of cancer. Building on our heritage, Amgen continues to advance the largest pipeline in the Company's history, moving with great speed to advance those innovations for the patients who need them. At Amgen, we are driven by our commitment to transform the lives of cancer patients and keep them at the center of everything we do.    For more information, follow us on www.twitter.com/amgenoncology.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd., or the Otezla® (apremilast) acquisition, including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.The scientific information discussed in this news release related to our product candidates is preliminary and investigative. Such product candidates are not approved by the U.S. Food and Drug Administration, and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates. Further, any scientific information discussed in this news release relating to new indications for our products is preliminary and investigative and is not part of the labeling approved by the U.S. Food and Drug Administration for the products. The products are not approved for the investigational use(s) discussed in this news release, and no conclusions can or should be drawn regarding the safety or effectiveness of the products for these uses.CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974 (Media)Trish Hawkins, 805-447-5631 (Media) Arvind Sood, 805-447-1060 (Investors)References:   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-announces-global-diagnostic-collaborations-to-expand-molecular-testing-for-patients-with-non-small-cell-lung-cancer-300986051.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen To Present At The Goldman Sachs 12th Annual Healthcare CEOs Unscripted Conference",
        "subtitle": "",
        "date": "Jan 7, 2020 4:00PM EST",
        "content": "THOUSAND OAKS, Calif., Jan. 7, 2020 /PRNewswire/ -- Amgen (NASDAQ:AMGN) will present via video conference at the Goldman Sachs 12th Annual Healthcare CEOs Unscripted Conference at 1 p.m. PT on Thursday, Jan. 9, 2020. Robert A. Bradway, chairman and chief executive officer at Amgen, and Peter H. Griffith, executive vice president and chief financial officer at Amgen, will present. Live audio of the presentation can be accessed from the Events Calendar on Amgen's website, www.amgen.com, under Investors. A replay of the webcast will also be available on Amgen's website for at least 90 days following the event. About Amgen Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.  Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.  For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.  CONTACT: Amgen, Thousand Oaks Jessica Akopyan, 805-447-0974 (media)Trish Hawkins, 805-447-5631(media) Arvind Sood, 805-447-1060 (investors)   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-to-present-at-the-goldman-sachs-12th-annual-healthcare-ceos-unscripted-conference-300982942.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen And Allergan Submit Biologics License Application For ABP 798, Biosimilar Candidate To Rituxan® (rituximab), To U.S. Food And Drug Administration",
        "subtitle": "Filing for ABP 798 Supported by Two Comparative Clinical Studies",
        "date": "Dec 19, 2019 4:44PM EST",
        "content": "THOUSAND OAKS, Calif., Dec. 19, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) and Allergan plc. (NYSE:AGN) today announced the submission of a Biologics License Application (BLA) to the U.S. Food and Drug Administration (FDA) for ABP 798, a biosimilar candidate to Rituxan® (rituximab). Amgen and Allergan are collaborating on four oncology biosimilar medicines, two of which have already been approved by the FDA.\"The U.S. filing for ABP 798 marks an important milestone for Amgen, as it affirms our commitment to providing high quality biosimilars that offer more life-altering biological treatment options and contribute to the sustainability of healthcare systems,\" said David M. Reese, M.D., executive vice president of Research and Development at Amgen. \"We look forward to working with the FDA to bring ABP 798 to market.\" ABP 798 has been developed as a biosimilar candidate to Rituxan. Rituxan is a CD20-directed cytolytic antibody that has been approved in many regions for, among other things, the treatment of adult patients alone or in combination with chemotherapy for non-Hodgkin's lymphoma, in combination with fludarabine and cyclophosphamide for chronic lymphocytic leukemia, granulomatosis with polyangiitis and microscopic polyangiitis with glucocorticoids.  \"We are excited about the progress that we've made to date through our partnership with Amgen, which includes the launch of the first two oncology therapeutic biosimilars in the U.S.,\" said David Nicholson, Ph.D., chief research and development officer at Allergan. \"With ABP 798, we look forward to the opportunity to continue to provide additional treatment options to patients suffering from serious illnesses.\"The BLA submission includes analytical, pharmacokinetic and clinical data, as well as pharmacology and toxicology data generated in two clinical studies. The results of these studies confirmed no clinically meaningful differences between ABP 798 and Rituxan.Amgen has a total of 10 biosimilars in its portfolio, four of which have been approved in the U.S. and three that are approved in the European Union (EU).About ABP 798ABP 798 has been developed as a biosimilar candidate to Rituxan. Rituxan is an anti-CD20 monoclonal antibody that has been approved in many regions for the treatment of, among other things, adult patients alone or in combination with chemotherapy for non-Hodgkin's lymphoma, in combination with fludarabine and cyclophosphamide for chronic lymphocytic leukemia, granulomatosis with polyangiitis and microscopic polyangiitis with glucocorticoids. The active ingredient of ABP 798 is a monoclonal antibody that has the same amino acid sequence as Rituxan.About the Amgen and Allergan CollaborationIn December 2011, Amgen and Allergan plc. (then Watson Pharmaceuticals, Inc.) formed a collaboration to develop and commercialize, on a worldwide basis, four oncology antibody biosimilar medicines. This collaboration reflects the shared belief that the development and commercialization of biosimilar products will not follow a pure brand or generic model and will require significant expertise, infrastructure, and investment to ensure safe, reliably supplied therapies for patients. Under the terms of the agreement, Amgen assumes primary responsibility for developing, manufacturing and initially commercializing the oncology antibody products.About Amgen Biosimilars Amgen is committed to building upon Amgen's experience in the development and manufacturing of innovative human therapeutics to expand Amgen's reach to patients with serious illnesses. Biosimilars will help to maintain Amgen's commitment to connect patients with vital medicines, and Amgen is well positioned to leverage its nearly four decades of experience in biotechnology to create high-quality biosimilars and reliably supply them to patients worldwide.For more information, visit www.amgenbiosimilars.com and follow us on www.twitter.com/amgenbiosim.About Amgen OncologyAmgen is searching for and finding answers to incredibly complex questions that will advance care and improve lives for cancer patients and their families. Our research drives us to understand the disease in the context of the patient's life – not just their cancer journey – so they can take control of their lives.For the last four decades, we have been dedicated to discovering the firsts that matter in oncology and to finding ways to reduce the burden of cancer. Building on our heritage, Amgen continues to advance the largest pipeline in the Company's history, moving with great speed to advance those innovations for the patients who need them.At Amgen, we are driven by our commitment to transform the lives of cancer patients and keep them at the center of everything we do. For more information, follow us on www.twitter.com/amgenoncologyAbout Amgen Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.About Allergan plcAllergan plc (NYSE: AGN), headquartered in Dublin, Ireland, is a bold, global pharmaceutical leader. Allergan is focused on developing, manufacturing and commercializing branded pharmaceutical, device, biologic, surgical and regenerative medicine products for patients around the world.Allergan markets a portfolio of leading brands and best-in-class products primarily focused on four key therapeutic areas including central nervous system, eye care, medical aesthetics and gastroenterology.Allergan is an industry leader in Open Science, a model of research and development, which defines our approach to identifying and developing game-changing ideas and innovation for better patient care. With this approach, Allergan has built one of the broadest development pipelines in the pharmaceutical industry.Allergan's success is powered by our global colleagues' commitment to being Bold for Life. Together, we build bridges, power ideas, act fast and drive results for our customers and patients around the world by always doing what is right.With commercial operations in approximately 100 countries, Allergan is committed to working with physicians, healthcare providers and patients to deliver innovative and meaningful treatments that help people around the world live longer, healthier lives every day.For more information, visit Allergan's website at www.Allergan.com.Amgen Forward-Looking Statements This news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd. or the Otezla® (apremilast) acquisition, including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market. Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.The scientific information discussed in this news release related to our product candidates is preliminary and investigative.  Such product candidates are not approved by the U.S. Food and Drug Administration, and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates.Allergan plc Forward-Looking Statements Statements contained in this press release that refer to future events or other non-historical facts are forward-looking statements that reflect Allergan's current perspective on existing trends and information as of the date of this release. Actual results may differ materially from Allergan's current expectations depending upon a number of factors affecting Allergan's business. These factors include, among others, the difficulty of predicting the timing or outcome of FDA approvals or actions, if any; the impact of competitive products and pricing; market acceptance of and continued demand for Allergan's products; the impact of uncertainty around timing of generic entry related to key products, including RESTASIS®, on our financial results; risks associated with divestitures, acquisitions, mergers and joint ventures; risks related to impairments; uncertainty associated with financial projections, projected cost reductions, projected debt reduction, projected synergies, restructurings, increased costs, and adverse tax consequences; difficulties or delays in manufacturing; and other risks and uncertainties detailed in Allergan's periodic public filings with the Securities and Exchange Commission, including but not limited to Allergan's Annual Report on Form 10-K for the year ended December 31, 2018 and Allergan's Quarterly Report on Form 10-Q for the period ended March 31, 2019. Except as expressly required by law, Allergan disclaims any intent or obligation to update these forward-looking statements.Rituxan® is a registered trademark of Biogen Inc.CONTACT: Amgen, Thousand OaksKelley Davenport, 202-585-9637 (media)Trish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)CONTACT: Allergan plc.Daphne Karydas, 862-261-8006 (investor relations)Frances DeSena , 862-261-8820 (media relations)  View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-and-allergan-submit-biologics-license-application-for-abp-798-biosimilar-candidate-to-rituxan-rituximab-to-us-food-and-drug-administration-300978011.htmlSOURCE  Amgen"
    },
    {
        "title": "European Commission Approves EVENITY® (romosozumab) For The Treatment Of Severe Osteoporosis In Postmenopausal Women At High Risk Of Fracture",
        "subtitle": "First New Osteoporosis Medicine Approved in the European Union (EU) Since 2010",
        "date": "Dec 12, 2019 1:00AM EST",
        "content": "THOUSAND OAKS, Calif. and BRUSSELS, Dec. 11, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) and UCB (Euronext Brussels: UCB) today announced that the European Commission (EC) has granted marketing authorization for EVENITY® (romosozumab) for the treatment of severe osteoporosis in postmenopausal women at high risk of fracture. EVENITY is a novel bone-builder with a dual effect that increases bone formation and to a lesser extent reduces bone resorption (or bone loss). \"After her first fracture, a woman is five times more likely to suffer another fracture within a year.1 EVENITY is a significant step forward in the management of osteoporosis for physicians who need to treat patients with a medicine that can rapidly increase bone mineral density within 12 months,\" said David M. Reese, M.D., executive vice president of Research and Development at Amgen. \"We are pleased by the European Commission's approval to make this therapy available to the millions of women at high risk of fracture in the European Union.\"The approval follows a positive opinion from the Committee for Medicinal Products for Human Use (CHMP) that was received in October 2019. The first launches of EVENITY in the European Economic Area (EEA) are planned for first half of 2020.As the population ages, the incidence and contribution of fragility fractures to the overall healthcare spend in Europe will continue to rise. Recent studies estimate that every year €37 billion is spent on healthcare costs for the 2.7 million fragility fractures that occur across France, Germany, Italy, Spain, Sweden and the UK.2 This annual expenditure is predicted to increase to over €47 billion by 2030.2 \"Today's European population is living longer and expecting more out of life in their later years. Yet fragility fractures due to osteoporosis affect one in three women aged over 50, and evidence shows that many women remain undiagnosed and untreated following a fracture. These fractures represent a barrier to healthy aging, potentially impacting independence and quality of life2,\" said Dr. Pascale Richetta, head of bone and executive vice president, UCB. \"With today's approval of EVENITY we can now offer patients and clinicians a new medicine that can help drive positive changes in secondary fracture prevention.\"\"Fragility fractures can often be avoided, but their prevention and management are being neglected despite a large personal, societal and economic impact. With the number of worldwide fractures expected to rise there is a growing need to take action and prioritize post-fracture care through better education, specialist services, lifestyles and medicines,\" said Alison Doyle, head of clinical operations for the Royal Osteoporosis Society. \"Therefore, we welcome this approval as it represents a new, therapeutic option for both patients and health care professionals in addressing this neglected condition.\" European Commission marketing authorization approval is valid in all EU and EEA-European Free Trade Association (EFTA) states (Norway, Iceland and Liechtenstein). EVENITY is now approved in 37 countries, including the U.S., Japan, Canada and Australia.About EVENITY® (romosozumab)EVENITY is a bone-forming monoclonal antibody. It is designed to work by inhibiting the activity of sclerostin, which simultaneously results in increased bone formation and to a lesser extent decreased bone resorption. The EVENITY development program includes 19 clinical studies that enrolled approximately 14,000 patients. EVENITY has been studied for its potential to reduce the risk of fractures in an extensive global Phase 3 program that included two large fracture trials comparing EVENITY to either placebo or active comparator in nearly 11,000 postmenopausal women with osteoporosis. Amgen and UCB are co-developing EVENITY.About Osteoporosis-Related FracturesWorldwide, one in three women and one in five men, over the age of 50, will suffer a fragility fracture due to osteoporosis and with an aging population these numbers will rise.3 Yet despite this, there is a large gap in the management and treatment of osteoporosis, especially in the post-fracture setting, with an estimated four out of five patients remaining undiagnosed and untreated after a fracture.4 Without proper care or access to effective intervention options, they remain at risk of painful and disabling fractures in the future.Important EU/EEA Product InformationEVENITY® (romosozumab) is indicated for treatment of severe osteoporosis in postmenopausal women at high risk of fracture.Important EU/EEA Safety informationThis medicinal product is subject to additional monitoring. This will allow quick identification of new safety information. Healthcare professionals are asked to report any suspected adverse reactions. Contraindications EVENITY is contraindicated in patients with a history of myocardial infraction or stroke. EVENITY is contraindicated in patients with hypocalcemia. EVENITY is contraindicated in patients with a history of systemic hypersensitivity to romosozumab or to any component of the product formulation.Special Warning and Precautions for Use Myocardial infarction and stroke: In randomised controlled studies, an increase in serious cardiovascular events (myocardial infarction and stroke) has been observed in romosozumab treated patients compared to controls. Romosozumab is contraindicated in patients with previous myocardial infarction or stroke.When determining whether to use romosozumab for an individual patient, consideration should be given to her fracture risk over the next year and her cardiovascular risk based on risk factors (e.g. established cardiovascular disease, hypertension, hyperlipidaemia, diabetes mellitus, smoking, severe renal impairment, age). Romosozumab should only be used if the prescriber and patient agree that the benefit outweighs the risk. If a patient experiences a myocardial infarction or stroke during therapy, treatment with romosozumab should be discontinued.Hypocalcemia: Transient hypocalcemia has been observed in patients receiving romosozumab. Hypocalcemia should be corrected prior to initiating therapy with romosozumab and patients should be monitored for signs and symptoms of hypocalcemia. If any patient presents with suspected symptoms of hypocalaemia during treatment, calcium levels should be measured. Patients should be adequately supplemented with calcium and vitamin D. Patients with severe renal impairment (estimated glomerular filtration rate [eGFR] 15 to 29 ml/min/1.73 m2) or receiving dialysis are at greater risk of developing hypocalcemia and the safety data for these patients is limited. Calcium levels should be monitored in these patients.Hypersensitivity: Clinically significant hypersensitivity reactions, including angioedema, erythema multiforme, and urticaria occurred in the romosozumab group in clinical trials. If an anaphylactic or other clinically significant allergic reaction occurs, appropriate therapy should be initiated and use of romosozumab should be discontinued. Osteonecrosis of the Jaw (ONJ):  ONJ, has been reported rarely in patients receiving romosozumab. The following risk factors should be considered when evaluating a patient's risk of developing ONJ:All patients should be encouraged to maintain good oral hygiene, receive routine dental check-ups, and immediately report any oral symptoms such as dental mobility, pain or swelling or non-healing of sores or discharge during treatment with romosozumab.Patients who are suspected of having or who develop ONJ while on romosozumab should receive care by a dentist or an oral surgeon with expertise in ONJ. Discontinuation of romosozumab therapy should be considered until the condition resolves and contributing risk factors are mitigated where possible.  Atypical Femoral Fractures: Atypical low-energy or low trauma fracture of the femoral shaft, which can occur spontaneously, has been reported rarely in patients receiving romosozumab. Any patient who presents with new or unusual thigh, hip, or groin pain should be suspected of having an atypical fracture and should be evaluated to rule out an incomplete femur fracture. Patient presenting with an atypical femur fracture should also be assessed for symptoms and signs of fracture in the contralateral limb. Interruption of romosozumab therapy should be considered, based on an individual benefit-risk assessment.Adverse Reactions: The most common adverse reactions were nasopharyngitis (13.6%) and arthralgia (12.4%). Common adverse reactions included hypersensitivity, sinusitis, rash, dermatitis, headache, neck pain, muscle spasms and injection site reactions (most frequent injection site reactions were pain and erythema). Uncommon adverse reactions were urticaria, hypocalcaemia, stroke, myocardial infarction and cataract. Finally, rare side effects were serious allergic reactions which caused swelling of the face, throat, hands, feet, ankles or lower legs (angioedema) and acute skin eruption (erythema multiforme).Refer to the European Summary of Product Characteristics for other adverse reactions and full prescribing information for EVENITY®.Important U.S. Product InformationEVENITY® is indicated for the treatment of osteoporosis in postmenopausal women at high risk for fracture, defined as a history of osteoporotic fracture, or multiple risk factors for fracture; or patients who have failed or are intolerant to other available osteoporosis therapy.5The anabolic effect of EVENITY wanes after 12 monthly doses of therapy. Therefore, the duration of EVENITY use should be limited to 12 monthly doses. If osteoporosis therapy remains warranted, continued therapy with an anti-resorptive agent should be considered. Important U.S. Safety InformationPOTENTIAL RISK OF MYOCARDIAL INFARCTION, STROKE AND CARDIOVASCULAR DEATHEVENITY® may increase the risk of myocardial infarction, stroke and cardiovascular death. EVENITY® should not be initiated in patients who have had a myocardial infarction or stroke within the preceding year. Consider whether the benefits outweigh the risks in patients with other cardiovascular risk factors. Monitor for signs and symptoms of myocardial infarction and stroke and instruct patients to seek prompt medical attention if symptoms occur. If a patient experiences a myocardial infarction or stroke during therapy, EVENITY® should be discontinued.In a randomized controlled trial in postmenopausal women, there was a higher rate of major adverse cardiac events (MACE), a composite endpoint of cardiovascular death, nonfatal myocardial infarction and nonfatal stroke, in patients treated with EVENITY® compared to those treated with alendronate.Contraindications: EVENITY® is contraindicated in patients with hypocalcemia. Pre-existing hypocalcemia must be corrected prior to initiating therapy with EVENITY®. EVENITY® is contraindicated in patients with a history of systemic hypersensitivity to romosozumab or to any component of the product formulation. Reactions have included angioedema, erythema multiforme and urticaria.Hypersensitivity: Hypersensitivity reactions, including angioedema, erythema multiforme, dermatitis, rash and urticaria have occurred in EVENITY®-treated patients. If an anaphylactic or other clinically significant allergic reaction occurs, initiate appropriate therapy and discontinue further use of EVENITY®.Hypocalcemia: Hypocalcemia has occurred in patients receiving EVENITY®. Correct hypocalcemia prior to initiating EVENITY®. Monitor patients for signs and symptoms of hypocalcemia, particularly in patients with severe renal impairment or receiving dialysis. Adequately supplement patients with calcium and vitamin D while on EVENITY®.  Osteonecrosis of the Jaw (ONJ): ONJ, which can occur spontaneously, is generally associated with tooth extraction and/or local infection with delayed healing, and has been reported in patients receiving EVENITY®. A routine oral exam should be performed by the prescriber prior to initiation of EVENITY®. Concomitant administration of drugs associated with ONJ (chemotherapy, bisphosphonates, denosumab, angiogenesis inhibitors, and corticosteroids) may increase the risk of developing ONJ. Other risk factors for ONJ include cancer, radiotherapy, poor oral hygiene, pre-existing dental disease or infection, anemia and coagulopathy. For patients requiring invasive dental procedures, clinical judgment should guide the management plan of each patient. Patients who are suspected of having or who develop ONJ should receive care by a dentist or an oral surgeon. In these patients, dental surgery to treat ONJ may exacerbate the condition. Discontinuation of EVENITY® should be considered based on benefit-risk assessment.Atypical Femoral Fractures: Atypical low-energy or low trauma fractures of the femoral shaft have been reported in patients receiving EVENITY®. Causality has not been established as these fractures also occur in osteoporotic patients who have not been treated. During EVENITY® treatment, patients should be advised to report new or unusual thigh, hip or groin pain. Any patient who presents with thigh or groin pain should be evaluated to rule out an incomplete femur fracture. Interruption of EVENITY® therapy should be considered based on benefit-risk assessment.Adverse Reactions: The most common adverse reactions (≥ 5%) reported with EVENITY® were arthralgia and headache.EVENITY® is a humanized monoclonal antibody. As with all therapeutic proteins, there is potential for immunogenicity. Please see accompanying EVENITY® full U.S. Prescribing Information, including Boxed Warning and Medication Guide.About the Amgen and UCB CollaborationSince 2004, Amgen and UCB have been working together under a collaboration and license agreement to research, develop and market antibody products targeting the protein sclerostin. As part of this agreement, the two companies continue to collaborate on the development of romosozumab for the treatment of osteoporosis. This gene-to-drug project demonstrates how Amgen and UCB are joining forces to translate a genetic discovery into a new medicine, turning conceptual science into a reality.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. About UCBUCB, Brussels, Belgium (www.ucb.com) is a global biopharmaceutical company focused on the discovery and development of innovative medicines and solutions to transform the lives of people living with severe diseases of the immune system or of the central nervous system. With 7 500 people in approximately 40 countries, the company generated revenue of € 4.6 billion in 2018. UCB is listed on Euronext Brussels (symbol: UCB). Follow us on Twitter: @UCB_news.Amgen Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd., or the Otezla® (apremilast) acquisition, including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including its most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those Amgen projects. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for Amgen to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and Amgen expects similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints Amgen has selected. Amgen develops product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as Amgen may have believed at the time of entering into such relationship. Also, Amgen or others could identify safety, side effects or manufacturing problems with its products, including its devices, after they are on the market. Amgen's results may be affected by its ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing its products and global economic conditions. In addition, sales of Amgen's products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, Amgen's research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Amgen's business may be impacted by government investigations, litigation and product liability claims. In addition, Amgen's business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If Amgen fails to meet the compliance obligations in the corporate integrity agreement between Amgen and the U.S. government, Amgen could become subject to significant sanctions. Further, while Amgen routinely obtains patents for its products and technology, the protection offered by its patents and patent applications may be challenged, invalidated or circumvented by its competitors, or Amgen may fail to prevail in present and future intellectual property litigation. Amgen performs a substantial amount of its commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depends on third parties for a portion of its manufacturing activities, and limits on supply may constrain sales of certain of its current products and product candidate development. Amgen relies on collaborations with third parties for the development of some of its product candidates and for the commercialization and sales of some of its commercial products. In addition, Amgen competes with other companies with respect to many of its marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for Amgen's products are supplied by sole third-party suppliers. Certain of Amgen's distributors, customers and payers have substantial purchasing leverage in their dealings with Amgen. The discovery of significant problems with a product similar to one of Amgen's products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on its business and results of operations. Amgen's efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products Amgen has acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of Amgen's systems and Amgen's data. Amgen's stock price may be volatile and may be affected by a number of events. Amgen's business performance could affect or limit the ability of the Amgen Board of Directors to declare a dividend or its ability to pay a dividend or repurchase its common stock. Amgen may not be able to access the capital and credit markets on terms that are favorable to it, or at all.UCB Forward-Looking StatementsThis press release contains forward-looking statements based on current plans, estimates and beliefs of management. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including estimates of revenues, operating margins, capital expenditures, cash, other financial information, expected legal, political, regulatory or clinical results and other such estimates and results. By their nature, such forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions which could cause actual results to differ materially from those that may be implied by such forward-looking statements contained in this press release. Important factors that could result in such differences include: changes in general economic, business and competitive conditions, the inability to obtain necessary regulatory approvals or to obtain them on acceptable terms, costs associated with research and development, changes in the prospects for products in the pipeline or under development by UCB, effects of future judicial decisions or governmental investigations, product liability claims, challenges to patent protection for products or product candidates, changes in laws or regulations, exchange rate fluctuations, changes or uncertainties in tax laws or the administration of such laws and hiring and retention of its employees. UCB is providing this information as of the date of this press release and expressly disclaims any duty to update any information contained in this press release, either to confirm the actual results or to report a change in its expectations.There is no guarantee that new product candidates in the pipeline will progress to product approval or that new indications for existing products will be developed and approved. Products or potential products which are the subject of partnerships, joint ventures or licensing collaborations may be subject to differences between the partners. Also, UCB or others could discover safety, side effects or manufacturing problems with its products after they are marketed.Moreover, sales may be impacted by international and domestic trends toward managed care and health care cost containment and the reimbursement policies imposed by third-party payers as well as legislation affecting biopharmaceutical pricing and reimbursement.CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974 (media) Trish Hawkins, 805-447-5631 (mediaArvind Sood, 805-447-1060 (investors)CONTACT: UCB, Brussels  Scott Fleming, Bone Communications, UCB, T +44 7702777378, scott.fleming@ucb.com Laurent Schots, Media Relations, UCB, T+32.2.559.92.64, laurent.schots@ucb.com Antje Witte, Investor Relations, UCB, T +32.2.559.94.14, antje.witte@ucb.com Isabelle Ghellynck, Investor Relations, UCB, T+32.2.559.9588, isabelle.ghellynck@ucb.comReferences  View original content to download multimedia:http://www.prnewswire.com/news-releases/european-commission-approves-evenity-romosozumab-for-the-treatment-of-severe-osteoporosis-in-postmenopausal-women-at-high-risk-of-fracture-300973794.htmlSOURCE  Amgen"
    },
    {
        "title": "Beyond Cholesterol: Landmark deCODE Study Elucidates Role of Lipoprotein(a) as Major Risk Factor for Heart Disease",
        "subtitle": "Highly diverse, understudied and not routinely screened for, Lp(a) -- an alipoprotein(a) bound to an LDL cholesterol particle -- may be the next most important serum risk factor after LDL itself",
        "date": "Dec 9, 2019 4:00PM EST",
        "content": "REYKJAVIK, Iceland, Dec. 9, 2019 /PRNewswire/ -- Scientists at deCODE genetics and colleagues from the National University Hospital in Iceland today present the largest-scale study to date of the role and public health impact of Lipoprotein(a) as a risk factor for cardiovascular disease. The study appears today in the online edition of the Journal of the American College of Cardiology. Lipoprotein(a), abbreviated as Lp(a), is an alipoprotein(a), abbreviated as apo(a), bound to an LDL cholesterol particle and has been known as a risk factor since the 1970s. But the high variability of the apo(a) gene that controls its production, the diverse isoforms of Lp(a) that result, the difficulty of assaying them, and conflicting reports of how they impart risk left it largely neglected alongside the clearer success story of LDL, the statins and PCSK9 inhibitors. The deCODE team turned its unique population-scale capabilities and data to address the complexity of Lp(a) and discovered a simple answer: it is the molar concentration of Lp(a) that directly correlates with increased risk of heart disease, whatever the variety of apo(a) alleles and independently of traditionally measured or treated HDL or LDL cholesterol. \"This study from our little island may well turn out to be an important contribution to global public health,\" said Kari Stefansson, CEO of deCODE and a senior author on the paper. \"We have very effective LDL-lowering drugs, but heart disease remains the biggest killer worldwide and understanding Lp(a) is key to addressing the residual risk.\" \"What we show today, by analyzing an unprecedented amount of both clinical and genetic data from across the Icelandic population, is that by measuring Lp(a) in the blood we can identify a quarter of the population that is from an additional 25% to double the average risk of heart disease. This risk is independent of other risk factors and is 95% genetically determined, so you can't reduce it by improving your lifestyle or diet. The clear message is therefore that we need to test for Lp(a) globally to identify those at significantly elevated risk, and speed the development of new therapies aimed at silencing the apo(a) gene. The good news is that our colleagues at Amgen are already taking such therapies into clinical trials,\" Dr Stefansson added. \"We know that Lp(a) is a causal, independent risk factor for cardiovascular risk, and Amgen is proud of the work we have done and continue to do investing in pursuing this therapeutic target,\" said David M Reese, MD, executive vice president of Research and Development at Amgen. \"This new study from deCODE will help steer and inform research into the clinical development of molecules targeting Lp(a), and is a great example of the potential we are just beginning to uncover using genetic insights and validation to power drug development. We believe we are still in the early years of large-scale human genetic research, and most of the major discoveries in this field still lie in the future.  That's why we are continuing to grow our investment in genetics by increasing the scope and diversity of the data that deCODE can access and analyze for research purposes.\"The study utilized whole genome data from some 150,000 Icelanders participating in deCODE's genetics research, including 18,000 with coronary artery disease (CAD) and other cardiovascular phenotypes, and 9,000 with type-2 diabetes. By directly measuring molar concentration of Lp(a) from 12,000 participants and comparing them with the sequence of participants' apo(a) genes, the research team was able to establish how different variants in apo(a) and the resulting Lp(a) isoforms affect the risk of coronary artery disease. Imputing these results through the entire dataset and correlating the results with disease status enabled the testing of multiple previous findings related to Lp(a) and the discovery that it is overall molar concentration of Lp(a) rather than specific isoforms or isoform size itself that correlates with CAD risk. The study also demonstrated that Lp(a) levels correlate with risk for peripheral artery disease, aortic valve stenosis, heart failure and lifespan. An important next step in this research is to validate the results in other populations, to understand how the contribution of Lp(a) levels to heart and other diseases may vary between populations of different continental ancestry.Based in Reykjavik, Iceland, deCODE is a global leader in analyzing and understanding the human genome. Using its unique expertise and population resources, deCODE has discovered genetic risk factors for dozens of common diseases. The purpose of understanding the genetics of disease is to use that information to create new means of diagnosing, treating and preventing disease. deCODE is a wholly-owned subsidiary of Amgen (NASDAQ:AMGN).    View original content to download multimedia:http://www.prnewswire.com/news-releases/beyond-cholesterol-landmark-decode-study-elucidates-role-of-lipoproteina-as-major-risk-factor-for-heart-disease-300971592.htmlSOURCE  deCODE genetics"
    },
    {
        "title": "Amgen Selects Location For R&D Facility In The South San Francisco Biotechnology Hub",
        "subtitle": "Amgen Signs Lease With Biomed Realty for New Gateway of Pacific Campus Facility",
        "date": "Dec 9, 2019 9:00AM EST",
        "content": "THOUSAND OAKS, Calif., Dec. 9, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced the signing of a lease with BioMed Realty for a new 240,000-square-foot Leadership in Energy and Environmental Design (LEED) candidate facility in the Gateway of Pacific campus development in South San Francisco. The new location, currently under construction at Oyster Point, will house Amgen's Bay Area employees focused on cardiometabolic, inflammation and oncology, research.\"At Amgen South San Francisco, we are home to top scientific talent, integrating human genetics with core biology and molecular engineering to discover and develop first-in-class therapies,\" said Amgen's South San Francisco site-head Flavius Martin, vice president, Research, Oncology and Inflammation. \"The new location will foster even greater collaboration across our strong scientific team, accelerate the R&D process, and provide a venue for increased engagement with the Bay Area's abundant scientific and educational communities.\"Amgen has been part of the vibrant South San Francisco biotech community for 15 years. The company's new home at The Gateway of Pacific campus will be a facility that boosts collaboration via modern work and laboratory spaces. The new site will include modular green wet labs and green molecular lab design. It will provide a flexible and a customizable state-of-the-art scientific research and development facility to support scientific research.In addition to enhanced R&D laboratory and office space at the new nine-story facility, which is scheduled to open in early 2022, the new campus will house a variety of meeting spaces, an amenity center that includes a number of dining options, a health club and a variety of outdoor recreation areas.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd., or the acquisition of Otezla® (apremilast), including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed, and actual results may differ materially from those we project. Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. We or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.CONTACT: Amgen, Thousand OaksChristopher Lalli, 650-457-3204 (Media) Jessica Akopyan, 805-447-0974 (Media)Trish Hawkins, 805-447-5631 (Media) Arvind Sood, 805-447-1060 (Investors)  View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-selects-location-for-rd-facility-in-the-south-san-francisco-biotechnology-hub-300971372.htmlSOURCE  Amgen"
    },
    {
        "title": "FDA Approves Amgen's AVSOLA(TM) (infliximab-axxq), For The Same Indications As Remicade® (infliximab)",
        "subtitle": "Amgen's Fourth FDA Approval From Biosimilars Portfolio",
        "date": "Dec 6, 2019 2:31PM EST",
        "content": "THOUSAND OAKS, Calif., Dec. 6, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced that the U.S. Food and Drug Administration (FDA) has approved AVSOLA™ (infliximab-axxq) for all approved indications of the reference product, Remicade® (infliximab): for the treatment of moderate-to-severe rheumatoid arthritis (RA), moderate-to-severe Crohn's Disease (CD) in the adult and pediatric population, moderate-to-severe ulcerative colitis (UC) in the adult and pediatric population, chronic severe plaque psoriasis (PsO), psoriatic arthritis (PsA) and ankylosing spondylitis (AS).\"The approval of AVSOLA represents an important milestone across our biosimilar and inflammation portfolios,\" said Murdo Gordon, executive vice president of Global Commercial Operations at Amgen. \"Following July's exciting launches of our two biosimilars in oncology, AVSOLA highlights Amgen's long-term commitment to providing more affordable biological treatment options to patients across critical disease states, including chronic inflammatory conditions.\"AVSOLA, an anti-tumor necrosis factor alpha (anti-TNF) monoclonal antibody, was proven to be highly similar to Remicade with no clinically meaningful differences based on a totality of evidence which included comparative analytical, nonclinical and clinical data. The data package was composed of, in part, results from a pharmacokinetic (PK) similarity study conducted in healthy subjects, and a comparative clinical study conducted in patients with moderate to severe RA. The randomized, double-blind comparative clinical study evaluated the efficacy and safety of AVSOLA compared to Remicade in patients with moderate-to-severe RA. There were 558 patients enrolled and randomized (1:1) to receive either AVSOLA or Remicade at a dose of 3 mg/kg administered as an infusion on day 1, at weeks 2 and 6, and every 8 weeks thereafter. The primary endpoint was the response difference (RD) of 20% improvement in American College of Rheumatology core set measurements (ACR20) at week 22. Key secondary endpoints included DAS28-CRP change from baseline, RD of ACR20, ACR50 and ACR70 at weeks 2, 6, 14, 22, 30, 34, 38, 46 and 50. The study also incorporated the evaluation of a single transition in 119 subjects from Remicade to AVSOLA at week 22, which demonstrated similar safety and immunogenicity in patients who were previously on Remicade. Amgen has a total of 10 biosimilars in its portfolio, four of which have been approved in the U.S., and 3 that are approved in the European Union (EU).About AVSOLA™ (infliximab-axxq) in the U.S. AVSOLA is a biosimilar to Remicade, an anti-tumor necrosis factor alpha (anti-TNF) monoclonal antibody. The active ingredient of AVSOLA is an anti-TNF monoclonal antibody that has the same amino acid sequence as Remicade. AVSOLA also has the same pharmaceutical dosage form and strength as Remicade. AVSOLA is currently not available commercially.  This is not an offer for sale. The following information is derived from the approved label in the U.S.In the U.S., AVSOLA is approved for: Rheumatoid Arthritis AVSOLA, in combination with methotrexate, is indicated for reducing signs and symptoms, inhibiting the progression of structural damage, and improving physical function in patients with moderately to severely active rheumatoid arthritis.Crohn's Disease AVSOLA is indicated forPediatric Crohn's Disease AVSOLA is indicated for reducing signs and symptoms and inducing and maintaining clinical remission in pediatric patients 6 years of age and older with moderately to severely active Crohn's disease who have had an inadequate response to conventional therapy.Ulcerative Colitis AVSOLA is indicated for reducing signs and symptoms, inducing and maintaining clinical remission and mucosal healing, and eliminating corticosteroid use in adult patients with moderately to severely active ulcerative colitis who have had an inadequate response to conventional therapy.Pediatric Ulcerative Colitis AVSOLA is indicated for reducing signs and symptoms and inducing and maintaining clinical remission in pediatric patients 6 years of age and older with moderately to severely active ulcerative colitis who have had an inadequate response to conventional therapy.Plaque Psoriasis AVSOLA is indicated for the treatment of adult patients with chronic severe (i.e., extensive and/or disabling) plaque psoriasis who are candidates for systemic therapy and when other systemic therapies are medically less appropriate. AVSOLA should only be administered to patients who will be closely monitored and have regular follow-up visits with a physician.Psoriatic Arthritis AVSOLA is indicated for reducing signs and symptoms of active arthritis, inhibiting the progression of structural damage, and improving physical function in patients with psoriatic arthritis.Ankylosing SpondylitisAVSOLA is indicated for reducing signs and symptoms in patients with active ankylosing spondylitis.AVSOLA™ U.S. Important Safety InformationSERIOUS INFECTIONSPatients treated with infliximab products are at increased risk for developing serious infections that may lead to hospitalization or death. Most patients who developed these infections were taking concomitant immunosuppressants such as methotrexate or corticosteroids. Discontinue AVSOLA if a patient develops a serious infection or sepsis. Reported infections include: The risks and benefits of treatment with AVSOLA™ should be carefully considered prior to initiating therapy in patients with chronic or recurrent infection. Patients should be closely monitored for the development of signs and symptoms of infection during and after treatment with AVSOLA™, including the possible development of TB in patients who tested negative for latent TB infection prior to initiating therapy, who are on treatment for latent TB, or who were previously treated for TB infection.Risk of infection may be higher in patients greater than 65 years of age, pediatric patients, patients with co-morbid conditions and/or patients taking concomitant immunosuppressant therapy. In clinical trials, other serious infections observed in patients treated with infliximab products included pneumonia, cellulitis, abscess, and skin ulceration.MALIGNANCIESLymphoma and other malignancies, some fatal, have been reported in children and adolescent patients treated with tumor necrosis factor (TNF) blockers, including infliximab products. Approximately half of these cases were lymphomas, including Hodgkin's and non-Hodgkin's lymphoma. The other cases represented a variety of malignancies, including rare malignancies that are usually associated with immunosuppression and malignancies that are not usually observed in children and adolescents. The malignancies occurred after a median of 30 months after the first dose of therapy. Most of the patients were receiving concomitant immunosuppressants.Postmarketing cases of hepatosplenic T-cell lymphoma, a rare type of T-cell lymphoma, have been reported in patients treated with TNF blockers, including infliximab products. These cases have had a very aggressive disease course and have been fatal. The majority of reported cases have occurred in patients with Crohn's disease or ulcerative colitis and most were in adolescent and young adult males. Almost all patients had received treatment with azathioprine or 6-mercaptopurine concomitantly with a TNF-blocker at or prior to diagnosis. Carefully assess the risks and benefits of treatment with AVSOLA™, especially in these patient types.In clinical trials of all TNF inhibitors, more cases of lymphoma were observed compared with controls and the expected rate in the general population. However, patients with Crohn's disease, rheumatoid arthritis, or plaque psoriasis may be at higher risk for developing lymphoma. In clinical trials of some TNF inhibitors, including infliximab products, more cases of other malignancies were observed compared with controls. The rate of these malignancies among patients treated with infliximab products was similar to that expected in the general population, whereas the rate in control patients was lower than expected. Cases of acute and chronic leukemia have been reported with postmarketing TNF-blocker use. As the potential role of TNF inhibitors in the development of malignancies is not known, caution should be exercised when considering treatment of patients with a current or a past history of malignancy or other risk factors such as chronic obstructive pulmonary disease (COPD).Melanoma and Merkel cell carcinoma have been reported in patients treated with TNF-blocker therapy, including infliximab products. Periodic skin examination is recommended for all patients, particularly those with risk factors for skin cancer.A population-based retrospective cohort study found a 2- to 3-fold increase in the incidence of invasive cervical cancer in women with rheumatoid arthritis treated with infliximab compared to biologics-naïve patients or the general population, particularly those over 60 years of age. A causal relationship between infliximab products and cervical cancer cannot be excluded. Periodic screening should continue in women treated with AVSOLA.CONTRAINDICATIONSAVSOLA is contraindicated in patients with moderate to severe (NYHA Class III/IV) congestive heart failure (CHF) at doses greater than 5 mg/kg. Higher mortality rates at the 10 mg/kg dose and higher rates of cardiovascular events at the 5 mg/kg dose have been observed in these patients. AVSOLA should be used with caution and only after consideration of other treatment options. Patients should be monitored closely. Discontinue AVSOLA if new or worsening CHF symptoms appear. AVSOLA should not be (re)administered to patients who have experienced a severe hypersensitivity reaction or to patients with hypersensitivity to murine proteins or other components of the product.HEPATITIS B REACTIVATION TNF inhibitors, including infliximab products, have been associated with reactivation of hepatitis B virus (HBV) in patients who are chronic carriers. Some cases were fatal. Patients should be tested for HBV infection before initiating AVSOLA. For patients who test positive, consult a physician with expertise in the treatment of hepatitis B. Exercise caution when prescribing AVSOLA for patients identified as carriers of HBV and monitor closely for active HBV infection during and following termination of therapy with AVSOLA. Discontinue AVSOLA in patients who develop HBV reactivation and initiate antiviral therapy with appropriate supportive treatment. Exercise caution when considering resumption of TNF blocker‑ therapy and monitor patients closely.HEPATOTOXICITYSevere hepatic reactions, including acute liver failure, jaundice, hepatitis and cholestasis, have been reported in patients receiving infliximab products postmarketing. Some cases were fatal or required liver transplant. Aminotransferase elevations were not noted prior to discovery of liver injury in many cases. Patients with symptoms or signs of liver dysfunction should be evaluated for evidence of liver injury. If jaundice and/or marked liver enzyme elevations (e.g., ≥5 times the upper limit of normal) develop, AVSOLA should be discontinued, and a thorough investigation of the abnormality should be undertaken.HEMATOLOGIC REACTIONS Cases of leukopenia, neutropenia, thrombocytopenia, and pancytopenia (some fatal) have been reported in patients receiving infliximab products. The causal relationship to infliximab product therapy remains unclear. Exercise caution in patients who have ongoing or a history of significant hematologic abnormalities. Advise patients to seek immediate medical attention if they develop signs and symptoms of blood dyscrasias or infection. Consider discontinuation of AVSOLA in patients who develop significant hematologic abnormalities.HYPERSENSITIVITY Infliximab products have been associated with hypersensitivity reactions that differ in their time of onset. Anaphylaxis, urticaria, dyspnea, and hypotension have occurred in association with infusions of infliximab products. Medications for the treatment of hypersensitivity reactions should be available.CARDIOVASCULAR AND CEREBROVASCULAR REACTIONS DURING AND AFTER INFUSIONSerious cerebrovascular accidents, myocardial ischemia/infarction (some fatal), hypotension, hypertension, and arrhythmias have been reported during and within 24 hours of initiation of infliximab product infusion. Cases of transient visual loss have been reported during or within 2 hours of infusion of infliximab. Monitor patients during infusion and if a serious reaction occurs, discontinue infusion. Manage reactions according to signs and symptoms.NEUROLOGIC REACTIONS Agents that inhibit TNF have been associated with CNS manifestation of systemic vasculitis, seizure and new onset or exacerbation of CNS demyelinating disorders, including multiple sclerosis and optic neuritis, and peripheral demyelinating disorders, including Guillain‑Barré syndrome. Exercise caution when considering AVSOLA in patients with these disorders and consider discontinuation if these disorders develop.AUTOIMMUNITY Treatment with infliximab products may result in the formation of autoantibodies and in the development of a lupus‑like syndrome. Discontinue treatment with AVSOLA if symptoms of a lupus-like syndrome develop.ADVERSE REACTIONSIn clinical trials with infliximab products, the most common adverse reactions occurring in >10% of patients included infections (e.g., upper respiratory, sinusitis, and pharyngitis), infusion-related reactions, headache, and abdominal pain. USE WITH OTHER DRUGSConcomitant use of AVSOLA with anakinra, abatacept, tocilizumab, or other biologics used to treat the same conditions as AVSOLA is not recommended because of the possibility of an increased risk of infection. Care should be taken when switching from one biologic to another, since overlapping biological activity may further increase the risk of infection.LIVE VACCINES/THERAPEUTIC INFECTIOUS AGENTS Live vaccines or therapeutic infectious agents should not be given with AVSOLA™ due to the possibility of clinical infections, including disseminated infections.Bring pediatric patients up to date with all vaccinations prior to initiating AVSOLA™. At least a 6-month waiting period following birth is recommended before the administration of any live vaccine to infants exposed in utero to infliximab products.Please see full Prescribing Information, including Boxed WARNINGS, at www.Amgen.com.About Amgen BiosimilarsAmgen is committed to building upon Amgen's experience in the development and manufacturing of innovative human therapeutics to expand Amgen's reach to patients with serious illnesses. Biosimilars will help to maintain Amgen's commitment to connect patients with vital medicines, and Amgen is well positioned to leverage its nearly four decades of experience in biotechnology to create high-quality biosimilars and reliably supply them to patients worldwide.For more information, visit www.amgenbiosimilars.com and follow us on www.twitter.com/amgenbiosim.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.Amgen Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd. or the acquisition of Otezla® (apremilast), including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results.  Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market. Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to acquire other companies or products and to integrate the operations of companies we have acquired may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.CONTACT: Amgen, Thousand OaksKelley Davenport, 202-585-9637 (media)Trish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)   View original content to download multimedia:http://www.prnewswire.com/news-releases/fda-approves-amgens-avsola-infliximab-axxq-for-the-same-indications-as-remicade-infliximab-300970785.htmlSOURCE  Amgen"
    },
    {
        "title": "Abarca, Amgen Enter Outcome-Based Agreement For Enbrel",
        "subtitle": "Agreement reduces the cost to commercial health plans for members who discontinue treatment",
        "date": "Dec 3, 2019 9:10AM EST",
        "content": "AVENTURA, Fla., Dec. 3, 2019 /PRNewswire/ -- Abarca, a pharmacy benefit manager (PBM) that is disrupting the industry with an entirely new approach to technology and business practices, today announced it has entered into an outcomes-based contract with Amgen (NASDAQ: AMGN) for the drug Enbrel® (etanercept). Under the agreement, Amgen will issue rebates to Abarca's clients for eligible members who discontinue the use of the drug after three months of treatment. This applies to members of commercial health plans who are using the drug for the treatment of moderate to severe rheumatoid arthritis.\"This is a win for all parties,\" said Jason Borschow, president and CEO of Abarca. \"It will provide Amgen valuable information about how Enbrel® is utilized, it will lower costs for plans, and it will bring additional benefits to our healthcare system.\" Drugs that treat auto-immune conditions are the fastest-growing segment for commercial health plans. Enbrel® is a biologic medicine used to treat five inflammatory conditions and is one of the most highly utilized specialty drugs for this market. Outcome-based agreements have been a hot topic in the healthcare industry for several years. However, because most PBMs do not have the technology in place to track and report when a member discontinues a drug, relatively few have been implemented. The agreement announced today was made possible by Darwin, Abarca's smarter PBM platform, which tracks utilization in real-time and generates the detailed information drug makers need to issue a rebate. This is the second outcome-based between Abarca and Amgen. In 2018, the companies entered into an arrangement for Repatha--the first agreement of its kind involving this drug. That same year, Abarca announced an outcomes-based contract with Biogen for medications used to treat multiple sclerosis. \"Amgen has been a great partner,\" continued Borschow. \"Their dedication to learning about how patients interact with their medications is admirable, and we are looking forward to continuing to work together to find new approaches to serve our clients and members.\" Abarca is currently collaborating with several drug manufacturers for similar agreements. To learn more, visit abarcahealth.com.About AbarcaAbarca is igniting a revolution in healthcare. It started by redefining pharmacy benefits, but this is just the beginning. It is built on the belief that there is a better way for people and companies to work together, connect with each other, and make healthcare awesome for everyone. With smarter technology and a straightforward approach to business, Abarca provides a much better experience and higher value for payers and consumers. For nearly a decade, they have challenged many industry conventions and trampled on a few. So, call them a PBM for discussion purposes, but they are unlike any other company out there. Join the revolution at abarcahealth.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/abarca-amgen-enter-outcome-based-agreement-for-enbrel-300968062.htmlSOURCE  Abarca"
    },
    {
        "title": "Amgen Announces Data Being Presented At ASH 2019",
        "subtitle": "Results From Phase 3 CANDOR Study Evaluating KYPROLIS® (Carfilzomib) in Combination With DARZALEX® (Daratumumab) in Relapsed or Refractory Multiple Myeloma Patients Accepted as Late-Breaking Abstract",
        "date": "Dec 2, 2019 4:00PM EST",
        "content": "THOUSAND OAKS, Calif., Dec. 2, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced new clinical data from its oncology in-line products and pipeline that will be presented at the 61st American Society of Hematology (ASH) Annual Meeting & Exposition in Orlando, Dec. 7-10, 2019. The Phase 3 CANDOR study, which was accepted as a late-breaking abstract, evaluated KYPROLIS® (carfilzomib) in combination with dexamethasone and DARZALEX® (daratumumab) (KdD) compared to KYPROLIS and dexamethasone alone (Kd) in patients with relapsed or refractory multiple myeloma. Additional data from Amgen's hematology franchise will include new results from the bispecific T cell engager (BiTE®) platform across multiple blood cancers, including multiple myeloma, acute myeloid leukemia, acute lymphoblastic leukemia (ALL), diffuse large B-cell lymphoma and non-Hodgkin's lymphoma.\"The late-breaking abstract from the CANDOR study evaluating KYPROLIS with an anti-CD38 monoclonal antibody demonstrates that by combining these two powerful agents, this regimen has the potential to be practice-changing for the treatment of patients with relapsed or refractory multiple myeloma,\" said David M. Reese, M.D., executive vice president of Research and Development at Amgen. Additionally, data from study AALL1331 conducted by the Children's Oncology Group (COG) evaluating BLINCYTO® (blinatumomab) versus chemotherapy in first relapse of childhood B-lymphoblastic leukemia (B-ALL) were accepted as a late-breaking abstract. AALL1331 is sponsored by the Cancer Therapy Evaluation Program of the National Cancer Institute (NCI), part of the National Institutes of Health, and is conducted by the NCI-funded COG. Amgen provided BLINCYTO for the study under a Collaborative Research and Development Agreement between the NCI and Amgen. BLINCYTO, which was approved in 2014, is the first and only approved BiTE molecule. \"The data being presented at ASH demonstrate our commitment to furthering the science of our in-line products, including KYPROLIS and BLINCYTO, while also advancing our pipeline of innovative BiTE molecules which could potentially provide new treatment approaches for patients across blood cancers for which there remains high unmet need,\" continued Reese. A complete listing of Amgen's abstracts is available on the ASH website. Notable abstracts include:KYPROLIS Amgen Sponsored AbstractsKYPROLIS Investigator Led Abstracts   BLINCYTO Amgen Sponsored AbstractsBLINCYTO Investigator Led Abstracts   XGEVA® (denosumab)Oncology PipelineAbout CANDOR CANDOR, a randomized, open-label Phase 3 study of KYPROLIS, dexamethasone and DARZALEX (KdD) compared to KYPROLIS and dexamethasone (Kd), has evaluated 466 relapsed or refractory multiple myeloma patients who have received one to three prior therapies. Patients were treated until disease progression. The primary endpoint was PFS, and the key secondary endpoints were overall response rate, minimal residual disease and overall survival. PFS was defined as time from randomization until disease progression or death from any cause.In the first arm, patients received KYPROLIS twice weekly at 56 mg/m2 and dexamethasone in combination with DARZALEX. In the second arm (control), patients received KYPROLIS twice weekly at 56 mg/m2 and dexamethasone.CANDOR was initiated as part of a collaboration with Janssen, and under the terms of the agreement, Janssen co-funded the study. For more information about this trial, please visit www.clinicaltrials.gov under trial identification number NCT03158688.About the COG AALL1331 StudyThe COG AALL1331 study is a risk-stratified, randomized, Phase 3 trial of blinatumomab in first relapse of pediatric B-ALL to evaluate disease-free survival (DFS) of high-risk (HR) and intermediate-risk (IR) relapsed B-ALL patients who are randomized following induction block 1 chemotherapy to receive either two intensive chemotherapy blocks or two 5-week blocks of blinatumomab. It also compares the DFS of low risk (LR) relapse B-ALL patients who are randomized following block 1 chemotherapy to receive either chemotherapy alone or chemotherapy plus blinatumomab. Key secondary endpoints include overall survival of HR, IR, and LR relapsed B-ALL patients. This is a global study that is being conducted in Australia, Canada, New Zealand and United States. Click here to read about the trial on ClinicalTrials.gov.About Multiple MyelomaMultiple myeloma is an incurable blood cancer, characterized by a recurring pattern of remission and relapse.1 It is a rare and life-threatening disease that accounts for approximately one percent of all cancers.2,3 Worldwide, approximately 160,000 people are diagnosed with multiple myeloma each year, and 106,000 patient deaths are reported on an annual basis.2About KYPROLIS® (carfilzomib)Proteasomes play an important role in cell function and growth by breaking down proteins that are damaged or no longer needed.4 KYPROLIS has been shown to block proteasomes, leading to an excessive build-up of proteins within cells.5 In some cells, KYPROLIS can cause cell death, especially in myeloma cells because they are more likely to contain a higher amount of abnormal proteins.4,5Since its first approval in 2012, more than 125,000 patients worldwide have received KYPROLIS. KYPROLIS is approved in the U.S. for the following:KYPROLIS is also approved in Algeria, Argentina, Australia, Bahrain, Belarus, Brazil, Canada, Chile, Colombia, Ecuador, Egypt, European Union, Hong Kong, India, Israel, Japan, Jordan, Kuwait, Lebanon, Macao, Malaysia, Mexico, Morocco, New Zealand, Oman, Philippines, Qatar, Russia, Saudi Arabia, Singapore, S. Korea, Switzerland, Taiwan, Thailand, Turkey and United Arab Emirates.Important U.S. KYPROLIS® (carfilzomib) Safety InformationCardiac ToxicitiesAcute Renal FailureTumor Lysis SyndromePulmonary ToxicityPulmonary HypertensionDyspneaHypertensionVenous ThrombosisInfusion ReactionsHemorrhageThrombocytopeniaHepatic Toxicity and Hepatic FailureThrombotic MicroangiopathyPosterior Reversible Encephalopathy Syndrome (PRES)Increased Fatal and Serious Toxicities in Combination with Melphalan and Prednisone in Newly Diagnosed Transplant-ineligible PatientsEmbryo-fetal ToxicityADVERSE REACTIONSPlease see full Prescribing Information at www.kyprolis.com.About ALL and MRDALL is a rapidly progressing cancer of the blood and bone marrow that occurs in both adults and children.6,7 Poor outcomes have been observed in patients who achieve first or second complete hematologic remission but are persistently MRD-positive, which currently remains detectable at the molecular level after treatment.8,9 For more information about MRD, please visit AmgenOncology.com.About BiTE® TechnologyBispecific T cell engager (BiTE®) technology is a targeted immuno-oncology platform that is designed to engage patients' own T cells to any tumor-specific antigen, activating the cytotoxic potential of T cells to eliminate detectable cancer. The BiTE immuno-oncology platform has the potential to treat different tumor types through tumor-specific antigens. The BiTE platform leads to off-the-shelf solutions, which have the potential to make innovative T cell treatment available to all providers when their patients need it. Amgen is advancing more than a dozen BiTE molecules across a broad range of hematologic malignancies and solid tumors, further investigating BiTE technology with the goal of enhancing patient experience and therapeutic potential.About BLINCYTO® (blinatumomab)BLINCYTO is a bispecific CD19-directed CD3 T cell engager (BiTE®) antibody construct that binds specifically to CD19 expressed on the surface of cells of B-lineage origin and CD3 expressed on the surface of T cells.BiTE antibody constructs are a type of immunotherapy being investigated for fighting cancer by helping the body's immune system to detect and target malignant cells. The modified antibodies are designed to engage two different targets simultaneously, thereby juxtaposing T cells (a type of white blood cell capable of killing other cells perceived as threats) to cancer cells. BiTE antibody constructs help place the T cells within reach of the targeted cell, with the intent of allowing T cells to inject toxins and trigger the cancer cell to die (apoptosis). BiTE antibody constructs are currently being investigated for their potential to treat a wide variety of cancers.BLINCYTO was granted breakthrough therapy and priority review designations by the U.S. Food and Drug Administration and is approved in the U.S. for the treatment of:In the European Union (EU), BLINCYTO is indicated as monotherapy for the treatment of:IMPORTANT SAFETY INFORMATIONWARNING: CYTOKINE RELEASE SYNDROME and NEUROLOGICAL TOXICITIESContraindicationsBLINCYTO® is contraindicated in patients with a known hypersensitivity to blinatumomab or to any component of the product formulation.Warnings and PrecautionsAdverse ReactionsDosage and Administration GuidelinesPlease see full Prescribing Information and medication guide for BLINCYTO at www.BLINCYTO.com.About Multiple Myeloma and Bone ComplicationsMultiple myeloma is the second most common hematologic cancer, and it develops in plasma cells located in the bone marrow microenvironment.2,10 It is typically characterized by osteolytic bone lesions as well as renal failure, which are both part of diagnosis (CRAB criteria).11 Each year an estimated 160,000 new cases of multiple myeloma are diagnosed worldwide, resulting in more than 106,000 deaths per year.2More than 90 percent of patients develop osteolytic lesions during the course of the disease.12 Preventing bone complications is a critical aspect of caring for patients with multiple myeloma, because these events can result in significant morbidity.13 Current treatment options to prevent bone complications are limited to bisphosphonates, including zoledronic acid, which are cleared through the kidneys.14 Approximately 60 percent of all multiple myeloma patients have or will develop renal impairment over the course of the disease.15About XGEVA® (denosumab)XGEVA targets the RANKL pathway to prevent the formation, function and survival of osteoclasts, which break down bone. XGEVA is indicated for the prevention of skeletal-related events in patients with multiple myeloma and in patients with bone metastases from solid tumors. XGEVA is also indicated for treatment of adults and skeletally mature adolescents with giant cell tumor of bone that is unresectable or where surgical resection is likely to result in severe morbidity and for the treatment of hypercalcemia of malignancy refractory to bisphosphonate therapy.INDICATIONSXGEVA® is indicated for the prevention of skeletal-related events in patients with multiple myeloma and in patients with bone metastases from solid tumors. XGEVA® is indicated for treatment of adults and skeletally mature adolescents with giant cell tumor of bone that is unresectable or where surgical resection is likely to result in severe morbidity. XGEVA® is indicated for the treatment of hypercalcemia of malignancy refractory to bisphosphonate therapy.IMPORTANT SAFETY INFORMATIONImportant Safety InformationHypocalcemiaPre-existing hypocalcemia must be corrected prior to initiating therapy with XGEVA®. XGEVA® can cause severe symptomatic hypocalcemia, and fatal cases have been reported. Monitor calcium levels, especially in the first weeks of initiating therapy, and administer calcium, magnesium, and vitamin D as necessary. Monitor levels more frequently when XGEVA® is administered with other drugs that can also lower calcium levels. Advise patients to contact a healthcare professional for symptoms of hypocalcemia.An increased risk of hypocalcemia has been observed in clinical trials of patients with increasing renal dysfunction, most commonly with severe dysfunction (creatinine clearance less than 30 mL/minute and/or on dialysis), and with inadequate/no calcium supplementation. Monitor calcium levels and calcium and vitamin D intake.HypersensitivityXGEVA® is contraindicated in patients with known clinically significant hypersensitivity to XGEVA®, including anaphylaxis that has been reported with use of XGEVA®. Reactions may include hypotension, dyspnea, upper airway edema, lip swelling, rash, pruritus, and urticaria. If an anaphylactic or other clinically significant allergic reaction occurs, initiate appropriate therapy and discontinue XGEVA® therapy permanently.Drug Products with Same Active IngredientPatients receiving XGEVA® should not take Prolia® (denosumab).Osteonecrosis of the JawOsteonecrosis of the jaw (ONJ) has been reported in patients receiving XGEVA®, manifesting as jaw pain, osteomyelitis, osteitis, bone erosion, tooth or periodontal infection, toothache, gingival ulceration, or gingival erosion. Persistent pain or slow healing of the mouth or jaw after dental surgery may also be manifestations of ONJ. In clinical trials in patients with cancer, the incidence of ONJ was higher with longer duration of exposure.Patients with a history of tooth extraction, poor oral hygiene, or use of a dental appliance are at a greater risk to develop ONJ. Other risk factors for the development of ONJ include immunosuppressive therapy, treatment with angiogenesis inhibitors, systemic corticosteroids, diabetes, and gingival infections.Perform an oral examination and appropriate preventive dentistry prior to the initiation of XGEVA® and periodically during XGEVA® therapy. Advise patients regarding oral hygiene practices. Avoid invasive dental procedures during treatment with XGEVA®. Consider temporarily interrupting XGEVA® therapy if an invasive dental procedure must be performed.Patients who are suspected of having or who develop ONJ while on XGEVA® should receive care by a dentist or an oral surgeon. In these patients, extensive dental surgery to treat ONJ may exacerbate the condition.Atypical Subtrochanteric and Diaphyseal Femoral FractureAtypical femoral fracture has been reported with XGEVA®. These fractures can occur anywhere in the femoral shaft from just below the lesser trochanter to above the supracondylar flare and are transverse or short oblique in orientation without evidence of comminution.Atypical femoral fractures most commonly occur with minimal or no trauma to the affected area. They may be bilateral and many patients report prodromal pain in the affected area, usually presenting as dull, aching thigh pain, weeks to months before a complete fracture occurs. A number of reports note that patients were also receiving treatment with glucocorticoids (e.g. prednisone) at the time of fracture. During XGEVA® treatment, patients should be advised to report new or unusual thigh, hip, or groin pain. Any patient who presents with thigh or groin pain should be suspected of having an atypical fracture and should be evaluated to rule out an incomplete femur fracture. Patients presenting with an atypical femur fracture should also be assessed for symptoms and signs of fracture in the contralateral limb. Interruption of XGEVA® therapy should be considered, pending a risk/benefit assessment, on an individual basis.Hypercalcemia Following Treatment Discontinuation in Patients with Giant Cell Tumor of Bone (GCTB) and in Patients with Growing SkeletonsClinically significant hypercalcemia requiring hospitalization and complicated by acute renal injury has been reported in XGEVA®-treated patients with GCTB and in patients with growing skeletons within one year of treatment discontinuation. Monitor patients for signs and symptoms of hypercalcemia after treatment discontinuation and treat appropriately.Multiple Vertebral Fractures (MVF) Following Treatment DiscontinuationMultiple vertebral fractures (MVF) have been reported following discontinuation of treatment with denosumab. Patients at higher risk for MVF include those with risk factors for or a history of osteoporosis or prior fractures. When XGEVA® treatment is discontinued, evaluate the individual patient's risk for vertebral fractures.Embryo-Fetal ToxicityXGEVA® can cause fetal harm when administered to a pregnant woman. Based on findings in animals, XGEVA® is expected to result in adverse reproductive effects.Advise females of reproductive potential to use effective contraception during therapy, and for at least 5 months after the last dose of XGEVA®. Apprise the patient of the potential hazard to a fetus if XGEVA® is used during pregnancy or if the patient becomes pregnant while patients are exposed to XGEVA®.Adverse ReactionsThe most common adverse reactions in patients receiving XGEVA® with bone metastasis from solid tumors were fatigue/asthenia, hypophosphatemia, and nausea. The most common serious adverse reaction was dyspnea. The most common adverse reactions resulting in discontinuation were osteonecrosis and hypocalcemia.For multiple myeloma patients receiving XGEVA®, the most common adverse reactions were diarrhea, nausea, anemia, back pain, thrombocytopenia, peripheral edema, hypocalcemia, upper respiratory tract infection, rash, and headache. The most common serious adverse reaction was pneumonia. The most common adverse reaction resulting in discontinuation of XGEVA® was osteonecrosis of the jaw.The most common adverse reactions in patients receiving XGEVA® for giant cell tumor of bone were arthralgia, headache, nausea, back pain, fatigue, and pain in extremity. The most common serious adverse reactions were osteonecrosis of the jaw and osteomyelitis.The most common adverse reactions resulting in discontinuation of XGEVA® were osteonecrosis of the jaw and tooth abscess or tooth infection.The most common adverse reactions in patients receiving XGEVA® for hypercalcemia of malignancy were nausea, dyspnea, decreased appetite, headache, peripheral edema, vomiting, anemia, constipation, and diarrhea.Please visit www.xgeva.com for Full U.S. Prescribing Information.About Amgen Oncology Amgen Oncology is searching for and finding answers to incredibly complex questions that will advance care and improve lives for cancer patients and their families. Our research drives us to understand the disease in the context of the patient's life – not just their cancer journey – so they can take control of their lives.For the last four decades, we have been dedicated to discovering the firsts that matter in oncology and to finding ways to reduce the burden of cancer. Building on our heritage, Amgen continues to advance the largest pipeline in the Company's history, moving with great speed to advance those innovations for the patients who need them. At Amgen, we are driven by our commitment to transform the lives of cancer patients and keep them at the center of everything we do.    For more information, follow us on www.twitter.com/amgenoncology.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd., or the acquisition of Otezla® (apremilast), including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.The scientific information discussed in this news release related to our product candidates is preliminary and investigative. Such product candidates are not approved by the U.S. Food and Drug Administration, and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates. Further, any scientific information discussed in this news release relating to new indications for our products is preliminary and investigative and is not part of the labeling approved by the U.S. Food and Drug Administration for the products. The products are not approved for the investigational use(s) discussed in this news release, and no conclusions can or should be drawn regarding the safety or effectiveness of the products for these uses.CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974Trish Hawkins, 805-447-5631 (Media)Arvind Sood, 805-447-1060 (Investors)References:   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-announces-data-being-presented-at-ash-2019-300967666.htmlSOURCE  Amgen"
    },
    {
        "title": "Thinking about trading options or stock in Amgen, The Medicines Company, Netflix, NVIDIA, or Charles Schwab?",
        "subtitle": "",
        "date": "Nov 26, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 26, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMGN, MDCO, NFLX, NVDA, and SCHW.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amgen-the-medicines-company-netflix-nvidia-or-charles-schwab-300965394.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Amgen Completes Acquisition Of Otezla® (apremilast)",
        "subtitle": "Differentiated Therapy Strengthens Amgen's Long-Standing Expertise in Inflammation",
        "date": "Nov 21, 2019 6:21AM EST",
        "content": "THOUSAND OAKS, Calif., Nov. 21, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced the successful completion of its acquisition of worldwide rights to Otezla® (apremilast), the only oral, non-biologic treatment for moderate-to-severe plaque psoriasis and psoriatic arthritis. Otezla was acquired from Celgene Corporation (NASDAQ:CELG) in connection with its previously announced merger with Bristol-Myers Squibb Company (NYSE:BMY), which was completed on Nov. 20.Otezla is an important treatment in the post-topical, pre-biologic segment in its approved indications in the U.S., including the treatment of patients with moderate-to-severe plaque psoriasis who are candidates for phototherapy or systemic therapy; adult patients with active psoriatic arthritis; and adult patients with oral ulcers associated with Behçet's Disease.Otezla is approved in more than 50 markets outside the U.S., including the European Union and Japan.\"As the prevalence of chronic inflammatory diseases increases worldwide, Otezla represents a unique opportunity to further Amgen's mission of bringing innovative medicines to patients, while building on our long-standing expertise in inflammation,\" said Robert A. Bradway, chairman and chief executive officer at Amgen. \"We look forward to working with the dedicated professionals joining us from Celgene to help realize the global potential of Otezla as an important option for patients.\"The closing of the Otezla acquisition offers Amgen many potential benefits including:\"This move also provides Amgen with an important strategic product offering new opportunities for growth and serving patients,\" Bradway said.Terms of the Acquisition and 2019 GuidanceOtezla, along with certain related assets and liabilities, was acquired for $13.4 billion in cash, or approximately $11.2 billion, net of the present value of $2.2 billion in anticipated future cash tax benefits.With the closing of the Otezla acquisition, the Company is updating its overall 2019 guidance. For the full year 2019, the Company now expects total revenues in the range of $23.1 billion to $23.3 billion. Previously, the Company expected total revenues in the range of $22.8 billion to $23.0 billion. On a GAAP basis, the Company now expects earnings per share (EPS) in the range of $12.50 to $12.75. Previously, the Company expected GAAP EPS in the range of $12.50 to $12.80. The updated GAAP guidance reflects charges between close and the end of the year related to the intangibles and inventory acquired. On a non-GAAP basis, the Company now expects EPS in the range of $14.50 to $14.70. Previously, the Company expected non-GAAP EPS in the range of $14.20 to $14.45. About OTEZLA® (apremilast)OTEZLA® (apremilast) 30 mg tablets is an oral small-molecule inhibitor of phosphodiesterase 4 (PDE4) specific for cyclic adenosine monophosphate (cAMP). PDE4 inhibition results in increased intracellular cAMP levels, which is thought to indirectly modulate the production of inflammatory mediators. The specific mechanism(s) by which OTEZLA exerts its therapeutic action in patients is not well defined.U.S. INDICATIONSOtezla® (apremilast) is indicated for the treatment of patients with moderate to severe plaque psoriasis who are candidates for phototherapy or systemic therapy.Otezla is indicated for the treatment of adult patients with active psoriatic arthritis.Otezla is indicated for the treatment of adult patients with oral ulcers associated with Behçet's Disease.U.S. IMPORTANT SAFETY INFORMATIONContraindicationsOtezla® (apremilast) is contraindicated in patients with a known hypersensitivity to apremilast or to any of the excipients in the formulation.Warnings and PrecautionsDiarrhea, Nausea and Vomiting: Cases of severe diarrhea, nausea, and vomiting were associated with the use of Otezla. Most events occurred within the first few weeks of treatment. In some cases patients were hospitalized. Patients 65 years of age or older and patients taking medications that can lead to volume depletion or hypotension may be at a higher risk of complications from severe diarrhea, nausea, or vomiting. Monitor patients who are more susceptible to complications of diarrhea or vomiting; advise patients to contact their healthcare provider. Consider Otezla dose reduction or suspension if patients develop severe diarrhea, nausea, or vomiting.Depression: Carefully weigh the risks and benefits of treatment with Otezla for patients with a history of depression and/or suicidal thoughts/behavior, or in patients who develop such symptoms while on Otezla. Patients, caregivers, and families should be advised of the need to be alert for the emergence or worsening of depression, suicidal thoughts or other mood changes, and they should contact their healthcare provider if such changes occur.Weight Decrease: Monitor body weight regularly; evaluate unexplained or clinically significant weight loss, and consider discontinuation of Otezla.Drug Interactions: Apremilast exposure was decreased when Otezla was co-administered with rifampin, a strong CYP450 enzyme inducer; loss of Otezla efficacy may occur. Concomitant use of Otezla with CYP450 enzyme inducers (e.g., rifampin, phenobarbital, carbamazepine, phenytoin) is not recommended.Adverse ReactionsPsoriasis: Adverse reactions reported in ≥5% of patients were (Otezla%, placebo%): diarrhea (17, 6), nausea (17, 7), upper respiratory tract infection (9, 6), tension headache (8, 4), and headache (6, 4).Psoriatic Arthritis: Adverse reactions reported in at least 2% of patients taking Otezla, that occurred at a frequency at least 1% higher than that observed in patients taking placebo, for up to 16 weeks (after the initial 5-day titration), were (Otezla%, placebo%): diarrhea (7.7, 1.6); nausea (8.9, 3.1); headache (5.9, 2.2); upper respiratory tract infection (3.9, 1.8); vomiting (3.2, 0.4); nasopharyngitis (2.6, 1.6); upper abdominal pain (2.0, 0.2).Behçet's Disease: Adverse reactions reported in at least ≥5% of patients taking Otezla, that occurred at a frequency at least 1% higher than that observed in patients taking placebo, for up to 12 weeks were (Otezla%, placebo%): diarrhea (41.3, 20.4); nausea (19.2, 10.7); headache (14.4, 10.7); upper respiratory tract infection (11.5, 4.9); upper abdominal pain (8.7, 1.9), vomiting (8.7, 1.9); back pain (7.7, 5.8); viral upper respiratory tract infection (6.7, 4.9); arthralgia (5.8, 2.9).Use in Specific PopulationsPregnancy: Otezla has not been studied in pregnant women. Advise pregnant women of the potential risk of fetal loss. Consider pregnancy planning and prevention for females of reproductive potential. There is a pregnancy exposure registry that monitors pregnancy outcomes in women exposed to Otezla during pregnancy. Information about the registry can be obtained by calling 1-877-311-8972 or visiting https://mothertobaby.org/ongoing-study/otezla/.Lactation: There are no data on the presence of apremilast or its metabolites in human milk, the effects of apremilast on the breastfed infant, or the effects of the drug on milk production. The developmental and health benefits of breastfeeding should be considered along with the mother's clinical need for Otezla and any potential adverse effects on the breastfed child from Otezla or from the underlying maternal condition.Renal Impairment: Otezla dosage should be reduced in patients with severe renal impairment (creatinine clearance less than 30 mL/min); for details, see Dosage and Administration, Section 2, in the Full Prescribing Information.Please click here for Otezla® Full Prescribing Information.Otezla® is a registered trademark.Non-GAAP Financial MeasuresIn this news release, management has presented earnings per share guidance for 2019, in accordance with U.S. Generally Accepted Accounting Principles (GAAP) and on a non-GAAP basis. This non-GAAP financial measure is computed by excluding certain items related to acquisitions, restructuring and certain other items from the related GAAP financial measures. A reconciliation for this non-GAAP financial measure to the most directly comparable GAAP financial measure is included in the news release. The Company believes that its presentation of non-GAAP financial measures provides useful supplementary information to and facilitates additional analysis by investors. The Company uses certain non-GAAP financial measures to enhance an investor's overall understanding of the financial performance and prospects for the future of the Company's ongoing business activities by facilitating comparisons of results of ongoing business operations among current, past and future periods. The Company uses the non-GAAP financial measures set forth in the news release in connection with its own budgeting and financial planning internally to evaluate the performance of the business, including to allocate resources and to evaluate results relative to incentive compensation targets. The non-GAAP financial measures are in addition to, not a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.Amgen Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market. The acquisition of Otezla may result in unanticipated costs, delays or other operational or financial problems related to integrating the Otezla business with our company, which may divert our management's attention from other business issues and opportunities and restrict the full realization of the anticipated benefits of the transaction within the expected timeframe or at all. Further, failures or difficulties in integrating or retaining new personnel or in integrating the operations of the Otezla business, products or assets we acquire (including related technology, commercial operations, compliance programs, manufacturing, distribution and general business operations and procedures, and failures or difficulties relating to any transition services agreements, supply agreements, toll manufacturing agreements, and intellectual property licensing and transfer agreements) may affect our ability to realize the benefits of the transaction and grow our business, and may result in us incurring asset impairment or restructuring charges. These and/or other challenges may arise in connection with our acquisition of Otezla or other acquisition activities, which could have a material adverse effect on our business, results of operations and stock price.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974 (media)Trish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-completes-acquisition-of-otezla-apremilast-300962932.htmlSOURCE  Amgen"
    },
    {
        "title": "New Results From COSMIC-HF Presented At AHA 2019 Show Treatment Of Heart Failure Patients With Omecamtiv Mecarbil Was Associated With Neutral Or Improved Measures Of Diastolic Function",
        "subtitle": "",
        "date": "Nov 18, 2019 9:00AM EST",
        "content": "THOUSAND OAKS, Calif., SOUTH SAN FRANCISCO, Calif., and SURESNES, France, Nov. 18, 2019 /PRNewswire/ -- Amgen (NASDAQ: AMGN), Cytokinetics, Incorporated (NASDAQ: CYTK) and Servier announced that new results from COSMIC-HF (Chronic Oral Study of Myosin Activation to Increase Contractility in Heart Failure), a Phase 2 trial evaluating omecamtiv mecarbil in patients with heart failure with reduced ejection fraction (HFrEF), will be presented today at the American Heart Association's (AHA) Scientific Sessions 2019 in Philadelphia. In patients with HFrEF treated with omecamtiv mecarbil, in addition to previously reported improvements in cardiac contractility measures (including systolic function, or pumping action of the heart), measures of diastolic function were not different from placebo and, for some measures, trended towards improvement. \"The results show that, in addition to increasing the pumping action of the heart (systolic function), omecamtiv mecarbil did not change and for some measures was consistent with improvement of the heart's diastolic function, or ability to relax between heartbeats,\" said Tor Biering-Sørensen, M.D., Herlev & Gentofte Hospital and Associate Professor, University of Copenhagen, who will present the data at AHA. \"Today, half of heart failure patients will die within five years of diagnosis, underscoring the urgent need for new therapies that address a central driver of this condition: to increase the heart's pumping action without adversely affecting how the heart fills,\" said John Teerlink, M.D., Professor of Clinical Medicine, University of California San Francisco, Director of Heart Failure, San Francisco Veterans Affairs Medical Center and Executive Committee Chair, COSMIC-HF and GALACTIC-HF.  Key findingsIn COSMIC-HF, 448 patients with stable, symptomatic heart failure and left ventricular ejection fraction (LVEF) <40% were randomly assigned to omecamtiv mecarbil [25 mg twice daily (n=150); or 25 mg twice daily with pharmacokinetic-guided dose selection to 50 mg twice daily (PK group, n=149)] or placebo (n=149) in a double-blind fashion for 20 weeks. This post-hoc analysis assessed the effect of chronic therapy with omecamtiv mecarbil by treatment group on echocardiographic measures of diastolic function, including early (E-wave) and late (A-wave) peak mitral inflow velocities, early peak myocardial relaxation velocity (e'), isovolumic relaxation time (IVRT), tricuspid regurgitation velocity (TRV) and diastolic filling time.In patients with HFrEF who received omecamtiv mecarbil, systolic ejection time increased as previously reported and expected, while diastolic filling time was not reduced, nor were diastolic parameters worsened. Specifically, in patients receiving omecamtiv mecarbil E-wave velocity, E/A-ratio, and E/e' or e' were not significantly changed compared to placebo. There was a small increase (<5 ms) in the duration of the IVRT, and in the PK group, TRV, an indicator of pulmonary pressure, improved significantly during treatment with omecamtiv mecarbil therapy.About Omecamtiv Mecarbil and the Phase 3 Clinical Trials ProgramOmecamtiv mecarbil is a novel, selective cardiac myosin activator, also known as a cardiac myotrope1, that binds to the catalytic domain of myosin. Preclinical research has shown that cardiac myotropes increase cardiac contractility without affecting intracellular myocyte calcium concentrations or myocardial oxygen consumption.2-4 Cardiac myosin is the cytoskeletal motor protein in the cardiac muscle cell that is directly responsible for converting chemical energy into the mechanical force resulting in cardiac contraction.Omecamtiv mecarbil is being developed for the potential treatment of heart failure with reduced ejection fraction under a collaboration between Amgen and Cytokinetics, with funding and strategic support from Servier. Omecamtiv mecarbil is the subject of a comprehensive Phase 3 clinical trials program composed of GALACTIC-HF (Global Approach to Lowering Adverse Cardiac Outcomes Through Improving Contractility in Heart Failure), a Phase 3 clinical trial designed to evaluate the effect of treatment with omecamtiv mecarbil compared to placebo on cardiovascular outcomes and METEORIC-HF (Multicenter Exercise Tolerance Evaluation of Omecamtiv Mecarbil Related to Increased Contractility in Heart Failure), a Phase 3 clinical trial designed to evaluate the effect of treatment with omecamtiv mecarbil compared to placebo on exercise capacity.GALACTIC-HF, one of the largest Phase 3 global cardiovascular outcomes studies in heart failure ever conducted, has now completed enrollment of more than 8,200 patients in 35 countries. It is designed to evaluate whether treatment with omecamtiv mecarbil, when added to standard of care, reduces the risk of heart failure events (heart failure hospitalization and other urgent treatment for heart failure) and CV death in patients with HFrEF.About Heart FailureHeart failure is a grievous condition that affects more than 64 million people worldwide5 about half of whom have reduced left ventricular function.6,7 It is the leading cause of hospitalization and readmission in people age 65 and older.8,9 Despite broad use of standard treatments and advances in care, the prognosis for patients with heart failure is poor.10 An estimated one in five people over the age of 40 are at risk of developing heart failure, and approximately 50 percent of people diagnosed with heart failure will die within five years of initial hospitalization.11,12 About COSMIC-HF Results from COSMIC-HF (Chronic Oral Study of Myosin Activation to Increase Contractility in Heart Failure) were obtained from 448 patients with chronic heart failure due to HFrEF and showed that PK-based dose adjustment controlled patient exposure to omecamtiv mecarbil. Statistically significant increases in all pre-specified secondary endpoint measures of cardiac function in the PK group, including measures of left ventricular function were also observed after 20 weeks of treatment with omecamtiv mecarbil compared to placebo. Adverse events (AEs), including serious AEs, in patients on omecamtiv mecarbil were comparable to placebo. The incidence of adjudicated deaths was similar. Other cardiac AEs were generally balanced between placebo and active treatment groups. In patients receiving omecamtiv mecarbil compared to placebo, cardiac troponin increased by 0.001 ng/mL and 0.006 ng/mL (median change from baseline at week 20) in the 25 mg twice daily group and 50 mg twice daily dose titration group, respectively. Events of increased troponin (n=278 across all treatment groups) were independently adjudicated and none were adjudicated as an episode of myocardial ischemia or infarction. Primary results from COSMIC-HF were published in The Lancet in 2016.13 COSMIC-HF was conducted by Amgen in collaboration with Cytokinetics.About Cytokinetics and Amgen Collaboration In 2006, Cytokinetics and Amgen entered into a strategic alliance to discover, develop and commercialize novel small molecule therapeutics designed to activate the cardiac sarcomere for the potential treatment of heart failure. Omecamtiv mecarbil is being developed by Amgen in collaboration with Cytokinetics, with funding and strategic support from Servier. Amgen holds an exclusive, worldwide license to omecamtiv mecarbil and related compounds, subject to Cytokinetics' specified development and commercialization rights. Cytokinetics is eligible for pre-commercialization and commercialization milestone payments and royalties that escalate based on increasing levels of annual net sales of products commercialized under the agreement. Cytokinetics has co-invested with Amgen in the Phase 3 development program of omecamtiv mecarbil in exchange for increased royalties from Amgen on worldwide sales of omecamtiv mecarbil outside Japan and co-promotion rights in institutional care settings in North America.  Amgen has also entered an alliance with Servier for exclusive commercialization rights for omecamtiv mecarbil in Europe as well as the Commonwealth of Independent States, including Russia. Servier contributes funding for development and provides strategic support to the program.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. About CytokineticsCytokinetics is a late-stage biopharmaceutical company focused on discovering, developing and commercializing first-in-class muscle activators and best-in-class muscle inhibitors as potential treatments for debilitating diseases in which muscle performance is compromised and/or declining. As a leader in muscle biology and the mechanics of muscle performance, the company is developing small molecule drug candidates specifically engineered to impact muscle function and contractility. Cytokinetics is collaborating with Amgen Inc. (Amgen) to develop omecamtiv mecarbil, a novel cardiac muscle activator. Omecamtiv mecarbil is the subject of an international clinical trials program in patients with heart failure including GALACTIC-HF and METEORIC-HF. Amgen holds an exclusive worldwide license to develop and commercialize omecamtiv mecarbil with a sublicense held by Servier for commercialization in Europe and certain other countries. Cytokinetics is collaborating with Astellas Pharma Inc. (Astellas) to develop reldesemtiv, a fast skeletal muscle troponin activator (FSTA). Astellas holds an exclusive worldwide license to develop and commercialize reldesemtiv. Licenses held by Amgen and Astellas are subject to specified co-development and co-commercialization rights of Cytokinetics. Cytokinetics is also developing CK-274, a novel cardiac myosin inhibitor that company scientists discovered independent of its collaborations, for the potential treatment of hypertrophic cardiomyopathies. Cytokinetics continues its over 20-year history of pioneering innovation in muscle biology and related pharmacology focused to diseases of muscle dysfunction and conditions of muscle weakness.For additional information about Cytokinetics, visit www.cytokinetics.com and follow us on Twitter, LinkedIn, Facebook and YouTube.About ServierServier is an international pharmaceutical company governed by a non-profit foundation, with its headquarters in France (Suresnes). With a strong international presence in 149 countries and a turnover of 4.2 billion euros in 2018, Servier employs 22 000 people worldwide. Entirely independent, the Group reinvests 25% of its turnover (excluding generics) in research and development and uses all its profits for development. Corporate growth is driven by Servier's constant search for innovation in five areas of excellence: cardiovascular, immune-inflammatory and neurodegenerative diseases, cancer and diabetes, as well as by its activities in high-quality generic drugs. Servier also offers eHealth solutions beyond drug development. More information: www.servier.com. Follow us on Social media: www.linkedin.com/company/servier/, www.facebook.com/Servier/, www.twitter.com/servierAmgen Forward-Looking Statements       This news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including its most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on  Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those Amgen projects. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for Amgen to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and Amgen expects similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints Amgen has selected. Amgen develops product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as Amgen may have believed at the time of entering into such relationship. Also, Amgen or others could identify safety, side effects or manufacturing problems with its products, including its devices, after they are on the market. Amgen's results may be affected by its ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing its products and global economic conditions. In addition, sales of Amgen's products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, Amgen's research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Amgen's business may be impacted by government investigations, litigation and product liability claims. In addition, Amgen's business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. While Amgen routinely obtains patents for its products and technology, the protection offered by its patents and patent applications may be challenged, invalidated or circumvented by its competitors, or Amgen may fail to prevail in present and future intellectual property litigation. Amgen performs a substantial amount of its commercial manufacturing activities at a few key manufacturing facilities, including in Puerto Rico, and also depends on third parties for a portion of its manufacturing activities, and limits on supply may constrain sales of certain of its current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, Amgen competes with other companies with respect to many of its marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for Amgen's products are supplied by sole third-party suppliers. Certain of Amgen's distributors, customers and payers have substantial purchasing leverage in their dealings with Amgen. The discovery of significant problems with a product similar to one of Amgen's products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on its business and results of operations. Amgen's efforts to acquire other companies or products and to integrate the operations of companies Amgen has acquired may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of Amgen's systems and Amgen's data. Amgen's stock price may be volatile and may be affected by a number of events. Amgen's business performance could affect or limit the ability of the Amgen Board of Directors to declare a dividend or its ability to pay a dividend or repurchase its common stock. Amgen may not be able to access the capital and credit markets on terms that are favorable to it, or at all.The scientific information discussed in this news release related to Amgen's product candidates is preliminary and investigative. Such product candidates are not approved by the U.S. Food and Drug Administration, and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates.Cytokinetics Forward-Looking Statements This press release contains forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995 (the \"Act\"). Cytokinetics disclaims any intent or obligation to update these forward-looking statements, and claims the protection of the Act's Safe Harbor for forward-looking statements. Examples of such statements include, but are not limited to, statements relating to the GALACTIC-HF clinical trial, including the planned timing of a second interim analysis for superiority; the potential benefits of omecamtiv mecarbil, including its ability to represent a novel therapeutic strategy to increase cardiac muscle function and restore cardiac performance; Cytokinetics' and its partners' research and development activities; the design, timing, results, significance and utility of preclinical and clinical results; and the properties and potential benefits of Cytokinetics' drug candidates. Such statements are based on management's current expectations, but actual results may differ materially due to various risks and uncertainties, including, but not limited to, potential difficulties or delays in the development, testing, regulatory approvals for trial commencement, progression or product sale or manufacturing, or production of Cytokinetics' drug candidates that could slow or prevent clinical development or product approval; Cytokinetics' drug candidates may have adverse side effects or inadequate therapeutic efficacy; the FDA or foreign regulatory agencies may delay or limit Cytokinetics' or its partners' ability to conduct clinical trials; Cytokinetics may be unable to obtain or maintain patent or trade secret protection for its intellectual property; Amgen's decisions with respect to the design, initiation, conduct, timing and continuation of development activities for omecamtiv mecarbil; standards of care may change, rendering Cytokinetics' drug candidates obsolete; competitive products or alternative therapies may be developed by others for the treatment of indications Cytokinetics' drug candidates and potential drug candidates may target; and risks and uncertainties relating to the timing and receipt of payments from its partners, including milestones and royalties on future potential product sales under Cytokinetics' collaboration agreements with such partners. For further information regarding these and other risks related to Cytokinetics' business, investors should consult Cytokinetics' filings with the Securities and Exchange Commission. CONTACT: CytokineticsDiane Weiser, Vice President, Corporate Communications, Investor Relations(415) 290-7757CONTACT: Amgen, Thousand OaksJessica Akopyan, (805) 447-0974 (media)Trish Hawkins, 805-447-5631 (media) Arvind Sood, 805-447-1060 (investors)CONTACT: ServierSonia Marques: sonia.marques@servier.com – Tel. +33 (0)1 55 72 40 21 / + 33 (0) 7 84 28 76 13Jean-Clément Vergeau: jean-clement.vergeau@servier.com – Tel. +33 (0)1 55 72 46 16 / + 33 (0) 6 79 56 75 96References1. Psotka MA, Gottlieb SS, Francis GS et al. Cardiac Calcitropes, Myotropes, and Mitotropes. JACC. 2019; 73:2345-53.2.  Planelles-Herrero VJ, Hartman JJ, Robert-Paganin J. et al. Mechanistic and structural basis for activation of cardiac myosin force production by omecamtiv mecarbil. Nat Commun. 2017;8:190.3.  Shen YT, Malik FI, Zhao X, et al. Improvement of cardiac function by a cardiac myosin activator in conscious dogs with systolic heart failure. Circ Heart Fail. 2010; 3: 522-27.4.  Malik FI, Hartman JJ, Elias KA, Morgan BP, Rodriguez H, Brejc K, Anderson RL, Sueoka SH, Lee KH, Finer JT, Sakowicz R. Cardiac myosin activation: a potential therapeutic approach for systolic heart failure. Science. 2011 Mar 18;331(6023):1439-43.5.  GBD 2017 Disease and Injury Incidence and Prevalence Collaborators. Lancet 2018; 392: 1789–858.6.  Yancy CW, Jessup M, Bozkurt B, et al. 2013 ACCF/AHA Guideline for the Management of Heart failure: A Report of the American College of Cardiology Foundation/American Heart Association Task Force on Practice Guidelines. Circulation. 2013;128:e240-e327. 7.  Ponikowski  P, Voors  AA, Anker  SD, et al. 2016 ESC guidelines for the diagnosis and treatment of acute and chronic heart failure: The Task Force for the diagnosis and treatment of acute and chronic heart failure of the European Society of Cardiology (ESC). Developed with the special contribution of the Heart Failure Association (HFA) of the ESC. Eur Heart J. 2016;37:2129–2200.8.  Roger VL. Epidemiology of Heart Failure. Circulation Research. 2013;113:646-659, originally published August 29, 2013. Doi: 10.1161/CIRCRESAHA.113.300268.9.  Kilgore M, Patel HK, Kielhorn A et al. Economic burden of hospitalizations of Medicare beneficiaries with heart failure. Risk Manag Healthc Policy. 2017; 10: 63-70. 10.  Jhund PS, MacIntyre K, Simpson CR, et al. Long-Term Trends in First Hospitalization for Heart Failure and Subsequent Survival Between 1986 and 2003. Circulation. 2009;119:515-523.11.  Benjamin EJ, Virani SS, Callaway CW et al. Heart Disease and Stroke Statistics—2018 Update: A Report From the American Heart Association. Circulation. 2018;137:e67-e492. 12.  Rogers VL, Weston SA, Redfield MM, et al. Trends in Heart Failure Incidence and Survival in a Community-Based Population. JAMA. 2004;292:344-350.13.  Teerlink, John R et al. Chronic Oral Study of Myosin Activation to Increase Contractility in Heart Failure (COSMIC-HF): a phase 2, pharmacokinetic, randomised, placebo-controlled trial. Lancet 2016; 388: 2895 – 2903.   View original content to download multimedia:http://www.prnewswire.com/news-releases/new-results-from-cosmic-hf-presented-at-aha-2019-show-treatment-of-heart-failure-patients-with-omecamtiv-mecarbil-was-associated-with-neutral-or-improved-measures-of-diastolic-function-300959718.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen Announces New FOURIER Analysis Showing Benefit Of Repatha® (evolocumab) In High-Risk Patients Who Have Experienced A Recent Heart Attack",
        "subtitle": "Additional FOURIER Analysis Shows Lowering LDL-C With Repatha Did Not Impair Patient-Reported Cognition",
        "date": "Nov 16, 2019 9:00AM EST",
        "content": "THOUSAND OAKS, Calif., Nov. 16, 2019 /PRNewswire/ -- Amgen today announced a new analysis from the Repatha® (evolocumab) cardiovascular outcomes (FOURIER) study that evaluates the effectiveness of Repatha in patients who have suffered a recent myocardial infarction (MI). The analysis showed that patients who experienced a recent MI (less than one year) were at higher risk of subsequent cardiovascular (CV) events compared to patients who had an MI over a year ago. In the analysis, the risk reduction for experiencing a heart attack, stroke or CV death, in Repatha-treated patients treated within one year post MI was 25% compared to 15% in those patients with a more distant MI. The results will be presented at the American Heart Association Annual Scientific Sessions in Philadelphia on Monday, Nov. 18.\"Nearly 1 in 5 patients will have a recurrent CV event during the first year after a heart attack which makes that year a critical time for high-risk patients1,\" said Robert Giugliano, M.D., FOURIER executive committee member and a senior investigator at the TIMI Study Group at Brigham and Women's Hospital and Professor of Medicine at Harvard Medical School. \"These results demonstrate the importance of intensive lipid-lowering therapy in the first year following a heart attack and provide additional evidence that evolocumab significantly reduces CV risk and improves outcomes for high-risk patients.\"In this analysis of the landmark FOURIER outcomes study, 5,711 patients who experienced an MI within one to 12 months of randomization were compared to 16,609 patients with a more distant event (>12 months prior to randomization) to assess the efficacy of Repatha on the primary endpoint (CV death, MI, stroke, unstable angina or coronary revascularization) and the key secondary endpoint (CV death, MI or stroke). \"Far too many patients remain at risk of another CV event because they are not managing one of the most important modifiable risk factors for a heart attack: high LDL-C2,\" said Darryl Sleep, M.D., senior vice president of Global Medical and chief medical officer at Amgen. \"These data demonstrate the important role cardiologists play in closely monitoring and managing LDL-C in high-risk patients, and support recent professional guideline recommendations that call for more intensive reduction of LDL-C to lower the risk of future CV events in high-risk patients3,4.\"New FOURIER Data Shows No Impact on Patient-Reported Cognition Function An additional analysis from the FOURIER study presented at AHA reinforces the safety and efficacy of intensive LDL-C lowering with Repatha in high-risk cardiovascular disease (CVD) patients. The analysis evaluated the impact of lowering LDL-C with Repatha on cognition as reported by patients with stable CVD and found that the addition of Repatha to statin therapy had no impact on reported everyday cognition function, including in those with very low LDL-C levels.PROFICIO Program FOURIER is part of Amgen's PROFICIO (Program to Reduce LDL-C and cardiovascular Outcomes Following Inhibition of PCSK9 In different pOpulations) program of clinical studies investigating the impact of Repatha on LDL-C and CVD across multiple populations at high CV risk, including those managed by statins, statin-intolerant patients, those with genetic disorders and patients with atherosclerosis. To date, the PROFICIO program consists of 36 trials including more than 38,000 patients worldwide.Repatha Cardiovascular Outcomes (FOURIER) Study Design FOURIER (Further cardiovascular OUtcomes Research with PCSK9 Inhibition in Subjects with Elevated Risk), a multinational Phase 3 randomized, double-blind, placebo-controlled trial, was designed to evaluate whether treatment with Repatha in combination with statin therapy compared to placebo plus statin therapy reduces cardiovascular events. The primary endpoint was the time to cardiovascular death, myocardial infarction, stroke, hospitalization for unstable angina, or coronary revascularization. The key secondary endpoint was the time to cardiovascular death, myocardial infarction or stroke. Eligible patients with high cholesterol (LDL-C ≥70 mg/dL or non-high-density lipoprotein cholesterol [non-HDL-C] ≥100 mg/dL) and clinically evident atherosclerotic cardiovascular disease at more than 1,300 study locations around the world were randomized to receive Repatha subcutaneous 140 mg every two weeks or 420 mg monthly plus effective statin dose; or placebo subcutaneous every two weeks or monthly plus effective statin dose. Optimized statin therapy was defined as at least atorvastatin 20 mg or equivalent daily with a recommendation for at least atorvastatin 40 mg or equivalent daily where approved. The study was event-driven and continued until at least 1,630 patients experienced a key secondary endpoint.About Repatha® (evolocumab) Repatha is a human monoclonal antibody that inhibits proprotein convertase subtilisin/kexin type 9 (PCSK9). Repatha binds to PCSK9 and inhibits circulating PCSK9 from binding to the low-density lipoprotein (LDL) receptor (LDLR), preventing PCSK9-mediated LDLR degradation and permitting LDLR to recycle back to the liver cell surface. By inhibiting the binding of PCSK9 to LDLR, Repatha increases the number of LDLRs available to clear LDL from the blood, thereby lowering LDL-C levels.5Repatha is approved in more than 70 countries, including the U.S., Japan, Canada and in all 28 countries that are members of the European Union. Applications in other countries are pending.Important U.S. Product Information Repatha is a PCSK9 (proprotein convertase subtilisin/kexin type 9) inhibitor antibody indicated: The safety and effectiveness of Repatha have not been established in pediatric patients with HoFH who are younger than 13 years old or in pediatric patients with primary hyperlipidemia or HeFH.Important U.S. Safety Information Contraindication: Repatha is contraindicated in patients with a history of a serious hypersensitivity reaction to Repatha. Serious hypersensitivity reactions including angioedema have occurred in patients treated with Repatha.Allergic reactions: Hypersensitivity reactions (e.g. angioedema, rash, urticaria) have been reported in patients treated with Repatha, including some that led to discontinuation of therapy. If signs or symptoms of serious allergic reactions occur, discontinue treatment with Repatha, treat according to the standard of care, and monitor until signs and symptoms resolve.Adverse reactions: The most common adverse reactions (>5% of patients treated with Repatha and occurring more frequently than placebo) were: nasopharyngitis, upper respiratory tract infection, influenza, back pain, and injection site reactions.  From a pool of the 52-week trial and seven 12-week trials: Local injection site reactions occurred in 3.2% and 3.0% of Repatha-treated and placebo-treated patients, respectively. The most common injection site reactions were erythema, pain, and bruising. Allergic reactions occurred in 5.1% and 4.7% of Repatha-treated and placebo-treated patients, respectively. The most common allergic reactions were rash (1.0% versus 0.5% for Repatha and placebo, respectively), eczema (0.4% versus 0.2%), erythema (0.4% versus 0.2%), and urticaria (0.4% versus 0.1%).The most common adverse reactions in the Cardiovascular Outcomes Trial (>5% of patients treated with Repatha and occurring more frequently than placebo) were: diabetes mellitus (8.8% Repatha, 8.2% placebo), nasopharyngitis (7.8% Repatha, 7.4% placebo), and upper respiratory tract infection (5.1% Repatha, 4.8% placebo).   Among the 16,676 patients without diabetes mellitus at baseline, the incidence of new-onset diabetes mellitus during the trial was 8.1% in patients assigned to Repatha compared with 7.7% in those assigned to placebo.  Homozygous Familial Hypercholesterolemia (HoFH): The adverse reactions that occurred in at least two patients treated with Repatha and more frequently than placebo were: upper respiratory tract infection, influenza, gastroenteritis, and nasopharyngitis.Immunogenicity: Repatha is a human monoclonal antibody. As with all therapeutic proteins, there is a potential for immunogenicity with Repatha. Please contact Amgen Medinfo at 800-77-AMGEN (800-772-6436) or 844-REPATHA (844-737-2842) regarding Repatha® availability or find more information, including full  Prescribing Information, at www.amgen.com and www.Repatha.com.About Amgen in the Cardiovascular Therapeutic Area Building on more than three decades of experience in developing biotechnology medicines for patients with serious illnesses, Amgen is dedicated to addressing important scientific questions to advance care and improve the lives of patients with cardiovascular disease, the leading cause of morbidity and mortality worldwide.6 Amgen's research into cardiovascular disease, and potential treatment options, is part of a growing competency at Amgen that utilizes human genetics to identify and validate certain drug targets. Through its own research and development efforts, as well as partnerships, Amgen is building a robust cardiovascular portfolio consisting of several approved and investigational molecules in an effort to address a number of today's important unmet patient needs, such as high cholesterol and heart failure.About Amgen Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. Forward-Looking Statements This news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd., or the acquisition of Otezla® (apremilast), including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on  Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.The scientific information discussed in this news release relating to any new indications for our products is preliminary and investigative and is not part of the labeling approved by the U.S. Food and Drug Administration for the products. The products are not approved for the investigational use(s) discussed in this news release, and no conclusions can or should be drawn regarding the safety or effectiveness of the products for these uses.CONTACT: Amgen, Thousand Oaks Trish Hawkins, 805-447-5631 (media) Jessica Akopyan, 805-447-0974 (media) Arvind Sood, 805-447-1060 (investors)References             View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-announces-new-fourier-analysis-showing-benefit-of-repatha-evolocumab-in-high-risk-patients-who-have-experienced-a-recent-heart-attack-300959550.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen And The Duke Clinical Research Institute Announce Initiation Of First Large-Scale Registry To Evaluate Real-World Lipid Management And The Effectiveness Of PCSK9 Inhibitors",
        "subtitle": "New Registry, cvMOBIUS, Will Assess Lipid Therapies and Five-Year Cardiovascular Outcomes in 8,500 High-Risk Patients With a Recent Atherosclerotic Cardiovascular Disease Event",
        "date": "Nov 15, 2019 9:00AM EST",
        "content": " THOUSAND OAKS, Calif., Nov. 15, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) in collaboration with the Duke Clinical Research Institute (DCRI) today announced plans to initiate the Cardiovascular Multi-dimensional Observational Investigation of the Use of PCSK9 inhibitors (cvMOBIUS) study—the first large-scale real-world study to assess lipid management and the impact of PCSK9 inhibitors on cardiovascular (CV) outcomes in clinical practice. While there is strong evidence demonstrating the efficacy of PCSK9 inhibitors from various randomized clinical trial studies, there is less information on the effectiveness of these medicines on cardiovascular outcomes in real-world practice.    The cvMOBIUS study will be conducted across the U.S. and Canada and will begin patient enrollment this month. A prospective observational registry of 8,500 adults eligible for treatment with a PCSK9 inhibitor will be followed for five years. In parallel, an electronic health record (EHR)-based registry will follow a broader population of adults hospitalized with atherosclerotic cardiovascular disease (ASCVD) at participating sites.\"Cardiovascular disease is one of the most significant public health issues facing our country today. Gathering robust, large-scale data from diverse patients will better inform lipid management and help decrease the burden of cardiovascular disease in these high-risk patients,\" said Ann Marie Navar, M.D., Ph.D., assistant professor of medicine at the Duke University School of Medicine and member of the DCRI. \"The clinical evidence supporting the efficacy and safety of PCSK9 inhibitors in patients with cardiovascular disease is well established, but we still have a lot to learn about the benefits of these medicines in the real world.\"Patients who have experienced a recent ASCVD event, including a myocardial infarction (MI), are at higher risk of experiencing another CV event, especially within the first year after.1,2 Lipid lowering is one of the key approaches for reducing a patient's risk for secondary events.1 Based on large randomized trials, major professional cardiology societies, including the American Heart Association and the American College of Cardiology, acknowledge that lower is better when it comes to low density lipoprotein cholesterol (LDL-C) management in patients who have experienced an MI and other ASCVD events.3\"LDL-C is one of the most important modifiable risk factors for cardiovascular disease, so lipid management is an essential element in reducing future CV events and improving clinical outcomes for high-risk patients,\" said Eric D. Peterson, M.D., MPH, distinguished professor of medicine at the Duke University School of Medicine and member of the DCRI. \"This large registry will examine how care is being delivered in clinical practice to patients—whether we are using the right medicines, whether we are reaching guideline-based LDL-C targets, and the degree to which achieving these goals impacts outcomes in real-world practice.\"   \"The cvMOBIUS study is important because it is one of the few instances that researchers will utilize data pulled directly from hospitals' EHR systems for research. This should help set the stage for future big data analyses and pragmatic clinical trials,\" said Dr. Peterson.  Two large randomized outcomes trials, including the Repatha® (evolocumab) cardiovascular outcomes (FOURIER) study, have demonstrated that innovative therapies like PCSK9 inhibitors lower LDL-C levels and can reduce the risk of heart attacks in high-risk patients with established cardiovascular disease. Additionally, the VESALIUS-CV trial, initiated in March 2019, is an ongoing randomized outcomes trial, designed to evaluate the long-term effects of Repatha in high-risk cardiovascular disease (CVD) patients without a prior heart attack or stroke. The study will be the first to investigate long-term outcomes in this population with Repatha for a minimum of four years.\"Amgen is committed to building a vast body of evidence for Repatha—clinical trial and real-world effectiveness data sets—to advance the knowledge and treatment of cardiovascular disease,\" said David M. Reese, M.D., executive vice president of Research and Development at Amgen. \"This study will generate valuable real-world evidence to help us demonstrate that PCSK9 inhibitors, like Repatha, are an important treatment option for very high-risk patients and can help prevent recurrent cardiovascular events in the real world.\" Drs. Navar and Peterson are co-primary investigators of the study.About cvMOBIUScvMOBIUS is a multicenter prospective observational registry in the U.S. and Canada. The study will be comprised of two parallel arms: a multicenter, prospective observational arm that will include 8,500 patients who experienced an ASCVD event within 12 months, from 250 sites; and a parallel EHR-based registry of a larger cohort of patients hospitalized with an ASCVD event treated at participating centers. The primary endpoint includes time to death, any non-fatal MI and any non-fatal ischemic stroke (IS). About the Duke Clinical Research Institute The DCRI, part of the Duke University School of Medicine, is the largest academic research organization in the world. It delivers on its mission to develop and share knowledge that improves the care of patients through innovative clinical research by conducting groundbreaking multinational clinical trials, managing major national patient registries, and performing landmark outcomes research. DCRI research spans multiple disciplines, from pediatrics to geriatrics, primary care to subspecialty medicine, and genomics to proteomics. The DCRI also is home to the Duke Databank for Cardiovascular Diseases, the largest and oldest institutional cardiovascular database in the world, which continues to inform clinical decision-making 40 years after its founding.About Repatha® (evolocumab)Repatha is a human monoclonal antibody that inhibits proprotein convertase subtilisin/kexin type 9 (PCSK9). Repatha binds to PCSK9 and inhibits circulating PCSK9 from binding to the low-density lipoprotein (LDL) receptor (LDLR), preventing PCSK9-mediated LDLR degradation and permitting LDLR to recycle back to the liver cell surface. By inhibiting the binding of PCSK9 to LDLR, Repatha increases the number of LDLRs available to clear LDL from the blood, thereby lowering LDL-C levels.4Repatha is approved in more than 70 countries, including the U.S., Japan, Canada and in all 28 countries that are members of the European Union. Applications in other countries are pending.Repatha Cardiovascular Outcomes (FOURIER) Study Design FOURIER (Further cardiovascular OUtcomes Research with PCSK9 Inhibition in Subjects with Elevated Risk), a multinational Phase 3 randomized, double-blind, placebo-controlled trial, was designed to evaluate whether treatment with Repatha in combination with statin therapy compared to placebo plus statin therapy reduces cardiovascular events. The primary endpoint was the time to cardiovascular death, myocardial infarction, stroke, hospitalization for unstable angina, or coronary revascularization. The key secondary endpoint was the time to cardiovascular death, MI or stroke. Eligible patients with high cholesterol (LDL-C ≥70 mg/dL or non-high-density lipoprotein cholesterol [non-HDL-C] ≥100 mg/dL) and clinically evident ASCVD at more than 1,300 study locations around the world were randomized to receive Repatha subcutaneous 140 mg every two weeks or 420 mg monthly plus effective statin dose; or placebo subcutaneous every two weeks or monthly plus effective statin dose. Optimized statin therapy was defined as at least atorvastatin 20 mg or equivalent daily with a recommendation for at least atorvastatin 40 mg or equivalent daily where approved. The study was event-driven and continued until at least 1,630 patients experienced a key secondary endpoint.Important U.S. Product InformationRepatha is a PCSK9 (proprotein convertase subtilisin/kexin type 9) inhibitor antibody indicated: The safety and effectiveness of Repatha have not been established in pediatric patients with HoFH who are younger than 13 years old or in pediatric patients with primary hyperlipidemia or HeFH.Important U.S. Safety InformationContraindication: Repatha is contraindicated in patients with a history of a serious hypersensitivity reaction to Repatha. Serious hypersensitivity reactions including angioedema have occurred in patients treated with Repatha.Allergic reactions: Hypersensitivity reactions (e.g. angioedema, rash, urticaria) have been reported in patients treated with Repatha, including some that led to discontinuation of therapy. If signs or symptoms of serious allergic reactions occur, discontinue treatment with Repatha, treat according to the standard of care, and monitor until signs and symptoms resolve.Adverse reactions: The most common adverse reactions (>5% of patients treated with Repatha and occurring more frequently than placebo) were: nasopharyngitis, upper respiratory tract infection, influenza, back pain, and injection site reactions.  From a pool of the 52-week trial and seven 12-week trials: Local injection site reactions occurred in 3.2% and 3.0% of Repatha-treated and placebo-treated patients, respectively. The most common injection site reactions were erythema, pain, and bruising. Allergic reactions occurred in 5.1% and 4.7% of Repatha-treated and placebo-treated patients, respectively. The most common allergic reactions were rash (1.0% versus 0.5% for Repatha and placebo, respectively), eczema (0.4% versus 0.2%), erythema (0.4% versus 0.2%), and urticaria (0.4% versus 0.1%).The most common adverse reactions in the Cardiovascular Outcomes Trial (>5% of patients treated with Repatha and occurring more frequently than placebo) were: diabetes mellitus (8.8% Repatha, 8.2% placebo), nasopharyngitis (7.8% Repatha, 7.4% placebo), and upper respiratory tract infection (5.1% Repatha, 4.8% placebo).   Among the 16,676 patients without diabetes mellitus at baseline, the incidence of new-onset diabetes mellitus during the trial was 8.1% in patients assigned to Repatha compared with 7.7% in those assigned to placebo.  Homozygous Familial Hypercholesterolemia (HoFH): The adverse reactions that occurred in at least two patients treated with Repatha and more frequently than placebo were: upper respiratory tract infection, influenza, gastroenteritis, and nasopharyngitis.Immunogenicity: Repatha is a human monoclonal antibody. As with all therapeutic proteins, there is a potential for immunogenicity with Repatha. Please contact Amgen Medinfo at 800-77-AMGEN (800-772-6436) or 844-REPATHA (844-737-2842) regarding Repatha® availability or find more information, including full Prescribing Information, at www.amgen.com and www.Repatha.com.About Amgen in the Cardiovascular Therapeutic AreaBuilding on more than three decades of experience in developing biotechnology medicines for patients with serious illnesses, Amgen is dedicated to addressing important scientific questions to advance care and improve the lives of patients with cardiovascular disease, the leading cause of morbidity and mortality worldwide.5 Amgen's research into cardiovascular disease, and potential treatment options, is part of a growing competency at Amgen that utilizes human genetics to identify and validate certain drug targets. Through its own research and development efforts, as well as partnerships, Amgen is building a robust cardiovascular portfolio consisting of several approved and investigational molecules in an effort to address a number of today's important unmet patient needs, such as high cholesterol and heart failure.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. Forward-Looking Statements         This news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaboration with any other company, including BeiGene, Ltd., or the acquisition of Otezla® (apremilast), including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products, and to integrate the operations of companies or in support of products we have acquired, may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.Any scientific information discussed in this news release relating to new indications for our products is preliminary and investigative and is not part of the labeling approved by the U.S. Food and Drug Administration for the products. The products are not approved for the investigational use(s) discussed in this news release, and no conclusions can or should be drawn regarding the safety or effectiveness of the products for these uses.CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974 (media)Trish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)References       View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-and-the-duke-clinical-research-institute-announce-initiation-of-first-large-scale-registry-to-evaluate-real-world-lipid-management-and-the-effectiveness-of-pcsk9-inhibitors-300958928.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen Highlights Data To Be Presented At AHA 2019 Across Cardiovascular Portfolio",
        "subtitle": "New Analyses From the Landmark Repatha® (Evolocumab) FOURIER Cardiovascular Outcomes Study Evaluate Clinical Efficacy and Outcomes in Diverse High-Risk Patient Populations",
        "date": "Nov 11, 2019 9:00AM EST",
        "content": " THOUSAND OAKS, Calif., Nov. 11, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced that new data from its cardiovascular portfolio will be presented at the American Heart Association (AHA) Scientific Sessions 2019 in Philadelphia, Nov. 16-18. This includes new clinical and real-world studies that provide further evidence of the benefits of intensive lipid-lowering therapy with Repatha® (evolocumab) as well as new data for omecamtiv mecarbil, a novel selective cardiac myosin activator being developed for the treatment of heart failure with reduced ejection fraction (HFrEF).\"The Amgen clinical and real-world data being presented at AHA highlights our ongoing commitment to further the cardiovascular community's understanding of Repatha's role in lowering high LDL-C, one of the most important modifiable risk factors associated with an increased risk of heart attack,\"1 said David M. Reese, M.D., executive vice president of Research and Development at Amgen. \"In addition, we look forward to presenting data that showcases the potential of omecamtiv mecarbil for the treatment of heart failure. Despite advances in care over the years, 50% of people diagnosed with heart failure will die within five years of initial hospitalization so continued advancements are needed in this area.\"2,3 Notable data from the Company's cardiovascular (CV) portfolio include two new analyses from the Repatha cardiovascular outcomes (FOURIER) study evaluating the efficacy and safety of Repatha in patients with a recent heart attack, and the impact of low-density lipoprotein cholesterol (LDL-C) lowering with Repatha on cognitive function. In addition, a new post-hoc analysis from the Phase 2 clinical trial, COSMIC-HF, evaluated the effects of omecamtiv mecarbil on diastolic function.Real-world Evidence Shows Need for More Intensive Treatment in High-Risk PatientsAmgen is presenting the results of nine real-world data analyses, including results from the GOULD (Getting to an imprOved Understanding of Low-Density lipoprotein cholesterol and dyslipidemia management) registry, a prospective cohort of approximately 5,000 atherosclerotic cardiovascular disease (ASCVD) patients with LDL-C above 70 mg/dL across 119 sites in the U.S. These results demonstrate that a large proportion of patients with a prior myocardial infarction (MI) do not receive optimal secondary prevention therapy. Results from GOULD also highlight gender differences in the use of high-intensity statins as well as limited intensification of lipid lowering therapy over one year of follow up in this ASCVD population with elevated LDL-C. A list of Amgen-sponsored abstracts at AHA 2019 can be found online and below: Omecamtiv Mecarbil clinical dataRepatha clinical dataReal world treatment patterns Identification of high-risk subpopulations Real-world LDL measurement and goal achievementBurden of Cardiovascular DiseaseCardiovascular disease (CVD) remains one of the most pressing public health issues in the U.S., with someone in the country experiencing a heart attack every 40 seconds.4 LDL-C, also known as bad cholesterol, is one of the most important modifiable risk factors for having a heart attack.5,6 About seven out of 10 adults in the U.S. with CVD have elevated LDL-C, despite optimal lipid-lowering treatment.7 Additionally, 43% of patients who have had a CV event, such as heart attack, will have at least one new event within two years.8,9 Professional guidelines around the world, including the American Heart Association, the American College of Cardiology  and the European Society of Cardiology call for more intensive reduction of LDL-C.10,11 The guidelines confirm the lower the LDL-C value, the lower the risk of future CV events for patients with CVD, and recommend intensive lipid-lowering treatment for very high-risk patients.About the Repatha Cardiovascular Outcomes (FOURIER) Study FOURIER (Further cardiovascular OUtcomes Research with PCSK9 Inhibition in Subjects with Elevated Risk), a multinational Phase 3 randomized, double-blind, placebo-controlled trial, is designed to evaluate whether treatment with Repatha in combination with statin therapy compared to placebo plus statin therapy reduces cardiovascular events. The primary endpoint is the time to cardiovascular death, myocardial infarction, stroke, hospitalization for unstable angina, or coronary revascularization. The key secondary endpoint is the time to cardiovascular death, myocardial infarction or stroke.  Eligible patients with high cholesterol (LDL-C ≥70 mg/dL or non-high-density lipoprotein cholesterol [non-HDL-C] ≥100 mg/dL) and clinically evident ASCVD at more than 1,300 study locations around the world were randomized to receive Repatha subcutaneous 140 mg every two weeks or 420 mg monthly plus effective statin dose; or placebo subcutaneous every two weeks or monthly plus effective statin dose. Optimized statin therapy was defined as at least atorvastatin 20 mg or equivalent daily with a recommendation for at least atorvastatin 40 mg or equivalent daily where approved. The study was event-driven and continued until at least 1,630 patients experienced a key secondary endpoint.FOURIER is part of Amgen's PROFICIO (Program to Reduce LDL-C and cardiovascular Outcomes Following Inhibition of PCSK9 In different pOpulations) program of clinical studies investigating the impact of Repatha on LDL-C and CVD across multiple populations at high cardiovascular risk, including those managed by statins, statin-intolerant patients, those with genetic disorders and patients with atherosclerosis. To date, the PROFICIO program consists of 36 trials including more than 38,000 patients worldwide.GOULD Study DesignGetting to an ImprOved Understanding of Low-Density Lipoprotein and Dyslipidemia Management (GOULD) Registry is a multicenter, observational registry of ASCVD patients, to describe LDL-C treatment patterns in the U.S. and track them over time. This registry and subsequent analysis sought to better understand the adaptability of lipid management guidelines for patients with ASCVD.From December 2016 to April 2018, interactive phone surveys with the lead physicians from each of the 120 U.S. centers participating in the registry (1 physician from each center) and patients (N=5,006) were conducted. Patients with ASCVD receiving any pharmacological lipid-lowering therapy were eligible for enrollment in 1 of 3 cohorts: 1) currently receiving a PCSK9i antibody, 2) no PCSK9i and LDL-C 70-99 mg/dL, and 3) no PCSK9i and LDL-C ≥ 100 mg/dL. Patients underwent a 1-year retrospective chart review, followed by chart reviews and interviews every 6 months for 2 years.About Omecamtiv Mecarbil and the Phase 3 Clinical Trials ProgramOmecamtiv mecarbil is a novel, selective cardiac myosin activator, also known as a cardiac myotrope12, that binds to the catalytic domain of myosin. Preclinical research has shown that cardiac myotropes increase cardiac contractility without affecting intracellular myocyte calcium concentrations or myocardial oxygen consumption.13-15  Cardiac myosin is the cytoskeletal motor protein in the cardiac muscle cell that is directly responsible for converting chemical energy into the mechanical force resulting in cardiac contraction.Omecamtiv mecarbil is being developed for the potential treatment of heart failure with reduced ejection fraction (HFrEF) under a collaboration between Amgen and Cytokinetics, with funding and strategic support from Servier. Omecamtiv mecarbil is the subject of a comprehensive Phase 3 clinical trials program comprised of GALACTIC-HF (Global Approach to Lowering Adverse Cardiac Outcomes Through Improving Contractility in Heart Failure), a large, Phase 3 global cardiovascular outcomes study and METEORIC-HF (Multicenter Exercise Tolerance Evaluation of Omecamtiv Mecarbil Related to Increased Contractility in Heart Failure), a Phase 3 clinical trial designed to evaluate the effect of treatment with omecamtiv mecarbil compared to placebo on exercise capacity.About Repatha® (evolocumab)Repatha is a human monoclonal antibody that inhibits proprotein convertase subtilisin/kexin type 9 (PCSK9). Repatha binds to PCSK9 and inhibits circulating PCSK9 from binding to the low-density lipoprotein (LDL) receptor (LDLR), preventing PCSK9-mediated LDLR degradation and permitting LDLR to recycle back to the liver cell surface. By inhibiting the binding of PCSK9 to LDLR, Repatha increases the number of LDLRs available to clear LDL from the blood, thereby lowering LDL-C levels.16Repatha is approved in more than 70 countries, including the U.S., Japan, Canada and in all 28 countries that are members of the European Union. Applications in other countries are pending.Important U.S. Product InformationRepatha is a PCSK9 (proprotein convertase subtilisin/kexin type 9) inhibitor antibody indicated: The safety and effectiveness of Repatha have not been established in pediatric patients with HoFH who are younger than 13 years old or in pediatric patients with primary hyperlipidemia or HeFH.Important U.S. Safety InformationContraindication: Repatha is contraindicated in patients with a history of a serious hypersensitivity reaction to Repatha. Serious hypersensitivity reactions including angioedema have occurred in patients treated with Repatha.Allergic reactions: Hypersensitivity reactions (e.g. angioedema, rash, urticaria) have been reported in patients treated with Repatha, including some that led to discontinuation of therapy. If signs or symptoms of serious allergic reactions occur, discontinue treatment with Repatha, treat according to the standard of care, and monitor until signs and symptoms resolve.Adverse reactions: The most common adverse reactions (>5% of patients treated with Repatha and occurring more frequently than placebo) were: nasopharyngitis, upper respiratory tract infection, influenza, back pain, and injection site reactions.  From a pool of the 52-week trial and seven 12-week trials: Local injection site reactions occurred in 3.2% and 3.0% of Repatha-treated and placebo-treated patients, respectively. The most common injection site reactions were erythema, pain, and bruising. Allergic reactions occurred in 5.1% and 4.7% of Repatha-treated and placebo-treated patients, respectively. The most common allergic reactions were rash (1.0% versus 0.5% for Repatha and placebo, respectively), eczema (0.4% versus 0.2%), erythema (0.4% versus 0.2%), and urticaria (0.4% versus 0.1%).The most common adverse reactions in the Cardiovascular Outcomes Trial (>5% of patients treated with Repatha and occurring more frequently than placebo) were: diabetes mellitus (8.8% Repatha, 8.2% placebo), nasopharyngitis (7.8% Repatha, 7.4% placebo), and upper respiratory tract infection (5.1% Repatha, 4.8% placebo).   Among the 16,676 patients without diabetes mellitus at baseline, the incidence of new-onset diabetes mellitus during the trial was 8.1% in patients assigned to Repatha compared with 7.7% in those assigned to placebo.  Homozygous Familial Hypercholesterolemia (HoFH): The adverse reactions that occurred in at least two patients treated with Repatha and more frequently than placebo were: upper respiratory tract infection, influenza, gastroenteritis, and nasopharyngitis.Immunogenicity: Repatha is a human monoclonal antibody. As with all therapeutic proteins, there is a potential for immunogenicity with Repatha. Please contact Amgen Medinfo at 800-77-AMGEN (800-772-6436) or 844-REPATHA (844-737-2842) regarding Repatha® availability or find more information, including full Prescribing Information, at www.amgen.com and www.Repatha.com.About Amgen in the Cardiovascular Therapeutic AreaBuilding on more than three decades of experience in developing biotechnology medicines for patients with serious illnesses, Amgen is dedicated to addressing important scientific questions to advance care and improve the lives of patients with cardiovascular disease, the leading cause of morbidity and mortality worldwide.17 Amgen's research into cardiovascular disease, and potential treatment options, is part of a growing competency at Amgen that utilizes human genetics to identify and validate certain drug targets. Through its own research and development efforts, as well as partnerships, Amgen is building a robust cardiovascular portfolio consisting of several approved and investigational molecules in an effort to address a number of today's important unmet patient needs, such as high cholesterol and heart failure.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. Forward-Looking Statements         This news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of the acquisition of Otezla® (apremilast) , including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on  Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project.  Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products and to integrate the operations of companies or in support of products we have acquired may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.The scientific information discussed in this news release related to our product candidates is preliminary and investigative. Such product candidates are not approved by the U.S. Food and Drug Administration, and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates. Further, any scientific information discussed in this news release relating to new indications for our products is preliminary and investigative and is not part of the labeling approved by the U.S. Food and Drug Administration for the products. The products are not approved for the investigational use(s) discussed in this news release, and no conclusions can or should be drawn regarding the safety or effectiveness of the products for these uses. CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974 (media)Trish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)References   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-highlights-data-to-be-presented-at-aha-2019-across-cardiovascular-portfolio-300955296.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen To Present At The 28th Annual Credit Suisse Healthcare Conference",
        "subtitle": "",
        "date": "Nov 7, 2019 5:01PM EST",
        "content": "THOUSAND OAKS, Calif., Nov. 7, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) will present at the 28th Annual Credit Suisse Healthcare Conference at 9:45 a.m. MT on Tuesday, Nov. 12, 2019, in Scottsdale, Ariz. David W. Meline, executive vice president and chief financial officer at Amgen, will present at the conference. Live audio of the presentation can be accessed from the Events Calendar on Amgen's website, www.amgen.com, under Investors. A replay of the webcast will also be available on Amgen's website for at least 90 days following the event.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology. Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. CONTACT: Amgen, Thousand OaksJessica Akopyan, 805-447-0974 (media)Trish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-to-present-at-the-28th-annual-credit-suisse-healthcare-conference-300954390.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen Enters Into Strategic Collaboration With BeiGene To Expand Oncology Presence In China",
        "subtitle": "Amgen to Acquire 20.5% Stake in BeiGene for Approximately $2.7 Billion in Cash",
        "date": "Oct 31, 2019 4:00PM EDT",
        "content": "THOUSAND OAKS, Calif., Oct. 31, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) announced today that it has entered into a strategic collaboration with BeiGene that will significantly accelerate Amgen's plans to expand its oncology presence in China, the world's second-largest pharmaceutical market. BeiGene is a research-based, oncology-focused biotechnology company with an established and highly experienced team in China, including a 700-person commercial organization and a 600-person clinical development organization. \"This strategic collaboration with BeiGene will enable Amgen to serve significantly more patients by expanding our presence in the world's most populous country,\" said Robert A. Bradway, Amgen's chairman and chief executive officer. \"Cancer is a leading cause of death in China and will only become a more pressing public health issue as the Chinese population ages. With its extensive commercial and clinical capabilities within China and a commitment to global quality standards, BeiGene is the ideal strategic collaborator as we seek to make a meaningful difference in the lives of millions of cancer patients in China and around the world.\"As part of the collaboration:Since 2011, Amgen has expanded its geographic presence from approximately 50 to 100 countries, enabling the company to play a growing role in serving the rapidly increasing demand for better healthcare around the world. The pharmaceutical market in China is expected to grow briskly as access to new medicines continues to improve. With approximately four million people diagnosed with cancer annually and 2.3 million deaths from the disease each year, the need for new oncology treatments in China is particularly acute and the oncology market is one of the fastest-growing segments of the overall pharmaceutical market there.Amgen will purchase its equity stake in BeiGene with available cash and expects to retain its investment grade credit rating. \"Amgen's capital allocation priorities remain unchanged,\" said David W. Meline, executive vice president and chief financial officer at Amgen. \"We will continue to grow our business through internal investment and business development, while providing attractive returns to our shareholders through a growing dividend and continued share repurchases.\"The transaction is expected to close in early 2020 subject to BeiGene shareholder approval, the expiration or termination of waiting periods under all applicable antitrust laws, and satisfaction of other customary closing conditions.  Goldman Sachs & Co. LLC is acting as exclusive financial advisor, and Latham & Watkins LLP is serving as legal advisor to Amgen.Webcast DetailsAmgen will host a webcast call today at 2 p.m. PT. where members of Amgen's executive management team will discuss the Company's strategic collaboration with BeiGene.   Live audio webcast of the investor call will be broadcast over the internet simultaneously and will be available to members of the news media, investors and the general public.   The webcast, as with other selected presentations regarding developments in Amgen's business given at certain investor and medical conferences, can be accessed on Amgen's website, www.amgen.com, under Investors. Information regarding presentation times, webcast availability and webcast links are noted on Amgen's Investor Relations Events Calendar. The webcast will be archived and available for replay for at least 90 days after the event.    For more information about Amgen's products, including important safety information, please visit www.xgeva.com, www.kyprolis.com, www.blincyto.com, www.repatha.com, and www.prolia.com. About Amgen Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be the world's largest independent biotechnology company, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. Forward-Looking Statements This news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of the BeiGene strategic collaboration, including the impact on non-GAAP EPS, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. We or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies or products and to integrate the operations of companies or in support of products we have acquired may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.CONTACT: Amgen, Thousand OaksTrish Hawkins, 805-447-5631 (media)Jessica Akopyan, 805-447-0974 (media)Arvind Sood, 805-447-1060 (investors)  View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-enters-into-strategic-collaboration-with-beigene-to-expand-oncology-presence-in-china-300949421.htmlSOURCE  Amgen"
    },
    {
        "title": "The Discovery Of Amgen's Novel Investigational KRAS(G12C) Inhibitor AMG 510 Published In Nature",
        "subtitle": "Publication Showcases how First-to-Clinic Investigational AMG 510 Exploits a Cryptic Groove of the Previously Undruggable KRAS Protein Surface",
        "date": "Oct 30, 2019 6:00PM EDT",
        "content": " THOUSAND OAKS, Calif., Oct. 30, 2019 /PRNewswire/ -- Amgen (NASDAQ: AMGN) today announced a publication in Nature unveiling the discovery of AMG 510, a small molecule inhibitor of KRASG12C being investigated as a treatment for a variety of solid tumors with KRAS G12C mutation. AMG 510 is the first investigational KRASG12C inhibitor to advance to the clinic and is currently enrolling in a potentially registrational Phase 2 study. Experience the interactive Multichannel News Release here: https://www.multivu.com/players/English/8490257-amgen-nature-amg510-publication/Titled \"The Clinical KRASG12C Inhibitor AMG 510 Drives Anti-Tumor Immunity,\" the paper highlights novel structural insights that led to the discovery of AMG 510, the preclinical evidence of AMG 510 activity, its potential ability to induce tumor-cell killing as both a monotherapy and in combination with other therapies, and its impact on the immune system that may render tumor cells particularly sensitive to immunotherapy. Early evidence of clinical activity of AMG 510 is also presented in the paper.    \"We are pleased to share how our team of scientists at Amgen were the first to exploit the previously hidden groove on the protein surface to finally identify a potential drug against this important oncogenic protein,\" said David M. Reese, M.D., executive vice president of Research and Development at Amgen. \"These scientific insights, coupled with superb molecular engineering, paved the way for AMG 510 to be first to clinic, where it has demonstrated early evidence of clinical activity.\" KRAS, identified over 30 years ago as a proto-oncogene, is one of the most frequently mutated oncogenes in human cancer.1,2 Amgen researchers first identified the novel histidine 95 (H95) groove located on an inactive KRASG12C protein. Through extensive compound screening and structure-based design, AMG 510 emerged as the top investigational candidate from the optimization of a series of H95 groove-binding molecules. It is designed to irreversibly bind to KRASG12C protein and permanently lock it in an inactive state, leading to inhibition of tumor cell growth in KRASG12C driven tumors.  In preclinical experiments, AMG 510 demonstrated favorable potency and selectivity, and induced regression in mice bearing KRASG12C mutated tumors.\"There is a significant unmet need for tumor-selective therapies that minimize a negative impact on normal cells, and many patients diagnosed with KRAS-mutated solid tumors have typically faced a challenging prognosis with limited targeted treatment options,\" said David S. Hong, M.D., one of the paper's authors, AMG 510 clinical study investigator and deputy chair, Department of Investigational Cancer Therapeutics, Division of Cancer Medicine at University of Texas MD Anderson Cancer Center, Houston. \"This publication shows investigational AMG 510 has high selectivity in non-clinical experiments, binding only to KRASG12C out of more than 6,000 proteins and likely contributing to the absence of dose-limiting toxicities in the clinical study to date, supporting the potential for an encouraging safety profile.\"The U.S. Food and Drug Administration (FDA) granted Orphan Drug Designation to AMG 510 for previously treated metastatic non-small cell lung cancer (NSCLC) and colorectal cancer with KRAS G12C mutation and Fast Track Designation for previously treated metastatic NSCLC with KRAS G12C mutation. Additional data from the ongoing Phase 1 clinical trial evaluating AMG 510 was recently presented at the 2019 World Conference on Lung Cancer hosted by the International Association for the Study of Lung Cancer and at the European Society for Medical Oncology 2019 Congress, both of which were held in Barcelona, Spain. About KRASThe subject of more than three decades of research, the RAS gene family are the most frequently mutated oncogenes in human cancers.1,2 Within this family, KRAS is the most prevalent variant and is particularly common in solid tumors.2 A specific mutation known as KRAS G12C accounts for approximately 13% of non-small cell lung cancers, three to five percent of colorectal cancers and one to two percent of numerous other solid tumors.3 Approximately 30,000 patients are diagnosed each year in the United States with KRAS G12C-driven cancers.4 KRASG12C has been considered \"undruggable\" due to a lack of traditional small molecule binding pockets on the protein. Amgen is exploring the potential of KRASG12C inhibition across a broad variety of tumor types.About Amgen Oncology Amgen Oncology is searching for and finding answers to incredibly complex questions that will advance care and improve lives for cancer patients and their families. Our research drives us to understand the disease in the context of the patient's life – not just their cancer journey – so they can take control of their lives.For the last four decades, we have been dedicated to discovering the firsts that matter in oncology and to finding ways to reduce the burden of cancer. Building on our heritage, Amgen continues to advance the largest pipeline in the Company's history, moving with great speed to advance those innovations for the patients who need them. At Amgen, we are driven by our commitment to transform the lives of cancer patients and keep them at the center of everything we do.    For more information, follow us on www.twitter.com/amgenoncology.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of the acquisition of Otezla® (apremilast), including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on  Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project.  Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to acquire other companies or products and to integrate the operations of companies we have acquired may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.The scientific information discussed in this news release related to Amgen's product candidates is preliminary and investigative. Such product candidates are not approved by the U.S. Food and Drug Administration, and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates. CONTACT: Amgen, Thousand OaksTrish Hawkins, 805-447-5631 (Media) Jessica Akopyan, 805-447-0974 (Media)Arvind Sood, 805-447-1060 (Investors)     View original content:http://www.prnewswire.com/news-releases/the-discovery-of-amgens-novel-investigational-krasg12c-inhibitor-amg-510-published-in-nature-300948664.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen Reports Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 29, 2019 4:01PM EDT",
        "content": "THOUSAND OAKS, Calif., Oct. 29, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced financial results for the third quarter of 2019. Key results include:\"Amgen continues to execute well in a dynamic environment, with many of our innovative medicines delivering double-digit, volume-driven growth, complemented by the strong performance of our recently launched biosimilar products,\" said Robert A. Bradway, chairman and chief executive officer. \"We continue to advance numerous first-in-class medicines in our pipeline, while also pursuing external opportunities that will contribute to our long-term growth, such as our pending acquisition of Otezla.\"Product Sales PerformanceProduct Sales Detail by Product and Geographic RegionOperating Expense, Operating Margin and Tax Rate AnalysisOn a GAAP basis:On a non-GAAP basis: Cash Flow and Balance Sheet 2019 GuidanceFor the full year 2019, the Company now expects:Third Quarter Product and Pipeline UpdateThe Company provided the following updates on selected product and pipeline programs:ResearchTezepelumabAMG 570EVENITYKYPROLISBLINCYTONplateAMG 510ABP 798 (biosimilar rituximab)Tezepelumab is being developed in collaboration with AstraZeneca PLCEVENITY is developed in collaboration with UCB globally, as well as our joint venture partner Astellas in JapanRituxan is a registered trademark of GenentechNon-GAAP Financial MeasuresIn this news release, management has presented its operating results for the third quarters of 2019 and 2018, in accordance with U.S. Generally Accepted Accounting Principles (GAAP) and on a non-GAAP basis. In addition, management has presented its full year 2019 EPS and tax rate guidance in accordance with GAAP and on a non-GAAP basis. These non-GAAP financial measures are computed by excluding certain items related to acquisitions, restructuring and certain other items from the related GAAP financial measures. Reconciliations for these non-GAAP financial measures to the most directly comparable GAAP financial measures are included in the news release. Management has also presented Free Cash Flow (FCF), which is a non-GAAP financial measure, for the third quarters of 2019 and 2018. FCF is computed by subtracting capital expenditures from operating cash flow, each as determined in accordance with GAAP.The Company believes that its presentation of non-GAAP financial measures provides useful supplementary information to and facilitates additional analysis by investors. The Company uses certain non-GAAP financial measures to enhance an investor's overall understanding of the financial performance and prospects for the future of the Company's ongoing business activities by facilitating comparisons of results of ongoing business operations among current, past and future periods. The Company believes that FCF provides a further measure of the Company's liquidity.The Company uses the non-GAAP financial measures set forth in the news release in connection with its own budgeting and financial planning internally to evaluate the performance of the business, including to allocate resources and to evaluate results relative to incentive compensation targets. The non-GAAP financial measures are in addition to, not a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP.About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.For more information, visit www.amgen.com and follow us on www.twitter.com/amgen.Forward-Looking StatementsThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of the acquisition of Otezla, including anticipated Otezla sales growth and the timing of non-GAAP EPS accretion, as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.No forward-looking statement can be guaranteed and actual results may differ materially from those we project. Our results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. We or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. If we fail to meet the compliance obligations in the corporate integrity agreement between us and the U.S. government, we could become subject to significant sanctions. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to acquire other companies or products and to integrate the operations of companies we have acquired may not be successful. A breakdown, cyberattack or information security breach could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.CONTACT: Amgen, Thousand OaksTrish Hawkins, 805-447-5631 (media)Arvind Sood, 805-447-1060 (investors)         View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-reports-third-quarter-2019-financial-results-300947566.htmlSOURCE  Amgen"
    },
    {
        "title": "Amgen Announces Webcast of 2019 Third Quarter Financial Results",
        "subtitle": "",
        "date": "Oct 24, 2019 4:00PM EDT",
        "content": "THOUSAND OAKS, Calif., Oct. 24, 2019 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced that it will report its third quarter financial results on Tuesday, Oct. 29, 2019, after the close of the U.S. financial markets. The announcement will be followed by a conference call with the investment community at 2 p.m. PT. Participating in the call from Amgen will be Robert A. Bradway, chairman and chief executive officer, and other members of Amgen's senior management team.Live audio of the conference call will be simultaneously broadcast over the internet and will be available to members of the news media, investors and the general public. The webcast, as with other selected presentations regarding developments in Amgen's business given by management at certain investor and medical conferences, can be found on Amgen's website, www.amgen.com, under Investors. Information regarding presentation times, webcast availability and webcast links are noted on Amgen's Investor Relations Events Calendar. The webcast will be archived and available for replay for at least 90 days after the event.  About AmgenAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential. For more information, visit www.amgen.com and follow us on www.twitter.com/amgen. CONTACT: Amgen, Thousand OaksTrish Hawkins, 805-447-5631 (media)Jessica Akopyan, 805-447-0974 (media)Arvind Sood, 805-447-1060 (investors)   View original content to download multimedia:http://www.prnewswire.com/news-releases/amgen-announces-webcast-of-2019-third-quarter-financial-results-300945140.htmlSOURCE  Amgen"
    }
]