[
    {
        "title": "Amazon Reveals Top 10 States, Cities and Top Categories with the Most Handmade Makers",
        "subtitle": "",
        "date": "Feb 21, 2020 8:00AM EST",
        "content": "\nCalifornia, Arizona, North Carolina, Michigan, and Pennsylvania among the top states with the highest population of Makers selling in the Amazon Handmade store\n\nSan Diego, Portland, and Las Vegas among the top cities with the highest population of Makers selling in the Amazon Handmade store\n\nThe top categories for Makers are Home, Jewelry, and Accessories\n    SEATTLE--(BUSINESS WIRE)--\nAmazon (NASDAQ:AMZN) today announced the 10 states and cities with the most Makers selling in the Amazon Handmade store. Amazon looked at which states and cities the most Makers call home and found that the top states represent every region of the country, with thousands of Makers residing in California, Arizona, North Carolina, Michigan, and Pennsylvania. The top cities span across the four corners of the U.S., from New York, to Miami, to San Diego, to Seattle. Amazon also revealed the top product categories for Makers and found the largest number of Makers are selling products in the Home category. Amazon Handmade features genuinely handcrafted products from furniture, to jewelry, to toys, and more from tens of thousands of Makers in the U.S. and around the world.\n\nThe top 10 states with the most Makers are:\n\nThe top 10 cities with the most Makers are:\n\nThe top product categories for Makers are:\n\n“Across the country, there are hundreds of thousands of creative, hard-working, and unique American small businesses that are thriving with Amazon,” said Nicholas Denissen, VP of Small Business at Amazon. “Small and medium-sized businesses selling in Amazon’s stores had a record-breaking year in 2019, with nearly 25,000 American small and medium-sized businesses surpassing $500,000 in sales. We will continue to invest billions of dollars in tools, services, people, and programs – like Amazon Handmade – to help these businesses grow and succeed.”\n\nAmazon Handmade is a store within Amazon.com that empowers Makers with the tools necessary to showcase their products to more than 300 million active customers around the world, regardless of their location. Makers selling with Amazon Handmade come from all 50 states and more than 80 countries around the world.\n\n“At Amazon Handmade, we obsess over customers and their desire for unique handcrafted goods, which is why we are so proud of our incredible Makers and the products they sell in our store,” said Katie Harnetiaux, Head of Amazon Handmade. “The flourishing craft community selling with Amazon Handmade spans from coast-to-coast, with Makers from every corner of the U.S. building successful businesses and reaching new customers.”\n\n“Amazon Handmade has been incredible for my small business. We grew our sales more than 200% last year, and had our best sales day ever on Amazon this Cyber Monday,” said Ken Baker, owner of Dream Big Printables in Charlotte, North Carolina. “Our growth with Amazon has allowed Dream Big Printables to hire local employees as well as increase donations to local non-profits.”\n\nThe 2019 Amazon SMB Impact Report revealed that on average, American small and medium-sized businesses sell more than 4,000 items per minute in Amazon’s stores. In 2019, Amazon invested more than $15 billion and launched more than 225 tools and services to help small and medium-sized businesses grow and succeed. These businesses have created more than 800,000 jobs in the U.S.\n\nTo help American small and medium-sized businesses thrive, in September 2018, Amazon created Amazon Storefronts. With Storefronts, customers can shop a curated collection of more than 2.5 million products from nearly 30,000 U.S.-based businesses. In one year, U.S. small and medium-sized businesses with products in Storefronts sold more than 250 million items to more than 70 million customers.\n\nThe company also launched Amazon Small Business Academy in November 2019 to help small businesses in the U.S. harness the power of the internet to reach more customers, build their brand, and grow sales. Through a combination of free in-person seminar events, live webinars, and community college classes across the country, Amazon Small Business Academy will help thousands of American entrepreneurs gain digital strategy and brand building skills to make their ambitions reality.\n\nTo learn more about small and medium-sized businesses selling in Amazon’s stores, visit: aboutamazon.com/smallbusiness.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit www.amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200221005090/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Amazon Announces First Iowa Fulfillment Center",
        "subtitle": "",
        "date": "Feb 6, 2020 8:42AM EST",
        "content": "\nNew 645,000 square-foot site in the city of Bondurant to create 1,000 new, full-time jobs\n    SEATTLE--(BUSINESS WIRE)--\nAmazon.com, Inc. (NASDAQ: AMZN) today announced plans to open its first fulfillment center in the state of Iowa in the city of Bondurant. The site, which is anticipated to launch in late 2020, will create 1,000 new full-time jobs with industry leading pay and comprehensive benefits starting on day one.\n\n“We are delighted to be opening our first Iowa fulfillment center in the city of Bondurant and look forward to creating 1,000 new, full-time jobs with Amazon’s $15 minimum wage and industry-leading benefits,” said Alicia Boler Davis, Amazon’s vice president of global customer fulfillment. “The site will help us continue to serve customers with great delivery options and we appreciate the strong support from local and state leaders.”\n\n“Amazon’s announcement is jet-fuel for Iowa’s future. Amazon’s investment in East Polk County, and the Bondurant community ushers in a new era of innovation, with lasting benefits for employees, our citizens, our local businesses, and our state. Bondurant’s partnership with Amazon’s fulfillment center will spark growth for Main Street entrepreneurs, builds on Iowa’s high standard of living, and will improve hometown quality of life for families across Iowa,” noted Senator Zach Nunn (R-Bondurant).\n\nAt the new 645,000 square-foot fulfillment center employees will work alongside Amazon robotics to pick, pack and ship small items to customers such as books, electronics and toys.\n\n“The city of Bondurant has seen tremendous growth and success over the last decade. Today’s announcement by Amazon will add another chapter to our city’s story. This is great news for the hundreds of Iowans who will be employed at the fulfillment center as well as the people of Bondurant,” noted State Representative Brian Lohse.\n\nOn top of Amazon’s $15 minimum wage, the company offers full-time employees comprehensive benefits including full medical, vision, and dental insurance as well as a 401(k) with 50 percent match starting on day one. The company also offers up to 20 weeks of maternal and parental paid leave and innovative benefits such as Leave Share and Ramp Back, which give new parents flexibility with their growing families.\n\n“The city of Bondurant is excited to welcome and work with Amazon, who is creating more than 1,000 jobs in our region,” said Curt Sullivan, Mayor of Bondurant. “Amazon’s investment in our community will have significant impact throughout the greater Des Moines region. This project supports the City’s vision to enhance economic development opportunities and diversify employment options. It also enables the City to upgrade the public infrastructure improvements around this site for the betterment of our community members. The investments and the jobs coming to Bondurant will enhance our ability to support future public improvements and spur additional economic development.”\n\n“We are honored to be a part of the team that brought Amazon to Bondurant. Their investment in Eastern Polk county solidifies our area as a logistics hub. Amazon’s leadership will create a positive impact for jobs and culture in Central Iowa,” said Alex Lynch, Executive Director of East Polk Innovation Collaborative (EPIC).\n\nAmazon has also pledged to invest over $700 million to provide upskilling training for 100,000 U.S. employees for in demand jobs. Programs will help Amazonians from all backgrounds access training to move into highly skilled roles across the company’s corporate offices, tech hubs, fulfillment centers, retails stores, and transportation network, or pursue career paths outside of Amazon.\n\n\"We are excited that Amazon is establishing a highly advanced robotic sortation center in Bondurant. Amazon's project in Iowa further demonstrates the region is a logistics and technology hub and adds to the presence of other major tech companies with operations here,\" said Jay Byers, CEO of the Greater Des Moines Partnership. \"This project shows that Iowa continues to be recognized nationally as a top place for businesses to relocate or expand.\"\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005551/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Amazon Expands in Santa Barbara and Announces Plans to Create 150 Tech Jobs in Central California",
        "subtitle": "",
        "date": "Feb 4, 2020 9:00AM EST",
        "content": "\nNew 48,000 square foot tech office is located downtown and has space for more than 275 employees\n\nWith a range of positions already open, the company is looking to double its local workforce in the coming years to support local tech teams\n\nAmazon has already created over 45,000 jobs and invested more than $34.5 billion in California since 2010, including infrastructure and compensation \n    SEATTLE--(BUSINESS WIRE)--\nAmazon (NASDAQ: AMZN) today announced an expansion of the company’s workforce in Santa Barbara, California and plans to create 150 additional tech jobs in the city. With plans to double its workforce, the company has opened a new 48,000 square foot office for Alexa tech teams located in downtown Santa Barbara. Amazon has created more than 45,000 full-time jobs in California since 2010 and invested over $34.5 billion in the state, including infrastructure and compensation to our employees.\n\n“We have been able to hire great talent in Santa Barbara and look forward to doubling our workforce here,” said Kevin Davis, Site Lead of Amazon’s Santa Barbara office. “Santa Barbara is an incredibly welcoming city with a high quality of life and innovative culture – and we’re excited to create more jobs, and continue to invest locally in the community.”\n\n“We welcome a new Amazon office in downtown Santa Barbara, adding to the mix of innovative, technology companies in our region. We encourage their employees to participate in community events and enjoy the amenities of local restaurants, shopping, and arts and culture,” said Cathy Murillo, Mayor of Santa Barbara.\n\nThe tech teams based in Santa Barbara help Alexa get even smarter every day, developing new ways to power Alexa’s factual knowledge in devices such as Amazon Echo and Fire TV. The Santa Barbara-based teams work with scientists in Amazon’s Development Center in Cambridge, England in this effort. Amazon currently has dozens of open roles located in Santa Barbara, including Software and Data Engineers, Knowledge Engineers, Data Scientists, Machine Learning Associates, Product Managers, and more.\n\nThe new Amazon office includes energy efficient appliances and sensors to reduce energy and water consumption, enhanced bike storage and lockers to encourage alternate modes of commuting, and open spaces to enhance collaboration and innovation between teams.\n\nInvesting and creating jobs in California – and giving back in the Golden State\n\nSince 2010, Amazon has created more than 45,000 full-time jobs and invested over $34.5 billion in California, from customer fulfillment and cloud infrastructure to research facilities and compensation to our employees. The company estimates that these direct investments in the state contributed an additional $25.8 billion to California’s economy and generated an additional 100,000 indirect jobs on top of the company’s direct hires. There are also more than 338,000 small and medium-sized businesses, developers and authors growing their businesses with Amazon products and services in California.\n\nAs a part of Amazon’s ongoing commitment to the communities where employees live and work, the Amazon Future Engineer program — a childhood-to-career program to inspire, educate, and propel children and young adults from underserved and underrepresented communities to try computer science — serves millions of students each year across the country. In California specifically, Amazon Future Engineer is funding computer science classes in more than 170 California high schools, awarded 14 students from California the Amazon Future Engineer Scholarship award, which includes $10,000 per year for the student to study computer science in college and a guaranteed, paid internship offer at Amazon, and more than 15 schools in California are part of the Amazon Future Engineer robotics grant program. Our employees in Santa Barbara have already dedicated hundreds of volunteer hours to support local charities, from local homeless shelter to food drives, such as Teddy Bear Cancer Foundation, Alpha Resource Center, Hillside House, Organic Soup Kitchen, Toys for tots, Transition House and Domestic Violence Solutions.\n\nAmazon has been recognized on LinkedIn’s Top Companies list for the past four years, ranked #2 in the Fortune 2017 and 2018 World’s Most Admired Companies, and ranked #5 in Fast Company's World’s Most Innovative Companies. The company also receives a perfect score from the Human Rights Campaign Corporate Equality Index. Amazon offers a wide range of programs to equip employees with the skills for new, in-demand jobs — from paid cloud computing apprenticeships, to Amazon Technical Academy to its innovative Career Choice initiative, which prepays 95 percent of the cost of tuition to pursue continuing education courses in in-demand fields, regardless of whether the skills are relevant to a career at Amazon. All these program are part of Upskilling 2025, a $700 million commitment by Amazon looking to support all employees in gaining critical skills to move into higher skill, better paying, technical or non-technical roles.\n\nAbout Amazon \n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit www.amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005308/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Amazon.com Announces Fourth Quarter Sales up 21% to $87.4 Billion",
        "subtitle": "",
        "date": "Jan 30, 2020 4:01PM EST",
        "content": "    SEATTLE--(BUSINESS WIRE)--\nAmazon.com, Inc. (NASDAQ: AMZN) today announced financial results for its fourth quarter ended December 31, 2019.\n\nOperating cash flow increased 25% to $38.5 billion for the trailing twelve months, compared with $30.7 billion for the trailing twelve months ended December 31, 2018. Free cash flow increased to $25.8 billion for the trailing twelve months, compared with $19.4 billion for the trailing twelve months ended December 31, 2018. Free cash flow less principal repayments of finance leases and financing obligations increased to $16.2 billion for the trailing twelve months, compared with $11.6 billion for the trailing twelve months ended December 31, 2018. Free cash flow less equipment finance leases and principal repayments of all other finance leases and financing obligations increased to $12.5 billion for the trailing twelve months, compared with $8.4 billion for the trailing twelve months ended December 31, 2018.\n\nCommon shares outstanding plus shares underlying stock-based awards totaled 512 million on December 31, 2019, compared with 507 million one year ago.\n\nFourth Quarter 2019\n\nNet sales increased 21% to $87.4 billion in the fourth quarter, compared with $72.4 billion in fourth quarter 2018. Excluding the $120 million unfavorable impact from year-over-year changes in foreign exchange rates throughout the quarter, net sales increased 21% compared with fourth quarter 2018.\n\nOperating income increased to $3.9 billion in the fourth quarter, compared with operating income of $3.8 billion in fourth quarter 2018.\n\nNet income increased to $3.3 billion in the fourth quarter, or $6.47 per diluted share, compared with net income of $3.0 billion, or $6.04 per diluted share, in fourth quarter 2018.\n\nFull Year 2019\n\nNet sales increased 20% to $280.5 billion, compared with $232.9 billion in 2018. Excluding the $2.6 billion unfavorable impact from year-over-year changes in foreign exchange rates throughout the year, net sales increased 22% compared with 2018.\n\nOperating income increased to $14.5 billion, compared with operating income of $12.4 billion in 2018.\n\nNet income increased to $11.6 billion, or $23.01 per diluted share, compared with net income of $10.1 billion, or $20.14 per diluted share, in 2018.\n\n“Prime membership continues to get better for customers year after year. And customers are responding — more people joined Prime this quarter than ever before, and we now have over 150 million paid Prime members around the world,” said Jeff Bezos, Amazon founder and CEO. “We’ve made Prime delivery faster — the number of items delivered to U.S. customers with Prime’s free one-day and same-day delivery more than quadrupled this quarter compared to last year. Members now have free two-hour grocery delivery from Amazon Fresh and Whole Foods Market in more than 2,000 U.S. cities and towns. Prime members watched double the hours of original movies and TV shows on Prime Video this quarter compared to last year, and Amazon Originals received a record 88 nominations and 26 wins at major awards shows. A huge thank you to teams across Amazon for their dedicated work to build, innovate, and deliver for customers this holiday.”\n\nHighlights\n\nFinancial Guidance\n\nThe following forward-looking statements reflect Amazon.com’s expectations as of January 30, 2020, and are subject to substantial uncertainty. Our results are inherently unpredictable and may be materially affected by many factors, such as fluctuations in foreign exchange rates, changes in global economic conditions and customer spending, world events, the rate of growth of the Internet, online commerce, and cloud services, and the various factors detailed below.\n\nFirst Quarter 2020 Guidance\n\nA conference call will be webcast live today at 2:30 p.m. PT/5:30 p.m. ET, and will be available for at least three months at amazon.com/ir. This call will contain forward-looking statements and other material information regarding the Company’s financial and operating results.\n\nThese forward-looking statements are inherently difficult to predict. Actual results could differ materially for a variety of reasons, including, in addition to the factors discussed above, the amount that Amazon.com invests in new business opportunities and the timing of those investments, the mix of products and services sold to customers, the mix of net sales derived from products as compared with services, the extent to which we owe income or other taxes, competition, management of growth, potential fluctuations in operating results, international growth and expansion, the outcomes of claims, litigation, government investigations, and other proceedings, fulfillment, sortation, delivery, and data center optimization, risks of inventory management, seasonality, the degree to which the Company enters into, maintains, and develops commercial agreements, proposed and completed acquisitions and strategic transactions, payments risks, and risks of fulfillment throughput and productivity. Other risks and uncertainties include, among others, risks related to new products, services, and technologies, system interruptions, government regulation and taxation, and fraud. In addition, the global economic climate amplifies many of these risks. More information about factors that potentially could affect Amazon.com’s financial results is included in Amazon.com’s filings with the Securities and Exchange Commission (“SEC”), including its most recent Annual Report on Form 10-K and subsequent filings.\n\nOur investor relations website is amazon.com/ir and we encourage investors to use it as a way of easily finding information about us. We promptly make available on this website, free of charge, the reports that we file or furnish with the SEC, corporate governance information (including our Code of Business Conduct and Ethics), and select press releases, which may contain material information about us, and you may subscribe to be notified of new information posted to this site.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\n\nAmazon.com, Inc.\n\nCertain Definitions\n\nCustomer Accounts\n\nSeller Accounts\n\nAWS Customers\n\nUnits\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005814/en/\nAmazon.com Investor Relations\nDave Fildes, amazon-ir@amazon.com\namazon.com/ir\n\nAmazon.com Public Relations\nDan Perlet, amazon-pr@amazon.com\namazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Amazon.com, Walt Disney, EXACT Sciences, JPMorgan Chase, or Netflix?",
        "subtitle": "",
        "date": "Jan 14, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 14, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMZN, DIS, EXAS, JPM, and NFLX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amazoncom-walt-disney-exact-sciences-jpmorgan-chase-or-netflix-300986594.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Applied Materials, Amazon.com, Baidu, Lam Research, or NVIDIA?",
        "subtitle": "",
        "date": "Jan 10, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 10, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMAT, AMZN, BIDU, LRCX, and NVDA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast. (Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-applied-materials-amazoncom-baidu-lam-research-or-nvidia-300984887.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "VOXX Automotive Corp. and Amazon Join Forces to Bring Fire TV to the Automotive Market",
        "subtitle": "",
        "date": "Jan 6, 2020 9:00AM EST",
        "content": " ORLANDO, Fla., Jan. 6, 2020 /PRNewswire/ -- VOXX Automotive Corp., a wholly-owned subsidiary of VOXX International Corporation (NASDAQ: VOXX), today announced that in collaboration with Amazon (NASDAQ: AMZN), it will be developing solutions that will bring Amazon's Fire TV to the automotive market. VOXX Automotive Corp. has been a leader in rear-seat entertainment for decades, providing innovative solutions to both global OEM's and to the automotive aftermarket. Over the past several years, through a commitment to innovation and bridging the gap between content, connectivity and devices, the Company has formed several alliances with industry leaders that enrich the in-vehicle consumer experience. Through its award-winning rear-seat entertainment system, EVO, passengers can not only watch their favorite DVD's, they can access their own digital content and wirelessly share this experience with mobile devices, in addition to accessing their cable programming through Sling Media. Now, VOXX Automotive Corp. will be working with Amazon to deliver solutions and services that can significantly accelerate the development cycle of Fire TV for automakers.The Company also announced today that it has entered into a tier-1 supply agreement with one of the world's largest global auto makers, with plans to integrate Fire TV into this OEM's vehicle programs in calendar year 2021. No additional details were provided at this time, though the Company intends to have further updates as development progresses and as it moves closer to commercialization. \"By working with Amazon to enable Fire TV for in-vehicle entertainment, we have been able to create a reference implementation that automotive OEMs can build into their vehicle programs and bring all of the rich entertainment of Fire TV into automotive grade installations,\" stated Ed Mas, President, VOXX Automotive Corp. \"This is a very exciting venture for our OEM operations, and we continue to look for innovative ways, whether through product development or partnerships, to enhance the consumer experience further.\"About VOXX Automotive Corp.VOXX Automotive Corp. is a wholly-owned subsidiary of VOXX International Corporation and brings together the Company's OEM and aftermarket automotive businesses, including the OEM operations of Invision® Automotive Systems and Code Alarm®, and a diverse set of aftermarket solutions leveraging its 12-volt and retail distribution networks. From the most innovative rear-seat entertainment solutions, to advanced security and remote start solutions, VOXX Automotive Corp. has been working with many of the world's most respected OEM's for decades. With over 160 engineers on staff, we are committed to developing next-generation technologies that bridge the gap between content, devices and connectivity. For more information on VOXX Automotive, please visit our website at www.voxxautomotive.com.About VOXX International CorporationVOXX International Corporation (NASDAQ: VOXX) has grown into a worldwide leader in many automotive and consumer electronics and accessories categories, as well as premium high-end audio. Today, VOXX International is a global company, with an extensive distribution network that includes power retailers, mass merchandisers, 12-volt specialists and most of the world's leading automotive manufacturers. The Company has an international footprint in Europe, Asia and Latin America, and a growing portfolio which is comprised of over 30 trusted brands. For additional information, please visit our website at www.voxxintl.com.Safe Harbor StatementExcept for historical information contained herein, statements made in this release constitute forward-looking statements and thus may involve certain risks and uncertainties. All forward-looking statements made in this release are based on currently available information and the Company assumes no responsibility to update any such forward-looking statements. The following factors, among others, may cause actual results to differ materially from the results suggested in the forward-looking statements. The factors include, but are not limited to the: risk factors described in the Company's annual report on Form 10-K for the fiscal year ended February 28, 2019 which was filed with the SEC on May 14, 2019, as amended on Form 10-K/A filed on May 30, 2019, and other filings made by the Company from time to time with the SEC. The factors described in such SEC filings include, without limitation: the Company's ability to realize the anticipated results of its business realignment; cybersecurity risks; risks that may result from changes in the Company's business operations; our ability to keep pace with technological advances; significant competition in the automotive electronics, consumer electronics and biometrics businesses; our relationships with key suppliers and customers; quality and consumer acceptance of newly introduced products; market volatility; non-availability of product; excess inventory; price and product competition; new product introductions; foreign currency fluctuations; and restrictive debt covenants.Investor & Media Relations Contact:                                                      Glenn Wiener, GW Communications (for VOXX)                                Tel: 212-786-6011 / Email: gwiener@GWCco.com  View original content:http://www.prnewswire.com/news-releases/voxx-automotive-corp-and-amazon-join-forces-to-bring-fire-tv-to-the-automotive-market-300981164.htmlSOURCE  VOXX International Corporation"
    },
    {
        "title": "Amazon Fire TV Introduces Expanded Suite of Features and New Solution Providers for Fire TV Edition Partners",
        "subtitle": "",
        "date": "Jan 6, 2020 9:00AM EST",
        "content": "\nFire TV Edition now powers over 50 TV and soundbar models in more than 10 countries \n\nFire TV Edition for Auto enables vehicle manufacturers to integrate Fire TV directly into in-car entertainment systems—BMW and Fiat Chrysler Automobiles among first to use the service in future vehicles\n\nFire TV Edition for Operators offers service providers more device choices and new opportunities to integrate their content into the Fire TV experience—Verizon and Tata Sky are the first to integrate\n    SEATTLE--(BUSINESS WIRE)--\n(NASDAQ: AMZN) – Today, Amazon announced the expansion of the Fire TV Edition program, delivering a richer experience and more opportunities for developers, operators, device makers and manufacturers across multiple categories including automotive, smart TVs, soundbars and streaming media players. Fire TV has passed more than 40 million active users, and customers globally have access to tens of thousands of channels, apps, Alexa skills and more. With this expanded Fire TV Edition, it will be even easier for device makers to integrate Fire TV into their products, with new tools and services for each category that will enable companies to bring tailored entertainment experiences and great content to their customers.\n\n“At CES 2017, we announced the first Fire TV Edition smart TV. Now, just three years later, Fire TV Edition has grown into a worldwide program which will include more than 150 Fire TV Edition models across more than ten countries by the end of the year,” said Marc Whitten, Vice President, Amazon Fire TV. “Our expanded Fire TV Edition program provides companies with the services and tools they need to bring Fire TV to more categories and more screens.”\n\nSince 2017, Amazon has expanded its Fire TV Edition program each year to bring new features and services to partners. In 2018, Amazon and Best Buy announced an initiative to bring Fire TV Edition TVs to customers in the United States and Canada, and to date, they have sold millions of Insignia and Toshiba Fire TV Edition smart TVs.\n\n“Over the past year, Best Buy has sold millions of Fire TV Edition smart TVs on BestBuy.com, in our stores and as a third-party seller on Amazon.com. We’ve enjoyed working with the Amazon team to bring these high-quality TVs and the incredible Fire TV experience to our customers,” said Luke Motschenbacher, Vice President of Merchandising, Best Buy.\n\nFollowing the success of Fire TV Edition smart TVs with Best Buy, Amazon announced plans to expand internationally, bringing the next generation of Fire TV Edition devices to customers in the United Kingdom, Germany, Austria, Ireland and India. In 2019, more than 50 Fire TV Edition smart TVs and soundbars have launched from global brands like Grundig, JVC, Onida and Anker and retailers like Best Buy, Currys PC World and MediaMarktSaturn (coming 2020). Amazon will continue its international expansion with more brands launching Fire TV Edition smart TVs in the United States, Canada, India, United Kingdom, Ireland, Germany, Austria, Italy, Spain and Mexico in the coming year.\n\nIntroducing Fire TV Edition for Soundbars \n\nThis past September, Amazon and Anker Innovations announced the Nebula Soundbar–Fire TV Edition, the first Fire TV Edition soundbar featuring an all-in-one home cinema experience with expansive video streaming and stunning sound. Starting today, the TCL Alto 8+ Soundbar–Fire TV Edition is available on Amazon in the United States and Canada. Customers of amazon.co.uk, amazon.de, amazon.fr, amazon.it and amazon.es can sign up today to be notified when the TCL TS8011 Soundbar–Fire TV Edition is available on Amazon. Both soundbars are designed to support premium acoustic performance, with carefully tuned speaker drivers and support for Dolby Digital Plus producing clear, dynamic and immersive sound.\n\nAmazon now works with a growing number of device manufacturers including Anker, Polk Audio and Tonly on soundbar solutions. Later this year, Fire TV Edition soundbars will offer new features including Dolby Atmos support, compatible device control, HDMI switching and far-field voice control, along with partner customizations.\n\nIntroducing Fire TV Edition for Auto\n\nBuilding on the success of Fire TV Edition smart TVs and soundbars, Amazon is expanding the program to automakers, partnering with BMW and Fiat Chrysler Automobiles (FCA). With hands-free access to Alexa, touch screen interface and offline playback capabilities, parents and kids alike can enjoy the living room TV experience in the car and watch a wide variety of content and the latest shows from the most popular video services worldwide and shows recorded with Fire TV Recast or saved locally on-device. Content can be streamed using a vehicle’s Wi-Fi or LTE connection, a mobile hotspot or any other WAN-enabled device.\n\n“Adding Fire TV to future BMW vehicles represents a big step in bringing the best of streamed entertainment to our products. With Amazon’s approach, and with the help of Garmin, we are able to innovate and create a unique and special experience for BMW cars, providing the consistency of content and customer experience that Fire TV provides in the home. We look forward to working closely with Amazon to bring Fire TV to future vehicles,” said Fathi El-Dwaik, Vice President User Interaction, Business Line My Car and Business Line My Life, BMW Group.\n\nIntroducing Fire TV Edition for Operators\n\nStarting today, Fire TV is enabling television and telecommunication operators to quickly bring Fire TV Edition devices to their customers in a more customized and cost-effective way. After successfully introducing Fire TV partnerships with Tata Sky in India and Verizon in the United States, Fire TV is now expanding the device offerings available to operators, allowing them to choose the best solution that fits their customer and business needs as well as providing merchandising opportunities in the Fire TV Edition customer experience.\n\nThe Fire TV Edition for Operators is available today in North America, Europe, India and Japan.\n\nIntroducing Fire TV Edition – Certified Solutions Providers \n\nFire TV is enabling partners across a variety of industries and categories to work with certified solutions providers to rapidly bring the latest Fire TV Edition devices to customers. Amazon currently works with a growing number of TV manufacturers who produce Fire TV Edition smart TVs. Vestel, Arcelik, Compal, TPV and others can now build Fire TV Edition smart TVs for their customers with manufacturing and assembly capabilities around the world.\n\nToday, Amazon announced Skyworth as the latest global ODM with turnkey solutions for smart TVs. These turnkey solutions enable Skyworth and other ODMs to work with the world’s leading TV brands to bring high-quality, differentiated, cost-effective 4K and FHD smart TVs to customers. Starting in India, brands can choose from a selection of manufacturers with various industrial design and price options to bring an entire lineup of smart TVs to customers.\n\nThe turnkey ODM solution offered in collaboration with Amazon includes out-of-the-box reference designs, schematics and boards designed with CVTE, a leading LCD TV mainboard provider for feature-rich 4K and FHD smart TVs; self-service tools and software customizations, such as settings SDK for custom picture and audio settings; and customized industrial design and hardware options.\n\n“We are excited to build a scalable, worldwide smart TV program with Fire TV Edition,” said Tony Wang, CEO and Chairman of Skyworth TV Business Division. “ODMs & OEMs can offer customers the choice of a top-rated smart TV software experience along with the speed, value and high-quality hardware that they always expect from Skyworth.”\n\nFor auto partners, Amazon is working with leading system integrators VOXX Automotive and Garmin to deliver solutions and services that can significantly accelerate the development cycle for automakers.\n\n“By working with Amazon to enable Fire TV for in-vehicle entertainment, we have been able to create a reference implementation that automotive OEMs can build into their vehicle programs and bring all of the rich entertainment of Fire TV into automotive grade installations,” said Ed Mas, President, VOXX Automotive, a division of VOXX International Corporation.\n\nFor operators, Amazon also announced it is working with the National Cable Television Cooperative (NCTC) to enable its members the ability to deliver low cost Fire TV streaming media players directly to their customers. NCTC has over 750 members, including independent cable and telecommunication operators, delivering service to 16 million broadband and 8 million video customers in the aggregate.\n\nDevice makers and operators interested in learning more about the Fire TV Edition program can visit: https://developer.amazon.com/apps-and-games/fire-tv-edition.\n\nAbout Amazon \n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo and Alexa are some of the products and services pioneered by Amazon. For more information, visit www.amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005589/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Amazon.com, Boeing, Mastercard, Microsoft, or Verizon?",
        "subtitle": "",
        "date": "Jan 2, 2020 9:31AM EST",
        "content": " NEW YORK, Jan. 2, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMZN, BA, MA, MSFT, and VZ.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amazoncom-boeing-mastercard-microsoft-or-verizon-300980448.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Amazon.com, Citigroup, FedEx, or Universal Display Corp?",
        "subtitle": "",
        "date": "Dec 27, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 27, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, AMZN, C, FDX, and OLED.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-amazoncom-citigroup-fedex-or-universal-display-corp-300979530.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Customers Shopped at Record Levels this Holiday Season with Billions of Items Ordered Worldwide – Plus Customers Purchased Tens of Millions of Amazon Devices",
        "subtitle": "",
        "date": "Dec 26, 2019 3:00AM EST",
        "content": "\nCustomers in the U.S. Enjoyed a Season of Convenience – Number of Items Delivered with Prime Free One-Day and Prime Free Same-Day Delivery Nearly Quadrupled\n\nThe Best-Selling Amazon Devices Worldwide this Holiday Season Included Echo Dot, Fire TV Stick with Alexa Voice Remote and Echo Show 5\n\nToys and Games, Fashion, Home and Beauty Were Popular Departments to Shop with More Than Half a Billion Total Items Ordered \n\nRecord-Breaking Season for Independent Third-Party Sellers – Mostly Small and Medium-Sized Businesses – Worldwide Unit Sales Seeing Double-Digit Year-over-Year Growth, Surpassing a Billion Items Sold\n    SEATTLE--(BUSINESS WIRE)--\n(NASDAQ:AMZN) – Amazon today announced that this holiday season was record-breaking thanks to its customers all around the world – billions of items were ordered worldwide and tens of millions of Amazon Devices were purchased worldwide. Throughout the season, Amazon offered customers incredible deals every day and deeper discounts and more Deals of the Day than ever before during shopping events like Black Friday and Cyber Monday. Some of the best-selling products and brands this holiday season were the Echo Dot, Fire TV Stick with Alexa Voice Remote, Echo Show 5, L.O.L. Surprise! Glitter Globe Doll Winter Disco Series with Glitter Hair, iRobot Roomba 675 Robot Vacuum, HAUS LABORATORIES, Carhartt, AmazonBasics, and Champion items. Popular departments customers shopped in Amazon’s Stores in the U.S. were toys, fashion, home and beauty with more than half a billion total items ordered.\n\n“This holiday season has been better than ever thanks to our customers and employees all around the world,” said Jeff Bezos, Amazon founder and CEO. “On behalf of all Amazonians, we wish everyone the happiest of holidays and a fantastic 2020.”\n\nAmazon’s worldwide and U.S.-only seasonal and year-end highlights are as follows.\n\nAMAZON EMPLOYEES\n\nSMALL AND MEDIUM-SIZED BUSINESSES\n\nPRIME MEMBERS, SHIPPING & DELIVERY\n\nAMAZON DEVICES & SERVICES\n\nAMAZON BEST-SELLERS AND SEASONAL TRENDS\n\nToys and Games\n\nHome\n\nFashion\n\nBeauty\n\nElectronics\n\nPets\n\nSports\n\nAmazon Brands\n\nBooks\n\nAmazon Books and Amazon 4-star stores\n\nAMAZON GROCERY\n\nAMAZON ENTERTAINMENT\n\nSOCIAL HANDLES:\nFacebook: @Amazon\nInstagram: @Amazon\nTwitter: @Amazon\nLanding Page: amazon.com\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191226005037/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Amazon Makes Returns Even Easier This Holiday with Free Returns on Millions of Items",
        "subtitle": "",
        "date": "Dec 18, 2019 6:01AM EST",
        "content": "\nNew this year, customers have at least one free and easy return option for millions of items including electronics, pet supplies, household items, kitchen appliances and more\n\nIn support of the company’s commitment to sustainability, Amazon expands label-free and box-free returns to more than 5,800 locations, limiting the amount of packaging used for returns\n\nFree and easy returns can be made to one of 18,000+ drop-off locations in the U.S., including Amazon Books and Amazon 4-star stores, Amazon Hub locations, Kohl’s, select Whole Foods Markets and UPS\n    SEATTLE--(BUSINESS WIRE)--\nAmazon (NASDAQ: AMZN) today announced that it’s making buying – and returning – even more convenient this holiday season by offering customers at least one free return option on millions of items sold on Amazon.com. Free returns are now available for electronics, household items, pet supplies, kitchen appliances and more, in addition to shoes and apparel, no matter the reason for the return.\n\n“At Amazon, we’re constantly innovating on the customer experience – not only when purchasing an item, but also making a return,” said Libby Johnson McKee, Director, Amazon WW Returns and ReCommerce. “With free returns on millions of items, customers don’t need to worry if the keyboard they ordered doesn’t feel quite right or if their dog likes his new bed – they can buy with confidence, knowing they’ll be able to return it for free with just a few easy clicks.”\n\nAs Amazon’s logistics network continues to grow, the company is enabling delivery and returns at even faster speeds, and to the most convenient locations. Previously only clothing, shoes and bedding were eligible for at least one free return, and now through Amazon’s network of locations, expanding partnerships with other retailers, and the back-end technology that Amazon has worked on for years, customers can return millions of items for free.\n\nReturning in Three Easy Steps\n\nTo start a return, customers select the item(s) to be returned and the reason for returning from the ‘Your Orders’ page on Amazon.com or the Amazon app. Customers then select from a list of convenient return options, including at least one free option, and then drop off their item at a location within 5 miles of their delivery address. Most refunds are credited to customer’s accounts within 2 hours of the return being initiated.\n\nA New, More Sustainable Way to Return\n\nAmazon now offers a label-free and box-free return option for eligible items at more than 5,800 locations, limiting the amount of packaging used in returns and in many cases, reducing the number of pickups from drivers. For customers, label-free, box-free returns is simple to use – customers show the QR code received after starting a return, along with the item to be returned, to an associate at a participating location. The associate will then pack and ship it for free, consolidating packages whenever possible. Amazon’s label-free and box-free return option is one of many sustainability initiatives across Amazon, including goals such as The Climate Pledge, the company’s commitment to net zero carbon by 2040 and 100% renewable energy by 2030.\n\nEven More Places to Return\n\nAmazon now offers more than 18,000 no-cost return drop-off locations for customers, including Amazon Books stores, Amazon 4-Star stores, Amazon Hub locations, select Whole Foods Markets and third party locations like Kohl’s, and UPS and more.\n\nReturn Policies That Deliver Customer Smiles\n\nItems eligible for free returns are indicated on the product’s detail page. All return-eligible items, weighing under 50 lbs. and sold and fulfilled by Amazon, have at least one free return option within 30 days of delivery for a full refund. Customers can return the item for any reason in new and unused condition. During the holidays, items shipped and fulfilled by Amazon between November 1, 2019 and December 31, 2019 can be returned until January 31, 2020. To see Amazon’s full list of return policies, click here.\n\nTo find out more about Amazon Returns, click here, and to return a gift this holiday season, click here. For b-roll on the Amazon Returns process, click here.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191218005236/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Adding Executive Firepower, Audible Appoints Tech, Digital Media, and Information Services Leader Bob Carrigan as CEO, Reporting to Founder Don Katz",
        "subtitle": "",
        "date": "Dec 17, 2019 9:00AM EST",
        "content": "    NEWARK, N.J.--(BUSINESS WIRE)--\nAudible, Inc., the world’s largest seller and producer of digital spoken-word entertainment and information, today announced that Bob Carrigan will join the company on January 2nd as Chief Executive Officer reporting to founder Don Katz, who will become Executive Chairman.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191217005400/en/Don Katz, Founder and Executive Chairman of Audible, Inc. (Photo: Business Wire)\n“Bob Carrigan is among the most accomplished, creative, intellectually adept, and inspirational CEOs I have watched succeed over my twenty years of studying and chronicling businesses and my twenty-four years leading Audible,” said Katz. “His transformational stewardship as CEO of the pioneering global information and subscription services juggernaut, IDG, and his visionary leadership as CEO of the venerable international data and analytics institution that is Dun & Bradstreet testify to his rare ability to field big ideas and turn them into customer-centric action. Both companies became far more connected to their customers, to their founding entrepreneurial roots, and both became more meaningful places to work.”\n\n“Bob and I have traded insights on how to translate complex ideas into clear strategic and tactical action as trusted confidantes for years,” Katz continued. “From the time Bob and I first met, when he was a senior executive at AOL two decades ago, I have watched him positively disrupt institutional status quos to measurable and lasting effect. I could not be more thrilled that the stars have aligned to allow him to join the Audible adventure full-time. Bob has lived Audible’s People Principles in his own way over three decades. To welcome someone like Bob as CEO is a thrilling leap forward for me, for our talented and committed employees around the world, and for our many millions of loyal listeners and the many millions more to come.”\n\nAs Executive Chairman, Katz will work closely with Carrigan on overarching strategies as Carrigan takes over responsibility for global business operations. Katz will also focus on Audible’s global content strategy and the company’s extensive social and public policy objectives in Newark and other locations.\n\n“Audible’s evolution from start-up to global powerhouse is a remarkable business and cultural phenomenon,” said Carrigan. “I could not be more honored and excited to join Don and the talented people who have worked so hard to serve millions of customers and so many of our most gifted professional creators. I’m looking forward to being part of Audible’s next chapter as it soars into the future.”\n\nCarrigan most recently served as the Executive Chairman of Genscape, a leading provider of data and analytics to the global energy markets, until its sale to Verisk Analytics in November 2019. Previously, Mr. Carrigan served as Chairman and CEO of Dun & Bradstreet, where he led a business, technology, and cultural transformation that restored the iconic 177-year-old firm to consistent, profitable growth. Before that, Carrigan served as CEO of IDG, transforming that company from traditional print publisher to modern media company, growing multiple new revenue streams across 200 countries. Carrigan also spent four years at America Online Inc. as senior vice president of Interactive Marketing, leading business development for all technology channels. Carrigan is a former member and Chairman of the Interactive Advertising Bureau (IAB). His industry distinctions include Ernst & Young NJ Master Entrepreneur of the Year, Folio 100 Industry Influencer and CEO Innovator of the Year for Large Business Publishers.\n\nPrior to founding Audible, Katz was a journalist and author for twenty years; his work won a National Magazine Award, an Overseas Press Club Award, the Chicago Tribune Heartland Prize for Nonfiction, and was nominated for a National Book Critics Circle Award, among other prizes. In 1994, Katz’s idea that the future of media would be transformed by ubiquitous pocket-borne solid state devices packed with the sound of culture led to the creation of Audible. Today, Audible operates nine Audible audio services beyond the U.S.: audible.co.uk, audible.de, audible.fr, audible.com.au, audible.co.jp, audible.it, audible.ca and two services in India, audible.in and Audible Suno.\n\nKatz is also the founder of Newark Venture Partners, a social impact early-stage investment fund and ultra-bandwidth accelerator that seeks to connect Newark – Audible’s global headquarters – to the early-stage technology start-up innovation economy.\n\nABOUT AUDIBLE, INC.\n\nAudible, Inc., an Amazon.com, Inc. subsidiary (NASDAQ:AMZN), is the leading provider of premium digital spoken audio content, offering customers a new way to enhance and enrich their lives every day. Audible content includes more than 475,000 audio programs from leading audiobook publishers, broadcasters, entertainers, magazine and newspaper publishers, and business information providers.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191217005400/en/\nMatthew Thornton\nAudible\nmthornton@audible.com\nSource: Audible, Inc."
    },
    {
        "title": "Amazon Helps Keep the Holidays ‘Spoiler Free’ with Even More Options to Track and Receive Holiday Deliveries",
        "subtitle": "",
        "date": "Dec 17, 2019 3:01AM EST",
        "content": "\nThis season customers can choose from a variety of ways to conveniently and securely pickup orders, track packages, and even select a preferred delivery day\n    SEATTLE--(BUSINESS WIRE)--\nBetween shopping for gifts, preparing family meals, and getting the house ready for guests, the holidays can be overwhelming. This year, Amazon (NASDAQ: AMZN) is helping to keep the holiday season ‘spoiler free’ by offering even more options for customers to keep gifts a surprise, as well as track and receive Amazon orders.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191217005278/en/Amazon Hub Counter (Photo: Business Wire)\n“We’ve all been there—trying to hide a gift from a curious child or making sure a loved one doesn’t find the surprise you’ve ordered,” said Patrick Supanc, WW Director of Amazon Hub. “Our growing network of delivery and pickup options gives Amazon customers more flexibility and control than ever before – and we will continue to innovate and bring even more convenience and choice to our customers.”\n\nThis holiday season, and year-round, Amazon offers customers a variety of ‘spoiler free’ ways to track, pick up, and have packages delivered in and out of the home — each of which are powered by innovative technology and incredible employees.\n\nPackage pickup? Keep it easy with Amazon Hub.\n\nAmazon Lockers are secure, self-service kiosks that give customers the option to pick up Amazon packages where it’s most convenient. Lockers are available in more than 900 cities and towns across the U.S., located near offices, convenience stores, malls, and grocery stores, including select Whole Foods Markets. Customers have three calendar days to pick up their package. If a customer is unable to collect their package within this timeframe, it will be returned for a refund. Learn more here.\n\nAmazon Counter is a new network of partner-staffed pickup points that gives customers the option to pick up their Amazon packages in-store at one of thousands of partner locations such as Rite Aid, GNC, Health Mart, and Stage Stores. Customers have calendar 14 days to pick up their package and if a customer is unable to collect their package within this timeframe, it will be returned for a refund. Learn more here.\n\nAmazon Locker+ locations are secure and convenient locations in neighborhoods, cities and college campuses across the U.S. staffed with helpful associates and self-serve kiosks. Locker+ is also available at select Whole Foods Market locations. Orders can stay at a Locker+ location for up to 15 days, making this a great solution for customers ordering something while on vacation. Learn more here.\n\nShipping to a Locker, Counter or Locker+ location is easy. Customers simply search and select an Amazon Hub pickup location as the shipping address during checkout. Once a package is ready for pickup, customers will receive an e-mail with a barcode and a unique six-digit code that they’ll use to pick up their package. Delivery to a Hub location is available for the tens of millions of items sold on Amazon.com and works with Same-Day, One-Day, Two-Day and Standard Shipping. These delivery options are available to all Amazon customers at no extra cost. Customers can find a Hub location near them here.\n\nEven more ways to track your delivery in-app or online.\n\nAmazon Map Tracking lets customers view the progress of their delivery on a map in real-time when the driver is close. The feature enables customers to see the remaining number of stops a driver has before their delivery arrives. Learn more here.\n\nAmazon Photo-On-Delivery provides visual delivery confirmation, showing customers that their package was delivered and where it was placed by the driver. Capturing delivery photos helps customers see that their package was safely delivered to their selected location and serves as a notification to customers who wish to minimize the time a package is left unattended. Learn more here.\n\nAmazon Predicted Delivery Window provides customers with a 2-4 hour estimated delivery window. By providing a delivery window, customers are able to plan their day and, if desired, ensure they will be home to receive their delivery. Learn more here.\n\nShare Tracking gives customers the option to send tracking information to friends or family so they know when to expect their package and bring their delivery indoors. Once the package ships, Amazon customers can go to ‘Your Orders’ on the Amazon app, select their purchased item, and tap on the ‘Share Tracking’ feature on the tracking page. Once selected, customers can easily send a link to the tracking information via SMS, email, or messaging apps such as WhatsApp.\n\nAmazon’s Map Tracking, Photo-On-Delivery and Predicted Delivery Window features are available for packages delivered by Amazon in the U.S. Customers can access these convenient features from their Amazon app by enabling shipment notifications.\n\n“Alexa, where’s my stuff?”\n\nAlexa will not reveal names of items likely to be gifts when customers ask, “Where’s my stuff” or to read delivery notifications, to prevent spoiling surprises during the holiday season. Customers that prefer to never hear, or always hear item names can change their settings in the Alexa App. If an item is marked as a gift during checkout, Alexa will never reveal order details.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191217005278/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "Amazon Singapore Collaborates With Non-profit Organisation Blessings in a Bag to Deliver Smiles to Less Privileged Children",
        "subtitle": "Amazon Singapore kicks off the collaboration with a pledge of S$10,000 in sponsorship and in-kind donations to Blessings in a Bag",
        "date": "Dec 15, 2019 10:01PM EST",
        "content": "SINGAPORE, Dec. 16, 2019 /PRNewswire/ -- – (NASDAQ:AMZN) – This holiday season, Amazon Singapore collaborates with Blessings in a Bag (BIAB), a volunteer-driven non-profit organisation that focuses on bridging the gap between communities that have and those that don't, to deliver smiles to children and youth in need. Amazon is kicking off the collaboration with a pledge of S$10,000 in sponsorship and in-kind donations to Blessings in a Bag, and invites members of the public to donate to the non-profit as well by purchasing items that BIAB needs through their wishlist on Amazon.sg. Less privileged children aged between 6 and 16 years old supported by BIAB will benefit directly from receiving items ranging from books, bags, stationery, musical instruments and food available on Amazon.sg.According to Forbes Nonprofit Council, convincing donors to give regularly can be difficult and some of the major barriers keeping donors from giving is the lack of clarity about what a non-profit organisation needs and complicated user experience for a donor to donate. The wishlist feature available on Amazon.sg is designed to make it easy for people to donate to BIAB by specifying what items and quantity are needed, the non-profit's delivery address for the purchase, and conveniently delivers the donations in a fuss-free, transparent manner. With free domestic delivery this holiday season for eligible items on Amazon.sg, making a meaningful donation is easier than ever. Interested donors can get a better understanding of the essential items required and purchase these items for Blessings in a Bag by visiting this page: https://www.amazon.sg/b?node=7961344051\"This holiday season, we are pleased to collaborate with Blessings in a Bag on the wishlist initiative to support less privileged children in a simple and straightforward manner,\" said Henry Low, Country Manager, Amazon Singapore. \"We invite the public to join us in delivering smiles to the children in this season of giving, and all non-profit and charity organisations to try out Amazon.sg's wishlist feature for in-kind donations.\" \"We're grateful to have Amazon Singapore's support during the year-end festive period. As a non-profit with limited resources, the wishlist functionality on Amazon greatly reduces the amount of time it would have taken for us to work out the logistics of getting the items we need. In addition, the donated items will be delivered directly to Blessings in a Bag, so donors need not worry about working out the delivery logistics themselves,\" said Emily Teng, Founder, Blessings in a Bag. \"Aside from the essential items such as toothbrushes and food, many of our requested items consist of books and Amazon, being known for its wide selection of books, is the perfect partner for what we need.\"In addition to the wishlist and sponsorship, Amazon Singapore employees will be participating in Blessings in a Bag's Community Walk, preparing food and supplies hampers to be distributed to the families of children who are part of the BIAB program this holiday season. The Blessings in a Bag wishlist campaign is live now until December 31, 2019. For those interested in creating a wish list, please visit:https://www.amazon.sg/gp/help/customer/display.html/ref=hp_left_v4_sib?ie=UTF8&nodeId=201936670 About Blessings in a BagBlessings in a Bag is an award-winning, globally-recognised community organisation powered by youth for youth – with a vision of a world where every young person is celebrated for who they are and who they are becoming; resilient, compassionate and loving agents of change who uplift their own communities.Through one of its signature programs, Beyond Awesome, the organisation is on a mission to journey and support under-resourced children and youth through increasing their social capital, provide access to meaningful opportunities and experiences, and surround them with an intentional circle of support through committed volunteers.Over the years, Blessings in a Bag has been the go-to-organisation for people to give in-kind, give financially and participate in acts of service to support programs, provide vital necessities to local communities within Singapore and empowering the next generation of volunteers. Amazon in the CommunityAmazon is committed to helping more children and young adults, especially those from underrepresented and underserved communities, have the resources and skills they need to build their best future. Amazon focuses on building long-term, innovative, and high impact programs that leverage Amazon's unique assets and culture. Initiatives include Amazon Future Engineer, designed to inspire and excite 10 million children and young adults from underserved and underrepresented communities each year to pursue an education in computer science, as well as programs that support immediate needs, including addressing family homelessness through donations and housing a homeless shelter in its Seattle headquarters, as well as global relief efforts for people in need following natural disasters.About AmazonAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalised recommendations, Prime, Fulfilment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit www.amazon.com/about.Photo - https://photos.prnasia.com/prnh/20191213/2670270-1 SOURCE  Amazon"
    },
    {
        "title": "Amazon Prime Members Can Shop Millions of Items with Fast and Free Delivery Until Christmas Eve",
        "subtitle": "",
        "date": "Dec 11, 2019 3:00AM EST",
        "content": "\nAmazon Offers Last-Minute Shoppers More than 10 Million Items Available for Prime Free One-Day Delivery with No Minimum Purchase \n\nPrime Members in Eligible Cities Can Shop for Items on Christmas Eve and Receive them the Same Day with Prime Free Same-Day Delivery \n\nNot a Prime Member? All Customers in the U.S. Can Shop Hundreds of Millions of Items through December 14 with Delivery in Time for Christmas\n    SEATTLE--(BUSINESS WIRE)--\nAs Amazon (NASDAQ: AMZN) continues to grow its logistics network, which is powered by innovative technology and incredible employees, the company is enabling ultrafast delivery to the most convenient locations. Today, Amazon announced that Prime members in eligible areas can shop a selection of millions of products right up until Christmas Eve and receive them that day with Prime Free Same-Day Delivery and free two-hour delivery with Amazon Fresh and Whole Foods Market. Members can also enjoy the convenience of Free One-Day Delivery on more than 10 million items — the largest next-day selection in the U.S. — including toys and electronics, home, fashion, and everything needed to wrap up the holidays. For more information on free holiday shipping, visit amazon.com/holidaydelivery.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191211005242/en/Get items before December 25 (Graphic: Business Wire)\n“We want customers to experience the magic of the holidays with family and friends knowing Amazon has them covered with fast, free, and reliable shipping on millions of items – from best-selling gifts and holiday décor, to the icing for their gingerbread cookies,” said Maria Renz, Vice President, Global Delivery Experience at Amazon. “Whether you’re a planner or a procrastinator, this season Prime members have more delivery options than ever before and we thank our team of customer-obsessed associates and drivers who are delivering smiles throughout the holidays.”\n\nHOLIDAY CHEAT SHEET: For free delivery before Christmas, the following dates apply*\n\n*Not all delivery speeds are available for all products in all regions, and order minimums and cutoff times may apply. Most items ordered during the holiday season can be returned until Jan. 31, 2020.\n\nGroceries and more delivered on Christmas Eve. Prime members get free and fast delivery on groceries and more from Amazon Fresh and Whole Foods Market. Selection includes a wide range of grocery products including everything members need for their holiday meals, and much more. In addition to a complete selection of groceries, Prime members in select cities can shop Amazon Fresh for tens of thousands of items across dozens of categories, including Amazon devices, toys, gifts, wrapping supplies, and more. Plus, Prime members can find the same deals that are available on Amazon.com and receive free two-hour delivery in select cities.\n\nDon’t Spoil the Surprise. Customers who want to save the surprise from snooping family members and roommates can choose to have their holiday orders securely delivered to a self-service Amazon Locker in 900+ cities and towns across the U.S., including Whole Foods Market locations, at no additional cost. New this holiday season, customers also have the option to pick up their Amazon packages in-store at one of thousands of Amazon Counter partner locations across the U.S., including staffed pickup areas within Rite Aid, GNC, and Stage stores, as well as at Health Mart independent pharmacies. To find an Amazon Hub pickup point in their area, customers can visit amazon.com/hub. Prime members in 50 U.S. cities and surrounding areas can also enjoy secure, convenient package delivery with Key by Amazon (amazon.com/key). Members can choose to have packages delivered inside their home, car, or garage to keep them away from the elements or hidden from snooping family members.\n\nMORE WAYS TO SHOP\n\nSave Santa a Trip. With more than 30 Amazon 4-star and Amazon Books store locations across 12 states in the U.S., customers can shop for highly rated gifts, devices, and smart home accessories in-store this holiday season. Amazon 4-star carries highly rated products from top categories like kitchen, home, toys, books, games, devices, and consumer electronics. Shop in-store deals and features, including “This Season’s Top Toys,” “Most-Wished-For on Amazon.com,” and “Stocking Stuffers” and find selection from Amazon.com’s Holiday Toys List, Amazon Home Holiday Guide and more. At Amazon Books, discover books, test-drive devices, and shop other customer favorites, including “Most-Wished For Books on Amazon.com,” “Gifts for the Book Lover,” and selections from the Holiday Toys List. Visit amazon.com/stores to find a location nearest you.\n\n‘Tis the Season. Give the gift of Prime! The gift of Prime guarantees your loved ones can experience the best of shopping and entertainment from Amazon, plus access to fast, free shipping. Visit amazon.com/giftprime to purchase three months ($39) or one year ($119) this holiday. According to Amazon’s recently published Best of Prime 2019 report, delivery got faster with Prime members in the U.S. receiving three times more items from Amazon’s online store in one day or faster compared to the previous year. To view the full report, including what Prime members shopped for, watched, listened to, and read, visit amazon.com/bestofprime.\n\nAmazon Gift Cards. According to a National Retail Federation study, gift cards remain the most popular items on shoppers’ wish lists for the thirteenth consecutive year. Amazon Gift Cards are redeemable for millions of items storewide and never expire. Customers can visit amazon.com/giftcards and audible.com/giftcenter for a wide variety of delightful designs including boxes, tins, and greeting cards with free one-day delivery (where available). Need it right now? Choose from options you can print at home, send by email, or even text. First time gift card customers can earn a one-time $15 Amazon Credit with a purchase of $50 or more in Amazon Gift cards. Customers who reload their Amazon Gift Card balance with $100 or more will enjoy a $10 bonus. Applicable on first reload only.\n\nReward Yourself. Until December 22, customers who are approved for the Amazon Prime Rewards Visa Signature Card will earn a $100 instant Amazon Gift Card, and customers approved for the Amazon Rewards Visa Signature Card will earn a $60 instant Amazon Gift Card.\n\nReturns Made Easy. Customers can buy gifts with confidence on Amazon, knowing that millions of items are eligible for free returns at over 18,000 locations in the U.S. and the return window has been extended until January 31 for items purchased between November 1 and December 31. In addition, over 5,800 locations – including Amazon Books, Amazon 4-star, and select Whole Foods Market locations – offer Label Free, Box Free returns, making it easier than ever to check returns off your list.\n\nAny customer can try Prime for free to experience the best of shopping and entertainment during the holidays by visiting amazon.com/prime.\n\nEvery Day Made Better with Prime\n\nPrime was designed to make your life better every single day. Over 100 million paid members around the world enjoy the many benefits of Prime, including the best of shopping and entertainment. In the U.S. that includes unlimited access to award-winning movies and TV episodes with Prime Video, ad-free listening of two million songs plus thousands of stations and playlists with Amazon Music, unlimited access to more than 1,000 books and magazines with Prime Reading, free games with Twitch Prime, Prime Day, and more. Prime members can also get deep discounts on select popular products at Whole Foods Market plus an additional 10 percent off hundreds of sale items. Prime was built on the foundation of unlimited fast, free shipping. In addition to more than 10 million items available for free one-day delivery coast to coast, Prime members in thousands of cities and towns across 46 major metropolitan areas have access to millions of items with free same-day delivery. Prime members also have access to free and fast grocery delivery from Amazon Fresh and Whole Foods Market in more than 2,000 cities and towns. Prime is $119 a year or $12.99 a month and customers can start a free trial of Amazon Prime at amazon.com/prime. College students can join Prime Student for 50% off and enjoy the benefits of Prime with a six-month free trial at amazon.com/primestudent. Plus, for an additional $0.99 a month, student members can get Amazon Music Unlimited and stream over 50 million songs ad-free. Customers receiving government assistance through EBT or Medicaid can also qualify for a discounted Prime membership of $5.99 a month at amazon.com/qualify. Amazon Business customers—from small businesses to large enterprises, as well as education, government and non-profit organizations—can also take advantage of Prime’s fast, free shipping and exclusive business-relevant benefits with Business Prime, which starts at $179 per year for up to three users at amazon.com/businessprime.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005242/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    },
    {
        "title": "\"Alexa, Order Avocados.\" Best of Prime 2019 Reveals Members Went Wild for Avocados, Amazon Devices and Other Favorites",
        "subtitle": "",
        "date": "Dec 5, 2019 3:01AM EST",
        "content": "\nPrime welcomed more members worldwide this year than any year before\n\nPrime members in the U.S. had three times as many items from Amazon’s online store delivered in one day or faster compared to the previous year\n\nSome of the most popular series on Prime Video were The Boys, Carnival Row and The Marvelous Mrs. Maisel, and the most streamed artist on Amazon Music was Taylor Swift\n    SEATTLE--(BUSINESS WIRE)--\n(NASDAQ: AMZN) What a year for Prime members! Today, Amazon is celebrating the Best of Prime 2019, revealing how Prime members chose to enjoy the best of shopping and entertainment from Amazon this past year. Some Prime member favorites in the U.S. include: Echo Dot, Fire TV Stick with Alexa Voice Remote, avocados, Tom Clancy’s Jack Ryan and the novel “The Handmaid’s Tale.” Find Amazon’s Best of Prime 2019 at amazon.com/bestofprime.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191205005287/en/Best of Prime (Graphic: Business Wire)\n“Best of Prime celebrates what members loved most this year and how Prime made their lives a little simpler, more convenient and more fun,” said Jamil Ghani, Vice President, Amazon Prime. “From breakout shows like The Boys on Prime Video, to a wide selection of hit songs on Amazon Music, to Prime Free One-Day Delivery on more than 10 million products coast-to-coast, to free and fast grocery delivery, being a Prime member just keeps getting better. Drawing on what members loved most in 2019, we will continue to invest and innovate to bring even more convenience, selection and entertainment to Prime in 2020.”\n\nBest of Shopping \n\nPrime members in the U.S. saved time and money this year with speedy delivery and exclusive deals:\n\nBest of Entertainment \n\nMembers worldwide enjoyed more moments than ever before with their video, music, reading and gaming benefits. Here’s a look at the entertainment they loved most:\n\nPrime Video \n\nMembers in the U.S. kept up with the hottest Amazon Originals:\n\nAmazon Music \n\nAmazon Music listeners in the U.S. streamed the hottest new releases over the last year:\n\nTwitch Prime\n\nMembers around the world upped their game with Twitch Prime this past year:\n\nPrime Reading\n\nMembers in the U.S. embraced their inner bookworm with Prime Reading:\n\nEvery Day Made Better with Prime \n\nPrime was designed to deliver joy every single day. Over 100 million paid members around the world enjoy the many benefits of Prime, including the best of shopping and entertainment. In the U.S. that includes unlimited access to award-winning movies and TV episodes with Prime Video, ad-free listening of 2 million songs plus thousands of stations and playlists with Amazon Music, unlimited access to more than 1,000 books and magazines with Prime Reading, free games and in-game loot with Twitch Prime, exclusive deals on Prime Day, and more. Prime members can also get deep discounts on select popular products at Whole Foods Market plus an additional 10 percent off hundreds of sale items. Prime was built on the foundation of unlimited fast, free shipping. In addition to more than 10 million items available for free one-day delivery coast to coast, Prime members in thousands of cities and towns across 46 major metropolitan areas have access to millions of items with free same-day delivery. Prime members also have access to free and fast grocery delivery from Amazon Fresh and Whole Foods Market in more than 2,000 cities and towns. Prime is $119 a year or $12.99 a month and customers can start a free trial of Amazon Prime at amazon.com/prime. College students can join Prime Student for 50% off and enjoy the benefits of Prime with a six-month free trial at amazon.com/primestudent. Plus, for an additional $0.99 a month, student members can get Amazon Music Unlimited and stream over 50 million songs ad-free. Customers receiving government assistance through EBT or Medicaid can also qualify for a discounted Prime membership of $5.99 a month at amazon.com/qualify. Amazon Business customers—from small businesses to large enterprises, as well as education, government and non-profit organizations—can also take advantage of Prime’s fast, free shipping and exclusive business-relevant benefits with Business Prime, which starts at $179 per year for up to three users at amazon.com/businessprime.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\n\nMethodology\n\nThe Best of Prime 2019 analyzed how Prime members in the U.S. enjoyed their Prime benefits from October 1, 2018, through September 30, 2019, unless otherwise noted. Amazon Music data was analyzed from November 1, 2018, through November 1, 2019, and includes all Amazon Music listeners in the U.S., not limited to Prime members. Data for Tom Clancy’s Jack Ryan and The Report was collected from October 31, 2019, through December 1, 2019. Information included in these results examines data at a collective level, without viewing personal information by specific Prime members.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005287/en/\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr \nSource: Amazon.com, Inc."
    },
    {
        "title": "Amazon Prime Video to Take Fans Back to the Rafters with First Amazon Original Scripted Drama in Australia",
        "subtitle": "",
        "date": "Dec 4, 2019 11:00PM EST",
        "content": "\nRevival series will bring one of Australia’s most beloved families to Prime members in Australia and Prime Video subscribers around the world in more than 200 countries and territories\n\nSeries will be first scripted drama production from Prime Video in Australia with filming scheduled to begin in 2020 with Seven Studios\n    SYDNEY--(BUSINESS WIRE)--\n(NASDAQ: AMZN) – Amazon today announced the first scripted Australian Amazon Original series, Back to the Rafters, which will launch on Prime Video in Australia and around the world in more than 200 countries and territories.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191204006000/en/Back to the Rafters will be the first scripted drama production from Amazon Prime Video in Australia with filming scheduled to begin in 2020 with Seven Studios. (Photo: Business Wire)\nBack to the Rafters offers the next chapter in the story of the Rafter family, who charmed Australian audiences for six years in one of Australia’s most popular drama series, Packed to the Rafters. At its centre were parents Dave and Julie, working to balance their own journey as a couple with the ups and downs of raising a family into adulthood. Set to begin production in Sydney in 2020, Back to the Rafters produced by Seven Studios will feature original principal cast members Rebecca Gibney (Julie Rafter), Erik Thomson (Dave Rafter), Jessica Marais (Rachel Rafter), Hugh Sheridan (Ben Rafter), Angus McLaren (Nathan Rafter), Michael Caton (Ted Taylor) and George Houvardas (Nick “Carbo” Karandonis).\n\nBack to the Rafters picks up six years since we last saw the Rafter family. Dave and Julie have created a new life in the country with youngest daughter Ruby, while the older Rafter children face new challenges and Grandpa Ted struggles to find his place. As Dave enjoys his new found freedom, Julie must reconcile her responsibilities to the family. They might not be under the same roof, but the same honesty, love and laughter bonds them more tightly now than ever before.\n\n“Since we began producing international originals, Back to the Rafters has been at the top of the list of scripted series we’ve wanted to commission,” said James Farrell, Vice President of International Originals at Amazon Studios. “Packed to the Rafters is among the most beloved Australian series and this revival will allow us to give our customers the locally relevant entertainment they want. We’re thrilled to be working with Seven Studios to bring back the Rafter family for Prime members in Australia and around the world.”\n\n“We are hugely excited to be working with Amazon Studios on Prime Video’s first Australian drama commission, bringing back the iconic Rafters family for both Australian and global audiences,” said Therese Hegarty, CEO Seven Studios. “This is an incredible opportunity to showcase to the world a home-grown original drama series, brought to life by brilliant Australian creative talent.”\n\n“What a thrilling opportunity to be able to revisit the family at the centre of my most successful creation, six years down the track,” said Creator and Writer, Bevan Lee. “The world has changed so much in that time, and it is a writing dream to be able to explore how the Rafters have changed with it, while at the same time reconnecting with the life affirming combination of humour and heart that characterised the original series. In an increasingly dark world, it is wonderful to use the Rafters again to spread light.”\n\nCommissioned by Amazon Studios and produced by Seven Studios, Back to the Rafters lead Writer will be Creator Bevan Lee, with Julie McGauran as Executive Producer and Chris Martin-Jones as Series Producer. Production is scheduled to begin next year in Sydney.\n\nBack to the Rafters is the first scripted Australian Amazon Original series that has been announced this year, along with LOL: Last One Laughing, hosted and executive produced by Rebel Wilson; The Test: A New Era for Australia’s Team, a docuseries following the Australian Men’s Cricket team during the 2018/2019 season; and a series of ten Amazon Original stand-up specials featuring ten all-star Australian comedic acts including Tom Gleeson, Tommy Little, Judith Lucy and more. These, and other Amazon Original series, will be available on Prime Video in Australia and around the world in more than 200 countries and territories.\n\nAbout Prime Video\n\nPrime Video is a premium streaming service available as part of a Prime membership that offers customers a vast collection of award winning Amazon Originals, hit movies and popular TV shows, all with the ease of finding what they love to watch in one place.\n\nAbout Amazon Prime \n\nPrime members in Australia have access to free delivery on millions of local and international eligible items over $49. With Prime, nearly 90 percent of Australians have access to free delivery in as fast as two days on local Prime eligible orders. They also have access to exclusive and award-winning Amazon Original series and other popular movies and TV shows with Prime Video, more than two million songs ad-free, over 1,000 e-books with Prime Reading, benefits for gamers with Twitch Prime, and more. New customers in Australia can try Prime at amazon.com.au/prime with Amazon’s 30-day free trial, and then join Prime for AU$6.99 a month, or save 30 percent with an annual Prime membership at AU$59.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204006000/en/\nAmazon Prime Video Contact:\nZach Goldsztejn\nzachgold@amazon.com \n\nSeven Studios Contact:\nJack McLintock\njmclintock@seven.com.au\nSource: Amazon.com, Inc."
    },
    {
        "title": "Zákazníci firmy Amazon letos před svátky opět rekordně nakupují, Cyber Monday 2019 se stalo dnem největších objemů nákupů v historii firmy",
        "subtitle": "",
        "date": "Dec 4, 2019 7:36PM EST",
        "content": "    SEATTLE--(BUSINESS WIRE)--\n(NASDAQ:AMZN) - Společnost Amazon dnes oznámila, že Cyber Monday pondělí se stalo opět dnem největších prodejů v historii firmy, podle celosvětového počtu objednávek. Zákazníci z celého světa nakoupili rekordní množství různých produktů, přičemž jen mezi Dnem díkůvzdání a Cyber Monday uzavřeli stovky miliónů objednávek.\n\nVe srovnání se stejným obdobím minulého roku letos zákazníci v obchodech Amazon na celém světě nakoupili o milióny zařízení Amazon více, přičemž nejprodávanějšími produkty byly hlasový asistent Echo Dot, streamovací zařízení Fire TV Stick 4K s hlasovým ovládáním Alexa Voice Remote.\n\n\"Snažili jsme se našim zákazníkům letošní sváteční období maximálně zpříjemnit, hlavně vzhledem k tomu, jak krátká letošní nákupní sezóna je,\" řekl Jeff Wilke, generální ředitel firmy Amazon pro péči o zákazníky.\n\n\"Velice nás těší, že zákazníci i nadále obchody Amazonu navštěvují v hojném počtu a nakupují zde věci pro své blízké. Děkujeme našim zákazníkům i zaměstnancům po celém světě za to, že letošní sváteční nákupní víkend byl opět nejlepší v historii firmy.\"\n\nNejdůležitější události svátečního víkendu:\n\nRekordní víkend pro elektronické přístroje\n\nSváteční nákupy snadno a rychle s doručením zdarma\n\nSOCIÁLNÍ SÍTĚ:\n\nFacebook: @Amazon\nInstagram: @Amazon\nTwitter: @Amazon\nWebová stránka: amazon.com/cybermonday\n\nO společnosti Amazon\n\nAmazon se řídí čtyřmi principy: posedlost zákazníkem namísto zaměření na konkurenty, vášeň pro vynalézavost, závazek k provozní dokonalosti a dlouhodobé myšlení. Hodnocení zákazníků, nakupování na jedno kliknutí, osobní doporučení, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, tablety Fire, Fire TV, Amazon Echo a Alexa, to jsou některé z produktů a služeb propagovaných společností Amazon. Další informace najdete na adrese amazon.com/about, a sledujte @AmazonNews.\n\nProhlédněte si zdrojovou verzi této tiskové zprávy na webových stránkách businesswire.com: https://www.businesswire.com/news/home/20191203005397/en/\nZdrojovou verzi najdete na businesswire.com: https://www.businesswire.com/news/home/20191204005972/cs/Source: Amazon.com, Inc."
    },
    {
        "title": "AWS Announces New Analytics Capabilities to Help Customers Embrace Data at Scale",
        "subtitle": "",
        "date": "Dec 3, 2019 2:16PM EST",
        "content": "\nAmazon Redshift RA3 instances let customers scale compute and storage separately and deliver 3x better performance than other cloud data warehouse providers (available today)\n\nAQUA (Advanced Query Accelerator) for Amazon Redshift provides a new innovative hardware accelerated cache that delivers up to 10x better query performance than other cloud data warehouse providers (available mid-2020)\n\nAmazon Redshift Data Lake Export allows customers to export data directly from Amazon Redshift to Amazon S3 in an open data format (Apache Parquet) optimized for analytics (available today)\n\nAmazon Redshift Federated Query lets customers analyze data across their Amazon Redshift data warehouse, Amazon Simple Storage Service (S3) data lake, and Amazon RDS and Aurora (PostgreSQL) databases (available in preview)\n\nUltraWarm offers a new warm storage tier for Amazon Elasticsearch Service at up to one-tenth the current cost that makes it easier for customers to retain any amount of current and historical log data (available in preview)\n    SEATTLE--(BUSINESS WIRE)--\nToday at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com company (NASDAQ:AMZN), announced significant new analytics capabilities that help customers embrace data at today and tomorrow’s scale. AWS introduced several new Redshift capabilities that bring more than an order of magnitude better query performance and deliver greater flexibility for customers when they are working across their data storage, data warehouse, and operational databases at scale. AWS also announced a new innovative highly-scalable, cost-saving warm storage tier for Amazon Elasticsearch Service.\n\nCustomers today are regularly trying to operate on petabytes and even exabytes of data. This new scale of data, along with new application requirements, mean that analytics tools will have to change significantly to scale effectively. Customers want to be able to perform analytics across all of their data, regardless of the format or where the data lives, and scale their applications to support millions of users anywhere in the world. AWS provides the broadest and deepest set of analytics services of any cloud provider, and is constantly innovating based on customer needs for this new scale of data.\n\nAmazon Redshift RA3 instances with Managed Storage allow customers to cost-effectively scale and run 3x faster than any other cloud data warehouse\n\nAs the scale of data continues to get much bigger-- reaching petabytes per week-- customers are ingesting even more data into their Amazon Redshift data warehouse. To scale their data warehouse, customers use Redshift’s Elastic resize capability to add additional instances to their cluster. Today, Redshift’s instances include a fixed amount of compute and storage, so it’s possible for customers to end up over-provisioned on either, and paying for capacity they don’t use. Customers have asked for the ability to grow their storage without over-provisioning compute, and for more flexibility to grow their compute capacity without increasing their storage costs.\n\nNew Amazon Redshift RA3 instances with Managed Storage (available today) allow customers to optimize their data warehouse by scaling and paying for compute and storage independently. With Amazon Redshift RA3 instances, customers choose the number of instances they need based on their data warehousing workload’s performance requirements, and only pay for the managed storage that they use. Redshift Managed Storage uses large, high-performance SSDs in each Amazon Redshift RA3 instance for fast local storage and Amazon S3 for longer-term durable storage. If the data in an instance grows beyond the size of the large local storage, Redshift Managed Storage automatically offloads that data to Amazon S3. Customers pay the same low rate for Redshift Managed Storage regardless of whether the data sits in high-performance local storage or in Amazon S3, and they only pay for the amount of storage they use on a local RA3 storage, meaning they don’t end up wasting spend on unused storage capacity. For workloads that require a lot of storage, but not as much compute capacity, customers can automatically scale their data warehouse storage capacity without adding and paying for additional instances. Redshift Managed Storage uses a variety of advanced data management techniques to optimize how efficiently data is offloaded to and retrieved from Amazon S3. In addition, Amazon Redshift RA3 instances are built on the AWS Nitro System and feature high bandwidth networking that further reduces the time taken for data to be offloaded and retrieved from Amazon S3. Together, these capabilities enable Amazon Redshift RA3 instances with Managed Storage to deliver 3x the performance of any other cloud data warehouse service, and existing Amazon Redshift customers using Dense Storage (DS2) instances will get up to 2x better performance and 2x more storage capacity at the same cost. RA3 16xlarge instances are generally available today to support workloads with petabytes of data (up to 8 PB compressed), with RA3 4xlarge instances coming early next year. To get started with Redshift RA3 instances, visit https://aws.amazon.com/redshift.\n\nAQUA (Advanced Query Accelerator) for Amazon Redshift brings compute to the storage layer for 10x faster performance than any other cloud data warehouse\n\nRapid growth in the volume of data that customers need to process in their data warehouse has led to a difficult balancing act between performance and cost-effective scaling. The prevailing approach to data warehousing has been to build out an architecture in which large amounts of centralized storage is moved to waiting compute nodes to process the data. The challenge with this approach is that there is a lot of data movement between the shared data and compute nodes. As data volumes continue to grow at a rapid clip, this data movement saturates available networking bandwidth and slows down performance. Additionally, even if the networking bottleneck can be overcome, because SSD storage throughput to and from storage nodes has scaled 6x faster over the last seven years than the ability for CPUs to process data from memory, absent some significant change, CPUs aren't able to keep up with the faster storage capabilities, which will either become a performance bottleneck itself or create more cost as customers are forced to provision more compute to get the work done quickly.\n\nAQUA (Advanced Query Accelerator) for Amazon Redshift (available mid-2020) is a new distributed and hardware-accelerated cache for Amazon Redshift that provides the next phase of performance improvement and innovation for analytics at the new scale of data. AQUA brings compute to the storage layer, so data doesn’t have to move back and forth between the two, enabling Redshift to run 10x faster than any other cloud data warehouse. AQUA is a big, high-speed cache architecture on top of Amazon S3 that can scale out and process data in parallel across many nodes. Each node possesses a hardware module comprised of AWS designed analytics processors that dramatically accelerate data compression, encryption, and data processing (including filtering and aggregation). This new architecture makes queries run so much faster than today’s cloud data warehouses that customers will be able to query raw data directly, even at scale, giving them more up-to-date dashboards, less development time, and easier to maintain systems. AQUA-powered Amazon Redshift will remain 100% compatible with the current version of Amazon Redshift, so customers can easily migrate existing data warehouses with no code changes. AQUA provides the next phase of performance innovation for analytics at the new scale of data, and will be available in mid-2020. To learn more about AQUA, visit https://pages.awscloud.com/AQUA_Preview.html.\n\nAmazon Redshift Data Lake Export makes it easy to save query results directly to a data lake\n\nCustomers require data to be combined across their data warehouse and data lake, and don’t want data locked in silos and proprietary formats. For example, an organization may want to understand what their customer was browsing before they made a purchase, which requires them to combine the order history sitting in the data warehouse with the clickstream data sitting in an Amazon S3 data lake. Amazon Redshift enables customers to directly query and join data across both their Amazon Redshift data warehouse and Amazon S3 data lake, giving customers a ‘lake house’ approach to data warehousing. In this lake house world, where data is stored both in Amazon Redshift and Amazon S3, customers also need an easy way to get the results from Amazon Redshift queries back into Amazon S3 in an open format that can be used by other services.\n\nAmazon Redshift Data Lake Export (available today) allows customers to export data directly from Amazon Redshift to Amazon S3 in an open data format (Apache Parquet) that is optimized for analytics. Customers can now save the results of a query they have done in Amazon Redshift into their data lakes in open formats so that they can analyze that data with other analytics services like Amazon SageMaker, Amazon Athena, and Amazon EMR. No other cloud data warehouse makes it as easy to both query data and write data back to a data lake in open formats. To get started with Amazon Redshift Data Lake Export, visit https://aws.amazon.com/redshift.\n\nAmazon Redshift Federated Query allows customers to analyze data across data warehouses, data lakes, and operational databases\n\nAggregating, transforming, and uploading large amounts of data from a relational database to a data warehouse can be resource-intensive and time-consuming, which is why many customers choose to do so only once a day. This can create problems when customers need to query their data warehouse for certain types of timely information that is initially stored in an operational database. For example, a customer service representative helping a customer resolve an issue with a recent order might be served day-old results when they pull up the customer’s purchase history, making the information irrelevant. Customers can work around this problem today by writing custom application code to query the operational database directly, but building integrated systems that do this is expensive, time consuming, and difficult to maintain.\n\nAmazon Redshift Federated Query (available in preview) gives customers the ability to run queries in Amazon Redshift on live data across their Amazon Redshift data warehouse, their Amazon S3 data lake, and their Amazon RDS and Amazon Aurora (PostgreSQL) operational databases. This simplifies application development by allowing customers to use familiar SQL statements to combine all of this data across their various data stores. With this capability, Amazon Redshift queries can now provide timely and up-to-date data from operational databases to drive better insights and decisions. To get the best possible performance, the Redshift query optimizer intelligently distributes as much work as possible to the underlying databases. To learn more about Amazon Redshift Federated Query, visit https://aws.amazon.com/redshift.\n\nUltraWarm for Amazon Elasticsearch Service provides fast, interactive analytics on log data at one-tenth the cost \n\nAs more and more applications are built using microservices, containers, and purpose-built data stores, they produce an ever-increasing amount of log data. Amazon Elasticsearch Service makes it simple to collect, analyze, and visualize machine-generated log data from websites, mobile devices, and sensors. Amazon Elasticsearch Service is fully managed, so customers can deploy production-ready clusters in minutes, scale clusters up and down, and secure data at rest and in transit. However, given the explosive growth of log data, storing and analyzing months’ or years’ worth of data is cost-prohibitive at scale. This has led customers to use multiple analytics tools, or delete valuable data, missing out on important insights that the longer-term data could yield.\n\nTo solve for this customer challenge, AWS built a new storage tier for Amazon Elasticsearch Service called UltraWarm, which finally gives Elasticsearch customers a warm storage tier that both stores large amounts of data cost-effectively and provides the type of snappy, interactive experience that Elasticsearch customers expect. UltraWarm offers a distributed cache for more frequently accessed data, while using advanced placement techniques to determine which blocks of data are less frequently accessed and should be moved outside of the cache to Amazon S3. UltraWarm also uses high-performance EC2 instances to interact with data stored in S3, providing 50% faster query execution versus competing warm-tier solutions, and giving customers the same interactive analytics experience with all their log data. UltraWarm reduces costs by up to 90% to store the same amount of data in Elasticsearch today, and is 80% lower than the cost of warm-tier storage from other managed Elasticsearch offerings. With UltraWarm, customers can manage up to 3 PB of log data with a single Amazon Elasticsearch Service cluster; and with the ability to query across multiple clusters, customers can effectively retain any amount of current and historical log data for interactive operational analysis and visualization. UltraWarm is a seamless extension of the Amazon Elasticsearch Service. Customers can easily query and visualize across both their recent and longer-term operational data, all from their Kibana interface, at a fraction of the cost today. This allows developers, DevOps engineers, and InfoSec experts to use Amazon Elasticsearch Service for the analysis of recent (weeks) and longer-term (months or years) operational data without needing to spend days restoring data from archives (Amazon S3 or Amazon Glacier) to an active searchable state in an Elasticsearch cluster. UltraWarm Service is available in preview today. To learn more about UltraWarm, visit https://aws.amazon.com/elasticsearch-service/features. \n\n“Our customers tell us they are regularly dealing with petabytes, and even exabytes of data, and their existing analytics systems can’t keep up,” said Raju Gulabani, Vice President, Database Services, AWS. “These customers want to perform fast analytics on all of their raw data across their data warehouse and data lake, and cost effectively deal with the explosion in log data to retain information that might help them run their businesses better. With today’s announcements we are helping AWS customers do all of this and fearlessly embrace data at scale.”\n\nDuolingo is the most popular language-learning platform and the most downloaded education app in the world, with more than 300 million users. The company's mission is to make education free, fun, and accessible to all. “We use Amazon Redshift to analyze the events from our app to gain insight into how users learn with Duolingo. We load billions of events each day into Amazon Redshift, have hundreds of terabytes of data, and that is expected to double every year. While we store and process all of our data, most of the analysis only uses a subset of that data,” said Jonathan Burket, Senior Software Engineer, Duolingo. “The new Redshift RA3 instances with Managed Storage deliver 2x performance for most of our queries compared to our previous DS2 instances-based Redshift cluster. Redshift Managed Storage automatically adapts to our usage patterns. This means we don't need to manually maintain hot and cold data tiers, and we can keep our costs flat when we process more data.”\n\nYelp’s mission is to connect people with great local businesses; to do so, data mining and efficient data analysis is important in order to build the best user experience. “We continue to adopt new Redshift features and are thrilled with the new RA3 instance type,” said Stephen Moy, Software Engineer, Yelp. “We have observed a 1.9x performance improvement over DS2 and 1.5x performance improvement over DC2 in our workload, while keeping the same costs and providing scalable managed storage. This allows us to keep pace with explosive data growth and have the necessary fuel to train our machine learning systems.”\n\nWestern Digital (WD) is a leading global data storage brand that empowers users to create, experience, and preserve digital content across a range of devices. WD enables users to be in control and smartly save what matters to them most in one secure place. “At WD we use Amazon Redshift to enable the enterprise to gain value and insights from large, complex, and dispersed datasets,” said Fayaz Syed, Sr. Manager, Big Data Platform, Western Digital. “Our data is nearly doubling every year and we run six Redshift clusters with a total of 78 nodes and 631+ TB of compressed data stored to get insights that our business analysts and leadership depend on. The new Redshift RA3 instances offer us the ability to process our growing data more cost-effectively while we double our storage capacity compared to our previous Redshift cluster. We also like that our ETL, BI, and data ingestion process did not have to change to take advantage of the RA3 instances with Managed Storage.”\n\nNTT DOCOMO is the largest mobile service provider in Japan, serving more than 79 million customers. “Migrating to Amazon Redshift in 2014 allowed us to scale to over ten petabytes of uncompressed data with a 10x performance improvement over our prior on-premises system. Today, it is the center of our analytics environment,” said Takaaki Sato, General Manager of Service Innovation Department, NTT DOCOMO. “Since we started using Amazon Redshift, both our data and number of users have increased dramatically. We are impressed with the flexibility and ease of use, even as we scale users and data. The new Amazon Redshift Data Lake Export feature allows us to simplify our workflows to make use of more data across our data lake. We are excited about the new Amazon Redshift RA3 instances with Managed Storage, enabling us to scale compute and storage separately. We also look forward to realizing the benefits of AQUA (Advanced Query Accelerator) for Amazon Redshift as we continue to increase the performance and scale of our Amazon Redshift data warehouse. We appreciate AWS’s continual innovation on behalf of its customers.”\n\nIntuit, makers of TurboTax, QuickBooks and Mint, is a global financial platform company designed to empower consumers, self-employed, and small businesses to improve their financial lives. “We are looking forward to exploring how AQUA can empower our team to spend more time innovating on behalf of customers,” said Alex Balazs, Chief Architect, Intuit. “These new capabilities complement our strategy to create more data-driven insights at scale with speed and efficiency across our platform.”\n\nWarner Bros. Interactive Entertainment is a premier worldwide publisher, developer, licensor, and distributor of entertainment content for the interactive space across all platforms, including console, handheld, mobile, and PC-based gaming for both internal and third-party game titles. “We utilize many AWS and third party analytics tools, and we are pleased to see Amazon Redshift continue to embrace the same varied data transform patterns that we already do with our own solution,” said Kurt Larson, Technical Director of Analytics Marketing Operations, Warner Bros. Analytics. “We’ve harnessed Amazon Redshift’s ability to query open data formats across our data lake with Redshift Spectrum since 2017, and now with the new Redshift Data Lake Export feature, we can conveniently write data back to our data lake. This all happens with consistently fast performance, even at our highest query loads. We look forward to leveraging the synergy of an integrated big data stack to drive more data sharing across Amazon Redshift clusters, and derive more value at a lower cost for all our games.”\n\nFOX Corporation produces and distributes content through some of the world’s leading and most valued brands, including: FOX News, FOX Sports, the FOX Network, and the FOX Television Stations. FOX empowers a diverse range of story creators to imagine and develop culturally significant content, while building an organization that thrives on creative ideas, operational expertise, and strategic thinking. “Amazon Redshift allows us to ingest, optimize, transform, and aggregate billions of transactional events per day at scale, coming to us from a variety of first and third party sources,” said Alex Tverdohleb, Vice President Data Services, Consumer Products & Engineering, FOX Corporation. “We query live data across our data warehouse and data lake, and now with the new Amazon Redshift Federated Query feature we can easily query and analyze live data across our relational databases as well. Our petabyte scale data is rapidly growing, and with the innovation in Amazon Redshift RA3 instances and AQUA (Advanced Query Accelerator) for Amazon Redshift we’re thrilled about the prospect of getting 10x faster performance for our most demanding workloads, while keeping our costs flat. AQUA for Amazon Redshift is a great example of how AWS innovates across every layer of the stack to deliver the best solution for their customers.”\n\nSophos is a worldwide leader in next-generation cybersecurity. “Amazon Web Services, including Amazon Redshift, give us the power to make live data generated by our range of next-gen security solutions available to more than 409,000 organizations for analysis,” said John Peterson, Vice President, Central Content Group, Sophos. “The new Federated Query feature in Amazon Redshift could help us take this to the next level, allowing us to query data directly across our Aurora and RDS PostgreSQL databases without having to setup workflows for data movement. We’re excited to see how this could speed up our time to insight and help to make it easier to incorporate the most up to date data from a number of transactional databases with the data in our data warehouse and our data lake.”\n\nAncestry is the global leader in family history and consumer genomics, empowering journeys of personal discovery to enrich lives. “With Amazon Elasticsearch Service we collect and analyze our company’s operational logs in real time,” says Clint Smith, Senior Manager, Engineering Development, Ancestry. “Now UltraWarm for Amazon Elasticsearch Service will help us identify correlations between logging events and quickly root cause application problems. Before UltraWarm for Amazon Elasticsearch Service, our cost constraints meant we could only store five days of data. With UltraWarm for Amazon Elasticsearch Service we will be able to extend that window to 90 days, and analyze the data via Kibana at a significantly lower cost. This extra data will help us identify application problems that we just couldn’t see with the five days of data we were storing before.”\n\nAbout Amazon Web Services\n\nFor 13 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud platform. AWS offers over 165 fully featured services for compute, storage, databases, networking, analytics, robotics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 69 Availability Zones (AZs) within 22 geographic regions, with announced plans for 13 more Availability Zones and four more AWS Regions in Indonesia, Italy, South Africa, and Spain. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191203005923/en/\nAmazon.com, Inc.\n\nMedia Hotline\n\nAmazon-pr@amazon.com \n\nwww.amazon.com/pr\nSource: Amazon.com, Inc."
    }
]