[
    {
        "title": "Ansys and Photonic Simulation Leader Lumerical Sign Definitive Acquisition Agreement",
        "subtitle": "",
        "date": "Mar 5, 2020 9:28AM EST",
        "content": "PITTSBURGH, March 5, 2020  /PRNewswire/ -- Ansys (NASDAQ: ANSS), the global leader and innovator of engineering simulation software, announced today that it has entered into a definitive agreement to acquire Lumerical Inc., a leading developer of photonic design and simulation tools. The acquisition will add best-in-class photonics products to the Ansys multiphysics portfolio, providing customers with a full set of solutions to solve their next-generation product challenges.\n                        \n                    \n                Emerging technologies such as 5G and industrial internet of things (IIoT) applications as well as autonomous vehicles are challenging companies to deal with massive volumes of data faster than ever. Traditional means of transmitting that data are being replaced by higher-efficiency optical networks. Lumerical's photonic simulation products enable designers to model the most challenging problems in photonics, including interacting optical, electrical and thermal effects. Lumerical's solutions can improve the performance of data center architectures by removing networking bottlenecks, potentially slashing the total cost of ownership. Additionally, the acquisition of Lumerical is expected to enable Ansys customers to predict light's behavior within complex photonic structures and systems.\"Ansys provides a comprehensive solution for semiconductors and high-performance electronics,\" said Shane Emswiler, Ansys' senior vice president, physics business units. \"With the acquisition of Lumerical, we will extend Ansys' capabilities to exploit the potential of photonics to further empower our customers to develop next-generation products like autonomous vehicles and other smart-connected products.\"\"Lumerical is a perfect fit with Ansys,\" said James Pond, co-CEO and CTO of Lumerical. \"The potential of photonics in applications like 5G, IIoT and autonomous vehicles can only be realized by solving immense multiphysics device and system challenges. Together, Lumerical and Ansys are uniquely positioned to provide the necessary solutions, and customers of both companies will reap tremendous rewards from this dynamic acquisition.\"The transaction is subject to the satisfaction of customary closing conditions and is expected to close in the second quarter of 2020. It is not expected to have a material impact on Ansys' consolidated financial statements in 2020.Forward-Looking StatementsThis news release contains statements about future events and expectations, including timing of closing of the acquisition, the effect of the acquisition on our future growth and financial results and the expected value of the acquired technology to our business. These statements are \"forward-looking statements\" that involve risks and uncertainties that could cause actual results to differ materially from those projected as a result of certain risks and uncertainties, including that the closing conditions may not be satisfied when or as we expect or may be waived; the acquired technology may not provide the access to new customers and markets that we expect if those customers and markets are not receptive to the technology; we may be unable to integrate the acquired technology when or as we expect, which could adversely affect our ability to offer additional solutions; customers may not adopt solutions for product development as we expect, which would adversely affect our revenue; key Lumerical employees may not stay with Ansys, which could disrupt the Lumerical business and our ability to successfully integrate and operate the Lumerical business; and other risks and uncertainties described in Ansys's filings with U.S. Securities and Exchange Commission.  Forward-looking statements speak only as of the date they are made and Ansys assumes no obligation to update or revise these forward-looking statements. About Ansys  If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where Ansys software played a critical role in its creation. Ansys is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, Ansys is headquartered south of Pittsburgh, Pennsylvania, U.S.A., Visit www.ansys.com for more information.Ansys and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries. All other brand, product, service and feature names or trademarks are the property of their respective owners.ANSS-F View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-and-photonic-simulation-leader-lumerical-sign-definitive-acquisition-agreement-301016945.htmlSOURCE  Ansys"
    },
    {
        "title": "Ansys Named A 2020 Women on Boards Winning Company",
        "subtitle": "",
        "date": "Mar 4, 2020 7:00AM EST",
        "content": "PITTSBURGH, March 4, 2020 /PRNewswire/ -- Ansys (NASDAQ: ANSS) has been recognized by 2020 Women on Boards, the premier global education and advocacy campaign committed to increasing the number of women on corporate boards, as a Winning \"W\" Company for having 20% or more board seats held by women. This is the first year Ansys has been recognized by 2020 Women on Boards for board diversity. \n                        \n                    \n                2020 Women on Boards is a non-profit grassroots campaign committed to increasing the percentage of women who serve on company boards to 20% or greater by 2020. Nearly one fourth of public companies in the U.S. have no female directors on their boards. Ansys' nine-member board includes three women.\"We are honored to receive the 2020 Women on Boards award. Diversity and inclusion are part of the core business values that have enabled us to build a winning culture,\" said Ron Hovsepian, chairman of the board at Ansys. \"Embracing diversity at all levels of the organization provides us a broader perspective of business issues, challenges and solutions. We benefit from having three talented women on our board to provide their valuable perspectives and experiences.\"\"The business world is transforming board governance, and it's critical to recognize leading companies, including Ansys, that create a competitive advantage by having business-savvy women on their boards,\" said Betsy Berkhemer-Credaire, CEO of 2020 Women on Boards. \"Even with the positive national momentum, U.S. companies are still a long way from gender balance in the boardroom but Ansys is paving the way.\" About AnsysIf you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where Ansys software played a critical role in its creation. Ansys is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, Ansys is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.Ansys and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesAbout 2020 Women on Boards (2020WOB)2020 Women on Boards (2020WOB), a 501(c)3 nonprofit, is the only global education and advocacy campaign driving the movement toward gender balance on corporate boards of directors. Founded in 2010, the campaign established its initial goal that by 2020 at least 20% of all public company board seats in the U.S. would be held by women. The target was met a year early, achieving 20.4% in 2019, and the campaign will launch a new brand and campaign mission in January 2021. Its annual research will continue to track, analyze and publish the statistics of women on the boards of Russell 3000 companies in its Gender Diversity Index report and accessible within their Gender Diversity Directory online at www.2020WOB.com. The campaign is also expanding globally to as many as 40 cities within the U.S. and abroad. Educate. Collaborate. Advocate. Celebrate!  www.2020WOB.comANSS-G  View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-named-a-2020-women-on-boards-winning-company-301015727.htmlSOURCE  Ansys"
    },
    {
        "title": "Ansys Announces Fourth Quarter and Fiscal Year 2019 Financial Results With Record Revenue, EPS, ACV and Operating Cash Flow",
        "subtitle": "",
        "date": "Feb 26, 2020 4:09PM EST",
        "content": "Company Initiates Q1 and FY 2020 OutlookKey Highlights - Q4 2019Key Highlights - FY 2019PITTSBURGH, Feb.  26, 2020  (GLOBE NEWSWIRE) -- ANSYS, Inc. (NASDAQ: ANSS), today reported fourth quarter 2019 GAAP and non-GAAP revenue growth of 17% and 18%, respectively, or 18% for each in constant currency. For FY 2019, GAAP and non-GAAP revenue growth was 17%, or 19% in constant currency. For the fourth quarter, the Company reported growth in diluted earnings per share of 7% and 5% on a GAAP and non-GAAP basis, respectively. For FY 2019, the Company reported growth in diluted earnings per share of 8% and 10% on a GAAP and non-GAAP basis, respectively.Ajei Gopal, Ansys President & CEO, stated, “Q4 was an outstanding quarter concluding a stellar 2019. We grew double digits across revenue and ACV for the quarter and the year, and I am confident we are tracking towards our 2022 objective of $2 billion in ACV. Our strong execution is a solid testament to the underlying momentum in our business and I am proud of the numerous milestones we accomplished in 2019. We extended our market and technology leadership and differentiated our multiphysics product portfolio both organically, as well as through strategic acquisitions, and expanded our partner ecosystem. Our vision of making simulation pervasive across the product lifecycle is resonating with customers and partners and we believe we are in the early innings of transformative growth and driving long-term value creation in 2020 and beyond.”Maria Shields, Ansys CFO, stated, “Q4 capped a very strong year and demonstrated the strength of our business model. We set new company records across key financial metrics including our Q4 and full year 2019 revenue, ACV, earnings and operating cash flows. We also grew our deferred revenue and backlog, setting a new year-end record at $871 million, an increase of 32% over 2018. To deliver on both our near-term and longer-term growth objectives, we continue to invest in our core products, high-growth adjacent markets and digital transformation initiatives to scale our business. Our leadership in the simulation market continues to strengthen, giving us increasing confidence in our ability to achieve our 2022 long-term targets. In December 2019, we were added to the prestigious NASDAQ-100 Index, marking another important milestone for Ansys as we look ahead into 2020 and celebrate our fifty-year heritage of technology innovation and product excellence.”Financial ResultsAnsys' fourth quarter and FY 2019 and 2018 financial results are presented below. The 2019 and 2018 non-GAAP results exclude the income statement effects of the acquisition accounting adjustments to deferred revenue, stock-based compensation, amortization of acquired intangible assets, transaction costs related to business combinations, and adjustments related to the transition tax associated with the Tax Cuts and Jobs Act.GAAP and non-GAAP results are as follows:The non-GAAP financial results highlighted above, and the non-GAAP financial outlook for 2020 discussed below, represent non-GAAP financial measures. Reconciliations of these measures to the appropriate GAAP measures, for the three and twelve months ended December 31, 2019 and 2018, and for the 2020 financial outlook, can be found in the condensed financial information included in this release.Other Financial MetricsACV is a financial performance metric that Ansys introduced in 2018. The Company believes this measure is an improved metric as compared to the historically provided bookings metric because it adjusts the sales bookings metric to reflect only the annual value of a contract and also adjusts to reflect the sales booking at the date of the contract inception or renewal. There is no GAAP measure comparable to ACV. ACV is composed of the following:Management's 2020 Financial OutlookThe Company's first quarter and fiscal year 2020 revenue and diluted earnings per share guidance is provided below. The Company is also providing its fiscal year 2020 guidance for ACV and operating cash flows. The revenue and diluted earnings per share guidance is provided on both a GAAP and non-GAAP basis. Non-GAAP financial measures exclude the income statement effects of acquisition adjustments to deferred revenue, stock-based compensation, amortization of acquired intangible assets and acquisition-related transaction costs.First Quarter 2020 GuidanceThe Company currently expects the following for the quarter ending March 31, 2020:Fiscal Year 2020 GuidanceThe Company currently expects the following for the fiscal year ending December 31, 2020:In the first quarter and fiscal year 2020 guidance reflected above, the expected impacts of non-GAAP adjustments associated with the acquisition accounting for deferred revenue are $3.9 million and $8.0 million, respectively.Conference Call InformationAnsys will hold a conference call at 8:30 a.m. Eastern Time on February 27, 2020 to discuss fourth quarter and fiscal year results. The Company will provide its prepared remarks on the Company’s investor relations homepage and as an exhibit in its Form 8-K in advance of the call to provide stockholders and analysts with additional time and detail for analyzing its results in preparation for the conference call. The prepared remarks will not be read on the call, and only brief remarks will be made prior to the Q&A session. The Company will also post a complementary investor presentation titled \"4Q 2019 Investor Presentation\" that can be accessed by clicking Events & Presentations, then Presentations at https://investors.ansys.com.To participate in the live conference call, dial 855-239-2942 (US) or 412-542-4124 (Canada & Int’l). The call will be recorded and a replay will be available within two hours after the call. The replay will be available by dialing (877) 344-7529 (US), (855) 669-9658 (Canada) or (412) 317-0088 (Int’l) and entering the passcode 10138950. The archived webcast can be accessed, along with other financial information, on Ansys' website at https://investors.ansys.com/events-and-presentations/events-calendar.(1)Effective January 1, 2019, the Company adopted the new leasing standard, which requires virtually all leases to be recorded on the balance sheet. Results for reporting periods beginning after January 1, 2019 are presented under the new guidance, while prior period amounts are not adjusted and continue to be reported in accordance with previous guidance. The adoption of the new standard resulted in the recognition of approximately $90 million of lease assets, and corresponding lease liabilities, on the Company's condensed consolidated balance sheet as of January 1, 2019.(1) Amount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.(2) Amount represents $31.4 million of stock-based compensation expense, $0.4 million of excess payroll taxes related to stock-based awards, $11.5 million of amortization expense associated with intangible assets acquired in business combinations, $0.9 million of transaction expenses related to business combinations and the $6.3 million adjustment to revenue as reflected in (1) above.(3) Amount represents the impact of the adjustments to operating income referred to in (2) above, decreased for the related income tax impact of $21.5 million and rabbi trust income of $0.1 million.(4) Amount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.(5) Amount represents $24.5 million of stock-based compensation expense, $0.5 million of excess payroll taxes related to stock-based awards, $7.0 million of amortization expense associated with intangible assets acquired in business combinations, $1.2 million of transaction expenses related to business combinations and the $2.5 million adjustment to revenue as reflected in (4) above.(6) Amount represents the impact of the adjustments to operating income referred to in (5) above, decreased for the related income tax impact of $6.9 million and increased for rabbi trust expense of $0.2 million.(1) Amount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.(2) Amount represents $116.2 million of stock-based compensation expense, $4.9 million of excess payroll taxes related to stock-based awards, $36.9 million of amortization expense associated with intangible assets acquired in business combinations, $6.6 million of transaction expenses related to business combinations and the $12.5 million adjustment to revenue as reflected in (1) above.(3) Amount represents the impact of the adjustments to operating income referred to in (2) above, decreased for the related income tax impact of $61.2 million, adjustments related to the transition tax associated with the Tax Cuts and Jobs Act of $1.8 million, and rabbi trust income of $0.4 million.(4) Amount represents the revenue not reported during the period as a result of the acquisition accounting adjustment associated with the accounting for deferred revenue in business combinations.(5) Amount represents $83.3 million of stock-based compensation expense, $4.3 million of excess payroll taxes related to stock-based awards, $40.8 million of amortization expense associated with intangible assets acquired in business combinations, $3.5 million of transaction expenses related to business combinations and the $9.4 million adjustment to revenue as reflected in (4) above.(6) Amount represents the impact of the adjustments to operating income referred to in (5) above, decreased for the related income tax impact of $47.9 million and increased for a measurement-period adjustment related to the Tax Cuts and Jobs Act of $0.9 million and rabbi trust expense of $0.1 million.Use of Non-GAAP MeasuresWe provide non-GAAP revenue, non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share as supplemental measures to GAAP regarding our operational performance. These financial measures exclude the impact of certain items and, therefore, have not been calculated in accordance with GAAP. A detailed explanation of each of the adjustments to such financial measures is described below. This press release also contains a reconciliation of each of these non-GAAP financial measures to its most comparable GAAP financial measure.We use non-GAAP financial measures (a) to evaluate our historical and prospective financial performance as well as our performance relative to our competitors, (b) to set internal sales targets and spending budgets, (c) to allocate resources, (d) to measure operational profitability and the accuracy of forecasting, (e) to assess financial discipline over operational expenditures and (f) as an important factor in determining variable compensation for management and employees. In addition, many financial analysts that follow us focus on and publish both historical results and future projections based on non-GAAP financial measures. We believe that it is in the best interest of our investors to provide this information to analysts so that they accurately report the non-GAAP financial information. Moreover, investors have historically requested, and we have historically reported, these non-GAAP financial measures as a means of providing consistent and comparable information with past reports of financial results.While we believe that these non-GAAP financial measures provide useful supplemental information to investors, there are limitations associated with the use of these non-GAAP financial measures. These non-GAAP financial measures are not prepared in accordance with GAAP, are not reported by all our competitors and may not be directly comparable to similarly titled measures of our competitors due to potential differences in the exact method of calculation. We compensate for these limitations by using these non-GAAP financial measures as supplements to GAAP financial measures and by reviewing the reconciliations of the non-GAAP financial measures to their most comparable GAAP financial measures.The adjustments to these non-GAAP financial measures, and the basis for such adjustments, are outlined below:Acquisition accounting for deferred revenue and its related tax impact. Historically, we have consummated acquisitions in order to support our strategic and other business objectives. In accordance with the fair value provisions applicable to the accounting for business combinations, acquired deferred revenue is often recorded on the opening balance sheet at an amount that is lower than the historical carrying value. Although this acquisition accounting requirement has no impact on our business or cash flow, it adversely impacts our reported GAAP revenue in the reporting periods following an acquisition. In order to provide investors with financial information that facilitates comparison of both historical and future results, we provide non-GAAP financial measures which exclude the impact of the acquisition accounting adjustment. We believe that this non-GAAP financial adjustment is useful to investors because it allows investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our past and future reports of financial results as the revenue reduction related to acquired deferred revenue will not recur when related annual lease licenses and software maintenance contracts are renewed in future periods.Amortization of intangible assets from acquisitions and its related tax impact. We incur amortization of intangible assets, included in our GAAP presentation of amortization expense, related to various acquisitions we have made. We exclude these expenses and their related tax impact for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance because these costs are fixed at the time of an acquisition, are then amortized over a period of several years after the acquisition and generally cannot be changed or influenced by us after the acquisition. Accordingly, we do not consider these expenses for purposes of evaluating our performance during the applicable time period after the acquisition, and we exclude such expenses when making decisions to allocate resources. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate the effectiveness of the methodology and information used by us in our financial and operational decision-making, and (b) compare our past reports of financial results as we have historically reported these non-GAAP financial measures.Stock-based compensation expense and its related tax impact. We incur expense related to stock-based compensation included in our GAAP presentation of cost of software licenses; cost of maintenance and service; research and development expense; and selling, general and administrative expense. This non-GAAP adjustment also includes excess payroll tax expense related to stock-based compensation. Stock-based compensation expense (benefit) incurred in connection with our deferred compensation plan held in a rabbi trust includes an offsetting benefit (charge) recorded in other income (expense). Although stock-based compensation is an expense and viewed as a form of compensation, we exclude these expenses for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance. We similarly exclude income (expense) related to assets held in a rabbi trust in connection with our deferred compensation plan. Specifically, we exclude stock-based compensation and income (expense) related to assets held in the deferred compensation plan rabbi trust during our annual budgeting process and our quarterly and annual assessments of our performance. The annual budgeting process is the primary mechanism whereby we allocate resources to various initiatives and operational requirements. Additionally, the annual review by our board of directors during which it compares our historical business model and profitability to the planned business model and profitability for the forthcoming year excludes the impact of stock-based compensation. In evaluating the performance of our senior management and department managers, charges related to stock-based compensation are excluded from expenditure and profitability results. In fact, we record stock-based compensation expense into a stand-alone cost center for which no single operational manager is responsible or accountable. In this way, we can review, on a period-to-period basis, each manager's performance and assess financial discipline over operational expenditures without the effect of stock-based compensation. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.Restructuring charges and the related tax impact. We occasionally incur expenses for restructuring our workforce included in our GAAP presentation of cost of software licenses; cost of maintenance and service; research and development expense; and selling, general and administrative expense. We exclude these expenses for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as we generally do not incur these expenses as a part of our operations. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.Transaction costs related to business combinations. We incur expenses for professional services rendered in connection with business combinations, which are included in our GAAP presentation of selling, general and administrative expense. These expenses are generally not tax-deductible. We exclude these acquisition-related transaction expenses, derived from announced acquisitions, for the purpose of calculating non-GAAP operating income, non-GAAP operating profit margin, non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as we generally would not have otherwise incurred these expenses in the periods presented as a part of our operations. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting as well as comparability with competitors' operating results.Tax Cuts and Jobs Act. We recorded impacts to our income tax provision related to the enactment of the Tax Cuts and Jobs Act, specifically for the transition tax related to unrepatriated cash and the impacts of the tax rate change on net deferred tax assets. We exclude these impacts for the purpose of calculating non-GAAP net income and non-GAAP diluted earnings per share when we evaluate our continuing operational performance, as (i) the charges are not expected to recur as part of our normal operations and (ii) the charges resulted from the extremely infrequent event of major U.S. tax reform, the last such reform having occurred in 1986. We believe that these non-GAAP financial measures are useful to investors because they allow investors to (a) evaluate our operating results and the effectiveness of the methodology used by us to review our operating results, and (b) review historical comparability in our financial reporting.Non-GAAP financial measures are not in accordance with, or an alternative for, GAAP. Our non-GAAP financial measures are not meant to be considered in isolation or as a substitute for comparable GAAP financial measures and should be read only in conjunction with our consolidated financial statements prepared in accordance with GAAP.We have provided a reconciliation of the non-GAAP financial measures to the most directly comparable GAAP financial measures as listed below:About AnsysIf you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where Ansys software played a critical role in its creation. Ansys is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, Ansys is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit https://www.ansys.com for more information.Forward-Looking InformationThis document contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that provide current expectations or forecasts of future events based on certain assumptions. Forward-looking statements are subject to risks, uncertainties, and factors relating to our business which could cause our actual results to differ materially from the expectations expressed in or implied by such forward-looking statements. Forward-looking statements use words such as “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “intend,” “likely,” “may,” “outlook,” “plan,” “predict,” “project,” “should,” “target,” or other words of similar meaning. Forward-looking statements include those about market opportunity, including our total addressable market. Risks, uncertainties, and factors that could cause actual results to differ materially from those implied by these forward-looking statements include: adverse changes in global economic and/or political conditions; declines in our customers’ businesses resulting in adverse changes in customer procurement patterns; uncertainties regarding demand for our products and services in the future and our customers’ acceptance of new products; plans for future capital spending; investments in complementary companies, products, services and technologies; our ability to complete and successfully integrate our acquisitions and realize the financial and business benefits of the transactions; political, economic, and regulatory risks and uncertainties in the countries and regions in which we operate; impacts from tariffs, trade sanctions, export license requirements or other trade barriers; the effect of changes in currency exchange rates and changes in interest rates; potential variations in our sales forecasts compared to actual sales; the volatility of our stock price; failures or errors in our products and services; our industry’s rapidly changing technology; the quality of our products, including the strength of features, functionality and integrated multi-physics capabilities; lease license volatility; the investment of more resources in research and development than anticipated; increased pricing pressure as a result of the competitive environment in which we operate; our ability to recruit and retain key personnel; our ability to protect our proprietary technology; cybersecurity threats or other security breaches; disclosure and misuse of employee or customer data whether as a result of a cybersecurity incident or otherwise; implementation of our new IT systems; investments in global sales and marketing organizations and global business infrastructure; dependence on our channel partners for the distribution of our products; increased variability in our revenue due to the adoption of Accounting Standards Codification 606; our reliance on high renewal rates for annual lease and maintenance contracts; catastrophic events including pandemics such as the coronavirus which may damage our facilities or otherwise disrupt our business; operational disruptions or the failure of our technological infrastructure; periodic reorganization of our sales force; the repatriation of previously taxed earnings in excess of working capital and capital expenditure requirements; the outcome of contingencies, including legal proceedings and government or regulatory investigations and service tax audit cases; uncertainty regarding income tax estimates in the jurisdictions in which we operate; the effect of changes in tax laws and regulations in the jurisdictions in which we operate; changes in accounting principles or standards; the uncertainty of estimates relating to the impact on reported revenue related to the acquisition accounting treatment of deferred revenue; and other risks and uncertainties described in our reports filed from time to time with the Securities and Exchange Commission. We caution readers not to place undue reliance upon any such forward-looking statements, which speak only as of the date they are made. We undertake no obligation to publicly update forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.Ansys and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries. All other brand, product, service and feature names or trademarks are the property of their respective owners.Visit https://investors.ansys.com for more information.ANSS - FContact:Investors:Annette Arribas, IRC724.820.3700annette.arribas@ansys.comMedia:Amy Pietzak724.820.4367     amy.pietzak@ansys.com "
    },
    {
        "title": "Ansys Accelerates 5G, High-Performance Computing And Artificial Intelligence Design",
        "subtitle": "",
        "date": "Feb 25, 2020 7:00AM EST",
        "content": "PITTSBURGH, Feb. 25, 2020 /PRNewswire/ -- With the release of Ansys® RaptorH™, Ansys (NASDAQ: ANSS) will empower engineers to accelerate and improve 5G, three-dimensional integrated circuit (3D-IC) and radio-frequency integrated circuit design workflows for innovations like smart devices, antenna arrays and data storage systems. RaptorH fuses the fidelity of Ansys' flagship HFSS with the speed and high-capacity architecture of RaptorX — enabling designers to reduce chip size, lower power consumption, decrease production cost and minimize time-to-market.From high-performance systems-on-chip for 5G mobile devices and network infrastructure to the radio-frequency transceivers that enable autonomous vehicles and the industrial Internet of Things, circuit design is heavily impacted by electromagnetics. Ansys RaptorH will empower customers to overcome unwanted interference that often leads to lengthy design cycles, increased risk, higher costs and sub-optimal performance.  The highly-integrated analysis solution of Ansys RaptorH enables designers to simulate electromagnetic phenomena on advanced nanometer silicon designs across multi-chip 3D-ICs, silicon interposers and advanced packaging — resulting in shorter design cycles and improved reliability and integrity.\"Companies designing the next-generation of electronics face mounting time-to-market pressure as they try to solve incredibly complex design challenges within error-prone and expensive workflows,\" said John Lee, vice president and general manager, Ansys. \"By combining the world-class engines of Ansys HFSS and Ansys RaptorX into a single analysis solution, Ansys will provide an immediate solution for efficiently addressing electromagnetic effects across multiple high-speed and high-performance applications. As the global leader in electromagnetics, Ansys is proud to build upon our heritage with the launch of Ansys RaptorH.\"About AnsysIf you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where Ansys software played a critical role in its creation. Ansys is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, Ansys is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.Ansys and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries. All other brand, product, service and feature names or trademarks are the property of their respective owners.ANSS-T  View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-accelerates-5g-high-performance-computing-and-artificial-intelligence-design-301010338.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "Ansys Appoints Robert Calderoni and Ravi Vijayaraghavan to the Board of Directors",
        "subtitle": "",
        "date": "Feb 19, 2020 4:19PM EST",
        "content": "PITTSBURGH, Feb.  19, 2020  (GLOBE NEWSWIRE) -- Ansys, Inc. (NASDAQ: ANSS) today announced that Robert Calderoni and Ravi Vijayaraghavan have accepted appointments to the Ansys, Inc. Board of Directors effective March 1, 2020 – bringing with them decades of executive strategy and technological innovation, as well as business and financial experience.Robert Calderoni has more than three decades of executive experience leading large, multinational software, technology and service companies. He currently serves as the chairman of Citrix Systems, Inc., a multinational software company that provides applications, software as a service and cloud computing technologies. Prior to his current role, he was the executive chairman of Citrix and served as its interim chief executive officer and president. Previously, he was the chairman and chief executive officer of Ariba, Inc., a cloud applications and business network company until it was acquired by SAP AG and served as a member of the global managing board and president of SAP Cloud at SAP. Prior to joining Ariba, he held senior finance roles at Apple and IBM and served as chief financial officer of Avery Dennison Corporation, a publicly traded industrial materials company.Ravi Vijayaraghavan is a senior partner at Bain & Company, Inc., a management consulting firm, and director and head of its Asia-Pacific technology practice, as well as a member of its global partner promotion and compensation committee. Over his 25-year career, Ravi has played an integral leadership role in establishing and expanding Bain’s technology and telecommunication practice across the Asia-Pacific region. He is a senior member of Bain’s mergers & acquisitions, private equity and telecommunications, media and technology practices. His experience spans a broad range of technology markets, including software, hardware, semiconductors, and services, as well as mobile and fixed telecommunications operations across geographies in North America, Europe and Asia. He is a member of the board of overseers for WGBH, a Boston-based public broadcaster, and previously served as a member of the board of the Singapore Land Authority.“We are proud to have Bob Calderoni and Ravi Vijayaraghavan join the Ansys board,” said Ronald W. Hovsepian, Ansys chairman of the board. “Bob has a deep knowledge of engineering technology challenges, a strategic vision and a proven track record of success in bringing innovative digital solutions to market. Ravi brings extensive experience and expertise in business transformation and the global operational management of high-tech companies.”“Both Bob and Ravi are accomplished leaders with tremendous experience in business management, innovation and finance,” said Ajei Gopal, president and CEO of Ansys. “Their expertise will complement our strategy of pervasive engineering simulation and strengthen our ability to help customers achieve digital transformation.”About Ansys If you’ve ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you’ve used a product where Ansys software played a critical role in its creation. Ansys is the global leader in engineering simulation. Through our strategy of pervasive engineering simulation, we help the world’s most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, Ansys is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.Ansys and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries.ANSS-F"
    },
    {
        "title": "ANSYS 2020 R1 Digitally Threads Simulation Across Product Lifecycle Processes",
        "subtitle": "",
        "date": "Jan 28, 2020 7:00AM EST",
        "content": "PITTSBURGH, Jan. 28, 2020 /PRNewswire/ -- Companies are accelerating digital transformation by integrating cutting-edge ANSYS (NASDAQ: ANSS) technology across product lifecycle processes through new functionalities released today in ANSYS 2020 R1. From improving product development with ANSYS Minerva to running complex simulations with substantially streamlined workflows with ANSYS® Fluent® to optimizing electromagnetic design processes with ANSYS® HFSS™, ANSYS 2020 R1 enables companies to pioneer trailblazing innovations and create highly cost-effective designs. As simulation impacts virtually every product development decision, users must address considerable scale and complexity challenges of interoperability, data and process management, high-performance computing (HPC) integration and traceability. Additionally, sophisticated multiphysics simulation and optimization assets must be widely available throughout engineering teams and across product lifecycles. ANSYS 2020 R1 addresses this with portfolio-wide upgrades and improvements to ANSYS Minerva — enabling customers to connect simulation and optimization to their larger product lifecycle processes.ANSYS Minerva helps companies transform simulation intellectual property into a valuable and controlled corporate asset, capture best practices and digitally thread simulation and optimization more broadly across the enterprise than ever before. Minerva now incorporates advanced technologies for significantly improving workflows and enhancing simulation process and data management (SPDM). This includes dashboards that drive improved decision support, dynamic 3D visualization tools for exploring model data, a state-of-the-art system for managing change and ensuring reliability of information. OptiSlang — a technology now owned by ANSYS as a result of the recent acquisition of Dynardo — now teams with Minerva's SPDM solutions to help users reduce development time and expedite the evaluation of affordable optimal design alternatives. \"Navigating digital transformation is about adapting to a constantly evolving environment and using existing tools and data in new ways. With use of simulation expected to expand in the coming years, Minerva is important to Eaton and plays a key part in our larger, enterprise-wide digital prototyping and additive manufacturing (AM) initiatives,\" said Todd Earls, vice president of Information Technology at Eaton. \"Additionally, traceability and management are essential for efficiency and there are many steps necessary to design and manufacture parts using AM or other processes. ANSYS Minerva will help make our user experience more streamlined than it is today.\"An interoperable knowledge management application engineered with an open and vendor-neutral architecture, Minerva integrates with engineering teams' ecosystem of simulation tools and enterprise systems and streamlines collaboration and traceability across teams based around the world.\"Customers across virtually every industry seek to radically improve how they leverage simulation, optimize designs and share data to spur innovation and create products more efficiently,\" said Eric Bantegnie, vice president and general manager at ANSYS. \"Minerva's improvements help fuse simulation and optimization processes across the enterprise, establishing simulation-based design optimization workflows as a dynamic standardized process for exploring and improving product performance. In addition to Minerva, ANSYS 2020 R1 delivers numerous state-of-the-art upgrades across our portfolio designed to inspire innovation, slash development costs and speed products to market.\"Pioneering Major Advancements in Simulation ANSYS 2020 R1 delivers upgraded capabilities for flagship simulation platforms including ANSYS® Mechanical™ and ANSYS Fluent that help customers strengthen their digital thread to drive innovation and overcome design complexity challenges. Additionally, this new release upgrades ANSYS HFSS and ANSYS® Maxwell® to help customers substantially enrich their electromagnetic design processes.ANSYS 2020 R1 empowers ANSYS Mechanical users to go further than ever before with added features and enhancements to better handle complex, highly nonlinear and massively large models. Additional functionality streamlines workflows, including post-processing of reinforcements and easy drag-and-drop of external models right into ANSYS Mechanical.Leveraging ANSYS distributed compute services (DCS) helps engineers run Mechanical and Fluent design iterations with increased speed, delivering new products to market faster than ever.\"Radiate uses simulation from the very early stages of the development process. To fully explore the entire solution space for a given problem, we use ANSYS DCS to push our development to the limit of what is possible,\" said Simon Grob, head of simulation engineering at Radiate Engineering & Design AG. \"DCS empowers us to evaluate a variety of different solution options and optimize designs in the shortest possible time.\"In ANSYS' fluids suite, Fluent introduces new features that make it easy for nearly anyone — from novices to experts — to effectively run high-quality, complex multiphase computational fluid dynamics simulations using a simplified and streamlined workflow that sets up simulations 25% faster. Fluent users are additionally supported by an immersive and highly intuitive graphical user interface, enabling them to directly interact with models and graphical elements to help speed set up.Fluent's new release also introduces a new algebraic interface area density model that accounts for differences in drag and interfacial area to accurately simulate complex multiphase transitions between liquid and gas flows. This delivers better simulation accuracy for designing nuclear reactors, oil and gas pipelines and many other applications. The electromagnetic suite introduces advances in ANSYS HFSS for quickly and accurately modeling antenna arrays — key for enabling 5G. For high-speed electronics, HFSS delivers remarkable solving speed for very large simulations, recently slashing compute time from 50 hours to 5 hours for a specific benchmark.New upgrades in the area of electronics design enable users to predict and resolve printed circuit board electromagnetic interference and run transient thermal analyses to ensure highly reliable designs.Also in the electromagnetic suite, ANSYS Maxwell delivers a new multiphysics solver designed to predict noise and vibration in electric vehicle (EV) powertrains, boosting EV overall reliability and performance. In addition to delivering quiet rides, next-generation EVs will also be safer. Through its acquisition of Livermore Software Technology Corporation (LSTC), ANSYS will enable OEMs to accurately predict a vehicle's reaction and passenger safety in the wake of a collision. Leveraging LSTC's leading-edge simulation will greatly reduce — and possibly eliminate — the requirement for expensive physical prototype testing. AM customers can now use ANSYS Additive Prep to write build files for multiple AM machine types, including EOS and SLM. This significantly streamlines the development of AM manufactured parts by eliminating the use of third-party software.ANSYS' materials suite updates ANSYS® GRANTA MI™, focusing on optimizing user experience for enterprise-wide implementations. The suite also introduces ANSYS GRANTA MI Pro, a new fast-start data management solution for design and simulation — broadening access to the numerous benefits of material intelligence.Users will explore designs faster than ever with ANSYS® Discovery™ Live's new steady-state fluids solver and an updated structural solver which also improves accuracy for thinner geometries. Users will also receive upfront design insights with the addition of manufacturing constraints and multi-analysis optimization for generative design. Getting More from ANSYS CloudIn ANSYS 2020 R1, ANSYS® Cloud™ introduces new licensing options to enable greater business flexibility. Companies can cost optimize cloud software usage by mixing elastic (usage-based) and traditional (leased or paid-up) licensing while accessing on-demand compute resources.\"ANSYS Cloud has been a game changer from a productivity standpoint. We can simultaneously submit multiple ANSYS Mechanical jobs covering different load cases without encountering scheduling or memory capacity concerns,\" said Tim Marvel, P.E., vice president, Business Development & Technology at Downing Wellhead Equipment. \"For each design, we evaluate 5-10 options with multiple load cases. ANSYS Cloud has reduced the time of each job from 20-25 hours to only 2-4 hours.\"Improving Automotive Safety, Design and Acoustics with ANSYS VRXPERIENCEFrom leading-edge optical simulations to new applications for embedded design, ANSYS 2020 R1 delivers new digital thread enhancements across the board to boost the safety, reliability and aesthetics of next-generation autonomous vehicles (AV).ANSYS® VRXPERIENCE™ provides cutting-edge innovations for sensor, human-machine interface (HMI) and sound simulations. ANSYS VRXPERIENCE Sensor provides a reduced order model (ROM) radar simulation for industrial automation applications, enabling engineers to quickly test and improve the accuracy and robustness of AV radars in edge cases. ANSYS VRXPERIENCE HMI offers a streamlined process to test HMI prototypes faster than ever. ANSYS VRXPERIENCE Sound offers an increased user experience through an improved workflow and user interface that assists uses in quickly detecting and analyzing engine noise, helping engineers pivot their design to create a quieter cabin.\"Acoustic comfort in helicopter cabins is critically important for pilots and passengers. Airbus Helicopters uses ANSYS VRXPERIENCE Sound to accurately listen to and analyze sound, troubleshoot unusual noise issues identified in flight and perform fast psychoacoustic indicator calculations to estimate acoustic comfort,\" said Julien Caillet, head of department, acoustics at Airbus Helicopters. \"By using VRXPERIENCE Sound, we definitely see an unparalleled time gain. ANSYS helps our team make earlier design choices, reduce physical testing and shorten problem-solving time.\"ANSYS 2020 R1 introduces ANSYS VRXPERIENCE Light Simulation to simplify automotive product design illumination, delivering engineering-grade light simulation to studio designers. VRXPERIENCE Light Simulation combines visual design and advanced engineering review by connecting Autodesk VRED design visualization software and ANSYS' physics-based lighting simulations. This delivers a photorealistic visualization of vehicle interior and exterior lighting, enabling users to spend substantially less time and money on physical prototype development.Boosting Cybersecurity with ANSYS medini analyzeThe latest release of ANSYS® medini analyze addresses the increasing market need for systematic analysis and assessment of security threats to AV cyber-physical systems — beginning early in the system design. This helps automakers model the limitations and weaknesses of AV system components and environmental conditions to provide state-of-the-art cybersecurity.Illuminating Simulations with ANSYS SPEOSANSYS® SPEOS™ incorporates a leading-edge model for camera simulation to increase the accuracy of advanced driver assistance systems (ADAS) and AV simulations, creating results that are closer to reality. SPEOS also stretches the limits of lighting simulation, empowering users to quickly and efficiently model numerous types of lighting variations that AVs will experience on the road and optimize AV lighting system performance. \"Mazda is always eager to introduce smarter technology into their vehicles, from ADAS systems to smart headlamps, tackling the challenges to achieve high-quality requirements and scheduled targets,\" said Tohru Yoshioka, deputy general manager at Mazda. \"Providing physics-based design and testing of optical features, ANSYS SPEOS and VRXPERIENCE are extensively used at Mazda to perform early and iterative digital design and optimization of systems, from adaptive driving beams using complex matrices of LED units to camera systems used in AV-ADAS technology. This enables us to significantly reduce the physical prototyping and testing phase of these systems while improving safety and fast-tracking time to market.\"Improving AV Safety-Critical Software Development with ANSYS SCADEThe latest version of ANSYS® SCADE further accelerates AV embedded control software design, incorporating several new capabilities designed to reduce the development time and cost for automatic code generation of safety-critical software throughout the development cycle by over 50%. ANSYS 2020 R1 extends the scalability of ANSYS SCADE Vision to further accelerate testing activities and improve safety of large, AI-based perception software projects by creating direct connections to data lakes on customer cloud clusters.Slashing Development Time and Boosting Productivity with ANSYS Twin BuilderANSYS® Twin Builder™ now includes ANSYS Twin Builder Battery Wizard which will shorten development time of building, simulating and testing an entire battery-powered electrical system across industries.\"A123 uses ANSYS Twin Builder to perform thermal simulation of their 48V battery pack development. With the help of the simulations, A123 can determine thermal dependency on electric performance, design cooling supply, calculate temperature distributions and predict battery life,\" said Shawn Zhang, senior manager, Simulation Engineering at A123 Systems. \"A123 also utilizes ANSYS Twin Builder's ROM technologies for simplifying complex 3D thermal simulation which significantly reduces the simulation time from days to few seconds while keeping the required simulation accuracy.\"Additionally, ANSYS Twin Builder features innovative improvements to its industry-leading ROM capabilities including the capacity to capture higher non-linearity components and the integration of a tool-agnostic static ROM builder to enable field visualization for ROMs. Twin Builder also provides improved workflows for Modelica and runtime generation.Power and Thermal Reliability Solutions for Automotive and 5G Semiconductor ElectronicsNew updates to ANSYS® Redhawk-SC™ help engineers gain better insights into more complex designs and substantially slash simulation runtime — delivering significant performance and accuracy improvements. Also in 2020 R1, the ANSYS® Totem™ and ANSYS®  RedHawk™ product family are certified to support a comprehensive list of advanced FinFET nodes and 2.5D/3D-IC packaging technologies. This empowers customers to address the growing multiphysics challenges of power, thermal and reliability in ultra-large and high-performance SoCs that are at the heart of AI, 5G and automotive applications. About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A., Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries ANSS-G   View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-2020-r1-digitally-threads-simulation-across-product-lifecycle-processes-300994043.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "ANSYS to Release Fourth Quarter and FY 2019 Earnings on February 26, 2020",
        "subtitle": "",
        "date": "Jan 27, 2020 4:39PM EST",
        "content": "PITTSBURGH, Jan.  27, 2020  (GLOBE NEWSWIRE) -- ANSYS, Inc. (NASDAQ: ANSS) announced today that the Company expects to release its fourth quarter and FY 2019 earnings on Wednesday, February 26, 2020, after the market closes. The Company will hold a conference call conducted by Ajei Gopal, president and chief executive officer, and Maria T. Shields, chief financial officer, at 8:30 a.m. Eastern Time on Thursday, February 27, 2020 to discuss fourth quarter and 2019 results and future outlook.CONFERENCE CALL INFORMATION:What: ANSYS Fourth Quarter and 2019 Earnings Conference Call When: February 27, 2020 at 8:30 a.m. Eastern TimeWe encourage participants to pre-register for the conference call using the enclosed link.  Callers who pre-register will be given a unique PIN to gain immediate access to the call, bypassing the live operator.  Participants may pre-register any time, including up to and after the call start time.  You will immediately receive an online confirmation, an email with the dial in number and a calendar invitation for the event.To pre-register, go to:http://dpregister.com/10138950You may also reach the pre-registration link by logging in through the investor section of our website at https://investors.ansys.com and clicking on the Audio Webcasts link.   Click the event under Upcoming Events.  The following will be available on the corporate website https://investors.ansys.com at or prior to the time of the conference call: a link to the live audio webcast of the call as well as the earnings press release, earnings prepared remarks and the quarterly investor presentation.  For those who do not have internet access or are unable to pre-register, simply join the call on the day of the event by dialing (855) 239-2942 (US) or (412) 542-4124 (CAN and INT’L).  Ask the operator to join you into the ANSYS Conference Call.The call will be recorded with replay available within two hours after the call at https://investors.ansys.com or at (877) 344-7529 (US), (855) 669-9658 (CAN toll free) or (412) 317-0088 (INT’L).  Passcode: 10138950About ANSYS, Inc.If you’ve ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you’ve used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world’s most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A., Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries.ANSS - F"
    },
    {
        "title": "ANSYS Announces Winners Of 2020 Hall Of Fame Competition",
        "subtitle": "",
        "date": "Jan 23, 2020 7:00AM EST",
        "content": "PITTSBURGH, Jan. 23, 2020 /PRNewswire/ -- The winning entries of the annual ANSYS (NASDAQ: ANSS) Hall of Fame competition showcase how engineers are using ANSYS' cutting-edge simulation solutions to solve critical engineering challenges, ranging from detecting unexploded land mines to simulating the human heart.The contest grew significantly in 2020, with a 21% increase in total submissions compared to 2019. The submissions, which were sent from nearly 20 countries, were divided into two categories — corporate and academic:Corporate winners:Academic winners:\"Year after year, we are blown away by how engineers leverage ANSYS solutions,\" said Matt Zack, vice president of corporate development and global partnerships at ANSYS. \"The entries we receive offer a glimpse into the revolutionary products and solutions our customers are building. As a simulation provider, there's nothing more exciting or validating than knowing that our products play a critical role in ushering in the future.\"View the ANSYS Hall of Fame Archive for submissions from previous years' competitions.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-G  View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-announces-winners-of-2020-hall-of-fame-competition-300991793.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "ANSYS Student Software Surpasses One Million Downloads",
        "subtitle": "",
        "date": "Jan 21, 2020 7:00AM EST",
        "content": "PITTSBURGH, Jan. 21, 2020 /PRNewswire/ -- ANSYS (NASDAQ: ANSS) is paving the way for the next generation of innovation by lowering the barrier of adoption for simulation software through its growing academic program. Free student software — a key component of the program — recently surpassed more than one million downloads since its launch in late 2015, empowering students to develop skillsets they need to compete in the job market, stay ahead of the latest technology trends and make an immediate impact after graduation.  As digital transformation reshapes engineering, companies are relying more heavily on advanced simulation solutions to overcome unprecedented design challenges and recruiting engineers who are proficient in simulation tools. To close this skills gap and help companies innovate faster, ANSYS is engaging with students at every level, both inside and outside of the classroom. Professors and researchers from more than 3,200 universities in 87 countries leverage ANSYS software, bringing simulation into the classroom for a hands-on learning experience. The ANSYS Academic Program empowers students through free student software, the sponsorship of more than 500 student teams and the ANSYS Student Community, which allows users to ask and answer questions, access tutorials and discuss engineering challenges. \"Simulation is an important tool both inside and outside of the classroom. Students who are proficient in simulation have an easier transition from academia to industry,\" said Dereje Agonafer, Presidential Distinguished Professor, University of Texas at Arlington. \"Students who understand the physics in the lab and can also couple it to simulation are untouchable. Knowing ANSYS gives engineers a major advantage — I see this firsthand as my graduates enter the workforce.\"Beyond the classroom and online community, university-based student teams are applying simulation to solve-real world challenges, ranging from electronic design to high-speed transportation. These teams participate in diverse competitions, ranging from Formula SAE, the SpaceX Hyperloop Pod Competition, Human Powered Vehicle Challenge and many more. \"Solar Team Eindhoven competed in the World Solar Challenge this year, designing a vehicle that could carry four passengers with great comfort, safety and reliability,\" said Michiel van Laarhoven, a structural engineering student at Eindhoven University of Technology. \"ANSYS Mechanical and composite solutions played a critical role in designing and validating the composite monocoque to obtain the optimum laminate. With the help of ANSYS, we beat 16 other teams from around the world, taking first place in the Cruiser Class.\"ANSYS also supports continued education for engineers at any stage of their career through free Massive Open Online Courses (MOOCs) offered by universities. One of Cornell University's simulation-focused MOOCs has generated 142,000 registrations across 173 countries since its inception. Registrants range from students just becoming familiar with simulation to established engineers expanding their understanding of ANSYS solutions. \"The ANSYS Academic Program has grown into a truly holistic offering,\" said Prith Banerjee, chief technology officer at ANSYS and executive sponsor of the ANSYS Academic Program. \"Students benefit from access to simulation tools and instructions throughout their academic careers and can take advantage of online courses, student team sponsorships and our industry connections. We also help universities succeed by providing important material for curriculum development and research. We're eager to see what kinds of innovations are brought to life by the bright minds who will put our technology to the test in academia.\"To learn more about how universities benefit from implementing ANSYS, visit ansys.com/ansysoncampus.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesContactMedia Mary Kate Joyce 724.820.4368 marykate.joyce@ansys.com Investors Annette N. Arribas, IRC 724.820.3700 annette.arribas@ansys.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-student-software-surpasses-one-million-downloads-300989676.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "ANSYS and Blackberry Collaborate to Support Next-Generation Automobiles",
        "subtitle": "Technical collaboration leverages ANSYS' comprehensive solutions for autonomous systems development",
        "date": "Jan 7, 2020 8:00AM EST",
        "content": "LAS VEGAS, Jan. 7, 2020 /PRNewswire/ -- BlackBerry Limited (NYSE: BB; TSX: BB) and ANSYS  (NASDAQ: ANSS) are joining forces to support BlackBerry QNX's industry-leading real-time operating system (RTOS) for connected and autonomous vehicles.  As part of ANSYS' ongoing commitment to fostering an open ecosystem that supports RTOS leaders across industries, the collaboration will empower automotive manufacturers to increase safety and reliability, reduce development cost and shorten time-to-market for next-generation automobiles and autonomous systems.  BlackBerry QNX and ANSYS are enabling OEMs to minimize risk by combining ANSYS SCADE's® embedded software development environment with the QNX Neutrino® operating system, both certified to ISO 26262 ASIL D level — the automotive industry's most stringent safety standard and highest level of certification.As the next generation of vehicles becomes more connected, automated and autonomous, they also become more complex and vulnerable to cyber-attacks. In addition to design and engineering challenges, manufacturers also face unprecedented levels of safety certifications. OEMs must balance connectivity, AUTOSAR compliance and versatility with safety and security. \"The electronic automotive architecture is quickly evolving from being hardware-driven to software-defined and with our software embedded in more than 150 million vehicles on the road today, BlackBerry QNX is perfectly positioned to address the evolution,\" said Grant Courville, Vice President, Products and Strategy at BlackBerry QNX. \"Through our work with ANSYS, we can significantly enhance our support of the biggest OEM and Tier 1 brands in the automotive industry and support them throughout all design steps — from functional application design up to on-target integration.\"\"We are committed to an open ecosystem that supports customers around the world with best-in-breed technology, solutions and collaborations,\" said Eric Bantegnie, Vice President and General Manager, Systems Business Unit at ANSYS. \"By integrating our industry-leading embedded software design environment for critical applications with BlackBerry's proven QNX RTOS, ANSYS remains the frontrunner in the industry. This technical alliance is an important milestone for our overall ANSYS Autonomy solutions that span embedded software development, systems design, cybersecurity threat and functional safety analysis, autonomous systems, physical and driving simulation, and AI-based embedded software validation.\"About BlackBerryBlackBerry (NYSE: BB; TSX: BB) is a trusted security software and services company that provides enterprises and governments with the technology they need to secure the Internet of Things. Based in Waterloo, Ontario, the company is unwavering in its commitment to safety, cybersecurity and data privacy, and leads in key areas such as artificial intelligence, endpoint security and management, encryption and embedded systems. For more information, visit BlackBerry.com and follow @BlackBerry.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries.Media Contacts:BlackBerry (519) 597-7273mediarelations@BlackBerry.comANSYSMary Kate Joyce 724.820.4368marykate.joyce@ansys.comInvestors Annette Arribas, IRC 724.820.3700 annette.arribas@ansys.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-and-blackberry-collaborate-to-support-next-generation-automobiles-300981884.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "FLIR Systems and ANSYS Collaborate to Enhance Autonomous Vehicles Safety",
        "subtitle": "Integration speeds thermal camera system development, improves autonomous vehicle hazard detection",
        "date": "Jan 7, 2020 7:00AM EST",
        "content": " PITTSBURGH, Jan. 7, 2020 /PRNewswire/ -- FLIR Systems and ANSYS (NASDAQ: ANSS) are collaborating to deliver superior hazard detection capabilities for future assisted driving and autonomous vehicles (AVs) — empowering automakers to deliver improved vehicle safety. Through a technical collaboration, FLIR Systems will integrate a fully physics-based thermal sensor into ANSYS' leading-edge driving simulator to model, test and validate thermal camera designs within an ultra-realistic virtual world.  Current AV and advanced driver assistance systems (ADAS) sensors cannot dependably identify objects in darkness and through smog, inclement weather, shadows and sun glare. Thermal cameras, however, can effectively detect and classify objects in these conditions. Integrating FLIR Systems' thermal sensor into ANSYS® VRXPERIENCE®, will enable engineers to simulate thousands of driving scenarios across millions of miles in mere days and reduce physical prototyping. Engineers can also simulate uncommon and difficult scenarios where thermal excels, including wildlife encounters and distinguishing pedestrians from other roadway objects in low-contrast environments. The new ADAS solution will slash OEMs' development time by optimizing thermal camera placement for use with systems such as automatic emergency braking (AEB) and within future AVs for the critical aspect of pedestrian detection. \"Combining FLIR Systems' cutting-edge automotive thermal cameras with ANSYS' industry-leading solutions will further improve road hazard detection, helping vehicles sense objects four times farther than the illuminating distance of typical headlights,\" said Paul Clayton, general manager at FLIR Systems. \"Enabling engineers, automakers and auto suppliers to rapidly simulate and test countless scenarios greatly reduces reliance on physical prototype testing while cutting development costs and the time required to test. This results in increasing the adoption of thermal technology in automotive safety to help save lives and livelihoods.\"\"FLIR Systems' automotive thermal cameras enhance the safety and reliability of ADAS, creating smarter AVs that improve decision making in challenging road environments,\" said Eric Bantegnie, vice president and general manager at ANSYS. \"Leveraging ANSYS' solutions will enable FLIR Systems to design groundbreaking thermal cameras and empowers automakers to speed the creation and certification of AVs.\"About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-T View original content to download multimedia:http://www.prnewswire.com/news-releases/flir-systems-and-ansys-collaborate-to-enhance-autonomous-vehicles-safety-300980954.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "AEye and ANSYS Accelerate Autonomous Driving Safety",
        "subtitle": "ANSYS enables virtual prototyping of AEye solutions to speed design, testing and validation of automotive perception technologies in challenging real-world scenarios",
        "date": "Jan 6, 2020 7:00AM EST",
        "content": " PITTSBURGH, Jan. 6, 2020 /PRNewswire/ -- The next generation of autonomous vehicles will mimic how human eyes focus on and evaluate road conditions by leveraging AEye and ANSYS (NASDAQ: ANSS) technologies. AEye is incorporating ANSYS' industry-leading simulation solutions into the design of its Intelligent Detection and Ranging (iDAR™) platform — enabling customers to reduce physical prototyping and improve the safety and reliability of autonomous systems.  Safeguarding autonomous driving requires next-generation sensors to quickly and correctly interpret certain hazardous road scenarios that cannot be reliably detected by conventional perception platforms. To validate the sensors' effectiveness, exhaustive road testing must be successfully completed —demanding significant development time and expenses. With ANSYS, AEye empowers automotive manufacturers to potentially simulate driving situations across millions of miles in just days, minimizing physical prototyping.AEye is implementing ANSYS® SPEOS® and ANSYS® VRXPERIENCE®, a state-of-the-art driving simulation tool with physics-based sensor models, into the design of AEye's iDAR — empowering customers to quickly test and certify iDAR designs within a realistic virtual driving environment. AEye's automotive-grade iDAR combines deterministic and AI-driven perception to deliver detection and classification at high speed and far range not possible for conventional LiDAR or camera sensors. Through the integration, automotive customers deploying autonomous vehicle and advanced driver assistance systems (ADAS) will be able to virtually prototype AEye's software-definable, agile LiDAR to simulate exactly how they want to sense their environment.\"Addressing use cases systematically will eventually allow AEye and its OEM and Tier 1 customers to drive more intelligence from the edge and achieve higher autonomous capabilities, a concept we refer to as autonomy on-demand,\" said Luis Dussan, co-founder and CEO at AEye. \"By collaborating with ANSYS, we are helping to accelerate customer and partner innovation – bringing safer, more reliable autonomous features to the market.\" \"iDAR will substantially advance autonomous vehicles and advanced driver assistance systems' reliability, enabling improved autonomous perception and, in turn, safer roads,\" said Eric Bantegnie, vice president and general manager, Systems Business Unit at ANSYS. \"ANSYS helps automotive manufacturers test scenarios that are nearly impossible to physically test, fully validating iDAR's performance. As OEMs and Tier 1 manufactures adopt iDAR, our simulation solutions will reduce development time and optimize implementation.\"AEye and ANSYS will showcase their ability to detect driving scenarios using SPEOS and VRXPERIENCE at CES on Jan. 7-10 in Las Vegas at ANSYS Booth 3310 and AEye Booth 7538 in the Las Vegas Convention Center, North Hall.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.About AEyeAEye is an artificial perception pioneer and creator of iDAR™, a perception system that acts as the eyes and visual cortex of autonomous vehicles. Since its demonstration of its solid-state LiDAR scanner in 2013, AEye has pioneered breakthroughs in intelligent sensing. The company is based in the San Francisco Bay Area, and backed by world-renowned investors including Kleiner Perkins Caufield &amp; Byers, Taiwania Capital, Hella Ventures, LG Electronics, Subaru-SBI, Aisin, Intel Capital, Airbus Ventures, and others. For more information, please visit www.aeye.aiANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-T View original content to download multimedia:http://www.prnewswire.com/news-releases/aeye-and-ansys-accelerate-autonomous-driving-safety-300981508.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "ANSYS to Join NASDAQ-100 Index",
        "subtitle": "",
        "date": "Dec 16, 2019 9:00AM EST",
        "content": " PITTSBURGH, Dec. 16, 2019 /PRNewswire/ -- ANSYS (Nasdaq: ANSS) will become a component of the NASDAQ-100® Index (Nasdaq: NDX) effective with the stock market open on Dec. 23, 2019. The NASDAQ-100 index is composed of the 100 largest non-financial company stocks listed on The Nasdaq Stock Market based on market capitalization.\"We are honored to join this elite group of the world's most successful and dynamic companies on the NASDAQ-100 Index,\" said Ajei Gopal, ANSYS president and CEO. \"The simulation market has incredible growth opportunities, and ANSYS' world-class ecosystem and innovative solutions ensure that we are in the best possible position to take advantage of them. This important milestone is a testament to the strength of our Pervasive Simulation strategy.\" The NASDAQ-100 Index is composed of the 100 largest non-financial companies listed on The NASDAQ Stock Market® and dates to January 1985 when it was launched along with the NASDAQ Financial-100 Index®, which is comprised of the 100 largest financial stocks on NASDAQ®. These indexes act as benchmarks for financial products such as options, futures, and funds. The NASDAQ-100 is evaluated each year in December, timed to coincide with the quadruple witch expiration Friday of the quarter. The full Nasdaq-100 Index lists can be found at https://www.nasdaq.com.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-G  View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-to-join-nasdaq-100-index-300975288.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "ANSYS Accelerates Electronic Product Design And Signoff For Global Custom ASIC Leader",
        "subtitle": "ANSYS' industry standard for power, noise and reliability signoff drives design optimization and closure at GUC",
        "date": "Dec 10, 2019 7:00AM EST",
        "content": "PITTSBURGH, Dec. 10, 2019 /PRNewswire/ -- Global Unichip Corp. (GUC), the global custom application-specific integrated circuit (ASIC) leader, has adopted ANSYS (NASDAQ: ANSS) to support its unmatched combination of advanced technology, low-power and embedded CPU design capabilities. Providing advanced ASIC services that meet the needs of today's innovative technology enterprises requires a fast introduction, timely resolution to customer problems and successful signoff. GUC selected ANSYS® RedHawk-SC™ to support the significant needs of its customers by effectively executing designs with more than one billion device instances and completing the full-chip systems-on-chip (SoC) power integrity and reliability signoff in less than two days.ANSYS RedHawk-SC is built on ANSYS® SeaScape™ — the world's first custom-designed, big data architecture for electronic system design and simulation. ANSYS SeaScape features big data architecture for electronic system design and simulation and provides elastic compute scalability to enable rapid design iteration, increased scenario coverage and greater accuracy for full-chip SoC signoff for advanced nodes. ANSYS RedHawk-SC's actionable analytics provide designers with key insights to prioritize design fixes and enable easy viewing and querying of large design databases in minutes for faster debugging. Efficient hardware utilization makes the platform ideally suited for high-performance computing, artificial intelligence and datacenter applications.   \"GUC is committed to providing world-class custom ASICs to help elevate prospective systems and integrated circuit (IC) companies' market-leading positions,\" said Louis Lin, senior vice president, GUC. \"As IC manufacturing processes become more complex, there are more elements to simulate and compute during chip design and verification to ensure reliability and minimize power loss. ANSYS helps us minimize this complexity, speed our time to market and reduce development costs. Our partnership with ANSYS has been a cornerstone in helping our clients succeed in the IC market.\"\"As a custom ASIC leader, GUC requires cutting-edge solutions for fast and accurate results,\" said John Lee, vice president and general manager, semiconductor business unit at ANSYS. \"RedHawk-SC meets the market's unique needs for addressing multiphysics challenges — we are seeing an influx of customers deploying RedHawk-SC for the most complex product and design signoff.\"About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-C View original content to download multimedia:http://www.prnewswire.com/news-releases/ansys-accelerates-electronic-product-design-and-signoff-for-global-custom-asic-leader-300971716.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "Telma Shortens Path To Market For Frictionless Braking Systems With ANSYS",
        "subtitle": "ANSYS multiphysics simulation solutions reduce number of physical prototypes by 10x",
        "date": "Dec 5, 2019 7:00AM EST",
        "content": "PITTSBURGH, Dec. 5, 2019 /PRNewswire/ -- Telma, the world leader in frictionless braking systems, significantly shortened time to market and optimized product development costs using ANSYS (NASDAQ: ANSS) for three new series of retarders — braking systems that use electromagnetic induction. With ANSYS, Telma decreased the number of prototypes required for validation from 10 to one over the course of a decade — enabling faster development of retarders that reduce fine-particle emissions associated with braking systems by up to 90% while significantly reducing maintenance costs.Retarders are used in heavy vehicles, mining applications, wind turbines and elevators to dissipate most of the large amounts of energy produced during deceleration. This requires testing and validating the retarders under extreme conditions to ensure the function and safety of the application. With ANSYS, Telma engineers replaced their time-consuming and expensive physical prototyping and testing process with simulation, enabling engineers to better manage the electromagnetical, fluid and structural mechanic phenomena at work. Using ANSYS' high-fidelity multiphysics simulation solutions to model, simulate and validate these virtual prototypes, Telma significantly reduced costs and accelerated time to market.\"With the simulation solutions from ANSYS, we have complete control over all three physics and can validate our models in one iteration,\" said Nicolas Quennet, director of research and development at Telma. \"Our engineers can easily duplicate models to simulate all or part of the products, which also boosts innovation. Furthermore, as a leader in engineering simulation software, ANSYS represents a guarantee of excellence and quality for both existing and prospective customers.\"\"Telma's products are vital – not only because they help with essential vehicle safety issues — but also because of their positive environmental impact,\" said Chris Wolfe, lead product manager of systems coupling and data analytics at ANSYS. \"Telma's team faces true multiphysics engineering challenges and our multiphysics solutions proved to be a perfect fit for clearing those hurdles. It's rewarding to see our software and consultation having such a positive impact on product development and optimizing resources.\"About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries. All other brand, product, service and feature names or trademarks are the property of their respective owners.ANSS-C View original content to download multimedia:http://www.prnewswire.com/news-releases/telma-shortens-path-to-market-for-frictionless-braking-systems-with-ansys-300969571.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "ANSYS CEO to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Nov 26, 2019 9:00AM EST",
        "content": "PITTSBURGH, Nov.  26, 2019  (GLOBE NEWSWIRE) -- ANSYS, Inc. (NASDAQ: ANSS), announced today that Ajei Gopal, President & CEO of ANSYS, Inc. will participate in a moderated Q&A discussion at the NASDAQ 41st Investor Conference in London, UK on December 4, 2019 at 8:15 am GMT or 3:15 am EST. A live audio web cast and archive of the NASDAQ presentation will be available at:https://investors.ansys.comAbout ANSYS, Inc.If you’ve ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you’ve used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world’s most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-F"
    },
    {
        "title": "Porsche Fully Electric Race Car Targets Formula E Championship Using ANSYS Technology",
        "subtitle": "ANSYS simulation software helps Porsche 99X Electric's advanced powertrain deliver unmatched energy efficiency",
        "date": "Nov 21, 2019 7:00AM EST",
        "content": "PITTSBURGH, Nov. 21, 2019 /PRNewswire/ -- The TAG Heuer Porsche Formula E Team is racing to the finish line of the 2019/2020 ABB FIA Formula E Championship through a new collaboration with ANSYS (NASDAQ: ANSS). Porsche Motorsport engineers are using ANSYS' industry-leading system-level simulation solutions to create an advanced electric powertrain that will substantially increase energy efficiency for Porsche's first-ever fully electric race car — the Porsche 99X Electric. Accelerating at extreme speeds through demanding urban courses within metropolitan city centers exerts massive stresses on the powertrain of the Porsche 99X Electric. While regulations stipulate a standardized chassis and battery, engineers can customize the powertrain and its subsystems and components to deliver maximum energy efficiency and vehicle performance from the starting line to the finish line.ANSYS system-level solutions deliver a critical competitive edge for the Porsche 99X Electric, enabling Porsche engineers to create the next-generation Porsche E-Performance Powertrain. This helps provide the highest level of energy efficiency for its vital subsystems and components — maximizing the efficiency of the motor and power electronics to significantly reduce losses. After proving itself on the track, Porsche will leverage the electric powertrain of the Porsche 99X Electric to push engineering boundaries and usher in a new era of commercial e-mobility vehicles. The car's 800-volt technology is currently being used in the series production of the fully electric Porsche Taycan. \"ANSYS system-level simulations are instrumental for optimizing the Porsche E-Performance Powertrain's motor, gearbox, power electronics and control software, allowing the Porsche 99X Electric to sustain unprecedented speeds over long distances while conserving as much energy as possible,\" said Fritz Enzinger, vice president, Porsche Motorsport. \"Delivering unparalleled energy management, the powertrain is a decisive competitive factor that provides our driver with numerous tactical options during the race, empowering him to push the car to the edge of its envelope.\"\"Porsche Motorsport sets the standard for racing excellence and we are honored to help revolutionize the electric powertrain of the Porsche 99X Electric, break new e-mobility barriers and speed their team to Formula E victory,\" said Shane Emswiler, senior vice president and general manager, ANSYS. \"Delivering a critical competitive advantage, ANSYS system-level simulations slash the Porsche 99X Electric's energy losses and greatly increase its electrical efficiency — enabling the car to provide maximum power during challenging races.\" About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-C View original content to download multimedia:http://www.prnewswire.com/news-releases/porsche-fully-electric-race-car-targets-formula-e-championship-using-ansys-technology-300962623.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "Rockwell Automation and ANSYS Announce Strategic Partnership, Driving Quicker Time to Market and Operational Efficiency for Customers",
        "subtitle": "Market leaders in industrial automation and simulation help customers realize better business outcomes through simulation-based digital twins",
        "date": "Nov 20, 2019 7:05AM EST",
        "content": "PITTSBURGH, Nov. 20, 2019 /PRNewswire/ -- Industrial companies now have access to a streamlined, holistic, end-to-end solution for design, automation, production and lifecycle management, thanks to a new strategic partnership between Rockwell Automation and ANSYS (NASDAQ: ANSS). Rockwell Automation, the world's largest company dedicated exclusively to industrial automation and information, and ANSYS, the industry leader in simulation software, announced the partnership at Rockwell Automation's 28th annual Automation Fair in Chicago.ANSYS and Rockwell Automation will help customers develop simulation-based digital twins of products, processes or manufacturing. Historically manufacturers would dedicate an unimaginable amount of time and money to develop and test physical product prototypes. Now customers can design and test through simulation to accelerate development and analysis, improving product quality and reducing testing time across their organization.\"The ANSYS technology, developed with customers in mind, is a giant leap forward in the industrial sector,\" said Blake Moret, chairman and CEO at Rockwell Automation. \"Our collaboration will help us better serve customers, who can make better business decisions to save money and time because of their access to simulation-based digital twins in their manufacturing process.\"Digital simulation on the front end of production is just one way customers save time and money. Co-innovation between Rockwell Automation and ANSYS enables customers to benefit through the entire digital thread. Once a machine or production line is running, manufacturers can create a digital twin of their full manufacturing process to create and test virtual \"what-if\" scenarios. For example, by using runtime models generated from ANSYS® Twin Builder™, industrial companies can adapt to the market demands with more agility and minimize risk. This is crucial in the industrial space, where manufacturers need to change line configurations quickly to adjust to market demands. Now customers can understand an outcome without disrupting physical assets, resulting in faster time-to-market and large cost savings. \"ANSYS empowers customers across industries to develop innovative, next-generation products by using simulation throughout the product lifecycle,\" said Ajei Gopal, president and CEO at ANSYS. \"This partnership with Rockwell Automation is part of our open ecosystem philosophy, which gives our customers the ability to make the best business and technology decisions for their organizations. By combining Rockwell Automation's extensive expertise and portfolio of industrial solutions with ANSYS' leading-edge simulation solutions, we will make it easier for industrial companies to build, validate and deploy digital twins. Simulation-based digital twins optimize factory operations, saving money by reducing unplanned downtime and enable engineers to test solutions virtually before doing physical repairs.\"The partners believe in what these joint solutions can deliver. In fact, Rockwell Automation will accelerate its own internal new product and process development using ANSYS' engineering simulation software.  Rockwell Automation expects improved product quality and reduced testing time across the organization.ANSYS is the latest addition to the Digital Partner Program from Rockwell Automation announced earlier this week. The program grew out of market need and demand for solutions to simplify implementation and enhance quality of industrial digital transformation initiatives.About Rockwell AutomationRockwell Automation, Inc. (NYSE: ROK), the world's largest company dedicated to industrial automation and information, makes its customers more productive and the world more sustainable. Headquartered in Milwaukee, Wis., Rockwell Automation employs approximately 23,000 people, serving customers in more than 80 countries.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-T View original content to download multimedia:http://www.prnewswire.com/news-releases/rockwell-automation-and-ansys-announce-strategic-partnership-driving-quicker-time-to-market-and-operational-efficiency-for-customers-300961336.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "Autodesk And ANSYS Drive Seamless Engineering Workflow Interoperability To Speed New Product Innovation",
        "subtitle": "Collaboration eliminates engineering silos to significantly improve design efficiency",
        "date": "Nov 19, 2019 10:30AM EST",
        "content": "PITTSBURGH, Nov. 19, 2019 /PRNewswire/ -- Autodesk, Inc. and ANSYS (NASDAQ: ANSS) today announced the next step in a partnership that will allow seamless interoperability across ANSYS and Autodesk products to drive revolutionary design and engineering agility for our customers.The collaboration connects Autodesk® Fusion 360®, integrated design and manufacturing software, with world-class ANSYS® Mechanical™ simulation solutions to expedite products to market. The collaboration breaks down silos in the product development process by driving a best-in-breed, connected and interoperable designer-to-analyst workflow. As engineers leverage Fusion 360, their results are automatically available in ANSYS Mechanical for further refinement and validation. This open system workflow significantly improves efficiency in existing manual processes and can be combined to enhance new automated processes, like generative design, accelerating time to market and enabling multiple engineering teams to work effortlessly together.Companies across industries are aligning with powerful ecosystem partners, sharing complimentary capabilities to meet challenging product innovation requirements. This has created a tectonic shift in these companies' manufacturing processes, eliminating barriers between designers and analysts to simplify product development. As designers and analysts benefit from open and seamless workflow interoperability and utilize best-in-class engineering tools, companies are improving efficiency, cutting costs, fast-tracking innovation and speeding production.\"At Cornell University, we are educating and training the next generation of world-class engineers — our students will someday revolutionize industries,\" said Lance Collins, dean of engineering at Cornell University. \"We use both ANSYS and Autodesk solutions in our classrooms and are thrilled to see the two companies collaborating. Beyond discovering both products, our students will learn to use them together to achieve stronger results and – ultimately – innovate faster.\" This new announcement builds on a previously announced relationship between Autodesk and ANSYS to create a connected workflow for automotive companies that combines Autodesk's VRED automotive 3D visualization and virtual prototyping software with ANSYS' physics-based lighting simulation solutions. This enables automakers to enhance ultra-realistic visualizations of vehicle interiors and exteriors with highly accurate lighting simulation — significantly improving visual design review.\"Our relationship with ANSYS connects our two companies' complementary technologies and skills to strengthen our joint value proposition, drive expansion across more value chains and unlock tremendous value for customers,\" said Greg Fallon, vice president of business strategy and marketing at Autodesk. \"As designers utilize Fusion 360, their results are seamlessly processed with ANSYS' interoperable, state-of-the-art simulation solutions. This new way of distributing synergistic capabilities across the designer-to-analyst workflow pushes customers' manufacturing process boundaries — significantly advancing the innovation of next-generation products.\"\"Product ideation and quality is a team sport which can be hampered by engineering silos,\" said Shane Emswiler, senior vice president and general manager at ANSYS. \"This partnership with Autodesk dramatically improves workflows between our tools to benefit our joint customers. We look forward to helping designers and analysts deliver greatly improved product performance, enhance efficiency and increase sustainability.\" To learn more about how the partnership between ANSYS and Autodesk will transform education at Cornell University, click here.About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countriesANSS-T View original content to download multimedia:http://www.prnewswire.com/news-releases/autodesk-and-ansys-drive-seamless-engineering-workflow-interoperability-to-speed-new-product-innovation-300960925.htmlSOURCE  ANSYS, Inc."
    },
    {
        "title": "TSMC Recognizes ANSYS With Two Partner of the Year Awards",
        "subtitle": "ANSYS honored for Joint Development of 6nm Design Infrastructure and Joint Delivery of SoIC Design Solution",
        "date": "Nov 15, 2019 7:00AM EST",
        "content": "PITTSBURGH, Nov. 15, 2019 /PRNewswire/ -- TSMC presented ANSYS (NASDAQ: ANSS) with two Partner of the Year awards at the TSMC 2019 Open Innovation Platform® (OIP) Ecosystem Forum. ANSYS' multiphysics simulation solutions for TSMC's industry-leading FinFET process and advanced three-dimensional integrated circuit (3D-IC) packaging technologies enable customers to accelerate the development of artificial intelligence (AI), 5G, mobile, high-performance computing (HPC) and automotive applications. ANSYS secured awards in the categories of Joint Development of 6nm Design Infrastructure and Joint Delivery of SoIC Design Solution. ANSYS received the award for the Joint Development of 6nm Design Infrastructure for ANSYS' delivery of foundry-certified multiphysics simulation solutions for addressing power, thermal and reliability for semiconductor intellectual properties and systems-on-chips designed on TSMC N6 process technology. The award for the Joint Delivery of SoIC Design Solution recognizes ANSYS' chip-package co-simulation solutions for addressing power integrity, signal integrity, electromigration (EM) and thermal reliability for TSMC-SoIC®, TSMC's latest 3D-IC packaging technology.\"We're pleased with the result of our collaboration with ANSYS in its delivery of multiphysics simulation solutions on TSMC's advanced process and packaging technologies, addressing our customers' growing challenges across the chip, package, board and system to meet the complex design requirement for higher performance and longer battery life,\" said Suk Lee, TSMC senior director, design infrastructure management division. \"We look forward to continuing our collaboration with ANSYS to help our customers unleash their silicon innovations for the applications of AI, 5G, HPC and automotive.\" \"Leading semiconductor and system companies use ANSYS multiphysics simulation solutions to address power, thermal and reliability challenges to achieve electronics system reliability,\" said John Lee, general manager, semiconductor business unit at ANSYS. \"We're very proud of our winning partnership and earning two TSMC Partner of the Year Awards. We look forward to continuing to help our mutual customers build transformational products.\"About ANSYS, Inc. If you've ever seen a rocket launch, flown on an airplane, driven a car, used a computer, touched a mobile device, crossed a bridge or put on wearable technology, chances are you've used a product where ANSYS software played a critical role in its creation. ANSYS is the global leader in engineering simulation. Through our strategy of Pervasive Engineering Simulation, we help the world's most innovative companies deliver radically better products to their customers. By offering the best and broadest portfolio of engineering simulation software, we help them solve the most complex design challenges and create products limited only by imagination. Founded in 1970, ANSYS is headquartered south of Pittsburgh, Pennsylvania, U.S.A. Visit www.ansys.com for more information.ANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries. All other brand, product, service and feature names or trademarks are the property of their respective owners.ANSS-T  View original content to download multimedia:http://www.prnewswire.com/news-releases/tsmc-recognizes-ansys-with-two-partner-of-the-year-awards-300957710.htmlSOURCE  ANSYS, Inc."
    }
]