[
    {
        "title": "Thinking about buying stock in Aurora Cannabis Inc., ASML Holdings, Hexo Corp., PepsiCo Inc., or Qualcomm Inc.?",
        "subtitle": "",
        "date": "Apr 17, 2019 9:31AM EDT",
        "content": "NEW YORK, April 17, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, ASML, HEXO, PEP, and QCOM.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-inc-asml-holdings-hexo-corp-pepsico-inc-or-qualcomm-inc-300833802.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "ASML reports EUR 2.2 billion sales at 41.6% gross margin in Q1",
        "subtitle": "",
        "date": "Apr 17, 2019 1:00AM EDT",
        "content": "ASML reports EUR 2.2 billion sales at 41.6% gross margin in Q12019 view unchangedVELDHOVEN, the Netherlands, April 17, 2019 - ASML Holding N.V. ( ASML ) today publishes its 2019 first-quarter results.\n  \n\n  \n    \n      (Figures in millions of euros unless otherwise indicated)\n                  Q4 2018\n                  Q1 2019\n               Net sales \n                       3,143 \n                      \n                      2,229\n                      \n                   ...of which Installed Base Management sales 1\n                       719 \n                      \n                      540\n                      \n                   New lithography systems sold (units) \n                       58 \n                      \n                      43\n                      \n                   Used lithography systems sold (units) \n                       6 \n                      \n                      5\n                      \n                   Net bookings\n                       1,587 \n                      \n                      1,399\n                      \n                   Gross profit \n                       1,393 \n                      \n                      928\n                      \n                   Gross margin (%) \n                       44.3 \n                      \n                      41.6\n                      \n                   Net income \n                       788 \n                      \n                      355\n                      \n                   EPS (basic; in euros) \n                       1.87 \n                      \n                      0.84\n                      \n                   End-quarter cash and cash equivalents and short-term investments \n                       4,034 \n                      \n                      3,275\n                      \n                  \n  \n  (1) Installed Base Management sales equals our net service and field option sales.Numbers have been rounded for readers' convenience. A complete summary of US GAAP Consolidated Statements of Operations is published on www.asml.comCEO Statement\"Our first-quarter sales and gross margin came in slightly above guidance, supported by better than planned EUV system shipments and DUV profitability. The outlook for the remainder of the year remains unchanged, as we see accelerating growth through 2019 on the back of significant technology transitions, primarily in Logic. Our outlook is further underpinned by expected increasing Applications and Installed Base revenues.EUV systems are starting production of the first layers of the most advanced Logic nodes. Supporting these technology transitions is our higher productivity NXE:3400C EUV scanner - which we expect will also drive adoption in the DRAM memory segment.We reconfirm our previously disclosed longer-term outlook for 2020 and beyond, which remains based on our positive view on technology drivers such as 5G communications, automotive, artificial intelligence and data centers. In the short term, some volume demand uncertainties remain due to macro-economic developments,\" said ASML President and Chief Executive Officer Peter Wennink.Q1 2019 Product and Business HighlightsFor thin film head manufacturing, ASML is expected to enable the shrink roadmap with a special version of the XT:1460K scanner, for which the company recently received an order from a leading storage manufacturer.On 300 mm, we continue innovations in DUV to support future nodes and new applications. We will bring the DUV Dry products to the high performance NXT platform. We are on track to deliver the NXT:1470 mid next year. Due to our cost-effective DUV product portfolio, important market share wins were recently achieved in multiple regions.We are making progress on our E-beam products for improved defect inspection sensitivity required on future nodes. To improve E-beam system productivity, we are on track to deliver a multi-beam system this year for R&D, moving to commercial product shipment in 2020.In January, ASML announced the acquisition of the intellectual property assets of Mapper, a Delft-based high-tech company. In Q1 2019, approximately 100 former Mapper employees accepted job offers from ASML and are now working in projects for our Applications business - 80 employees in multi-beam and 20 in YieldStar.OutlookFor the second quarter of 2019, ASML expects net sales between EUR 2.5 billion and EUR 2.6 billion, and a gross margin between 41 percent and 42 percent. ASML also expects R&D costs of around EUR 485 million, and SG&A costs of around EUR 125 million. Our estimated annualized effective tax rate is around 11 percent for 2019.Update Share Buyback ProgramAs part of ASML's financial policy to return excess cash to shareholders through dividends and regularly timed share buybacks, in January 2018ASML announced its intention to purchase up to EUR 2.5 billion of shares to be executed within the 2018-2019 time frame. ASML intends to cancel these shares after repurchase, with the exception of up to 2.4 million shares, which will be used to cover employee share plans.Through March 31, 2019, ASML has acquired 7.4 million shares under this program for a total consideration of EUR 1.2 billion.The current program may be suspended, modified or discontinued at any time. All transactions under this program are published on ASML's website (www.asml.com/investors) on a weekly basis.\n  \n\n  \n    \n      Media Relations Contacts\n                  Investor Relations Contacts\n               Monique Mols, phone +31 6 5284 4418 \n                       Skip Miller, phone +1 480 235 0934 \n                   Lucas van Grinsven, phone +31 6 1019 9532 \n                       Marcel Kemp, phone +31 40 268 6494 \n                   Brittney Wolff Zatezalo, phone +1 408 483 3207 \n                       Craig DeYoung, phone +852 2295 1168 \n                  \n  \n  Quarterly Video Interview and Investor and Media Conference CallWith this press release, ASML has published a video interview in which CFO Roger Dassen discusses the Q1 2019 results, which can be viewed on www.asml.com.A conference call for investors and media will be hosted by CEO Peter Wennink and CFO Roger Dassen on April 17, 2019 at 15:00 Central European Time / 09:00 U.S. Eastern Time. To register for the call and receive dial-in information, go to www.asml.com/qresultscall. Listen-only access is also available via www.asml.com.About ASMLASML is one of the world's leading manufacturers of chip-making equipment. Our vision is a world in which semiconductor technology is everywhere and helps to tackle society's toughest challenges. We contribute to this goal by creating products and services that let chipmakers define the patterns that integrated circuits are made of. We continuously raise the capabilities of our products, enabling our customers to increase the value and reduce the cost of chips. By helping to make chips cheaper and more powerful, we help to make semiconductor technology more attractive for a larger range of products and services, which in turn enables progress in fields such as healthcare, energy, mobility and entertainment. ASML is a multinational company with offices in more than 60 cities in 16 countries, headquartered in Veldhoven, the Netherlands. We employ more than 23,800 people on payroll and flexible contracts (expressed in full time equivalents). ASML is traded on Euronext Amsterdam and NASDAQ under the symbol ASML. More information about ASML, our products and technology, and career opportunities is available on www.asml.com.US GAAP Financial ReportingASML's quarterly financial reporting is prepared in accordance with US GAAP, the accounting principles generally accepted in the United States of America. The consolidated balance sheets of ASML Holding N.V. as of March 31, 2019, the related consolidated statements of operations and consolidated statements of cash flows for the three months ended March 31, 2019 as presented in this press release are unaudited and available on www.asml.com.Regulated InformationThis press release contains inside information within the meaning of Article 7(1) of the EU Market Abuse Regulation.Forward Looking StatementsThis document contains statements relating to certain projections, business trends and other matters that are forward-looking, including statements with respect to expected trends and outlook, bookings, expected financial results and trends, including expected sales, EUV revenue, gross margin, R&D and SG&A expenses, and estimated annualized effective tax rate for the second quarter of 2019, and expected financial results and trends for the full year 2019, including the expectation for continued growth in sales in 2019, annual revenue opportunity in 2020 and annual revenue through 2025, outlook for 2020 and beyond, including ASML's positive view on technology drivers such as 5G communications, automotive, artificial intelligence and data centers, trends in DUV systems revenue and Holistic Lithography and installed based management and Applications revenues, expected industry trends and expected trends in the business environment, including expected short term volatility in the market due to macroeconomics, including added capacity in memory and new leading edge nodes in logic, drivers of long-term growth opportunity, statements with respect to the expected benefits of the introduction of the new DUV system and expected demand for such system, statements with respect to film head manufacturing, where ASML is expected to enable the shrink roadmap with a special version of the XT:1460K scanner, expected support of technology transitions through the higher productivity NXE:3400C, including its expected availability date and the expectation that such scanner will drive adoption in the DRAM memory segment, expected throughput of higher transmission optics and the expectation that this will deliver cost effective shrink for both Logic and DRAM, statements with respect to the continued DUV innovation, to support future nodes and new applications, including the expectation that DUV Dry products will be brought to the NTX platform and the expected timing of delivery of NXT:1470, the expected deliver of a multi-beam system in 2019 for R&D and expected timing of commercial product shipment of e-beam products , shrink being a key industry driver supporting innovation and providing long-term industry growth, Holistic Lithography enabling affordable shrink and delivering value to customers, DUV, EUV and Application products providing unique value drivers for ASML and its customers, the expected continuation of Moore's law and that EUV will continue to enable Moore's law and drive long term value for ASML well into the next decade, the intention to continue to return excess cash to shareholders through a combination of share buybacks and growing dividends in line with ASML's policy, and statements with respect to the proposed dividend for the 2019 Annual General Meeting of Shareholders and the share repurchase plan for 2018-2019, including the intention to use certain shares to cover employee share plans and cancel the rest of the shares upon repurchase. You can generally identify these statements by the use of words like \"may\", \"will\", \"could\", \"should\", \"project\", \"believe\", \"anticipate\", \"expect\", \"plan\", \"estimate\", \"forecast\", \"potential\", \"intend\", \"continue\", \"targets\", \"commits to secure\" and variations of these words or comparable words. These statements are not historical facts, but rather are based on current expectations, estimates, assumptions and projections about the business and our future financial results and readers should not place undue reliance on them. Forward-looking statements do not guarantee future performance and involve risks and uncertainties. These risks and uncertainties include, without limitation, economic conditions, product demand and semiconductor equipment industry capacity, worldwide demand and manufacturing capacity utilization for semiconductors, including the impact of general economic conditions on consumer confidence and demand for our customers' products, competitive products and pricing, the impact of any manufacturing efficiencies and capacity constraints, performance of our systems, the continuing success of technology advances and the related pace of new product development and customer acceptance of and demand for new products including EUV and DUV, the number and timing of EUV and DUV systems shipped and recognized in revenue, timing of EUV orders and the risk of order cancellation or push out, EUV production capacity, delays in EUV systems production and development and volume production by customers, including meeting development requirements for volume production, demand for EUV systems being sufficient to result in utilization of EUV facilities in which ASML has made significant investments, potential inability to successfully integrate acquired businesses to create value for our customers, our ability to enforce patents and protect intellectual property rights, the outcome of intellectual property litigation, availability of raw materials, critical manufacturing equipment and qualified employees, trade environment, changes in exchange rates, changes in tax rates, available cash and liquidity, our ability to refinance our indebtedness, distributable reserves for dividend payments and share repurchases, results of the share repurchase plan and other risks indicated in the risk factors included in ASML's Annual Report on Form 20-F and other filings with the US Securities and Exchange Commission. These forward-looking statements are made only as of the date of this document. We do not undertake to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.Attachments   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: ASML Netherlands BV"
    },
    {
        "title": "ASML reports transactions under its current share buyback program",
        "subtitle": "",
        "date": "Apr 15, 2019 8:00AM EDT",
        "content": "ASML reports transactions under its current share buyback programVELDHOVEN, the Netherlands - ASML Holding N.V. ( ASML ) reports the following transactions, conducted under ASML's current share buyback program.\n  \n\n  \n    \n      Date\n                  Total repurchased shares\n                  Weighted average price\n                  Total repurchased value\n              8-Apr-19\n                      7,000\n                      179.31\n                      1,255,144.90\n                  9-Apr-19\n                      7,000\n                      179.85\n                      1,258,942.12\n                  10-Apr-19\n                      7,750\n                      178.79\n                      1,385,602.72\n                  11-Apr-19\n                      8,216\n                      175.60\n                      1,442,732.18\n                  12-Apr-19\n                      7,750\n                      177.54\n                      1,375,911.80\n                  \n  \n  ASML's current share buyback program was announced on 17 January 2018, and details are available on our website at https://www.asml.com/investors/share-buyback/en/s25436This regular update of the transactions conducted under the buyback program is to be made public under the Market Abuse Regulation (Nr. 596/2014).\n  \n\n  \n    \n      Media Relations Contacts\n                  Investor Relations Contacts\n              Monique Mols, phone +31 6 528 444 18\n                      Skip Miller, phone +1 480 235 0934\n                  \n                      Marcel Kemp, phone +31 40 268 6494\n                  \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: ASML Netherlands BV"
    },
    {
        "title": "ASML disagrees with implication of “Chinese espionage”",
        "subtitle": "",
        "date": "Apr 11, 2019 7:55AM EDT",
        "content": "ASML disagrees with implication of \"Chinese espionage\"VELDHOVEN, the Netherlands, April 11, 2019 - ASML disagrees with any implication that it has been victim of \"Chinese espionage\", as stated in an article in Dutch financial newspaper Financieele Dagblad earlier on Thursday, 11 April 2019. The article discusses the results of a public court case in the United States that ASML had initiated and won last year, in which a company called XTAL was found by a jury to have misappropriated ASML's confidential and proprietary information and trade secrets in 2015.\"The suggestion that we were somehow victim of a national conspiracy is wrong. The facts of the matter are that we were robbed by a handful of our own employees based in Silicon Valley, who had broken the law to enrich themselves. All of this occurred several years ago. We found this out by ourselves and immediately sought legal action in public court in 2016. This was reported on in several publications after our victory in November 2018,\" said ASML President and Chief Executive Officer Peter Wennink.While still employed by ASML, these employees, with various nationalities, stole software for mask optimization, a specific small part of ASML's broad product and services portfolio. The aim was to create a competing product and sell it to an existing ASML customer in South Korea. The funding for this company XTAL originated from South Korea and China. The damage award by the Santa Clara Superior Court was 223 million dollars and based on \"unjust enrichment\" in connection with lost sales opportunities. It is unclear to what extent these damages can be collected from the now bankrupt company XTAL.ASML regrets it has been victim of this corporate theft and acted swiftly and decisively when it found out what happened. Although theft of corporate property has always existed across industries and will always be a risk, ASML has substantially increased its efforts to protect its assets even further in recent years.\"We resent any suggestion that this event should have any implication for ASML conducting business in China. Some of the individuals happened to be Chinese nationals, but individuals from other nations were also involved. We do protect our proprietary knowledge carefully and are very sensitive to information security. We believe we can serve all our customers, including our Chinese customers, and help them build their businesses. We are encouraged by the recent constructive talks and agreements between the European Union and China that China will step up its efforts to respect and protect corporate intellectual property of non-Chinese companies, including effective enforcement actions. We will be even more encouraged when we see these materialize in Chinese law and jurisprudence,\" Wennink said.\n  \n\n  \n    \n      ASML Media Relations Contacts\n                  ASML Investor Relations Contacts\n              Monique Mols, phone +31 6 528 444 18\n                      Skip Miller, phone +1 480 235 0934\n                  Lucas van Grinsven, phone +31 6 10 19 95 32\n                      Marcel Kemp, phone +31 40 268 6494\n                  Brittney Wolff Zatezalo, phone +1 408 483 3207\n                      Craig DeYoung, phone +852 2295 1168\n                  \n  \n  About ASMLASML is one of the world's leading manufacturers of chip-making equipment. Our vision is a world in which semiconductor technology is everywhere and helps to tackle society's toughest challenges. We contribute to this goal by creating products and services that let chipmakers define the patterns that integrated circuits are made of. We continuously raise the capabilities of our products, enabling our customers to increase the value and reduce the cost of chips. By helping to make chips cheaper and more powerful, we help to make semiconductor technology more attractive for a larger range of products and services, which in turn enables progress in fields such as healthcare, energy, mobility and entertainment. ASML is a multinational company with offices in more than 60 cities in 16 countries, headquartered in Veldhoven, the Netherlands. We employ more than 23,800 people on payroll and flexible contracts (expressed in full time equivalents). ASML is traded on Euronext Amsterdam and NASDAQ under the symbol ASML. More information about ASML, our products and technology, and career opportunities is available on www.asml.com.Attachment   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: ASML Netherlands BV"
    },
    {
        "title": "ASML reports transactions under its current share buyback program",
        "subtitle": "",
        "date": "Apr 8, 2019 8:00AM EDT",
        "content": "ASML reports transactions under its current share buyback programVELDHOVEN, the Netherlands - ASML Holding N.V. ( ASML ) reports the following transactions, conducted under ASML's current share buyback program.\n  \n\n  \n    \n      Date\n                  Total repurchased shares\n                  Weighted average price\n                  Total repurchased value\n              1-Apr-19\n                      6,500\n                      170.07\n                      1,105,444.36\n                  2-Apr-19\n                      6,500\n                      172.33\n                      1,120,147.84\n                  3-Apr-19\n                      6,500\n                      175.50\n                      1,140,765.90\n                  4-Apr-19\n                      5,727\n                      176.35\n                      1,009,952.52\n                  5-Apr-19\n                      5,000\n                      178.48\n                      892.379.58\n                  \n  \n  ASML's current share buyback program was announced on 17 January 2018, and details are available on our website at https://www.asml.com/investors/share-buyback/en/s25436This regular update of the transactions conducted under the buyback program is to be made public under the Market Abuse Regulation (Nr. 596/2014).\n  \n\n  \n    \n      Media Relations Contacts\n                  Investor Relations Contacts\n              Monique Mols, phone +31 6 528 444 18\n                      Skip Miller, phone +1 480 235 0934\n                  \n                      Marcel Kemp, phone +31 40 268 6494\n                  \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: ASML Netherlands BV"
    }
]