[
    {
        "title": "Broadcom Announces World’s First Wi-Fi 6E Chip for Mobile Devices",
        "subtitle": "",
        "date": "Feb 13, 2020 5:00AM EST",
        "content": "SAN JOSE, Calif., Feb.  13, 2020  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the world’s first Wi-Fi 6E client device, the BCM4389. Wi-Fi 6E extends the Wi-Fi 6 standard to support the soon-to-be-operational 6 GHz band with wider 160 MHz channel bandwidths that double Wi-Fi speeds and cut latency in half compared to Wi-Fi 5. The BCM4389 delivers over 2 Gbps of real-world speeds and up to five times better battery utilization, making it an ideal solution for flagship smartphones and future AR/VR devices. Wi-Fi 6E builds on the rich feature set of Wi-Fi 6, which includes improved performance in crowded environments, advanced roaming capabilities and increased security. This enhancement of Wi-Fi 6 uses new spectrum in the 6 GHz band to deliver multi-gigabit speeds while avoiding congestion with legacy devices. The BCM4389 expands on the accelerated deployment of Wi-Fi 6, delivering a steady, swift and secure consumer experience in tandem with over 150 million smartphones already in the market. With the additional innovations of Wi-Fi 6E, it unlocks high-speed bi-directional video applications and augmented reality. For more on Wi-Fi 6E and 6 GHz Wi-Fi, read our blog here.The BCM4389 also brings advanced multi-radio technology to Bluetooth. Inspired by sophisticated Wi-Fi communication techniques such as multiple-input multiple-output (MIMO) and beamforming, the BCM4389 improves audio performance and range for any connected Bluetooth accessory. Phones equipped with the BCM4389 will provide a seamless, “glitch-free” audio experience with popular Bluetooth headsets even in congested places such as subway stations. In yet another first, the BCM4389 utilizes Broadcom’s new tri-band simultaneous (TBS) connectivity architecture to mobile devices. In addition to two main Wi-Fi radios and a MIMO Bluetooth radio, the BCM4389 incorporates a third ultra-low-power independent radio for optimizing Wi-Fi and Bluetooth performance. The three-radio architecture:The BCM4389 will benefit from a full ecosystem of Wi-Fi 6E products, including home routers, residential gateways, enterprise access points, and AR/VR devices. The new 6 GHz spectrum band is expected to be operational in the United States in 2020, and a wide range of 6 GHz enabled devices will be available at launch.“At Broadcom, we pride ourselves in delivering technology that defines the market. The BCM4389, the world’s first Wi-Fi 6E mobile chip, is no exception since it paves the way for our wirelessly connected AR/VR future,” said Vijay Nagarajan, vice president of marketing for the Wireless Communications and Connectivity Division at Broadcom. “The BCM4389 delivers on the core advantages of the 6 GHz band, multi-gigabit wireless speeds and very low latency. It also represents a paradigm shift in wireless design thinking with technology that brings glitch-free audio experience with Bluetooth headsets, fast pairing with wireless accessories, accurate indoor location, high battery efficiency and other everyday consumer experiences.”“Wi-Fi 6E momentum is moving very quickly with regulatory changes expected and chipsets becoming available,” said Phil Solis, research director at IDC. “There are many video-related use cases that require shorter ranges that fit perfectly with the many large 160 MHz-wide channels that the 6 GHz spectrum band is capable of supporting.”PRODUCT HIGHLIGHTSThe BCM4389 is a smartphone combo chip. Key features include:QUOTES“Wi-Fi 6E will leverage up to 1200 MHz of new unlicensed spectrum that can provide seven uncongested, non-overlapping 160 MHz-wide channels or fifty 20 MHz-wide channels. The availability of such a large amount of contiguous greenfield spectrum makes it possible to deliver next-gen mobile applications that require high throughput, link reliability, and low latency in unlicensed bands. Extreme Networks is excited to work closely with Broadcom, and plans to be among the first vendors to deliver end-to-end, cloud-driven Wi-Fi 6E networking solutions for the enterprise.” -- Eric Broockman, CTO, Extreme Networks.“With the availability of up to 1.2GHz contiguous unlicensed spectrum in the 6GHz band, the enhanced benefits of Wi-Fi 6 will be fully realized. The addition of up to fifty 20MHz channels in the 6GHz band, which is uncongested and unencumbered by legacy technologies, will result in faster downloads and lower latency for mobile applications. This is essential as Wi-Fi continues to be the primary mechanism for accessing the internet at home, work, and in enterprises that want full control over their wireless data and infrastructures via AI-driven operations.” -- Bob Friday, CTO and Co-founder of Mist, a Juniper Company  “At NETGEAR, we lead with innovation to deliver the latest most advanced smart networking products to connect people, power businesses, and enhance the way we live. We look forward to continuing our long-standing partnership with Broadcom to deliver the fastest, most secure wireless experiences to NETGEAR customers worldwide by leveraging Wi-Fi 6E.” -- David Henry, Senior Vice President of Connected Home Products, NETGEARAbout BroadcomBroadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom.  The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:  Khanh LamCorporate Communicationspress.relations@broadcom.comTelephone: +1 408 433 8649"
    },
    {
        "title": "Broadcom Inc. to Announce First Quarter Fiscal Year 2020 Financial Results on Thursday, March 12, 2020",
        "subtitle": "",
        "date": "Feb 12, 2020 8:00AM EST",
        "content": "SAN JOSE, Calif., Feb. 12, 2020 /PRNewswire/ -- Broadcom Inc. (NASDAQ: AVGO), a global technology leader that designs, develops and supplies semiconductor and infrastructure software solutions, today announced it will report its first quarter fiscal year 2020 financial results and business outlook on Thursday, March 12, 2020 after the close of the market. Broadcom's management will host a conference call at 2:00 p.m. Pacific Time on the same day to discuss these results and business outlook.The conference call can be accessed live online in the Investors section of the Broadcom website at www.broadcom.com, or by telephone as follows:Dial-in: (866) 310-8712; International +1 (720) 634-2946Participant Passcode: 5272427A replay of the conference call will be accessible for one week following the call as follows:Replay: (855) 859-2056; International + 1 (404) 537-3406; Passcode: 5272427; or through the Investors section of the Broadcom website at www.broadcom.com.About Broadcom Inc.Broadcom Inc., (NASDAQ: AVGO), a Delaware corporation headquartered in San Jose, CA, is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom's category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Contact: Broadcom Inc.Beatrice F. RussottoInvestor Relations 408-433-8000investor.relations@broadcom.com View original content:http://www.prnewswire.com/news-releases/broadcom-inc-to-announce-first-quarter-fiscal-year-2020-financial-results-on-thursday-march-12-2020-301003246.htmlSOURCE  Broadcom Inc."
    },
    {
        "title": "Broadcom Announces Industry’s Most Comprehensive Portfolio of Wi-Fi 6E Access Point Solutions for 6 GHz WLAN",
        "subtitle": "",
        "date": "Jan 7, 2020 9:00AM EST",
        "content": "6 GHz capability unlocks the full potential of Wi-Fi 6 driving the next evolution of wireless communications and networkingSAN JOSE, Calif., Jan.  07, 2020  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the availability of a portfolio of Wi-Fi 6E devices. Wi-Fi 6E is a new standard that builds on the rich feature set of Wi-Fi 6, including OFDMA and other multi-user operations that improve performance in crowded environments, advanced roaming capabilities and increased security. Wi-Fi 6E extends the Wi-Fi 6 standard to support the soon-to-be-operational 6 GHz band. This new band enables up to 1,200 MHz of spectrum for Wi-Fi use, which WLAN access point (AP) manufacturers can leverage to deliver faster speeds, higher capacity and lower latency with no congestion from legacy devices.These devices coupled with the new spectrum will further accelerate the deployment of Wi-Fi 6 technology delivering a steady, swift and secure consumer experience. This expands upon the existing Wi-Fi 6 ecosystem which has over 125 million smartphones. The innovations of Wi-Fi 6E open up unprecedented capacity for high-bandwidth applications such as 8K video streaming, real-time immersive gaming, virtual and augmented reality, and high-speed tethering. The new 6 GHz spectrum band is expected to be operational in the United States in 2020, and a wide ecosystem of 6 GHz-enabled devices will be available at launch. For more on Wi-Fi 6E and 6 GHz Wi-Fi, read our blog here.Enterprise 6 GHz Wi-Fi AP SolutionsResidential 6 GHz Wi-Fi AP Solutions\"As momentum accelerates around availability of 6 GHz, Broadcom is excited to be on the forefront of Wi-Fi technology paving the way for ecosystem adoption of Wi-Fi 6E. With the industry's broadest portfolio of Wi-Fi 6E silicon, we will enable our customers to build a variety of products that unlock the tremendous potential of 6 GHz spectrum. This announcement demonstrates Broadcom’s continued leadership and unwavering commitment in driving the next Wi-Fi evolution for enterprise and residential WLAN as well as mobile devices,” said Greg Fischer, senior vice president and general manager of the Broadband Carrier Access Products Division at Broadcom.\"With access to additional spectrum and unencumbered by legacy Wi-Fi 4 and Wi-Fi 5 devices, Wi-Fi 6E will be able to reach its full potential in terms of data rates, latency, and network efficiency,\" said Phil Solis, research director at IDC. \"Building on Wi-Fi 6's use of OFDMA and other advanced features, Wi-Fi 6E will allow Wi-Fi to expand into new applications.\"Broadcom will showcase its latest Wi-Fi 6E solutions with 160-MHz channel support at the 2020 International CES in the Venetian Palazzo Hospitality Suites, Zeno 4606/4607 in Las Vegas, Nevada from January 7th to 10th.AvailabilityBroadcom is now sampling its Wi-Fi 6E devices to qualified customers. Please contact your local Broadcom sales representative for samples and pricing.Further information on Broadcom’s Wi-Fi 6E products can be found online at:https://www.broadcom.com/products/wireless/wireless-lan-infrastructureQuotes“Wi-Fi 6E allows the immediate use of promised efficiencies of Wi-Fi 6, providing a spectrum platform for the next phase of lower latency and deterministic Wi-Fi services. As well as seeding a new high-speed generation of laptops and tablets, we see applications emerging quickly around Wi-Fi 6E wireless mesh, high-quality video distribution to 8K and VR requirements as well as the ability to enable deterministic low latency connections for new timing sensitive services.” -- Charles Cheevers, CTO, Home Networks, CommScope“Wi-Fi 6 is already delivering many improvements versus prior Wi-Fi generations. Clean, uncluttered spectrum in the 6-GHz band will enable a new paradigm in wireless, creating a Wi-Fi ‘Super Highway’ that further increases density and dramatically increases Wi-Fi 6 network performance with the availability of more than fifty 20-MHz channels, as well as new 80-MHz and 160-MHz-wide channels. Broadcom is leading the industry in developing Wi-Fi 6E solutions to take advantage of this new spectrum, which will allow enterprises across industries to unlock new and yet-to-be imagined digitally immersive experiences and conveniences that truly advance society.” -- Eric Broockman, CTO, Extreme Networks\"With the addition of 1.2GHz contiguous spectrum in the 6GHz band the enhanced benefits of Wi-Fi 6 will be realized, including faster downloads and lower latency for mobile applications. This is essential as Wi-Fi continues to be the primary mechanism for accessing the internet at home, work, and in enterprises that want full control over their wireless data and infrastructures via AI-driven operations.” -- Bob Friday, CTO and Co-founder of Mist, a Juniper Company\"NETGEAR is excited to partner with Broadcom to build a portfolio of Wi-Fi 6E enabled products. The new spectrum will accelerate the adoption of 160 MHz transmissions which in turn will unlock a whole host of applications that will require high throughput and low latency.” -- David Henry, Senior Vice President of Connected Home Products, NETGEAR“Sagemcom has been proactively working with Broadcom to design and develop a portfolio of broadband CPE products that provide the full benefits of Wi-Fi 6E. The massive amount of additional spectrum coupled with 160 MHz channels will enable users to experience faster connections, in addition to lower latency for applications such as gaming, video conferencing and virtual reality. With our 6 GHz enabled DSL, fiber, and cable gateways coupled with our Wi-Fi 6E range extenders, service providers are able to deliver the full potential of their broadband services.” -- Ahmed Selmani, Senior Executive Vice President, Sagemcom Broadband“Technicolor Connected Home is already working with network service providers (NSPs) to develop innovative customer premises equipment (CPE) based on Broadcom’s high-end residential chipsets. This will be of great benefit to NSPs that need to offer connected home customers the best in-home wireless experience. The BCM43684 and BCM6755 SoCs are embedded into Eagle, our latest family of extenders. Eagle X -- the premium version of this family -- will be demonstrated at CES 2020 as part of our Wi-Fi XLTM solution. This will enable NSPs to tap into the full potential of the new 6Ghz spectrum and deliver improved connectivity as well as entertainment experiences. Over the course of 2020, the BCM43684 will also be embedded in our next generation of fiber ethernet gateways. Technicolor Connected Home’s demonstrations are located at the Venetian Hotel in exhibit suites 30-315 and 30-317.” -- Mercedes Pastor, President of Global CPE Business Unit, Technicolor Connected Home About BroadcomBroadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:  Khanh LamCorporate Communicationspress.relations@broadcom.comTelephone: +1 408 433 8649"
    },
    {
        "title": "Broadcom Inc. Announces Fourth Quarter and Fiscal Year 2019 Financial Results and Quarterly Dividends",
        "subtitle": "-- Revenue of $5,776 million for the fourth quarter, up 6 percent from the prior year period",
        "date": "Dec 12, 2019 4:15PM EST",
        "content": "SAN JOSE, Calif., Dec. 12, 2019 /PRNewswire/ -- Broadcom Inc. (Nasdaq: AVGO), a global technology leader that designs, develops and supplies semiconductor and infrastructure software solutions, today reported financial results for its fourth fiscal quarter and fiscal year ended November 3, 2019, provided guidance for its fiscal year 2020 and announced quarterly dividends. The Company completed its acquisition of the Symantec Enterprise Security business on November 4, 2019. The financial results provided below do not include any contribution from the Symantec Enterprise Security business.\"Fiscal year 2019 concluded as expected. Our semiconductor solutions segment continued to work its way through a cyclical correction. This was more than offset by our infrastructure software segment, which delivered healthy results benefitting from the integration and performance of our CA business,\" said Hock Tan, President and CEO of Broadcom Inc. \"Looking to fiscal 2020, we remain well-positioned across our technology franchises. We continue to believe that our core semiconductor business is bottoming and will return to year over year growth in the second half of our fiscal year. In addition, we expect to benefit from the integration of the Symantec Enterprise Security business into what is otherwise expected to be a stable infrastructure software segment in fiscal 2020.\"\"We achieved record profitability in fiscal 2019, including free cash flow of over $9 billion, despite a challenging market backdrop for our semiconductor solutions segment. As a result, we are raising our target dividend by 23 percent to $3.25 per share per quarter for fiscal year 2020,\" said Tom Krause, CFO of Broadcom Inc. \"Looking ahead to next year, we expect our adjusted EBITDA to expand by more than $1 billion, while we focus our capital returns on cash dividends, with excess cash going towards debt pay down.\"Fourth Quarter Fiscal Year 2019 GAAP Results from Continuing OperationsNet revenue was $5,776 million, 4.7 percent higher than $5,515 million in the previous quarter and 6.1 percent higher than $5,444 million in the same quarter last year.Gross margin was $3,152 million, or 54.6 percent of net revenue. This compares with gross margin of $3,034 million, or 55.0 percent of net revenue, in the prior quarter, and gross margin of $2,935 million, or 53.9 percent of net revenue, in the same quarter last year.Operating expenses were $2,098 million. This compares with $2,169 million in the prior quarter and $1,283 million in the same quarter last year.Operating income was $1,054 million, or 18.2 percent of net revenue. This compares with operating income of $865 million, or 15.7 percent of net revenue, in the prior quarter, and operating income of $1,652 million, or 30.3 percent of net revenue, in the same quarter last year.Net income was $847 million, or $1.97 per diluted share. This compares with net income of $715 million, or $1.71 per diluted share, in the prior quarter, and net income of $1,115 million, or $2.64 per diluted share, in the same quarter last year.Cash from operations was $2,479 million in the quarter. This compares with $2,419 million in the prior quarter and $2,635 million in the same quarter last year.The Company's cash and cash equivalents at the end of the fourth fiscal quarter were $5,055 million, compared to $5,462 million at the end of the prior quarter.During the fourth fiscal quarter, the Company generated $2,479 million in cash from operations and spent $587 million on share repurchases and eliminations, consisting of $433 million in repurchases of 1.5 million shares and $154 million of withholding tax payments related to net settled equity awards that vested in the quarter (representing approximately 0.5 million shares withheld), as well as $96 million on capital expenditures.On October 1, 2019, the Company paid a cash dividend of $2.65 per share of common stock, totaling $1,054 million.Fourth Quarter Fiscal Year 2019 Non-GAAP Results From Continuing OperationsThe differences between the Company's GAAP and non-GAAP results are described generally under \"Non-GAAP Financial Measures\" below, and presented in detail in the financial reconciliation tables attached to this release.Gross margin was $4,035 million, or 69.9 percent of net revenue. This compares with gross margin of $3,916 million, or 71.0 percent of net revenue, in the prior quarter, and $3,725 million, or 68.4 percent of net revenue, in the same quarter last year.Operating income was $3,018 million, or 52.3 percent of net revenue. This compares with operating income of $2,910 million, or 52.8 percent of net revenue, in the prior quarter, and $2,862 million, or 52.5 percent of net revenue, in the same quarter last year.Net income was $2,391 million, or $5.39 per diluted share. This compares with net income of $2,281 million, or $5.16 per diluted share, in the prior quarter, and net income of $2,546 million, or $5.85 per diluted share, in the same quarter last year.Free cash flow from operations, defined as cash from operations less capital expenditures, was $2,383 million in the quarter. This compares with $2,307 million in the prior quarter and $2,529 million in the same quarter last year. Other Quarterly DataFiscal Year 2019 Financial Results from Continuing OperationsNet revenue from continuing operations was $22,597 million, an increase of 8.4 percent from $20,848 million in the prior year. Gross margin was $12,483 million, or 55.2 percent of net revenue, versus $10,733 million, or 51.5 percent of net revenue, in the prior year. Operating income was $3,444 million, or 15.2 percent of net revenue, versus $5,135 million, or 24.6 percent of net revenue, in the prior year. Net income, which includes the impact from discontinued operations, was $2,724 million, or $6.43 per diluted share. This compares with a net income of $12,610 million, or $28.44 per diluted share, in fiscal year 2018. Cash from operations was $9,697 million, compared to $8,880 million in the prior year. Non-GAAP gross margin was $16,055 million, or 71.0 percent of net revenue, versus $13,931 million, or 66.8 percent of net revenue, in the prior year. Non-GAAP operating income from continuing operations was $11,929 million. This compares with $10,424 million in the prior year. Non-GAAP net income was $9,452 million, or $21.29 per diluted share. This compares with non-GAAP net income of $9,391 million, or $20.82 per diluted share, in fiscal year 2018. Free cash flow from operations, defined as cash from operations less capital expenditures, was $9,265 million compared to $8,245 million in the prior year. Fiscal Year 2020 Business OutlookBased on current business trends and conditions, the outlook for continuing operations for fiscal year 2020, ending November 1, 2020, including contributions from the Symantec Enterprise Security business, is expected to be as follows:  The guidance provided above is only an estimate of what the Company believes is realizable as of the date of this release. The Company is not readily able to provide a reconciliation of projected Adjusted EBITDA to projected net income without unreasonable effort. Actual results will vary from the guidance and the variations may be material. The Company undertakes no intent or obligation to publicly update or revise any of these projections, whether as a result of new information, future events or otherwise, except as required by law.Quarterly DividendsThe Company's Board of Directors has approved a quarterly cash dividend on its common stock of $3.25 per share. The common stock dividend is payable on December 31, 2019 to common stockholders of record at the close of business (5:00 p.m. Eastern Time) on December 23, 2019.The Company's Board of Directors also approved a quarterly cash dividend on its 8.00% Mandatory Convertible Preferred Stock, Series A, of $20.00 per share. This dividend is payable on December 31, 2019 to preferred stockholders of record at the close of business (5:00 p.m. Eastern Time) on December 15, 2019. Financial Results Conference CallBroadcom Inc. will host a conference call to review its financial results for the fourth fiscal quarter and fiscal year ended November 3, 2019, and discuss guidance for fiscal year 2020, today at 2:00 p.m. Pacific Time. Those wishing to access the call should dial (866) 310-8712; International +1 (720) 634-2946. The passcode is 8988706. A replay of the call will be accessible for one week after the call. To access the replay dial (855) 859-2056; International +1 (404) 537-3406; and reference the passcode: 8988706. A webcast of the conference call will also be available in the \"Investors\" section of Broadcom's website at www.broadcom.com.Basis of PresentationThe Company's financial results include contributions from CA, Inc.'s continuing operations starting in the first quarter of fiscal year 2019. The financial results from businesses that have been classified as discontinued operations in the Company's financial statements are not included in the results presented above, unless otherwise stated.Due to the Company's 52/53 week reporting cycle, fiscal year 2018 included an extra week in the first quarter, compared to fiscal year 2019.Non-GAAP Financial MeasuresIn addition to GAAP reporting, Broadcom provides investors with net revenue, net income, operating income, gross margin, operating expenses, cash flow and other data on a non-GAAP basis. This non-GAAP information includes the effect, where applicable, of purchase accounting on revenue, and excludes amortization of acquisition-related intangible assets, stock-based compensation expense, restructuring, impairment and disposal charges, acquisition-related costs, including integration costs, purchase accounting effect on inventory, litigation settlements, impairment on investment, debt-related costs, gains on investments, income (loss) from discontinued operations and non-GAAP tax reconciling adjustments. Management does not believe that these items are reflective of the Company's underlying performance. Internally, these non-GAAP measures are significant measures used by management for purposes of evaluating the core operating performance of the Company, establishing internal budgets, calculating return on investment for development programs and growth initiatives, comparing performance with internal forecasts and targeted business models, strategic planning, evaluating and valuing potential acquisition candidates and how their operations compare to the Company's operations, and benchmarking performance externally against the Company's competitors. The exclusion of these and other similar items from Broadcom's non-GAAP financial results should not be interpreted as implying that these items are non-recurring, infrequent or unusual. Free cash flow measures have limitations as they omit certain components of the overall cash flow statement and do not represent the residual cash flow available for discretionary expenditures. Investors should not consider presentation of free cash flow measures as implying that stockholders have any right to such cash. Broadcom's free cash flow may not be calculated in a manner comparable to similarly named measures used by other companies.Broadcom believes this non-GAAP financial information provides additional insight into the Company's on-going performance. Therefore, Broadcom provides this information to investors for a more consistent basis of comparison and to help them evaluate the results of the Company's on-going operations and enable more meaningful period to period comparisons. These non-GAAP measures are provided in addition to, and not as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial data is included in the supplemental financial data attached to this press release.About Broadcom Inc.Broadcom Inc., (NASDAQ: AVGO), a Delaware corporation headquartered in San Jose, CA, is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom's category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Cautionary Note Regarding Forward-Looking StatementsThis announcement contains forward-looking statements (including within the meaning of Section 21E of the United States Securities Exchange Act of 1934, as amended, and Section 27A of the United States Securities Act of 1933, as amended) concerning Broadcom. These statements include, but are not limited to, statements that address our expected future business and financial performance and other statements identified by words such as \"will\", \"expect\", \"believe\", \"anticipate\", \"estimate\", \"should\", \"intend\", \"plan\", \"potential\", \"predict\" \"project\", \"aim\", and similar words, phrases or expressions. These forward-looking statements are based on current expectations and beliefs of the management of Broadcom, as well as assumptions made by, and information currently available to, such management, current market trends and market conditions and involve risks and uncertainties, many of which are outside the Company's and management's control, and which may cause actual results to differ materially from those contained in forward-looking statements. Accordingly, you should not place undue reliance on such statements.Particular uncertainties that could materially affect future results include risks associated with: our acquisition of Symantec Corporation's Enterprise Security business (\"Symantec Business\"), including (1) potential difficulties in employee retention, (2) unexpected costs, charges or expenses, and (3) our ability to successfully integrate the Symantec Business and achieve the anticipated benefits of the transaction; any loss of our significant customers and fluctuations in the timing and volume of significant customer demand; our dependence on contract manufacturing and outsourced supply chain; our dependency on a limited number of suppliers; global economic conditions and concerns; international political and economic conditions; any acquisitions we may make, such as delays, challenges and expenses associated with receiving governmental and regulatory approvals and satisfying other closing conditions, and with integrating acquired businesses with our existing businesses and our ability to achieve the benefits, growth prospects and synergies expected by such acquisitions, including our recent acquisition of the Symantec Business; government regulations and trade restrictions; our significant indebtedness and the need to generate sufficient cash flows to service and repay such debt; dependence on and risks associated with distributors and resellers of our products; dependence on senior management and our ability to attract and retain qualified personnel; involvement in legal or administrative proceedings; quarterly and annual fluctuations in operating results; our ability to accurately estimate customers' demand and adjust our manufacturing and supply chain accordingly; cyclicality in the semiconductor industry or in our target markets; our competitive performance and ability to continue achieving design wins with our customers, as well as the timing of any design wins; prolonged disruptions of our or our contract manufacturers' manufacturing facilities or other significant operations; our ability to improve our manufacturing efficiency and quality; our dependence on outsourced service providers for certain key business services and their ability to execute to our requirements; our ability to maintain or improve gross margin; our ability to protect our intellectual property and the unpredictability of any associated litigation expenses; compatibility of our software products with operating environments, platforms or third-party products; our ability to enter into satisfactory software license agreements; sales to our government clients; availability of third party software used in our products; use of open source code sources in our products; any expenses or reputational damage associated with resolving customer product warranty and indemnification claims; market acceptance of the end products into which our products are designed; our ability to sell to new types of customers and to keep pace with technological advances; our compliance with privacy and data security laws; our ability to protect against a breach of security systems; changes in accounting standards; fluctuations in foreign exchange rates; our provision for income taxes and overall cash tax costs, legislation that may impact our overall cash tax costs and our ability to maintain tax concessions in certain jurisdictions; and other events and trends on a national, regional and global scale, including those of a political, economic, business, competitive and regulatory nature.Our filings with the SEC, which you may obtain for free at the SEC's website at http://www.sec.gov, discuss some of the important risk factors that may affect our business, results of operations and financial condition. Actual results may vary from the estimates provided. We undertake no intent or obligation to publicly update or revise any of the estimates and other forward-looking statements made in this announcement, whether as a result of new information, future events or otherwise, except as required by law.Contact:Broadcom Inc.Beatrice F. RussottoInvestor Relations408-433-8000investor.relations@broadcom.com          View original content:http://www.prnewswire.com/news-releases/broadcom-inc-announces-fourth-quarter-and-fiscal-year-2019-financial-results-and-quarterly-dividends-300974326.htmlSOURCE  Broadcom Inc."
    },
    {
        "title": "Broadcom Unveils Automation.ai, the Industry’s First AI-driven Platform that Accelerates Digital Business Decision-Making and Execution",
        "subtitle": "",
        "date": "Dec 10, 2019 11:00AM EST",
        "content": "LAS VEGAS, Dec.  10, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the availability of Automation.ai, the industry’s first AI-driven software intelligence platform purpose built to accelerate decision-making across multiple business and technology domains that support digital transformation initiatives.As enterprises dramatically increase digital investments, they must contend with increasing complexity and overwhelming volumes of data that slow even simple decision-making. Automation.ai correlates and analyzes this data and powers Digital BizOps from Broadcom, a new solution that uses these AI-driven insights to deliver intelligent recommendations—across business and development and operations to transform customer experience, increase employee productivity, improve operational efficiency and speed innovation.“Digital transformation creates strain and pressure on businesses who need to move more quickly and confidently through the constant change rippling through their organizations,” said Ashok Reddy, senior vice president and general manager, Enterprise Software Division, Broadcom. “Silos of teams, tools and data impede decision-making. Automation.ai is central to Broadcom’s strategy to leverage AI and automation to create collective intelligence that speeds the informed decision-making critical to achieving digital business success.”According to the Gartner Market Guide for AIOps Platforms, “Non-IT groups like line-of-business owners and teams that sit outside IT operations— such as application developers and DevOps— are increasingly showing interest in AIOps technologies to surface insights across a multitude of datasets.”1“At Sun Life, we put the client at the center of all we do,” said Barbara Mitchell, assistant vice president, IT Operations, Sun Life Financial, Inc. “As we continue on our digital transformation journey, we are always looking for new ways to harness the power of data. Our partnership with Broadcom will help us take that data and turn it into predictive insights to prevent outages that impact our client experience.”Automation.ai harnesses the power of advanced machine learning (ML), intelligent automation and internet-scale open source frameworks to transform massive volumes of data from disparate toolsets, providing a unified approach to enterprise decision-making such as:AIOps from Broadcom leverages Automation.ai to correlate and analyze a broad range of IT monitoring data sources, and acts as a trusted proof point for the IT Operations analytics offered in Broadcom’s Digital BizOps solution. AIOps from Broadcom now includes new intelligent recommendations and auto-remediation capabilities that help IT teams predict and prevent problems before they impact user experience. New capabilities include:In related news, Broadcom recently completed the acquisition of privately-held Terma Software, whose solutions model workload dependencies, optimize workloads, enable intelligent SLAs and improve overall operational efficiency, in real-time. This acquisition will enrich the Automation.ai platform by providing new sources of workload intelligence and analytics to produce actionable insights from multiple vendors.For more information on Broadcom product offerings visit booth 359 at the Gartner IT Infrastructure, Operations & Cloud Strategies Conference, taking place in Las Vegas, Nevada, December 9-12 or visit www.automation.ai.About Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.About Gartner IT Infrastructure, Operations & Cloud Strategies ConferenceThe Gartner IT Infrastructure, Operations & Cloud Strategies Conference 2019 provides a clear strategic direction and actionable tactics to drive infrastructure and operations change in the enterprise. Follow news from the Conference at #GartnerIO.Broadcom, the pulse logo, Automation.ai, Automic and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.[1] Gartner, Market Guide for AIOps Platforms, Charley Rich, Pankaj Prasad, Sanjit Ganguli, 7 November 2019Press Contact:Jon PiazzaBroadcom Inc.press.relations@broadcom.com408-433-7924 "
    },
    {
        "title": "Broadcom Ships Tomahawk 4, Industry’s Highest Bandwidth Ethernet Switch Chip at 25.6 Terabits per Second",
        "subtitle": "",
        "date": "Dec 9, 2019 11:00AM EST",
        "content": "SAN JOSE, Calif., Dec.  09, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ:AVGO) announced today that it has delivered the StrataXGS® Tomahawk® 4 switch series, demonstrating an unprecedented 25.6 Terabits/sec of Ethernet switching performance in a single device— double the bandwidth of any other switch silicon available in the market today.Delivered in less than two years after the previous 12.8Tbps product generation, Tomahawk 4 is implemented in 7nm technology with 512 50G PAM4 SerDes.  Tomahawk 4’s high level of integration and highly efficient architecture delivers up to 75 percent lower power and cost compared to alternative solutions.The growth of hyperscale cloud networks continues its unrelenting upward trend, with bandwidth increasing by 25 percent and storage by 36 percent year-over-year[1].  Workloads for deep learning, using massively distributed neural networks and alternative computing nodes, require a dramatic increase in bandwidth with dense 100/200/400GbE links spanning high-radix, ultra-low-latency network topologies.The continued trend towards disaggregated, high-density flash storage is concurrently demanding step functions in network throughput and reduced end-to-end access times. With its market-leading switching performance, high 100/200/400GbE port density, and rich feature set optimized for cloud use cases, Broadcom’s Tomahawk 4 is ideally suited to serve as the backbone for the next generation of hyperscale data center networks.“The Tomahawk franchise is the flagship for cutting-edge, single-chip performance and integration among Broadcom’s multi-vectored Ethernet switch silicon portfolio, tailored to the unique and rigorous demands of hyperscale data center operators,” said Ram Velaga, senior vice president and general manager, Core Switching Group, Broadcom. “We are proud of our world-class engineering team for innovating and delivering the 25.6Tbps Tomahawk 4 chip in less than two years after we released Tomahawk 3.  Broadcom is proving yet again that customers can rely on us to lead the industry on switch silicon performance and execution at every generation.”“Tomahawk 4 is an engineering tour de force, packing an unprecedented number of serdes into a monolithic 7nm chip,” said Bob Wheeler, principal analyst, The Linley Group. “As a result, Broadcom is once again first in delivering the next switch density, which hyperscalers need as they deploy 400G Ethernet.”Tomahawk 4 accelerates the adoption of 100/200/400GbE Ethernet solutions at a point where optics utilizing 50G PAM4 electrical connectivity are shipping in high volumes.  Products from Broadcom’s Optical Systems Division, which offers a suite of optical interconnect solutions supporting 50G PAM4 and 100G PAM4 optical data rates, complement Broadcom’s switch chips. The combination of switches and pluggable optics from Broadcom provides a complete system-level solution with plug-and-play functionality.StrataXGS Tomahawk 4 Series Key Benefits:Broadcom also announced the introduction of Broadcom Open Network Switch APIs (OpenNSA), opening its SDK APIs for StrataXGS and StrataDNX products. Multiple open source network operating system initiatives are underway in the disaggregation ecosystem, focused on hyperscale and service provider markets. OpenNSA enables these initiatives on merchant silicon and allows the larger community to build on top of these efforts. OpenNSA also expands Open Compute Project efforts, like Switch Abstraction Interface (SAI), by simplifying the process of translating SAI APIs to Broadcom SDK APIs. Moreover, OpenNSA accelerates the SDN ecosystem by enhancing the toolset available for the developer community.Industry Quotes: Yiqun Cai, Vice President of Network, Alibaba Cloud Intelligence“Alibaba Cloud has worked closely with Broadcom on Tomahawk 4 products. With Broadcom’s Tomahawk 4, Alibaba Cloud is able to accelerate the adoption of 100/200/400GbE Ethernet solutions and provide faster and better solutions to our customers.”Amin Vahdat, Fellow and Vice President, Systems Infrastructure, Google Cloud“We are excited to collaborate with Broadcom to bring the Tomahawk switch series to market to support the scaling requirements of modern data center networks.\"Yuval Bachar, Principal Hardware Architect, Azure Platforms, Microsoft“With the exponential growth of network capacities and high-volume deployments of 100G and 400G the 25.6T Tomahawk 4 will be a major building block for that evolution. Broadcom has demonstrated with its sampling of Tomahawk 4, yet again, the leadership in delivering the cutting-edge technology for networking, with a focus on end-user requirements optimization, feature set optimization, and integration in a single chip as a base building block for the next wave of data center build-outs. The enhanced forwarding, load balancing, buffering, and congestion control capabilities will address essential needs for hyperscale workloads and will enable the next generation of platforms and networks to be built.”Wen Temitim, Chief Technology Officer, StackPath“The build-out of the intelligent edge is underway, and StackPath is thrilled to see the availability of Tomahawk 4. With the edge being premium, but limited real estate, Tomahawk 4's monolithic design is the best architecture for power, performance, and economics. The doubling of bandwidth is a significant advancement in the industry, and we are excited to take advantage of Broadcom's latest innovations.”Wade Shao, Deputy Director, Network Architecture Center, Tencent“Tencent applauds Broadcom for achieving yet another industry first with the release of the Tomahawk 4 25.6Tbps. Broadcom’s consistent engineering execution to their Ethernet switch roadmap has enabled Tencent to continuously upgrade our network infrastructure, while achieving economies of scale thanks to the broad ecosystem enabled by Broadcom's merchant silicon strategy.\"Jason Black, Head of Global Network Infrastructure, Uber“At Uber, we have been deploying leading-edge Ethernet speeds and feeds to guarantee the highest possible network performance for the best end-user experience. Broadcom's StrataXGS Tomahawk product line has been a key technology component in our worldwide data center design. With the arrival of Tomahawk 4 25.6Tbps, it ushers in the era of 400GbE leaf-spine CLOS deployment, and enables Uber to support ever-increasing workloads for autonomous vehicle, SaaS, and big data applications.”John McCool, Chief Platform Officer, Arista Networks“The Arista 7060X and 7368X4 Series running EOS® provide a broad range of solutions for Mega-Scale Cloud datacenter environments, powered by multiple generations of the Broadcom Tomahawk architecture. Tomahawk 4 delivers an impressive 25.6T of bandwidth in a high-radix, power efficient design. These innovations enable tomorrow’s Cloud datacenter architectures that collapse network layers, provide improved host-to-host performance, while reducing the complexity of the network.”  Tom Burns, SVP and GM, Dell EMC Networking and Solutions“Broadcom is making important, impressive advancements with Tomahawk 4 that enhance our PowerSwitch open networking capabilities. The advanced shared buffer architecture enables high bandwidth scale-out networking infrastructure with low port-to-port latency for deep learning and hyperscale environments. The new telemetry features will enable a much needed and highly transparent physical layer, supporting our vision of the autonomous data center.”Anand Athreya, EVP and Chief Development Officer, Juniper Networks “Juniper is excited to partner with Broadcom and double the capacity of DC platforms with Tomahawk 4. Broadcom’s sustained execution allows Juniper to keep providing an extensive routing and switching portfolio, one that combines best-of-breed silicon technology with JunOS, the industry’s most advanced network operating system, and addresses the leading-edge requirements of our customers.”Liu Zhongdong, President and CEO, Ruijie Networks.“Ruijie is dedicated to providing a broad portfolio of advanced networking equipment to our Cloud customers. With Tomahawk 4’s bandwidth doubling existing switch silicon, and rich cloud-optimized feature set, including best-in-class instrumentation, we will be able to provide our customers with the capabilities demanded by next-generation Cloud networks.”Edgar Masri, CEO, Accton Technology Corporation“Tomahawk 4, 25.6Tbps, is an exciting achievement for Broadcom as many of our hyperscale customers are upgrading their network infrastructure to support their ever-increasing application demands. At Accton Group, we have collaborated closely with Broadcom on a rich portfolio of networking platforms, and we look forward to offering this new wave of Tomahawk 4-based solutions in the very near future.”Allen Cheng, General Manager, Alpha Networks Inc.“Alpha has been working with Broadcom's StrataXGS product family for several generations. We congratulate Broadcom for being first-to-market with Tomahawk 4, and we look forward to offering a new portfolio of platforms based on this groundbreaking 25.6 Terabit switching ASIC.”Steven Dorwart, Vice President, Service Provider Solutions, Celestica Inc.“As a leader in the disaggregated Ethernet networking ecosystem, Celestica knows the importance of time-to-market. Broadcom is setting the pace with the delivery of Tomahawk 4, and Celestica is excited to develop platforms based on this latest 25.6Tbps switching ASIC.”Jeff Chen, CEO, Delta Networks“The pace of innovation in the Ethernet networking space is driven by the hyperscalers. With the latest Tomahawk 4 from Broadcom, Delta can expand our portfolio offering to our customers and deliver state-of-the-art 64x400G and 256x100G platforms.”  Jack Tsai, SVP and General Manager, Inventec Corporation“Broadcom has maintained a torrid pace of innovation and execution for its Tomahawk product line. The newest addition to the product family, Tomahawk 4 25.6T, is well suited for many of our customer’s use cases. We are proud to participate in this revolutionary product development, and we look forward to great mutual success through our cooperation with Broadcom.”Mike Yang, Senior Vice President of Quanta Computer Inc. and President of Quanta Cloud Technology, Quanta “Once again, Broadcom has executed flawlessly and maintained its leadership position in the Ethernet switch market. Tomahawk 4, 25.6Tbps, is an engineering marvel, as the 7nm ASIC provides the highest bandwidth in the industry, and provides flexibility to support 50, 100, 200, and 400GbE ports. QCT is very proud to be Broadcom's ecosystem partner for this flagship product.”Joshua Yeh, General Manager, Transmission Network and Equipment Business Unit, Applied Optoelectronics Inc.“The 25.6T bandwidth point represents an important incremental upgrade for datacenter users. Its ability to leverage an existing high volume, qualified broad optics portfolio as provided by AOI's QSFP-DD and OSFP modules, is critical to enable cost effective time deployment of next generation datacenter networks.”Osa Mok, Chief Marketing Officer of Innolight Technology Corporation “Broadcom's Tomahawk 4 is well positioned to support the needs of hyperscale users. While it delivers 2x the bandwidth, it still preserves the industry standard 8x50G interface for 400G connectivity. This is well aligned with Innolight's OSFP and QSFP optical transceiver products which are already in mass production, and are qualified at major datacenter operators.”AvailabilityBroadcom is now shipping Tomahawk 4 BCM56990 devices to qualified customers. For more information on the Tomahawk 4 and all Broadcom products and solutions please click here.About Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, StrataXGS, Tomahawk and Connecting everything are among the trademarks of Broadcom. The term “Broadcom” refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.[1] Cisco Global Cloud Index: Forecast and Methodology, 2016-2021 White Paper, https://www.cisco.com/c/en/us/solutions/collateral/service-provider/global-cloud-index-gci/white-paper-c11-738085.pdfPress Contact:  Jon PiazzaCorporate Communicationspress.relations@broadcom.comTelephone: +1 408 433 7924"
    },
    {
        "title": "Broadcom Introduces Industry’s First Enterprise-Grade Support for Eclipse Che4z and VS Code4z",
        "subtitle": "",
        "date": "Nov 12, 2019 11:00AM EST",
        "content": "SAN JOSE, Calif., Nov.  12, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the introduction of the industry’s first enterprise-grade support for new extensions of Eclipse Che 7— the first Kubernetes-native, integrated development environment (IDE) for developer teams leveraging the mainframe platform. As the first-ever open-source based set of IDE extensions for mainframe application development, developers can now use their existing tools to easily build innovative apps leveraging the data and processes residing on the mainframe.This innovative new offering, combined with Broadcom’s CA Brightside support of the Open Mainframe Project Zowe framework, provides enterprises with the confidence they need to introduce true, modern DevOps tools within their mainframe environment.  With enterprise-grade support, IT organizations are now in a position to accelerate their digital transformation initiatives.“One of the components of a successful digital transformation initiative is its ability to facilitate the use of applications and data across a multitude of platforms, inclusive of mainframes. Developer tools that render mainframe-based development accessible to modern developers by means of familiar tools and IDEs enhance the developer experience for mainframe application development,” said Arnal Dayaratna, research director, Software Development, IDC. “Given Broadcom’s strategy of focusing on open tools and proven enterprise support for Project Zowe, CA Endevor Enterprise Bridge for Git to CA Endevor and Eclipse Che, Che4z lowers the barriers for organizations to extend the value of their mainframe investment, while providing a familiar build and test environment.”Today’s developers spend the bulk of their day immersed in IDE and software configuration management (SCM). While career mainframe programmers can continue to use existing tools, the real future of mainframe DevOps focuses on millennial and off-platform developers who prefer to use familiar tools.“Eclipse Che simplifies collaboration and enables teams to provision developer workspaces without getting bogged down with configuration tasks— all while helping to protect source code. These benefits are just a few of the reasons the project has grown, as evidenced by the release of Che 7,” said Brad Micklea, vice president of Developer Tools, Programs and Advocacy at Red Hat. “As one of the early contributors to Eclipse Che, Red Hat is excited to see it applied to cloud-native, database and IoT development challenges. Now Broadcom has taken this even further to simplify mainframe development. We’re looking forward to continuing our support of this open source project and working with collaborators to further expand Che's use cases.”“Broadcom is continuously improving how mainframe technologies can help clients move faster in their digital transformation journey. Our strategy to embrace open technologies on the mainframe is unique because we see the value of those technologies working together with today’s existing tools.” said Greg Lotko, senior vice president and general manager, Mainframe Division, Broadcom. “Our announcement to provide enterprise support for Eclipse Che and VS Code extensions is yet another step in providing the confidence our clients need to adopt these open tools for the mainframe.”“For many years, Broadcom has played an invaluable role in the community-led innovation hosted by the Eclipse Foundation,” said Mike Milinkovich, executive director at the Eclipse Foundation. “Their participation in the release of Eclipse Che 7, the industry's first Kubernetes-native IDE, is a perfect example. We look forward to Broadcom’s contributions and leadership as the Eclipse community collaborates on the next generation of cloud development tools.”The Eclipse Che4z and VS Code4z extensions, previously contributed by Broadcom to the open-source community, will now be fully-supported. Broadcom’s customers using CA Endevor as their SCM, with the Git option, will benefit from these tools as well.The power of open source communities will be integral to future innovations on the mainframe. Developers can now contribute to the Che4z project by clicking here.For more information about enterprise support for Eclipse Che, please contact your Broadcom sales representative.About BroadcomBroadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:Jon PiazzaBroadcom Inc.press.relations@broadcom.com408-433-7924"
    },
    {
        "title": "Broadcom Expands Collaboration with Infosys, Delivering Industry-First Innovations to Automate Business Processes, AIOps, and Testing for  SAP S/4HANA Customers",
        "subtitle": "",
        "date": "Nov 5, 2019 11:00AM EST",
        "content": "SAN JOSE, Calif., Nov.  05, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced an expanded collaboration with Infosys, one of the world’s largest digital services and consulting companies, to help SAP customers mitigate risks and costs associated with the upgrade to SAP’s next-generation enterprise resource planning application, S/4HANA.The expanded alliance will combine the industry’s first Digital BizOps solution, powered by automation.ai from Broadcom, with deep industry and technical SAP implementation expertise from Infosys in the areas of Agile Business Management, Continuous Testing, Automation, and AIOps. A key component of the expanded alliance is the introduction of a leading-edge, new solution, Continuous Testing for SAP® S/4HANA. A first of its kind, Continuous Testing for SAP S/4HANA is designed to provide SAP customers with an end-to-end automated testing experience that integrates with commonly used SAP management tools.Continuous Testing for SAP S/4HANA incorporates pre-built content and templates, based on Infosys’s deep knowledge of SAP, powered by Broadcom’s market-leading Agile and Continuous Testing solutions, including Rally® and BlazeMeter®. The new solution will help customers automate tasks such as test case development and maintenance, impact analysis, and functional and performance test case execution. The platform identifies issues through active real-time visibility, helping enterprises and SMBs accelerate testing, while improving quality.Key benefits include: “The Infosys and Broadcom solution, Continuous Testing for SAP®, uniquely enables SAP customers to mitigate risks and costs associated with upgrading to S/4HANA, SAP’s next-generation platform. By automating key tasks, SAP customers using the Broadcom and Infosys solution are able to implement SAP S/4HANA faster with significant savings, and with full confidence in improved quality and efficacy,” said Anand Swaminathan, executive vice president, Communication, Media and Technology Industry Vertical at Infosys.In addition to Continuous Testing, Broadcom and Infosys plan to deliver capabilities to help SAP customers accelerate adoption of Agile methods. For many SAP customers, concepts such as Agile and DevOps are being introduced for the first time as a part of an S/4HANA transformation. Traditional Agile tools, in many cases, are not well-suited for SAP application delivery and management. As such, Broadcom will be enhancing its market-leading Agile management platform, Rally, with capabilities to help optimize SAP delivery and enable SAP teams to more efficiently coordinate SAP program planning. “With Infosys, we offer today’s digital enterprises the best path forward to minimize the risk, effort, and cost associated with an S/4HANA migration, helping them to realize the full potential of SAP’s next-generation platform with our comprehensive Digital BizOps solution. Our collaboration with Infosys provides digital businesses the opportunity to accelerate the move to S/4HANA, while at the same time, enhancing Agile and DevOps capabilities, driving better business outcomes through AI and automation,\" said Ashok Reddy, senior vice president and general manager, Enterprise Software Division, Broadcom. In the area of ongoing SAP system maintenance and management, Infosys and Broadcom plan to deliver capabilities to help customers drive end-to-end business process automation across SAP, non-SAP and multi-cloud landscapes. This includes pre-built automation flows for many processes that are commonly performed manually now.For more information about this joint Infosys SAP solution please click here. To learn more about other Broadcom solutions for SAP visit Broadcom.com.About BroadcomBroadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, Rally, BlazeMeter and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.SAP TRADEMARKS are the trademark(s) or registered trademark(s) of SAP SE in Germany and in several other countries.Press Contact:Jon PiazzaBroadcom Inc.press.relations@broadcom.com408-433-7924"
    },
    {
        "title": "Broadcom Completes Acquisition of Symantec Enterprise Security Business",
        "subtitle": "",
        "date": "Nov 4, 2019 8:48AM EST",
        "content": "SAN JOSE, Calif., Nov. 4, 2019 /PRNewswire/ -- Broadcom Inc. (NASDAQ: AVGO), a global technology leader that designs, develops and supplies semiconductor and infrastructure software solutions, today announced that it has completed its acquisition of the Enterprise Security business of Symantec Corporation (NASDAQ: SYMC). Symantec's Enterprise Security business will now operate as the Symantec Enterprise division of Broadcom and will be led by Art Gilliland as SVP and General Manager. Mr. Gilliland most recently served as General Manager of Symantec's Enterprise Security business where he oversaw the Enterprise Security product and engineering teams, Enterprise Security Worldwide Sales and the Enterprise Security customer support organization. He brings more than 20 years of experience in the security software industry.\"Today represents an important milestone as Symantec's Enterprise Security business joins our other semiconductor and software franchises that together form the Broadcom platform,\" said Hock Tan, President and Chief Executive Officer of Broadcom. \"Symantec's Enterprise Security business expands our footprint of mission critical infrastructure software for the Global 2000. We are pleased to welcome the talented team of employees at Symantec Enterprise Security to the Broadcom family.\"\"We are excited to join Broadcom as it continues to build one of the world's leading infrastructure technology companies,\" said Mr. Gilliland. \"Broadcom has a proven track record of successfully integrating companies, enabling enhanced growth and a faster pace of innovation, and we look forward to welcoming Symantec Enterprise customers, employees and suppliers to the Broadcom community.\"About BroadcomBroadcom Inc., (NASDAQ: AVGO), a Delaware corporation headquartered in San Jose, CA, is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom's category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise, mainframe and cyber security software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Cautionary Note Regarding Forward-Looking StatementsThis release contains forward-looking statements (including within the meaning of Section 21E of the United States Securities Exchange Act of 1934, as amended, and Section 27A of the United States Securities Act of 1933, as amended) concerning Broadcom. These statements include, but are not limited to, statements that address our expected future business and financial performance and other statements identified by words such as \"will\", \"expect\", \"believe\", \"anticipate\", \"estimate\", \"should\", \"intend\", \"plan\", \"potential\", \"predict\" \"project\", \"aim\", and similar words, phrases or expressions. These forward-looking statements are based on current expectations and beliefs of the management of Broadcom, as well as assumptions made by, and information currently available to, such management, current market trends and market conditions and involve risks and uncertainties, many of which are outside the Company's and management's control, and which may cause actual results to differ materially from those contained in forward-looking statements. Accordingly, you should not place undue reliance on such statements.Particular uncertainties that could materially affect future results include risks associated with: our Symantec Corporation (\"Symantec\") transaction, including (1) potential difficulties in employee retention, (2) unexpected costs, charges or expenses, and (3) our ability to successfully integrate the Symantec enterprise business and achieve the anticipated benefits of the transaction; any loss of our significant customers and fluctuations in the timing and volume of significant customer demand; our dependence on contract manufacturing and outsourced supply chain; global economic conditions and concerns; any acquisitions we may make, such as delays, challenges and expenses associated with receiving governmental and regulatory approvals and satisfying other closing conditions, and with integrating acquired companies with our existing businesses and our ability to achieve the benefits, growth prospects and synergies expected by such acquisitions, including our recently completed transaction with Symantec; government regulations and trade restrictions; our ability to accurately estimate customers' demand and adjust our manufacturing and supply chain accordingly; our significant indebtedness, including the additional significant indebtedness that we have incurred in connection with the Symantec transaction and the need to generate sufficient cash flows to service and repay such debt; dependence on and risks associated with distributors of our products; dependence on senior management and our ability to attract and retain qualified personnel; international political and economic conditions; involvement in legal and administrative proceedings; our dependency on a limited number of suppliers; quarterly and annual fluctuations in operating results; cyclicality in the semiconductor industry or in our target markets; our competitive performance and ability to continue achieving design wins with our customers, as well as the timing of any design wins; prolonged disruptions of our or our contract manufacturers' manufacturing facilities or other significant operations; our ability to improve our manufacturing efficiency and quality; our dependence on outsourced service providers for certain key business services and their ability to execute to our requirements; our ability to maintain or improve gross margin; our ability to protect our intellectual property and the unpredictability of any associated litigation expenses; compatibility of our software products with operating environments, platforms or third-party products; our ability to enter into satisfactory software license agreements; sales to our government clients; availability of third party software used in our products; use of open source code sources in our products; any expenses or reputational damage associated with resolving customer product warranty and indemnification claims; our ability to sell to new types of customers and to keep pace with technological advances; market acceptance of the end products into which our products are designed; our ability to protect against a breach of security systems; changes in accounting standards; fluctuations in foreign exchange rates; the amount and frequency of our stock repurchases; our provisions for income taxes and overall cash tax costs, legislation that may impact our overall cash tax costs and our ability to maintain tax concessions in certain jurisdictions; and other events and trends on a national, regional and global scale, including those of a political, economic, business, competitive and regulatory nature.Our filings with the SEC, which you may obtain for free at the SEC's website at https://www.sec.gov, discuss some of the important risk factors that may affect our business, results of operations and financial condition. Actual results may vary from the estimates provided. We undertake no intent or obligation to publicly update or revise any of the estimates and other forward-looking statements made in this release, whether as a result of new information, future events or otherwise, except as required by law.ContactsBeatrice F. RussottoInvestor Relations408-433-8000investor.relations@broadcom.comJoele Frank / Steve Frankel / Andi RoseJoele Frank, Wilkinson Brimmer Katcher212-355-4449 View original content:http://www.prnewswire.com/news-releases/broadcom-completes-acquisition-of-symantec-enterprise-security-business-300950721.htmlSOURCE  Broadcom Inc."
    },
    {
        "title": "Broadcom Delivers Industry’s Highest Density G.fast Modem Solution",
        "subtitle": "",
        "date": "Oct 15, 2019 4:00AM EDT",
        "content": "SAN JOSE, Calif., Oct.  15, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the availability of its BCM65450 family of G.fast modem devices. As telecom operators drive toward gigabit broadband via fiber deployments, the existing twisted pair copper infrastructure often remains the fastest and most cost-effective method to complete the customer premise connection. The BCM65450, with the highest G.fast density available, is designed specifically to bridge this fiber-copper gap and get the operator to gigabit services revenue in the shortest possible time. Together with the BCM68650 10G PON OLT solution also announced at the 2019 Broadband World Forum, the introduction of the BCM65450 demonstrates Broadcom’s significant commitment in support of wireline broadband infrastructure.With four times the port density and 20% lower per-line power consumption than the widely deployed BCM65400 family, the BCM65450 is ideal for the highest-density multi-dwelling unit (MDU) and reverse-powered DPU system designs. Each BCM65450 device supports up to 16 G.fast 212MHz interfaces, with embedded crosstalk cancellation (‘vectoring’) of up to three devices interconnected seamlessly for a fully-vectored 48-port MDU. Coupled with Broadcom’s previously announced BCM65550 vector processor, system designs in excess of 100 lines are now possible with uncompromised crosstalk cancellation across the entire G.fast spectrum.The BCM65450 does more than increase density and improve efficiency. As a true copper infrastructure platform, it delivers on all of the critical innovations of the copper industry and standards bodies, including: echo-cancellation technology, offering the opportunity to use the full G.fast spectrum for simultaneous upstream and downstream transmission; G.fastback, now standardized in the ITU, a technique that extends gigabit coverage via G.fast backhauling and cascading; a dedicated line-bonding engine to provide previously unachievable multi-gigabit throughput over a set of bonded copper lines; and Dynamic Time Allocation to offer gigabit symmetrical services by dynamically adapting downstream and upstream rates. With all of these, plus fallback to earlier deployments of standardized DSL protocols, the BCM65450 is the ideal copper infrastructure solution for the gigabit broadband era.BCM65450 Product Highlights“Quick deployment of ultrafast broadband across our territory is a critical requirement for A1,” said Gerald Clerckx, head of Fixed Access Engineering at A1 Telekom Austria AG. “It is encouraging to see the continued leadership of Broadcom in offering the solution set necessary to realize this for both fiber and copper networks.” “There is little debate that fiber is the future for gigabit broadband,” noted Jeff Heynen, senior research director at Dell’Oro Group. “But there still remains untapped potential in the existing twisted-pair copper plant. In many cases, a gigabit service can be offered quickly, and at far lower expense, by relying on G.fast for the final connection to the customer premise. Broadcom’s BCM65450 solution addresses service provider demand for delivering gigabit broadband over copper.”“Broadcom’s approach to broadband infrastructure has always been comprehensive; we look to deliver all the tools an operator needs to deploy the latest broadband protocols.  The BCM65450 family, coupled with the BCM68650 we are also releasing at the Broadband World Forum, offers strong validation of this commitment. Through our system vendor partners we can now deliver all the technology required for a quick and cost-effective 10G fiber rollout, utilizing the physical plant assets available to each operator, with the minimum investment and operating expense,” said Greg Fischer, senior vice president and general manager of the Broadband Carrier Access Products Division at Broadcom.AvailabilityBroadcom is now sampling its BCM65450 device to qualified customers. Please contact your local Broadcom sales representative for samples and pricing.Further information on Broadcom’s BCM65450 can be found online at:https://www.broadcom.com/products/broadband/xdsl/bcm65450About Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom.  The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:  Khanh LamCorporate Communicationspress.relations@broadcom.comTelephone: +1 408 433 8649 "
    },
    {
        "title": "Broadcom Drives 10G Fiber Broadband with Industry’s Highest Density PON OLT MAC",
        "subtitle": "",
        "date": "Oct 14, 2019 8:00AM EDT",
        "content": "SAN JOSE, Calif., Oct.  14, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the availability of its BCM68650 family of optical line termination (OLT) PON MAC devices. With up to sixteen XGS-PON, NGPON-2, or 10GEPON interfaces, the BCM68650 offers broadband equipment suppliers an ideal platform to build new 10G OLT systems with exceptional density and power efficiency. Designed to support deployments based on all recent 10G PON standards, the BCM68650 becomes the first commercially available merchant silicon solution optimized for the highest density 10G PON OLT’s.As telecom operators look to deploy 10G PON technology to bring higher bandwidth broadband services to homes and businesses, having a solution that matches the density of existing GPON deployments is key to driving mass market adoption of 10G PON. The BCM68650 supports up to 16 10G PON interfaces suited for high density OLT line cards. Coupled with a power-efficient architecture, the high integration of the device minimizes OLT power consumption and operating expenses. And to ensure flexibility for incremental 10G deployments, the BCM68650 also supports the coexistence of 1G, 2.5G, and 10G PON networks served from a common OLT trunk fiber. With these capabilities, system vendors can now design an optimized solution for virtually any 10G PON requirement.Also shipping with the BCM68650 is Broadcom’s latest OLT line card development suite, the Broadband Adaptation Layer™ (BAL). This comprehensive environment provides a simple, standards-based programming interface and data model of the PON network, greatly simplifying the OLT software architecture. By architecting BAL around standardized data models, the BCM68650 also functions as a key building block for the new class of open ‘white-box’ OLT solutions, offering operators yet another competitive OLT alternative.With a combination of density, power efficiency, and rich software environment, the BCM68650 is ideally suited to accelerate the rollout of 10G PON broadband services.BCM68650 Product HighlightsSeungdong Lee, chief technology officer of DASAN Zhone Solutions, Inc., commented, “We are excited with the release of the BCM68650 family, in our view an optimal platform for XGSPON/NGPON2 mass deployment. The BCM68650, with its combination of versatility, performance and scale, will be a critical element in the long-term development of our industry-leading 10G PON solutions.”“The BCM68650 showcases Broadcom’s industry-leading commitment to investment in the newest fiber broadband infrastructure. With its unequaled capability to deliver the density that OLT operators require, along with an open and comprehensive software development environment, we expect the BCM68650 will make a dramatic impact in the appeal of near-term deployment in 10G fiber broadband,” said Greg Fischer, senior vice president and general manager of the Broadband Carrier Access Products Division at Broadcom.AvailabilityBroadcom is now sampling its BCM68650 device to qualified customers. Please contact your local Broadcom sales representative for samples and pricing.Further information on Broadcom’s BCM68650 can be found online at:https://www.broadcom.com/products/broadband/xpon/bcm68650About Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom.  The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:  Khanh LamCorporate Communications press.relations@broadcom.comTelephone: +1 408 433 8649"
    },
    {
        "title": "Broadcom Introduces Industry’s First 3x3 Wi-Fi 6 Chip for Mass-Market WLAN Access Points and Set-Top Boxes",
        "subtitle": "",
        "date": "Oct 10, 2019 11:00AM EDT",
        "content": "SAN JOSE, Calif., Oct.  10, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced the availability of its 3x3 Wi-Fi 6 chip, the BCM6710, designed for WLAN applications including Wi-Fi routers, residential gateways, wireless range extenders, and set-top boxes. The BCM6710 is a highly optimized Wi-Fi 6 chip with integrated RF power amplifiers, providing OEMs a cost-effective, high-performance solution for their mass-market products.The BCM6710 is the first 3x3 Wi-Fi 6 solution supporting three transmit and three receive streams in 2.4-GHz, 5-GHz and future 6-GHz bands. With the 6-GHz Wi-Fi capability, the chip paves the way for high-bandwidth, low-latency applications, such as 4K UHD video streaming, real-time immersive gaming, and augmented reality (AR).BCM6710 Product Highlights“A year ago Broadcom announced the production launch of BCM43684 – its flagship 4x4 Wi-Fi 6 radio for residential gateways and access points. Following that Broadcom has announced and delivered multiple SoCs with one or two 2x2 Wi-Fi 6 radios integrated,” said Greg Fischer, senior vice president and general manager of the Broadband Carrier Access Products Division at Broadcom. “With the addition of BCM6710 to the portfolio, Broadcom allows customers to build a diverse set of high-performance Wi-Fi 6 products, which are optimized for both cost and form factor.”Broadcom will showcase its latest Wi-Fi 6 access point solutions including the BCM6710 in its private booth at the 2019 Broadband World Forum (BBWF) in Amsterdam, Netherlands from October 15th to 17th.AvailabilityBroadcom is now sampling its BCM6710 device to qualified customers. Please contact your local Broadcom sales representative for samples and pricing.Further information on Broadcom’s BCM6710 can be found online at:https://www.broadcom.com/products/wireless/wireless-lan-infrastructure/bcm6710Quotes“We are excited about Broadcom’s introduction of BCM6710 in the market. With the addition of this chip, Sagemcom is now able to build a diverse set of gateways, tailored to each operator’s specific needs. The support for 6 GHz band in BCM6710 also gives us faster time to market when 6 GHz spectrum is opened up and available to Wi-Fi technology.” -- Ahmed Selmani, Senior Executive VP, Sagemcom Broadband“The new Wi-Fi 6 chip from Broadcom allows Technicolor to expand the portfolio of products we develop to cover a growing number of home networking scenarios. As network service providers (NSPs) look for new ways to meet different end-user needs, Technicolor has worked closely with Broadcom to seamlessly integrate this advanced silicon into our latest generation of customer premises equipment (CPE). The improvement of performance enabled by the Wi-Fi 6 BCM6710 will lead to better user experiences for multiple services -- such as gaming, video streaming and other connected home applications. At BBWF, Technicolor will demonstrate for the first time a BCM6710 chip-equipped gateway that meets the different technical and economic requirements of cable and telco operators.” -- Mercedes Pastor, President, Global CPE Business Unit, Technicolor“BCM6710 gives us and operators the flexibility we desire in the selection of the number of antennas for Wi-Fi 6 extenders introduced to consumers. BCM6710 can be used as the fronthaul or backhaul radio, in dual band or tri-band designs.” -- Metin Taskin, CTO, AirtiesAbout Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:  Khanh LamCorporate Communicationspress.relations@broadcom.comTelephone: +1 408 433 8649"
    },
    {
        "title": "Broadcom Inc. Announces Pricing and Upsizing of Mandatory Convertible Preferred Stock Offering",
        "subtitle": "",
        "date": "Sep 24, 2019 11:45PM EDT",
        "content": "SAN JOSE, Calif., Sept. 24, 2019 /PRNewswire/ -- Broadcom Inc. (Nasdaq: AVGO) (\"Broadcom\") announced today that it has upsized and priced a public offering of 3,250,000 shares of 8.00% Series A Mandatory Convertible Preferred Stock (the \"Mandatory Convertible Preferred Stock\") at a price to the public of $1,000 per share (the \"Offering\"). The Offering was upsized from the previously announced $3.0 billion of shares of Mandatory Convertible Preferred Stock. The underwriters have a 30-day option to purchase up to an additional 487,500 shares of Mandatory Convertible Preferred Stock solely to cover over-allotments, if any. The Offering is scheduled to be completed on September 30, 2019, subject to customary closing conditions.  The net proceeds from the Offering will be approximately $3.2 billion (or approximately $3.7 billion if the underwriters exercise their option to purchase additional shares of Mandatory Convertible Preferred Stock to cover over-allotments, if any, in full) after deducting issuance costs and discounts.Broadcom intends to use the net proceeds from the Offering to repay a portion of the outstanding borrowings under Broadcom's existing term loan facilities on a pro rata basis.BofA Merrill Lynch, Citigroup, J.P. Morgan and Morgan Stanley are acting as representatives of the underwriters and joint-book running managers for the Offering. Barclays, BMO Capital Markets, BNP PARIBAS, HSBC, RBC Capital Markets and Wells Fargo Securities are also serving as bookrunners for the Offering, and Academy Securities, BBVA, COMMERZBANK, Credit Suisse, Deutsche Bank Securities, Mizuho Securities, MUFG, PNC Capital Markets LLC, Scotiabank, SMBC, Standard Chartered Bank, SunTrust Robinson Humphrey and TD Securities are serving as co-managers.Unless earlier converted, each share of Mandatory Convertible Preferred Stock will automatically convert on September 30, 2022 (subject to postponement for certain market disruption or other events) into between 3.0303 and 3.5422 shares of Broadcom's common stock, subject to certain customary anti-dilution adjustments. Dividends on the Mandatory Convertible Preferred Stock will be payable on a cumulative basis when, as and if declared by Broadcom's board of directors at an annual rate of 8.00% on the liquidation preference of $1,000 per share. If declared, these dividends will be paid in cash or, subject to certain limitations, in shares of Broadcom's common stock or a combination of cash and shares of Broadcom's common stock, at Broadcom's election, on March 31, June 30, September 30 and December 31 of each year, commencing on December 31, 2019, and continuing to, and including, September 30, 2022.The Offering is being made pursuant to an effective shelf registration statement on file with the U.S. Securities and Exchange Commission (the \"SEC\") and will be made only by means of a prospectus supplement relating to the Offering and the accompanying base prospectus. An electronic copy of the prospectus supplement, together with the accompanying prospectus, may be obtained, when available, by visiting the SEC's website at www.sec.gov. Alternatively, copies of the prospectus supplement and accompanying prospectus relating to the Offering can be obtained, when available, by contacting: BofA Securities, Inc., Attention: Prospectus Department, 200 North College Street, 3rd Floor, Charlotte, North Carolina 28255, by telephone at (800) 294-1322, or by email at dg.prospectus_requests@baml.com; Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by telephone at (800) 831-9146; J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, Attention: Prospectus Department, 1155 Long Island Avenue, Edgewood, New York 11717, by telephone at (866) 803-9204, or by email at prospectus-eq_fi@jpmchase.com; and Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, Second Floor, New York, New York 10014, or by telephone at (866) 718-1649.This press release is neither an offer to sell nor a solicitation of an offer to buy the Mandatory Convertible Preferred Stock or any other securities, nor shall there be any offer, solicitation or sale of any security mentioned in this press release in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction. Cautionary Note Regarding Forward-Looking Statements This announcement contains forward-looking statements (including within the meaning of Section 21E of the U.S. Securities Exchange Act of 1934, as amended, and Section 27A of the U.S. Securities Act of 1933, as amended) concerning Broadcom. These statements include, but are not limited to, statements that address our expected future business and financial performance and statements about the proposed Offering and the use of proceeds therefrom and other statements identified by words such as \"will\", \"expect\", \"believe\", \"anticipate\", \"estimate\", \"should\", \"intend\", \"plan\", \"potential\", \"predict\" \"project\", \"aim\", and similar words, phrases or expressions. These forward-looking statements are based on current expectations and beliefs of the management of Broadcom, as well as assumptions made by, and information currently available to, such management, current market trends and market conditions and involve risks and uncertainties, many of which are outside Broadcom's and management's control, and which may cause actual results to differ materially from those contained in forward-looking statements. Accordingly, you should not place undue reliance on such statements. Particular uncertainties that could materially affect future results include risks associated with: any loss of our significant customers and fluctuations in the timing and volume of significant customer demand; our dependence on contract manufacturing and outsourced supply chain; global economic conditions and concerns; any acquisitions we may make, such as delays, challenges and expenses associated with receiving governmental and regulatory approvals and satisfying other closing conditions, and with integrating acquired companies with our existing businesses and our ability to achieve the benefits, growth prospects and synergies expected by such acquisitions, including our pending Symantec Corporation transaction; government regulations and trade restrictions; our ability to accurately estimate customers' demand and adjust our manufacturing and supply chain accordingly; our significant indebtedness and the need to generate sufficient cash flows to service and repay such debt; dependence on and risks associated with distributors of our products; dependence on senior management and our ability to attract and retain qualified personnel; international political and economic conditions; involvement in legal or administrative proceedings; our dependency on a limited number of suppliers; quarterly and annual fluctuations in operating results; cyclicality in the semiconductor industry or in our target markets; our competitive performance and ability to continue achieving design wins with our customers, as well as the timing of any design wins; prolonged disruptions of our or our contract manufacturers' manufacturing facilities or other significant operations; our ability to improve our manufacturing efficiency and quality; our dependence on outsourced service providers for certain key business services and their ability to execute to our requirements; our ability to maintain or improve gross margin; our ability to protect our intellectual property and the unpredictability of any associated litigation expenses; compatibility of our software products with operating environments, platforms or third-party products; our ability to enter into satisfactory software license agreements; sales to our government clients; availability of third party software used in our products; use of open source code sources in our products; any expenses or reputational damage associated with resolving customer product warranty and indemnification claims; our ability to sell to new types of customers and to keep pace with technological advances; market acceptance of the end products into which our products are designed; our ability to protect against a breach of security systems; changes in accounting standards; fluctuations in foreign exchange rates; the amount and frequency of our stock repurchases; our provision for income taxes and overall cash tax costs, legislation that may impact our overall cash tax costs and our ability to maintain tax concessions in certain jurisdictions; and other events and trends on a national, regional and global scale, including those of a political, economic, business, competitive and regulatory nature. All of the forward-looking statements in this press release are qualified in their entirety by reference to the factors listed above and those discussed under the heading \"Risk Factors\" herein and in Part I, Item 1A of our Annual Report on Form 10-K for the fiscal year ended November 4, 2018 and Part II, Item 1A of our Quarterly Report on Form 10-Q for the fiscal quarter ended August 4, 2019. We caution you that the foregoing list of important factors may not contain all of the material factors that are important to you. In addition, in light of these risks and uncertainties, the matters referred to in the forward-looking statements contained in this press release may not in fact occur. We undertake no intent or obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law. Contact:Broadcom Inc.Beatrice F. RussottoInvestor Relations408-433-8000investor.relations@broadcom.com View original content:http://www.prnewswire.com/news-releases/broadcom-inc-announces-pricing-and-upsizing-of-mandatory-convertible-preferred-stock-offering-300924861.htmlSOURCE  Broadcom Inc."
    },
    {
        "title": "Broadcom Inc. Announces Offering of Mandatory Convertible Preferred Stock",
        "subtitle": "",
        "date": "Sep 24, 2019 4:01PM EDT",
        "content": "SAN JOSE, Calif., Sept. 24, 2019 /PRNewswire/ -- Broadcom Inc. (Nasdaq: AVGO) (\"Broadcom\") announced today that it has commenced a public offering of $3.0 billion of shares of Series A Mandatory Convertible Preferred Stock (\"Mandatory Convertible Preferred Stock\"), subject to market conditions and other factors (the \"Offering\"). Broadcom expects to grant the underwriters a 30-day option to purchase up to an additional $450.0 million of shares of Mandatory Convertible Preferred Stock solely to cover over-allotments, if any. Broadcom intends to use the net proceeds from the Offering to repay a portion of the outstanding borrowings under Broadcom's existing term loan facilities on a pro rata basis.BofA Merrill Lynch, Citigroup, J.P. Morgan and Morgan Stanley are acting as representatives of the underwriters and joint-book running managers for the Offering. Barclays, BMO Capital Markets, BNP PARIBAS, HSBC, RBC Capital Markets and Wells Fargo Securities are also serving as bookrunners for the Offering. Each share of Mandatory Convertible Preferred Stock is expected to have a liquidation preference of $1,000 per share. Unless earlier converted, each share of Mandatory Convertible Preferred Stock will automatically convert into a variable number of shares of Broadcom's common stock on the mandatory conversion date, which is scheduled to occur on September 30, 2022. The conversion terms, dividend rate and the other terms of the Mandatory Convertible Preferred Stock will be determined at the time of pricing. The Offering is being made pursuant to an effective shelf registration statement on file with the U.S. Securities and Exchange Commission (the \"SEC\") and will be made only by means of a prospectus supplement relating to the Offering and the accompanying base prospectus. An electronic copy of the preliminary prospectus supplement, together with the accompanying prospectus, is available on the SEC's website at www.sec.gov. Alternatively, copies of the prospectus supplement and accompanying prospectus relating to the Offering can be obtained by contacting: BofA Securities, Inc., Attention: Prospectus Department, 200 North College Street, 3rd Floor, Charlotte, North Carolina 28255, by telephone at (800) 294-1322, or by email at dg.prospectus_requests@baml.com; Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by telephone at (800) 831-9146; J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, Attention: Prospectus Department, 1155 Long Island Avenue, Edgewood, New York 11717, by telephone at (866) 803-9204, or by email at prospectus-eq_fi@jpmchase.com; and Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, Second Floor, New York, New York 10014, or by telephone at (866) 718-1649.This press release is neither an offer to sell nor a solicitation of an offer to buy the Mandatory Convertible Preferred Stock or any other securities, nor shall there be any offer, solicitation or sale of any security mentioned in this press release in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction. Cautionary Note Regarding Forward-Looking Statements This announcement contains forward-looking statements (including within the meaning of Section 21E of the U.S. Securities Exchange Act of 1934, as amended, and Section 27A of the U.S. Securities Act of 1933, as amended) concerning Broadcom. These statements include, but are not limited to, statements that address our expected future business and financial performance and statements about the proposed Offering and the use of proceeds therefrom and other statements identified by words such as \"will\", \"expect\", \"believe\", \"anticipate\", \"estimate\", \"should\", \"intend\", \"plan\", \"potential\", \"predict\" \"project\", \"aim\", and similar words, phrases or expressions. These forward-looking statements are based on current expectations and beliefs of the management of Broadcom, as well as assumptions made by, and information currently available to, such management, current market trends and market conditions and involve risks and uncertainties, many of which are outside Broadcom's and management's control, and which may cause actual results to differ materially from those contained in forward-looking statements. Accordingly, you should not place undue reliance on such statements. Particular uncertainties that could materially affect future results include risks associated with: any loss of our significant customers and fluctuations in the timing and volume of significant customer demand; our dependence on contract manufacturing and outsourced supply chain; global economic conditions and concerns; any acquisitions we may make, such as delays, challenges and expenses associated with receiving governmental and regulatory approvals and satisfying other closing conditions, and with integrating acquired companies with our existing businesses and our ability to achieve the benefits, growth prospects and synergies expected by such acquisitions, including our pending Symantec Corporation transaction; government regulations and trade restrictions; our ability to accurately estimate customers' demand and adjust our manufacturing and supply chain accordingly; our significant indebtedness and the need to generate sufficient cash flows to service and repay such debt; dependence on and risks associated with distributors of our products; dependence on senior management and our ability to attract and retain qualified personnel; international political and economic conditions; involvement in legal or administrative proceedings; our dependency on a limited number of suppliers; quarterly and annual fluctuations in operating results; cyclicality in the semiconductor industry or in our target markets; our competitive performance and ability to continue achieving design wins with our customers, as well as the timing of any design wins; prolonged disruptions of our or our contract manufacturers' manufacturing facilities or other significant operations; our ability to improve our manufacturing efficiency and quality; our dependence on outsourced service providers for certain key business services and their ability to execute to our requirements; our ability to maintain or improve gross margin; our ability to protect our intellectual property and the unpredictability of any associated litigation expenses; compatibility of our software products with operating environments, platforms or third-party products; our ability to enter into satisfactory software license agreements; sales to our government clients; availability of third party software used in our products; use of open source code sources in our products; any expenses or reputational damage associated with resolving customer product warranty and indemnification claims; our ability to sell to new types of customers and to keep pace with technological advances; market acceptance of the end products into which our products are designed; our ability to protect against a breach of security systems; changes in accounting standards; fluctuations in foreign exchange rates; the amount and frequency of our stock repurchases; our provision for income taxes and overall cash tax costs, legislation that may impact our overall cash tax costs and our ability to maintain tax concessions in certain jurisdictions; and other events and trends on a national, regional and global scale, including those of a political, economic, business, competitive and regulatory nature. All of the forward-looking statements in this press release are qualified in their entirety by reference to the factors listed above and those discussed under the heading \"Risk Factors\" herein and in Part I, Item 1A of our Annual Report on Form 10-K for the fiscal year ended November 4, 2018 and Part II, Item 1A of our Quarterly Report on Form 10-Q for the fiscal quarter ended August 4, 2019. We caution you that the foregoing list of important factors may not contain all of the material factors that are important to you. In addition, in light of these risks and uncertainties, the matters referred to in the forward-looking statements contained in this press release may not in fact occur. We undertake no intent or obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law. Contact:Broadcom Inc.Beatrice F. RussottoInvestor Relations408-433-8000investor.relations@broadcom.com   View original content:http://www.prnewswire.com/news-releases/broadcom-inc-announces-offering-of-mandatory-convertible-preferred-stock-300924599.htmlSOURCE  Broadcom Inc."
    },
    {
        "title": "Thinking about trading options or stock in Broadcom, Bank of America, Bristol-Myers Squibb, Netflix, or Roku?",
        "subtitle": "",
        "date": "Sep 23, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 23, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AVGO, BAC, BMY, NFLX, and ROKU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-broadcom-bank-of-america-bristol-myers-squibb-netflix-or-roku-300923148.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Broadcom Delivers Industry’s First Dual 400G MACSec PHY for Hyper-scale Data Center and Cloud Infrastructure",
        "subtitle": "",
        "date": "Sep 23, 2019 4:00AM EDT",
        "content": "SAN JOSE, Calif., Sept.  23, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced commercial availability of its BCM81343 device, a dual 400G MACSec PHY with AES-256, designed to address security requirements for high speed interconnects in modern network infrastructure including hyper-scale, cloud, service provider and enterprise networks. Expanding upon the previous generation dual 100G MACSec PHY, the BCM81343 quadruples the switch bandwidth capability with dual 400G ports and supports the IEEE 1588 precision time protocol (PTP) providing accurate clock timing for time-sensitive transactions and mission-critical tasks.Cloud and service provider networks are rapidly transitioning to 400G Ethernet to support increasing bandwidth demands and emerging 5G services. A wide range of cloud & 5G applications need hardware-based MACSec capability to secure high speed data links and accurate time-stamping to ensure high reliability and quality of service. Broadcom’s BCM81343 is the industry’s first dual 400G MACSec PHY device enabling cloud and service providers to maximize the port throughput of the latest 12.8-Tb/s switches such as Broadcom’s Tomahawk® 3, Jericho 2 and Trident 4. The BCM81343 helps secure high-speed data links between servers, switches and routers while providing accurate PTP time-stamping needed for 5G services.BCM81343 Product Highlights“Data privacy and security have become critical in the data center and cloud infrastructure given the increasing number of security breaches. As cloud and service providers transition their networks to 400G Ethernet to support the growing demand for higher bandwidth and emerging 5G services, it’s imperative that their 400G networks be equipped with 400G MACSec to protect against intrusion attacks, wiretapping and other threats,” said Lorenzo Longo, senior vice president and general manager of the Physical Layer Products Division at Broadcom. “Expanding upon Broadcom’s industry-leading 400G PAM-4 PHY portfolio, the BCM81343 is the first commercial 400G MACSec PHY that delivers up to 800G of switch bandwidth with PTP time-stamping for 5G applications.”\"As 400GbE deployments are ramping in hyper-scale data centers, it's vital that MACSec be scaled to 400G to protect data-center interconnects. With its shipment of 400G MACSec PHYs, Broadcom is building on its optical PHY leadership and accelerating the transition to 400G Ethernet,” said Bob Wheeler, principal analyst with The Linley Group.AvailabilityBroadcom has begun shipping volume quantities of its BCM81343 device to qualified customers. Please contact your local Broadcom sales representative for samples and pricing.Further information on Broadcom’s BCM81343 can be found online at: https://www.broadcom.com/products/ethernet-connectivity/optical-phy/bcm81343About Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, Connecting everything, and Tomahawk are among the trademarks of Broadcom.  The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:  Khanh LamCorporate Communicationspress.relations@broadcom.comTelephone: +1 408 433 8649 "
    },
    {
        "title": "Broadcom Introduces the Industry’s Most Generous Complimentary Offering of Digital Business Operations Software",
        "subtitle": "",
        "date": "Sep 17, 2019 11:00AM EDT",
        "content": "SAN JOSE, Calif., Sept.  17, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today introduced its innovative Digital BizOps Starter Edition, the industry’s most generous complimentary offering of integrated, market-leading digital transformation software. This cutting-edge new program provides a larger number of businesses access to solutions across the entire digital business operations (BizOps) spectrum at no cost.According to the Wall Street Journal, executives see operational challenges associated with digital transformation as the #1 risk factor for businesses in 2019.1 Related, 70% of digital transformation initiatives do not meet their objectives.2 Often digital transformation efforts do not succeed because organizations lack access to the technologies and tools required to rapidly and efficiently bring new digital products to market.To address these operations risks and help organizations – from SMB to enterprise – become successful digital businesses, Broadcom designed Digital BizOps Starter Edition to help businesses get started with Agile Business Management, Value Stream Management, Continuous Testing, DevOps and AIOps.Powered by open source and leveraging AI to drive actionable insights, it will enable agile teams to more effectively plan, develop, test, deliver and monitor digital products. Digital BizOps Starter Edition is comprised of software as a service application software, including Rally®, Automic® Continuous Delivery Director (CDD), BlazeMeter® and DX APM at generous usage thresholds.“We recognize that for many executives, the choice has been either a set of disjointed tools from multiple vendors with a low-cost of entry, which don't scale over time, or very powerful integrated solutions with a high-cost of entry that don’t always align with budget pressures. Digital BizOps Starter Edition alleviates these issues, providing easy access and cost-effective digital solutions to businesses of all sizes as they get started on their digital transformations,” said Ashok Reddy, senior vice president and general manager, Enterprise Software Division, Broadcom. “Digital BizOps Starter Edition creates an opportunity for organizations to innovate and modernize their IT landscapes at a time when the IT spend has been severely constrained due to economic pressures— this can impede the digital growth model,” said Ramanath Suryaprakash, associate vice president, Partner Ecosystems and Global Alliances, Infosys. “Now, we can pro-actively engage with our customers to demonstrate the value of this enterprise class software suite and how it can accelerate innovation and productivity.”Providing Access and Opportunity in Today’s Digital SocietyA Gartner research report entitled, Defining a New Framework for Regulating Digital Society, notes that “digital societies mobilize faster, change more frequently, and disrupt society and the economy more than past societies. This leads for calls for new rules that reflect digital realities and offer greater proactive protection.”3“In today’s build-run-grow environment, businesses need to be digitally-powered by AI and automation. By offering Digital BizOps Starter Edition, we are helping level the playing field for all companies to compete and win in a more equitable digital society, furthering ‘best ideas win’ ideology— a true game-changer,” said Ashok Reddy, senior vice president and general manager, Enterprise Software Division, Broadcom. \"We’re excited about the opportunity that Starter Edition creates for our mutual clients. It's a great way to gain access and get started immediately with premier, scalable Agile and DevOps capabilities,\" said Rob Greca, managing director of Agile Expert Services at Rego Consulting. \"Agile teams will immediately experience how effectively Broadcom's Digital BizOps solutions, such as Rally Software and CDD, enhance enterprise alignment and accelerate software delivery.\"Digital BizOps Starter Edition ComponentsDigital BizOps Starter Edition is available as a service to help digital product teams get started quickly. The components are enterprise-grade with few functional limits. The platform is designed to support most digital product initiatives and teams of up to 50 users. There are no time constraints. More details include:Users have access to support though the Broadcom Community as well as product documentation via Broadcom TechDocs.AvailabilityDigital BizOps Starter Edition is available now. To learn more, visit www.broadcom.com/bizops-starter-edition.About Broadcom Broadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com.Broadcom, the pulse logo, Rally, Automic, BlazeMeter, and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.1 https://blogs.wsj.com/riskandcompliance/2018/12/05/businesses-predict-digital-transformation-to-be-biggest-risk-factors-in-2019/ 2 https://www.forbes.com/sites/forbestechcouncil/2018/03/13/why-digital-transformations-fail-closing-the-900-billion-hole-in-enterprise-strategy/#5fedcdbc7b8b3 Gartner, Defining a New Framework for Regulating Digital Society, by Mark McDonald, August 6, 2019, page 7.Press Contact:  Jon PiazzaCorporate Communicationspress.relations@broadcom.comTelephone: 1-408-433-7924"
    },
    {
        "title": "Broadcom Inc. Announces Third Quarter Fiscal Year 2019 Financial Results and Quarterly Dividend",
        "subtitle": "-- Revenue of $5,515 million for the quarter, up 9 percent from the prior year period",
        "date": "Sep 12, 2019 4:15PM EDT",
        "content": "SAN JOSE, Calif., Sept. 12, 2019 /PRNewswire/ -- Broadcom Inc. (Nasdaq: AVGO), a global technology leader that designs, develops and supplies semiconductor and infrastructure software solutions, today reported financial results for its third quarter of fiscal year 2019, ended August 4, 2019, and announced a quarterly dividend.\"Our broad portfolio of mission critical semiconductor and infrastructure software solutions, utilized by the world's largest enterprises, continued to drive sustained revenues and robust cash flow despite a challenging market backdrop,\" said Hock Tan, President and CEO of Broadcom Inc. \"Looking at the semiconductor solutions segment, we believe demand has bottomed out but will continue to remain at these levels due to the current uncertain environment.\"\"During the quarter, we generated over $2.3 billion in free cash flow representing over 8% growth on a year on year basis,\" said Tom Krause, CFO of Broadcom Inc. \"We returned over $2 billion to stockholders in the quarter including $1.1 billion in cash dividends and approximately $1 billion in share repurchases and eliminations. We remain fully committed to maintaining our investment grade credit rating and, looking forward, we intend to focus on deleveraging our balance sheet.\"Third Quarter Fiscal Year 2019 GAAP Results from Continuing OperationsNet revenue was $5,515 million, substantially consistent with $5,517 million in the previous quarter and 8.9 percent higher than $5,063 million in the same quarter last year.Gross margin was $3,034 million, or 55.0 percent of net revenue. This compares with gross margin of $3,089 million, or 56.0 percent of net revenue, in the prior quarter, and gross margin of $2,619 million, or 51.7 percent of net revenue, in the same quarter last year.Operating expenses were $2,169 million. This compares with $2,119 million in the prior quarter and $1,280 million in the same quarter last year.Operating income was $865 million, or 15.7 percent of net revenue. This compares with operating income of $970 million, or 17.6 percent of net revenue, in the prior quarter, and operating income of $1,339 million, or 26.4 percent of net revenue, in the same quarter last year.Net income, which includes the impact of discontinued operations, was $715 million, or $1.71 per diluted share. This compares with net income of $691 million, or $1.64 per diluted share, in the prior quarter, and net income of $1,196 million, or $2.71 per diluted share, in the same quarter last year.Cash from operations was $2,419 million in the quarter, compared to $2,247 million in the same quarter last year.  The Company's cash and cash equivalents at the end of the third fiscal quarter were $5,462 million, compared to $5,328 million at the end of the prior quarter.During the third fiscal quarter, the Company generated $2,419 million in cash from operations and spent $977 million on share repurchases and eliminations, consisting of $736 million in repurchases of 2.6 million shares and $241 million of withholding tax payments related to net settled equity awards that vested in the quarter (representing approximately 0.9 million shares withheld), as well as $112 million on capital expenditures.On July 2, 2019, the Company paid a cash dividend of $2.65 per share of common stock, totaling $1,057 million.Third Quarter Fiscal Year 2019 Non-GAAP Results From Continuing OperationsThe differences between the Company's GAAP and non-GAAP results are described generally under \"Non-GAAP Financial Measures\" below, and presented in detail in the financial reconciliation tables attached to this release.Gross margin from continuing operations was $3,916 million, or 71.0 percent of net revenue. This compares with gross margin from continuing operations of $3,971 million, or 72.0 percent of net revenue, in the prior quarter, and $3,410 million, or 67.3 percent of net revenue, in the same quarter last year.Operating income from continuing operations was $2,910 million, or 52.8 percent of net revenue. This compares with operating income from continuing operations of $2,949 million, or 53.5 percent of net revenue, in the prior quarter, and $2,536 million, or 50.1 percent of net revenue, in the same quarter last year.Net income from continuing operations was $2,281 million, or $5.16 per diluted share. This compares with net income of $2,334 million, or $5.21 per diluted share, in the prior quarter, and net income of $2,257 million, or $4.98 per diluted share, in the same quarter last year.Free cash flow from operations, defined as cash from operations less capital expenditures, was $2,307 million in the quarter, compared to $2,127 million in the same quarter last year.   Other Quarterly Data Fiscal Year 2019 Business OutlookBased on current business trends and conditions, the outlook for continuing operations for fiscal year 2019, ending November 3, 2019, including contributions from CA, is expected to be as follows:    Capital expenditures for the fiscal year are expected to be approximately $500 million. For the fiscal year, depreciation is expected to be $600 million and total intangible amortization is expected to be approximately $5,235 million.The guidance provided above is only an estimate of what the Company believes is realizable as of the date of this release. Among other things, this guidance is based on an initial estimate of purchase accounting adjustments and allocations for CA, Inc., all of which may be revised during the remainder of the measurement period (which will not exceed 12 months from the CA acquisition). The guidance excludes the impact of any future mergers, acquisitions, divestiture and stock repurchase activity that may occur during fiscal year 2019. Actual results will vary from the guidance and the variations may be material. The Company undertakes no intent or obligation to publicly update or revise any of these projections, whether as a result of new information, future events or otherwise, except as required by law.Quarterly DividendThe Company's Board of Directors has approved a quarterly cash dividend of $2.65 per share.The dividend is payable on October 1, 2019 to stockholders of record at the close of business (5:00 p.m. Eastern Time) on September 23, 2019.Financial Results Conference CallBroadcom Inc. will host a conference call to review its financial results for the third quarter of fiscal year 2019, ended August 4, 2019, and discuss guidance for fiscal year 2019, today at 2:00 p.m. Pacific Time. Those wishing to access the call should dial (866) 310-8712; International +1 (720) 634-2946. The passcode is 8385364. A replay of the call will be accessible for one week after the call. To access the replay dial (855) 859-2056; International +1 (404) 537-3406; and reference the passcode: 8385364. A webcast of the conference call will also be available in the \"Investors\" section of Broadcom's website at www.broadcom.com. Basis of PresentationBroadcom Inc. is the successor to Broadcom Limited for financial reporting purposes effective as of the close of trading on April 4, 2018. Information provided for fiscal periods beginning with the fiscal quarter ended May 6, 2018, relates to Broadcom Inc. and for prior fiscal periods relates to Broadcom Limited. Unless the context otherwise requires, references in this press release to \"Broadcom,\" \"the Company,\" \"we,\" \"our,\" \"us\" and similar terms are to Broadcom Inc. and, prior to that time, are to our predecessor, Broadcom Limited.The Company's financial results include contributions from CA, Inc.'s continuing operations starting in the first quarter of fiscal year 2019. The financial results from businesses that have been classified as discontinued operations in the Company's financial statements are not included in the results presented above, unless otherwise stated.Due to the Company's 52/53 week reporting cycle, fiscal year 2018 included an extra week in the first quarter, compared to fiscal year 2019.Non-GAAP Financial MeasuresIn addition to GAAP reporting, Broadcom provides investors with net revenue, net income, operating income, gross margin, operating expenses, cash flow and other data on a non-GAAP basis. This non-GAAP information includes the effect, where applicable, of purchase accounting on revenue, and excludes amortization of acquisition-related intangible assets, stock-based compensation expense, restructuring, impairment and disposal charges, acquisition-related costs, including integration costs, purchase accounting effect on inventory, litigation settlements, impairment on investment, debt-related costs, gain (loss) on extinguishment of debt, gains (losses) on investments, income (loss) from discontinued operations and non-GAAP tax reconciling adjustments. Management does not believe that these items are reflective of the Company's underlying performance. Internally, these non-GAAP measures are significant measures used by management for purposes of evaluating the core operating performance of the Company, establishing internal budgets, calculating return on investment for development programs and growth initiatives, comparing performance with internal forecasts and targeted business models, strategic planning, evaluating and valuing potential acquisition candidates and how their operations compare to the Company's operations, and benchmarking performance externally against the Company's competitors. The exclusion of these and other similar items from Broadcom's non-GAAP financial results should not be interpreted as implying that these items are non-recurring, infrequent or unusual. Free cash flow measures have limitations as they omit certain components of the overall cash flow statement and do not represent the residual cash flow available for discretionary expenditures. Investors should not consider presentation of free cash flow measures as implying that stockholders have any right to such cash. Broadcom's free cash flow may not be calculated in a manner comparable to similarly named measures used by other companies.Broadcom believes this non-GAAP financial information provides additional insight into the Company's on-going performance. Therefore, Broadcom provides this information to investors for a more consistent basis of comparison and to help them evaluate the results of the Company's on-going operations and enable more meaningful period to period comparisons. These non-GAAP measures are provided in addition to, and not as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial data is included in the supplemental financial data attached to this press release.About Broadcom Inc.Broadcom Inc. (NASDAQ: AVGO), a Delaware corporation headquartered in San Jose, CA, is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom's category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation.Cautionary Note Regarding Forward-Looking StatementsThis announcement contains forward-looking statements (including within the meaning of Section 21E of the United States Securities Exchange Act of 1934, as amended, and Section 27A of the United States Securities Act of 1933, as amended) concerning Broadcom. These statements include, but are not limited to, statements that address our expected future business and financial performance and other statements identified by words such as \"will\", \"expect\", \"believe\", \"anticipate\", \"estimate\", \"should\", \"intend\", \"plan\", \"potential\", \"predict\" \"project\", \"aim\", and similar words, phrases or expressions. These forward-looking statements are based on current expectations and beliefs of the management of Broadcom, as well as assumptions made by, and information currently available to, such management, current market trends and market conditions and involve risks and uncertainties, many of which are outside the Company's and management's control, and which may cause actual results to differ materially from those contained in forward-looking statements. Accordingly, you should not place undue reliance on such statements.Particular uncertainties that could materially affect future results include risks associated with: any loss of our significant customers and fluctuations in the timing and volume of significant customer demand; our dependence on contract manufacturing and outsourced supply chain; global economic conditions and concerns; any acquisitions we may make, such as delays, challenges and expenses associated with receiving governmental and regulatory approvals and satisfying other closing conditions, and with integrating acquired businesses with our existing businesses and our ability to achieve the benefits, growth prospects and synergies expected by such acquisitions, including our pending Symantec Corporation transaction; government regulations and trade restrictions; our ability to accurately estimate customers' demand and adjust our manufacturing and supply chain accordingly; our significant indebtedness and the need to generate sufficient cash flows to service and repay such debt; dependence on and risks associated with distributors of our products; dependence on senior management and our ability to attract and retain qualified personnel; international political and economic conditions; involvement in legal or administrative proceedings; our dependency on a limited number of suppliers; quarterly and annual fluctuations in operating results; cyclicality in the semiconductor industry or in our target markets; our competitive performance and ability to continue achieving design wins with our customers, as well as the timing of any design wins; prolonged disruptions of our or our contract manufacturers' manufacturing facilities or other significant operations; our ability to improve our manufacturing efficiency and quality; our dependence on outsourced service providers for certain key business services and their ability to execute to our requirements; our ability to maintain or improve gross margin; our ability to protect our intellectual property and the unpredictability of any associated litigation expenses; compatibility of our software products with operating environments, platforms or third-party products; our ability to enter into satisfactory software license agreements; sales to our government clients; availability of third party software used in our products; use of open source code sources in our products; any expenses or reputational damage associated with resolving customer product warranty and indemnification claims; our ability to sell to new types of customers and to keep pace with technological advances; market acceptance of the end products into which our products are designed; our ability to protect against a breach of security systems; changes in accounting standards; fluctuations in foreign exchange rates; the amount and frequency of our stock repurchases; our provision for income taxes and overall cash tax costs, legislation that may impact our overall cash tax costs and our ability to maintain tax concessions in certain jurisdictions; and other events and trends on a national, regional and global scale, including those of a political, economic, business, competitive and regulatory nature.Our filings with the SEC, which you may obtain for free at the SEC's website at http://www.sec.gov, discuss some of the important risk factors that may affect our business, results of operations and financial condition. Actual results may vary from the estimates provided. We undertake no intent or obligation to publicly update or revise any of the estimates and other forward-looking statements made in this announcement, whether as a result of new information, future events or otherwise, except as required by law.Contact: Broadcom Inc. Beatrice F. Russotto Investor Relations 408-433-8000 investor.relations@broadcom.com         View original content:http://www.prnewswire.com/news-releases/broadcom-inc-announces-third-quarter-fiscal-year-2019-financial-results-and-quarterly-dividend-300917434.htmlSOURCE  Broadcom Inc."
    },
    {
        "title": "Broadcom Unveils Portfolio for RDK Video Accelerator Program",
        "subtitle": "-  RDK powered chipsets enable CPE manufacturers to substantially speed up deployment cycles for service providers",
        "date": "Sep 10, 2019 12:01AM EDT",
        "content": "AMSTERDAM, Sept. 10, 2019 /PRNewswire/ -- In advance of the IBC 2019 Conference, RDK Management and Broadcom Inc. (NASDAQ:AVGO) today announced an expanded relationship in which Broadcom joined the RDK Video Accelerator program and introduced a portfolio of pre-integrated RDK based chipset solutions. Specifically, Broadcom's BCM72180 and BCM72604 Advanced Ultra HD chipsets will enable CPE manufacturers to create different classes of new RDK Video Accelerator set-top boxes (STBs). These chipsets will come pre-integrated with the latest RDK software, RDK application framework, and the Metrological App Store to deliver the highest levels of 4K content and premium audio enabling the optimum viewing experience. RDK Video Accelerators are reference STBs that enable service providers to rapidly develop, test, and launch new video applications, while maintaining control over UIs, consumer-facing applications, and set-top box data. Released January 2019, Broadcom's BCM72180 is the latest generation of Advanced HDR Ultra High Definition (UHD), high-security STB system-on-chip (SoC) devices with 50% higher performance and 50% lower power than the prior generation. Newly integrated technologies include the streaming optimized AV1 UHD IPTV video codec, personalized Far-Field Voice (FFV) control, and 2x2 Wi-Fi 6 for significantly better streaming performance, higher security, and lower power consumption. The flexible BCM72180 supports hybrid (Cable, Satellite, and Terrestrial) and traditional IPTV designs, with and without FFV. Built in the latest CMOS silicon technology, these UHD SoC devices assure operators a very long service life with the highest levels of performance and video quality, plus uncompromising non-host CPU based content and data security. \"Broadcom has always been committed to RDK, and this new effort is aimed at the growing demand for RDK-based video solutions from global OEMs and service providers,\" said Rich Nelson, senior vice president and general manager, Set Top Box and Cable Modem Division at Broadcom. \"By creating pre-integrated chipset platforms, our customers can create compelling new RDK-based STB designs and products and get to market quickly and effectively.\"   \"Broadcom continues to be a dynamic and leading contributor within the RDK community,\" said Steve Heeb, president and general manager of RDK. \"Thanks to Broadcom, OEMs seeking to deliver turnkey RDK video products can now build, test and deploy a range of STBs to meet the various needs of service providers around the world. We're very pleased with their expanded support for the RDK Video Accelerator program and look forward to future collaborations.\"RDK is an open source software platform for the connected home that standardizes core functions used in broadband, video, and IoT connected devices. It enables service providers to manage their devices; control their business models; and customize their apps, UIs and data analytics to improve the customer experience and drive business results. For video, RDK provides a common method to manage video tuning; conditional access; DRM; stream management; diagnostics; and more.Broadcom will showcase its RDK Video Accelerator chipset solutions during the upcoming IBC Conference in Amsterdam at CommScope and Kaon IBC booths. Additional information about the RDK community is available at www.rdkcentral.com. More information about Broadcom is available at www.broadcom.com.    About BroadcomBroadcom Inc. (NASDAQ: AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom's category-leading product portfolio serves critical markets including data center, networking, enterprise software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information, go to www.broadcom.com. About RDK Management RDK Management is an open source consortium that manages RDK for the global community. RDK is an open source software platform for the connected home that standardizes core functions used in broadband, video, and IoT devices. It enables operators to manage their devices; control their business models; and customize their apps, UIs and data analytics to improve the customer experience and drive business results. The RDK community is comprised of more than 400 companies including: CPE manufacturers, SoC vendors, software developers, system integrators, and service providers. For more information on the tools, training, and events provided by RDK Management, please visit: www.rdkcentral.com. About MetrologicalMetrological enables operators to integrate their TV and OTT content into a single viewer experience. The cloud-based Application Platform delivers a complete product suite to onboard and manage apps and premium OTT services on any device. The Metrological Application Framework and WPE WebKit browser deliver a cloud architecture to enable operators to quickly onboard premium OTT services and integrate apps and OTT content into a single viewer experience. Content providers are able to reach over 40 million households across operator networks by adding a single app to the Metrological App Library. Metrological works with cable and telecommunications companies such as Comcast, KPN, Liberty Global, Vodafone, NOS, Turkcell, Tele Columbus, beIN and Ooredoo. Founded in 2005, Metrological is based in The Netherlands with offices in the U.S. and Europe. For more information please visit www.metrological.com.  View original content:http://www.prnewswire.com/news-releases/broadcom-unveils-portfolio-for-rdk-video-accelerator-program-300913382.htmlSOURCE  RDK Management"
    },
    {
        "title": "Broadcom Secures Portfolio License Agreement with TIM",
        "subtitle": "",
        "date": "Sep 9, 2019 12:00PM EDT",
        "content": "SAN JOSE, Calif., Sept.  09, 2019  (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO) today announced that TIM – Telecom Italia, the first telecom operator in Italy, has signed a strategic agreement as a Portfolio License Agreement (PLA) customer. A ground-breaking approach, the agreement will see innovative Broadcom software and hardware combined, accelerating IT solutions— from software to silicon — yielding cutting-edge offerings for TIM’s enterprise infrastructure.Broadcom has a long-term collaboration with TIM that spans several generations of technology and encompasses hardware and software solutions for broadband gateways, wireless networking, central office equipment and mainframe infrastructure. The addition of this new PLA agreement strengthens and broadens this relationship.TIM selected Broadcom’s PLA to support their ongoing efforts to accelerate, streamline, and transform their IT operations. By doing so, the company will drive more value with actionable data and insights that help to deliver exceptional experiences to their end users.Broadcom’s PLA is a simplified, scalable, flexible licensing approach that empowers customers to leverage trusted, robust, proven enterprise software solutions. It spans the entire software development lifecycle from Business and Agile Management to Intelligent Automation and AI-driven operations, with enterprise-scale Continuous Testing and Security.The Broadcom PLA delivers a number of customer benefits, including:“We are pleased to be expanding our relationship with Broadcom with this new PLA,” said Raimondo Zizza, chief information officer, TIM. “With this agreement we can optimize our products, expend our strategy of improve productivity and reduce costs, while providing a first-class digital infrastructure for our customer base.” “Broadcom’s PLA offers customers an open, integrated enterprise software platform, to facilitate digital business transformation,” said Ashok Reddy, senior vice president and general manager, Enterprise Software Division at Broadcom. “Coupled with our software to silicon offerings, the PLA will help TIM get the most out of their technology investments and continue evolving the means for building a modern digital enterprise.”The Broadcom PLA is available now to strategic accounts worldwide. For more information on Broadcom PLA, please contact your regional Broadcom sales representative.About BroadcomBroadcom Inc. (NASDAQ:AVGO) is a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Broadcom’s category-leading product portfolio serves critical markets including data center, networking, software, broadband, wireless, storage and industrial. Our solutions include data center networking and storage, enterprise and mainframe software focused on automation, monitoring and security, smartphone components, telecoms and factory automation. For more information go to www.broadcom.com.Broadcom, the pulse logo, and Connecting everything are among the trademarks of Broadcom. The term \"Broadcom\" refers to Broadcom Inc., and/or its subsidiaries. Other trademarks are the property of their respective owners.Press Contact:Jon PiazzaBroadcom Inc.press.relations@broadcom.com408-433-7924"
    }
]