[
    {
        "title": "Baidu Announces Fourth Quarter and Fiscal Year 2019 Results",
        "subtitle": "",
        "date": "Feb 27, 2020 4:30PM EST",
        "content": "BEIJING, Feb. 27, 2020 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU) (\"Baidu\" or the \"Company\"), a leading search engine, knowledge and information centered Internet platform and AI company, today announced its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2019[1].\"We finished 2019 making tremendous progress in strengthening Baidu's mobile ecosystem. Through the building blocks of BJH publisher accounts, Smart Mini Program and Managed Page, Baidu App provides users single log-on, native-app-like experience to a wide range of information and services dispersed across isolated mobile apps and HTML5 websites. Baidu App's spanning mobile ecosystem has resulted in more users logging in, DAUs growing robustly to 195 million in December, up 21% year over year, and in-app search queries increasing almost 30% year over year,\" said Robin Li, Chairman and CEO of Baidu. \"Baidu new AI businesses have also made great strides in 2019, as we built leadership in smart devices, smart transportation and enterprise cloud solutions with Baidu's leading AI technologies.\" \"Baidu delivered solid fourth quarter results with increasing year-over-year revenue growth rate, allowing 2019 revenue to reach RMB 107 billion, or US$15.4 billion,\" said Herman Yu, CFO of Baidu. \"Baidu's quarterly operating margin has also been improving, through the strengthening of Baidu's mobile ecosystem and our focus on resource investment returns. Our leaner financial model and strong balance sheet put us in a good position to weather the slowing macro, while continuing to invest heavily in technology and new businesses, to optimize future growth.\"Fourth Quarter 2019 Financial Highlights Fiscal Year 2019 Financial HighlightsOther Highlights CorporateMobile EcosystemDuerOSCloud, AI Services & AI Platform  ApolloiQIYIFourth Quarter 2019 Results Total revenues reached RMB 28.9 billion ($4.15 billion), up 6% year over year and 3% quarter over quarter. Online marketing revenues were RMB 20.8 billion ($2.98 billion), decreasing 2% year over year and increasing 2% quarter over quarter. Other revenues were RMB 8.1 billion ($1.17 billion), increasing 35% year over year, driven mainly by the strong growth in cloud services, smart devices and iQIYI membership. Revenue from Baidu Core reached RMB 21.7 billion ($3.12 billion), increasing 6% year over year and 3% quarter over quarter. Revenue from iQIYI reached RMB 7.5 billion ($1.08 billion), up 7% year over year. iQIYI membership revenue grew 21% year over year, offset by online advertising revenue declining 15% year over year.Cost of revenues, were RMB 15.5 billion ($2.23 billion), decreasing 1% year over year, primarily due to a decrease in content costs and traffic acquisition costs, offset by increases in hardware and cloud cost of goods sold, impairment and amortization of intangible assets and depreciation expenses.Selling, general and administrative expenses were RMB 4.0 billion ($568 million), decreasing 33% year over year, primarily due to decreased investment in channel spending and promotional marketing, as well as lower personnel related expenses.Research and development expenses were RMB 4.8 billion ($683 million), increasing 5% year over year, primarily due to an increase in personnel related expenses.Operating income was RMB 4.7 billion ($669 million) and operating margin was 16%. Baidu Core operating income was RMB 6.9 billion ($987 million), and Baidu Core operating margin was 32%. Non-GAAP operating income was RMB 6.8 billion ($970 million), and non-GAAP operating margin was 23%. Non-GAAP Baidu Core operating income was RMB 8.5 billion ($1.22 billion), and non-GAAP Baidu Core operating margin was 39%.                Total other income was RMB 699 million ($101 million), compared to total other loss of RMB 60 million for Q4 2018.Income tax expense was RMB 304 million ($44 million), compared to RMB 484 million in Q4 2018.Net income attributable to Baidu was RMB 6.3 billion ($ 911 million), and diluted earnings per ADS was RMB 18 ($2.62). Net income attributable to Baidu Core was RMB 7.4 billion ($1.07 billion). Non-GAAP net income attributable to Baidu was RMB 9.2 billion ($1.32 billion), and non-GAAP net margin was 32%. Non-GAAP diluted earnings per ADS amounted to RMB 27 ($3.81). Non-GAAP net income attributable to Baidu Core was RMB 10.0 billion ($1.43 billion), and non-GAAP net margin for Baidu Core was 46%.Adjusted EBITDA was RMB 8.2 billion ($1.17 billion) and adjusted EBITDA margin was 28%. Adjusted EBITDA to Baidu Core was RMB 9.8 billion ($1.41 billion) and adjusted EBITDA margin for Baidu Core was 45%. As of December 31, 2019, cash, cash equivalents, restricted cash and short-term investments were RMB 147.4 billion ($21.17 billion), and cash, cash equivalents, restricted cash and short-term investments excluding iQIYI were RMB 135.9 billion ($19.52 billion). Free cash flow was RMB 10.1 billion ($1.46 billion). Free cash flow excluding iQIYI was RMB 8.0 billion ($1.15 billion).Fiscal Year 2019 ResultsTotal revenues reached RMB 107.4 billion ($15.43 billion), increasing 5% year over year, or 8% year over year, excluding the impact of announced divestures2. Online marketing revenues were RMB 78.1 billion ($11.22 billion), decreasing 5 % year over year. Other revenues were RMB 29.3 billion ($4.21 billion), increasing 44% year over year, driven mainly by the strong growth in iQIYI membership, cloud services and smart devices. Revenue from Baidu Core reached RMB 79.7 billion ($11.45 billion), increasing 2% year over year, or increasing 6% year over year, excluding the impact of announced divestures2. Revenue from iQIYI reached RMB 29.0 billion ($4.17 billion), up 16% year over year. iQIYI membership revenue grew 36% year over year, offset by online advertising revenue declining 11% year over year.Cost of revenues were RMB 62.9 billion ($9.03 billion), increasing 21% year over year, primarily due to increases in hardware and cloud cost of goods sold, content costs, depreciation expense, traffic acquisition costs and bandwidth costs.Selling, general and administrative expenses were RMB 19.9 billion ($2.86 billion), increasing 4% year over year. Research and development expenses were RMB 18.3 billion ($2.64 billion), increasing 16% year over year, primarily due to an increase in personnel related expenses.Operating income was RMB 6.3 billion ($906 million) and operating margin was 6%. Baidu Core operating income was RMB 15.3 billion ($2.19 billion), and Baidu Core operating margin was 19%. Non-GAAP operating income was RMB 12.8 billion ($1.84 billion), and non-GAAP operating margin was 12%. Non-GAAP Baidu Core operating income was RMB 20.3 billion ($2.92 billion), and non-GAAP Baidu Core operating margin was 25%.Total other loss was RMB 6.6 billion ($955 million), mainly due to loss on equity investment arising from other-than-temporary decline, compared to total other income of RMB 11.8 billion for 2018, which was mainly due to disposal gains from Du Xiaoman and Global DU businesses. In Q4 2015, following a transaction where the Company exchanged shares of its majority-owned subsidiary Qunar for a minority stake in Trip.com, the Company deconsolidated Qunar, recorded its investment in Trip.com at the closing-date market value and recognized a non-cash accounting gain of RMB 24.4 billion. Since then, the market value of Trip.com shares has declined, and the continued low market price in 2019 resulted in the Company recognizing a non-cash impairment loss of RMB 8.9 billion in Q3 2019. In October 2019, the Company sold down its holding in Trip.com, reducing its interest from 19% to 12% of Trip.com's outstanding shares.Income tax expense was RMB 1.9 billion ($279 million), compared to RMB 4.7 billion in 2018. The decrease in income tax expense was mainly due to lower taxable income from Baidu Core.Net income attributable to Baidu was RMB 2.1 billion ($296 million), and diluted earnings per ADS was RMB 6 ($0.80). Net income attributable to Baidu Core was RMB 7.6 billion ($1.09 billion). Non-GAAP net income attributable to Baidu was RMB 18.2 billion ($2.61 billion), and non-GAAP net margin was 17%. Non-GAAP diluted earnings per ADS amounted to RMB 52 ($7.48). Non-GAAP net income attributable to Baidu Core was RMB 22.8 billion ($3.28 billion), and non-GAAP net margin for Baidu Core was 29%.Adjusted EBITDA was RMB 18.4 billion ($2.65 billion) and adjusted EBITDA margin was 17%. Adjusted EBITDA to Baidu Core was RMB 25.5 billion ($3.66 billion) and adjusted EBITDA margin for Baidu Core was 32%. Free cash flow was RMB 22.0 billion ($3.17 billion). Free cash flow excluding iQIYI was RMB 18.9 billion ($2.71 billion).Financial Guidance For the first quarter of 2020, Baidu expects revenues to be between RMB 21.0 billion ($3.0 billion) and RMB 22.9 billion ($3.3 billion), representing a decline of 5% to 13% year over year, which assumes that Baidu Core revenue will decline between 10% and 18% year over year. The Coronavirus situation in China is evolving, and business visibility is very limited. The above forecast reflects Baidu's current and preliminary view, which is subject to substantial uncertainty. Conference Call Information Baidu's management will hold an earnings conference call at 8:15 PM on February 27, 2020, U.S. Eastern Time (9:15 AM on February 28, 2020, Beijing/Hong Kong Time). Dial-in details for the earnings conference call are as follows:A replay of the conference call may be accessed by phone at the following number until March 6, 2020:Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com.About BaiduBaidu, Inc. is a leading search engine, knowledge and information centered Internet platform and AI company. The Company's mission is to make a complicated world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share.ContactsInvestors Relations, Baidu, Inc. Tel: +86-10-5992-8888Email: ir@baidu.com Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. Among other things, the outlook for the first quarter of 2020, quotations from management in this announcement, as well as Baidu's and other parties' strategic and operational plans, contain forward-looking statements. Baidu may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including but not limited to statements about Baidu's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: Baidu's growth strategies; its future business development, including development of new products and services; its ability to attract and retain users and customers; competition in the Chinese Internet search and newsfeed market; competition for online marketing customers; changes in the Company's revenues and certain cost or expense items as a percentage of its revenues; the outcome of ongoing, or any future, litigation or arbitration, including those relating to intellectual property rights; the expected growth of the Chinese-language Internet search and newsfeed market and the number of Internet and broadband users in China; Chinese governmental policies relating to the Internet and Internet search providers, and general economic conditions in China and elsewhere. Further information regarding these and other risks is included in the Company's annual report on Form 20-F and other documents filed with the Securities and Exchange Commission. Baidu does not undertake any obligation to update any forward-looking statement, except as required under applicable law. All information provided in this press release and in the attachments is as of the date of the press release, and Baidu undertakes no duty to update such information, except as required under applicable law.Non-GAAP Financial MeasuresTo supplement Baidu's consolidated financial results presented in accordance with GAAP, Baidu uses the following non-GAAP financial measures: non-GAAP operating income (loss), non-GAAP operating margin, non-GAAP net income (loss) attributable to Baidu, non-GAAP net margin, non-GAAP diluted earnings per ADS, adjusted EBITDA, adjusted EBITDA margin and free cash flow. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with GAAP. Baidu believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding certain items that may not be indicative of its recurring core business operating results, such as operating performance excluding not only non-cash charges, but also other items that are infrequent or unusual in nature. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning and forecasting future periods. These non-GAAP financial measures also facilitate management's internal comparisons to Baidu's historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors in allowing for greater transparency with respect to supplemental information used by management in its financial and operational decision making. A limitation of using these non-GAAP financial measures is that these non-GAAP measures exclude certain items that have been and will continue to be for the foreseeable future a significant component in the Company's results of operations. These non-GAAP financial measures presented here may not be comparable to similarly titled measures presented by other companies. Other companies may calculate similarly titled measures differently, limiting their usefulness as comparative measures to the Company's data. Non-GAAP operating income represents operating income excluding share-based compensation expenses and amortization of intangible assets resulting from business combinations. Non-GAAP net income attributable to Baidu represents net income attributable to Baidu excluding share-based compensation expenses, amortization and impairment of intangible assets resulting from business combinations, disposal gain or loss, impairment of long-term investments, fair value change of long-term investments, adjusted for related income tax effects. Baidu's share of equity method investments for these non-GAAP reconciling items, amortization of intangible assets not on the investees' books, accretion of their redeemable non-controlling interests, and the gain or loss associated with the issuance of shares by the investees at a price higher or lower than the carrying value per shares, adjusted for related income tax effects, are also excluded. Non-GAAP diluted earnings per ADS represents diluted earnings per ADS calculated by dividing non-GAAP net income attributable to Baidu, which is adjusted for accretion for the redeemable non-controlling interests, by the weighted average number of ordinary shares expressed in ADS. Adjusted EBITDA represents operating income excluding depreciation, amortization of intangible assets resulting from business combinations, and share-based compensation expenses. Free cash flow represents net cash provided by operating activities less capital expenditures.For more information on non-GAAP financial measures, please see the tables captioned \"Reconciliations of non-GAAP financial measures to the nearest comparable GAAP measures.\"                       View original content:http://www.prnewswire.com/news-releases/baidu-announces-fourth-quarter-and-fiscal-year-2019-results-301012829.htmlSOURCE  Baidu, Inc."
    },
    {
        "title": "New Report from Facemoji Keyboard Shows Most Popular Emoji on Dating Apps in the US",
        "subtitle": "",
        "date": "Feb 11, 2020 9:00AM EST",
        "content": "\nFindings Released Ahead of Valentine’s Day\n    SAN FRANCISCO--(BUSINESS WIRE)--\nBaidu, Inc. (Nasdaq: BIDU) today released a report that outlines the most frequently-used emoji from Facemoji Keyboard on popular dating apps Bumble, Hinge, Match, OkCupid, Plenty of Fish and Tinder in the United States.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200211005126/en/Baidu released a report outlining the most frequently-used emoji from Facemoji Keyboard on popular dating apps Bumble, Hinge, Match, OkCupid, Plenty of Fish and Tinder in the United States. (Graphic: Business Wire)\nKey insights from the report include: \n\n“Emoji are great for expressing emotion, which is why they’re so popular on dating apps,” said Mr. Jiang Feng, director of Baidu Global Business Unit. “Interestingly, not all emoji are universally popular across all dating apps. Our findings show that dating app communities have evolved specific usage habits for different emoji.”\n\nAbout Facemoji Keyboard\n\nFacemoji Keyboard is an emoji-centric keyboard app featuring Baidu’s speech recognition technology. It includes an emoji prediction feature and a wide variety of stickers, GIFs and customizable keyboards. Facemoji Keyboard’s goal is to help people around the world express themselves in new ways with fun, creative emoji.\n\nAbout Baidu\n\nBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005126/en/\nThe Hoffman Agency\nShannon Nelson\n408-286-2611\nsnelson@hoffman.com\nSource: Baidu, Inc."
    },
    {
        "title": "Baidu to Report Fourth Quarter and Fiscal Year 2019 Financial Results on February 27, 2020, and Updates its Financial Guidance",
        "subtitle": "",
        "date": "Jan 31, 2020 4:30PM EST",
        "content": "BEIJING, Jan. 31, 2020 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU) (\"Baidu\" or the \"Company\"), the leading Chinese language Internet search provider, today announced that the reporting date for its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2019 has been revised to February 27, 2020, and it has updated its guidance for the fourth quarter of 2019 below.Baidu has revised the date to announce its unaudited financial results for the fourth quarter and fiscal year of 2019, due to the evolving situation brought upon by the outbreak of the novel coronavirus in China. To help control the epidemic, the Company is taking precautionary measures, including extending its employees' Chinese New Year holiday, which was originally scheduled from January 24, 2020 to January 30, 2020, and requesting employees to work from home for a time period after the holiday.In light of the evolving situation, Baidu has revised the reporting date for its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2019, to after the U.S. market closes on February 27, 2020. Baidu's management will hold an earnings conference call at 8:15 PM on February 27, 2020, U.S. Eastern Time (9:15 AM on February 28, 2020, Beijing/Hong Kong Time). The revised date would give the Company more time to observe the business condition for the first quarter of 2020.Financial GuidanceFor the fourth quarter 2019, Baidu expects revenue to be in the range of RMB 28.3 billion ($4.06 billion) to RMB 28.9 billion ($4.15 billion)[1], increasing 4% to 6% year over year, compared to its previous guidance in the range of RMB 27.1 billion to RMB 28.7 billion, or -1% to 6% increase year over year. This forecast assumes that Baidu Core revenue will grow between 4% to 6% year over year, compared to the previous guidance between 0% to 6% year over year. In addition, Baidu expects net income attributable to Baidu to be in the range of RMB 6.2 billion ($0.89 billion) to RMB 6.7 billion ($0.97 billion), which assumes that net income attributable to Baidu Core will grow between 83% to 90% year over year. Baidu also expects non-GAAP net income attributable to Baidu to be in the range of RMB 8.9 billion ($1.28 billion) to RMB 9.4 billion ($1.36 billion), which assumes that non-GAAP net income attributable to Baidu Core will grow between 50% to 55% year over year. Reconciling items from non-GAAP financial measure to GAAP measure are discussed below in the \"Non-GAAP Financial Measure\" section.The above forecast reflects Baidu's current and preliminary view, which is subject to substantial uncertainty. Conference Call Information Baidu's management will hold an earnings conference call at 8:15 PM on February 27, 2020, U.S. Eastern Time (9:15 AM on February 28, 2020, Beijing/Hong Kong Time). Dial-in details for the earnings conference call are as follows:A replay of the conference call may be accessed by phone at the following number until March 6, 2020:Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share.Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"forecast,\" \"confident\" and similar statements. Among other things, the outlook for the fourth quarter 2019 in this announcement contains forward-looking statements. Baidu may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about Baidu's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement. Further information regarding these and other risks is included in our annual report on Form 20-F and other documents filed with the Securities and Exchange Commission. Baidu does not undertake any obligation to update any forward-looking statement, except as required under applicable law.  All information provided in this press release is as of the date of the press release, and Baidu undertakes no duty to update such information, except as required under applicable law.Non-GAAP Financial MeasureNon-GAAP net income attributable to Baidu represents net income attributable to Baidu excluding share-based compensation expenses, amortization and impairment of intangible assets resulting from business combinations, disposal gain or loss, impairment of long-term investments, fair value change of long-term investments, adjusted for related income tax effects. Baidu's share of equity method investments for these non-GAAP reconciling items, amortization of intangible assets not on the investees' books, accretion of their redeemable noncontrolling interests, and the gain or loss associated with the issuance of shares by the investees at a price higher or lower than the carrying value per shares, adjusted for related income tax effects, are also excluded.For investor and media inquiries, please contact: Investors Relations, Baidu, Inc. Tel: +86-10-5992-8888 Email: ir@baidu.com View original content:http://www.prnewswire.com/news-releases/baidu-to-report-fourth-quarter-and-fiscal-year-2019-financial-results-on-february-27-2020-and-updates-its-financial-guidance-300996865.htmlSOURCE  Baidu, Inc."
    },
    {
        "title": "Baidu to Report Fourth Quarter and Fiscal Year 2019 Financial Results on February 6, 2020",
        "subtitle": "",
        "date": "Jan 21, 2020 7:00AM EST",
        "content": "BEIJING, Jan. 21, 2020 /PRNewswire/ -- Baidu, Inc. (Nasdaq: BIDU), the leading Chinese language Internet search provider, today announced that it will report its financial results for the fourth quarter and fiscal year ended December 31, 2019, after the U.S. market closes on February 6, 2020. Baidu's management will hold an earnings conference call at 8:15 PM U.S. Eastern Time on February 6, 2020 (9:15 AM Beijing Time on February 7, 2020).Dial-in details for the earnings conference call are as follows:A replay of the conference call may be accessed by phone at the following number until February 14, 2020:Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share.For investor inquiries, please contact:Investors Relations, Baidu, Inc.Tel: +86-10-5992-8888Email: ir@baidu.com View original content:http://www.prnewswire.com/news-releases/baidu-to-report-fourth-quarter-and-fiscal-year-2019-financial-results-on-february-6-2020-300989473.htmlSOURCE  Baidu, Inc."
    },
    {
        "title": "Baidu Announces Smart Words Prediction Feature on Facemoji Keyboard App",
        "subtitle": "",
        "date": "Jan 14, 2020 9:00AM EST",
        "content": "\nNew Feature Increases Predictive Text Accuracy to 91.6%\n    SAN FRANCISCO--(BUSINESS WIRE)--\nBaidu, Inc. (Nasdaq: BIDU) today announced a new Smart Words Prediction feature on its Facemoji Keyboard app, which has been found to increase prediction accuracy for frequently used phrases from 53.2% to 91.6% in a test scenario.\n\nThe Smart Words Prediction feature uses a cloud-based 5-gram language model that references up to four words that a user inputs to intelligently recommend words and phrases based on context. Given that users are more likely to input phrases as opposed to single words, Facemoji Keyboard utilizes machine learning methods for phrase mining to intelligently suggest the next part of a common phrase. For example, when a user types in “Nice to,” the Smart Words Prediction feature will suggest “see you” to complete the sentence. By leveraging cloud technology, Facemoji Keyboard can also suggest trending topics and phrases in real time based on what a user has typed.\n\nIn addition to Smart Words Prediction, Facemoji Keyboard also offers the following cutting-edge features to its users leveraging Baidu’s technology:\n\n“Facemoji’s technology makes hands-free texting super easy — with absolutely no chance of embarrassing typos or faux pas,” said Mr. Jiang Feng, director of Baidu’s Global Business Unit. “We now have unparalleled word and emoji prediction, and the most accurate voice-to-text in the industry.”\n\nThe latest version of Facemoji Keyboard for Android is available on the Google Play Store. Follow Facemoji Keyboard on Instagram at www.instagram.com/FacemojiKeyboard or on Facebook at www.facebook.com/FacemojiKeyboard.\n\nAbout Facemoji Keyboard\n\nFacemoji Keyboard is an emoji-centric keyboard app featuring Baidu’s speech recognition technology. It includes an emoji prediction feature and a wide variety of stickers and customizable keyboards. Facemoji Keyboard’s goal is to help people around the world express themselves in new ways with fun, creative emoji.\n\nAbout Baidu\n\nBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005295/en/\nThe Hoffman Agency\nShannon Nelson\n408-286-2611\nsnelson@hoffman.com\nSource: Baidu, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Applied Materials, Amazon.com, Baidu, Lam Research, or NVIDIA?",
        "subtitle": "",
        "date": "Jan 10, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 10, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMAT, AMZN, BIDU, LRCX, and NVDA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast. (Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-applied-materials-amazoncom-baidu-lam-research-or-nvidia-300984887.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Search Queries for Baidu's Knowledge Content Reach 1.54 Billion Per Day",
        "subtitle": "",
        "date": "Dec 17, 2019 7:51AM EST",
        "content": " BEIJING, Dec. 17, 2019 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU) announced at the Baidu Knowledge Summit 2019 that the number of daily search queries for its knowledge content has reached 1.54 billion, with Baidu's diverse platforms and high-quality content driving traffic amid increasing search demands from users, affirming Baidu's position as China's largest knowledge and information provider.\"With users' evolving knowledge consumption needs, Baidu has been working to enhance the quality of our knowledge content and strengthen the offerings of our video content, as we aim to make high-quality and reliable content more accessible in an efficient way,\" said Yu Ruan, General Manager of Baidu Knowledge, at the summit held in Beijing on December 12. \"As a result, people will have an equal opportunity to know more about the world.\"Baidu's Diverse Platforms Meet Users' Varied Content DemandsBaidu's knowledge-based products include Baidu Wiki, which features high-quality content compiled by experts in specialized fields; Baidu Knows, a query-based searchable knowledge and experiences-sharing community; Baidu Wenku, for sharing documents; and Baidu Experience, for sharing how-to content. Baby Knows, a query-based platform for maternity and child-care content, and Baidu Scholar, a search platform for academic resources, further enrich Baidu's knowledge content. Together, these knowledge-based products cover a wide-range of areas, allowing Baidu to meet users' information demands, thus increasing user stickiness and time spent.At present, Baidu Wiki includes 16.37 million entries; Baidu Knows hosts 550 million questions and Baby Knows hosts 92 million questions that have been answered effectively; Baidu Wenku provides 620 million online documents; Baidu Experience contains 5.79 million pieces of content; and Baidu Scholar indexes more than 1.2 million Chinese and international academic websites and over 500 million academic resources. Baidu is continuing to consolidate its position as China's largest information and knowledge provider. Around 40,000 organizations, such as the National Center for Philosophy and Social Sciences Documentation, have partnered with Baidu to provide high-quality content, amounting to more than 200 million pieces. At the summit, Baidu Wiki also signed new partnership agreements with the Encyclopedia of China Publishing House, Guinness World Records, iGet, and CITIC to leverage their expertise in various fields to further strengthen Baidu's knowledge content ecosystem.Baidu Identifies Growth Potential in Audio and Video Knowledge ContentThe development of technologies like 5G will further transform users' knowledge content consumption habits. As mobile networks become more advanced, users will browse and download more audio and video content, shifting away from text and image content.   \"We hope to see more diverse, timely, easy-to-understand, lively, and interesting short video content to push knowledge barriers and make it easier for people to access knowledge,\" Ruan said.At the Baidu Knowledge Summit 2019, Baidu also announced a new project called \"Xingzhi\", which aims to incubate 10,000 video producers to create content focused on promoting science knowledge and life experiences. About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler for users and enterprises through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU.\" Currently, ten ADSs represent one Class A ordinary share.Media Contact Intlcomm@baidu.com  View original content:http://www.prnewswire.com/news-releases/search-queries-for-baidus-knowledge-content-reach-1-54-billion-per-day-300976051.htmlSOURCE  Baidu"
    },
    {
        "title": "Baidu Launches Xiaodu Smart Display X8 with Revamped Features for Enriching Home Life",
        "subtitle": "",
        "date": "Dec 12, 2019 1:41PM EST",
        "content": "BEIJING, Dec.  12, 2019  (GLOBE NEWSWIRE) -- Baidu, Inc. (NASDAQ: BIDU) on Thursday unveiled the Xiaodu Smart Display X8, customized for the evolving needs of China’s households with advanced AI-powered interaction capabilities and an enhanced “Children’s Mode”.The Xiaodu Smart Display X8 is equipped with a suite of upgraded AI-powered functions that allow users to interface seamlessly with the device, including full-duplex continued conversation, far-field voice interaction, facial recognition, hand gesture control, and eye gesture detection. The X8 boasts an extensive new content services ecosystem for family entertainment, which includes home feed, videos, live streaming, music, games, and online education programs for children of different ages. Intelligent interaction and user experience are further enhanced through the X8’s built-in AI model evolution and self-learning AI system, enabling the device to better understand users’ preferences and anticipate their needs over time.As a result of constant product innovation, the Children’s Mode of the Xiaodu Smart Display X8 includes an eye-protection function and an assistant function to help look after children. The Children’s Mode uses facial recognition technology to recognize when children are using the device and protects them from inappropriate content, long screen time, and proximity to the screen.“China's smart speaker market is now larger than the smart TV market, and smart speakers are gradually becoming a necessity for Chinese households. The growth of the market in the next three years will be driven by smart displays,” said Kun Jing, Vice President of Baidu and General Manager of Baidu Smart Living Group, at the X8 launch event at the Laoshe Teahouse in Beijing.“Intelligent interaction, intelligent comprehension, and a new content services ecosystem are three important elements for the development of smart displays,” he said, noting that Baidu will continue to explore imaginative scenarios for the future as a smart display pioneer.The X8 has an 8-inch FullView IPS display, with a 1280x800 resolution and a viewing angle of 80 degrees from all directions. The touchscreen supports five simultaneous touches and responds within 10 milliseconds. The display is tilted at 105 degrees to make viewing more comfortable for users, and the device is equipped with a high-performing 4 microphone array.Baidu’s launch of the X8 comes on the heels of a report on the “intelligence level” of devices recently issued by a research unit of the Chinese Academy of Sciences (CAS), which affirmed Baidu’s leading position in AI-powered smart devices. In the report, the CAS’s R&D Center for Internet of Things assessed the smart speaker products of China’s four largest players, evaluating the “intelligence” of devices across three distinct technological capabilities: automatic speech recognition, natural language understanding, and content recommendation. The corresponding indicators used to measure these capabilities were “speech recognition”, “intent comprehension”, and user satisfaction.  Xiaodu smart devices ranked as top performers across all three indicators, scoring more than 90% in speech recognition and comprehension rates, according to the report, which constitutes the most authoritative review of China’s smart speaker market published to date. The CAS is China’s leading academic institution in the natural sciences, functioning as both the national scientific think tank and academic governing body.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler for users and enterprises through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.Media ContactIntlcomm@baidu.comA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/fa1cdbef-3cd8-45a2-acab-be9ffb1b1ea7"
    },
    {
        "title": "Baidu’s Facemoji Keyboard Releases Kaomoji Report",
        "subtitle": "",
        "date": "Dec 11, 2019 9:00AM EST",
        "content": "\nReport Reveals Most Popular Kaomoji of 2019 and Insights from 17 Countries\n    SAN FRANCISCO--(BUSINESS WIRE)--\nAs 2019 comes to a close, Baidu, Inc. (Nasdaq: BIDU) today released a report revealing the most popular kaomoji used globally on its Facemoji Keyboard and Simeji apps throughout the year, as well as other findings and trends.\n\nKaomoji is a popular Japanese emoticon style first popularized in 1986 that consists of Japanese characters and punctuation, and is used to express emotion in digital communication. The term kaomoji is derived from the combination of two words: “kao” meaning “face”, and “moji” meaning “character.”\n\nBaidu’s 2019 Kaomoji Report found the following:\n\nOn social media:\n\n“Kaomoji are an important part of digital culture in Asia, and we are thrilled to see them growing in popularity around the globe,” said Mr. Jiang Feng, director of Baidu’s Global Business Unit. “As 2019 winds down, we want to take a moment to recognize the kaomoji trends of the year and celebrate their significance.”\n\nThe report references fully anonymized data from 17 countries, including the United States, Argentina, Brazil, Egypt, France, India, Indonesia, Iraq, Italy, Japan, Mexico, Russia, Spain, Thailand, Turkey, the United Kingdom and Vietnam. The report data includes the most popular kaomoji used on Facemoji Keyboard and Simeji in 2019 by country and by app, including Facebook, Twitter, Instagram, Snapchat and WhatsApp.\n\nTo read the full 2019 Kaomoji Report, click here.\n\nAbout Facemoji Keyboard\n\nFacemoji Keyboard is an emoji-centric keyboard app featuring Baidu’s speech recognition technology. It includes an emoji prediction feature and a wide variety of stickers, GIFs and customizable keyboards. Facemoji Keyboard’s goal is to help people around the world express themselves in new ways with fun, creative emoji.\n\nAbout Simeji \n\nSimeji is the No. 1 keyboard app in Japan on both iOS and Android, with over 38 million downloads. With Simeji, people can express themselves like never before with kaomoji, animated stickers, customized keyboard skins and more.\n\nAbout Baidu\n\nBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005276/en/\nThe Hoffman Agency\nShannon Nelson\n408-286-2611\nsnelson@hoffman.com\nSource: Baidu, Inc."
    },
    {
        "title": "Baidu Leads the Way in Innovation with 5,712 Artificial Intelligence Patent Applications",
        "subtitle": "",
        "date": "Dec 6, 2019 1:27PM EST",
        "content": "BEIJING, Dec.  07, 2019  (GLOBE NEWSWIRE) -- Baidu, Inc. (NASDAQ: BIDU) has filed the most AI-related patent applications in China, a recognition of the company’s long-term commitment to driving technological advancement, a recent study from the research unit of China’s Ministry of Industry and Information Technology (MIIT) has shown.Baidu filed a total of 5,712 AI-related patent applications as of October 2019, ranking No.1 in China for the second consecutive year. Baidu’s patent applications were followed by Tencent (4,115), Microsoft (3,978), Inspur (3,755), and Huawei (3,656), according to the report issued by the China Industrial Control Systems Cyber Emergency Response Team, a research unit under the MIIT.“Baidu retained the top spot for AI patent applications in China because of our continuous research and investment in developing AI, as well as our strategic focus on patents,” said Victor Liang, Vice President and General Counsel of Baidu.“In the future, we will continue to increase our investments into securing AI patents, especially for high-value and high-quality patents, to provide a solid foundation for Baidu’s AI business and for our development of world-leading technology,” he said. The report showed that Baidu is the patent application leader in several key areas of AI. These include deep learning (1,429), natural language processing (938), and speech recognition (933). Baidu also leads in the highly competitive area of intelligent driving, with 1,237 patent applications, a figure that surpasses leading Chinese universities and research institutions, as well as many international automotive companies. With the launch of the Apollo open source autonomous driving platform and other intelligent driving innovations, Baidu has been committed to pioneering the intelligent transformation of the mobility industry.After years of research, Baidu has developed a comprehensive AI ecosystem and is now at the forefront of the global AI industry. Moving forward, Baidu will continue to conduct research in the core areas of AI, contribute to scientific and technological innovation in China, and actively push forward the application of AI into more vertical industries. Baidu is positioned to be a global leader in a wave of innovation that will transform industries.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler for users and enterprises through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.Media ContactIntlcomm@baidu.comA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/300812be-c1a6-44c4-af8c-fbc0a0613019"
    },
    {
        "title": "Baidu Keyboard Apps Surpass 40 Million Users",
        "subtitle": "",
        "date": "Dec 4, 2019 9:00AM EST",
        "content": "\nBaidu’s AI Technology and Partnerships with Paramount Pictures, Sony Pictures and Sanrio Deliver Engaging Content\n    SAN FRANCISCO--(BUSINESS WIRE)--\nBaidu, Inc. (Nasdaq: BIDU) today announced that their Facemoji Keyboard and Simeji apps have reached the milestone of 40 million users and 100 million downloads.\n\nFacemoji Keyboard and Simeji support 120 languages and offer extensive emoji, sticker and GIF selections, as well as sophisticated technology features such as augmented reality (AR) emoji, smart emoji prediction and voice-to-text transcription.\n\nIn addition, through partnerships with Paramount Pictures, Sony Pictures and Sanrio, Baidu’s keyboard apps feature well-known characters that include Bumblebee, Aggretsuko and more. Simeji, the No. 1 keyboard in Japan, also features an extensive library of over 50,000 kaomoji, emoticons made from Japanese characters and punctuation.\n\n“Reaching this milestone is a validation of our commitment to product innovation and user experience,” said Charles Zhang, general manager of Baidu’s Global Business Unit (GBU). “We’ll continue to leverage emerging technology and build partnerships with leading content providers to deliver an unrivaled experience to our users.”\n\nFacemoji Keyboard and Simeji, which are products of Baidu’s GBU, are available for iOS and Android smartphone users across 190 countries, including the United States, Japan and India, among others.\n\nBaidu’s GBU focuses on bridging the gap between Eastern and Western markets with its consumer and business-focused internet products and services. In addition to keyboard apps Simeji and Facemoji Keyboard, the Baidu GBU product portfolio also includes content recommendation platform popIn and ad platform MediaGo, which serve Chinese advertisers looking to reach consumers overseas.\n\nAbout Facemoji Keyboard\n\nFacemoji Keyboard is an emoji-centric keyboard app featuring Baidu’s speech recognition technology. It includes an emoji prediction feature, a wide variety of stickers and customizable keyboards, and interactive AR emoji. Facemoji Keyboard’s goal is to help people around the world express themselves in new ways with fun, creative emoji.\n\nAbout Simeji \n\nSimeji is the No. 1 keyboard app in Japan on both iOS and Android, with over 38 million downloads. With Simeji, people can express themselves like never before with kaomoji, animated stickers, customized keyboard skins and more.\n\nAbout Baidu\n\nBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204005047/en/\nThe Hoffman Agency\nShannon Nelson\n408-286-2611\nsnelson@hoffman.com\nSource: Baidu, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Apple, Baidu, JPMorgan Chase, Micron Technology, or Yum! Brands?",
        "subtitle": "",
        "date": "Nov 7, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 7, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BIDU, JPM, MU, and YUM.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-baidu-jpmorgan-chase-micron-technology-or-yum-brands-300953924.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Baidu Announces Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Nov 6, 2019 4:30PM EST",
        "content": "BEIJING, Nov. 6, 2019 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU) (\"Baidu\" or the \"Company\"), the leading Chinese-language Internet search provider, today announced its unaudited financial results for the third quarter ended September 30, 2019[1].\"Baidu App traffic continues to grow robustly with DAUs reaching 189 million, up 25% year over year, in September and Baidu's in-app search continues to gain market share. Our focus to combine search and feed and expand Baidu App's content and services offerings is improving user experience and drawing publishers and service providers to place more content and services on Baidu's hosted platform, which in turn draws more users. This positive reinforcing cycle has been a contributing factor to Baidu Core's operating margin rising 1,400 basis points from the prior quarter,\" said Robin Li, Chairman and CEO of Baidu. \"On Baidu's new AI businesses, DuerOS voice assistant continues to experience strong momentum with monthly voice queries surpassing 4.2 billion in September, up over 4.5 fold year over year. On Apollo, we are excited about our progress in early-stage commercialization of smart transportation with the release of Apollo-powered robotaxi pilot program to the public in Changsha, Hunan in September.\" \"Baidu delivered a solid third quarter with total revenues reaching RMB 28.1 billion, up 7% sequentially on top of the 9% sequential growth from the prior quarter, in spite of the softening macro environment, industry-specific policy changes and self-directed healthcare initiative,\" said Herman Yu, CFO of Baidu. \"Our disciplined approach to spending, focusing on investment returns across the board, sheds light on the strong and improving margin contribution from in-app search and feed.\"Financial Highlights Net loss attributable to Baidu for Q3 2019 was RMB 6.4 billion, which included a non-cash impairment loss of RMB 8.9 billion on equity investments that have experienced an other-than-temporary decline in valuation (see further discussion under Total other loss section). Non-GAAP net income attributable to Baidu, excluding share-based compensation, fair value changes of equity investments and other adjustments, for Q3 2019 was RMB 4.4 billion.Other Highlights CorporateMobile EcosystemDuerOSApolloCloud, AI Platform & OthersiQIYIThird Quarter 2019 Results Total revenues reached RMB 28.1 billion ($3.93 billion), flat from last year and up 3% year over year, excluding the impact of announced divestures2, and increasing 7% quarter over quarter. Online marketing revenues were RMB20.4 billion ($2.86 billion), decreasing 9% year over year and increasing 6% quarter over quarter. Other revenues were RMB 7.6 billion ($1.07 billion), increasing 34% year over year, driven mainly by the strong growth in iQIYI membership, cloud services and smart devices. Revenue from Baidu Core reached RMB 21.0 billion ($2.94 billion), decreasing 3% year over year, or increasing 2% year over year, excluding the impact of announced divestures2, and increasing 8% quarter over quarter. Revenue from iQIYI reached RMB 7.4 billion ($1.04 billion), up 7% year over year. iQIYI membership revenue grew 30% year over year, offset by online advertising revenue declining 14% year over year.Content costs were RMB 7.0 billion ($985 million), increasing 4% year over year. iQIYI's content costs increased 3% year over year, which rose slower than iQIYI's revenue growth.  Traffic acquisition costs were RMB 3.2 billion ($453 million), increasing 5% year over year, as a result of increasing TAC prices and expansion into connected offline screens and other areas.Bandwidth costs were RMB 2.0 billion ($284 million), increasing 20% year over year, mainly due to increasing demand from newsfeed, video and cloud services.Other cost of revenues, which includes depreciation, cost of goods sold, sales taxes and surcharges, share-based compensation and other costs, was RMB 4.1 billion ($570 million), increasing 51% year over year, mainly due to higher cost of goods sold and depreciation expense.Selling, general and administrative expenses were RMB 4.7 billion ($652 million), decreasing 17% year over year, primarily due to decreased investment in channel and promotional marketing. Research and development expenses were RMB 4.7 billion ($656 million), increasing 20% year over year, primarily due to an increase in personnel related expenses.Operating income was RMB 2.4 billion ($329 million) and operating margin was 8%. Baidu Core operating income was RMB 5.2 billion ($726 million), and Baidu Core operating margin was 25%. Non-GAAP operating income was RMB 3.7 billion ($516 million), and non-GAAP operating margin was 13%. Non-GAAP Baidu Core operating income was RMB 6.2 billion ($871 million), and non-GAAP Baidu Core operating margin was 30%.Total other loss was RMB 9.5 billion ($1.33 billion), mainly due to loss from equity investments that have experienced an other-than-temporary decline in valuation, compared to total other income of RMB 9.0 billion for Q3 2018, which was mainly due to disposal gains from Du Xiaoman and Global DU businesses. In Q4 2015, following a transaction where the Company exchanged shares of its majority-owned subsidiary Qunar for a minority investment in Trip.com, the Company deconsolidated Qunar, recorded its investment in Trip.com at the closing-date market value and recognized a non-cash accounting gain of RMB 24.4 billion. Since then, the market value of Trip.com shares has declined, and the continued low market price has caused the Company to recognize a non-cash impairment loss of RMB 8.9 billion in Q3 2019. In October 2019, the Company sold down the holding in Trip.com, which decreased from approximately 19% of their outstanding shares to 12% of the Trip.com's outstanding shares.Income tax expense was RMB 934 million ($131 million), which included a tax withholding for potential dividend distribution to offshore entities, compared to RMB 2.1 billion in Q3 2018.Net loss attributable to Baidu was RMB 6.4 billion ($ 892 million), and diluted losses per ADS was RMB 18 ($2.57). Net loss attributable to Baidu Core was RMB 4.3 billion ($600 million). Non-GAAP net income attributable to Baidu was RMB 4.4 billion ($614 million), and non-GAAP net margin was 16%. Non-GAAP diluted earnings per ADS amounted to RMB 13 ($1.76). Non-GAAP net income attributable to Baidu Core was RMB 6.3 billion ($883 million), and non-GAAP net margin for Baidu Core was 30%.Adjusted EBITDA was RMB 5.1 billion ($716 million) and adjusted EBITDA margin was 18%. Adjusted EBITDA to Baidu Core was RMB 7.5 billion ($1.05 billion) and adjusted EBITDA margin for Baidu Core was 36%. As of September 30, 2019, cash, cash equivalents, restricted cash and short-term investments were RMB 137.4 billion ($19.22 billion), and cash, cash equivalents, restricted cash and short-term investments excluding iQIYI were RMB 123.5 billion ($17.27 billion). Free cash flow was RMB 7.6 billion ($1.06 billion). Free cash flow excluding iQIYI was RMB 7.5 billion ($1.05 billion).Financial Guidance For the fourth quarter of 2019, Baidu expects revenues to be between RMB 27.1 billion ($3.78 billion) and RMB 28.7 billion ($4.02 billion), representing -1% to 6% increase year over year, which assumes that Baidu Core revenue will grow between 0% to 6% year over year. This forecast reflects Baidu's current and preliminary view, which is subject to substantial uncertainty. Conference Call Information Baidu's management will hold an earnings conference call at 8:15 PM on November 6, 2019, U.S. Eastern Time (9:15 AM on November 7, 2019, Beijing/Hong Kong Time). Dial-in details for the earnings conference call are as follows:A replay of the conference call may be accessed by phone at the following number until November 14, 2019:Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com. About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share.ContactsInvestors Relations, Baidu, Inc. Tel: +86-10-5992-8888Email: ir@baidu.com Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. Among other things, the outlook for the fourth quarter of 2019, quotations from management in this announcement, as well as Baidu's and other parties' strategic and operational plans, contain forward-looking statements. Baidu may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including but not limited to statements about Baidu's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: Baidu's growth strategies; its future business development, including development of new products and services; its ability to attract and retain users and customers; competition in the Chinese Internet search and newsfeed market; competition for online marketing customers; changes in the Company's revenues and certain cost or expense items as a percentage of its revenues; the outcome of ongoing, or any future, litigation or arbitration, including those relating to intellectual property rights; the expected growth of the Chinese-language Internet search and newsfeed market and the number of Internet and broadband users in China; Chinese governmental policies relating to the Internet and Internet search providers, and general economic conditions in China and elsewhere. Further information regarding these and other risks is included in the Company's annual report on Form 20-F and other documents filed with the Securities and Exchange Commission. Baidu does not undertake any obligation to update any forward-looking statement, except as required under applicable law. All information provided in this press release and in the attachments is as of the date of the press release, and Baidu undertakes no duty to update such information, except as required under applicable law.Non-GAAP Financial MeasuresTo supplement Baidu's consolidated financial results presented in accordance with GAAP, Baidu uses the following non-GAAP financial measures: non-GAAP operating income (loss), non-GAAP operating margin, non-GAAP net income (loss) attributable to Baidu, non-GAAP net margin, non-GAAP diluted earnings per ADS, adjusted EBITDA, adjusted EBITDA margin and free cash flow. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with GAAP. Baidu believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding certain items that may not be indicative of its recurring core business operating results, such as operating performance excluding not only non-cash charges, but also other items that are infrequent or unusual in nature. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning and forecasting future periods. These non-GAAP financial measures also facilitate management's internal comparisons to Baidu's historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors in allowing for greater transparency with respect to supplemental information used by management in its financial and operational decision making. A limitation of using these non-GAAP financial measures is that these non-GAAP measures exclude certain items that have been and will continue to be for the foreseeable future a significant component in the Company's results of operations. These non-GAAP financial measures presented here may not be comparable to similarly titled measures presented by other companies. Other companies may calculate similarly titled measures differently, limiting their usefulness as comparative measures to the Company's data. Non-GAAP operating income represents operating income excluding share-based compensation expenses and amortization of intangible assets resulting from business combinations. Non-GAAP net income attributable to Baidu represents net income attributable to Baidu excluding share-based compensation expenses, amortization of intangible assets resulting from business combinations, disposal gain or loss, impairment of long-term investments, fair value change of long-term investments, adjusted for related income tax effects. Baidu's share of equity method investments for these non-GAAP reconciling items, amortization of intangible assets not on the investees' books, accretion of their redeemable noncontrolling interests, and the gain or loss associated with the issuance of shares by the investees at a price higher or lower than the carrying value per shares, adjusted for related income tax effects, are also excluded. Non-GAAP diluted earnings per ADS represents diluted earnings per ADS calculated by dividing non-GAAP net income attributable to Baidu, which is adjusted for accretion for the redeemable noncontrolling interests, by the weighted average number of ordinary shares expressed in ADS. Adjusted EBITDA represents operating income excluding depreciation, amortization of intangible assets resulting from business combinations, and share-based compensation expenses. Free cash flow represents net cash provided by operating activities less capital expenditures.For more information on non-GAAP financial measures, please see the tables captioned \"Reconciliations of non-GAAP financial measures to the nearest comparable GAAP measures.\"[1] Unless otherwise noted, all translations from RMB to U.S. dollars are made at a rate of RMB 7.1477 to US$1.00, the exchange rate in effect as of September 30, 2019 as set forth in the H.10 statistical release of the Board of Governors of the Federal Reserve System. Translations are provided solely for the convenience of the reader.[2] Excluding revenue from divested businesses, which was approximately RMB1.0 billion for the three months ended September 30, 2018.        View original content to download multimedia:http://www.prnewswire.com/news-releases/baidu-announces-third-quarter-2019-results-300953076.htmlSOURCE  Baidu, Inc."
    },
    {
        "title": "Haokan Short Videos Hit 110 Million Total Daily Active Users",
        "subtitle": "",
        "date": "Nov 1, 2019 8:19AM EDT",
        "content": "BEIJING, Nov.  01, 2019  (GLOBE NEWSWIRE) -- Baidu, Inc. (NASDAQ:BIDU) announced that the number of total daily active users of its Haokan short videos has reached 110 million across the company's digital ecosystem, driven by high-quality content and traffic from multiple channels including Baidu App, Baidu Search and other platforms.Haokan’s short videos have accumulated more than 3 billion views, with users spending an average of 70 minutes per day viewing video content on the app. According to data from third-party research firm QuestMobile, 66 percent of Haokan users spend over 3 minutes on the app – placing it in the top spot amongst Chinese short video platforms for this key indicator of user engagement.“With growing demand from Chinese users for more accessible and informative content, the Haokan user base has seen significant growth. Users are becoming more and more interested in quality videos and now prioritize useful and interesting content over eye-catching content. This is becoming the growing trend for the short video market,” said Xiaodong Cao, General Manager of Baidu Haokan.Baidu’s short video platform Haokan, offering a diverse mix of both user-generated and professionally-produced content, often in coordination with multiple platform networks, has been providing high-quality, value-added content for users since its launch in 2017.To encourage quality content creation, Haokan has launched an exclusive share bonus for video makers totaling RMB 1 billion. It has also partnered with multi-channel network companies including Bgoose Culture, VlongTV, Shenzhen Baby Elephant Entertainment Culture and Zoomin.TV, helping to accelerate the introduction of more quality short video content to the Haokan platform.Leveraging Baidu’s advantages in artificial intelligence and big data, Haokan enables the matching of quality content with interested viewers, and, in turn, helps content creators to boost their follower count with content that reaches their target audiences.  Haokan’s strong user growth is also driven by traffic from peripheral channels, leveraging the advantages of Baidu’s wide-ranging products and services within its robust digital ecosystem. These channels include Baidu App, Baidu Search, Baidu Knows, Baidu Post and Xiaodu Smart Display.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler for users and enterprises through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.Media ContactIntlcomm@baidu.com"
    },
    {
        "title": "Baidu to Report Third Quarter 2019 Financial Results on November 6, 2019",
        "subtitle": "",
        "date": "Oct 24, 2019 8:18AM EDT",
        "content": "BEIJING, Oct. 24, 2019 /PRNewswire/ -- Baidu, Inc. (Nasdaq: BIDU), the leading Chinese language Internet search provider, today announced that it will report its financial results for the third quarter ended September 30, 2019, after the U.S. market closes on November 6, 2019. Baidu's management will hold an earnings conference call at 8:15 PM on November 6, 2019, U.S. Eastern Time (9:15 AM on November 7, 2019, Beijing Time). Dial-in details for the earnings conference call are as follows: A replay of the conference call may be accessed by phone at the following number until November 14, 2019: Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com. About Baidu Baidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share. For investor inquiries, please contact: Investors Relations, Baidu, Inc. Tel: +86-10-5992-8888 Email: ir@baidu.com  View original content:http://www.prnewswire.com/news-releases/baidu-to-report-third-quarter-2019-financial-results-on-november-6-2019-300944829.htmlSOURCE  Baidu, Inc."
    },
    {
        "title": "Baidu Launches Public Robotaxi Trial Operation",
        "subtitle": "",
        "date": "Sep 26, 2019 10:17AM EDT",
        "content": "- A fleet of 45 self-driving taxis starts operations on open roads in Changsha, Hunan province- Robotaxi-hailing services available to the public in select urban areasCHANGSHA, China, Sept.  26, 2019  (GLOBE NEWSWIRE) -- Baidu, Inc. (NASDAQ: BIDU) today debuted Apollo Robotaxi in Changsha, Hunan province, with the first batch of 45 self-driving taxis officially starting trial operations on urban roads. Apollo Robotaxi deploys L4 Hongqi EV vehicles jointly developed with Chinese carmaker FAW Group.  Ride hailing is now open for trial by the general public in Changsha, with the fleet of robotaxis able to perform a range of intelligent self-driving functions, including changing lanes based on road and traffic conditions, assessing the movement of nearby vehicles and employing automatic avoidance when encountering aggressive overtaking by other vehicles. With safety as a top priority, a human operator is also assigned to each robotaxi to take control of the autonomous system in situations that could affect the safety of passengers or the vehicle itself.“The robotaxi trial operations in Changsha demonstrate that the Apollo Robotaxi is progressing from research and development to a market reality, which will serve to provide rich feedback from real-world scenarios. Throughout the entire process, we have been and will always be committed to safety first and foremost,” said Zhenyu Li, Vice President of Baidu and General Manager of its Intelligent Driving Group. \"Intelligent driving is a great journey, and today marks a solid step forward. We will continue to work together with our partners with the aim of bringing a safer, more comfortable and more efficient autonomous driving experience to all.\"Apollo Robotaxi is set to offer passenger rides in a pilot zone in Changsha covering a total area of 70km² and 135km-long open roads - making it the largest in China with the most extensive coverage of complex road conditions and the most advanced vehicle-infrastructure cooperative systems. Within the pilot zone, the trial operation will cover around 50km by the end of 2019 and, in the first half of 2020, Apollo Robotaxi will cover the entire 135km stretch open to autonomous driving.The collaboration between Baidu and FAW has long been advancing the acceleration of the robotaxi. The Hongqi EV fleet, jointly developed with FAW Hongqi, represents China’s first volume production of preinstalled L4 autonomous driving vehicles. Hongqi EV is the latest product of Apollo's autonomous driving technology, realized through a synergy of leading software and hardware capabilities, preinstallation production capacity, fluid human-vehicle interface, a safety guarantee and the multifaceted upgrade and optimization of fleet management via the cloud. With a factory-installed customized Apollo OBU (On-Board Unit), the L4 Hongqi EV can carry out L4 V2X communication with intelligent roadside equipment and achieve a seamless interplay between vehicle and infrastructure.Baidu and FAW Hongqi have worked closely to redesign both the installation scheme of the autonomous driving unit for the robotaxi as well as the electrical/electronic architecture of the entire vehicle. The companies are now able to optimally integrate the two sections during factory installation, addressing issues including signal interference and detachment caused by modification and dismounting.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler for users and enterprises through technology. Baidu’s ADSs trade on the NASDAQ Global Select Market under the symbol “BIDU.” Currently, ten ADSs represent one Class A ordinary share.Media ContactIntlcomm@baidu.comA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/63c65d1c-981e-4474-9b93-1c0f591339a3"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Baidu, Citigroup, Lyft, or Micron Technology?",
        "subtitle": "",
        "date": "Aug 20, 2019 9:31AM EDT",
        "content": "NEW YORK, Aug. 20, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BIDU, C, LYFT, and MU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-baidu-citigroup-lyft-or-micron-technology-300904327.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Baidu Announces Second Quarter 2019 Results",
        "subtitle": "",
        "date": "Aug 19, 2019 4:30PM EDT",
        "content": "BEIJING, Aug. 19, 2019 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU) (\"Baidu\" or the \"Company\"), the leading Chinese language Internet search provider, today announced its unaudited financial results for the second quarter ended June 30, 2019[1].\"Our focus on strengthening Baidu's mobile ecosystem through knowledge-based content, BJH accounts, smart mini programs and managed pages on Baidu's platform is translating into better user experience, stronger traffic growth, and, we believe, ultimately higher conversion for our customers. In June, Baidu App DAUs reached 188 million, up 27% year over year, in-app search queries grew over 20% year over year and smart mini program MAUs reached 270 million, up 49% sequentially,\" said Robin Li, Baidu co-founder and CEO. \"On Baidu's AI businesses, DuerOS voice assistant continues to experience strong momentum with installed base surpassing 400 million devices, up 4.5 fold year over year, and monthly voice queries surpassing 3.6 billion, up 7.5 fold year over year, in June. As mobile internet penetration in China slows, we are excited about the huge opportunity to provide content and service providers a cross-platform distribution channel beyond mobile, into smart homes and automobiles.\" \"Baidu delivered a solid second quarter with revenues reaching RMB 26.3 billion, growing 9% sequentially, and Baidu Core revenues growing 12% sequentially, despite the weak macro environment, our self-directed healthcare initiative, industry-specific policy changes and large influx of ad inventory.\" said Herman Yu, Baidu CFO. \"With Baidu traffic growing robustly and our mobile ecosystem continuing to expand, we are in a good position to focus on capitalizing monetization and ROI improvement opportunities to deliver shareholder value.\"Second Quarter 2019 Financial Highlights Other Highlights CorporateMobile EcosystemDuerOSApolloCloud & AI PlatformiQIYISecond Quarter 2019 Results Total revenues reached RMB 26.3 billion ($3.84 billion), increasing 1% year over year, or 6% year over year, excluding the impact of announced divestures[2], and increasing 9% quarter over quarter. Online marketing revenues were RMB19.2 billion ($2.80 billion), decreasing 9% year over year and increasing 9% quarter over quarter. Other revenues were RMB 7.1 billion ($1.03 billion), increasing 44% year over year, driven mainly by robust growth in iQIYI membership services, cloud and smart devices. Revenue from Baidu Core reached RMB 19.5 billion ($2.85 billion), decreasing 2% year over year, or increasing 3% year over year, excluding the impact of announced divestures[2], and increasing 12% quarter over quarter. Baidu Core's marketing services experienced softness in top sectors, including healthcare, online games, financial services, and auto/logistics sectors. Revenue from iQIYI reached RMB 7.1 billion ($1.04 billion), up 15% year over year. iQIYI membership services grew 38% year over year, while online advertising revenue fell 16% year over year.Content costs were RMB 5.8 billion ($847 million), increasing 12% year over year, mainly due to increased investment in iQIYI content and, to a much lesser extent, in content for BJH accounts, Baidu's feed publisher network. Traffic acquisition cost was RMB 3.4 billion ($499 million), increasing 27% year over year, as a result of higher TAC costs and expansion into offline digitalized screens and other areas.Bandwidth costs were RMB 2.0 billion ($298 million), increasing 32% year over year, mainly due to increasing demand from feed, video and cloud services.Other cost of revenues, which includes depreciation, operational costs, sales taxes and surcharges, and share-based compensation, was RMB 4.8 billion ($703 million), increasing 89% year over year, mainly due to higher cost of goods sold for smart home devices and higher depreciation expense.Selling, general and administrative expenses were RMB 5.2 billion ($764 million), increasing 16% year over year, primarily due to increased investment in channel and promotional marketing, as well as the increase in personnel related expenses. Research and development expenses were RMB 4.7 billion ($690 million), increasing 17% year over year, primarily due to the increase in personnel related expenses.Operating income was RMB 233 million ($34 million), and operating margin was 1%. Operating income for Baidu Core was RMB 2.1 billion ($307 million), and Baidu Core operating margin was 11%. Non-GAAP operating income was RMB 2.0 billion ($285 million), and non-GAAP operating margin was 7%. Non-GAAP operating income for Baidu Core was RMB 3.5 billion ($508 million), and non-GAAP Baidu Core operating margin was 18%.Total other income was RMB 1.2 billion ($180 million), increasing 69% year over year, mainly due to increased income from equity method investments and foreign exchange gains from RMB depreciation. Income tax expense was RMB 416 million ($61 million), compared to RMB 1.1 billion in the second quarter of 2018. Effective tax rate was 28%, compared to 18% in the second quarter of 2018, primarily due to the lower pre-tax income from Baidu Core and iQIYI not being able to recognize tax benefit from its losses in the current period. Net income attributable to Baidu was RMB 2.4 billion ($351 million), and net margin was 9%. Diluted earnings per ADS amounted to RMB 7 ($0.96). Net income attributable to Baidu Core was RMB 3.7 billion ($543 million), and Baidu Core net margin was 19%. Non-GAAP net income attributable to Baidu was RMB 3.6 billion ($529 million), and non-GAAP net margin was 14%. Non-GAAP diluted earnings per ADS amounted to RMB 10 ($1.47). Non-GAAP net income attributable to Baidu Core was RMB 4.7 billion ($690 million), and non-GAAP net margin for Baidu Core was 24%.Adjusted EBITDA was RMB 3.4 billion ($489 million) and adjusted EBITDA margin was 13%. Adjusted EBITDA to Baidu Core was RMB 4.8 billion ($694 million) and Baidu Core adjusted EBITDA margin was 24%. As of June 30, 2019, cash, cash equivalents, restricted cash and short-term investments were RMB 137.3 billion ($20.00 billion), and excluding iQIYI, cash, cash equivalents, restricted cash and short-term investments were RMB 120.9 billion ($17.61 billion). Free cash flow was RMB 5.6 billion ($817 million). Excluding iQIYI, free cash flow was RMB 4.9 billion ($710 million).Financial Guidance For the third quarter of 2019, Baidu expects revenues to be between RMB 26.9 billion ($3.84 billion[3]) and RMB 28.5 billion ($4.07 billion), representing -5% to 1% increase year over year, or -1% to 5% increase year over year, excluding revenues from announced divestures, and 2% to 8% increase quarter over quarter. Previously announced divestures, which were consummated in 2018, generated approximately RMB 1.0 billion revenue in the third quarter of 2018. This forecast reflects Baidu's current and preliminary view, which is subject to substantial uncertainty. Conference Call Information Baidu's management will hold an earnings conference call at 9:15 PM on August 19, 2019, U.S. Eastern Time (9:15 AM on August 20, 2019, Beijing/Hong Kong Time). Dial-in details for the earnings conference call are as follows:A replay of the conference call may be accessed by phone at the following number until August 27, 2019:Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make a complex world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU.\" Currently, ten ADSs represent one Class A ordinary share.ContactsInvestors Relations, Baidu, Inc. Tel: +86-10-5992-8888Email: ir@baidu.com Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. Among other things, the outlook for the third quarter of 2019, quotations from management in this announcement, as well as Baidu's and other parties' strategic and operational plans, contain forward-looking statements. Baidu may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including but not limited to statements about Baidu's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: Baidu's growth strategies; its future business development, including development of new products and services; its ability to attract and retain users and customers; competition in the Chinese Internet search and feed market; competition for online marketing customers; changes in the Company's revenues and certain cost or expense items as a percentage of its revenues; the outcome of ongoing, or any future, litigation or arbitration, including those relating to intellectual property rights; the expected growth of the Chinese-language Internet search and feed market and the number of Internet and broadband users in China; Chinese governmental policies relating to the Internet and Internet search providers, and general economic conditions in China and elsewhere. Further information regarding these and other risks is included in the Company's annual report on Form 20-F and other documents filed with the Securities and Exchange Commission. Baidu does not undertake any obligation to update any forward-looking statement, except as required under applicable law. All information provided in this press release and in the attachments is as of the date of the press release, and Baidu undertakes no duty to update such information, except as required under applicable law.Non-GAAP Financial MeasuresTo supplement Baidu's consolidated financial results presented in accordance with GAAP, Baidu uses the following non-GAAP financial measures: non-GAAP operating income (loss), non-GAAP operating margin, non-GAAP net income (loss) attributable to Baidu, non-GAAP net margin, non-GAAP diluted earnings per ADS, adjusted EBITDA, adjusted EBITDA margin and free cash flow. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with GAAP. Baidu believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding certain items that may not be indicative of its recurring core business operating results, such as operating performance excluding not only non-cash charges, but also other items that are infrequent or unusual in nature. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning and forecasting future periods. These non-GAAP financial measures also facilitate management's internal comparisons to Baidu's historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors in allowing for greater transparency with respect to supplemental information used by management in its financial and operational decision making. A limitation of using these non-GAAP financial measures is that these non-GAAP measures exclude certain items that have been and will continue to be for the foreseeable future a significant component in the Company's results of operations. These non-GAAP financial measures presented here may not be comparable to similarly titled measures presented by other companies. Other companies may calculate similarly titled measures differently, limiting their usefulness as comparative measures to the Company's data. Non-GAAP operating income represents operating income excluding share-based compensation expenses and amortization of intangible assets resulting from business combinations. Non-GAAP net income attributable to Baidu represents net income attributable to Baidu excluding share-based compensation expenses, amortization of intangible assets resulting from business combinations, disposal gain or loss, impairment of long-term investments, fair value change of long-term investments, adjusted for related income tax effects. Baidu's share of equity method investments for these non-GAAP reconciling items, amortization of intangible assets not on the investees' books, accretion of their redeemable noncontrolling interests, and the gain or loss associated with the issuance of shares by the investees at a price higher or lower than the carrying value per shares, adjusted for related income tax effects, are also excluded. Non-GAAP diluted earnings per ADS represents diluted earnings per ADS calculated based on non-GAAP net income attributable to Baidu, adjusted for accretion for the redeemable noncontrolling interests. Adjusted EBITDA represents operating income excluding depreciation, amortization of intangible assets resulting from business combinations, and share-based compensation expenses. Free cash flow represents net cash provided by operating activities less capital expenditures.For more information on non-GAAP financial measures, please see the tables captioned \"Reconciliations of non-GAAP financial measures to the nearest comparable GAAP measures.\"[1] Unless otherwise noted, all translations from RMB to U.S. dollars are made at a rate of RMB6.8650 to US$1.00, the effective noon buying rate as of June 28, 2019, in The City of New York for cable transfers of RMB as certified for customs purposes by the Federal Reserve Bank of New York. Translations are provided for the convenience of the reader.[2] Excluding revenues from divested businesses Global DU and Du Xiaoman (financial services), which were approximately RMB1.0 billion for the three months ended June 30, 2018.[3] The translations from RMB to U.S. dollars for the expected revenues in the third quarter of 2019 are made at a rate of RMB7.0 to US$1.0, the rounded noon buying rate as of August 8, 2019, in The City of New York for cable transfers of RMB as certified for customs purposes by the Federal Reserve Bank of New York. We make no representation that any Renminbi or U.S. dollar amounts could have been, or could be, converted into U.S. dollars or Renminbi, as the case may be, at this rate, or any particular rate, or at all.              View original content:http://www.prnewswire.com/news-releases/baidu-announces-second-quarter-2019-results-300903822.htmlSOURCE  Baidu, Inc."
    },
    {
        "title": "Elektrobit chosen as partner by Baidu to enable safe autonomous driving for Apollo",
        "subtitle": "EB tresos to provide safety software for the Baidu Apollo Computing Unit (ACU), enabling automated driving, intelligent connectivity and intelligent road infrastructure",
        "date": "Aug 7, 2019 11:03AM EDT",
        "content": "SHANGHAI, Aug. 7, 2019 /PRNewswire/ -- Baidu, Inc. (NASDAQ: BIDU) and Elektrobit (EB), a visionary global supplier of embedded and connected software products for the automotive industry, today signed a strategic partnership in which EB will provide automotive infrastructure software for the Apollo Computing Unit (ACU), Baidu's advanced in-vehicle computing platform for autonomous driving. The ACU, an autonomous driving in-vehicle computing platform for mass production, is one of the most important products of Baidu Apollo, which is being developed with 156 industry partners including Chinese automakers.EB is providing its EB tresos automotive basic software products to the Baidu ACU-Advanced Automated Valet Parking project. EB tresos enables the development of AUTOSAR standard-compliant software for automotive electronic control units (ECUs) with the highest levels of functional safety, up to ISO 26262 ASIL D. EB's industry-leading software will allow car manufacturers and suppliers using ACU to expedite the market introduction of safe systems for Automated Valet Parking. EB is an important strategic partner and plays an integral role in Baidu's ongoing efforts to accelerate the intelligent transformation of the automotive industry. Elektrobit's software is cutting-edge in terms of capabilities and adheres to the absolute highest quality and safety standards in the industry. EB will be deeply engaged with the Baidu Apollo team.\"Baidu Apollo has made tremendous strides in just two years since its launch, with support from leaders in the automotive industry, in China and around the world,\" said Alexander Kocher, President and Managing Director, Elektrobit. \"China is an important and strategic market for EB, therefore we are glad to bring our products and experience into the ACU. We are extremely proud to be a partner and look forward to working with Baidu as well as the whole industry to accelerate the development of automated driving based on Apollo.\"The partnership was unveiled today during a signing ceremony between the two organizations. Elektrobit is also working with Baidu Apollo in further areas and just published a joint whitepaper on reliable and safe maps for automated driving. About Elektrobit (EB)Elektrobit (EB) is an award-winning and visionary global supplier of embedded and connected software products and services for the automotive industry. A leader in automotive software with over 30 years serving the industry, EB's software powers over one billion devices in more than 100 million vehicles and offers flexible, innovative solutions for connected car infrastructure, human machine interface (HMI) technologies, navigation, driver assistance, electronic control units (ECUs), and software engineering services. EB is a wholly owned subsidiary of Continental. For more information, visit us at elektrobit.com.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make the complicated world simpler for users and enterprises through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU.\" Currently, ten ADSs represent one Class A ordinary share.For more information: Silvia BartelsHead of Public Relations, ElektrobitTel. +49 9131 7701-6916Mobile. +49 1522 2826483Email: silvia.bartels@elektrobit.comEva PangMarketing Manager, Elektrobit in ChinaEva PangTel. +86 21 5043 1951 – 806Email: Haihong.Pang@elektrobit.comStephannie DepaBreakaway Communications for EBTel. +1 415 358-2485Mobile. +1 530 864-0136Email : sdepa@breakawaycom.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/elektrobit-chosen-as-partner-by-baidu-to-enable-safe-autonomous-driving-for-apollo-300897849.htmlSOURCE  Elektrobit"
    },
    {
        "title": "Baidu to Report Second Quarter 2019 Financial Results on August 19, 2019",
        "subtitle": "",
        "date": "Jul 29, 2019 2:00AM EDT",
        "content": "BEIJING, July 29, 2019 /PRNewswire/ -- Baidu, Inc. (Nasdaq: BIDU), the leading Chinese language Internet search provider, today announced that it will report its financial results for the second quarter ended June 30, 2019, after the U.S. market closes on August 19, 2019. Baidu's management will hold an earnings conference call at 9:15 PM on August 19, 2019, U.S. Eastern Time (9:15 AM on August 20, 2019, Beijing Time).Dial-in details for the earnings conference call are as follows:A replay of the conference call may be accessed by phone at the following number until August 27, 2019:Additionally, a live and archived webcast of this conference call will be available at http://ir.baidu.com.About BaiduBaidu, Inc. is the leading Chinese language Internet search provider. Baidu aims to make a complex world simpler through technology. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share.For investor inquiries, please contact:Investors Relations, Baidu, Inc.Tel: +86-10-5992-8888Email: ir@baidu.com View original content:http://www.prnewswire.com/news-releases/baidu-to-report-second-quarter-2019-financial-results-on-august-19-2019-300892081.htmlSOURCE  Baidu, Inc."
    }
]