[
    {
        "title": "Biogen and Sangamo Announce Global Collaboration to Develop Gene Regulation Therapies for Alzheimer’s, Parkinson’s, Neuromuscular, and Other Neurological Diseases",
        "subtitle": "",
        "date": "Feb 27, 2020 4:06PM EST",
        "content": "CAMBRIDGE, Mass. and BRISBANE, Calif., Feb.  27, 2020  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) and Sangamo Therapeutics, Inc. (Nasdaq: SGMO), a genomic medicine company, today announced that they have executed a global licensing collaboration agreement to develop and commercialize ST-501 for tauopathies including Alzheimer’s disease, ST-502 for synucleinopathies including Parkinson’s disease, a third undisclosed neuromuscular disease target, and up to nine additional undisclosed neurological disease targets. The companies will leverage Sangamo’s proprietary zinc finger protein (ZFP) technology delivered via adeno-associated virus (AAV) to modulate the expression of key genes involved in neurological diseases.  “As a pioneer in neuroscience, Biogen will collaborate with Sangamo on a new gene regulation therapy approach, working at the DNA level, with the potential to treat challenging neurological diseases of global significance. We aim to develop and advance these programs forward to investigational new drug applications,” said Alfred Sandrock Jr., M.D., Ph.D., Executive Vice President, Research and Development at Biogen.“There are currently no approved disease modifying treatments for patients with many devastating neurodegenerative diseases such as Alzheimer’s and Parkinson’s, creating an urgency for the development of medicines that will not just address symptoms like the current standards of care, but slow or stop the progression of disease,” said Sandy Macrae, CEO of Sangamo. “We believe that the promise of genomic medicine in neuroscience is to provide a one-time treatment for patients to alter their disease natural history by addressing the underlying cause at the genomic level.”Sangamo’s genome regulation technology, zinc finger protein transcription factors (ZFP-TFs), is currently delivered with AAVs and functions at the DNA level to selectively repress or activate the expression of specific genes to achieve a desired therapeutic effect. Highly specific, potent, and tunable repression of tau and alpha synuclein has been demonstrated in preclinical studies using AAV vectors to deliver tau-targeted (ST-501) and alpha synuclein-targeted (ST-502) ZFP-TFs.“The combination of Sangamo’s proprietary zinc finger technology, Biogen’s unmatched neuroscience research, drug development, and commercialization experience and capabilities, and our shared commitment to bring innovative medicines to patients with neurological diseases establishes the foundation for a robust and compelling collaboration,” said Stephane Boissel, Head of Corporate Strategy at Sangamo. “This collaboration exemplifies Sangamo’s commitment to our ongoing strategy to partner programs that address substantial and diverse patient populations in disease areas requiring complex clinical trial designs and commercial pathways, therefore bringing treatments to patients faster and more efficiently, while deriving maximum value from our platform.”Under the terms of the collaboration, Biogen has exclusive global rights to ST-501 for tauopathies including Alzheimer’s disease, ST-502 for synucleinopathies including Parkinson’s disease, and a third undisclosed neuromuscular disease target. In addition, Biogen has exclusive rights to nominate up to nine additional undisclosed targets over a target selection period of five years. Sangamo will perform early research activities, costs for which will be shared by the companies, aimed at the development of the combination of proprietary CNS delivery vectors and ZFP-TFs targeting therapeutically relevant genes. Biogen will then assume responsibility and costs for the investigational new drug-enabling studies, clinical development, related regulatory interactions, and global commercialization.Sangamo will be responsible for GMP manufacturing activities for the initial clinical trials for the first three products of the collaboration and plans to leverage its in-house manufacturing capacity. Biogen will assume responsibility for GMP manufacturing activities beyond the first clinical trial for each of the first three products.Upon closing of this transaction, Sangamo will receive $350 million comprised of $125 million in a license fee payment and $225 million from the sale of new Sangamo stock, or approximately 24 million shares at $9.21 per share. In addition, Sangamo may receive up to $2.37 billion in other development, regulatory, and commercial milestone payments, including up to $925 million in pre-approval milestone payments and up to $1,445 million in first commercial sale and other sales-based milestone payments. Sangamo will also be eligible to receive from Biogen tiered high single digit to sub-teen double-digit royalties on potential net commercial sales of products arising from the collaboration. Closing of the transaction is contingent on completion of review under antitrust laws, including the Hart-Scott-Rodino (HSR) Antitrust Improvements Act of 1976 in the U.S. Conference callSangamo will host a conference call at 8:00 a.m. ET tomorrow, Friday, February 28, which will be open to the public via telephone and webcast. During the conference call, Sangamo will discuss the collaboration, review financial results for the fourth quarter and full year 2019, and provide a business update. The conference call dial-in numbers are (877) 377-7553 for domestic callers and (678) 894-3968 for international callers. The conference ID number for the call is 4609858. Participants may access the live webcast via a link on the Sangamo website in the Investors and Media section under Events and Presentations. A conference call replay will be available for one week following the conference call on Sangamo’s website. The conference call replay numbers for domestic and international callers are (855) 859-2056 and (404) 537-3406, respectively. The conference ID number for the replay is 4609858.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops, and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics, and is focused on advancing research programs in multiple sclerosis and neuroimmunology, Alzheimer’s disease and dementia, neuromuscular disorders, movement disorders, ophthalmology, immunology, neurocognitive disorders, acute neurology, and pain.Biogen routinely posts information that may be important to investors on its website at www.biogen.com. To learn more, please visit www.biogen.com and follow Biogen on social media – Twitter, LinkedIn, Facebook, YouTube.About Sangamo Therapeutics  Sangamo Therapeutics is committed to translating ground-breaking science into genomic medicines with the potential to transform patients’ lives using gene therapy, ex vivo gene-edited cell therapy, and in vivo genome editing and gene regulation. For more information about Sangamo, visit www.sangamo.com.Biogen Safe Harbor This press release contains forward-looking statements, made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements relating to the potential benefits and results that may be achieved through Biogen’s proposed collaboration with Sangamo; the anticipated completion and timing of the proposed transaction; the potential benefits, safety and efficacy of ST-501 and ST-502; the potential of Biogen’s commercial business and pipeline programs; Biogen’s strategy and plans; the potential treatment of neurological diseases; and risks and uncertainties associated with drug development and commercialization. These forward-looking statements may be accompanied by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “goal,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would,” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including, without limitation: risks that the proposed transaction will be completed in a timely manner or at all; the possibility that certain closing conditions to the proposed transaction will not be satisfied; uncertainty as to whether the anticipated benefits of the proposed collaboration can be achieved; risks of unexpected hurdles, costs or delays; uncertainty of success in the development and potential commercialization of ST-501 and ST-502 and other undisclosed neurological targets, which may be impacted by, among other things, unexpected concerns that may arise from additional data or analysis, the occurrence of adverse safety events, failure to obtain regulatory approvals in certain jurisdictions, failure to protect and enforce Biogen’s data, intellectual property, and other proprietary rights and uncertainties relating to intellectual property claims and challenges; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from Biogen’s expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risks factors identified in Biogen’s most recent annual or quarterly report and in other reports Biogen has filed with the U.S. Securities and Exchange Commission. These statements are based on Biogen’s current beliefs and expectations and speak only as of the date of this press release. Biogen does not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.Sangamo Forward Looking StatementsThis press release contains forward-looking statements regarding Sangamo's current expectations. These forward-looking statements include, without limitation, statements relating to the potential to use ZFP technology delivered via AAV to repress specific genes involved in neurological diseases, the ability of genomic medicine to provide one-time treatments, other statements regarding investigational therapies and their therapeutic benefits, statements related the anticipated effectiveness of the collaboration and the timing and benefits thereof, Sangamo's sale of shares of its common stock, receipt of an upfront payment and potential receipt of development- and  sales-based milestones, as well as royalties on potential future sales, and other statements that are not historical fact. These statements are not guarantees of future performance and are subject to risks and assumptions that are difficult to predict. Factors that could cause actual results to differ include, but are not limited to, risks and uncertainties related to: the research and development process; the ability to cause the agreements to become effective on the proposed terms and schedule, the ability to obtain clearance under the HSR and to satisfy the other closing conditions,; and the potential for technological developments by Sangamo's competitors that will obviate Sangamo's technologies, the new, uncertain and time consuming gene regulation therapy development and regulatory process, including the risks that Sangamo and Biogen may not be successful in their research efforts under the collaboration and that, even if successful, Biogen may be unable to successfully develop and commercialize licensed products resulting from the collaboration; Sangamo's dependence on collaborative partners, including the risks that if Biogen were to breach or terminate the agreement or otherwise fail to successfully develop and commercialize licensed products resulting from the collaboration and in a timely manner, Sangamo would not obtain the anticipated financial and other benefits of the collaboration and the development and/or commercialization of Sangamo's gene editing technology could be delayed, perhaps substantially. There can be no assurance that the necessary milestones or approvals will be obtained for any of the product candidates in this collaboration. Actual results may differ from those projected in forward-looking statements due to risks and uncertainties that exist in Sangamo's operations and business environments. These risks and uncertainties are described more fully in Sangamo's filings with the U.S. Securities and Exchange Commission, including its most recent Annual Report on Form 10-K and most recent Quarterly Report on Form 10-Q. Forward-looking statements contained in this announcement are made as of this date, and Sangamo undertakes no duty to update such information except as required under applicable law. "
    },
    {
        "title": "Biogen to Acquire Novel Clinical Stage Asset with Application in Alzheimer’s Disease and Parkinson’s Disease from Pfizer Inc.",
        "subtitle": "",
        "date": "Jan 13, 2020 7:30AM EST",
        "content": "CAMBRIDGE, Mass., Jan.  13, 2020  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced an agreement to acquire from Pfizer Inc. (NYSE: PFE) PF-05251749, a novel CNS-penetrant small molecule inhibitor of casein kinase 1 (CK1), for the potential treatment of patients with behavioral and neurological symptoms across various psychiatric and neurological diseases. In particular, Biogen plans to develop the Phase 1 asset for the treatment of Sundowning in Alzheimer’s disease (AD) and Irregular Sleep Wake Rhythm Disorder (ISWRD) in Parkinson’s disease (PD). The purchase will include an upfront payment of $75 million with up to $635 million in potential additional development and commercialization milestone payments, as well as tiered royalties in the high single digits to sub-teens.“This asset is highly complementary to our existing pipeline of potential disease-modifying therapies in Alzheimer’s and Parkinson’s diseases,” said Alfred Sandrock Jr., M.D., Ph.D., Executive Vice President, Research and Development and Chief Medical Officer at Biogen. “Many patients with Alzheimer’s and Parkinson’s suffer from debilitating sleep disorders and agitation, and we believe that the regulation of the circadian rhythm may hold promise in addressing these challenging behavioral and neurological symptoms.”CK1 is a key regulator of the ‘central clock,’ the suprachiasmatic nucleus of the hypothalamus, that controls circadian rhythm and impacts nearly all vital physiology and metabolism. The disruption of circadian rhythm is associated with various psychiatric and neurological diseases, including certain important symptoms of AD and PD.Sundowning is a symptom that impacts 20% or more of AD patients who become confused, anxious, aggressive, agitated or restless later in the day. ISWRD is a circadian rhythm disorder where patients experience fragmented nighttime sleep leading to daytime sleepiness, severe fatigue and difficulty with activities of daily living. It is one of the non-motor symptoms of PD, and usually increases in frequency over the course of the disease and disability progression. Biogen will explore the potential of PF-05251749 to improve behavioral disturbances of Sundowning in AD by correcting circadian rhythm, as well as its potential to treat symptoms of ISWRD to improve daytime wakefulness, sleep quality, behavior and daily function.PF-05251749 has previously demonstrated an acceptable safety profile and proof of mechanism in a Phase 1a clinical study. Biogen aims to initiate a Phase 1b study in Q4 2020.   This transaction will be accounted for as an asset acquisition and is subject to customary closing conditions, including the expiration of the applicable waiting period under the Hart Scott Rodino Antitrust Improvements Act of 1976 in the United States.Biogen expects the transaction to close in the first quarter of 2020.About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, Alzheimer’s disease and dementia, neuromuscular disorders, movement disorders, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Safe HarborThis news release contains forward-looking statements, made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements relating to the potential benefits and results that may be achieved through the proposed transaction with Pfizer; the anticipated completion and timing of the proposed transaction; the potential benefits, safety and efficacy of PF-05251749; the clinical development program for PF-05251749; the potential of our commercial business and pipeline programs; our strategy and plans; and risks and uncertainties associated with drug development and commercialization. These forward-looking statements may be accompanied by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “goal,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including, without limitation: risks that the proposed transaction will be completed in a timely manner or at all; the possibility that certain closing conditions to the proposed transaction will not be satisfied; uncertainty as to whether the anticipated benefits of the proposed transaction can be achieved; risks of unexpected hurdles, costs or delays; uncertainty of success in the development and potential commercialization of PF-05251749, which may be impacted by, among other things, unexpected concerns that may arise from additional data or analysis, the occurrence of adverse safety events, failure to obtain regulatory approvals in certain jurisdictions, failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risks factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.Contact:MEDIA:David Caouette, +1 617 679 4945public.affairs@biogen.comINVESTOR CONTACT:Joe Mara, +1 781 464 2442IR@biogen.com "
    },
    {
        "title": "Behind the Seizure® Program Further Expands Access to Genetic Testing for Children to Speed the Diagnosis of Genetic Epilepsy",
        "subtitle": "-- Biogen, Encoded Therapeutics, Neurogene, Praxis Precision Medicines and PTC Therapeutics join founders BioMarin and Invitae to expand access for children under eight --",
        "date": "Jan 8, 2020 7:30AM EST",
        "content": "SAN FRANCISCO, Jan. 8, 2020 /PRNewswire/ -- Today BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) and Invitae Corporation (NYSE: NVTA) announced that Biogen (NASDAQ: BIIB), Encoded Therapeutics, Neurogene, Praxis Precision Medicines and PTC Therapeutics joined Behind the Seizure®, an innovative, cross-company collaboration that aims to provide faster diagnosis for young children with epilepsy. The program will also be expanded to make no-charge testing available for healthcare providers to order for any child under the age of eight who has an unprovoked seizure. \"Behind the Seizure is one of the longest-running cross-company collaborations aimed at increasing access to genetic testing. It has been shown to decrease time to diagnosis for children experiencing unprovoked seizures by one to two years from reported averages, and as more companies have joined the program, more children have been helped,\" said Robert Nussbaum, chief medical officer of Invitae. \"Earlier diagnosis enables clinicians to focus on providing disease-specific care sooner, which is particularly important in neurodegenerative diseases. We applaud these companies for their commitment to expanding this unique effort to help children.\"Previously the program was available to children under age five. The newest companies to join Behind the Seizure include:Behind the Seizure is supported by eight sponsors in all, including Stoke Therapeutics and Xenon Pharmaceuticals who joined in 2019.Since the program began, thousands of children have received genetic testing through Behind the Seizure and research has shown that participants in the program were diagnosed one to two years sooner than historic averages.1 Companies that participate in the program sponsor the cost of testing using the Invitae Epilepsy Panel, which includes more than 180 genes associated with both syndromic and non-syndromic causes of epilepsy, including neurodegenerative conditions. With the expansion of the program, healthcare providers now can order the test for patients under the age of eight with unprovoked seizures. Test results are available quickly (14 days on average). More than half of epilepsies are based in genetics. When a child presents with seizures, genetic testing can help identify more than 100 underlying, often rare conditions. Early genetic testing may be the most cost-effective, direct and accurate diagnostic tool for children, shortening years-long diagnostic odysseys. Delays in diagnosis can be devastating for children, as some genetic epilepsies are neurodegenerative and early symptoms may be subtle and easy to misdiagnose. Participating companies provide financial support for this program, which includes testing and services performed by Invitae. Healthcare professionals must confirm that patients meet certain criteria to use the program. Third parties and commercial organizations may receive de-identified patient data and contact information for healthcare providers who use this program, but at no time do they receive patient identifiable information. Genetic testing and counseling are available in the US and Canada. Healthcare professionals and patients who participate in this program have no obligation to recommend, purchase, order, prescribe, promote, administer, use or support any other products or services from Invitae or from third parties or commercial organizations.About Behind the Seizure®Behind the Seizure is an innovative, cross-company collaboration designed to increase access to genetic testing for children who experience unprovoked seizures in childhood in the United States and Canada. More than half of epilepsies have some genetic basis, and are often associated with rare, neurodegenerative conditions with non-specific symptoms. Early genetic testing may be the most direct, cost-effective, and accurate diagnostic tool. Participants in the Behind the Seizure program are diagnosed one to two years sooner than reported averages. The program was established by BioMarin and Invitae and now includes: Biogen, Encoded Therapeutics, Neurogene Inc., Praxis Precision Medicines, PTC Therapeutics, Stoke Therapeutics and Xenon Pharmaceuticals. To learn more about the Behind the Seizure program please visit https://www.invitae.com/en/behindtheseizure/.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com.About InvitaeInvitae Corporation (NYSE: NVTA) is a leading genetics company whose mission is to bring comprehensive genetic information into mainstream medicine to improve healthcare for billions of people. Invitae's goal is to aggregate the world's genetic tests into a single service with higher quality, faster turnaround time, and lower prices. For more information, visit the company's website at invitae.com.About Encoded TherapeuticsEncoded Therapeutics, Inc. is a biotechnology company developing precision gene therapies for a broad range of severe genetic disorders. Our mission is to realize the potential of genomics-driven precision medicine by overcoming key limitations of viral gene therapy. We focus on delivering life-changing advances that move away from disease management and towards lasting disease modification. For more information, please visit www.Encoded.com.About Neurogene Inc.Neurogene was founded to bring life-changing medicines to patients and families affected by rare neurological disorders. We partner with leading academic researchers, patient advocacy organizations and caregivers to bring to patients therapies that address the underlying genetic cause of a broad spectrum of neurological diseases where no effective treatment options exist today. Our lead programs use AAV-based gene therapy technology to deliver a normal gene to patients with a dysfunctional gene. Neurogene is also investing in novel technology to develop treatments for diseases not well served by gene therapy. For more information, visit www.neurogene.com.About Praxis Precision MedicinesPraxis Precision Medicines is a clinical-stage genetic neuroscience company developing high-impact therapies for patients and families affected by complex and debilitating brain disorders, including rare pediatric epilepsies and neuropsychiatric disorders. These two disease areas share overlapping disease biology and genetic targets, as well as a profound need for new therapeutic options that target the underlying cause of the disease. Praxis is advancing a pipeline of breakthrough medicines with the potential to more precisely treat complex brain disorders. For more information, please visit www.praxismedicines.com.About PTC TherapeuticsPTC Therapeutics is a science-driven, global biopharmaceutical company focused on the discovery, development and commercialization of clinically-differentiated medicines that provide benefits to patients with rare disorders. PTC's ability to globally commercialize products is the foundation that drives investment in a robust pipeline of transformative medicines and our mission to provide access to best-in-class treatments for patients who have an unmet medical need.About Stoke TherapeuticsStoke Therapeutics, Inc. (Nasdaq: STOK), is a biotechnology company pioneering a new way to treat the underlying causes of severe genetic diseases by precisely upregulating protein expression to restore target proteins to near normal levels. Stoke aims to develop the first precision medicine platform to target the underlying cause of a broad spectrum of genetic diseases in which the patient has one healthy copy of a gene and one mutated copy that fails to produce a protein essential to health. These diseases, in which loss of approximately 50% of normal protein expression causes disease, are called autosomal dominant haploinsufficiencies. The company's lead investigational new medicine is STK-001, a proprietary antisense oligonucleotide (ASO) that has the potential to be the first disease-modifying therapy to address the genetic cause of Dravet syndrome, a severe and progressive genetic epilepsy. Stoke is headquartered in Bedford, Massachusetts with offices in Cambridge, Massachusetts. For more information, visit https://www.stoketherapeutics.com/ or follow the company on Twitter at @StokeTx.About Xenon PharmaceuticalsXenon Pharmaceuticals is a clinical stage biopharmaceutical company committed to developing innovative therapeutics to improve the lives of patients with neurological disorders, including rare central nervous system (CNS) conditions. We are advancing a novel product pipeline of neurology therapies to address areas of high unmet medical need, with a focus on epilepsy. For more information, please visit www.xenon-pharma.com.Safe Harbor StatementsThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements relating to the benefits of genetic testing and the Behind the Seizure program, including shortening the time to diagnosis and improved treatment outcomes for patients. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially, and reported results should not be considered as an indication of future performance. These risks and uncertainties include, but are not limited to: the company's ability to use rapidly changing genetic data to interpret test results accurately and consistently; the ability of genetic testing to result in faster or more accurate diagnosis; laws and regulations applicable to the company's business; and the other risks set forth in Invitae's filings with the Securities and Exchange Commission, including the risks set forth in its Quarterly Report on Form 10-Q for the quarter ended September 30, 2019. These forward-looking statements speak only as of the date hereof, and Invitae Corporation disclaims any obligation to update these forward-looking statements.Contact:Laura D'Angelopr@invitae.com(628) 213-32831 Miller, Nicole, et al, \"Behind the Seizure: A No-Cost 125-gene Epilepsy Panel for Pediatric Seizure Onset Between 2–4 Years\". Presented at the American Society of Human Genetics Meeting: October 16–20, 2018, San Diego, CA.  View original content to download multimedia:http://www.prnewswire.com/news-releases/behind-the-seizure-program-further-expands-access-to-genetic-testing-for-children-to-speed-the-diagnosis-of-genetic-epilepsy-300983302.htmlSOURCE  Invitae Corporation"
    },
    {
        "title": "Biogen Reports Top-Line Results from Phase 2 Study in Progressive Supranuclear Palsy",
        "subtitle": "",
        "date": "Dec 13, 2019 7:30AM EST",
        "content": "CAMBRIDGE, Mass., Dec.  13, 2019  (GLOBE NEWSWIRE) -- Today, Biogen Inc. (Nasdaq: BIIB) announced topline results from the Phase 2 PASSPORT study of gosuranemab (BIIB092) for progressive supranuclear palsy (PSP). The primary endpoint, as measured by the PSP rating scale (PSPRS) at week 52, was not statistically significant. In addition, the study did not demonstrate efficacy on key clinical secondary endpoints. Based on these results, Biogen will discontinue development of gosuranemab for PSP and other primary tauopathies.“We are disappointed with the efficacy results of the Phase 2 PASSPORT study,” said Alfred Sandrock Jr., M.D., Ph.D., Executive Vice President, Research and Development and Chief Medical Officer at Biogen. “We remain unwavering in our commitment to advancing therapies that have the potential to address the significant unmet medical needs of people with neurodegenerative diseases who are faced with limited to no treatment options.”Safety results of the PASSPORT study were generally consistent with previous studies of gosuranemab. Detailed results of this study will be made available in a future scientific forum.Biogen will continue its ongoing Phase 2 TANGO study of gosuranemab for mild cognitive impairment due to Alzheimer’s disease (AD) or mild AD, given differences in disease pathology.About GosuranemabGosuranemab (BIIB092) is a humanized monoclonal antibody that targets N-terminal tau. Gosuranemab-mediated removal of N-terminal tau is being studied to evaluate whether it slows the progression of disease in tauopathies.TANGO, a Phase 2 study, is designed to evaluate the safety and tolerability of gosuranemab in participants with mild cognitive impairment due to Alzheimer’s disease or with mild Alzheimer’s disease.Biogen licensed gosuranemab from Bristol-Myers Squibb Company.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe Harbor Statement This news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements about results from the Phase 2 PASSPORT study; the potential clinical effects of gosuranemab; the potential benefits, safety and efficacy of gosuranemab; the clinical development program, clinical trials, data readouts and presentations related to gosuranemab; the potential of our commercial business and pipeline programs, including gosuranemab; and risks and uncertainties associated with drug development and commercialization. These forward-looking statements may be accompanied by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation, uncertainty of success in the development and potential commercialization of gosuranemab; the risk that we may not fully enroll our clinical trials or enrollment will take longer than expected; unexpected concerns may arise from additional data, analysis or results obtained during our clinical trials; regulatory authorities may require additional information or further studies, or may fail or refuse to approve or may delay approval of our drug candidates, including gosuranemab; the occurrence of adverse safety events; the risks of other unexpected hurdles, costs or delays; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release.We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise."
    },
    {
        "title": "Biogen Announces Positive Phase 2 Study Results for Cutaneous Lupus Erythematosus (CLE) and Systemic Lupus Erythematosus (SLE)",
        "subtitle": "",
        "date": "Dec 3, 2019 7:30AM EST",
        "content": "CAMBRIDGE, Mass., Dec.  03, 2019  (GLOBE NEWSWIRE) -- Today, Biogen Inc. (Nasdaq: BIIB) announced positive top-line results from the Phase 2 LILAC study evaluating the efficacy and safety of BIIB059, a fully humanized IgG1 monoclonal antibody (mAb) targeting blood dendritic cell antigen 2 (BDCA2) expressed on plasmacytoid dendritic cells, in patients with lupus.“There is substantial unmet medical need for people with lupus given the limited number of treatment options available to help manage this difficult-to-treat and chronic disease,” said Nathalie Franchimont, M.D., Ph.D., Vice President, Lupus and Multiple Sclerosis Portfolio at Biogen. “We are excited by the LILAC study results, and the potential for BIIB059 to be a meaningful new treatment option for patients living with lupus. We also believe these results support Biogen’s goal of continuing to build a multi-franchise portfolio by bringing potential new treatment options to people with great unmet medical need.”LILAC was a two-part study that evaluated BIIB059 versus placebo in individuals with active cutaneous lupus erythematosus (CLE), including chronic and subacute subtypes, with or without systemic manifestations and in individuals with systemic lupus erythematosus (SLE) with active joint and skin manifestations.The CLE part of the study met its primary endpoint (p"
    },
    {
        "title": "Biogen Presents Data Demonstrating Improved Gastrointestinal Tolerability With VUMERITY™ (diroximel fumarate) Compared to TECFIDERA® (dimethyl fumarate)",
        "subtitle": "",
        "date": "Nov 22, 2019 7:30AM EST",
        "content": "CAMBRIDGE, Mass., Nov.  22, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced detailed results from the Phase 3 EVOLVE-MS-2 study demonstrating the improved patient-assessed gastrointestinal (GI) tolerability of VUMERITY™ (diroximel fumarate), a new FDA-approved treatment for relapsing forms of multiple sclerosis (MS), compared to TECFIDERA® (dimethyl fumarate). These EVOLVE-MS-2 results are being presented at the 27th Annual Meeting of the European Charcot Foundation in Italy (Nov. 21-23).  “We know that each patient’s journey can vary greatly in MS, so Biogen aims to meet individual treatment goals through our broad MS portfolio,” said Alfred Sandrock, Jr., M.D., Ph.D., Executive Vice President, Research and Development, and Chief Medical Officer at Biogen. “TECFIDERA is a clinically meaningful treatment for patients, and we believe VUMERITY now builds upon our franchise as another compelling option for relapsing MS.” EVOLVE-MS-2 is the first study to directly compare the GI tolerability of two relapsing MS treatments. In this study involving relapsing-remitting MS (RRMS) patients, VUMERITY was associated with significantly shorter duration, severity and daily impact of five key GI symptoms, compared to TECFIDERA. Results for the primary endpoint show patients treated with VUMERITY self-reported 46 percent fewer days with intensity scores of ≥2 on the Individual Gastrointestinal Symptom and Impact Scale (IGISIS), compared to TECFIDERA (adjusted rate ratio [95% confidence interval]: 0.54 [0.39−0.75], p = 0.0003). IGISIS is a novel and exploratory scale used by patients in the study to self-assess the intensity and duration of key GI symptoms, including nausea, vomiting, upper and lower abdominal pain and diarrhea. Results observed with TECFIDERA in EVOLVE-MS-2 are consistent with its well-characterized safety profile.The EVOLVE-MS-2 results also indicate that compared to TECFIDERA, VUMERITY-treated patients had:These findings using the patient-assessed symptom intensity scales were supported by lower investigator-reported incidences of GI AEs with VUMERITY (34.8 percent) compared to TECFIDERA (49.0 percent). Overall AEs occurred in 78.3 percent of patients with VUMERITY and 83.7 percent with TECFIDERA. Most AEs were mild or moderate in severity. The overall proportion of patients with AEs leading to study discontinuation were 1.6 percent for VUMERITY and 5.6 percent for TECFIDERA.EVOLVE-MS-2 was a multi-center, double-blind, active-controlled, five-week Phase 3 study designed to evaluate the GI tolerability, including duration and severity, of VUMERITY compared to TECFIDERA in 506 patients with RRMS. The study’s primary endpoint assessed the number of days patients reported GI symptoms with a symptom intensity score ≥2 on the IGISIS rating scale. Secondary endpoints evaluated the number of days (relative to exposure) that patients reported GI symptoms with an IGISIS intensity scores of ≥1 or ≥3 in the overall population; IGISIS intensity score of ≥2 in patients from Part B only; GGISIS intensity scores of ≥1, ≥2, or ≥3 in the overall population; and worst (i.e., highest) IGISIS individual symptom score by study week. Patients who completed the five-week treatment period were eligible to enroll in EVOLVE-MS-1, a 96-week, open-label, safety study for VUMERITY.VUMERITY is now available in the U.S. for relapsing forms of MS.About VUMERITY™ (diroximel fumarate) VUMERITY is a novel, oral fumarate with a distinct chemical structure approved in the U.S. for the treatment of relapsing forms of multiple sclerosis, to include clinically isolated syndrome, relapsing-remitting disease and active secondary progressive disease. Once in the body, VUMERITY rapidly converts to monomethyl fumarate, the same active metabolite of dimethyl fumarate.VUMERITY is contraindicated in patients with known hypersensitivity to diroximel fumarate, dimethyl fumarate or to any of the excipients of VUMERITY; and in patients taking dimethyl fumarate. Serious side effects for VUMERITY are based on data from dimethyl fumarate (which has the same active metabolite as VUMERITY) and include anaphylaxis and angioedema, progressive multifocal leukoencephalopathy, which is a rare opportunistic viral infection of the brain that has been associated with death or severe disability, a decrease in mean lymphocyte counts during the first year of treatment, liver injury and flushing. The most common adverse events, obtained using data from dimethyl fumarate (which has the same active metabolite as VUMERITY), were flushing, abdominal pain, diarrhea and nausea.Please click here for Important Safety Information and full Prescribing Information, including Patient Information for VUMERITY in the U.S.About TECFIDERA® (dimethyl fumarate)  TECFIDERA is the most prescribed oral medication for relapsing multiple sclerosis (MS) in the world and has been shown to reduce the rate of MS relapses, slow the progression of disability and impact the number of MS brain lesions, while demonstrating a well-characterized safety profile in people with relapsing forms of MS. TECFIDERA is approved in 69 countries, and more than 415,000 patients have been treated with it, representing more than 780,000 patient-years of exposure across clinical trial use and patients prescribed TECFIDERA. Of these, 6,335 patients (14,065 patient-years) were from clinical trials.1TECFIDERA is contraindicated in patients with a known hypersensitivity to dimethyl fumarate or any of the excipients of TECFIDERA. Serious side effects include anaphylaxis and angioedema, and cases of progressive multifocal leukoencephalopathy, a rare opportunistic viral infection of the brain which has been associated with death or severe disability, have been seen with TECFIDERA patients in the setting of prolonged lymphopenia although the role of lymphopenia in these cases is uncertain. Other serious side effects include a decrease in mean lymphocyte counts during the first year of treatment, liver injury and flushing. In clinical trials, the most common adverse events associated with TECFIDERA were flushing, abdominal pain, diarrhea and nauseaPlease click here for Important Safety Information and full Prescribing Information, including Patient Information for TECFIDERA in the U.S., or visit your respective country’s product website.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. Follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe Harbor This news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to the potential benefits, safety and efficacy of VUMERITY and TECFIDERA; results from the EVOLVE-MS-2 study; the treatment of MS; the potential of Biogen’s commercial business, including VUMERITY and TECFIDERA; and risks and uncertainties associated with drug development and commercialization. These forward-looking statements may be identified by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “except,” “forecast,” “goal,” “intend,” “may,” “plan,” “possible,” “potential,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation the occurrence of adverse safety events and/or unexpected concerns that may arise from additional data or analysis; failure to obtain regulatory approvals in other jurisdictions; risks of unexpected costs or delays; unexpected concerns may arise from additional data, analysis or results obtained during clinical trials; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.1 Combined post-marketing data based on prescriptions and clinical trials exposure to TECFIDERA as of June 30, 2019."
    },
    {
        "title": "Biogen Announces Enrollment Completion of Global Phase 3 Gene Therapy Study for an Inherited Retinal Disorder",
        "subtitle": "",
        "date": "Nov 21, 2019 7:30AM EST",
        "content": "CAMBRIDGE, Mass., Nov.  21, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) announced today the enrollment of the last patient in the global Phase 3 STAR clinical study, which is evaluating the investigational gene therapy timrepigene emparvovec (BIIB111/AAV2-REP1) for the treatment of choroideremia (CHM). CHM is a rare, degenerative, X-linked inherited retinal disorder that leads to blindness.“We are excited to advance innovative investigational treatments for inherited retinal disorders that have significant unmet medical need due to the lack of treatment options,” said Alfred Sandrock, Jr., M.D., Ph.D., Executive Vice President, Research and Development, and Chief Medical Officer at Biogen. “Timrepigene emparvovec could be a transformative gene therapy for individuals living with choroideremia who would otherwise face inevitable blindness. Completing enrollment of our Phase 3 study represents a significant milestone in bringing this new potential therapy to patients.”STAR is a randomized, masked, prospective, parallel-controlled group Phase 3 study that enrolled 170 adult males with CHM. The study is evaluating the safety and efficacy of a single subretinal injection of timrepigene emparvovec. The primary endpoint is the proportion of patients with an improvement of at least 15 letters from baseline in best corrected visual acuity (BCVA) at 12 months post treatment as measured by the Early Treatment Diabetic Retinopathy Study (ETDRS) visual acuity protocol. The STAR study was initiated based on proof-of-concept data from Phase 1/2 studies, which indicated that at month 24, over 90 percent of patients treated with timrepigene emparvovec via targeted subretinal injection maintained visual acuity instead of experiencing the natural decline in BCVA expected in this degenerative disease. In a subset of treated patients with moderate to severe visual acuity loss, 21 percent experienced a gain in visual acuity of at least 15 ETDRS letters from baseline as compared to one percent of untreated patients in a natural history study.CHM primarily affects males and is caused by a loss of function in the CHM gene which encodes the Rab escort protein-1 (REP-1). The REP-1 protein plays a role in intracellular protein trafficking, and the loss of function in the CHM gene leads to abnormal intracellular protein trafficking and impaired elimination of waste products from the retinal pigment epithelium and photoreceptors. Initially, patients with CHM experience poor night vision and over time, progressive visual loss ultimately leads to blindness.Biogen added timrepigene emparvovec to its portfolio in June 2019 as part of its acquisition of Nightstar Therapeutics.For more information about the Phase 3 STAR study, visit www.clinicaltrials.gov (NCT03496012).About timrepigene emparvovec (BIIB111/AAV2-REP1)Timrepigene emparvovec is an AAV2 vector administered by subretinal injection, which aims to provide a functioning CHM gene and expression of the REP-1 protein to restore membrane trafficking and thereby slow, stop or potentially reverse decline in vision. Data from the Phase 1/2 studies demonstrated a slower rate of decline in visual acuity in patients treated with timrepigene emparvovec compared to untreated patients in the natural history study. In addition, some patients treated with timrepigene emparvovec showed improvements in visual acuity. The studies also demonstrated that timrepigene emparvovec was generally well tolerated with an acceptable safety profile.Timrepigene emparvovec has received regenerative medicine advanced therapy (RMAT) designation from the U.S. Food and Drug Administration (FDA), which includes all of the benefits of the fast track and breakthrough therapy designation programs and orphan drug designations in the U.S., Europe and Japan. The safety and efficacy of a single subretinal injection of timrepigene emparvovec is currently being evaluated in the ongoing Phase 3 STAR study.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops, and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics, and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology, and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe Harbor Statement This news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to the potential, benefits, safety and efficacy of timrepigene emparvovec; the potential clinical effects of timrepigene emparvovec; results from the Phase 1/2 studies of timrepigene emparvovec; the clinical development program for timrepigene emparvovec; the treatment of CHM; the potential of our commercial business and pipeline programs, including timrepigene emparvovec; and risks and uncertainties associated with drug development and commercialization. These forward-looking statements may be accompanied by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements, or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation, uncertainty of success in the development and potential commercialization of timrepigene emparvovec; unexpected concerns may arise from additional data, analysis or results obtained during the STAR study; regulatory authorities may require additional information or further studies, or may fail or refuse to approve or may delay approval of our drug candidates, including timrepigene emparvovec; the occurrence of adverse safety events; the risks of other unexpected hurdles, costs or delays; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; and product liability claims. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise."
    },
    {
        "title": "Alkermes Announces Receipt of $150 Million Milestone Payment from Biogen Related to FDA Approval of VUMERITY(TM)",
        "subtitle": "",
        "date": "Nov 12, 2019 7:00AM EST",
        "content": "DUBLIN, Nov. 12, 2019 /PRNewswire/ -- Alkermes plc (Nasdaq: ALKS) today announced the receipt of a $150 million milestone payment from Biogen triggered by the recent U.S. Food and Drug Administration (FDA) approval of VUMERITY™ (diroximel fumarate), a novel oral fumarate with a distinct chemical structure, for the treatment of relapsing forms of multiple sclerosis, and Alkermes' transfer to Biogen Inc. (Nasdaq: BIIB) of the New Drug Application and other regulatory documentation related to VUMERITY.\"The receipt of this milestone payment marks an important achievement for Alkermes and is a testament to the strategic execution of our clinical and regulatory activities related to VUMERITY over the past few years. This payment bolsters our solid financial foundation and increases our flexibility to pursue strategic business development opportunities and invest in our internal development pipeline,\" commented Blair Jackson, Senior Vice President of Corporate Planning.Alkermes' financial expectations for 2019, provided on Oct. 23, 2019, reflect this milestone payment. The company will record substantially all of the milestone payment as license revenue in the fourth quarter of 2019.  Under the terms of the license and collaboration agreement with Biogen, Alkermes was responsible for conducting the clinical development of VUMERITY and regulatory activities relating to its approval, and Biogen holds the exclusive, worldwide license to commercialize the product. Alkermes is entitled to receive a mid-teens percentage royalty on worldwide net commercial sales of VUMERITY, subject, under certain circumstances, to minimum annual payments for the first five years following FDA approval and customary reductions as set forth in the agreement.About VUMERITY™ (diroximel fumarate)VUMERITY is a novel oral fumarate with a distinct chemical structure approved in the U.S. for the treatment of relapsing forms of multiple sclerosis, to include clinically isolated syndrome, relapsing-remitting disease and active secondary progressive disease. Once in the body, VUMERITY rapidly converts to monomethyl fumarate, the same active metabolite of dimethyl fumarate. Please see the full Prescribing Information, including Patient Information for VUMERITY.About Alkermes plcAlkermes plc is a fully integrated, global biopharmaceutical company developing innovative medicines for the treatment of central nervous system (CNS) diseases and oncology. The company has a diversified commercial product portfolio and a substantial clinical pipeline of product candidates for diseases that include schizophrenia, depression, addiction, multiple sclerosis, and cancer. Headquartered in Dublin, Ireland, Alkermes plc has an R&D center in Waltham, Massachusetts; a research and manufacturing facility in Athlone, Ireland; and a manufacturing facility in Wilmington, Ohio. For more information, please visit Alkermes' website at www.alkermes.com.Note Regarding Forward-Looking Statements Certain statements set forth in this press release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including, but not limited to, statements concerning: the financial benefits that the milestone payment may provide, including expectations concerning the company's pursuit of business development opportunities and investments in its internal development pipeline; and details of other payments expected to become due under the license and collaboration agreement with Biogen. Alkermes cautions that forward-looking statements are inherently uncertain. Although Alkermes believes that such statements are based on reasonable assumptions within the bounds of its knowledge of its business and operations, the forward-looking statements are neither promises nor guarantees and they are necessarily subject to a high degree of uncertainty and risk. Actual performance and results may differ materially from those expressed or implied in the forward-looking statements due to various risks and uncertainties. These risks and uncertainties include, among others: whether the potential financial benefits of the milestone payment, including those related to the company's business development activities and internal development pipeline, will be achieved; whether the other payments expected to become due under the license and collaboration agreement with Biogen will become due as anticipated; and those risks described in the Alkermes Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 and in subsequent filings made by Alkermes with the U.S. Securities and Exchange Commission (SEC), which are available on the SEC's website at www.sec.gov. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. Except as required by law, the company disclaims any intention or responsibility for updating or revising any forward-looking statements contained in this press release.VUMERITYTM is a trademark of Alkermes Pharma Ireland Limited used by Biogen under an exclusive license.Alkermes Contacts: For Investors: Sandy Coombs, +1 781 609 6377For Media: Gretchen Murphy, +1 781 609 6419  View original content to download multimedia:http://www.prnewswire.com/news-releases/alkermes-announces-receipt-of-150-million-milestone-payment-from-biogen-related-to-fda-approval-of-vumerity-300955769.htmlSOURCE  Alkermes plc"
    },
    {
        "title": "Biogen to Expand Biosimilars Portfolio and Gain Access to Additional Markets Through New Transaction with Samsung Bioepis",
        "subtitle": "",
        "date": "Nov 6, 2019 7:30AM EST",
        "content": "CAMBRIDGE, Mass., Nov.  06, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced a new proposed transaction with Samsung Bioepis Co., Ltd. to secure the exclusive rights to commercialize two new ophthalmology biosimilars, SB11 referencing Lucentis®1 and SB15 referencing Eylea®2, in major markets worldwide, including the U.S., Canada, Europe, Japan and Australia. In addition, Biogen will acquire exclusive commercialization rights for its anti-TNF portfolio, including BENEPALITM (etanercept), FLIXABITM (infliximab) and IMRALDITM (adalimumab), in China. Biogen will also acquire an option to extend its existing commercial agreement with Samsung Bioepis for this anti-TNF portfolio in Europe.“We are excited about the potential to bring biosimilars to a new therapeutic area as well as new regions around the world with the goal of sustainably advancing broad access to care for patients in need,” said Michel Vounatsos, Biogen’s Chief Executive Officer. “This transaction would expand the potential for our leading biosimilars business worldwide, while complementing Biogen’s presence in ophthalmology.”Biosimilars are products that have been demonstrated to be similar in efficacy and safety to the originator’s approved biological product, with the advantage that they offer cost savings and promote sustainable access to therapies. In Europe, over 180,000 patients have been treated with a Biogen anti-TNF biosimilar, and, based on its internal estimates, the company expects the uptake of BENEPALI, FLIXABI and IMRALDI to generate approximately 1.8 billion Euros in healthcare cost savings in 20193.The proposed addition of the two ophthalmology biosimilars complements Biogen’s expanding efforts in this therapeutic area. Through the recent acquisition of Nightstar Therapeutics plc, a clinical-stage gene therapy company focused on treatments for inherited retinal disorders, Biogen acquired two mid- to late-stage clinical assets, as well as several preclinical programs, in ophthalmology.Lucentis and Eylea are therapies widely used to treat ophthalmologic conditions such as neovascular (wet) age-related macular degeneration (AMD), macular edema following retinal vein occlusion (RVO), diabetic macular edema (DME) and diabetic retinopathy (DR) in patients with DME. In 2018 global sales for Lucentis and Eylea were almost $11 billion, with more than $5.8 billion spent in the U.S. alone4.                                                           Chirfi Guindo, Executive Vice President and Head of Global Product Strategy and Commercialization at Biogen, added “We believe savings enabled by biosimilars provide payers and health systems globally the budgetary headroom to fund innovation. According to a 2017 RAND Report, in the U.S. alone savings generated from biosimilar uptake could reach as high as $150 billion over a ten-year period5. We look forward to expanding our biosimilars portfolio in major markets worldwide.”Under the terms of the proposed transaction, Biogen will make a $100 million upfront payment to Samsung Bioepis. Additionally, Biogen may pay Samsung Bioepis up to $210 million in additional development, regulatory and sales-based milestones. Samsung Bioepis will be responsible for development and will supply both products to Biogen at a pre-specified gross margin.Biogen will also obtain an option to extend the term of its current European commercial agreement for its three anti-TNF biosimilars by an additional five years, subject to payment of an option exercise fee of $60 million.Biogen will also receive exclusive commercialization rights to BENEPALI, FLIXABI and IMRALDI in China in exchange for a royalty on sales in that market.Upon closing, Biogen expects to record a charge to research and development expense of approximately $65 million related to the $100 million upfront payment.The proposed transaction is subject to customary closing conditions, including the expiration of the applicable waiting period under the Hart Scott Rodino Antitrust Improvements Act of 1976 in the U.S. Biogen expects the deal to close in the fourth quarter of 2019.About BENEPALI (etanercept)BENEPALI (etanercept), a biosimilar referencing Enbrel®6, was approved by the European Commission (EC) in January 2016 for the treatment of adults with moderate to severe rheumatoid arthritis, psoriatic arthritis, axial spondyloarthritis (ankylosing spondylitis and non-radiographic axial spondyloarthritis) and plaque psoriasis. BENEPALI is currently available in 25 countries in Europe and is the most prescribed etanercept in the five largest European countries (Germany, UK, France, Italy and Spain)7.About FLIXABI (infliximab)FLIXABI (infliximab), a biosimilar referencing Remicade®8, was approved by the European Commission (EC) in May 2016 for the treatment of adults with rheumatoid arthritis, Crohn’s disease, ulcerative colitis, ankylosing spondylitis, psoriatic arthritis or psoriasis. FLIXABI can also be used in patients 6-17 years old with severe, active Crohn’s disease or severely active ulcerative colitis when they have not responded to or cannot take other medicines or treatments. FLIXABI is currently available in 17 countries in Europe9.About IMRALDI (adalimumab)IMRALDI (adalimumab), a biosimilar referencing Humira®10, was approved by the European Commission (EC) in August 2017 for the treatment of rheumatoid arthritis, juvenile idiopathic arthritis, axial spondyloarthritis, psoriatic arthritis, psoriasis, pediatric plaque psoriasis, adult and adolescent hidradenitis suppurativa, Crohn’s disease, pediatric Crohn’s disease, ulcerative colitis and uveitis. IMRALDI is currently available in 19 countries in Europe and is the leading adalimumab biosimilar in Germany and in Europe11,12.About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops, and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics, and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology, and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.About Samsung Bioepis Co., Ltd.Established in 2012, Samsung Bioepis is a biopharmaceutical company committed to realizing healthcare that is accessible to everyone. Through innovations in product development and a firm commitment to quality, Samsung Bioepis aims to become the world’s leading biopharmaceutical company. Samsung Bioepis continues to advance a broad pipeline of biosimilar candidates that cover a spectrum of therapeutic areas, including immunology, oncology and ophthalmology.Samsung Bioepis is a joint venture between Samsung BioLogics and Biogen. For more information, please visit: www.samsungbioepis.com and follow us on social media – Twitter, LinkedIn. Biogen Safe HarborThis news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to the potential benefits and results that may be achieved through Biogen’s proposed transaction with Samsung Bioepis; the anticipated completion and timing of the proposed transaction; Biogen’s objectives and intentions regarding the option to extend the term of its European commercial agreement with Samsung Bioepis; when, and whether, Biogen expects to exercise its option to extend the term of its European commercial agreement with Samsung Bioepis; the potential benefits, safety and efficacy of SB11 and SB15; the timing and status of current and future regulatory filings; risks and uncertainties associated with drug development and commercialization, including SB11 and SB15; the potential of Biogen’s commercial business and pipeline programs, including BENEPALI, FLIXABI, IMRALDI, SB11 and SB15; the anticipated benefits and potential of Biogen’s collaboration arrangements with Samsung Bioepis; Biogen’s strategy and plans; Biogen’s capital allocation and investment strategy; Biogen’s future financial and operating results; and potential cost healthcare savings related to biosimilars. These forward-looking statements may be accompanied by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation, risks that the proposed transaction will be completed in a timely manner or at all; the possibility that certain closing conditions to the proposed transaction will not be satisfied; uncertainty as to whether the anticipated benefits of the proposed transaction and/or the Samsung Bioepis joint venture can be achieved; risks of unexpected costs or delays; uncertainty of success in the development and potential commercialization of SB11 and SB15, which may be impacted by, among other things, the occurrence of adverse safety events, unexpected concerns that may arise from additional data or analysis, failure to obtain regulatory approvals in certain jurisdictions, failure to protect and enforce data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; risks of legal actions, regulatory scrutiny or other challenges to biosimilars; the risks of other unexpected hurdles; the risks of doing business internationally, including currency exchange rate fluctuations; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from Biogen’s expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in Biogen’s most recent annual or quarterly report and in other reports Biogen has filed with the U.S. Securities and Exchange Commission. These statements are based on Biogen’s current beliefs and expectations and speak only as of the date of this news release. Biogen does not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.1Lucentis is a registered trademark of Genentech. 2Eylea is a registered trademark of Regeneron Pharmaceuticals, Inc.3Biogen data on file.4Source: company reported sales, EvaluatePharma.5Mulcahy, Andrew W., Jakub P. Hlavka, and Spencer R. Case, Biosimilar Cost Savings in the United States: Initial Experience and Future Potential. Santa Monica, CA: RAND Corporation, 20176Enbrel is a registered trademark of Wyeth LLC.7Data on file: IQVIA, GERS, Insight Health ODV.8Remicade is a registered trademark of Janssen Biotech, Inc.9Data of file: IQVIA, GERS, Insight Health ODV.10Humira is a registered trademark of AbbVie Biotechnology Ltd.11Data on file: IQVIA, GERS, Insight Health ODV.12Biogen data on file."
    },
    {
        "title": "Biogen to Host Investor Webcasts from Clinical Trials on Alzheimer’s Disease (CTAD) Congress on December 5, 2019",
        "subtitle": "",
        "date": "Nov 4, 2019 4:30PM EST",
        "content": "CAMBRIDGE, Mass., Nov.  04, 2019  (GLOBE NEWSWIRE) -- Biogen (Nasdaq: BIIB) today announced it will host live webcasts of its oral presentation and a Q&A session related to its Alzheimer’s disease investigational therapy, aducanumab, at the upcoming Clinical Trials on Alzheimer’s Disease (CTAD) annual congress in San Diego, California.  Webcast Details:To access the live webcasts, please go to the Investors section of Biogen’s website at investors.biogen.com.  Following the live webcasts, archived versions will be available on the website.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops, and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics, and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology, and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.About AducanumabAducanumab (BIIB037) is an investigational human monoclonal antibody studied for the treatment of early Alzheimer’s disease. Biogen licensed aducanumab from Neurimmune under a collaborative development and license agreement. Since October 2017, Biogen and Eisai have collaborated on the development and commercialization of aducanumab globally.EMERGE and ENGAGE were Phase 3 multicenter, randomized, double-blind, placebo-controlled, parallel-group studies designed to evaluate the efficacy and safety of aducanumab. The primary objective of the studies was to evaluate the efficacy of monthly doses of aducanumab as compared with placebo in reducing cognitive and functional impairment as measured by changes in the Clinical Dementia Rating-Sum of Boxes (CDR-SB) score. Secondary objectives were to assess the effect of monthly doses of aducanumab as compared to placebo on clinical decline as measured by the Mini-Mental State Examination (MMSE), the Alzheimer’s Disease Assessment Scale-Cognitive Subscale 13 Items (ADAS-Cog 13), and the Alzheimer’s Disease Cooperative Study-Activities of Daily Living Inventory Mild Cognitive Impairment Version (ADCS-ADL-MCI)."
    },
    {
        "title": "Biogen and Alkermes Announce FDA Approval of VUMERITY(TM) (diroximel fumarate) for Multiple Sclerosis",
        "subtitle": "- VUMERITY, a New Oral Treatment Option for Relapsing Forms of MS, Offers a Combination of Well-Characterized Efficacy, Safety and Tolerability -",
        "date": "Oct 30, 2019 7:30AM EDT",
        "content": "CAMBRIDGE, Mass. and DUBLIN, Oct. 30, 2019 /PRNewswire/ -- Biogen Inc. (Nasdaq: BIIB) and Alkermes plc (Nasdaq: ALKS) today announced that the U.S. Food and Drug Administration (FDA) approved VUMERITY™ (diroximel fumarate), a novel oral fumarate with a distinct chemical structure, for the treatment of relapsing forms of multiple sclerosis (MS), to include clinically isolated syndrome, relapsing-remitting disease and active secondary progressive disease. Biogen holds the exclusive, worldwide license to commercialize VUMERITY and intends to make it available in the United States in the near future.\"The FDA's approval of VUMERITY delivers on Biogen's commitment to pursue new therapies that may provide meaningful impact for people living with relapsing MS, and we look forward to bringing it to the MS community as an additional treatment option,\" said Alfred Sandrock, Jr., M.D., Ph.D., executive vice president, research and development, and chief medical officer at Biogen. \"VUMERITY is a novel fumarate that offers the well-characterized efficacy of TECFIDERA® (dimethyl fumarate) and has been studied for improved patient-reported gastrointestinal tolerability.\" \"The approval of VUMERITY for relapsing MS marks the culmination of a multi-year development program and is the latest milestone in our mission to develop new treatments for patients living with chronic central nervous system disorders,\" said Craig Hopkinson, M.D., chief medical officer and senior vice president of medicines development and medical affairs at Alkermes. \"We are grateful to the patients and study investigators who have participated in our VUMERITY clinical trials and we look forward to working with our collaboration partners at Biogen to make this new treatment available to patients.\"The FDA approval of VUMERITY was based on a New Drug Application (NDA) submitted under the 505(b)(2) filing pathway. It included data from pharmacokinetic bridging studies comparing VUMERITY and TECFIDERA to establish bioequivalence, and relied, in part, on the FDA's findings of safety and efficacy for TECFIDERA.The NDA submission also included interim exposure and safety findings from EVOLVE-MS-1, an ongoing, Phase 3, single-arm, open-label, two-year safety study evaluating VUMERITY in patients with relapsing-remitting MS. Interim results from EVOLVE-MS-1 at the time of NDA submission included a low overall rate of VUMERITY treatment discontinuation due to adverse events (6.3 percent), and a rate of less than one percent of patients who discontinued VUMERITY treatment due to gastrointestinal (GI) adverse events. Additional exploratory efficacy endpoints in the ongoing EVOLVE-MS-1 study showed changes in clinical and radiological measures compared to baseline.\"MS is a heterogeneous disease, and real-world patient circumstances can vary, reinforcing the benefits of having therapeutic choices to support the diverse range of treatment considerations,\" said Robert Naismith, M.D., professor of neurology, Washington University School of Medicine in St. Louis. \"Throughout its clinical development program, VUMERITY has demonstrated a desirable therapeutic profile, making it a compelling new option for patients.\"\"MS is a lifelong disease that has a significant impact on the people affected and their caregivers. We are encouraged by the progress being made in the treatment of MS, and pleased that another treatment option will soon be available,\" said Bruce Bebo, Ph.D., executive vice president, research, National MS Society. \"It's important for people with MS to have treatments that are both efficacious and tolerable to help manage their disease.\"Under the terms of the license and collaboration agreement between Biogen and Alkermes, Biogen will pay Alkermes $150 million in connection with the FDA's approval of VUMERITY. Biogen plans to account for this milestone payment as an asset that will be amortized over the expected useful life of the product. Alkermes is also entitled to receive a mid-teens percentage royalty on worldwide net commercial sales of VUMERITY, subject, under certain circumstances, to minimum annual payments for the first five years following FDA approval and customary reductions as set forth in the agreement.Please see full Prescribing Information for VUMERITY.About VUMERITY™ (diroximel fumarate)VUMERITY is a novel oral fumarate with a distinct chemical structure approved in the U.S. for the treatment of relapsing forms of multiple sclerosis, to include clinically isolated syndrome, relapsing-remitting disease and active secondary progressive disease. Once in the body, VUMERITY rapidly converts to monomethyl fumarate, the same active metabolite of dimethyl fumarate.About the VUMERITY EVOLVE-MS Clinical Development ProgramThe key components of the EVOLVE-MS (Endeavoring to Advance Treatment for Patients Living with Multiple Sclerosis) clinical development program of VUMERITY include the EVOLVE-MS-1 study, a Phase 3, open-label, two-year safety study in relapsing-remitting multiple sclerosis (MS) patients, along with pharmacokinetic bridging studies comparing VUMERITY and TECFIDERA to demonstrate bioequivalence. The EVOLVE-MS clinical development program also includes the EVOLVE-MS-2 study, an elective Phase 3, five-week randomized, prospective, double-blind, multi-center study that assessed the gastrointestinal (GI) tolerability of VUMERITY and TECFIDERA using self-administered GI questionnaires. INDICATION and IMPORTANT SAFETY INFORMATION for VUMERITY™ (diroximel fumarate) What is VUMERITY™ (diroximel fumarate)?VUMERITY is a prescription medicine used to treat people with relapsing forms of multiple sclerosis (MS), to include clinically isolated syndrome, relapsing-remitting disease, and active secondary progressive disease, in adults. It is not known if VUMERITY is safe and effective in children. Important Safety InformationWho should not take VUMERITY?Patients should not use VUMERITY if they have had an allergic reaction (such as welts, hives, swelling of the face, lips, mouth or tongue, or difficulty breathing) to diroximel fumarate, dimethyl fumarate, or any of the ingredients in VUMERITY or if they are taking dimethyl fumarate.Before taking and while taking VUMERITY, patients should tell their healthcare provider if they: have liver problems; kidney problems; have or have had low white blood cell counts or an infection; are pregnant or plan to become pregnant because it is not known if VUMERITY will harm an unborn baby; are breastfeeding or plan to breastfeed because it is not known if VUMERITY passes into breast milk; are taking prescription or over-the-counter medicines, vitamins, or herbal supplements.What should patients avoid while taking VUMERITY?Patients should not drink alcohol at the same time they take a VUMERITY dose.What are the possible side effects of VUMERITY?VUMERITY may cause serious side effects including: The most common side effects of VUMERITY include: flushing, redness, itching, or rash; nausea, vomiting, diarrhea, stomach pain, or indigestion. Flushing and stomach problems are the most common reactions, especially at the start of therapy, and may decrease over time. Taking VUMERITY with food (avoid high-fat, high-calorie meal or snack) may help reduce flushing. Patients should call their healthcare provider if they have any of these symptoms, are bothered by them, or if they do not go away. These are not all the possible side effects of VUMERITY. Patients should call their healthcare provider for medical advice about side effects. Patients may report side effects to FDA at 1-800-FDA-1088. For more information go to dailymed.nlm.nih.gov.Please see the full Prescribing Information, including Patient Information for VUMERITY.INDICATION and IMPORTANT SAFETY INFORMATION for TECFIDERA® (dimethyl fumarate)What is TECFIDERA® (dimethyl fumarate)?TECFIDERA is a prescription medicine used to treat relapsing forms of multiple sclerosis (MS), to include clinically isolated syndrome, relapsing-remitting disease, and active secondary progressive disease, in adults. It is not known if TECFIDERA is safe and effective in children under 18 years of age.Important Safety InformationWho should not take TECFIDERA?Patients should not use TECFIDERA if they have had an allergic reaction (such as welts, hives, swelling of the face, lips, mouth or tongue, or difficulty breathing) to TECFIDERA or any of its ingredients. Before taking and while taking TECFIDERA, patients should tell their healthcare provider if they have or have had: low white blood cell counts, an infection, or any other medical conditions.Patients should tell their healthcare provider if they: are pregnant or plan to become pregnant, because it is not known if TECFIDERA will harm an unborn baby; patients should talk to their healthcare provider about enrolling in the TECFIDERA Pregnancy Registry if they become pregnant while taking TECFIDERA; the purpose of this registry is to monitor the health of the patient and baby and patients can enroll by calling 1-866-810-1462 or visiting www.tecfiderapregnancyregistry.com; are breastfeeding or plan to breastfeed because it is not known if TECFIDERA passes into breast milk; are taking prescription or over-the-counter medicines, vitamins, or herbal supplements.What are the possible side effects of TECFIDERA?TECFIDERA may cause serious side effects, including: The most common side effects of TECFIDERA include: flushing, redness, itching, or rash; nausea, vomiting, diarrhea, stomach pain, or indigestion. Flushing and stomach problems are the most common reactions, especially at the start of therapy, and may decrease over time. Taking TECFIDERA with food may help reduce flushing. Patients should call their healthcare provider if they have any of these symptoms, are bothered by them, or if they do not go away. Ask your healthcare provider if taking aspirin before taking TECFIDERA may reduce flushing. These are not all the possible side effects of TECFIDERA. Patients should call their healthcare provider for medical advice about side effects. Patients may report side effects to FDA at 1-800-FDA-1088. For more information go to dailymed.nlm.nih.gov.Please see full Prescribing Information, including Patient Information.About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops, and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world's first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics, and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer's disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.About Alkermes plcAlkermes plc is a fully integrated, global biopharmaceutical company developing innovative medicines for the treatment of central nervous system (CNS) diseases and oncology. The company has a diversified commercial product portfolio and a substantial clinical pipeline of product candidates for diseases that include schizophrenia, depression, addiction, multiple sclerosis and cancer. Headquartered in Dublin, Ireland, Alkermes plc has an R&D center in Waltham, Massachusetts; a research and manufacturing facility in Athlone, Ireland; and a manufacturing facility in Wilmington, Ohio. For more information, please visit Alkermes' website at www.alkermes.com.Biogen Safe HarborThis press release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to the potential benefits, safety and efficacy of VUMERITY and TECFIDERA; potential clinical effects of VUMERITY and TECFIDERA; results from the EVOLVE-MS-1 and EVOLVE-MS-2 studies; the clinical development program for VUMERITY; the launch of VUMERITY, including the timing of the launch; Biogen's research and development program for the treatment of MS; the treatment of MS; the potential of Biogen's commercial business and pipeline programs, including VUMERITY and TECFIDERA; the anticipated benefits and potential of Biogen's collaboration arrangements with Alkermes; risks and uncertainties associated with drug development and commercialization; and Biogen's future financial and operating results. These forward-looking statements may be identified by words such as \"aim,\" \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"except,\" \"forecast,\" \"goal,\" \"intend,\" \"may,\" \"plan,\" \"possible,\" \"potential,\" \"will,\" \"would\" and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation the occurrence of adverse safety events and/or unexpected concerns that may arise from additional data or analysis; risks of unexpected costs or delays; regulatory authorities may require additional information or further studies, or may fail to approve or may delay approval of Biogen's drug candidates; unexpected concerns may arise from additional data, analysis or results obtained during clinical trials; failure to protect and enforce Biogen's data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; uncertainty of success in the commercialization of VUMERITY; risks relating to the potential launch of VUMERITY, including preparedness of healthcare providers to treat patients, the ability to obtain and maintain adequate reimbursement for VUMERITY and other unexpected difficulties or hurdles; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from Biogen's expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in Biogen's most recent annual or quarterly report and in other reports Biogen has filed with the U.S. Securities and Exchange Commission. These statements are based on Biogen's current beliefs and expectations and speak only as of the date of this press release. Biogen does not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.Alkermes Note Regarding Forward-Looking Statements Certain statements set forth in this press release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including, but not limited to, statements concerning: the potential therapeutic and commercial value of VUMERITY for the treatment of relapsing forms of MS; continued activities in the EVOLVE-MS clinical development program for VUMERITY; plans and expected timing for the commercial launch of VUMERITY by Biogen; and the financial and commercial benefits that may be achieved under the license and collaboration agreement between Alkermes and Biogen in connection with the approval and commercialization of VUMERITY. Alkermes cautions that forward-looking statements are inherently uncertain. Although Alkermes believes that such statements are based on reasonable assumptions within the bounds of its knowledge of its business and operations, the forward-looking statements are neither promises nor guarantees and they are necessarily subject to a high degree of uncertainty and risk. Actual performance and results may differ materially from those expressed or implied in the forward-looking statements due to various risks and uncertainties. These risks and uncertainties include, among others: whether clinical results for VUMERITY will be predictive of real-world results; whether VUMERITY, in real-world use, is shown to be unsafe or ineffective; whether VUMERITY receives reimbursement from government and third-party payers; whether there will be unexpected costs or delays in the commercial launch of VUMERITY; whether physicians and patients perceive VUMERITY as efficacious and well-tolerated; whether the potential financial and commercial benefits of collaboration with Biogen under the license and collaboration agreement between Alkermes and Biogen will be achieved; and those risks described in the Alkermes Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 and in subsequent filings made by Alkermes with the U.S. Securities and Exchange Commission (SEC), which are available on the SEC's website at www.sec.gov. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. Except as required by law, the company disclaims any intention or responsibility for updating or revising any forward-looking statements contained in this press release.TECFIDERA® is a registered trademark of Biogen Inc.VUMERITY™ is a trademark of Alkermes Pharma Ireland Limited used by Biogen under an exclusive license.   View original content to download multimedia:http://www.prnewswire.com/news-releases/biogen-and-alkermes-announce-fda-approval-of-vumerity-diroximel-fumarate-for-multiple-sclerosis-300947775.htmlSOURCE  Alkermes plc"
    },
    {
        "title": "Biogen and Alkermes Announce FDA Approval of VUMERITY™ (diroximel fumarate) for Multiple Sclerosis",
        "subtitle": "",
        "date": "Oct 30, 2019 7:30AM EDT",
        "content": "CAMBRIDGE, Mass. and DUBLIN, Ireland, Oct.  30, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) and Alkermes plc (Nasdaq: ALKS) today announced that the U.S. Food and Drug Administration (FDA) approved VUMERITY™ (diroximel fumarate), a novel oral fumarate with a distinct chemical structure, for the treatment of relapsing forms of multiple sclerosis (MS), to include clinically isolated syndrome, relapsing-remitting disease and active secondary progressive disease. Biogen holds the exclusive, worldwide license to commercialize VUMERITY and intends to make it available in the United States in the near future.“The FDA’s approval of VUMERITY delivers on Biogen’s commitment to pursue new therapies that may provide meaningful impact for people living with relapsing MS, and we look forward to bringing it to the MS community as an additional treatment option,” said Alfred Sandrock, Jr., M.D., Ph.D., executive vice president, research and development, and chief medical officer at Biogen. “VUMERITY is a novel fumarate that offers the well-characterized efficacy of TECFIDERA® (dimethyl fumarate) and has been studied for improved patient-reported gastrointestinal tolerability.”“The approval of VUMERITY for relapsing MS marks the culmination of a multi-year development program and is the latest milestone in our mission to develop new treatments for patients living with chronic central nervous system disorders,” said Craig Hopkinson, M.D., chief medical officer and senior vice president of medicines development and medical affairs at Alkermes. “We are grateful to the patients and study investigators who have participated in our VUMERITY clinical trials and we look forward to working with our collaboration partners at Biogen to make this new treatment available to patients.”The FDA approval of VUMERITY was based on a New Drug Application (NDA) submitted under the 505(b)(2) filing pathway. It included data from pharmacokinetic bridging studies comparing VUMERITY and TECFIDERA to establish bioequivalence, and relied, in part, on the FDA’s findings of safety and efficacy for TECFIDERA.The NDA submission also included interim exposure and safety findings from EVOLVE-MS-1, an ongoing, Phase 3, single-arm, open-label, two-year safety study evaluating VUMERITY in patients with relapsing-remitting MS. Interim results from EVOLVE-MS-1 at the time of NDA submission included a low overall rate of VUMERITY treatment discontinuation due to adverse events (6.3 percent), and a rate of less than one percent of patients who discontinued VUMERITY treatment due to gastrointestinal (GI) adverse events. Additional exploratory efficacy endpoints in the ongoing EVOLVE-MS-1 study showed changes in clinical and radiological measures compared to baseline.“MS is a heterogeneous disease, and real-world patient circumstances can vary, reinforcing the benefits of having therapeutic choices to support the diverse range of treatment considerations,” said Robert Naismith, M.D., professor of neurology, Washington University School of Medicine in St. Louis. “Throughout its clinical development program, VUMERITY has demonstrated a desirable therapeutic profile, making it a compelling new option for patients.”“MS is a lifelong disease that has a significant impact on the people affected and their caregivers. We are encouraged by the progress being made in the treatment of MS, and pleased that another treatment option will soon be available,” said Bruce Bebo, Ph.D., executive vice president, research, National MS Society. “It’s important for people with MS to have treatments that are both efficacious and tolerable to help manage their disease.”Under the terms of the license and collaboration agreement between Biogen and Alkermes, Biogen will pay Alkermes $150 million in connection with the FDA’s approval of VUMERITY. Biogen plans to account for this milestone payment as an asset that will be amortized over the expected useful life of the product. Alkermes is also entitled to receive a mid-teens percentage royalty on worldwide net commercial sales of VUMERITY, subject, under certain circumstances, to minimum annual payments for the first five years following FDA approval and customary reductions as set forth in the agreement.Please see full Prescribing Information for VUMERITY.About VUMERITY™ (diroximel fumarate) VUMERITY is a novel oral fumarate with a distinct chemical structure approved in the U.S. for the treatment of relapsing forms of multiple sclerosis, to include clinically isolated syndrome, relapsing-remitting disease and active secondary progressive disease. Once in the body, VUMERITY rapidly converts to monomethyl fumarate, the same active metabolite of dimethyl fumarate.About the VUMERITY EVOLVE-MS Clinical Development ProgramThe key components of the EVOLVE-MS (Endeavoring to Advance Treatment for Patients Living with Multiple Sclerosis) clinical development program of VUMERITY include the EVOLVE-MS-1 study, a Phase 3, open-label, two-year safety study in relapsing-remitting multiple sclerosis (MS) patients, along with pharmacokinetic bridging studies comparing VUMERITY and TECFIDERA to demonstrate bioequivalence. The EVOLVE-MS clinical development program also includes the EVOLVE-MS-2 study, an elective Phase 3, five-week randomized, prospective, double-blind, multi-center study that assessed the gastrointestinal (GI) tolerability of VUMERITY and TECFIDERA using self-administered GI questionnaires.  INDICATION and IMPORTANT SAFETY INFORMATION for VUMERITY™ (diroximel fumarate)What is VUMERITYTM (diroximel fumarate)?VUMERITY is a prescription medicine used to treat people with relapsing forms of multiple sclerosis (MS), to include clinically isolated syndrome, relapsing-remitting disease, and active secondary progressive disease, in adults. It is not known if VUMERITY is safe and effective in children.Important Safety InformationWho should not take VUMERITY?Patients should not use VUMERITY if they have had an allergic reaction (such as welts, hives, swelling of the face, lips, mouth or tongue, or difficulty breathing) to diroximel fumarate, dimethyl fumarate, or any of the ingredients in VUMERITY or if they are taking dimethyl fumarate.             Before taking and while taking VUMERITY, patients should tell their healthcare provider if they: have liver problems; kidney problems; have or have had low white blood cell counts or an infection; are pregnant or plan to become pregnant because it is not known if VUMERITY will harm an unborn baby; are breastfeeding or plan to breastfeed because it is not known if VUMERITY passes into breast milk; are taking prescription or over-the-counter medicines, vitamins, or herbal supplements.What should patients avoid while taking VUMERITY?Patients should not drink alcohol at the same time they take a VUMERITY dose.What are the possible side effects of VUMERITY?VUMERITY may cause serious side effects including: The most common side effects of VUMERITY include: flushing, redness, itching, or rash; nausea, vomiting, diarrhea, stomach pain, or indigestion. Flushing and stomach problems are the most common reactions, especially at the start of therapy, and may decrease over time. Taking VUMERITY with food (avoid high-fat, high-calorie meal or snack) may help reduce flushing. Patients should call their healthcare provider if they have any of these symptoms, are bothered by them, or if they do not go away.These are not all the possible side effects of VUMERITY. Patients should call their healthcare provider for medical advice about side effects. Patients may report side effects to FDA at 1-800-FDA-1088. For more information go to dailymed.nlm.nih.gov.             Please see the full Prescribing Information, including Patient Information for VUMERITY.INDICATION and IMPORTANT SAFETY INFORMATION for TECFIDERA® (dimethyl fumarate)What is TECFIDERA® (dimethyl fumarate)?TECFIDERA is a prescription medicine used to treat relapsing forms of multiple sclerosis (MS), to include clinically isolated syndrome, relapsing-remitting disease, and active secondary progressive disease, in adults. It is not known if TECFIDERA is safe and effective in children under 18 years of age.       Important Safety InformationWho should not take TECFIDERA?Patients should not use TECFIDERA if they have had an allergic reaction (such as welts, hives, swelling of the face, lips, mouth or tongue, or difficulty breathing) to TECFIDERA or any of its ingredients.Before taking and while taking TECFIDERA, patients should tell their healthcare provider if they have or have had: low white blood cell counts, an infection, or any other medical conditions.Patients should tell their healthcare provider if they: are pregnant or plan to become pregnant, because it is not known if TECFIDERA will harm an unborn baby; patients should talk to their healthcare provider about enrolling in the TECFIDERA Pregnancy Registry if they become pregnant while taking TECFIDERA; the purpose of this registry is to monitor the health of the patient and baby and patients can enroll by calling 1-866-810-1462 or visiting www.tecfiderapregnancyregistry.com; are breastfeeding or plan to breastfeed because it is not known if TECFIDERA passes into breast milk; are taking prescription or over-the-counter medicines, vitamins, or herbal supplements.       What are the possible side effects of TECFIDERA?TECFIDERA may cause serious side effects, including: The most common side effects of TECFIDERA include: flushing, redness, itching, or rash; nausea, vomiting, diarrhea, stomach pain, or indigestion. Flushing and stomach problems are the most common reactions, especially at the start of therapy, and may decrease over time. Taking TECFIDERA with food may help reduce flushing. Patients should call their healthcare provider if they have any of these symptoms, are bothered by them, or if they do not go away. Ask your healthcare provider if taking aspirin before taking TECFIDERA may reduce flushing. These are not all the possible side effects of TECFIDERA. Patients should call their healthcare provider for medical advice about side effects. Patients may report side effects to FDA at 1-800-FDA-1088. For more information go to dailymed.nlm.nih.gov.Please see full Prescribing Information, including Patient Information.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops, and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics, and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.About Alkermes plc Alkermes plc is a fully integrated, global biopharmaceutical company developing innovative medicines for the treatment of central nervous system (CNS) diseases and oncology. The company has a diversified commercial product portfolio and a substantial clinical pipeline of product candidates for diseases that include schizophrenia, depression, addiction, multiple sclerosis and cancer. Headquartered in Dublin, Ireland, Alkermes plc has an R&D center in Waltham, Massachusetts; a research and manufacturing facility in Athlone, Ireland; and a manufacturing facility in Wilmington, Ohio. For more information, please visit Alkermes' website at www.alkermes.com.Biogen Safe HarborThis press release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to the potential benefits, safety and efficacy of VUMERITY and TECFIDERA; potential clinical effects of VUMERITY and TECFIDERA; results from the EVOLVE-MS-1 and EVOLVE-MS-2 studies; the clinical development program for VUMERITY; the launch of VUMERITY, including the timing of the launch; Biogen’s research and development program for the treatment of MS; the treatment of MS; the potential of Biogen’s commercial business and pipeline programs, including VUMERITY and TECFIDERA; the anticipated benefits and potential of Biogen’s collaboration arrangements with Alkermes; risks and uncertainties associated with drug development and commercialization; and Biogen’s future financial and operating results. These forward-looking statements may be identified by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “except,” “forecast,” “goal,” “intend,” “may,” “plan,” “possible,” “potential,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation the occurrence of adverse safety events and/or unexpected concerns that may arise from additional data or analysis; risks of unexpected costs or delays; regulatory authorities may require additional information or further studies, or may fail to approve or may delay approval of Biogen’s drug candidates; unexpected concerns may arise from additional data, analysis or results obtained during clinical trials; failure to protect and enforce Biogen’s data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; uncertainty of success in the commercialization of VUMERITY; risks relating to the potential launch of VUMERITY, including preparedness of healthcare providers to treat patients, the ability to obtain and maintain adequate reimbursement for VUMERITY and other unexpected difficulties or hurdles; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from Biogen’s expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in Biogen’s most recent annual or quarterly report and in other reports Biogen has filed with the U.S. Securities and Exchange Commission. These statements are based on Biogen’s current beliefs and expectations and speak only as of the date of this press release. Biogen does not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.Alkermes Note Regarding Forward-Looking Statements  Certain statements set forth in this press release constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including, but not limited to, statements concerning: the potential therapeutic and commercial value of VUMERITY for the treatment of relapsing forms of MS; continued activities in the EVOLVE-MS clinical development program for VUMERITY; plans and expected timing for the commercial launch of VUMERITY by Biogen; and the financial and commercial benefits that may be achieved under the license and collaboration agreement between Alkermes and Biogen in connection with the approval and commercialization of VUMERITY. Alkermes cautions that forward-looking statements are inherently uncertain. Although Alkermes believes that such statements are based on reasonable assumptions within the bounds of its knowledge of its business and operations, the forward-looking statements are neither promises nor guarantees and they are necessarily subject to a high degree of uncertainty and risk. Actual performance and results may differ materially from those expressed or implied in the forward-looking statements due to various risks and uncertainties. These risks and uncertainties include, among others: whether clinical results for VUMERITY will be predictive of real-world results; whether VUMERITY, in real-world use, is shown to be unsafe or ineffective; whether VUMERITY receives reimbursement from government and third-party payers; whether there will be unexpected costs or delays in the commercial launch of VUMERITY; whether physicians and patients perceive VUMERITY as efficacious and well-tolerated; whether the potential financial and commercial benefits of collaboration with Biogen under the license and collaboration agreement between Alkermes and Biogen will be achieved; and those risks described in the Alkermes Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 and in subsequent filings made by Alkermes with the U.S. Securities and Exchange Commission (SEC), which are available on the SEC’s website at www.sec.gov. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. Except as required by law, the company disclaims any intention or responsibility for updating or revising any forward-looking statements contained in this press release.TECFIDERA® is a registered trademark of Biogen Inc.VUMERITYTM is a trademark of Alkermes Pharma Ireland Limited used by Biogen under an exclusive license.Alkermes Contacts: For Investors: Sandy Coombs,      +1 781 609 6377For Media:      Gretchen Murphy,  +1 781 609 6419Biogen Contacts:For Media: David Caouette, + 617 679 4945, public.affairs@biogen.comFor Investors: Joe Mara, +1 781 464 2442, IR@biogen.com             A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/1af51ae4-577d-4558-ad41-7abe5a1dae24A video accompanying this announcement is available at: https://www.globenewswire.com/NewsRoom/AttachmentNg/3191c160-3316-4e9c-bdd0-97ade134f441"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Biogen, Boston Scientific, Lyft, or Wells Fargo?",
        "subtitle": "",
        "date": "Oct 23, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 23, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, BIIB, BSX, LYFT, and WFC.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-biogen-boston-scientific-lyft-or-wells-fargo-300943927.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Biogen Plans Regulatory Filing for Aducanumab in Alzheimer’s Disease Based on New Analysis of Larger Dataset from Phase 3 Studies",
        "subtitle": "",
        "date": "Oct 22, 2019 6:30AM EDT",
        "content": "New analysis of larger dataset showed that aducanumab reduced clinical decline in patients with early Alzheimer’s disease as measured by the pre-specified primary and secondary endpointsBased on discussions with the FDA, the Company plans to submit a Biologics License Application in early 2020Biogen aims to offer aducanumab to eligible patients previously enrolled in clinical studies The positive results of this new analysis were driven primarily by greater exposure to high dose aducanumab in the larger dataset as compared to data available at the time of the futility analysis CAMBRIDGE, Mass. and TOKYO, Oct.  22, 2019  (GLOBE NEWSWIRE) -- Biogen (Nasdaq: BIIB) and Eisai, Co., Ltd. (Tokyo, Japan) today announced that, after consulting with the U.S. Food and Drug Administration (FDA), Biogen plans to pursue regulatory approval for aducanumab, an investigational treatment for early Alzheimer’s disease (AD). The Phase 3 EMERGE Study met its primary endpoint showing a significant reduction in clinical decline, and Biogen believes that results from a subset of patients in the Phase 3 ENGAGE Study who received sufficient exposure to high dose aducanumab support the findings from EMERGE. Patients who received aducanumab experienced significant benefits on measures of cognition and function such as memory, orientation, and language. Patients also experienced benefits on activities of daily living including conducting personal finances, performing household chores such as cleaning, shopping, and doing laundry, and independently traveling out of the home. If approved, aducanumab would become the first therapy to reduce the clinical decline of Alzheimer’s disease and would also be the first therapy to demonstrate that removing amyloid beta resulted in better clinical outcomes.The decision to file is based on a new analysis, conducted by Biogen in consultation with the FDA, of a larger dataset from the Phase 3 clinical studies that were discontinued in March 2019 following a futility analysis. This new analysis of a larger dataset that includes additional data that became available after the pre-specified futility analysis shows that aducanumab is pharmacologically and clinically active as determined by dose-dependent effects in reducing brain amyloid and in reducing clinical decline as assessed by the pre-specified primary endpoint Clinical Dementia Rating-Sum of Boxes (CDR-SB). In both studies, the safety and tolerability profile of aducanumab was consistent with prior studies of aducanumab.“With such a devastating disease that affects tens of millions worldwide, today’s announcement is truly heartening in the fight against Alzheimer’s. This is the result of groundbreaking research and is a testament to Biogen’s steadfast determination to follow the science and do the right thing for patients,” said Michel Vounatsos, Chief Executive Officer at Biogen. “We are hopeful about the prospect of offering patients the first therapy to reduce the clinical decline of Alzheimer’s disease and the potential implication of these results for similar approaches targeting amyloid beta.”Based on discussions with the FDA, the Company plans to file a Biologics License Application (BLA) in early 2020 and will continue dialogue with regulatory authorities in international markets including Europe and Japan. The BLA submission will include data from the Phase 1/1b studies as well as the complete set of data from the Phase 3 studies.The Company aims to offer access to aducanumab to eligible patients previously enrolled in the Phase 3 studies, the long-term extension study for the Phase 1b PRIME study, and the EVOLVE safety study. Biogen will work towards this goal with regulatory authorities and principal investigators with a sense of urgency.Study ResultsEMERGE (1,638 patients) and ENGAGE (1,647 patients) were Phase 3 multicenter, randomized, double-blind, placebo-controlled, parallel-group studies designed to evaluate the efficacy and safety of two dosing regimens of aducanumab. These studies were discontinued on March 21, 2019, following the results of a pre-specified futility analysis which relied on an earlier and smaller dataset. The futility analysis was based on data available as of December 26, 2018, from 1,748 patients who had the opportunity to complete the 18-month study period and predicted that both studies were unlikely to meet their primary endpoint upon completion. Futility analyses are common in large clinical studies and use statistical modeling to attempt to predict the outcome of the studies based on a number of pre-specified assumptions and criteria.Following the discontinuation of EMERGE and ENGAGE, additional data from these studies became available resulting in a larger dataset, which included a total of 3,285 patients, 2,066 of whom had the opportunity to complete the full 18 months of treatment. A new extensive analysis of this larger dataset showed a different outcome than the outcome predicted by the futility analysis. Specifically, the new analysis of this larger dataset showed EMERGE to be statistically significant on the pre-specified primary endpoint (P=0.01). Biogen believes that data from a subset of ENGAGE support the findings from EMERGE, though ENGAGE did not meet its primary endpoint. Biogen consulted with external advisors and the FDA on these different results and their implications.“This large dataset represents the first time a Phase 3 study has demonstrated that clearance of aggregated amyloid beta can reduce the clinical decline of Alzheimer’s disease, providing new hope for the medical community, the patients, and their families,” said Dr. Anton Porsteinsson, William B. and Sheila Konar Professor of Psychiatry, Neurology and Neuroscience, director of the University of Rochester Alzheimer's Disease Care, Research and Education Program (AD-CARE), and principal investigator. “There is tremendous unmet medical need, and the Alzheimer’s disease community has been waiting for this moment. I commend Biogen, the FDA, the medical community, and the patients and their study partners for their persistence in working to make today’s announcement a reality.”In EMERGE, which met its pre-specified primary endpoint in the new analysis, patients treated with high dose aducanumab showed a significant reduction of clinical decline from baseline in CDR-SB scores at 78 weeks (23% versus placebo, P=0.01). In EMERGE, patients treated with high dose aducanumab also showed a consistent reduction of clinical decline as measured by the pre-specified secondary endpoints: the Mini-Mental State Examination (MMSE; 15% versus placebo, P=0.06), the AD Assessment Scale-Cognitive Subscale 13 Items (ADAS-Cog 13; 27% versus placebo, P=0.01), and the AD Cooperative Study-Activities of Daily Living Inventory Mild Cognitive Impairment Version (ADCS-ADL-MCI; 40% versus placebo, P=0.001). Imaging of amyloid plaque deposition in EMERGE demonstrated that amyloid plaque burden was reduced with low and high dose aducanumab compared to placebo at 26 and 78 weeks (P"
    },
    {
        "title": "Biogen and Samsung Bioepis to Present Data for Infliximab and Adalimumab Biosimilars at United European Gastroenterology Week",
        "subtitle": "",
        "date": "Oct 21, 2019 7:30AM EDT",
        "content": "CAMBRIDGE, Mass. and INCHEON, Korea, Oct.  21, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) and Samsung Bioepis today announced that they will present new real-world data from the companies’ anti-TNF biosimilar portfolio, which includes FLIXABI™ (infliximab) and IMRALDI™ (adalimumab). These data, which provide further insight into the long-term safety and efficacy as well as patient experience with anti-TNF biosimilars, are being presented at United European Gastroenterology (UEG) Week 2019 taking place in Barcelona, Spain (October 19-23).Biosimilars are products that are demonstrated to be highly similar to reference biological product and have the potential to lower drug costs. In Europe, approximately 170,000 patients have been treated with Biogen and Samsung Bioepis’ anti-TNF biosimilars. Biogen expects the uptake of these products to generate 1.8 billion euros in healthcare cost savings in 2019.1“Patients living with severe autoimmune diseases such as IBD are looking for long-term treatments to safely and effectively control symptoms and improve their quality of life. Biosimilars now open the door for more patients to access biologic medicines and effectively manage their GI diseases,” said Alessandro Armuzzi, M.D., Ph.D., Head, Inflammatory Bowel Disease Unit Complesso Integrato Columbus Catholic University of Rome/Italy.Four Biogen and Samsung Bioepis supported abstracts will be presented at UEG Week 2019.2Data to be presented at UEG Week 2019 include a clinical evaluation of the switch from reference adalimumab to IMRALDI in 87 patients with IBD – either Crohn’s disease or ulcerative colitis. The study results showed an overall similar performance for the serum levels of adalimumab between IMRALDI and reference adalimumab. Moreover, symptom activity indexes and inflammatory markers remained consistent after switching to IMRALDI.3 [P1806 – October 23 (Wed), 2019, 09:00-14:00 CET, Poster Exhibition Hall 7]“We plan to continue to conduct research with the goal of generating data that will enable us to deliver value to patients with high unmet needs,” said Ian Henshaw, Vice President and Head of Biogen’s Global Biosimilars Unit.An interim analysis of the non-interventional PERFUSE study will also be presented. This study investigated persistence (the number of patients continuing on treatment) and immunogenicity of FLIXABI in three subsets of IBD patients receiving FLIXABI. These interim results demonstrate high persistence on FLIXABI with no clinical differences observed (disease scores HBA or Simple Clinical Colitis Activity Index (SCCAI)) for the patients who transitioned.4 [P1095 – October 22 (Tue), 2019, 09:00-17:00 CET, Poster Exhibition Hall 7]“We remain committed to advancing our strong pipeline of biosimilar candidates, so that more patients and healthcare systems across the region will be able to benefit from biosimilars,” said Seongwon Han, M.D., Vice President and Lead of Medical Team, Samsung Bioepis.In addition, early results from the IBISS study are reported. In this real-world cohort of IBD patients transitioning from one infliximab biosimilar (CT-P13) to another (FLIXABI), showed similar effectiveness and safety.5 [P0419 - October 21 (Mon), 2019, 10:30-17:00 CET, Poster Exhibition Hall 7]The fourth abstract to be presented focuses on the personalization and optimization of therapeutic options. [P0385 - October 21 (Mon), 2019, 10:30-17:00 CET, Poster Exhibition Hall 7]About FLIXABI™ (infliximab)FLIXABI™ (infliximab), a biosimilar referencing Remicade®6, was approved by the European Commission (EC) in May 2016 for the treatment of adults with rheumatoid arthritis, Crohn’s disease, ulcerative colitis, ankylosing spondylitis, psoriatic arthritis or psoriasis. FLIXABI can also be used in patients 6–17 years old with severe, active Crohn’s disease or severely active ulcerative colitis when they have not responded to or cannot take other medicines or treatments. FLIXABI is currently available in 17 countries in Europe.7About IMRALDI™ (adalimumab)IMRALDI™ (adalimumab), a biosimilar referencing Humira®8, was approved by the European Commission (EC) in August 2017 for the treatment of rheumatoid arthritis, juvenile idiopathic arthritis, axial spondylarthritis, psoriatic arthritis, psoriasis, pediatric plaque psoriasis, adult and adolescent hidradenitis suppurativa, Crohn’s disease, pediatric Crohn’s disease, ulcerative colitis and uveitis, pediatric uveitis. IMRALDI is currently available in 19 countries in Europe and is the leading adalimumab biosimilar in six European countries, such as Germany, Spain, Sweden, Poland, Denmark and Czech Republic.9,10 There are currently over 50,000 patients in Europe receiving treatment with IMRALDI.1About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray, and Nobel Prize winners Walter Gilbert and Phillip Sharp. Today Biogen has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. Follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe HarborThis news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to the results of certain real-world data; the potential benefits, safety and efficacy of FLIXABI and IMRALDI; potential clinical effects of FLIXABI and IMRALDI; risks and uncertainties associated with drug development and commercialization; clinical trial results and plans; the potential of Biogen’s commercial business, including FLIXABI and IMRALDI; Biogen’s strategy and plans; and potential cost healthcare savings related to biosimilars. These statements may be identified by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “goal,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early-stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented. These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation the occurrence of adverse safety events and/or unexpected concerns that may arise from additional information or further studies; risks of unexpected costs or delays; regulatory authorities may require additional data or information or further studies; risks related to Biogen’s dependence on third parties for the development and commercialization of biosimilars; unexpected concerns may arise from additional data, analysis or results obtained during clinical trials; risks of legal actions, regulatory scrutiny or other challenges to biosimilars; the risks of other unexpected hurdles; failure to protect and enforce Biogen’s data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from Biogen’s expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in Biogen’s most recent annual or quarterly report and in other reports Biogen has filed with the U.S. Securities and Exchange Commission. These statements are based on Biogen’s current beliefs and expectations and speak only as of the date of this news release. Biogen does not undertake any obligation to publicly update any forward-looking statements, whether as result of new information, future developments or otherwise.About Samsung Bioepis Co., Ltd.Established in 2012, Samsung Bioepis is a biopharmaceutical company committed to realizing healthcare that is accessible to everyone. Through innovations in product development and a firm commitment to quality, Samsung Bioepis aims to become the world's leading biopharmaceutical company. Samsung Bioepis continues to advance a broad pipeline of biosimilar candidates that cover a spectrum of therapeutic areas, including immunology, oncology, hematology and ophthalmology. Samsung Bioepis is a joint venture between Samsung BioLogics and Biogen.For more information, please visit: www.samsungbioepis.com and follow us on social media – Twitter, LinkedIn.References:1. Biogen data on file.2. Data from Biogen- and Samsung Bioepis- supported studies.3. Lukas et al. Impact of the Switch from Original Adalimumab to Biosimilar Adalimumab SB5 on Serum Drug Trough Levels and Clinical and Biological Disease Activity in Patients with IBD. UEG Week 2019.4. Bouhnik et al. PERFUSE: a French Prospective/Retrospective Non-Interventional Cohort Study of Infliximab Naïve and Transitioned Patients Receiving Infliximab Biosimilar SB2; 1st Interim Analysis. UEG Week 2019. 5. Harris et al. IBD Biosimilar to Biosimilar Infliximab Switching Study: Preliminary Results. UEG Week 2019. 6. Remicade® is a registered trademark of Janssen Biotech, Inc.7. Data on File: IQVIA, GERS, Insight Health ODV8. Humira® is a registered trademark of AbbVie Biotechnology Ltd.9. Data on File: IQVIA, (Aug 2019) GERS, Insight Health ODV"
    },
    {
        "title": "Landmark NURTURE Study of Infants with Spinal Muscular Atrophy (SMA) Treated Pre-Symptomatically with SPINRAZA® (nusinersen) Published in Neuromuscular Disorders",
        "subtitle": "",
        "date": "Oct 2, 2019 7:30AM EDT",
        "content": "CAMBRIDGE, Mass., Oct.  02, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced that the journal Neuromuscular Disorders has published data from NURTURE, the first study investigating a treatment targeting the underlying cause of spinal muscular atrophy (SMA) in infants treated pre-symptomatically. Data from the NURTURE study demonstrated that infants who initiated treatment with SPINRAZA prior to the onset of clinical symptoms attained unparalleled results compared to the natural history of the disease. As of March 2019 all participants were alive, without the need for permanent ventilation and experienced continuous improvements with the majority achieving motor milestones in timelines consistent with normal development. The results also demonstrated durability of effect with children making progress throughout the study. “This pioneering study has far surpassed what we thought was possible and redefined our expectations of how early treatment helps individuals with SMA achieve optimal outcomes,” said Darryl De Vivo, M.D., Sidney Carter Professor of Neurology and Pediatrics, Columbia University Irving Medical Center in New York. “The extraordinary results achieved in this study underline the critical importance of newborn screening and early treatment of the clinically normal infants with SMA before the onset of any clinical symptoms.”NURTURE is an ongoing, Phase 2, open-label study of 25 infants with the genetic diagnosis of SMA (most likely to develop SMA Type 1 or 2) who received their first dose of SPINRAZA in the pre-symptomatic stage and before six weeks old. The study, conducted at 15 sites in seven countries, has results up to 45.4 months. When compared with the natural history of the disease, the results are dramatic in their impact on changing the course of SMA.As of March 2019 all infants in the study were 25 months or older, past the typical age of symptom onset for SMA Type 1 and Type 2, and were alive without the need for permanent ventilation. In comparison to the natural history of SMA, many of these infants would likely have passed away or require permanent ventilation on average by 13.5 months. In both the children with two and three copies of SMN2, treatment with SPINRAZA demonstrated rapid onset of improvement and durability of effect with their mean Children’s Hospital of Pennsylvania Infant Test of Neuromuscular Disorders (CHOP-INTEND) score of motor function reaching the maximum mean score of 64 for all participants with three copies of SMN2 (n=10) and a mean of 62.1 for those with two copies of SMN2 (N=15).  Additional highlights include:These published results from the NURTURE study were previously presented at the 2019 Cure SMA Annual SMA Conference and the 5th Congress of the European Academy of Neurology.About SPINRAZA® (nusinersen)1-3  SPINRAZA is the first therapy approved to treat infants, children and adults with spinal muscular atrophy (SMA) and is available in more than 40 countries. As of June 30, 2019, more than 8,400 individuals have been treated with SPINRAZA for up to nearly six years, based on patients across the post-marketing setting, Expanded Access Program (EAP) and clinical trial participants. SPINRAZA is the only SMA treatment to combine unsurpassed real-world experience and the highest level of clinical evidence across a broad spectrum of patient populations.SMA is a rare, genetic, neuromuscular disease that is characterized by a loss of motor neurons in the spinal cord and lower brain stem, resulting in severe, progressive muscle atrophy and weakness. Approximately one in 10,000 live births have a diagnosis of SMA, and people of all ages are impacted by the disease. It is a leading genetic cause of infant mortality.SPINRAZA, a foundation of care in SMA, is an antisense oligonucleotide (ASO), developed using Ionis’ proprietary technology that is designed to target a root cause of SMA by increasing the amount of full-length survival motor neuron (SMN) protein, which is critical to maintaining motor neurons. It is administered by intrathecal injection into the fluid surrounding the spinal cord where motor neurons reside to deliver the treatment where the disease starts.SPINRAZA currently maintains the largest clinical data set in SMA based on data from over 300 patients across a broad range of SMA populations demonstrating a favorable benefit:risk profile. SPINRAZA was evaluated in two randomized, double-blind, sham-controlled studies (ENDEAR and CHERISH) in infantile and later-onset SMA patients and supported by open-label studies in pre-symptomatic infants (NURTURE) and individuals who were treated into adulthood with later-onset SMA (CS2/CS12). The most common adverse events observed were respiratory infection, fever, constipation, headache, vomiting and back pain. Meningitis and hydrocephalus have been observed in the post-marketing setting. Renal toxicity and coagulation abnormalities, including acute severe low platelet counts, have been observed after administration of some ASOs. Laboratory tests can monitor for these signs.Biogen licensed the global rights to develop, manufacture and commercialize SPINRAZA from Ionis Pharmaceuticals, Inc. (Nasdaq: IONS), a leader in antisense therapeutics. Biogen and Ionis conducted an innovative clinical development program that moved SPINRAZA from its first dose in humans in 2011 to its first regulatory approval in five years.About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp, and today has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe Harbor  This news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, about the potential benefits, safety and efficacy of SPINRAZA; the results of certain real-world data; the identification and treatment of SMA; our research and development program for the treatment of SMA; and the potential benefits and results from early treatment of SMA. These statements may be identified by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “goal,” “intend,” “may,” “plan,” “possible,” “potential,” “will,” “would” and other words and terms of similar meaning. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation risks relating to the occurrence of adverse safety events and/or unexpected concerns that may arise from additional data or analysis; failure to obtain regulatory approvals in other jurisdictions; risks of unexpected costs or delays; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; regulatory authorities may require additional information or further studies; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.References1Darras BT, Chiriboga CA, Iannaccone ST, et al. Nusinersen in later-onset spinal muscular atrophy: Long-term results from the phase 1/2 studies. Neurology. 2019 May 21;92(21):e2492-e2506. 2Finkel R, Chiriboga C, Vajsar J, et al. Treatment of infantile-onset spinal muscular atrophy with nusinersen: a phase 2, open-label, dose-escalation study. Lancet. 2016;388(10063):3017-3026.3Darras BT, Markowitz JA, Monani UR, De Vivo DC. Chapter 8 - Spinal Muscular Atrophies. In: Darras BT, Jones Jr. HR, Ryan MM, De Vivo DC, ed. Neuromuscular Disorders of Infancy, Childhood, and Adolescence (Second Edition). San Diego: Academic Press; 2015:117-145. "
    },
    {
        "title": "Biogen Announces Leadership Update",
        "subtitle": "",
        "date": "Oct 1, 2019 8:00AM EDT",
        "content": "Dr. Alfred Sandrock is named Executive Vice President, Research and Development and continues as Chief Medical OfficerDr. Alphonse Galdes appointed Executive Vice President, Pharmaceutical Operations and TechnologyDr. Michael Ehlers, Executive Vice President, Research and Development has decided to leave BiogenCAMBRIDGE, Mass., Oct.  01, 2019  (GLOBE NEWSWIRE) -- Biogen (Nasdaq: BIIB) today announced an update to its senior leadership team. Effective immediately, Alfred Sandrock, Jr., M.D., Ph.D., has been named Executive Vice President, Research and Development, in addition to his responsibilities as Chief Medical Officer, and Alphonse Galdes, Ph.D., has been appointed Executive Vice President, Pharmaceutical Operations and Technology. Michael D. Ehlers, M.D., Ph.D., has decided to step down as Executive Vice President, Research and Development, and will leave Biogen effective October 11, 2019, to pursue a new career opportunity. “Both Al and Alphonse are seasoned and respected leaders at Biogen. Their accomplishments in the scientific community are well-recognized,” said Michel Vounatsos, Chief Executive Officer at Biogen. “I’m pleased we have the benefit of their long-standing experience and proven track-record, which will be instrumental as we aim to sustain leadership in our core MS business and expand our neuroscience portfolio.\"I also want to thank Mike for his significant contributions and for the substantial progress made in our pipeline during his three years at Biogen.  He has transformed the R&D organization and I believe he has built the best neuroscience team in the industry.”“For more than two decades at Biogen I’ve been fortunate to work with incredibly talented colleagues committed to patients, following the science and making a difference in this world,” said Sandrock. “The societal burden of neurological diseases is massive, and I am proud of the research and development programs under way at Biogen. As a physician and scientist, I will continue to be focused on advancing our pipeline with the goal of pioneering new scientific breakthroughs and bringing new treatment options to patients.”Ehlers said, \"I am very proud of the accomplishments we have achieved in the past three years.  With nine read-outs expected by the end of 2020, I believe Biogen is in a unique position to bring breakthroughs in neuroscience and I am confident in the team in place to realize the full potential of a significantly expanded pipeline.  I believe it is the right time to pass the baton, and I am excited about taking on a new challenge in venture capital and biotech with the same broad goal of converting differentiated science into meaningful medicines for patients.”Sandrock has served on Biogen’s Executive Committee since 2015. He was named Chief Medical Officer in 2012 and since joining the company in 1998, has held several senior executive positions, including Senior Vice President of Development Sciences, Senior Vice President of Neurology Research and Development and Vice President of Clinical Development, Neurology. Sandrock received his B.A. in human biology from Stanford University, an M.D. from Harvard Medical School and a Ph.D. in neurobiology from Harvard University. He completed an internship in medicine, a residency and chief residency in neurology and a clinical fellowship in Neuromuscular Disease and Clinical Neurophysiology (electromyography) at Massachusetts General Hospital.Galdes is Executive Vice President, Pharmaceutical Operations and Technology of Biogen and has served on the Executive Committee since September 2019. Since joining Biogen in 1995, Galdes has held several senior executive positions, including most recently as Senior Vice President, Asset Development and Portfolio Management from November 2015 to September 2019 and Senior Vice President, Technical Development from October 2010 to November 2015. Galdes received his B.S. in Chemistry and Biology and his M.S. in Biochemistry from the University of Malta and received his Ph.D. in Biochemistry from Oxford University, where he was a Rhodes Scholar. Galdes served as a Research Associate at the Department of Biological Chemistry at Harvard Medical School.About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp, and today has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe HarborThis news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, relating to our business activities; our strategy and plans; the potential of our commercial business and pipeline programs; clinical development programs and data readouts; the expected benefits from the appointment of Sandrock as Executive Vice President, Research and Development; and the expected benefits from the appointment of Galdes as Executive Vice President, Pharmaceuticals Operations and Technology. These forward-looking statements may be accompanied by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “except,” “forecast,” “intend,” “may,” “plan,” “potential,” “possible,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. You should not place undue reliance on these statements.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including, without limitation: risks relating to management and key personnel changes; difficulties in obtaining and maintaining adequate coverage, pricing and reimbursement for our products; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; uncertainty of success in developing, licensing or acquiring other product candidates or additional indications for existing products; failure to compete effectively due to significant product competition in the markets for our products; the occurrence of adverse safety events; delay in approval of our drug candidates; potential future healthcare reforms; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise. "
    },
    {
        "title": "Interferon Beta Treatments, Including PLEGRIDY® (peginterferon beta-1a) and AVONEX® (interferon beta-1a), Receive Positive CHMP Opinion for Use During Pregnancy and Breastfeeding",
        "subtitle": "",
        "date": "Sep 23, 2019 3:00AM EDT",
        "content": "CAMBRIDGE, Mass., Sept.  23, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced that the Committee for Medicinal Products for Human Use (CHMP), part of the of the European Medicines Agency (EMA), recommended an update to marketing authorizations of approved interferon beta treatments, including PLEGRIDY® (peginterferon beta-1a) and AVONEX® (interferon beta-1a), to remove pregnancy contraindications and, where clinically needed, to allow use during pregnancy and breastfeeding in women with relapsing multiple sclerosis (MS).“Women are diagnosed with MS at least two to three times more frequently than men,1 and the disease may strike during their child-bearing years.2 Choosing a treatment plan that allows women to continue or start their MS therapy while pregnant or breastfeeding is a step forward for those living with this chronic, debilitating disease and their partners,” said Alfred Sandrock, Jr., M.D., Ph.D., executive vice president and chief medical officer at Biogen. “This CHMP opinion gives physicians and their patients added confidence when considering treatment with PLEGRIDY or AVONEX, two important therapies for relapsing MS that have been prescribed to more than half a million people living with the disease.”The CHMP opinion is based on data from the European Interferon Beta Pregnancy Registry, as well as the national health registers in Finland and Sweden, which together created the largest cohort studies providing safety data related to interferon beta exposure in women of child-bearing age with MS.Data collected from more than 1,000 pregnancy outcomes from registries and post-marketing experience indicate no increased risk of major congenital anomalies following exposure to interferon beta before conception or during the first trimester of pregnancy. However, the duration of exposure during the first trimester is uncertain, because data were collected when interferon beta use was contraindicated during pregnancy, and treatment was likely interrupted when the pregnancy was detected and/or confirmed. Additionally, experience with exposure in the second and third trimesters is very limited. The risk of spontaneous abortions in pregnant women exposed to interferon beta cannot adequately be evaluated based on the currently available data, but the data do not suggest an increased risk so far. Limited data suggest the levels of interferon beta-1a excreted in human milk are negligible, and no harmful effects on the breastfed newborn/infant are anticipated.About PLEGRIDY®  PLEGRIDY is a subcutaneous pegylated interferon dosed once every two weeks for relapsing forms of MS, including relapsing-remitting MS (RRMS), the most common form of MS. PLEGRIDY is currently approved in over 60 countries, including the U.S., Canada, Australia and Switzerland, and across the European Union. Nearly 50,000 people worldwide have been treated with PLEGRIDY, with over 88,000 patient-years of experience, based on prescription data.3 Biogen continues to work toward making PLEGRIDY available in additional countries across the globe.The efficacy and safety of PLEGRIDY is supported by one of the largest pivotal studies with interferons conducted in people living with RRMS. In clinical studies, PLEGRIDY has been proven to significantly reduce the rate of MS relapses, slow the progression of disability and reduce the number of MS brain lesions while demonstrating a favorable safety profile for patients with relapsing forms of MS. Side effects reported include liver problems, including liver failure and increases in liver enzymes; depression or suicidal thoughts; serious allergic reactions; cardiac problems, including congestive heart failure; autoimmune disorders; decreases in white blood cell or platelet counts; and seizures. In clinical trials, the most common adverse events associated with PLEGRIDY were injection site reactions and flu-like symptoms. A list of adverse events can be found in the full PLEGRIDY product labeling for each country where it is approved.Please click here for Important Safety Information and full Prescribing Information, including Medication Guide for PLEGRIDY in the U.S., or visit your respective country’s product website.About AVONEX®  AVONEX is one of the most prescribed treatments for relapsing forms of MS worldwide and is currently approved in over 90 countries. Over 550,000 people worldwide have been treated with AVONEX, with over 2.6 million patient-years of experience, based on prescription data.4  AVONEX is indicated for the treatment of patients with relapsing forms of MS to slow the accumulation of physical disability and decrease the frequency of clinical exacerbations. Patients with MS in whom efficacy has been demonstrated include patients who have experienced a first clinical episode and have MRI features consistent with MS.Symptoms of depression, suicidal ideation or psychosis, and cases of suicide, have been reported with increased frequency with patients receiving AVONEX. Severe hepatic injury, including cases of hepatic failure has been reported rarely in patients. Rare cases of anaphylaxis have been reported. While beta interferons do not have any known direct cardiac toxicity, cases of congestive heart failure, cardiomyopathy and cardiomyopathy with congestive heart failure have been reported in patients without known predisposition. Decreased peripheral blood counts have been reported from postmarketing experience. Seizures have been reported in patients using AVONEX, including patients with no prior history of seizure. Autoimmune disorders of multiple target organs have been reported. Routine periodic blood chemistry, hematology, liver function and thyroid function tests are recommended.Please click here for Important Safety Information and full Prescribing Information, including Medication Guide for AVONEX in the U.S., or visit your respective country’s product website.About Biogen At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp, and today has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe HarborThis news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, about the potential benefits, safety and efficacy of PLEGRIDY and AVONEX; the results of certain real-world data; our research and development program for the treatment of MS; plans for additional regulatory filings in other jurisdictions; and risks and uncertainties associated with drug development and commercialization. These statements may be identified by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “except,” “forecast,” “goal,” “intend,” “may,” “plan,” “possible,” “potential,” “will,” “would” and other words and terms of similar meaning. Drug development and commercialization involve a high degree of risk, and only a small number of research and development programs result in commercialization of a product. Results in early stage clinical trials may not be indicative of full results or results from later stage or larger scale clinical trials and do not ensure regulatory approval. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation the occurrence of adverse safety events and/or unexpected concerns that may arise from additional data or analysis; failure to obtain regulatory approvals in other jurisdictions; regulatory authorities may require additional information or further studies, or may fail to approve or may delay approval of expansion of product labeling; risks of unexpected costs or delays; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges; and product liability claims. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise._______________1 Multiple Sclerosis Coalition. The Use of Disease-modifying Therapies in Multiple Sclerosis Principles and Current Evidence. Updated March 2017. http://www.nationalmssociety.org/getmedia/1e64b96c-9e55-400e-9a64-0cdf5e2d60fe/summaryDMTpaper_-final2 Coyle PK. Pregnancy and multiple sclerosis. Neurol Clin. 2012 Aug;30(3):877-88. doi: 10.1016/j.ncl.2012.05.002. Epub 2012 Jun 22.3 Salvetti M et al. Safety, Pregnancy Outcomes, and Clinical Effectiveness of Peginterferon Beta-1a for Patients with Newly Diagnosed and Non-Newly Diagnosed Relapsing Multiple Sclerosis: Third Interim Analysis of the Plegridy Observational Program. Poster presented at: 35th Annual ECTRIMS Congress; 2019 Sept 11-13; Stockholm, Sweden.4 Benedict R et al. Change in Cognitive Processing Speed is Associated with Cortical Grey Matter and Thalamic Volume Loss in Patients with Relapsing-remitting Multiple Sclerosis. Poster presented at: 35th Annual ECTRIMS Congress; 2019 Sept 11-13; Stockholm, Sweden."
    },
    {
        "title": "Biogen Advances Spinal Muscular Atrophy (SMA) Clinical Research with New Study Evaluating a Higher Dose of SPINRAZA® (nusinersen) and Additional Data in a Broad Range of Patients",
        "subtitle": "",
        "date": "Sep 18, 2019 7:30AM EDT",
        "content": "CAMBRIDGE, Mass., Sept.  18, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced updates to the SPINRAZA (nusinersen) clinical development program including the initiation of a new global clinical trial, DEVOTE. The DEVOTE study will evaluate if a higher dose of SPINRAZA can provide even greater efficacy in the treatment of spinal muscular atrophy (SMA) across a broad patient population. In addition, new data further demonstrating the safety and efficacy of treatment with SPINRAZA in individuals with later-onset SMA will be featured in a podium presentation at the 13th Congress of the European Paediatric Neurology Society (EPNS) in Athens (September 17-21).A foundation of care in SMA, SPINRAZA is the only treatment approved for infants, children and adults with evidence across a broad range of patients and real-world experience treating more than 8,400 patients of all ages in over 40 countries.1 These clinical program updates will add to the largest and longest clinical data set available to date in SMA.New study, DEVOTE, to evaluate if SPINRAZA can offer even greater efficacy in treating SMA  Building on the demonstrated long-term safety profile and proven efficacy of SPINRAZA in a broad range of patients, the DEVOTE trial will examine the potential for even greater efficacy, as well as the safety and tolerability of SPINRAZA, when administered at a higher dose. The trial is a Phase 2/3 randomized, controlled dose-escalating study that will be conducted at 50 sites around the world with a projected enrollment of 126 individuals with SMA of all ages, including adults.“SPINRAZA has fundamentally changed the natural history of SMA,” said Alfred Sandrock, Jr., M.D., Ph.D., executive vice president and chief medical officer at Biogen. “Antisense oligonucleotides directly intervene at the origin of disease providing a transformative therapeutic option. SPINRAZA’s highly targeted approach and well-characterized safety profile allows us to continue exploring ways to potentially address the remaining medical needs in the SMA community.”The three-part trial will include an open-label safety evaluation and a pivotal, double-blind, active control randomized treatment period followed by an open-label treatment period. After the safety evaluation, the trial will compare two loading doses of 50 milligrams (mg) 15 days apart followed by a maintenance dose of 28 mg every four months with the current U.S. Food and Drug Administration-approved administration of SPINRAZA, which is four loading doses with 12 mg maintenance doses every four months. The third part of the trial will be an open-label evaluation to determine how to safely and efficiently transition patients from the currently approved dose of SPINRAZA to the higher dose being tested in the study.More information on the trial (NCT04089566) is available at clinicaltrials.gov.Data to be presented at EPNS demonstrate improvements or stabilization in motor function following longer-term treatmentAn integrated analysis from SHINE (NCT02594124), an open-label extension study for patients with SMA who participated in prior SPINRAZA studies, found that children with later-onset SMA (Type 2 or Type 3) experienced improvements or stabilization in one or more measures of motor function for up to nearly six years, in contrast to the expected decline observed in natural history cohorts. SHINE is following 24 patients aged 2-15 at treatment initiation (SMA Type 2; n=10 and Type 3; n=14) who transitioned from the CS2/CS12 studies, which previously showed that individuals with later-onset SMA who were treated with SPINRAZA demonstrated improvements in motor function and disease stabilization over approximately three years, that were not observed in natural history cohorts.2  Patients in the study were between 7 and 21 years old at the last study visit.Motor function measures in this analysis of the SHINE study included the Hammersmith Functional Motor Scale–Expanded (HFMSE), Upper Limb Module (ULM), and Six-Minute Walk Test (6MWT). No participants discontinued treatment due to adverse events, and no new safety concerns were identified during the nearly six-year follow-up period.“These findings are important in understanding the need for long-term treatment in individuals with SMA,” said Basil Darras, M.D., lead study author, director of the Neuromuscular Center and Spinal Muscular Atrophy Program at Boston Children’s Hospital, and professor of neurology at Harvard Medical School. “These data reinforce the long-term safety and durability of SPINRAZA to improve or stabilize motor function in individuals with later-onset SMA.”About SPINRAZA® (nusinersen)3-4  SPINRAZA is the first therapy approved to treat infants, children and adults with spinal muscular atrophy (SMA) and is available in more than 40 countries. As of June 30, 2019, more than 8,400 individuals have been treated with SPINRAZA for up to nearly six years, based on patients across the post-marketing setting, Expanded Access Program (EAP) and clinical trial participants. SPINRAZA is the only SMA treatment to combine unsurpassed real-world experience and the highest level of clinical evidence across a broad spectrum of patient populations.SMA is a rare, genetic, neuromuscular disease that is characterized by a loss of motor neurons in the spinal cord and lower brain stem, resulting in severe, progressive muscle atrophy and weakness. Approximately one in 10,000 live births have a diagnosis of SMA, and people of all ages are impacted by the disease. It is a leading genetic cause of infant mortality.SPINRAZA, a foundation of care in SMA, is an antisense oligonucleotide (ASO) designed to target a root cause of SMA by increasing the amount of full-length survival motor neuron (SMN) protein, which is critical to maintaining motor neurons. It is administered by intrathecal injection into the fluid surrounding the spinal cord where motor neurons reside to deliver the treatment where the disease starts.SPINRAZA currently maintains the largest clinical data set in SMA based on data from over 300 patients across a broad range of SMA populations demonstrating a favorable benefit:risk profile. SPINRAZA was evaluated in two randomized, double-blind, sham-controlled studies (ENDEAR and CHERISH) in infantile and later-onset SMA patients and supported by open-label studies in pre-symptomatic infants (NURTURE) and individuals who were treated into adulthood with later-onset SMA (CS2/CS12). The most common adverse events observed were respiratory infection, fever, constipation, headache, vomiting and back pain. Meningitis and hydrocephalus have been observed in the post-marketing setting. Renal toxicity and coagulation abnormalities, including acute severe low platelet counts, have been observed after administration of some ASOs. Laboratory tests can monitor for these signs.Biogen licensed the global rights to develop, manufacture and commercialize SPINRAZA from Ionis Pharmaceuticals, Inc. (Nasdaq: IONS), a leader in antisense therapeutics. Biogen and Ionis conducted an innovative clinical development program that moved SPINRAZA from its first dose in humans in 2011 to its first regulatory approval in five years.About BiogenAt Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp, and today has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer’s disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube.Biogen Safe Harbor  This news release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, about the potential benefits, safety and efficacy of SPINRAZA; the results of certain real-world data; the identification and treatment of SMA; our research and development program for the treatment of SMA; the clinical development program for SPINRAZA, including the enrollment of the DEVOTE study; the potential benefits and results from early treatment of SMA; and risks and uncertainties associated with drug development and commercialization. These statements may be identified by words such as “aim,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “goal,” “intend,” “may,” “plan,” “possible,” “potential,” “will,” “would” and other words and terms of similar meaning. You should not place undue reliance on these statements or the scientific data presented.These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements, including without limitation risks relating to the occurrence of adverse safety events and/or unexpected concerns that may arise from additional data or analysis; the risk that we may not fully enroll our clinical trials or enrollment will take longer than expected; failure to obtain regulatory approvals in other jurisdictions; risks of unexpected costs or delays; failure to protect and enforce our data, intellectual property and other proprietary rights and uncertainties relating to intellectual property claims and challenges;; regulatory authorities may require additional information or further studies; product liability claims; and third party collaboration risks. The foregoing sets forth many, but not all, of the factors that could cause actual results to differ from our expectations in any forward-looking statement. Investors should consider this cautionary statement, as well as the risk factors identified in our most recent annual or quarterly report and in other reports we have filed with the U.S. Securities and Exchange Commission. These statements are based on our current beliefs and expectations and speak only as of the date of this news release. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise.References1As of June 30, 2019, more than 8,400 patients on therapy across the post-marketing setting, the expanded access program and clinical trials.2Darras BT, Chiriboga CA, Iannaccone ST, et al. Nusinersen in later-onset spinal muscular atrophy: Long-term results from the phase 1/2 studies. Neurology. 2019 May 21;92(21):e2492-e2506. 3Finkel R, Chiriboga C, Vajsar J, et al. Treatment of infantile-onset spinal muscular atrophy with nusinersen: a phase 2, open-label, dose-escalation study. Lancet. 2016;388(10063):3017-3026.4Darras B, Markowitz J, Monani U, De Vivo D. Chapter 8 - Spinal Muscular Atrophies. In: Vivo BTD, ed. Neuromuscular Disorders of Infancy, Childhood, and Adolescence (Second Edition). San Diego: Academic Press; 2015:117-145."
    },
    {
        "title": "Biogen Ranked #1 Biotechnology Company on Dow Jones Sustainability World Index",
        "subtitle": "",
        "date": "Sep 17, 2019 7:30AM EDT",
        "content": "CAMBRIDGE, Mass., Sept.  17, 2019  (GLOBE NEWSWIRE) -- Biogen Inc. (Nasdaq: BIIB) today announced that it has been ranked the #1 biotechnology company on the Dow Jones Sustainability World Index (DJSI World) for the fourth time, after being the first U.S.-based biotech company to ever make the list in 2013.DJSI World recognizes the top 10 percent of companies in the S&P Global Broad Market Index for their long-term commitment to environmental, social and governance performance. Of the 318 companies named to DJSI World, Biogen led the biotechnology industry, with top scoring in multiple areas, including addressing cost burden, marketing practices, environmental reporting, policies and management systems, human rights, climate strategy and human capital development.“As pioneers in neuroscience, we care deeply about making a difference – whether that means our commitment to patients, our employees, the environment or the communities where we live and work,” said Michel Vounatsos, Chief Executive Officer of Biogen. “This recognition is a testament to our talented employees around the globe, who live our values in everything they do with a patient-first approach. By making sustainability core to our own DNA, we are building a stronger Biogen to inspire the scientists of the future.”Additional information regarding Biogen’s commitment to sustainability can be found in its Corporate Social Responsibility Report, which is based on internationally recognized Global Reporting Initiative (GRI) G4 Guidelines www.biogen.com/csrreport.About Biogen Inc.At Biogen, our mission is clear: we are pioneers in neuroscience. Biogen discovers, develops and delivers worldwide innovative therapies for people living with serious neurological and neurodegenerative diseases as well as related therapeutic adjacencies. One of the world’s first global biotechnology companies, Biogen was founded in 1978 by Charles Weissmann, Heinz Schaller, Kenneth Murray and Nobel Prize winners Walter Gilbert and Phillip Sharp, and today has the leading portfolio of medicines to treat multiple sclerosis, has introduced the first approved treatment for spinal muscular atrophy, commercializes biosimilars of advanced biologics and is focused on advancing research programs in multiple sclerosis and neuroimmunology, neuromuscular disorders, movement disorders, Alzheimer's disease and dementia, ophthalmology, immunology, neurocognitive disorders, acute neurology and pain.We routinely post information that may be important to investors on our website at www.biogen.com. To learn more, please visit www.biogen.com and follow us on social media – Twitter, LinkedIn, Facebook, YouTube."
    }
]