[
    {
        "title": "Booking Holdings to Attend the Bank of America Merrill Lynch 2020 Consumer & Retail Technology Conference",
        "subtitle": "",
        "date": "Feb 27, 2020 12:00PM EST",
        "content": "NORWALK, Conn., Feb. 27, 2020 /PRNewswire/ -- Booking Holdings (NASDAQ: BKNG), the world leader in online travel and related services, today announced that Chief Executive Officer Glenn Fogel, Chief Financial Officer David Goulden and SVP of Finance Michael Noonan will be attending the Bank of America Merrill Lynch 2020 Consumer & Retail Technology Conference in New York City on March 10, 2020. They will be available for onsite meetings scheduled in advance.About Booking Holdings Booking Holdings (NASDAQ: BKNG) is the world leader in online travel and related services, provided to customers and partners in over 230 countries through six primary brands - Booking.com, KAYAK, priceline.com, agoda.com, Rentalcars.com and OpenTable. The mission of Booking Holdings is to make it easier for everyone to experience the world. For more information, visit Bookingholdings.com. View original content:http://www.prnewswire.com/news-releases/booking-holdings-to-attend-the-bank-of-america-merrill-lynch-2020-consumer--retail-technology-conference-301012814.htmlSOURCE  Booking Holdings"
    },
    {
        "title": "Booking Holdings to Make Fourth Quarter 2019 Earnings Press Release Available on Company's Investor Relations Website on Wednesday, February 26",
        "subtitle": "",
        "date": "Feb 25, 2020 2:00PM EST",
        "content": "NORWALK, Conn., Feb. 25, 2020 /PRNewswire/ -- Fourth quarter 2019 financial results for Booking Holdings (NASDAQ: BKNG) will be made available at approximately 4:00 p.m. ET on Wednesday, February 26, through a press release posted to the company's Investor Relations website: http://ir.bookingholdings.com.Booking Holdings intends to hold a conference call on Wednesday, February 26 at 4:30 p.m. ET to discuss its fourth quarter financial results. The event will be webcasted at http://ir.bookingholdings.com. Audio replays will be available on the website for seven days thereafter.About Booking HoldingsBooking Holdings (NASDAQ: BKNG) is the world leader in online travel and related services, provided to customers and partners in over 220 countries and territories through six primary brands - Booking.com, KAYAK, priceline.com, agoda.com, Rentalcars.com and OpenTable. The mission of Booking Holdings is to make it easier for everyone to experience the world. For more information, visit Bookingholdings.com. View original content:http://www.prnewswire.com/news-releases/booking-holdings-to-make-fourth-quarter-2019-earnings-press-release-available-on-companys-investor-relations-website-on-wednesday-february-26-301011049.htmlSOURCE  Booking Holdings"
    },
    {
        "title": "Booking Holdings to Webcast Fourth Quarter 2019 Financial Results on February 26",
        "subtitle": "",
        "date": "Feb 17, 2020 9:30AM EST",
        "content": "NORWALK, Conn., Feb. 17, 2020 /PRNewswire/ -- Booking Holdings (NASDAQ: BKNG) announced today that it intends to hold a conference call to discuss its fourth quarter 2019 financial results on Wednesday, February 26 at 4:30 p.m. ET. The event will be webcasted at ir.bookingholdings.com and the audio will be available for replay on the website for seven days thereafter.Booking Holdings will post a release containing its fourth quarter 2019 financial results on the company's Investor Relations website, ir.bookingholdings.com, at approximately 4:00 p.m. ET on Wednesday, February 26.About Booking HoldingsBooking Holdings Inc. (NASDAQ: BKNG) is the world leader in online travel and related services, provided to customers and partners in over 230 countries and territories through six primary brands- Booking.com, KAYAK, priceline, agoda.com, Rentalcars.com and OpenTable. The mission of Booking Holdings is to make it easier for everyone to experience the world. For more information, visit Bookingholdings.com. View original content:http://www.prnewswire.com/news-releases/booking-holdings-to-webcast-fourth-quarter-2019-financial-results-on-february-26-301005752.htmlSOURCE  Booking Holdings"
    },
    {
        "title": "OpenTable Gives Frequent Diners Access to Hard-to-Book Restaurants",
        "subtitle": "",
        "date": "Feb 11, 2020 7:00AM EST",
        "content": "SAN FRANCISCO, Feb. 11, 2020 /PRNewswire/ -- OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc. (NASDAQ: BKNG), is giving U.S. diners exclusive access to hot tables with the launch of Premium Access - a new loyalty perk available for frequent OpenTable diners. Starting today, OpenTable Dining Points can be used to unlock hard-to-get reservations at popular restaurants during prime dining times - a feature that nearly three quarters (68%) of diners expressed interest in, according to an internal survey. Beginning November 2019, Premium Access reservations were exclusively rolled out for Capital One cardholders and continues to be available to them.\"As we look for ways to enhance our OpenTable Rewards program, we want to ensure we're giving diners what they want, and getting into the best restaurants at prime dining times topped the list,\" said Joseph Essas, Chief Technology Officer, OpenTable \"We're excited to reward frequent diners with the ability to book highly sought after reservations with less lead time.\"Diners can take the following steps to book a Premium Access reservation:Premium Access is available across the US in 20 cities with more than 200+ participating restaurants. Examples of participating restaurants include: Amen Street Fish + Raw Bar (Charleston), Vivere and Jeong (Chicago), State Bird Provisions (San Francisco) Crown Shy (New York) and Rioja (Denver).The rollout of Premium Access comes just in time for those looking to book a great last-minute table, ensuring both planners and procrastinators alike can grab reservations at the hottest spots this Valentine's Day.\"Being a part of OpenTable Premium Access program gives the opportunity for the valued patrons of Capital One and OpenTable to experience award-winning Blue Duck Tavern,\" said Joseph Cerione, General Manager of Blue Duck Tavern.For more information on how to redeem your points or use your Capital One credit card, head to www.opentable.com/premiumaccess.  For restaurants interested in joining the program, please contact your account manager.About OpenTableOpenTable, part of Booking Holdings Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.About Capital OneAt Capital One we're on a mission for our customers – bringing them great products, rewards, service, and access to unique and unforgettable experiences they are passionate about. Capital One is a diversified bank that offers products and services to individuals, small businesses and commercial clients. We use technology, innovation and interaction to provide consumers with products and services to meet their needs. Learn more at capitalone.com/access View original content to download multimedia:http://www.prnewswire.com/news-releases/opentable-gives-frequent-diners-access-to-hard-to-book-restaurants-301002394.htmlSOURCE  OpenTable, Inc."
    },
    {
        "title": "Booking.com Spotlights the Best in Travel With Its Traveller Review Awards 2020",
        "subtitle": "",
        "date": "Jan 14, 2020 11:57AM EST",
        "content": "AMSTERDAM, Jan. 14, 2020 /PRNewswire/ -- Today, Booking.com, the platform making it easier for everyone to experience the world, announced the winners of the Traveller Review Awards 2020, with nearly one million (986,449) awards given across 220 countries and territories. Alongside a wide range of accommodation partners, in the eighth edition of its annual partner recognition awards, Booking.com awarded transport partners for the first time ever. The awards recognize these partners for their incredible hospitality, giving travelers an exceptional experience when booking an accommodation, rental car or airport taxi.With many top countries and destinations continuing to deliver amazing service year after year, in 2020 the countries with the most winners include Italy (130,253), Spain (66,755), France (61,492), Germany (49,777), Croatia (42,763), United States of America (42,112), United Kingdom (41,848), Poland (36,793), the Russian Federation (36,296) and Greece (33,259).\"With nearly one million awards given across accommodation and transport providers, I am thrilled to announce this year's Traveller Review Awardees, who are helping us deliver seamless trip experiences,\" said Arjan Dijk, SVP and Chief Marketing Officer for Booking.com. \"On our mission to make it easier for everyone to experience the world, we are proud to have a record number of our partners across the travel industry receiving consistently great reviews and representing the best of the best in hospitality around the globe.\"2020's Most Welcoming Places on EarthFrom a rural Irish town that is the gateway to the Aran Islands to a vast network of ancient caves in Southeast Asia, the Most Welcoming Places on Earth* are leading the way in providing amazing experiences for their visitors. Notably for the second year in a row, Goreme (Turkey) retains its place as the Most Welcoming Place on Earth, followed by Tatranska Lomnica (Slovakia), Phong Nha (Vietnam), Kobarid (Slovenia), Cochem (Germany), Doolin (Ireland), Taitung City (Taiwan), Schenna (Italy), Monte Verde (Brazil), and Lake Tekapo (New Zealand) - another 2018 winner.To discover more about these amazing destinations, click here.Apartments Continue to Satisfy and Exceed Guest ExpectationsSpectacular growth in the number of Awardees continued this year in apartments, with this accommodation type topping the list yet again, making up nearly 40% of the award-winning properties globally in 2020. Similarly, for a third consecutive year, four out of the five top-awarded accommodation types are alternative accommodation options: Apartments (380,936), hotels (179,869), guest houses (94,162), holiday homes (82,241), and B&Bs (75,875).While hotels came in as the second most-awarded accommodation type yet again, three quarters (75%) of all the winning properties are homes, apartments and other unique places to stay, including everything from boats and igloos to homestays and country houses. With recent research by Booking.com surveying over 22,000 travelers revealing that nearly two fifths (39%) of global travelers would prefer to stay in a holiday home or apartment over a hotel, Booking.com is proud to offer so many unique places to stay that provide superior hospitality.For First Time, Transport Providers Honored with Traveller Review AwardsCreating a seamless accommodation experience for travelers has been Booking.com's core focus for many years, but there is much more to your trip than where you stay. Whether travelers want to explore the country, get out to the beach, move around the city or just get home, Booking.com's ground transport offering is helping travelers make it happen. That's why this year, for the first time ever, Booking.com is bringing Traveller Review Awards to car rental and airport taxi partners to ensure that travelers can have the best experience possible, whatever their transportation needs may be.This year, 2,931 pick-up locations of Booking.com's car rental offering, which spans 160 countries and territories, have been awarded. The top awarded rental car pick-up locations globally include Alghero Airport, Italy (13); Menorca Airport, Spain (12); Krakow Airport, Poland (12); Adelaide Airport, Australia (12); Christchurch Airport, New Zealand (12); Stuttgart Airport, Germany (11); Paphos Airport, Cyprus (11); Cairns Airport, Australia (11); Budapest Airport, Hungary (11); and Coolangatta Gold Coast Airport, Australia (11). Airport taxis, which are available in over 750 destinations globally, are being recognized for their outstanding service for the first time ever as well, with 2,114 drivers across 27 providers winning Traveller Review Awards. As 2020 approaches, travelers can look to these airport taxi providers to keep them moving on their next trip.Note to Editors:To be recognized with an Award, accommodation properties and car rental had to have an average review score of 8.0 (out of 10) or higher based on at least 5 reviews as of 11:59pm (CET) on October 31, 2019. To be recognized for an Award, airport taxis had to have an average review score of 4.5 (out of 5) or higher and completed 2,000 rides as of 11:59pm (CET) on October 31, 2019. Only customers that have actually stayed at an accommodation or rented a car can leave a review of their experience on Booking.com. As these reviews are never edited or adjusted in any way, travelers can reference them for an authentic account of what the real traveler experience is like at every place to stay or with every ground transport provider on Booking.com. *Destinations were sorted by the total share of Traveller Review Award 2020 winners when compared to the total amount of eligible properties in that city (accommodation only). Cities also had to have an above average amount of winners to be included on this list (90 award recipients or higher) and were curated for geographic spread.About Booking.com:Founded in 1996 in Amsterdam, Booking.com has grown from a small Dutch startup to one of the world's leading digital travel companies. Part of Booking Holdings Inc. (NASDAQ: BKNG), Booking.com invests in technology that helps take the friction out of travel. With a mission to make it easier for everyone to experience the world, Booking.com seamlessly connects millions of travelers with memorable experiences, convenient transportation options and incredible places to stay - from homes to hotels and much, much more. Booking.com also provides a marketplace for entrepreneurs of all sizes in the travel and experiences industries to reach a global audience and grow their businesses. Booking.com is available in 43 languages and offers more than 29 million total reported accommodation listings, including more than 6.2 million listings alone of homes, apartments and other unique places to stay. With everything from convenient rides and great places to eat, as well as attractions, tours, events and activities across the globe, no matter where you want to go or what you want to do, Booking.com makes it easy and backs it all up with 24/7 customer support.Follow us on Twitter and Instagram, like us on Facebook, and for the latest news, data and insights, please visit our global media room.CONTACT DETAILSFor further information, contact the Booking.com Global Press Office: mediarelations@booking.com View original content:http://www.prnewswire.com/news-releases/bookingcom-spotlights-the-best-in-travel-with-its-traveller-review-awards-2020-300986755.htmlSOURCE  Booking.com"
    },
    {
        "title": "KAYAK Reveals 2020 Travel Hacker Guide featuring Under-the-Radar, Trending, Wallet-Friendly & Solo Travel Destinations",
        "subtitle": "Visit Top-Trending Hawaii, Stay Budget Savvy in Southern U.S. Cities, or Fly Solo in Colombia",
        "date": "Jan 8, 2020 10:00AM EST",
        "content": "STAMFORD, Conn., Jan. 8, 2020 /PRNewswire/ -- KAYAK is releasing its 5th annual Travel Hacker Guide featuring data on where to go, when to book and best times to fly. And for the first time since its inception, KAYAK will retire the Most Popular list from the guide to encourage travelers to venture outside of the most searched hotspots.The 2020 Travel Hacker Guide includes lists, details and data for: Under-the-Radar, Solo Travel, Trending and Wallet-Friendly destinations, as well as guidance on When to Fly. The inaugural Under-the-Radar list highlights destinations that haven't reached trending status, but should be on your 2020 travel goals. These are destinations that have a high density of hotels, but haven't spiked in travelers' searches just yet. From European getaways to beachside cities, places like Port Elizabeth, South Africa; Santa Maria, Cape Verde; and Puerto Varas, Chili make up this international list. Another new list reveals the top destinations perfect for solo travelers. According to KAYAK data, these places see more searches for single travelers than anywhere else. From Ushuaia, Argentina to Nuuk, Greenland, you can travel solo with confidence with our data on where to stay and when to book. And if you are already sick of the cold weather and want to head to a warmer destination like Aruba or Palm Springs, When to Fly reveals that some of the best deals are in February trips, so get searching! KAYAK's 2020 Travel Hacker Guide reveals the following additional insights: For a full list of KAYAK's highlighted destinations in this year's Travel Hacker Guide, as well as best times to fly to key cities, check out the guide here: https://www.kayak.com/travelhacker.About KAYAK KAYAK, part of Booking Holdings (NASDAQ:  BKNG), is the world's leading travel search engine. With more than 6 billion queries across our platforms each year, we help people find their perfect flight, hotel, rental car, cruise, or vacation package. For more information, visit www.KAYAK.com.2020 Travel Hacker Guide MethodologyMedia Contact: Sarah Novatt, 914-433-0838, snovatt@kayak.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/kayak-reveals-2020-travel-hacker-guide-featuring-under-the-radar-trending-wallet-friendly--solo-travel-destinations-300983547.htmlSOURCE  KAYAK"
    },
    {
        "title": "Booking.com and Google Nest Announce Partnership to Enhance Trip Experience for Travelers",
        "subtitle": "Multi-Faceted Partnership Kicks Off With a Holiday Promotion for Consumers, Offering a Free Google Nest Mini for Qualified Bookings Made Between December 26, 2019 - January 5, 2020 on Booking.com in the United States",
        "date": "Dec 19, 2019 4:39PM EST",
        "content": "AMSTERDAM, Dec. 19, 2019 /PRNewswire/ -- Today Booking.com, the global leader in online travel making it easier for everyone to experience the world, announced a year-long partnership with Google Nest aimed at helping to build a more connected and seamless trip experience for travelers and hosts. The partnership will encompass offers and incentives for Booking.com customers as well as enhancements for partners that will help make it easier to deliver a premium experience to guests.The first element of the partnership will kick off with an exclusive offer for U.S. based travelers, to give a head start on experiencing the world in 2020. Guests who book a stay on Booking.com between December 26, 2019 through January 5, 2020 with a minimum spend of $150 will receive a free Google Nest Mini by using the promo code GOOGLENEST. Bookers will be able to use the Google Nest Mini as a helpful tool for travel with specifics, such as: flight times, weather, and translation. More information on the promotion, along with terms and conditions, can be found at www.booking.com/googlenest.html. With 29 million total listings on Booking.com, including more than 6.2 million listings of homes, apartments and other unique places to stay, the partnership will continue with programs that focus on making hosting with Booking.com even easier. These programs will focus on providing partners with access to product and installation services that include Google Nest devices for their property. Shared insights from Booking.com and Google show guests and hosts are increasingly looking for enhancements in the alternative accommodation segment as it relates to the safety, security, and ease of the experience. Smart products including keyless locks, energy-saving thermostats and voice assistant devices improve the guest's stay and deliver more value for the homeowner. This partnership will also complement existing product features that can be found on Booking.com such as the recently announced quality ratings product. These ratings allow guests to make even more informed choices about the properties they book, stay and enjoy. Arjan Dijk, Senior Vice President and Chief Marketing Officer of Booking.com said: \"Booking.com and Google have been strategic partners for many years and we are delighted to deepen our relationship further with such an integrated partnership that will help build an even more connected guest and host experience on Booking.com. The partnership will not only provide consumers with incentives to book a stay on Booking.com, but will also provide our partners with access to product and installation services that include Google Nest devices, to help their property deliver an amazing experience for Booking.com guests.\"Booking.com and Google Nest will announce additional elements of the partnership that will help make it easier for everyone to experience the world over the coming months. To book your next trip or list your property, visit Booking.com. About Booking.com: Founded in 1996 in Amsterdam, Booking.com has grown from a small Dutch startup to one of the world's leading digital travel companies. Part of Booking Holdings Inc. (NASDAQ: BKNG), Booking.com's mission is to make it easier for everyone to experience the world. By investing in the technology that helps take the friction out of travel, Booking.com seamlessly connects millions of travelers with memorable experiences, a range of transportation options and incredible places to stay - from homes to hotels and much more. As one of the world's largest travel marketplaces for both established brands and entrepreneurs of all sizes, Booking.com enables properties all over the world to reach a global audience and grow their businesses. Booking.com is available in 43 languages and offers more than 29 million total reported accommodation listings, including more than 6.2 million listings alone of homes, apartments and other unique places to stay. No matter where you want to go or what you want to do, Booking.com makes it easy and backs it all up with 24/7 customer support.Follow us on Twitter and Instagram, like us on Facebook, and for the latest news, data and insights, please visit our global media room.Contact: angela.cavis@booking.com  View original content:http://www.prnewswire.com/news-releases/bookingcom-and-google-nest-announce-partnership-to-enhance-trip-experience-for-travelers-300978006.htmlSOURCE  Booking.com"
    },
    {
        "title": "Diners Have Spoken: OpenTable Reveals Top 100 Restaurants in America for 2019",
        "subtitle": "Honorees span 27 states and Washington, D.C.; California, Florida, New York and Pennsylvania lead OpenTable's annual list",
        "date": "Dec 17, 2019 8:30AM EST",
        "content": "SAN FRANCISCO, Dec. 17, 2019 /PRNewswire/ -- As we close out the year and reflect on the very best of 2019, OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc. (NASDAQ: BKNG), revealed the Top 100 Restaurants in America for 2019, according to OpenTable diners. From one-of-a-kind dining experiences to local favorites, the list highlights top restaurants across the country based on verified reviews submitted by diners. The annual list comes off the heels of OpenTable's recent year end dining report, a retrospective look back at this year's most popular dining trends.Whether it's the outstanding menu inspired by the Pacific Northwest at Birdsong in San Francisco or Girl & the Goat in Chicago, the list illustrates the best restaurants in the U.S., as voted by OpenTable diners, and showcases the platform's extensive network of dining options for every occasion. \"Whether a restaurant has received national accolades or is built on local fanfare, our Top 100 reflects diners' favorite culinary experiences across the country,\" said Andrea Johnston, COO at OpenTable. \"What ultimately ties these restaurants together is their excellent hospitality paired with incredible dishes, which is why diners are applauding them with rave reviews.\" California took second place last year, but in 2019, the Golden State rose to number one with 22 restaurants featured. Florida, New York and Pennsylvania tied for second place with seven restaurants each, and Illinois followed closely behind with six winners. Arizona, Colorado, Nevada, Oregon and Washington, D.C. boasted four honorees each. Additional states include Alabama, Georgia, Hawaii, Indiana, Iowa, Kansas, Louisiana, Massachusetts, Michigan, Missouri, New Jersey, New Mexico, North Carolina, Ohio, Oklahoma, Texas, Virginia and Washington.Similar to last year, American and Italian cuisine dominated the list; however, this year French cuisine proved to be a new favorite. Other global cuisines were represented on the list, such as Japanese, Latin American, Mediterranean and Middle Eastern, showcasing a growing appetite for more diverse and globally-inspired flavors.OpenTable's list of the Top 100 Restaurants for 2019 in the U.S. is generated from diner reviews collected between October 1, 2018 and September 30, 2019. All restaurants that have been part of the OpenTable network for at least the last 12 consecutive months with a minimum overall rating and number of qualifying reviews were included for consideration. Qualifying restaurants were then sorted according to an overall score generated by unique data points, such as overall diner rating, user klout, total number of reviews and regional overall rating.Based on this methodology, the Top 100 Restaurants in America for 2019 list, according to OpenTable diners, are in alphabetical order as follows:Top 100 Restaurants in America for 2019Acquerello - San Francisco, California Addison Restaurant - San Diego, California Ambra - Philadelphia, PennsylvaniaAnjelica's Restaurant - Sea Bright, New JerseyAntebellum - Flowery Branch, Georgia The Artichoke Restaurant & Bar - Vinita, OklahomaArtisan - Elkhart, Indiana Arturo Boada Cuisine - Houston, TexasAtera - New York, New YorkBar Mingo - Portland, OregonBarrique Venice - Venice, California Benu - San Francisco, California Bibou - Philadelphia, PennsylvaniaBirdsong - San Francisco, California Bistro 31 - Dallas, TexasBistro Barbes - Denver, ColoradoBistro Daisy - New Orleans, Louisiana Bites at The Ritz-Carlton, Naples - Naples, FloridaBOCA - Cincinnati, Ohio Brassica Kitchen - Boston, MassachusettsBrewery Bhavana - Raleigh, North Carolina Buccan - Palm Beach, FloridaBull & Bear Steakhouse - Orlando, Florida Cafe Monarch - Scottsdale, ArizonaCafe Provence - Prairie Village, KansasCarlos' Bistro - Colorado Springs, ColoradoChimney Park - Windsor, ColoradoClark's Oyster Bar - Austin, Texas Collage Restaurant - St. Augustine, FloridaCrawford & Son - Raleigh, North CarolinaThe Crossing - Clayton, MissouriCRUST - Miami, Florida The Dock - Newport Beach, CaliforniaDouble Knot - Philadelphia, PennsylvaniaEatt - Las Vegas, NevadaElizabeth's Gone Raw - Washington, D.C.The Family Jones Spirit House - Denver, ColoradoFishing With Dynamite - Manhattan Beach, California Geronimo - Santa Fe, New MexicoGirl & the Goat - Chicago, IllinoisGuiso Latin Fusion - Healdsburg, California Hachi - Carson, California Hannas Prime Steak - Rancho Santa Margarita, California Holdfast Dining - Portland, Oregon Joe's Seafood, Prime Steak & Stone Crab - Multiple Locations*         Joel Robuchon - MGM Grand - Las Vegas, Nevada Kai | Sheraton Grand at Wild Horse Pass - Phoenix, Arizona Kendall-Jackson Wine Estate & Gardens - Fulton, CaliforniaKenzo Napa - Napa, California The Kitchen Restaurant - Sacramento, California Krave Restaurant - Tequesta, FloridaKUSAKABE - San Francisco, CaliforniaL'Auberge Chez Francois - Great Falls, VirginiaL'ATELIER de Joël Robuchon - New York, New YorkLahaina Grill - Lahaina, Hawaii Le Diplomate - Washington, D.C.Le Yaca - Virginia Beach, VirginiaThe Little Owl - New York, New York Mabel Gray - Hazel Park, MichiganMama's Fish House - Paia, Hawaii Maple & Ash - Chicago, IllinoisMercato Stellina Pizzeria - Bellevue, WashingtonNANCY - St. Simons Island, Georgia NoJa - Mobile, AlabamaNoord - Philadelphia, PennsylvaniaOcean 44 - Scottsdale, ArizonaOlce Pizza Grille - Cedars, Pennsylvania Oriole - Chicago, IllinoisPartage - Las Vegas, NevadaPetrossian Restaurant & Boutique - West Hollywood, California Phoenicia - Birmingham, MichiganQuince - San Francisco, California Rainbow Palace - Fort Lauderdale, Florida The Restaurant at Convict Lake - Mammoth Lakes, California The Restaurant at Gideon Ridge - Blowing Rock, North Carolina Restaurant Guy Savoy - Caesars Palace - Las Vegas, NevadaRiccardo Trattoria - Chicago, IllinoisRosmarino Osteria Italiana - Newberg, OregonRPM Steak - Chicago, IllinoisScalini Fedeli - New York, New York Seven Hills - San Francisco, California Sotto - Cincinnati, Ohio St. Anselm - Washington, D.C.St. Francis Winery & Vineyards - Santa Rosa, California Steak 44 - Phoenix, ArizonaSteve & Cookie's By the Bay - Margate, New Jersey Sushi House - Leawood, KansasSushi Kaito - New York, New YorkTable 128 Bistro + Bar - Clive, IowaThe Table at Season To Taste - Cambridge, MassachusettsTallulah Wine Bar and Bistro - Birmingham, MichiganTempura Matsui - New York, New York Terrapin Creek Cafe & Restaurant - Bodega Bay, California Terzo - San Francisco, California The WineSellar & Brasserie - San Diego, California Tomo Sushi & Ramen - Philadelphia, PennsylvaniaTwo Fish - Haddonfield, New JerseyVernick Coffee Bar - Philadelphia, PennsylvaniaWillow Restaurant - Portland, Oregon Yopparai - New York, New YorkYou can find the complete Top 100 Restaurants in America for 2019 here. * Restaurants with multiple winning locations were counted one time.About OpenTableOpenTable, OpenTable, part of Booking Holdings, Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business. View original content to download multimedia:http://www.prnewswire.com/news-releases/diners-have-spoken-opentable-reveals-top-100-restaurants-in-america-for-2019-300975780.htmlSOURCE  OpenTable"
    },
    {
        "title": "Research by Agoda shows that travelers are looking for \"nature and scenery\" which can be found in Jeju Island -- a great destination, even in winter",
        "subtitle": "",
        "date": "Dec 10, 2019 12:03AM EST",
        "content": "SEOUL, South Korea, Dec. 10, 2019 /PRNewswire/ -- According to new research by Agoda, one of the world's fastest growing digital travel platforms, the top reasons people travel are 'Nature or Scenery', 'Sun, Beaches or Islands', and 'Food & Dining'. Jeju Island, in Korea, has all of these to offer -- so it's no surprise that it has become so popular. Indeed, with its mountains, beaches, and laid-back lifestyle, Jeju is beloved by both domestic and international travelers. It is the most popular Korean destination (after Seoul) for travelers from all over Asia-Pacific, as Agoda's booking data for the past two years reveals.What travelers may not know is that Jeju is a year-round destination. During the summer, of course, Jeju's spectacular beaches draw travelers. But in winter, humidity is lower, skies are clear, and the air is cooler -- so it's perfect for other kinds of activities, especially hiking in the mountains. And no matter what kind of activities attract travelers, nor whether they are looking for a hotel, an apartment, a home, or a villa, the natural splendor of Jeju can be discovered while staying at an Agoda-listed property.Let's start with Jeju's coastline, which offers an astonishingly diverse array of natural settings. Jusangjeolli Cliff, one of the island's most famous coastal destinations, can be found in the eastern Jungmun Tourist areas. At the nearby observatory, travelers can enjoy the breathtaking spectacle of waves crashing against huge stone pillar steps. Seongsan Ilchulbong Peak, famous for its picturesque sunrises, offers a glimpse of the nearby mysterious coastal cliff. Whether travelers want to climb to the top or prefer to enjoy the view of it from nearby beaches such as Gwangchigi Beach, it's worth seeing. Seopjikoji, well-known as a TV location spot for Korean dramas has a walking trail that offers magnificent coastal views, while Jeongbang Falls offers a unique view of the water falling directly into the sea.Hallasan, the tallest mountain in South Korea, is a prominent feature of the Jeju landscape. A dormant volcano, its peak is almost 2,000 meters above sea level. It's perfectly safe -- the volcano has not erupted for 1,000 years -- but Jeju's many caves retain the traces of lava's passage, and have long aroused the curiosity of travelers. The Manjanggul Lava Tube, (7.4km long), has a variety of cave formations including the world's largest lava column. The Hyeopjaegul Lava Tube and Ssangyonggul Cave, located in Hallim Park, is a spectacular example lava and limestone caves.Spectacular snow scenes on Hallasan MountainHallasan Mountain also captivates travelers with its snowscapes throughout the winter months. Numerous hiking trails boast a variety of snow-capped vistas, so travelers can take their pick. The Seongpanak course, which goes to the beautiful Baengnokdam crater lake, is the most challenging, but also offers the best snow-covered views for hardy hikers prepared to make the winter trip. For beginners, they can choose the Yeongsil course, which is the shortest trail, or the Eorimok course, which has a relatively low slope. Travelers can get to Hallasan by just taking the bus. https://www.visitjeju.net/en/detail/view?contentsid=CONT_000000000500685# Winter in Jeju is not only white -- it also glows red. Even in the snowy season, Jeju is adorned by winter-blooming camellias. Travelers can capture their beauty from many places. One of the best is the aptly named Camellia Hill, a botanical garden which features 6,000 camellia plants of 500 species, including the world's largest camellia. Or, visit Sinheung-ri Camellia Town, filled with the scent of camellias, and Seonheul-ri's Gotjawal, a unique virgin forest in a lava region.With daily connection flights from across Korea, and direct flights from origin markets including Mainland China, Taiwan, Hong Kong, Japan, Malaysia, and Thailand, Jeju Island is just waiting to be explored.About AgodaAgoda is one of the world's fastest growing online travel booking platforms. From its beginnings as an e-commerce start-up based in Singapore in 2005, Agoda has grown to offer a global network of over 2.5 million properties in more than 200 countries and territories worldwide, offering travelers easy access to a wide choice of luxury and budget hotels, apartments, homes and villas to suit all budgets and travel occasions.Headquartered in Singapore, Agoda is part of Booking Holdings (Nasdaq: BKNG) and employs more than 5,000 staff in more than 30 countries. Agoda.com and the Agoda mobile app are available in 38 languages.Learn more about Jeju:Tourism information can be found at visitjeju.net/enAll images attributed Visit JejuPhoto - https://photos.prnasia.com/prnh/20191205/2662255-1-aPhoto - https://photos.prnasia.com/prnh/20191205/2662255-1-cPhoto - https://photos.prnasia.com/prnh/20191205/2662255-1-bLogo - https://photos.prnasia.com/prnh/20190925/2590363-1LOGOSOURCE  Agoda"
    },
    {
        "title": "Diners Have Spoken: OpenTable Reveals The Top 100 Restaurants in Canada and Top Dining Trends for 2019",
        "subtitle": "",
        "date": "Dec 9, 2019 9:00AM EST",
        "content": "Diner review data reveals Canadians are craving plant based foods and meat substitutionsTORONTO, Dec. 9, 2019 /PRNewswire/ -- Celebrating Canada's diverse and rich culinary offerings, OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc., today announced the Top 100 Restaurants in Canada for 2019 according to OpenTable diners. The list is a comprehensive look at the year's most beloved dining spots selected from more than 500,000 verified diner reviews of over 3,000 restaurants across the country. To round up the year, OpenTable is also revealing the top dining trends of 2019, based on diner reviews. From the Italian neighbourhood gem Giulietta in Toronto, the Mediterranean influenced hot spot Escoba Bistro and Wine Bar in Calgary's downtown core, to the equally as delicious as it is visually stunning Osteria Savio Volpe in Vancouver, this year's list showcases OpenTable's eclectic dining options for every occasion across Canada. The restaurants featured have been recognized for their impeccable service, their ability to orchestrate one-of-a-kind dining experiences and for consistently offering unforgettable dishes. Ontario has the greatest number of restaurants included on the list with 55 featured, followed by Alberta with 19, Quebec with 15 and British Columbia with 9 restaurants. Newfoundland and Saskatchewan are also represented on the list.After scouring diner reviews from across the globe for qualitative insights, OpenTable is sharing the top dining trends of the year to complement the Top 100 Restaurants in Canada. They include:\"Canada's culinary diversity shines through in this year's list of restaurants,\" said Andrea Johnston, COO at OpenTable. \"It's evident from the diner reviews that plant-based options and locally sourced menus are extremely popular across the country. We are thrilled to recognize the restaurants that are consistently providing world-class food and drink and exceptional hospitality that showcase the country's tastes for multiculturalism and adventure.\"The list of Top 100 Restaurants in Canada for 2019 is generated solely from OpenTable diner reviews collected between October 1, 2018, and September 30, 2019. All restaurants with a minimum \"overall\" score and number of qualifying reviews were included for consideration. Qualifying restaurants were then sorted according to an overall score generated by unique data points, such as overall diner rating, user klout, total number of reviews and regional overall rating.Based on this methodology, the following restaurants, listed in alphabetical order, comprise the Top 100 Restaurants in Canada for 2019 according to OpenTable diners. The complete list can also be viewed here.Top 100 Restaurants in Canada for 2019850 Degrees – Etobicoke, ONAkira Back – Toronto, ONAscari Enoteca – Toronto, ONAtelier – Ottawa – Ottawa, ONBackhouse – Niagara-on-the-Lake, ONBar Isabel – Toronto, ONBerkeley North – Hamilton, ONBishop's – Vancouver, BCBonaparte – Montreal, QCBow Valley Ranche Restaurant – Calgary, ABByblos - Downtown – Toronto, ONCano Restaurant – Toronto, ONCanoe Restaurant and Bar – Toronto, ONCarben Restaurant – Ottawa, ONThe Carriage House Restaurant & Wine Bar – Burlington, ONCasa Fuego – Toronto, ONChabrol Restaurant – Toronto, ONChef's Table – Montreal, QCChez Sophie - Montreal – Montreal, QCCioppino's Mediterranean Grill – Vancouver, BCCore – Toronto, ONDaiLo – Toronto, ONDamas – Montreal, QCDon Alfonso 1890 – Toronto, ONEden - Rimrock Resort Hotel – Banff, ABEscoba Bistro and Wine Bar – Calgary, ABFishbone Bistro - Main St Stouffville – Stoufville, ONFive Sails Restaurant – Vancouver, BCFlor de Sal – Toronto, ONGeorge Restaurant – Toronto, ONGiulietta – Toronto, ONGotham Steakhouse and Bar – Vancouver, BCGrapes - Fairmont Banff Springs – Banff, ABGrappa Restaurant – Etobicoke, ONGrey Gardens – Toronto, ONThe Grill Room at The Fairmont Chateau Whistler – Whistler, BCHearth Restaurant – Saskatoon, SKHer Father's Cider Bar + Kitchen – Toronto, ONHy's Steakhouse - Multiple Locations – Calgary, AB; Vancouver, BC Ile Flottante (former Les Deux Singes) – Montreal, QCJellyfish Montreal – Montreal, QCJoso's – Toronto, ONJules Bistro - Queen West – Toronto, ONKing Street Trio – Waterloo, ONKlein / Harris – Calgary, ABKOKO! Share Bar – Toronto, ONLa Banane – Toronto, ONLangdon Hall Dining Room – Cambridge, ONL'Atelier de Joel Robuchon - Montréal – Montreal, QCLaurieRaphael - Quebec – Quebec, QCLaVinia – Toronto, ONLe Baccara - Casino du Lac Leamy – Gatineau, QCLe Baratin – Toronto, ONLe Club Chasse et Peche – Montreal, QCLe Filet – Montreal, QCLulu Bar – Calgary, ABL'Unità Enoteca – Toronto, ONMaison Boulud – Montreal, QCMamakas Taverna – Toronto, ONMichael's on Simcoe – Toronto, ONMiku Restaurant - Toronto – Toronto, ONMorton's The Steakhouse - Toronto – Toronto, ONThe Nash – Calgary, ABNiko's Bistro – Calgary, ABNuit Social – Toronto, ONOpus Restaurant – Toronto, ONOsteria Savio Volpe – Vancouver, BCParadis BBQ – Montreal, QCPigeonhole – Calgary, ABPosto Pizzeria and Bar – Calgary, ABQ Haute Cuisine (formerly La Caille) – Calgary, ABRaymonds Restaurant – St. John's, NFRestaurant Le Continental – Quebec, QCRickshaw Bar – Toronto, ONRistorante Beatrice – Montreal, QCRoot & Bone – Fonthill, ONRuth's Chris Steak House - Calgary – Calgary, ABSabor Restaurant – Edmonton, ABSalt Wine Bar – Toronto, ONScaramouche – Toronto, ON; Scaramouche Pasta Bar – Toronto, ONShoushin – Toronto, ONSorrel Rosedale – Toronto, ONSukiyaki House – Calgary, ABTachi - Assembly Chef's Hall – Toronto, ONTavola – Vancouver, BCTen Foot Henry – Calgary, ABTide & Vine – Niagara Falls, ONTreadwell Farm-to-Table Cuisine - Niagara on the lake – Niagara-on-the-Lake, ONTrius Winery Restaurant – Niagara-on-the-Lake, ONTzin Wine & Tapas – Edmonton, ABVero Bistro Moderne – Calgary, ABViaggio - Toronto – Toronto, ONVineland Estates Winery Restaurant – Vineland, ONWORKSHOP kitchen + culture – Calgary, ABYasu - Sushi Bar – Toronto, ONThe Yellow Pear Kitchen – St. Catherines, ONYukashi Japanese Cuisine – Toronto, ONYuwa Japanese Cuisine (fka Zest Restaurant) – Vancouver, BCZen Japanese Restaurant - Markham – Markham, ONZen Japanese Restaurant - West Vancouver – Vancouver, BC* Restaurants with multiple winning locations were counted one time.About OpenTable:OpenTable, part of Bookings Holdings, Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.SOURCE  OpenTable, Inc."
    },
    {
        "title": "OpenTable Partners with No Kid Hungry to Help End Child Hunger During the Holidays",
        "subtitle": "Kicking Off on Giving Tuesday, the Campaign Will Allow OpenTable Diners to Donate Points for the Third Consecutive Year",
        "date": "Dec 3, 2019 8:30AM EST",
        "content": " SAN FRANCISCO, Dec. 3, 2019 /PRNewswire/ -- In advance of the holiday season, OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc. (NASDAQ: BKNG), has once again partnered with No Kid Hungry, a national campaign to end childhood hunger in America. With this year's partnership, OpenTable and No Kid Hungry will continue adding to the nearly 4 million total meals donated since first partnering together in 2017.Beginning today, December 3, 2019, OpenTable diners have the option of donating their dining points to help connect children living with hunger to the food they need. Every 100 points donated can provide a child in need with up to five healthy meals. The campaign will extend through Monday, December 16, 2019 and OpenTable has committed to match donations up to 250,000 meals to deepen the impact of this effort.\"No Kid Hungry has made an incredible impact on addressing childhood hunger and poverty in this country but there is still so much work to be done,\" said Jessica Jensen, Senior Vice President of Marketing at OpenTable. \"We've made it as easy as possible for our diners to use their points and help us surpass last year's donation of up to 2.7 million meals.\"\"One in seven children in the U.S. lives with hunger,\" said Debbie Shore, Co-founder of Share Our Strength, the organization behind the No Kid Hungry campaign. \"Hunger can have devastating consequences for their health and wellbeing. We're grateful to be partnering with OpenTable this holiday season to help feed kids in need. By the simple act of donating their loyalty points, diners can make a huge impact in the lives of children all across the country. Just 100 points can provide up to five meals to kids in need. Now that's something to celebrate!\"To donate points, diners can visit their OpenTable profile pages to view their points and select \"donate my points.\" From there, diners will have an opportunity to donate a portion or all their points to support No Kid Hungry. Donations will run between December 3, 2019 – December 16, 2019. For more information, please visit nokidhungry.org/onedollar. About OpenTableOpenTable, OpenTable, part of Booking Holdings, Inc. (NASDAQ: BKNG),is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.About No Kid HungryNo child should go hungry in America. But 1 in 7 kids will face hunger this year. No Kid Hungry is ending childhood hunger through effective programs that provide kids with the food they need. This is a problem we know how to solve. No Kid Hungry is a campaign of Share Our Strength, an organization working to end hunger and poverty. Join us at NoKidHungry.org View original content to download multimedia:http://www.prnewswire.com/news-releases/opentable-partners-with-no-kid-hungry-to-help-end-child-hunger-during-the-holidays-300967642.htmlSOURCE  OpenTable, Inc."
    },
    {
        "title": "What's On Your Plate? OpenTable Reveals Dining Trends for 2019",
        "subtitle": "Diners Continue to Crave A Healthier Lifestyle with 'Keto' and 'Plant Based' Reviews Skyrocketing",
        "date": "Dec 2, 2019 8:30AM EST",
        "content": "SAN FRANCISCO, Dec. 2, 2019 /PRNewswire/ -- Before closing the menu on 2019, OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc. (NASDAQ: BKNG), today released a retrospective look back at this year's most popular dining trends. From trending reviews to dining behavior across the country, this year's diners are looking to have their cake and eat it too. \"We hit a major milestone this year - 10 billion diners seated, using our software. To put that in perspective, that's more than the world's population,\" said Andrea Johnston, COO at OpenTable. \"This year alone, we sat over 283 million diners who gave more than 13 million reviews. This uncovered a treasure trove of food trends and shifts in behavior to provide insightful context as to how people are eating in 2019.\" On OpenTable's plate in 2019, diners moved towards more health-conscious dining preferences. Alternative diets are also on the rise compared to 2017 with 'keto' mentioned a whopping 683 percent more in reviews and 'plant based' mentions increasing by 136 percent. Diners also vegged out on low-calorie alternatives with 'cauliflower crust' mentions skyrocketing in reviews by 487 percent and 'jackfruit,' another vegan and vegetarian alternative, increasing in reviews by 148 percent since 2017. Additionally, OpenTable found diners are still choosing to indulge when it comes to global cuisines. This past year, Mexican-inspired dishes continued to grow in popularity, with 'queso' mentions increasing by nearly 31 percent and 'nachos' mentions by 19 percent over the past three years. Review mentions of 'potstickers,' a staple in Asian cuisine, has increased by 61 percent. Finally, review mentions of the classic Italian delicacy, 'cacio e pepe,' has increased by 96 percent since 2017.Key takeaways from this year's report include: To learn more about OpenTable's Year in Dining trends and see an infographic visualizing this data, please go here.*The most reserved restaurant of the year was determined based on online seated reservations from January 1 - September 30, 2019.About OpenTableOpenTable, OpenTable, part of Booking Holdings, Inc. (NASDAQ: BKNG),is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business. View original content to download multimedia:http://www.prnewswire.com/news-releases/whats-on-your-plate-opentable-reveals-dining-trends-for-2019-300965420.htmlSOURCE  OpenTable"
    },
    {
        "title": "Booking Holdings to Transfer Listing of Debt Securities to Nasdaq",
        "subtitle": "",
        "date": "Nov 26, 2019 4:05PM EST",
        "content": "NORWALK, Conn., Nov. 26, 2019 /PRNewswire/ -- Booking Holdings Inc. (NASDAQ: BKNG) today announced that it will be transferring the securities exchange listing for its 0.800%  Senior Notes due 2022, 2.150% Senior Notes due 2022, 2.375% Senior Notes due 2024 and 1.800% Senior Notes due 2027 (collectively, the \"Notes\") from the New York Stock Exchange to the corporate bond exchange of The NASDAQ Stock Market LLC (\"NASDAQ\") effective December 6, 2019 after market close.  The Notes are expected to begin trading as NASDAQ-listed securities on December 9, 2019.  Their respective trading symbols and CUSIP numbers are as follows:Booking Holdings is transferring the listing of the Notes to NASDAQ to consolidate under one exchange its equity and debt listings relationships.About Booking HoldingsBooking Holdings (NASDAQ: BKNG) is the world leader in online travel and related services, provided to consumers and partners in over 230 countries and territories through six primary brands—Booking.com, KAYAK, priceline, agoda.com, Rentalcars.com and OpenTable. The mission of Booking Holdings is to help people experience the world.For more information, visit BookingHoldings.com and follow us on Twitter @BookingHoldings.Information About Forward-Looking StatementsThis press release may contain forward-looking statements, which reflect the views of the Company's management regarding current expectations and projections about future events and are based on currently available information. Any such forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions that are difficult to predict; therefore, actual results may differ materially from those expressed, implied or forecasted in any such forward-looking statements. Expressions of future goals and similar expressions including, \"may,\" \"will,\" \"should,\" \"could,\" \"expects,\" \"plans,\" \"anticipates,\" \"intends,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" \"targets,\" or \"continue,\" reflecting something other than historical fact are intended to identify forward-looking statements. A detailed discussion of some of the factors that could cause the Company's actual results to differ materially from those described in any such forward-looking statements can be found in the Company's most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission and any subsequently filed Quarterly Reports on Form 10-Q. Unless required by law, the Company undertakes no obligation to update publicly any forward-looking statements, whether as a result of new information, future events or otherwise. View original content:http://www.prnewswire.com/news-releases/booking-holdings-to-transfer-listing-of-debt-securities-to-nasdaq-300965639.htmlSOURCE  Booking Holdings Inc."
    },
    {
        "title": "Take Yourself Out on a Date: OpenTable Reveals the Top Restaurants for Solo Dining in Canada",
        "subtitle": "",
        "date": "Nov 21, 2019 9:00AM EST",
        "content": "OpenTable data reveals single person reservations have grown nationally by 75 per cent since 2017 TORONTO, Nov. 21, 2019 /PRNewswire/ -- Who says you can't have a party of one? New data released by OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc. (NASDAQ: BKNG), shows that the stigma of eating alone is a thing of the past. In fact, solo dining in Canada is on the rise, reservations for parties of one have grown by 75 per cent since 2017. It turns out solo travellers and city dwellers savour culinary experiences alone. Solo dining offers the benefits of taking the time to enjoy a quality meal without having to make conversation or worry about judgment from company over dining habits. Breakfast is the most popular meal for solo dining, revealing that many diners prefer to spend the first few hours of the day enjoying their meal and taking time for themselves.OpenTable data revealed that Toronto has the highest number of solo diners in Canada. Single person reservations are consistent throughout the year, however, there is a spike in the fall with October being the most popular month for solo dining. \"The significant increase of solo dining reservations over the last couple years speaks to the shifting attitude in Canada towards dining alone,\" Anna Besse, Marketing Director at OpenTable. \"Canadians are embracing solo dining and in turn, restaurants are working hard to make them feel comfortable.\"In celebration of solo diners and the restaurants that welcome them, OpenTable also released the Top 25 Restaurants for Solo Dining in Canada based on diner reviews collected between November 1, 2018 and October 31, 2019. All restaurants with a minimum \"overall\" score, number of qualifying reviews and percent of reservations from solo diners were included for consideration. Restaurants were then sorted according to the overall score. Based on this methodology, the Top 25 Restaurants for Solo Dining in Canada according to OpenTable diners are as follows (in alphabetical order):Top 25 Restaurants for Solo Dining in Canada for 2019OpenTable statistics around solo dining are based on data from January 1, 2019 to September 30, 2019. You can find the complete Top 25 Restaurants for Solo Dining in Canada for 2019 list here.About OpenTableOpenTable, part of Booking Holdings, Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.SOURCE  OpenTable, Inc."
    },
    {
        "title": "OpenTable and Capital One Partner to Give Cardholders Access to Exclusive Reservations at Top Restaurants Across the U.S.",
        "subtitle": "Premium Access reservations open up prime time weekend dining times to Capital One credit cardholders",
        "date": "Nov 19, 2019 8:30AM EST",
        "content": " SAN FRANCISCO, Nov. 19, 2019 /PRNewswire/ -- OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings Inc. (NASDAQ: BKNG), and Capital One Financial Corporation (NYSE: COF) partnered to offer Capital One credit cardholders access to hard-to-get reservations at prime dining times in more than 15 different US cities. Select sought-after restaurants on OpenTable will now allocate tables during their busiest shifts, which can be booked exclusively by Capital One credit cardholders via the OpenTable app. \"We know that coming across a 7pm Saturday night reservation at the hotspot can sometimes feel impossible. Now, there's a way to get those reservations without scouring our site or planning months in advance,\" said Debby Soo, Chief Commercial Officer, OpenTable. \"By partnering with Capital One, we're able to offer their credit cardholders Premium Access to coveted reservations all while introducing our restaurant partners to new diners.\"To book a Premium Access reservation, Capital One cardholders can take the following steps:\"We know our customers are passionate about memorable dining experiences, which is why we're excited to partner with the leader in online and mobile dining reservations, OpenTable, to bring them access to exclusive reservations on a national scale,\" said Lauren Liss, Vice President of U.S. Card at Capital One. \"Through this partnership, we're able to bring our credit cardholders hard-to-get reservations at nearly 300 restaurants in 15+ different US cities.\"With access to these exclusive reservations, Capital One cardholders can enjoy top dining destinations across the country. Examples of participating restaurants include: Boka and Girl & the Goat in Chicago, Republique, Here's Looking At You and the NoMad Restaurant in Los Angeles, Brennan's and Shaya in New Orleans, The Loyal, Daniel and La Esquina in New York City, Delfina Restaurant, International Smoke and the Slanted Door in San Francisco, Bresca and Kith/Kin in Washington D.C. and many more. \"At Kith/Kin we foster an environment for friends and family to celebrate and make memories around the table,\" said Kwame Onwuachi of Kith/Kin. \"Through this new partnership between OpenTable and Capital One, we will be able to welcome so many new people into our home.\"In January, OpenTable plans to expand Premium Access reservations to its VIP diners. Qualifying diners will be able to redeem their OpenTable Dining Points to book prime time reservations at participating restaurants. Capital One credit cardholders will continue to enjoy access to Premium Access reservations without needing to redeem any OpenTable Dining Points to book.\"We are excited to participate in this program and introduce our restaurant to new diners through Capital One,\" said Jason Berry of Succotash and Mi Vida restaurants. \"We love opening our doors to new diners who experience our restaurants for the first time - and who will hopefully visit again soon.\" To learn more about the partnership, participating restaurants, rules and eligibility please go here. For restaurants interested in joining the program, please contact your account manager.About OpenTableOpenTable, OpenTable, part of Booking Holdings Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.About Capital OneAt Capital One we're on a mission for our customers – bringing them great products, rewards, service, and access to unique and unforgettable experiences they are passionate about. Capital One is a diversified bank that offers products and services to individuals, small businesses and commercial clients. We use technology, innovation and interaction to provide consumers with products and services to meet their needs. Learn more at capitalone.com/access  View original content to download multimedia:http://www.prnewswire.com/news-releases/opentable-and-capital-one-partner-to-give-cardholders-access-to-exclusive-reservations-at-top-restaurants-across-the-us-300960668.htmlSOURCE  OpenTable, Inc."
    },
    {
        "title": "Are Americans Starting to Ditch the Kitchen? New Survey from OpenTable Reveals Why Cooking is Becoming a Thing of the Past",
        "subtitle": "More and more Americans are dining out and turning to delivery due to burn out and for convenience",
        "date": "Nov 14, 2019 8:30AM EST",
        "content": "SAN FRANCISCO, Nov. 14, 2019 /PRNewswire/ -- OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings Inc. (NASDAQ: BKNG), today released new survey findings highlighting delivery habits and revealing a growing appetite for convenience. In tandem, OpenTable also announced a new partnership with Postmates, the #1 on-demand delivery platform in Los Angeles and the Southwest, to bring even more delivery and pick-up options to diners on its iOS and Android apps. According to a recent survey commissioned by OpenTable, Americans are starting to break up with their kitchens with 41 percent dining out at least once a week and nearly one third considering delivery to be a top alternative. Six out of 10 (62 percent) respondents choose to order delivery because they like eating in the comfort of their own home, with 59 percent sharing that it's often due to feeling burned out after a long day. Still, 42 percent say they actually plate their delivery meals with real silverware and plates to closely replicate the restaurant dining experience. For additional survey data on what Americans are getting delivered, where and how they are eating it and more, please visit the OpenTable blog. \"Since launching delivery options in July, we continue to hear how comfort and convenience are sometimes the priority for our diners along with top-notch, restaurant quality meals,\" said Joseph Essas, Chief Technology Officer at OpenTable. \"Our goal is to make OpenTable the go-to app for all dining occasions, and expanding our delivery capabilities with Postmates is one way we're addressing those priorities.\"Postmates serves more than 75% of US households and joins Caviar, Grubhub and Uber Eats as the newest partner to offer delivery and pick-up options on OpenTable. Combined, these partners power delivery for nearly 10,000 restaurants in North America on the OpenTable app. In addition, the OpenTable iOS app now shows estimated delivery times for each provider, giving diners an even more comprehensive look at their dining options.\"Postmates' mission is to enable anyone to have anything delivered on-demand,\" said Vivek Patel, Postmates COO. \"Through this partnership, we're excited to bring this mission to OpenTable's network of diners and bring new customers to the thousands of restaurants on our platform that are found on OpenTable.\" To learn more about OpenTable's expanded delivery offerings, how diners can create the restaurant experience at home through tips and Spotify playlists and more, please go here.  *Methodology:This survey was conducted using the online survey platform Pollfish, and compiled by DKC Analytics. The sample of 2,000 adults (18 years or older) in the United States was surveyed on September 8, 2019.About OpenTableOpenTable, part of Booking Holdings Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 54,000 restaurants globally using its software to seat over 131 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.About PostmatesPostmates enables you to get anything you want on-demand. Launched in 2011, Postmates led the creation of on-demand delivery in the U.S and has grown to be the #1 platform in Los Angeles, amongst other markets and has the most merchant selection in the country, including hundreds of exclusive LA merchants such as Sugarfish, Salt + Straw, Trejos Tacos and The Coffee Bean and Tea Leaf. The company now operates in more than 3,500 cities across the U.S. and Mexico, provides access to over 500,000 merchants and has recently launched innovative new products including Postmates Party. Postmates is headquartered in San Francisco and has more than 1,000 employees. Learn more: www.postmates.com.    View original content to download multimedia:http://www.prnewswire.com/news-releases/are-americans-starting-to-ditch-the-kitchen-new-survey-from-opentable-reveals-why-cooking-is-becoming-a-thing-of-the-past-300958253.htmlSOURCE  OpenTable"
    },
    {
        "title": "Booking Holdings to Make Third Quarter Earnings Press Release Available on Company's Investor Relations Website on Thursday, November 7",
        "subtitle": "",
        "date": "Nov 6, 2019 11:32AM EST",
        "content": "NORWALK, Conn., Nov. 6, 2019 /PRNewswire/ -- Third quarter 2019 financial results for Booking Holdings (NASDAQ: BKNG) will be made available at approximately 4:00 p.m. ET on Thursday, November 7, through a press release posted to the company's Investor Relations website: http://ir.bookingholdings.com.Booking Holdings intends to hold a conference call on Thursday, November 7 at 4:30 p.m. ET to discuss its third quarter financial results. The event will be webcasted at http://ir.bookingholdings.com. Audio replays will be available on the website for seven days thereafter.About Booking HoldingsBooking Holdings (NASDAQ: BKNG) is the world leader in online travel and related services, provided to customers and partners in over 230 countries and territories through six primary brands - Booking.com, KAYAK, priceline.com, agoda.com, Rentalcars.com and OpenTable. The mission of Booking Holdings is to help people experience the world. For more information, visit Bookingholdings.com. View original content:http://www.prnewswire.com/news-releases/booking-holdings-to-make-third-quarter-earnings-press-release-available-on-companys-investor-relations-website-on-thursday-november-7-300953005.htmlSOURCE  Booking Holdings"
    },
    {
        "title": "New KAYAK Guides Help You Find Your One in a Billion Trip",
        "subtitle": "Users Can Now Create and Share Customized Itineraries Based on Interests and Passion Points",
        "date": "Nov 5, 2019 1:00PM EST",
        "content": "STAMFORD, Conn., Nov. 5, 2019 /PRNewswire/ -- You've picked your destination, booked your flights and have your calendar marked. But then comes the most daunting task of all: mapping out your perfect itinerary. A simple Internet search yields thousands of results, and everyone and their editor has an opinion on the hottest restaurants in-town, coolest bars and must-see attractions. In New York City alone, there are 26K+ restaurants and bars, 600+ hotels and 100s of top attractions.When there are literally endless options, the best way to find the right ones is a recommendation from someone you know and trust. KAYAK Guides is a new feature that allows users to create and share personalized travel itineraries with friends, family and fellow travelers. With KAYAK Guides, you can:Guides bring destinations to life through different perspectives. Your Grandpa's Guide to NYC looks a lot different than your tween sister's Guide. To launch the new feature, KAYAK rounded up iconic unique perspectives of New York City, its most searched for destination this fall. Introducing… \"We wanted to make personalizing your travel recommendations more visual and interactive, so we built our own solution: KAYAK Guides,\" said Vanessa Kafka, KAYAK's VP of Product. \"This is only the beginning for Guides - in the near future, travelers will be able to search within Guides for specific locations, themes and more.\"Visit KAYAK.com, create a user profile and head to \"Your Guides\" to start building your KAYAK Guide and then share it with your friends and family. About KAYAK KAYAK, part of Booking Holdings (NASDAQ:  BKNG), is the world's leading travel search engine. With more than two billion queries across our websites and apps a year, we help people find the perfect flight, hotel, rental car, cruise, or vacation package. For more information, visit www.KAYAK.com. Contact: Jackie Miller, jhafner@golin.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/new-kayak-guides-help-you-find-your-one-in-a-billion-trip-300952032.htmlSOURCE  KAYAK"
    },
    {
        "title": "Booking Holdings to Present at the 2019 RBC Capital Markets Technology, Internet, Media and Telecommunications Conference",
        "subtitle": "",
        "date": "Nov 4, 2019 10:47AM EST",
        "content": "NORWALK, Conn., Nov. 4, 2019 /PRNewswire/ -- Booking Holdings (NASDAQ: BKNG) announced today that Chief Executive Officer, Glenn Fogel, will speak at the 2019 RBC Capital Markets Technology, Internet, Media and Telecommunications Conference in New York City on Tuesday, November 19, 2019 beginning at 11:30 a.m. EST. A live audio cast of the presentation will be available to the public at http://ir.bookingholdings.com. A replay will be available for 14 days. About Booking HoldingsBooking Holdings (NASDAQ: BKNG) is the world leader in online travel and related services, provided to customers and partners in over 230 countries and territories through six primary brands Booking.com, KAYAK, priceline.com, agoda.com, Rentalcars.com and OpenTable. The mission of Booking Holdings is to help people experience the world. For more information, visit www.bookingholdings.com. View original content:http://www.prnewswire.com/news-releases/booking-holdings-to-present-at-the-2019-rbc-capital-markets-technology-internet-media-and-telecommunications-conference-300950804.htmlSOURCE  Booking Holdings"
    },
    {
        "title": "OpenTable Releases New Features to Help Restaurants Maximize Table Availability",
        "subtitle": "New Turn and Flow Controls Help Restaurants Keep Their Dining Rooms on Schedule",
        "date": "Oct 30, 2019 8:30AM EDT",
        "content": "SAN FRANCISCO, Oct. 30, 2019 /PRNewswire/ -- OpenTable, the world's leading provider of online restaurant reservations and part of Booking Holdings, Inc. (NASDAQ: BKNG), announced new features designed to address one of the biggest challenges for restaurants and managers: control over table turns. According to OpenTable, the time that a restaurant expects a table to be occupied can vary from 45 minutes to 4 hours making it difficult for floor managers to optimize their seating.  \"Controlling the pace of the dining room - how often tables turn over and when to fill them again - has significant financial impact for restaurants,\" said Jon Morin, OpenTable's VP of Product Management. \"We've designed two new features that react to incoming reservations in real time and which adapt to operating goals. 70 percent of our most popular restaurants use these turn and flow controls to run and grow their business.\"Flexible turn controls allow restaurateurs and their staff to define a minimum number of times a table will turn over by party size or table and only offer booking times that help reach that goal. Customizable flow controls assist with pacing tables to help the kitchen from getting backed up and keep staff's heads above water when the restaurant is at its busiest. Restaurant management can set these features, and then forget them. This frees up time to focus on guests, while the features do the hard work on their behalf. \"We've really enjoyed testing and experimenting with OpenTable's new controls,\" said Jonás J. Millán, Restaurateur and Owner of the Juvia Group. \"The turn controls keeps moving, adjusting and adapting to how reservations come in. The feature gives you the power to control and increase your capacity in a controlled environment without jeopardizing the flow of the dining room.\"Restaurant groups can find out more about the turn and flow control features by visiting the OpenTable Open for Business blog here.About OpenTableOpenTable, part of Booking Holdings, Inc. (NASDAQ: BKNG), is the world's leading provider of online restaurant reservations, with more than 52,000 restaurants globally using its software to seat over 128 million diners monthly. OpenTable helps diners discover and book the perfect table and helps restaurants deliver personalized hospitality to grow their business.  View original content to download multimedia:http://www.prnewswire.com/news-releases/opentable-releases-new-features-to-help-restaurants-maximize-table-availability-300947901.htmlSOURCE  OpenTable"
    }
]