[
    {
        "title": "BioMarin Announces Fourth Quarter and Record Full-year 2019 Financial Results",
        "subtitle": "",
        "date": "Feb 26, 2020 4:05PM EST",
        "content": ""
    },
    {
        "title": "BioMarin's Biologics License Application for Valoctocogene Roxaparvovec Accepted for Priority Review by FDA with Review Action Date of August 21, 2020",
        "subtitle": "",
        "date": "Feb 20, 2020 4:05PM EST",
        "content": "SAN RAFAEL, Calif., Feb. 20, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (Nasdaq: BMRN) today announced that the U.S. Food and Drug Administration (FDA) has accepted for Priority Review the Biologics License Application (BLA) to the FDA for its investigational AAV5 gene therapy, valoctocogene roxaparvovec, for adults with hemophilia A.  This acceptance by the FDA marks the first marketing application accepted for a gene therapy product for any type of hemophilia in the United States.  The FDA has granted priority review designation to valoctocogene roxaparvovec, which is granted to drugs that treat a serious condition and, if approved, would provide a significant improvement in safety or effectiveness of the treatment, prevention, or diagnosis of a serious condition. The Prescription Drug User Fee Act (PDUFA) action date is August 21, 2020.   The FDA has informed the company that they are not currently planning to hold an advisory committee meeting to discuss the application.  The application is based on a Phase 3 interim analysis of study participants treated with investigational product manufactured by the to-be-commercialized process and three-year Phase 1/2 data.  BioMarin has constructed, commissioned, and validated one of the first gene therapy manufacturing facilities of its kind in the world.  This award-winning facility is located in Novato, California. Marketing authorization documentation has been included in the applications, and the facility is ready for inspection to support approval.  In addition, the FDA has accepted the premarket approval (PMA) application for an AAV5 total antibody assay intended as a companion diagnostic test for valoctocogene roxaparvovec.  With a low prevalence of pre-existing immunity to AAV5, BioMarin estimates that approximately 80% of people with hemophilia A in the US do not have preexisting immunity to AAV5 that would make them ineligible for AAV5-mediated gene therapy treatment.  The assay is produced by ARUP Laboratories, a leading national reference laboratory and a nonprofit enterprise of the University of Utah and its Department of Pathology.\"Valoctocogene roxaparvovec has the potential to be the first gene therapy approved in any type of hemophilia and the acceptance of this application and its priority review status marks a significant milestone for gene therapies in general and for the hemophilia community specifically,\" said Hank Fuchs, M.D., President, Global Research and Development at BioMarin.  \"We recognize the decades of scientific research that has allowed us to reach this stage of development.  As pioneers in gene therapy, we are proud of the medical and technological innovation represented in valoctocogene roxaparvovec, which is possible because of the scientists who did the early research, clinical investigators, the hemophilia community and the people who work here.  We look forward to working with the FDA to bring this groundbreaking therapy to people with hemophilia A.\"\"The hemophilia community has been waiting for decades for gene therapies.  The FDA acceptance of the filing and initiation of review for the first gene therapy for hemophilia A builds on years of scientific achievements in improving the standard of care for people with bleeding disorders,\" said Doris V. Quon M.D., Medical Director, Orthopaedic Hemophilia Treatment Center at The Orthopaedic Institute for Children.  \"As a treating physician, I look forward to the possibility of having more treatment options for people with hemophilia.\" Regulatory Status in the U.S. and EuropeThe FDA has granted valoctocogene roxaparvovec Breakthrough Therapy designation.  Valoctocogene roxaparvovec has Orphan Drug designation from the FDA and the European Medicines Agency (EMA).  The EMA validated the Company's Marketing Authorization Application (MAA) for its investigational gene therapy, valoctocogene roxaparvovec, for adults with severe hemophilia A.  The MAA review commenced in January 2020 under accelerated assessment. Recognizing valoctocogene roxaparvovec for its potential to benefit patients with unmet medical needs, EMA granted access to its Priority Medicines (PRIME) regulatory initiative in 2017 and recently granted BioMarin's request for accelerated assessment of this MAA, potentially shortening the review period. This submission marks the first marketing application under review in Europe for a gene therapy product for any type of hemophilia. Companion DiagnosticThe companion diagnostic is an AAV5 total antibody assay, which consists of a simple blood test to help identify patients most likely to respond to AAV5-based gene therapy. BioMarin implemented the test in multiple clinical studies evaluating valoctocogene roxaparvovec treatment of hemophilia A patients without antibodies to AAV5.BioMarin partnered with ARUP, a laboratory with 35 years of experience supporting hospitals, physicians, and patients with unparalleled quality and service including two prior FDA companion diagnostic approvals, to develop this test. ARUP's experience in developing FDA-approved, single-source companion diagnostic tests is unique among reference laboratories.\"We are delighted to have partnered with BioMarin on its hemophilia A gene therapy program,\" said ARUP CEO Sherrie Perkins, MD, PhD. \"Working with BioMarin on the simultaneous submission of the diagnostic and gene therapy applications aligns with our corporate commitment to providing outstanding patient care through cutting-edge diagnostic testing.\" About Hemophilia APeople living with hemophilia A lack enough functioning Factor VIII protein to help their blood clot and are at risk for painful and/or potentially life-threatening bleeds from even modest injuries.  Additionally, people with the most severe form of hemophilia A often experience painful, spontaneous bleeds into their muscles or joints.  Individuals with the most severe form of hemophilia A make up approximately 43 percent of the hemophilia A population.  The standard of care for such individuals with hemophilia A is a prophylactic regimen of replacement Factor VIII infusions administered intravenously up to two to three times per week or 100 to 150 infusions per year.  Despite these regimens, many people continue to experience bleeds, resulting in progressive and debilitating joint damage, which can have a major impact on their quality of life.  Hemophilia A, also called Factor VIII deficiency or classic hemophilia, is an X-linked genetic disorder caused by missing or defective Factor VIII, a clotting protein. Although it is passed down from parents to children, about 1/3 of cases are caused by a spontaneous mutation, a new mutation that was not inherited. Approximately 1 in 10,000 people have Hemophilia A. About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for serious and life-threatening rare genetic diseases. The Company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.About ARUP Laboratories Founded in 1984, ARUP Laboratories is a leading national reference laboratory and a nonprofit enterprise of the University of Utah and its Department of Pathology. ARUP offers more than 3,000 tests and test combinations, ranging from routine screening tests to esoteric molecular and genetic assays. ARUP serves clients across the United States, including many of the nation's top university teaching hospitals and children's hospitals, as well as multihospital groups, major commercial laboratories, group purchasing organizations, military and other government facilities, and major clinics. In addition, ARUP is a worldwide leader in innovative laboratory research and development, led by the efforts of the ARUP Institute for Clinical and Experimental Pathology®.Forward Looking Statement This press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc. (BioMarin), including without limitation, statements about development of BioMarin's valoctocogene roxaparvovec program generally and; the timing of the company's regulatory submissions in the U.S and Europe, including validation and timing of potential approvals, the expected review procedures, and the timing of the FDA's acceptance of the premarket approval application for an AAV5 total antibody assay intended as a companion diagnostic test produced by ARUP Laboratories.  These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: results and timing of current and planned preclinical studies and clinical trials of valoctocogene roxaparvovec; additional data from the continuation of the Phase 1/2 trial and the Phase 3 trial, any potential adverse events observed in the continuing monitoring of the participants in the clinical trials; the content and timing of decisions by the FDA, the European Commission and other regulatory authorities; the content and timing of decisions by local and central ethics committees regarding the clinical trials; our ability to successfully manufacture valoctocogene roxaparvovec for the clinical trials and commercially, if approved; and those other risks detailed from time to time under the caption \"Risk Factors\" and elsewhere in BioMarin's Securities and Exchange Commission (SEC) filings, including BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and future filings and reports by BioMarin. BioMarin undertakes no duty or obligation to update any forward-looking statements contained in this press release as a result of new information, future events or changes in its expectations.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarins-biologics-license-application-for-valoctocogene-roxaparvovec-accepted-for-priority-review-by-fda-with-review-action-date-of-august-21-2020-301008771.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Participate in Two Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Feb 12, 2020 8:30AM EST",
        "content": "SAN RAFAEL, Calif., Feb. 12, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that management will participate in the 9th Annual Leerink Partners Global Healthcare Conference on February 26, 2020 at 10:00am ET in New York City and the Cowen and Company 40th Annual Health Care Conference on March 3, 2020 at 10:40am ET in Boston.  To access the events that are accessible by live webcasts, please visit the investor section of the BioMarin website, www.biomarin.com. A replay will also be archived on the site for at least one week following each event.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.  For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-participate-in-two-upcoming-investor-conferences-301003320.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin Announces CFO Succession",
        "subtitle": "",
        "date": "Feb 3, 2020 4:30PM EST",
        "content": "SAN RAFAEL, Calif., Feb. 3, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN), today announced the transition of Executive Vice President and Chief Financial Officer Dan Spiegelman.  Mr. Spiegelman will remain as an employee and senior advisor until September 1, 2020 to assist with the transition.  After that, he plans to pursue other interests and spend more time with family.  Brian R. Mueller, Senior Vice President, Finance and Chief Accounting Officer, has assumed the role of acting Chief Financial Officer.  The Company is initiating an internal and external search for the role of Chief Financial Officer.\"On behalf of the entire Board and executive team, I would like to thank Dan for his important contributions and leadership during his tenure at the company.  Over the last seven and a half years, he has played an invaluable role in supporting the company's growth,\"  said Jean-Jaques Bienaimé, Chairman and Chief Executive Officer.  \"I am confident that Brian in the acting CFO role will help us build on the strong foundation established and seamlessly execute on our business strategies. A veteran at BioMarin with 17 years of experience at the company, Brian has a deep knowledge of our business and throughout his career here has been essential in laying the ground work for BioMarin's continued long-term success.\"  Mr. Mueller has been with BioMarin since December 2002, during which time he has taken on roles of increasing responsibility.  He has served as the Chief Accounting Officer since March 2011. Prior to that, Mr. Mueller served as Group Vice President, Corporate Controller. Mr. Mueller is a member of the board of directors and the Chairman of the Audit Committee of Anthera Pharmaceuticals, Inc.  Before joining BioMarin, Mr. Mueller worked for KPMG as a senior manager in the firm's audit practice. Previously, he spent seven years with Arthur Andersen LLP in the firm's audit and business advisory services practice. BioMarin confirmed that it remains on track to report fourth quarter and full year 2019 financial results on February 26, 2020 and to file its annual report on Form 10-K shortly thereafter.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on such website is not incorporated by reference into this press release.Forward-Looking Statement  This press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc. (BioMarin), including, without limitation, statements about: Mr. Spiegelman's continued employment, the Company's expectations for a permanent Chief Financial Officer, the Company's ability to seamlessly execute on its business strategies and its 2019 year end financial reporting. These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: the availability of internal and external candidates, the final completion of the year end close process; and those factors detailed in BioMarin's filings with the Securities and Exchange Commission (SEC), including, without limitation, the factors contained under the caption \"Risk Factors\" in BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 as such factors may be updated by any subsequent reports. Stockholders are urged not to place undue reliance on forward-looking statements, which speak only as of the date hereof. BioMarin is under no obligation, and expressly disclaims any obligation to update or alter any forward-looking statement, whether as a result of new information, future events or otherwise.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-announces-cfo-succession-300997982.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Host Fourth Quarter and Full Year 2019 Financial Results Conference Call and Webcast on Wednesday, February 26 at 4:30pm ET",
        "subtitle": "",
        "date": "Jan 29, 2020 8:30AM EST",
        "content": "SAN RAFAEL, Calif., Jan. 29, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that Jean-Jacques Bienaimé, Chairman and Chief Executive Officer of BioMarin, will host a conference call and webcast on Wednesday, February 26, at 4:30 p.m. ET to discuss fourth quarter and full year 2019 financial results and provide a general business update.Dial-in Number U.S. / Canada Dial-in Number: (866) 502-9859International Dial-in Number: (574) 990-1362Conference ID: 9967337Replay Dial-in Number: (855) 859-2056Replay International Dial-in Number: (404) 537-3406Conference ID: 9967337Interested parties may access a live audio webcast of the conference call via the investor section of the BioMarin website, www.biomarin.com. A replay of the call will be archived on the site for one week following the call.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.   View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-host-fourth-quarter-and-full-year-2019-financial-results-conference-call-and-webcast-on-wednesday-february-26-at-430pm-et-300995093.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin, Pioneer in Phenylketonuria, to Begin Clinical Trial with BMN 307 Gene Therapy",
        "subtitle": "Health Authorities in the U.S. and U.K. Clear Path to Start of Clinical Trial, Patients Expected to be Dosed in Q1 2020 with Commercial Scale Material",
        "date": "Jan 13, 2020 8:29AM EST",
        "content": "SAN RAFAEL, Calif., Jan. 13, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN), a pioneer in treatments for the rare disease Phenylketonuria (PKU) and in gene therapy clinical research, announced today that both the U.S. Food and Drug Administration (FDA) and the Medicines and Healthcare Products Regulatory Agency (MHRA) in the U.K. have granted the Company Investigational New Drug (IND) status and approved its Clinical Trial Application (CTA), respectively, for its investigational gene therapy candidate BMN 307.  BMN 307 is an AAV5-phenylalanine hydroxylase (PAH) gene therapy designed to normalize blood phenylalanine (Phe) concentration levels in patients with PKU. BMN 307 will be evaluated to determine whether a single dose of treatment can restore natural Phe metabolism, normalize plasma Phe levels, and enable a normal diet in patients with PKU.  The Company expects to start dosing patients in PHEARLESS, a Phase 1/2 study, in the first quarter of 2020 with product made at commercial scale from its award-winning gene therapy manufacturing facility.  The Company is actively preparing regulatory submissions to open additional clinical sites in other countries. BMN 307 represents a potential third PKU treatment option from BioMarin and its second gene therapy clinical program.  Both the FDA and European Medicines Agency have granted BMN 307 Orphan Status.BMN 307 follows BioMarin's first investigational gene therapy clinical program: valoctocogene roxaparvovec to treat severe hemophilia A, currently in Phase 3. Based on data from an interim analysis of the ongoing Phase 3 study, the European Medicines Agency validated a Marketing Authorization Application in the EU for valoctocogene roxaparvovec, and the review process has begun.  The Company also has submitted a Biologics License Application to the FDA and anticipates the review to begin in February 2020.  \"With BMN 307, we are joining together our expertise in PKU biology and the knowledge we have gained from developing the only two approved therapies for PKU with our understanding of gene therapy clinical development and manufacturing from our valoctocogene roxaparvovec experience,\"  said Hank Fuchs, President, Worldwide Research and Development at BioMarin. \"BioMarin has stood with the PKU community for over 15 years and remains dedicated to continuing to increase the body of medical knowledge in this devastating disease.\"PKU is a rare genetic disease that manifests at birth and is marked by an inability to break down Phe, an amino acid that is commonly found in many foods. Left untreated, high levels of Phe become toxic to the brain and may lead to serious neurological and neuropsychological issues, affecting the way a person thinks, feels, and acts. Due to the seriousness of these symptoms, in many countries infants are screened at birth to ensure early diagnosis and treatment to avoid intellectual disability and other complications. According to treatment guidelines, PKU patients should maintain lifelong control of their Phe levels.BMN 307 Clinical ProgramBioMarin's clinical program is composed of two key studies. PHEARLESS, a Phase 1/2 study, will evaluate the safety, efficacy, and tolerability of a single intravenous administration of BMN 307 in patients with PKU.  The study consists of a dose-escalation phase, followed by a cohort expansion phase once an initially efficacious dose has been demonstrated.  In addition, BioMarin is sponsoring an observational study, PHENOM, which has already started enrolling patients with PKU to measure both established and new markers of disease and clinical outcomes over time.BioMarin's 15-Plus Year Commitment to PKU ResearchFor more than 15 years, BioMarin has been a pioneer in ongoing research to help improve the lives of PKU patients.  BioMarin has treated approximately 7,000 PKU patients around the world.  The company has two approved PKU therapies, and the investigational gene therapy BMN 307 is currently in development.  BioMarin has conducted 40 clinical studies in PKU and has sponsored 38 external clinical studies.  BioMarin researchers have authored 54 publications in medical and scientific journals on PKU and supported another 52 publications by external researchers.About Gene TherapyGene therapy is a form of treatment designed to address a genetic problem by adding a normal copy of the defective gene. The functional gene is inserted into a vector containing a small DNA sequence that acts as a delivery mechanism, providing the ability to deliver the functional gene to targeted cells. The cells can then use the information from the normal gene to build the functional proteins that the body needs, potentially reducing or eliminating the cause of the disease.Gene Therapy ManufacturingBioMarin has leveraged its knowledge and experience in manufacturing complex biological products to design, construct and validate a state-of-the-art vector production facility in Novato, California.  This facility is the site of production for both valoctocogene roxaparvovec and BMN 307. Manufacturing capabilities are an essential driver for our gene therapy programs and allows us to control quality, capacity, costs and scheduling enabling rapid development. Manufacture of BMN 307 was performed with a commercial ready process at scale in this facility.  Production of BMN 307 with a commercial ready process at scale reduces risk associated with making process changes later in development and will speed overall development timelines significantly.Ongoing process development efforts and experience gained at commercial scale have led to improvements in productivity and operational efficiency.  The ability to scale out the facility with additional equipment combined with the improvements in productivity result in a doubling of overall potential capacity to 10,000 doses per year, combined for both products, depending on final dose and product mix. This improvement in productivity is anticipated to meet both commercial and clinical demand for both valoctocogene roxaparvovec and BMN 307 well in to the future.  About PhenylketonuriaPKU, or PAH deficiency, is a genetic disorder affecting approximately 50,000 diagnosed patients in the regions of the world where BioMarin operates and is caused by a deficiency of the enzyme PAH. This enzyme is required for the metabolism of Phe, an essential amino acid found in most protein-containing foods. If the active enzyme is not present in sufficient quantities, Phe accumulates to abnormally high levels in the blood and becomes toxic to the brain, resulting in a variety of complications including severe intellectual disability, seizures, tremors, behavioral problems and psychiatric symptoms. As a result of newborn screening efforts implemented in the 1960s and early 1970s, virtually all individuals with PKU under the age of 40 in countries with newborn screening programs are diagnosed at birth and treatment is implemented soon after. PKU can be managed with a Phe-restricted diet, which is supplemented by low-protein modified foods and Phe-free medical foods; however, it is difficult for most patients to adhere to the life-long strict diet to the extent needed to achieve adequate control of blood Phe levels.  Dietary control of Phe in childhood can prevent major developmental neurological toxicities, but poor control of Phe in adolescence and adulthood is associated with a range of neurocognitive disabilities with significant functional impact.To learn more about PKU and PAH deficiency, please visit www.PKU.com. Information on this website is not incorporated by reference into this press release.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on such website is not incorporated by reference into this press release.Forward-Looking StatementThis press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc. (BioMarin), including, without limitation, statements about: the development of BioMarin's BMN 307 program generally, BioMarin's planned submissions to regulatory authorities for BMN 307, BioMarin's gene therapy manufacturing capabilities, the impact of using material manufactured at commercial scale in a clinical trial, the timing and results of BioMarin's planned Phase 1/2 trial of BMN 307, and the review of marketing applications for valoctocogene roxaparvovec. These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: results and timing of current and planned preclinical studies and clinical trials of BMN 307; the content and timing of decisions by the U.S. Food and Drug Administration, the European Commission and other regulatory authorities; uncertainties inherent in research and development, including unfavorable new clinical data and additional analyses of existing clinical data; the results and timing of current and future clinical trials related to BMN 307; our ability to reproducibly and consistently manufacture sufficient quantities of BMN 307, the possibility that changes may be required to the current manufacturing process; and those factors detailed in BioMarin's filings with the Securities and Exchange Commission (SEC), including, without limitation, the factors contained under the caption \"Risk Factors\" in BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 as such factors may be updated by any subsequent reports. Stockholders are urged not to place undue reliance on forward-looking statements, which speak only as of the date hereof. BioMarin is under no obligation, and expressly disclaims any obligation to update or alter any forward-looking statement, whether as a result of new information, future events or otherwise.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.                                                         View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-pioneer-in-phenylketonuria-to-begin-clinical-trial-with-bmn-307-gene-therapy-300985322.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Participate in Goldman Sachs 12th Annual Healthcare CEOs Unscripted: A View from the Top on January 9, 2020 in New York",
        "subtitle": "",
        "date": "Jan 8, 2020 8:30AM EST",
        "content": " SAN RAFAEL, Calif., Jan. 8, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that Jean-Jacques Bienaimé, Chairman and Chief Executive Officer, will present at Goldman Sachs 12th Annual Healthcare CEOs Unscripted: A View from the Top on January 9, 2020 at 8:45am ET in New York.  To access the live webcast, please visit the investor section of the BioMarin website, www.biomarin.com. A replay will also be archived on the site for at least one week following each event.About BioMarin BioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.   For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-participate-in-goldman-sachs-12th-annual-healthcare-ceos-unscripted-a-view-from-the-top-on-january-9-2020-in-new-york-300983241.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "Behind the Seizure® Program Further Expands Access to Genetic Testing for Children to Speed the Diagnosis of Genetic Epilepsy",
        "subtitle": "-- Biogen, Encoded Therapeutics, Neurogene, Praxis Precision Medicines and PTC Therapeutics join founders BioMarin and Invitae to expand access for children under eight --",
        "date": "Jan 8, 2020 7:30AM EST",
        "content": "SAN FRANCISCO, Jan. 8, 2020 /PRNewswire/ -- Today BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) and Invitae Corporation (NYSE: NVTA) announced that Biogen (NASDAQ: BIIB), Encoded Therapeutics, Neurogene, Praxis Precision Medicines and PTC Therapeutics joined Behind the Seizure®, an innovative, cross-company collaboration that aims to provide faster diagnosis for young children with epilepsy. The program will also be expanded to make no-charge testing available for healthcare providers to order for any child under the age of eight who has an unprovoked seizure. \"Behind the Seizure is one of the longest-running cross-company collaborations aimed at increasing access to genetic testing. It has been shown to decrease time to diagnosis for children experiencing unprovoked seizures by one to two years from reported averages, and as more companies have joined the program, more children have been helped,\" said Robert Nussbaum, chief medical officer of Invitae. \"Earlier diagnosis enables clinicians to focus on providing disease-specific care sooner, which is particularly important in neurodegenerative diseases. We applaud these companies for their commitment to expanding this unique effort to help children.\"Previously the program was available to children under age five. The newest companies to join Behind the Seizure include:Behind the Seizure is supported by eight sponsors in all, including Stoke Therapeutics and Xenon Pharmaceuticals who joined in 2019.Since the program began, thousands of children have received genetic testing through Behind the Seizure and research has shown that participants in the program were diagnosed one to two years sooner than historic averages.1 Companies that participate in the program sponsor the cost of testing using the Invitae Epilepsy Panel, which includes more than 180 genes associated with both syndromic and non-syndromic causes of epilepsy, including neurodegenerative conditions. With the expansion of the program, healthcare providers now can order the test for patients under the age of eight with unprovoked seizures. Test results are available quickly (14 days on average). More than half of epilepsies are based in genetics. When a child presents with seizures, genetic testing can help identify more than 100 underlying, often rare conditions. Early genetic testing may be the most cost-effective, direct and accurate diagnostic tool for children, shortening years-long diagnostic odysseys. Delays in diagnosis can be devastating for children, as some genetic epilepsies are neurodegenerative and early symptoms may be subtle and easy to misdiagnose. Participating companies provide financial support for this program, which includes testing and services performed by Invitae. Healthcare professionals must confirm that patients meet certain criteria to use the program. Third parties and commercial organizations may receive de-identified patient data and contact information for healthcare providers who use this program, but at no time do they receive patient identifiable information. Genetic testing and counseling are available in the US and Canada. Healthcare professionals and patients who participate in this program have no obligation to recommend, purchase, order, prescribe, promote, administer, use or support any other products or services from Invitae or from third parties or commercial organizations.About Behind the Seizure®Behind the Seizure is an innovative, cross-company collaboration designed to increase access to genetic testing for children who experience unprovoked seizures in childhood in the United States and Canada. More than half of epilepsies have some genetic basis, and are often associated with rare, neurodegenerative conditions with non-specific symptoms. Early genetic testing may be the most direct, cost-effective, and accurate diagnostic tool. Participants in the Behind the Seizure program are diagnosed one to two years sooner than reported averages. The program was established by BioMarin and Invitae and now includes: Biogen, Encoded Therapeutics, Neurogene Inc., Praxis Precision Medicines, PTC Therapeutics, Stoke Therapeutics and Xenon Pharmaceuticals. To learn more about the Behind the Seizure program please visit https://www.invitae.com/en/behindtheseizure/.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com.About InvitaeInvitae Corporation (NYSE: NVTA) is a leading genetics company whose mission is to bring comprehensive genetic information into mainstream medicine to improve healthcare for billions of people. Invitae's goal is to aggregate the world's genetic tests into a single service with higher quality, faster turnaround time, and lower prices. For more information, visit the company's website at invitae.com.About Encoded TherapeuticsEncoded Therapeutics, Inc. is a biotechnology company developing precision gene therapies for a broad range of severe genetic disorders. Our mission is to realize the potential of genomics-driven precision medicine by overcoming key limitations of viral gene therapy. We focus on delivering life-changing advances that move away from disease management and towards lasting disease modification. For more information, please visit www.Encoded.com.About Neurogene Inc.Neurogene was founded to bring life-changing medicines to patients and families affected by rare neurological disorders. We partner with leading academic researchers, patient advocacy organizations and caregivers to bring to patients therapies that address the underlying genetic cause of a broad spectrum of neurological diseases where no effective treatment options exist today. Our lead programs use AAV-based gene therapy technology to deliver a normal gene to patients with a dysfunctional gene. Neurogene is also investing in novel technology to develop treatments for diseases not well served by gene therapy. For more information, visit www.neurogene.com.About Praxis Precision MedicinesPraxis Precision Medicines is a clinical-stage genetic neuroscience company developing high-impact therapies for patients and families affected by complex and debilitating brain disorders, including rare pediatric epilepsies and neuropsychiatric disorders. These two disease areas share overlapping disease biology and genetic targets, as well as a profound need for new therapeutic options that target the underlying cause of the disease. Praxis is advancing a pipeline of breakthrough medicines with the potential to more precisely treat complex brain disorders. For more information, please visit www.praxismedicines.com.About PTC TherapeuticsPTC Therapeutics is a science-driven, global biopharmaceutical company focused on the discovery, development and commercialization of clinically-differentiated medicines that provide benefits to patients with rare disorders. PTC's ability to globally commercialize products is the foundation that drives investment in a robust pipeline of transformative medicines and our mission to provide access to best-in-class treatments for patients who have an unmet medical need.About Stoke TherapeuticsStoke Therapeutics, Inc. (Nasdaq: STOK), is a biotechnology company pioneering a new way to treat the underlying causes of severe genetic diseases by precisely upregulating protein expression to restore target proteins to near normal levels. Stoke aims to develop the first precision medicine platform to target the underlying cause of a broad spectrum of genetic diseases in which the patient has one healthy copy of a gene and one mutated copy that fails to produce a protein essential to health. These diseases, in which loss of approximately 50% of normal protein expression causes disease, are called autosomal dominant haploinsufficiencies. The company's lead investigational new medicine is STK-001, a proprietary antisense oligonucleotide (ASO) that has the potential to be the first disease-modifying therapy to address the genetic cause of Dravet syndrome, a severe and progressive genetic epilepsy. Stoke is headquartered in Bedford, Massachusetts with offices in Cambridge, Massachusetts. For more information, visit https://www.stoketherapeutics.com/ or follow the company on Twitter at @StokeTx.About Xenon PharmaceuticalsXenon Pharmaceuticals is a clinical stage biopharmaceutical company committed to developing innovative therapeutics to improve the lives of patients with neurological disorders, including rare central nervous system (CNS) conditions. We are advancing a novel product pipeline of neurology therapies to address areas of high unmet medical need, with a focus on epilepsy. For more information, please visit www.xenon-pharma.com.Safe Harbor StatementsThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements relating to the benefits of genetic testing and the Behind the Seizure program, including shortening the time to diagnosis and improved treatment outcomes for patients. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially, and reported results should not be considered as an indication of future performance. These risks and uncertainties include, but are not limited to: the company's ability to use rapidly changing genetic data to interpret test results accurately and consistently; the ability of genetic testing to result in faster or more accurate diagnosis; laws and regulations applicable to the company's business; and the other risks set forth in Invitae's filings with the Securities and Exchange Commission, including the risks set forth in its Quarterly Report on Form 10-Q for the quarter ended September 30, 2019. These forward-looking statements speak only as of the date hereof, and Invitae Corporation disclaims any obligation to update these forward-looking statements.Contact:Laura D'Angelopr@invitae.com(628) 213-32831 Miller, Nicole, et al, \"Behind the Seizure: A No-Cost 125-gene Epilepsy Panel for Pediatric Seizure Onset Between 2–4 Years\". Presented at the American Society of Human Genetics Meeting: October 16–20, 2018, San Diego, CA.  View original content to download multimedia:http://www.prnewswire.com/news-releases/behind-the-seizure-program-further-expands-access-to-genetic-testing-for-children-to-speed-the-diagnosis-of-genetic-epilepsy-300983302.htmlSOURCE  Invitae Corporation"
    },
    {
        "title": "BioMarin to Present at 38th Annual J.P. Morgan Healthcare Conference in San Francisco",
        "subtitle": "",
        "date": "Jan 6, 2020 8:30AM EST",
        "content": "SAN RAFAEL, Calif., Jan. 6, 2020 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that Jean-Jacques Bienaimé, Chairman and Chief Executive Officer, will participate in the 38th Annual J.P. Morgan Healthcare Conference on Monday, January 13, 2020 at 7:30 am PT, or 10:30 am ET, in San Francisco, California. To access the live webcast, please visit the investor section of the BioMarin website, www.biomarin.com. A replay will also be archived on the site for at least one week following the event.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-present-at-38th-annual-jp-morgan-healthcare-conference-in-san-francisco-300978584.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin Announces New England Journal of Medicine Publishes 3 Years of Follow-up Data in Phase 1/2 Study of Valoctocogene Roxaparvovec Gene Therapy for Hemophilia A",
        "subtitle": "Single Dose Resulted in Sustained Mean Reduction of 96% in Bleed Rates at 6e13 vg/kg Dose in Third Year",
        "date": "Jan 2, 2020 8:31AM EST",
        "content": " SAN RAFAEL, Calif., Jan. 2, 2020 /PRNewswire/ --BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) announced today that the New England Journal of Medicine (NEJM) published an independently peer-reviewed article on up to three years of data from an ongoing Phase 1/2 study to evaluate safety and efficacy of investigational AAV gene therapy, valoctocogene roxaparvovec, for severe hemophilia A.  This is the second article published by the NEJM on valoctocogene roxaparvovec.The NEJM article, \"Multiyear Follow-up of AAV5-hFVIII-SQ Gene Therapy for Hemophilia A\", demonstrated that a single infusion of valoctocogene roxaparvovec \"resulted in sustained, clinically relevant benefit, as measured by a substantial reduction in annualized rates of bleeding events and complete cessation of prophylactic factor VIII use in all 13 participants who had received 4e13vg/kg or 6e13 vg/kg.\"  Twelve of these participants also experienced a full resolution of target joints.  Recurrent bleeding into the same joint results in a \"target joint\" and is defined as three bleeds into the same joint within a 6-month period. Bleeding into joints causes pain and ultimately results in impairment of the joint and permanent damage (hemophilic arthropathy).[i]  Resolution of a target joint is when there have been less than two bleeds into the joint within a consecutive 12‐month period.[ii]In addition to reporting safety and efficacy, the article contributes to a greater understanding of the variability observed in gene therapy studies and provides insights into mechanisms of DNA persistence and durability. The article noted that the most common adverse event was a transient elevation in alanine aminotransferase (ALT) levels with no indications of ongoing liver damage, and that no participants withdrew from the study. For additional safety data, see Safety section in press release.\"With each passing year, we come to appreciate further the transformation in patient lives that may be possible with gene therapy.  As pioneers in the field, we are proud to sponsor research that is published in leading scientific journals so that we and the scientific community can learn together about how to characterize long-term benefits and ultimately optimize patient outcomes,\" said Hank Fuchs, M.D., President, Worldwide Research and Development at BioMarin.  \"We look forward to providing a four year update at a scientific congress in the middle of this year, during which we'll also provide a third year of follow up after lower levels of expression were achieved using a lower dose.\" \"These data are critical in helping the scientific and medical communities understand this pioneering technology.  With three years of data, we know more about valoctocogene roxaparvovec than any other gene therapies in development for hemophilia A,\" said Professor John Pasi, M.B., Ch.B., Ph.D., from Barts and the London School of Medicine and Dentistry; the lead author of this NEJM publication, chief investigator for the valoctocogene roxaparvovec Phase 1/2 study, and a principal investigator for the Phase 3 study.  \"As a treating physician, I am excited about the potential of the field of gene therapy to make a meaningful difference in the lives of people with hemophilia A.\" Annualized Bleed Rates and Factor VIII Levels in the 6e13 vg/kg Dose CohortThree years after administration of valoctocogene roxaparvovec at the 6e13 vg/kg dose among the seven participants, the median number of annualized treated bleeding events was 0.  The mean annualized bleeding rate decreased by 96% from a mean (+SD) of 16.3+15.7 events per year (median, 16.5 events per year) at baseline (on prophylactic standard of care) to 0.7+1.6 events per year (median, 0.0 events per year) in year 3.  In the year before study entry, only one participant who was receiving prophylaxis was free from breakthrough bleeding events that necessitated additional Factor VIII treatment. During year 3, a total of six participants (86%) were free from bleeding events. In the first, second and third years, 71%, 86% and 86%, respectively, of study participants had zero bleeds requiring Factor VIII infusions compared to 17% who had zero bleeds requiring Factor VIII infusions in the year prior to study entry. All the participants experienced full resolution of target joints.In addition, using the chromogenic substrate (CS) assay expressed as an international unit per deciliter (IU/dL) Factor VIII levels sustained over a three-year period were sufficient to achieve hemostatic efficacy.  Factor VIII expression may have entered a plateau phase as the rate of decline has substantially slowed, which could be indicative of durable, long-term expression. At the end of the first, second and third years, post-infusion, mean Factor VIII activity level were 64, 36 and 33 IU/dL respectively.  The median Factor VIII activity levels at the end of the first, second and third years were 60, 26 and 20 IU/dL respectively.  Annualized Use of Exogenous Factor VIII in the 6e13 vg/kg Dose Cohort The median use of exogenous factor VIII at the 6e13 vg/kg dose was reduced from 138.5 infusions per year to zero infusions per year in year 3.  In the year before study entry, the mean annualized number of factor VIII infusions per participant was 136.7+22.4; at the end of year 3, the mean annualized use of exogenous factor VIII decreased by 96% to a mean of 5.5+9.4 infusions.  98% of the factor VIII infusions that occurred later than 5 weeks post-administration were reported in association with total knee-replacement surgeries in two participants, which were performed due to preexisting chronic hemophilic arthropathy.  A total of 11 treated bleeding events were reported in this cohort after week 5, with 10 of these events occurring in one participant, who had the lowest factor VIII expression after administration. Safety Summary Overall, valoctocogene roxaparvovec continues to have a favorable safety profile and has been well-tolerated by participants across all doses in the Phase 1/2 and Phase 3 studies.  No participants developed inhibitors to Factor VIII, and no participants withdrew from the study.  All participants have remained off Factor VIII prophylaxis. Corticosteroid use was transient with no long-lasting clinical sequelae.  No participants have developed thrombotic events.  The most common adverse events associated with valoctocogene roxaparvovec across studies include transient infusion associated reactions and transient, asymptomatic, and mild to moderate rise in the levels of certain proteins and enzymes measured in liver function tests. About Hemophilia APeople living with hemophilia A lack enough functioning Factor VIII protein to help their blood clot and are at risk for painful and/or potentially life-threatening bleeds from even modest injuries.  Additionally, people with the most severe form of hemophilia A often experience painful, spontaneous bleeds into their muscles or joints.  Individuals with the most severe form of hemophilia A make up approximately 43 percent of the hemophilia A population.  The standard of care for such individuals with hemophilia A is a prophylactic regimen of replacement Factor VIII infusions administered intravenously up to two to three times per week or 100 to 150 infusions per year.  Despite these regimens, many people continue to experience bleeds, resulting in progressive and debilitating joint damage, which can have a major impact on their quality of life.  Hemophilia A, also called Factor VIII deficiency or classic hemophilia, is an X-linked genetic disorder caused by missing or defective Factor VIII, a clotting protein. Although it is passed down from parents to children, about 1/3 of cases are caused by a spontaneous mutation, a new mutation that was not inherited. Approximately 1 in 10,000 people have Hemophilia A. About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.Forward Looking StatementThis press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc., including without limitation, statements about the development of BioMarin's valoctocogene roxaparvovec program generally, the impact of valoctocogene roxaparvovec gene therapy for treating patients with severe hemophilia A, the potential for valoctocogene roxaparvovec to bring Factor VIII levels to normal and to reduce or eliminate bleeds, or the planned updates of the Phase 1/2 study including the Company's plan to share four years of data from this study mid-year.  These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: results and timing of current and planned preclinical studies and clinical trials of valoctocogene roxaparvovec, including final analysis of the above interim data; any potential adverse events observed in the continuing monitoring of the patients in the Phase 1/2 trial; the content and timing of decisions by the U.S. Food and Drug Administration, the European Commission and other regulatory authorities; the content and timing of decisions by local and central ethics committees regarding the clinical trials; our ability to successfully manufacture the product candidate for the preclinical and clinical trials; and those other risks detailed from time to time under the caption \"Risk Factors\" and elsewhere in BioMarin's Securities and Exchange Commission (SEC) filings, including BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and future filings and reports by BioMarin. BioMarin undertakes no duty or obligation to update any forward-looking statements contained in this press release as a result of new information, future events or changes in its expectations.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.[i] Joint Health in Hemophilia: Latest Approaches and Advances (CME): Doris Quon, MD, PhD, Released: 2/5/2019, https://www.medscape.org/viewarticle/908267(as of 1/1/2020).[ii] Definitions in hemophilia: communication from the SSC of the ISTH V. S. Blanchette, et al for the Subcommittee on Factor VIII, Factor IX and Rare Coagulation Disorders:  24 July 2014, https://doi.org/10.1111/jth.12672 (as of 1/1/20: https://onlinelibrary.wiley.com/doi/full/10.1111/jth.12672)  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-announces-new-england-journal-of-medicine-publishes-3-years-of-follow-up-data-in-phase-12-study-of-valoctocogene-roxaparvovec-gene-therapy-for-hemophilia-a-300980377.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin Announces Positive Final Results from Placebo-Controlled Phase 3 Data in Children with Achondroplasia Treated with Vosoritide",
        "subtitle": "Placebo-adjusted Increase in Growth Velocity of 1.6 cm/yr (p<0.0001) in Children Treated with Vosoritide Over One Year",
        "date": "Dec 16, 2019 8:15AM EST",
        "content": "SAN RAFAEL, Calif., Dec. 16, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today reported positive final results from its randomized, double-blind, placebo-controlled Phase 3 study evaluating the efficacy and safety of vosoritide.  The placebo-adjusted change from baseline in growth velocity after one year of treatment with vosoritide, the primary endpoint, was 1.6 cm/yr (p<0.0001).  Vosoritide is an investigational, once daily injection analog of C-type Natriuretic Peptide (CNP).  The study enrolled 121 children aged 5 to 14 with achondroplasia, the most common form of disproportionate short stature.  The results were consistent across the broad patient population studied.  Vosoritide was generally well tolerated with no clinically significant blood pressure decreases.  Based on these results, the Company plans to meet with health authorities in the first half of 2020 to discuss plans for submitting marketing applications.  \"This is an important milestone that further reinforces our confidence in the tremendous potential of vosoritide.  The placebo-controlled study demonstrated a strong increase in growth velocity across the broad population studied,\" said Hank Fuchs, M.D., President Worldwide Research and Development at BioMarin. \"These results when combined with the long-term benefits seen in the Phase 2 study provide hope for a significant and sustained benefit for children with achondroplasia.  We appreciate the children and their families who have participated in this development program, and we look forward to discussing plans for submitting marketing applications with health authorities.  We also plan to present the detailed data from this study at an upcoming medical meeting.\"\"As a treating physician, it is exciting to see these compelling results of an investigational therapy confirming its potential to be the first medical therapy to treat the underlying cause of achondroplasia,\" said John A. Phillips, III, M.D., Vanderbilt University Medical Center (David T Karzon Professor of Pediatrics).  \"Importantly, this data adds to an increasing body of scientific data on a potential breakthrough in the treatment for achondroplasia.\" \"Growing Stronger supports medical research that has the potential to improve the quality of medical care and make a significant impact on the lives of little people,\" said Amer Haider, Founder and President of Growing Stronger. \"We are hopeful that supporting research and continuing advances in science will accelerate the development of therapeutic choices for families, where there are no medicines available today.\"  Growing Stronger's mission is to improve the quality of medical care for people through supporting research. The organization raises nonprofit donations that are granted to researchers focused on dwarfism.Description of Phase 3 Study The global Phase 3 study is a randomized, double-blind, placebo-controlled study of vosoritide in 121 children with achondroplasia aged 5 to 14 for 52 weeks. (The enrollment age criteria is 5 to 18 per the study protocol.) Vosoritide is being tested in children whose growth plates are still open. This is approximately 25% of people with achondroplasia.  Children in this study have completed a minimum six-month baseline study to determine their respective baseline growth velocity prior to entering the Phase 3 study.  The primary endpoint of the study is the change in growth velocity from baseline over one year in children treated with vosoritide compared to placebo.   A wide range of secondary and exploratory endpoints include anthropometric measures such as height Z-score, body and limb proportionality and joint geometry; biochemical, biomarker and radiological assessments of bone growth and health; and evaluations of health-related quality of life (HRQoL), developmental status, and functional independence. These additional endpoints address the overall impact vosoritide has on achondroplasia and will continue to be evaluated in an ongoing open-label extension study where all subjects receive active treatment. Vosoritide SafetyVosoritide, administered at 15ug/kg/day in this Phase 3 randomized, double-blinded placebo-controlled study over one year, was generally well tolerated.  The majority of adverse events (AEs) were mild and no serious adverse events were reported as study drug-related.  Injection site reactions were the most common drug-related AEs, and all were transient.  No clinically significant blood pressure decreases or new safety findings were observed.  About AchondroplasiaAchondroplasia, the most common form of disproportionate short stature in humans, is characterized by slowing of endochondral ossification, which results in disproportionate short stature and disordered architecture in the long bones, spine, face and base of the skull. This condition is caused by a mutation in the fibroblast growth factor receptor 3 gene (FGFR3), a negative regulator of bone growth. Beyond disproportionate short stature, people with achondroplasia can experience serious health complications, including foramen magnum compression, sleep apnea, bowed legs, mid-face hypoplasia, permanent sway of the lower back, spinal stenosis and recurrent ear infections. Some of these complications can result in the need for invasive surgeries such as spinal cord decompression and straightening of bowed legs. In addition, studies show increased mortality at every age.More than 80% of children with achondroplasia have parents of average stature and have the condition as the result of a spontaneous gene mutation.  The worldwide incidence rate of achondroplasia is about one in 25,000 live births.  Vosoritide is being tested in children whose growth plates are still \"open,\" typically those under 18 years of age. This is approximately 25% of people with achondroplasia.  In the U.S., Europe, Latin America and the Middle East, there are currently no licensed medicines for achondroplasia.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on such website is not incorporated by reference into this press release.Forward-Looking StatementThis press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc. (BioMarin), including, without limitation, statements about: the development of BioMarin's vosoritide development program generally and specifically about the results of the Phase 3 trial, the continued clinical development of vosoritide and the timing and conduct of such clinical program; the possible results of such studies, and discussions with health authorities about marketing applications. These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: final analysis of the Phase 3 data, results and timing of current and planned preclinical studies and clinical trials of vosoritide; our ability to enroll participants into such clinical trials, our ability to successfully manufacture vosoritide; the content and timing of decisions by the U.S. Food and Drug Administration, the European Commission and other regulatory authorities concerning vosoritide; and those other risks and uncertainties detailed from time to time under the caption \"Risk Factors\" and elsewhere in the BioMarin's Securities and Exchange Commission (SEC) filings, including, without limitation, BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and future SEC filings and reports by BioMarin. BioMarin undertakes no duty or obligation to update any forward-looking statements contained in this press release as a result of new information, future events or changes in its expectations.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-announces-positive-final-results-from-placebo-controlled-phase-3-data-in-children-with-achondroplasia-treated-with-vosoritide-300975084.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin Submits Marketing Authorization Application to European Medicines Agency for Valoctocogene Roxaparvovec to Treat Severe Hemophilia A",
        "subtitle": "1st Marketing Application Submission for Gene Therapy Directed at Any Type of Hemophilia",
        "date": "Nov 21, 2019 4:04PM EST",
        "content": "SAN RAFAEL, Calif., Nov. 21, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) announced today that the company submitted a Marketing Authorization Application (MAA) to the European Medicines Agency (EMA) for its investigational gene therapy, valoctocogene roxaparvovec, for adults with severe hemophilia A.  Subject to completion of EMA's validation check, BioMarin anticipates the start of the MAA review to commence in January 2020 under accelerated assessment.  BioMarin will provide an update in January 2020.  Recognizing valoctocogene roxaparvovec for its potential to benefit patients with unmet medical needs, EMA granted access to its Priority Medicines (PRIME) regulatory initiative in 2017 and recently granted BioMarin's request for accelerated assessment of this MAA, potentially shortening the review period. This submission is based on an interim analysis of study participants treated in an ongoing Phase 3 study with material from the to-be-commercialized process and updated three-year Phase 1/2 data.  This submission marks the first marketing application submission for a gene therapy product for any type of hemophilia. Accelerated assessment reduces the time-frame for the EMA Committee for Medicinal Products for Human Use (CHMP) and Committee for Advanced Therapies (CAT) to review a MAA for an Advanced Therapy Medicinal Product (ATMP). Applications are eligible for accelerated assessment if the CHMP and CAT decide the product is of major interest for public health, particularly from the point of view of therapeutic innovation. Evaluating a MAA under the EMA centralized procedure can take up to 210 days, not counting clock stops when applicants are requested to provide additional information. On request, the CHMP and CAT can reduce the time-frame to 150 days if the applicant provides sufficient justification for an accelerated assessment, although an application initially designated for accelerated assessment can revert to the standard procedure during the review for a variety of reasons. The decision to grant accelerated assessment has no impact on the eventual CHMP and CAT opinion on whether a marketing authorization should be granted.The company remains on track to submit a Biologics License Application (BLA) to the U.S. Food and Drug Administration (FDA) by the end of the year. The FDA has granted valoctocogene roxaparvovec Breakthrough Therapy designation.  Valoctocogene roxaparvovec has Orphan Drug designation from the FDA and the EMA.  \"We are grateful to the study participants, who have made this progress possible in the span of approximately four years since the first participant was enrolled in the clinical program,\" said Hank Fuchs, M.D., President, Global Research and Development at BioMarin.  \"We are very pleased with the level of engagement we have had with global health authorities, as it aligns with our belief that gene therapy represents the next wave of innovation and potentially could be a meaningful advancement for treating people with severe hemophilia A.\" About Hemophilia APeople living with hemophilia A lack enough functioning Factor VIII protein to help their blood clot and are at risk for painful and/or potentially life-threatening bleeds from even modest injuries.  Additionally, people with severe hemophilia A often experience painful, spontaneous bleeds into their muscles or joints.  Individuals with hemophilia A diagnosed as severe make up 43 percent of the hemophilia A population.  The standard of care for severe hemophilia A is a prophylactic regimen of replacement Factor VIII infusions administered intravenously up to two to three times per week.  Despite these regimens, many people continue to experience bleeds, resulting in progressive and debilitating joint damage, which can have a major impact on their quality of life.  Hemophilia A, also called Factor VIII deficiency or classic hemophilia, is an X-linked genetic disorder caused by missing or defective Factor VIII, a clotting protein. Although it is passed down from parents to children, about 1/3 of cases are caused by a spontaneous mutation, a new mutation that was not inherited. Approximately 1 in 10,000 people have Hemophilia A. About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for serious and life-threatening rare and ultra-rare genetic diseases. The Company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.Forward Looking StatementThis press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc., including without limitation, statements about development of BioMarin's valoctocogene roxaparvovec program generally and; the timing of the company's regulatory submissions in the U.S and Europe, expectations for review standards and timing of responses by regulatory agencies.  These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: results and timing of current and planned preclinical studies and clinical trials of valoctocogene roxaparvovec; additional data from the continuation of the Phase 1/2 trial and the Phase 3 trial, any potential adverse events observed in the continuing monitoring of the participants in the clinical trials; the content and timing of decisions by the U.S. Food and Drug Administration, the European Commission and other regulatory authorities, including the possibility that the EMA to revert the review pathway to a standard review; the content and timing of decisions by local and central ethics committees regarding the clinical trials; our ability to successfully manufacture valoctocogene roxaparvovec for the clinical trials and commercially, if approved;  and those other risks detailed from time to time under the caption \"Risk Factors\" and elsewhere in BioMarin's Securities and Exchange Commission (SEC) filings, including BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and future filings and reports by BioMarin. BioMarin undertakes no duty or obligation to update any forward-looking statements contained in this press release as a result of new information, future events or changes in its expectations.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-submits-marketing-authorization-application-to-european-medicines-agency-for-valoctocogene-roxaparvovec-to-treat-severe-hemophilia-a-300963370.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "Poised for Significant Growth and Profitability, BioMarin Shares Company Highlights During R&D Day on November 14th in New York",
        "subtitle": "Valoctocogene Roxaparvovec on Track for US and EU Regulatory Submissions by Year End",
        "date": "Nov 14, 2019 11:01AM EST",
        "content": "SAN RAFAEL, Calif., Nov. 14, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) updated the investment community on the Company's research and development portfolio, which is focused on innovative therapies to treat rare diseases. \"BioMarin is at an inflection point where our combined understanding of the biology of many rare diseases and key technologies like gene therapy position us not only for exceptional growth over the next decade, but for GAAP profitability in 2020,\" said JJ Bienaimé, Chairman and CEO of BioMarin.  \"We are excited about the possibilities of our two late-stage clinical programs in hemophilia A and achondroplasia potentially to transform the course of these conditions.  We are also looking forward to leveraging our experience in gene therapy and genetic disease to bring a rich pipeline of new investigational therapies into the clinic.\"Valoctocogene Roxaparvovec, Investigational Gene Therapy for Severe Hemophilia A BioMarin is on track to submit marketing applications for investigational gene therapy, valoctocogene roxaparvovec, to health authorities in the United States and Europe before year end.  \"Valoctocogene roxaparvovec shows a transformational reduction in bleeding and need for Factor VIII infusions.  We remain confident in its long-term efficacy and durability based on our newly presented liver biopsy data that demonstrates that the DNA transferred by the gene therapy vector remains detectable in hepatocytes years after the one-time infusion.  We are also pleased to see that the material used in Phase 3 produces comparable amounts of stable vector in blood samples as was observed in Phase 2,\" said Hank Fuchs, M.D., President Worldwide Research and Development at BioMarin.  \"Valoctocogene roxaparvovec has the most data over the longest period of time of any gene therapy in hemophilia A, and we are looking forward to providing a further update with four years of data in the Phase 2 study in mid-2020.\"BioMarin noted that the Phase 3 study has now dosed 130 study participants, and that the Company completed its process performance qualification (PPQ) campaign, which was the last step in the Chemistry, Manufacturing and Controls package (CMC) package of the regulatory submissions.  Valoctocogene roxaparvovec has been accepted for PRIME scheme from the European Medicines Agency (EMA).  In addition, the EMA recently granted BioMarin's request for accelerated assessment of valoctocogene roxaparvovec, for adults with severe hemophilia A.  Additionally, the FDA has granted valoctocogene roxaparvovec Breakthrough Therapy designation.  Valoctocogene roxaparvovec has Orphan Drug designation from the FDA and the EMA.  Vosoritide for AchondroplasiaThe Company provided an update on its clinical program for vosoritide, an analog of C-type Natriuretic Peptide (CNP), in children with achondroplasia, the most common form of disproportionate short stature in humans at its annual R&D Day.  An ongoing, open-label, Dose Finding Phase 2 study of vosoritide for achondroplasia demonstrated over 54 months that children in cohort 3 (N=10) of the study, at a dose of 15 µg/kg/day, achieved a statistically significant (p< 0.005) cumulative mean additional height gain of 9.0 cm compared to children, matched for age and gender, in a new natural history achondroplasia dataset (N=619).  2.2 cm of this additional increase occurred in the last 12 months further informing our understanding of vosoritide's ongoing treatment impact.In addition, BioMarin reaffirmed that it plans to provide top-line data on the randomized, placebo-controlled Phase 3 study by the end of the year.  Early Stage PipelineBioMarin has identified its next two investigational new drug (IND) candidates to enter into its pipeline.  The first will be a third gene therapy, BMN 331, for Hereditary Angiodema (HAE).  The Company will build on its ever wider and deeper experience in developing gene therapies for hemophilia A and phenylketonuria (PKU) to improve efficiencies in the development process, and optimize capsid and transgene design.The second IND will investigate a new indication for vosoritide in broader genetic statural deficiencies starting with dominantly inherited short stature (DISS).  The Company will build on its learnings with vosoritide in achondroplasia and look for efficiencies in the development process, particularly around pre-clinical research and manufacturing.  BMN 307, Pre-Clinical Gene Therapy for Phenylketonuria (PKU)In September 2019, BioMarin filed a clinical trial application (CTA) for BMN 307 in the United Kingdom.  BMN 307 research represents a potential third Phenylketonuria (PKU) treatment option in BioMarin's PKU franchise.  BMN 307 is one of three gene therapies in the Company's pipeline.BMN 307 is an investigational AAV5-phenylalanine hydroxylase (PAH) gene therapy designed to reduce blood phenylalanine (Phe) concentrations levels in patients with PKU. After preclinical experiments in mice with PKU showed rapid, complete and lifelong normalization of Phe in mice with PKU, BMN 307 will be evaluated to determine whether a single dose of treatment can restore Phe metabolism in patients with PKU, normalize plasma Phe level, and enable a normal diet.  The company expects to start enrolling patients in a Phase 1/2 trial early next year and is actively preparing regulatory submissions for other countries. GAAP Net Income Break-Even or Better in 2020BioMarin also indicated that the Company expects GAAP net income to be break-even or better in 2020, assuming a commercial launch of valoctocogene roxaparvovec in the second half of 2020. About BioMarin and Disease Information BioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases.  The Company's portfolio consists of six commercialized products and multiple clinical and pre-clinical product candidates.  For additional information, please visit www.biomarin.com.  Information on such website is not incorporated by reference into this press release.About Achondroplasia Achondroplasia, the most common form of disproportionate short stature in humans, is characterized by slowing of endochondral ossification, which results in disproportionate short stature and disordered architecture in the long bones, spine, face and base of the skull. This condition is caused by a mutation in the fibroblast growth factor receptor 3 gene (FGFR3), a negative regulator of bone growth. Beyond disproportionate short stature, people with achondroplasia can experience serious health complications, including foramen magnum compression, sleep apnea, bowed legs, mid-face hypoplasia, permanent sway of the lower back, spinal stenosis and recurrent ear infections. Some of these complications can result in the need for invasive surgeries such as spinal cord decompression and straightening of bowed legs. In addition, studies show increased mortality at every age.More than 80% of children with achondroplasia have parents of average stature and have the condition as the result of a spontaneous gene mutation.  The worldwide incidence rate of achondroplasia is about one in 25,000 live births.  Vosoritide is being tested in children whose growth plates are still \"open\", typically those under 18 years of age. This is approximately 25% of people with achondroplasia.  In the U.S., Europe, Latin America and the Middle East, there are currently no licensed medicines for achondroplasia.Vosoritide SafetyVosoritide, administered in over 28,000 injections, was generally well tolerated at all doses.  The majority of adverse events (AEs) were mild and no serious adverse events (SAEs) were reported as study drug-related. Across all doses, injection site reactions and hypotension were the most common drug-related AEs.  All injection site reaction events were transient. AEs of hypotension were mild, transient and resolved without medical intervention, and the majority were asymptomatic and reported in context of routine blood pressure measurements. No new safety findings were observed at the 30 µg/kg/day dose.About Hemophilia AHemophilia A, also called factor VIII (FVIII) deficiency or classic hemophilia, is a genetic disorder caused by missing or defective factor VIII, a clotting protein. Although it is passed down from parents to children, about 1/3 of cases are caused by a spontaneous mutation, a new mutation that was not inherited. Approximately 1 in 10,000 people is born with Hemophilia A. People living with the disease are not able to form blood clots efficiently and are at risk for excessive bleeding from modest injuries, potentially endangering their lives. People with severe hemophilia often bleed spontaneously into their muscles or joints. The standard of care for the 43% of individuals with hemophilia A who are severely affected is a prophylactic regimen of Factor VIII infusions two to three times per week. Even with prophylactic regimens, many people still experience spontaneous bleeding events that result in progressive and debilitating joint damage.Valoctocogene Roxaparvovec Phase 1/2 Study Safety Overall, valoctocogene roxaparvovec has been well-tolerated by patients across all doses.  No patients developed inhibitors to Factor VIII and no patients withdrew from the study.  The most common AEs across all dose cohorts were alanine aminotransferase (ALT) elevation (11 patients, 73%); arthralgia, aspartate aminotransferase elevation, and headache (7 patients each, 47%); back pain and fatigue (5 patients each, 33%).  Two patients reported SAEs during the study.  One patient was hospitalized for observation after developing Grade 2 pyrexia with myalgia and headache within 24 hours of receiving valoctocogene roxaparvovec.  The event resolved within 48 hours following treatment with paracetamol, an over-the-counter treatment for pain and fever.  The event was assessed as related to valoctocogene roxaparvovec.  The other AE was assessed as not related to the therapy, attributed to a planned knee surgery to treat hemophilic arthropathy, and Grade 1 in severity.  No complications were reported.  About HAEHereditary angioedema (HAE) is a rare and potentially life-threatening genetic condition that occurs in about 1 in 10,000 to 1 in 50,000 people.  HAE patients have a defect in the gene that controls a blood protein called C1 Inhibitor. The genetic defect results in production of either inadequate or non-functioning C1-Inhibitor protein.  Normal C1-Inhibitor helps to regulate the complex biochemical interactions of blood-based systems involved in inflammatory responses.  Because defective C1-Inhibitor does not adequately perform its regulatory function, a biochemical imbalance can occur and produce unwanted peptides that induce the capillaries to release fluids into surrounding tissue, thereby causing edema.HAE symptoms include episodes of edema (swelling) in various body parts including the hands, feet, face and airway. In addition, patients often have bouts of excruciating abdominal pain, nausea and vomiting that is caused by swelling in the intestinal wall. Airway swelling is particularly dangerous and can lead to death by asphyxiation.  [Source last checked on 11-13-19]About DSSPeople affected by dominantly inherited short stature (DSS) have one inherited mutation from one parent that is the cause of short stature. It is believed to be a subgroup of ISS. In DSS cases, it is thought that the CNP may be capable of signaling and promoting growth.A full replay of the R&D Day presentation can be found at BioMarin.com.Forward Looking Statement This press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc., including, without limitation, statements about its development programs and regulatory actions related to these programs, including the timing of (i) the filing of regulatory submissions for valoctocogene roxaparvovec, the decisions by regulators regarding BioMarin's regulatory submissions for valoctocogene roxaparvovec and the anticipated release of four years of data in the Phase 2 study in mid-2020, (ii) BioMarin's preclinical studies and clinical studies and trials, (iii) completion of enrollment of those studies and trials, and (iv) announcements of data from those studies and trials, including the timing of the release of Phase 3 topline results for vosoritide; the sustained height growth in vosoritide; the continued clinical development and commercialization of BioMarin's commercial products and product candidates; the possible approval and commercialization of BioMarin's product candidates; and statements about expectation of GAAP net income break-even or better in 2020 if valoctocogene roxaparvovec is commercially launched in the second half 2020.  These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: results and timing of current and planned preclinical studies and clinical trials of our product candidates, the continued clinical experiences of the patients in the current clinical studies; the content and timing of decisions by the FDA, the European Commission and other regulatory authorities; our ability to successfully manufacture our product candidates for the preclinical and clinical trials; and those factors detailed in BioMarin's filings with the Securities and Exchange Commission (SEC), including, without limitation, the factors contained under the caption \"Risk Factors\" in BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 and future SEC filings and reports by BioMarin. BioMarin undertakes no duty or obligation to update any forward-looking statements contained in this press release as a result of new information, future events or changes in its expectations.BioMarin®, is a registered trademarks of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/poised-for-significant-growth-and-profitability-biomarin-shares-company-highlights-during-rd-day-on-november-14th-in-new-york-300958538.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin Announces Cumulative Additional Height Gain of 9.0 cm over 54 months versus Natural History in Children with Achondroplasia Treated with Vosoritide in Phase 2 Study",
        "subtitle": "Company Plans to Provide Topline Phase 3 Data by Year End",
        "date": "Nov 14, 2019 8:27AM EST",
        "content": "SAN RAFAEL, Calif., Nov. 14, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) provided an update on its clinical program for vosoritide, an analog of C-type Natriuretic Peptide (CNP), in children with achondroplasia, the most common form of disproportionate short stature in humans, at its annual R&D Day.  An ongoing, open-label, dose finding Phase 2 study of vosoritide for achondroplasia demonstrated over 54 months that children in cohort 3 (N=10) of the study, at a dose of 15 µg/kg/day, achieved a statistically significant (p< 0.005) cumulative additional mean height gain of 9.0 cm compared to children, matched for age and gender, in a new natural history achondroplasia dataset (N=619).  2.2 cm of this additional increase occurred in the last 12 months further informing our understanding of vosoritide's ongoing treatment impact.\"By matching individual study participants to an new natural history database that has approximately 13,000 data points related to height, we have additional information supportive of this investigational therapy demonstrating significant and sustained growth,\" said Hank Fuchs, M.D., President Worldwide Research and Development.  \"We are grateful to the children and their families for their participation in our ongoing clinical trials, as well as those who contributed their information to the natural history database.  The new natural history data comparisons add important context to 54 months of sustained growth improvement observed to date, which in combination with our Phase 3 results, will form the basis for potential marketing applications.\"In addition, BioMarin reaffirmed that it plans to provide top-line data from the randomized, placebo-controlled Phase 3 study by the end of the year.  Phase 3 and Dose Finding Phase 2 Study Populations have Similar Baseline ParametersBaseline parameters of study participants in the Phase 3 study were compared to the baseline parameters of the Phase 2 study participants, illustrating the similarity between the studies.  Status Update on Vosoritide Ongoing Randomized, Placebo-Controlled Phase 2 Infants and Young Children StudyIn the global Phase 2 study in infants and young children up to age 5 with achondroplasia, enrollment of cohort 1 of 24 to 60 months is complete, and enrollment of cohort 2 of six- to 24-months is expected to be completed by the end of 2019.  In the third cohort of newborns to six months old, all three open label sentinels have been enrolled in the study for safety observation prior to cohort expansion planned in December.   Description of Phase 3 Study BioMarin expects top line results from the fully enrolled Phase 3 study of vosoritide in children by year end 2019.  The global Phase 3 study is a randomized, placebo-controlled study of vosoritide in approximately 110 children with achondroplasia ages five to 14 for 52 weeks.  The study will be followed by a subsequent open-label extension when all subjects receive active treatment.  Children in this study will have completed a minimum six-month baseline study to determine their respective baseline growth velocity prior to entering the Phase 3 study.  Vosoritide is being tested in children whose growth plates are still open.  This is approximately 25% of people with achondroplasia.  The primary endpoint of the study is the change in growth velocity from baseline over one year in children treated compared to placebo.  The company also plans to augment the growth velocity data with assessments of proportionality and functionality. Description of Phase 2 Dose Finding StudyThe primary objectives of the open-label, sequential cohort, dose-finding study were to evaluate the safety and tolerability of daily subcutaneous vosoritide and to determine the dose to carry forward to Phase 3.  Secondary objectives were to evaluate the effects of vosoritide on change from pre-treatment baseline in annualized growth velocity (cm/year), height Z-scores, and body segment proportionality, the vosoritide pharmacokinetic (PK) profile, and biomarkers of vosoritide activity, and endochondral ossification.Description of Phase 2 Study in Infants and Young Children Ages 0 to 5 YearsThe Phase 2 vosoritide study is a randomized, placebo-controlled study of vosoritide in approximately 70 infants and young children with achondroplasia, aged zero to less than 60 months, for a period of 52 weeks.  The study will be followed by a subsequent open-label extension trial when all subjects receive active treatment.  Children in this study will have completed a three-to-six month baseline study to determine their respective baseline growth prior to entering the Phase 2 study.  The primary objectives of the study are to evaluate safety, tolerability, and the effect of vosoritide on height Z-scores, which is the number of standard deviations in relation to the mean height of age- and gender-matched, average stature children.  The company also plans to augment the height Z-score data with assessments including proportionality, functionality, quality of life, sleep apnea, and foramen magnum dimension, as well as the advent of major illnesses and surgeries. Vosoritide SafetyVosoritide, administered in over 28,000 injections, was generally well tolerated at all doses.  The majority of adverse events (AEs) were mild and no serious adverse events (SAEs) were reported as study drug-related.  Across all doses, injection site reactions and hypotension were the most common drug-related AEs.  All injection site reaction events were transient.  AEs of hypotension were mild, transient and resolved without medical intervention, and the majority were asymptomatic and reported in context of routine blood pressure measurements.  No new safety findings were observed at the 30 µg/kg/day dose.About AchondroplasiaAchondroplasia, the most common form of disproportionate short stature in humans, is characterized by slowing of endochondral ossification, which results in disproportionate short stature and disordered architecture in the long bones, spine, face and base of the skull.  This condition is caused by a mutation in the fibroblast growth factor receptor 3 gene (FGFR3), a negative regulator of bone growth.  Beyond disproportionate short stature, people with achondroplasia can experience serious health complications, including foramen magnum compression, sleep apnea, bowed legs, mid-face hypoplasia, permanent sway of the lower back, spinal stenosis and recurrent ear infections.  Some of these complications can result in the need for invasive surgeries such as spinal cord decompression and straightening of bowed legs.  In addition, studies show increased mortality at every age.More than 80% of children with achondroplasia have parents of average stature and have the condition as the result of a spontaneous gene mutation.  The worldwide incidence rate of achondroplasia is about one in 25,000 live births.  Vosoritide is being tested in children whose growth plates are still \"open,\" typically those under 18 years of age.  This is approximately 25% of people with achondroplasia.  In the U.S., Europe, Latin America and the Middle East, there are currently no licensed medicines for achondroplasia.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare and ultra-rare genetic diseases.  The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.  For additional information, please visit www.biomarin.com.  Information on such website is not incorporated by reference into this press release.A full replay of the R&D Day presentation can be found at BioMarin.com.Forward-Looking Statement This press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc. (BioMarin), including, without limitation, statements about: the development of BioMarin's vosoritide program generally; the potential benefits of vosoritide for infants and young children; the continued clinical development of vosoritide and the timing and conduct of such clinical program; the possible results of such studies; and BioMarin's expectation of top line results from the fully enrolled Phase 3 study of vosoritide in children by year end 2019. These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others: results and timing of current and planned preclinical studies and clinical trials of vosoritide; our ability to enroll participants into such clinical trials, our ability to successfully manufacture vosoritide; the content and timing of decisions by the U.S. Food and Drug Administration, the European Commission and other regulatory authorities concerning vosoritide; and those other risks and uncertainties detailed from time to time under the caption \"Risk Factors\" and elsewhere in the BioMarin's Securities and Exchange Commission (SEC) filings, including, without limitation, BioMarin's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and future SEC filings and reports by BioMarin. BioMarin undertakes no duty or obligation to update any forward-looking statements contained in this press release as a result of new information, future events or changes in its expectations.BioMarin® is a registered trademark of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-announces-cumulative-additional-height-gain-of-9-0-cm-over-54-months-versus-natural-history-in-children-with-achondroplasia-treated-with-vosoritide-in-phase-2-study-300958408.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Participate in Jefferies London Healthcare Conference on November 21, 2019",
        "subtitle": "",
        "date": "Nov 12, 2019 8:30AM EST",
        "content": "SAN RAFAEL, Calif., Nov. 12, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that Jean-Jacques Bienaimé, Chairman and Chief Executive Officer, will present at the Jefferies London Healthcare Conference on November 21, 2019 at 1:20pm GMT/8:20am ET. To access the live webcast, please visit the investor section of the BioMarin website, www.biomarin.com. A replay will also be archived on the site for at least one week following each event.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.   For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-participate-in-jefferies-london-healthcare-conference-on-november-21-2019-300956123.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Highlight Innovative Development Pipeline at R&D Day on November 14th",
        "subtitle": "- Key research & development pipeline products and data to be presented, including 54-month Phase 2 vosoritide data update for the treatment of achondroplasia -",
        "date": "Nov 6, 2019 4:05PM EST",
        "content": "SAN RAFAEL, Calif., Nov. 6, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) will host an R&D Day at 8:00am ET on Thursday, November 14, 2019. BioMarin management and external experts will provide an update to the investment community on the Company's development portfolio, which is focused on innovative therapies to treat rare diseases. BioMarin R&D Day 2019 AgendaWelcome and Opening RemarksVosoritide for Achondroplasia and Other IndicationsR&D Pipeline Deep Dive including PKU Gene Therapy Program UpdateValoctocogene Roxaparvovec Gene Therapy for Hemophilia AClosing StatementsLive Audio WebcastInterested parties may access a live audio webcast that will include audio and slides of the presentations here. A replay of the event will be archived on the Events and Presentations page under the Investors/Media section of the Company's website for at least two weeks following the event.For those who choose not to listen to the event via webcast, dial-in information for the audio portion of the webcast can be accessed using:USA: (913) 227-1201USA /Canada (toll free): (866) 705-2554Conference ID: 6342187About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-highlight-innovative-development-pipeline-at-rd-day-on-november-14th-300953214.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Host Third Quarter 2019 Financial Results Conference Call and Webcast on Wednesday, October 23 at 4:30pm ET",
        "subtitle": "",
        "date": "Oct 9, 2019 8:31AM EDT",
        "content": "SAN RAFAEL, Calif., Oct. 9, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that Jean-Jacques Bienaimé, Chairman and Chief Executive Officer of BioMarin, will host a conference call and webcast on Wednesday, October 23, at 4:30 p.m. ET to discuss third quarter 2019 financial results and provide a general business update. Dial-in NumbersU.S. / Canada Dial-in Number: (866) 502-9859International Dial-in Number: (574) 990-1362Conference ID: 2973359Replay Dial-in Number: (855) 859-2056Replay International Dial-in Number: (404) 537-3406Conference ID: 2973359Interested parties may access a live audio webcast of the conference call via the investor section of the BioMarin website, www.biomarin.com. A replay of the call will be archived on the site for one week following the call.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release. View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-host-third-quarter-2019-financial-results-conference-call-and-webcast-on-wednesday-october-23-at-430pm-et-300934446.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin Promotes Lon Cardon, Ph.D. to Chief Scientific Strategy Officer",
        "subtitle": "",
        "date": "Oct 7, 2019 8:31AM EDT",
        "content": "SAN RAFAEL, Calif., Oct. 7, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (Nasdaq:BMRN) today announced the promotion of Lon Cardon, Ph.D. to Chief Scientific Strategy Officer, a newly created role to enrich BioMarin's pipeline, which drives the future growth of the company. Dr. Cardon's promotion to lead BioMarin's scientific strategy is effective immediately. \"We are thrilled to promote Lon into the leadership role for our scientific strategy at BioMarin. BioMarin is committed to pioneering breakthrough science that has the potential to make a big impact on rare patient populations. Lon will support our company's growth by identifying the right balance of resources within BioMarin to move the most promising molecules through our pipeline,\" said Jean-Jacques Bienaimé, Chairman and Chief Executive Officer. \"Lon has done an outstanding job of building our research capabilities positioning BioMarin for future success and brings his knowledge in genetics and drug discovery generally, and specifically in BioMarin's scientific expertise to this role.\"In this newly created leadership position, Dr. Cardon's responsibilities expand beyond the Research functions at BioMarin and now include oversight of the company's product portfolio. He will lead cross functional activities to build our leadership position in precision medicine in support of patients with rare genetic diseases and drive long-term growth through the oversight of an exceptional pipeline of first- or best-in-class therapies. \"I have worked closely with Lon over the past two years and have the utmost confidence in his abilities to oversee a critical part of our business that drives our future growth,\" said Hank Fuchs, M.D., President, Worldwide Research and Development. \"He is uniquely qualified to champion science at BioMarin that has the potential to change the practice of medicine and to bring together cross functional teams that will deliver potentially life-changing medicine to patients with rare diseases.\"Previously, Dr. Cardon was Senior Vice President of Alternative Discovery and Development, and Head of Target Sciences at GlaxoSmithKline plc (GSK). During his nine years at GSK, he led platform groups in genetics, statistics, bioinformatics, epidemiology and clinical pharmacology and created a new division for exploratory therapeutic areas and platforms, including rare diseases, gene therapy, ophthalmology, women's health and others. Dr. Cardon was a longstanding member of GSK's R&D executive team, ultimately chairing their discovery board which governed the scientific direction of all of GSK's preclinical to phase 2 programs. Before moving into the industry, Dr. Cardon was a professor of Biostatistics at the University of Washington and full member of the Fred Hutchinson Cancer Research Centre. Prior to that he was a professor and Wellcome Trust Principal Fellow at the University of Oxford. He received his PhD from the University of Colorado, Boulder and did his postdoctoral training at Stanford University. He is an elected Fellow of the UK's Academy of Medical Sciences and the American Association for the Advancement of Science. About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for patients with serious and life-threatening rare genetic diseases. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates. For additional information, please visit www.biomarin.com. Information on such website is not incorporated by reference into this press release.BioMarin® is a registered trademarks of BioMarin Pharmaceutical Inc.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-promotes-lon-cardon-phd-to-chief-scientific-strategy-officer-300932760.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Participate in Jefferies Gene Therapy/Editing Summit on October 8, 2019 in New York",
        "subtitle": "",
        "date": "Oct 1, 2019 8:30AM EDT",
        "content": " SAN RAFAEL, Calif., Oct. 1, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN) today announced that Robert Baffi, Ph.D., President of Global Manufacturing and Technical Operations, will participate in a fireside discussion at the Jefferies Gene Therapy/Editing Summit on October 8, 2019 at 11:15am ET in New York.  Dr. Baffi will also participate in the panel discussion on manufacturing, dose, and durability in gene therapy at 10:20am ET, which will not be available by webcast.To access the live webcast presentation, please visit the investor section of the BioMarin website, www.biomarin.com. A replay will also be archived on the site for at least one week following each event. About BioMarin BioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.   For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-participate-in-jefferies-gene-therapyediting-summit-on-october-8-2019-in-new-york-300928381.htmlSOURCE  BioMarin Pharmaceutical Inc."
    },
    {
        "title": "BioMarin to Participate in Morgan Stanley 17th Annual Global Healthcare Conference on September 10, 2019 in New York",
        "subtitle": "",
        "date": "Sep 9, 2019 4:05PM EDT",
        "content": "SAN RAFAEL, Calif., Sept. 9, 2019 /PRNewswire/ -- BioMarin Pharmaceutical Inc. (NASDAQ: BMRN), today announced that Dan Spiegelman, Executive Vice President and Chief Financial Officer and Henry Fuchs, M.D., President, Worldwide Research & Development, will present at the Morgan Stanley 17th Annual Global Healthcare Conference on September 10, 2019 at 8:35am ET in New York.  To access the live webcast, please visit the investor section of the BioMarin website, www.biomarin.com. A replay will also be archived on the site for at least one week following each event.About BioMarinBioMarin is a global biotechnology company that develops and commercializes innovative therapies for people with serious and life-threatening rare disorders. The company's portfolio consists of seven commercialized products and multiple clinical and pre-clinical product candidates.   For additional information, please visit www.biomarin.com. Information on BioMarin's website is not incorporated by reference into this press release.  View original content to download multimedia:http://www.prnewswire.com/news-releases/biomarin-to-participate-in-morgan-stanley-17th-annual-global-healthcare-conference-on-september-10-2019-in-new-york-300914427.htmlSOURCE  BioMarin Pharmaceutical Inc."
    }
]