[
    {
        "title": "Cadence Completes Acquisition of AWR Corporation from National Instruments",
        "subtitle": "",
        "date": "Jan 15, 2020 4:05PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (Nasdaq: CDNS) announced today that it has completed the acquisition of AWR Corporation from National Instruments Corporation. The addition of AWR’s technologies and talent will further expand Cadence’s reach into 5G RF communications and support system innovation for the aerospace and defense, automotive and wireless market segments.\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence® software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine’s 100 Best Companies to Work For. Learn more at www.cadence.com.\n\nCadence Forward-Looking Statements \n\nThis press release contains forward-looking statements, including statements regarding the expected benefits to Cadence, its products and its customers from the acquisition, that are based on current expectations and preliminary assumptions that are subject to factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These forward-looking statements are subject to a number of risks, uncertainties and other factors, many of which are outside Cadence’s control, including the effects of the acquisition on Cadence’s financial results and business, the ability to successfully operate or integrate the AWR business into Cadence, the ability to retain and integrate AWR employees into Cadence, the changes in customer demands and markets, and other risk factors set forth in Cadence’s most recent reports on Form 10-K and Form 10-Q. Cadence undertakes no obligation to update any forward-looking statement in this press release.\n\n© 2020 Cadence Design Systems, Inc.. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200115005713/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Expands Collaboration with Broadcom for 5nm and 7nm Designs",
        "subtitle": "",
        "date": "Jan 14, 2020 10:45AM EST",
        "content": "\nHighlights:\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (Nasdaq: CDNS) today announced that it expanded its collaboration with Broadcom Inc. for the creation of semiconductor solutions targeting next-generation networking, broadband, enterprise storage, wireless and industrial applications. Building upon successful 7nm designs, Cadence and Broadcom are expanding the collaboration to include the creation of 5nm designs using Cadence® digital implementation solutions. With these Cadence solutions in place, Broadcom can further augment engineering productivity and improve silicon performance and power.\n\n“As a global infrastructure technology leader, we’re committed to delivering innovative products that enable our customers to excel in their respective markets,” said Yuan Xing Lee, vice president and head, Central Engineering at Broadcom Inc. “With Cadence as a key silicon design partner, we’re able to achieve our power and performance goals and provide our customers with the highest quality solutions that they’ve come to expect from us.”\n\n“We’ve collaborated with Broadcom for many years, and our expanded partnership on advanced-node design development is a result of the series of successes we’ve had together over time and our overall digital technology leadership,” said Dr. Anirudh Devgan, president of Cadence. “Given the continued proliferation of networking, broadband, enterprise storage, wireless and industrial applications, we’re dedicated to ensuring that Broadcom achieves design excellence using our latest toolsets to fuel design innovation.”\n\nThe Cadence digital implementation solutions are part of the broader digital suite, which provides optimal power, performance and area (PPA) and reduced turnaround time. The tools support Cadence’s Intelligent System Design™ strategy, which enables systems and semiconductor companies to achieve system-on-chip (SoC) design excellence more efficiently. For more information on the digital suite, visit www.cadence.com/go/dspr.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2020 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005087/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Announces Fourth Quarter and Fiscal Year 2019 Financial Results Webcast",
        "subtitle": "",
        "date": "Jan 10, 2020 8:00AM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) will hold its fourth quarter and fiscal year 2019 financial results webcast on Wednesday, February 12, 2020.\n\nParticipating on the webcast will be Lip-Bu Tan, chief executive officer, and John Wall, senior vice president and chief financial officer.\n\nThe webcast will begin Wednesday, February 12, 2020 at 2:00 p.m. Pacific Time. An archive of the webcast will be available online from 5:00 p.m. Pacific Time on February 12, 2020 until 5:00 p.m. Pacific Time on Friday, March 13, 2020, at cadence.com/cadence/investor_relations.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2020 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200110005011/en/\nCadence Investor Relations\n408-944-7100\ninvestor_relations@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "LC3 for Bluetooth LE Audio Now Available for Cadence Tensilica HiFi DSPs",
        "subtitle": "",
        "date": "Jan 6, 2020 9:05PM EST",
        "content": "\nHiFi customers can immediately benefit from latest performance enhancements enabled by new Bluetooth audio mode\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (Nasdaq: CDNS) today announced that an implementation of the Low Complexity Communications Codec (LC3) that is expected to be compliant with LE Audio, the next generation of Bluetooth audio, is available now for Cadence® Tensilica® HiFi DSPs and has been delivered to a lead customer. LC3 provides higher audio quality at lower bandwidth and affords developers greater flexibility in making tradeoffs between audio quality, power consumption and other features for a more optimal user experience. Cadence licensed reference code from Fraunhofer IIS to enable availability of LC3 in conjunction with the initial LE Audio launch, allowing customers to immediately benefit from the latest enhancements including longer battery life, improved connectivity and multi-user sharing.\n\n“Consumer demand for a wide range of Bluetooth audio-based products from headphones and TWS ear buds to portable speakers continues to explode. We are excited that our contributions to LC3 help deliver higher quality and more robust experiences,“ said Marc Gayer, head of business department in the audio and multimedia division of Fraunhofer IIS. “We worked early on in the development of the codec to ensure that LC3 would run extremely efficiently on the Cadence Tensilica HiFi Audio DSP architecture, which translates to extended battery life for consumers.”\n\n“The fact that the LC3 codec can provide very high-quality audio even at low bitrates makes it a key feature of the upcoming LE Audio standard,” said Mark Powell, executive director of the Bluetooth Special Interest Group (SIG). “We are pleased to see member companies working on implementations of the LC3 codec optimized for various processor architectures.”\n\n“Fraunhofer continues to prove that it is an innovative leader in the world of audio/voice codecs with its critical contributions to the new LC3 standard,” said Gerard Andrews, director of audio/voice IP marketing at Cadence. “By working closely with Fraunhofer throughout the development of this audio codec, we are able to offer a highly optimized, ultra-low power implementation on the HiFi architecture in concert with the announcement of LE Audio. This is an example of how we’re continuing to enhance our best-in-class HiFi technology to deliver performance excellence for our customers’ audio and voice implementations.”\n\nTensilica HiFi DSPs are the most widely licensed audio/voice/AI speech processors. Part of the broad Cadence IP portfolio, they enable SoC design excellence in support of Cadence’s Intelligent System Design™ strategy. For more information on the Tensilica HiFi DSP family, visit http://ip.cadence.com/ipportfolio/tensilica-ip/audio.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine‘s 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2020 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective holders.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005268/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Global Unichip Corporation Uses Cadence Digital Implementation and Signoff Flow to Deliver Advanced-Node Designs for AI and HPC Applications",
        "subtitle": "",
        "date": "Dec 10, 2019 1:00AM EST",
        "content": "\nCadence Innovus Implementation System and Voltus IC Power Integrity Solution enable GUC to achieve first-pass silicon success and meet GHz performance target for multi-billion gate designs\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (Nasdaq: CDNS) today announced that Global Unichip Corporation (GUC) successfully deployed the Cadence® digital implementation and signoff flow and delivered advanced-node (N16, N12 and N7) designs for artificial intelligence (AI) and high-performance computing (HPC) applications. Through use of the Cadence Innovus™ Implementation System and the Voltus™ IC Power Integrity Solution, GUC achieved first-pass silicon success and met its GHz performance target for its multi-billion gate designs. For more information on the Cadence digital and signoff flow, please visit www.cadence.com/go/dsfcspr.\n\nTraditional digital implementation and signoff tools lack the capacity GUC required for their multi-billion gate designs during the implementation and signoff stages. Alternative solutions on the market must be greatly scripted because they don’t offer a shared data model-level integration, requiring more manual work with increased design margins and limited performance. Where the traditional tools fall short, the tightly integrated Cadence solution helped GUC meet power, performance and area (PPA) targets and deliver their large-capacity, advanced designs on time.\n\nThe Innovus Implementation System improved the GUC design team’s productivity through its efficient hierarchical partitioning flow, advanced top-level floorplanning and block implementation and closure capabilities. The Voltus IC Power Integrity Solution enabled GUC to accurately analyze the top-level full-chip static/dynamic power, IR drop and electro-migration through its distributed processing capability using innovative extensive parallelism technology. The seamless shared data model-level integration between the Cadence tools provides GUC with an efficient way to close signoff EM-IR issues during block implementation, reducing costly iterations and engineering change orders (ECOs).\n\n“As a leader in ASIC design, we need to deliver highly complex designs to customers quickly, particularly for emerging application areas like AI and HPC,” said Louis Lin, senior vice president of Design Services at GUC. “Through our deep collaboration with Cadence, we deployed their digital implementation and signoff tools quickly and easily, and the Cadence team also provided prompt support to further optimize our delivery cycle time and achieve our PPA targets.”\n\nThe Cadence Innovus Implementation System and Voltus IC Power Integrity Solution are part of the broader digital implementation and signoff full flow and provide customers with a faster path to design closure. The tools in the flow support the company’s Intelligent System Design™ strategy, enabling advanced-node system-on-chip (SoC) design excellence for AI and HPC applications.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005160/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence to Acquire AWR Corporation From National Instruments to Accelerate System Innovation for 5G RF Communications",
        "subtitle": "",
        "date": "Dec 3, 2019 1:43AM EST",
        "content": "BENGALURU and SAN JOSE, California, Dec. 3, 2019 /PRNewswire/ -- Cadence Design Systems, Inc. (Nasdaq: CDNS) and National Instruments Corporation (Nasdaq: NATI) today announced that they have entered into a definitive agreement pursuant to which Cadence expects to acquire AWR Corporation, a wholly owned subsidiary of National Instruments (NI). AWR is an industry leader in high-frequency RF EDA software technology and will bring a highly talented RF team to Cadence. Concurrently, Cadence and NI also entered into a strategic alliance agreement to expand their relationship to enhance electronic system innovation with a focus on communications.AWR software is used by microwave and RF engineers to design wireless products for complex, high-frequency RF applications. The technology helps customers accelerate the design and product development cycle of systems used in communications, aerospace and defense, semiconductor, computer, and consumer electronics, by helping reduce the time it takes to go from concept to manufacturing.\"Companies designing communication and radar chips, modules and systems face increasing time-to-market pressure in high-growth 5G/wireless applications. Creating differentiated products while reducing cycle time requires a seamless design, simulation and analysis environment,\" said Dr. Anirudh Devgan, president of Cadence. \"The addition of AWR's talent and technologies will enable us to provide more integrated and optimized RF design solutions, thereby further accelerating system innovation as we execute our Intelligent System Design strategy.\"Designers are challenged with the traditional RF/microwave design flow, which consists of processes that are error-prone, resulting in a loss of productivity and capability. Customers can benefit from a seamless integration connecting the AWR® Design Environment with the Cadence® Allegro® PCB Designer and the industry-leading Virtuoso® and Spectre® platforms for RF integrated circuit (IC) design excellence. Electromagnetic and thermal analysis is often difficult and tedious for a designer to setup and use. To address this, the integration also includes Cadence system analysis tools such as the Clarity™ 3D Solver, Celsius™ Thermal Solver and Sigrity™ PowerSI® technologies.\"RF/microwave/mmWave applications need best-in-class solutions to achieve first-pass success with optimal design performance,\" said Joseph E. Pekarek, general manager of AWR. \"By joining forces with Cadence, our goal is to be able to leverage the strength and heritage of the Virtuoso and Allegro platforms along with the AWR Design Environment platform to deliver complete solutions for complex ICs, packages and boards.\"The flows resulting from the integration of AWR technology with Cadence computation software are expected to be tightly connected with the NI LabVIEW and PXI modular instrumentation systems and semiconductor data platform as part of a new strategic alliance. For more information on the Cadence and NI strategic alliance, please visit ni.com/nati/news. Under the terms of the definitive agreement, Cadence will pay approximately $160 million in cash at closing and expects approximately 110 AWR employees to join Cadence. The acquisition is expected to close in the first quarter of 2020 and is subject to customary closing conditions, including regulatory approval.About CadenceCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence® software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company's System Design Enablement strategy helps customers develop differentiated products-from chips to boards to systems-in mobile, consumer, cloud datacenter, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at www.cadence.com.About National InstrumentsNI (ni.com) develops high-performance automated test and automated measurement systems to help you solve your engineering challenges now and into the future. Our open, software-defined platform uses modular hardware and an expansive ecosystem to help you turn powerful possibilities into real solutions. Learn more at www.ni.com.Cadence Forward-Looking StatementsThis press release contains forward-looking statements, including statements regarding the expected benefits to Cadence, its products and its customers from the expected acquisition and the strategic alliance and the expected timing in which the closing of the expected acquisition will occur, that are based on current expectations and preliminary assumptions that are subject to factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These forward-looking statements are subject to a number of risks, uncertainties and other factors, many of which are outside Cadence's control, including the effects of the expected acquisition on Cadence's financial results and business, the ability to successfully operate or integrate the AWR business into Cadence, the ability to retain and integrate AWR employees into Cadence, the ability to realize the expected benefits of the strategic alliance agreement, the changes in customer demands and markets, and other risk factors set forth in Cadence's most recent reports on Form 10-K and Form 10-Q. Cadence undertakes no obligation to update any forward-looking statement in this press release.National Instruments Forward-Looking StatementsThis press release contains certain forward-looking statements of NI, including statements that Cadence expects to acquire AWR, that the strategic alliance agreement will expand their relationship to enhance electronic system innovation with a focus on communications, AWR's goal being able to leverage the strength and heritage of the Virtuoso and Allegro platforms along with the AWR Design Environment platform to deliver complete solutions for complex ICs, packages and boards, that the flows resulting from the integration of AWR technology with Cadence computation software are expected to be tightly connected with the NI LabVIEW and PXI modular instrumentation systems and semiconductor data platform as part of a new strategic alliance and that the acquisition is expected to close in the first quarter of 2020. These forward-looking statements are subject to numerous risks, uncertainties and other factors, many of which are outside of the control of NI, including, among others: the failure or inability of Cadence or NI to meet the closing conditions or to otherwise consummate the AWR transaction, the timing and ability to of the parties to obtain regulatory approval, the ability of the parties to realize the expected benefits of the strategic alliance agreement including the integrated product being tightly connected with the NI LabVIEW and PXI modular instrumentation systems, the risk of adverse changes or fluctuations in the global economy, further adverse fluctuations in NI's industry, foreign exchange fluctuations, fluctuations in demand for NI products including orders from NI's large customers, component shortages, delays in the release of new products, NI's ability to effectively manage its operating expenses, manufacturing inefficiencies and the level of capacity utilization, the impact of any recent or future acquisitions by NI, expense overruns, and adverse effects of price changes or effective tax rates. Actual results may differ materially from the expected results. NI directs readers to its Form 10-K for the year ended Dec. 31, 2018, its Form 10-Q for the quarter ended September 30, 2019 and the other documents it files with the SEC for other risks associated with its future performance. NI undertakes no obligation to update any forward-looking statement in this press release. Stockholders are cautioned not to place undue reliance on the forward-looking statements herein, which speak only as of the date such statements are made.For more information, please contact:Cadence Newsroom408-944-7039newsroom@cadence.comMarissa VidaurriHead of Investor Relations, National Instruments512-773-0856marissa.vidaurri@ni.com© 2019 Cadence Design Systems, Inc. and National Instruments Corporation. All rights reserved worldwide.Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.National Instruments, NI, ni.com and LabVIEW are trademarks of National Instruments. Other product and company names listed are trademarks or trade names of their respective companies.Media Contact: Madhavi Raormadhavi@cadence.com+91(0)80-41641111Marketing DirectorCadence Design Systems (India) Pvt. Ltd."
    },
    {
        "title": "Cadence to Acquire AWR Corporation from National Instruments to Accelerate System Innovation for 5G RF Communications",
        "subtitle": "",
        "date": "Dec 2, 2019 4:06PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (Nasdaq: CDNS) and National Instruments Corporation (Nasdaq: NATI) today announced that they have entered into a definitive agreement pursuant to which Cadence expects to acquire AWR Corporation, a wholly owned subsidiary of National Instruments (NI). AWR is an industry leader in high-frequency RF EDA software technology and will bring a highly talented RF team to Cadence. Concurrently, Cadence and NI also entered into a strategic alliance agreement to expand their relationship to enhance electronic system innovation with a focus on communications.\n\nAWR software is used by microwave and RF engineers to design wireless products for complex, high-frequency RF applications. The technology helps customers accelerate the design and product development cycle of systems used in communications, aerospace and defense, semiconductor, computer, and consumer electronics, by helping reduce the time it takes to go from concept to manufacturing.\n\n“Companies designing communication and radar chips, modules and systems face increasing time-to-market pressure in high-growth 5G/wireless applications. Creating differentiated products while reducing cycle time requires a seamless design, simulation and analysis environment,” said Dr. Anirudh Devgan, president of Cadence. “The addition of AWR’s talent and technologies will enable us to provide more integrated and optimized RF design solutions, thereby further accelerating system innovation as we execute our Intelligent System Design strategy.”\n\nDesigners are challenged with the traditional RF/microwave design flow, which consists of processes that are error-prone, resulting in a loss of productivity and capability. Customers can benefit from a seamless integration connecting the AWR® Design Environment with the Cadence® Allegro® PCB Designer and the industry-leading Virtuoso® and Spectre® platforms for RF integrated circuit (IC) design excellence. Electromagnetic and thermal analysis is often difficult and tedious for a designer to setup and use. To address this, the integration also includes Cadence system analysis tools such as the Clarity™ 3D Solver, Celsius™ Thermal Solver and Sigrity™ PowerSI® technologies.\n\n“RF/microwave/mmWave applications need best-in-class solutions to achieve first-pass success with optimal design performance,” said Joseph E. Pekarek, general manager of AWR. “By joining forces with Cadence, our goal is to be able to leverage the strength and heritage of the Virtuoso and Allegro platforms along with the AWR Design Environment platform to deliver complete solutions for complex ICs, packages and boards.”\n\nThe flows resulting from the integration of AWR technology with Cadence computation software are expected to be tightly connected with the NI LabVIEW and PXI modular instrumentation systems and semiconductor data platform as part of a new strategic alliance. For more information on the Cadence and NI strategic alliance, please visit ni.com/nati/news.\n\nUnder the terms of the definitive agreement, Cadence will pay approximately $160 million in cash at closing and expects approximately 110 AWR employees to join Cadence. The acquisition is expected to close in the first quarter of 2020 and is subject to customary closing conditions, including regulatory approval.\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine’s 100 Best Companies to Work For. Learn more at www.cadence.com.\n\nAbout National Instruments \n\nNI (ni.com) develops high-performance automated test and automated measurement systems to help you solve your engineering challenges now and into the future. Our open, software-defined platform uses modular hardware and an expansive ecosystem to help you turn powerful possibilities into real solutions. Learn more at www.ni.com.\n\nCadence Forward-Looking Statements \n\nThis press release contains forward-looking statements, including statements regarding the expected benefits to Cadence, its products and its customers from the expected acquisition and the strategic alliance and the expected timing in which the closing of the expected acquisition will occur, that are based on current expectations and preliminary assumptions that are subject to factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These forward-looking statements are subject to a number of risks, uncertainties and other factors, many of which are outside Cadence’s control, including the effects of the expected acquisition on Cadence’s financial results and business, the ability to successfully operate or integrate the AWR business into Cadence, the ability to retain and integrate AWR employees into Cadence, the ability to realize the expected benefits of the strategic alliance agreement, the changes in customer demands and markets, and other risk factors set forth in Cadence’s most recent reports on Form 10-K and Form 10-Q. Cadence undertakes no obligation to update any forward-looking statement in this press release.\n\nNational Instruments Forward-Looking Statements \n\nThis press release contains certain forward-looking statements of NI, including statements that Cadence expects to acquire AWR, that the strategic alliance agreement will expand their relationship to enhance electronic system innovation with a focus on communications, AWR’s goal being able to leverage the strength and heritage of the Virtuoso and Allegro platforms along with the AWR Design Environment platform to deliver complete solutions for complex ICs, packages and boards, that the flows resulting from the integration of AWR technology with Cadence computation software are expected to be tightly connected with the NI LabVIEW and PXI modular instrumentation systems and semiconductor data platform as part of a new strategic alliance and that the acquisition is expected to close in the first quarter of 2020. These forward-looking statements are subject to numerous risks, uncertainties and other factors, many of which are outside of the control of NI, including, among others: the failure or inability of Cadence or NI to meet the closing conditions or to otherwise consummate the AWR transaction, the timing and ability to of the parties to obtain regulatory approval, the ability of the parties to realize the expected benefits of the strategic alliance agreement including the integrated product being tightly connected with the NI LabVIEW and PXI modular instrumentation systems, the risk of adverse changes or fluctuations in the global economy, further adverse fluctuations in NI’s industry, foreign exchange fluctuations, fluctuations in demand for NI products including orders from NI’s large customers, component shortages, delays in the release of new products, NI’s ability to effectively manage its operating expenses, manufacturing inefficiencies and the level of capacity utilization, the impact of any recent or future acquisitions by NI, expense overruns, and adverse effects of price changes or effective tax rates. Actual results may differ materially from the expected results. NI directs readers to its Form 10-K for the year ended Dec. 31, 2018, its Form 10-Q for the quarter ended September 30, 2019 and the other documents it files with the SEC for other risks associated with its future performance. NI undertakes no obligation to update any forward-looking statement in this press release. Stockholders are cautioned not to place undue reliance on the forward-looking statements herein, which speak only as of the date such statements are made.\n\n© 2019 Cadence Design Systems, Inc. and National Instruments Corporation. All rights reserved worldwide.\n\nCadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\n\nNational Instruments, NI, ni.com and LabVIEW are trademarks of National Instruments. Other product and company names listed are trademarks or trade names of their respective companies.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005915/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\n\nMarissa Vidaurri\nHead of Investor Relations, National Instruments\n512-773-0856\nmarissa.vidaurri@ni.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence and National Instruments Enter into Strategic Alliance Agreement to Enhance Electronic System Innovation",
        "subtitle": "",
        "date": "Dec 2, 2019 4:05PM EST",
        "content": "    AUSTIN, Texas--(BUSINESS WIRE)--\nNational Instruments Corporation (Nasdaq: NATI) and Cadence Design Systems, Inc. (Nasdaq: CDNS) today announced a system innovation strategic alliance to create an integrated design to test flow, leveraging reusable data and test IP from electronics design and verification to validation and production test for electronic system and semiconductor companies. This strategic alliance builds upon the broad-ranging collaboration that National Instruments (NI) and Cadence initiated in 2018 to improve the overall semiconductor development and testing of next-generation wireless, automotive and mobile integrated circuits (ICs) and modules. Through the strategic alliance agreement, NI and Cadence expect the joint development of technology, methodology and intellectual property to streamline electronics development.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191202005894/en/\nThe objective is to provide customers with a seamless flow from pre-silicon development to post-silicon test, leveraging design, verification and analysis data between Cadence and NI technologies. The collaboration is anchored in analog, mixed-signal and RF integrations around the Cadence® Virtuoso® and Spectre® platforms, and physical data from the NI LabVIEW and PXI modular instrumentation systems, which customers can use to enhance system design via a comprehensive flow from concept to volume production to help them achieve faster time to market and lower overall costs.\n\n“The rapid product expansion in the wireless, consumer, automotive, and aerospace and defense market segments calls for an accelerated pace of system innovation and collaboration,” said Lip Bu Tan, chief executive officer at Cadence. “By working even more closely with NI on this strategic alliance, we aim to deliver an integrated flow from pre-silicon mixed-signal design and verification to post-silicon validation and test, shortening the overall time to electronic product creation.”\n\nCadence and NI also plan to collaborate to define and build a common, connected flow enabling re-use of mixed-signal testbenches and stimulus from pre-silicon design verification to post-silicon validation and production test. Reusable test IP helps customers accelerate their time to market and reduce errors. A goal of the collaboration is to better integrate flows for analog/mixed-signal and RF ICs and modules from design to test.\n\n“Cadence is the ideal partner for National Instruments as we work together to define the next generation of design to test methodology,” said Alex Davern, chief executive officer at National Instruments. “By combining NI’s advanced semiconductor validation and test systems with Cadence’s industry-leading technology in analog mixed-signal and RF design and verification, we can help our customers accelerate time to market, reduce costs and improve product quality. We look forward to working with Cadence to make this vision a reality in a fast-paced environment.”\n\nIn addition to the strategic alliance agreement, Cadence and NI have entered into a definitive agreement pursuant to which Cadence expects to acquire AWR Corporation, a wholly owned subsidiary of NI. For more information, please visit ni.com/nati/news\n\nAbout National Instruments \n\nNI (ni.com) develops high-performance automated test and automated measurement systems to help you solve your engineering challenges now and into the future. Our open, software-defined platform uses modular hardware and an expansive ecosystem to help you turn powerful possibilities into real solutions. Learn more at www.ni.com.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at www.cadence.com.\n\nNational Instruments Forward-Looking Statements \n\nThis press release contains certain forward-looking statements of NI, including statements regarding the expected benefits of the strategic alliance with Cadence, that the alliance will create an integrated design to test flow leveraging reusable data and test IP from electronics design and verification to validation and production test for electronic system and semiconductor companies, that through the system innovation alliance agreement, NI and Cadence expect the joint development of technology, methodology and intellectual property to streamline electronics development, that the objective is to provide customers with a seamless flow from pre-silicon development to post-silicon test, the plan to collaborate to define and build a common, connected flow enabling re-use of mixed-signal testbenches and stimulus from pre-silicon design verification to post-silicon validation and production test, a goal of the collaboration being to better integrate flows for analog/mixed-signal and RF ICs and modules from design to test, that Cadence is the ideal partner for National Instruments as we work together to define the next generation of design to test methodology, and that we can help our customers accelerate time to market, reduce costs and improve product quality. These forward-looking statements are subject to numerous risks, uncertainties and other factors, many of which are outside of the control of NI, including, among others: the failure or inability of Cadence or NI to meet the closing conditions or to otherwise consummate the AWR acquisition transaction, the ability of the parties to realize the expected benefits of the strategic alliance agreement including the integrated product being tightly connected with the NI LabVIEW and PXI modular instrumentation systems, the risk of adverse changes or fluctuations in the global economy, further adverse fluctuations in NI’s industry, foreign exchange fluctuations, fluctuations in demand for NI products including orders from NI’s large customers, component shortages, delays in the release of new products, NI’s ability to effectively manage its operating expenses, manufacturing inefficiencies and the level of capacity utilization, the impact of any recent or future acquisitions by NI, expense overruns, and adverse effects of price changes or effective tax rates. Actual results may differ materially from the expected results. NI directs readers to its Form 10-K for the year ended Dec. 31, 2018, its Form 10-Q for the quarter ended September 30, 2019 and the other documents it files with the SEC for other risks associated with its future performance. NI undertakes no obligation to update any forward-looking statement in this press release. Stockholders are cautioned not to place undue reliance on the forward-looking statements herein, which speak only as of the date such statements are made.\n\nCadence Forward-Looking Statements \n\nThis press release contains forward-looking statements, including statements regarding the expected benefits to Cadence, its products and its customers from the strategic alliance, that are based on current expectations and preliminary assumptions that are subject to factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These forward-looking statements are subject to a number of risks, uncertainties and other factors, many of which are outside Cadence’s control, including the failure or inability to close the acquisition of AWR Corporation by Cadence and to realize the expected benefits of the strategic alliance agreement, the changes in customer demands and markets, and other risk factors set forth in Cadence’s most recent reports on Form 10-K and Form 10-Q. Cadence undertakes no obligation to update any forward-looking statement in this press release.\n\n© 2019 National Instruments Corporation and Cadence Design Systems, Inc. All rights reserved worldwide. \n\nNational Instruments, NI, ni.com and LabVIEW are trademarks of National Instruments. Other product and company names listed are trademarks or trade names of their respective companies.\n\nCadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005894/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\n\nMarissa Vidaurri\nHead of Investor Relations, National Instruments\n512-773-0856\nmarissa.vidaurri@ni.com\nSource: National Instruments and Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Named the #1 Technology Company on Investor’s Business Daily List of the Top 50 ESG Companies",
        "subtitle": "",
        "date": "Nov 20, 2019 4:45PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced it has been named to Investor’s Business Daily’s first-ever Top 50 Environmental, Social and Corporate Governance (ESG) Companies list. The list, which ranks the companies with regard to sustainability and ethical impact, has Cadence ranked #1 in the technology category and #5 overall on the list. For more information on Investor’s Business Daily’s Top 50 ESG Companies, please visit https://www.investors.com/research/best-esg-companies-top-stocks-environmental-social-governance-values/.\n\nTo compile the list, Investor’s Business Daily identified companies with ESG ratings of AAA or AA from MSCI ESG Research as of Sept. 11, 2019. The 50 companies that made the list had the highest IBD Composite Ratings, reflecting broad strength in fundamental and technical areas linked to price performance. Nearly all have a Composite Rating of 80 or higher, putting them in the top 20% of stocks. These ESG leaders span a wide range of businesses, from retail, software and medical products to building products and geothermal energy. Besides recognizing the Best 50 ESG Companies overall, IBD also highlighted the top three in seven broad business categories.\n\n“We are very pleased by the recognition from Investor’s Business Daily for our extensive efforts to provide products that advance the development of sustainable technologies and our work on improving the environmental footprint of our global facilities,” said Lip-Bu Tan, CEO of Cadence. “ESG is an important initiative for us, and we’re honored to be named the #1 company in the technology category and to be #5 overall.”\n\n“Cadence earned the #1 position in the technology category, which was one of the largest categories in IBD's Best ESG Companies list,” said Susan Warfel, managing editor, Investor’s Business Daily. “Cadence held an IBD Composite Rating of 98 at the time of our analysis, putting it in the top 2% of all stocks in the measure, which reflects broad-based strength in fundamental and technical characteristics linked to stock performance. The company’s solid earnings growth record, margins and return on equity were factors in the Composite Rating.”\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005945/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\n\n \nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence’s Lip-Bu Tan to Present at Wells Fargo TMT Summit in Las Vegas",
        "subtitle": "",
        "date": "Nov 19, 2019 5:00PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS)\n\nWHO:\nLip-Bu Tan, chief executive officer, Cadence Design Systems, Inc. (NASDAQ: CDNS). \n\nWHAT:\nMr. Tan will participate in a fireside chat at the Wells Fargo TMT Summit on December 3, 2019 at The Cosmopolitan in Las Vegas, Nevada.\n\nWHEN:\nMr. Tan’s talk will be available live by webcast at 2:45 p.m. PST on Tuesday, December 3, 2019. The presentation will be archived on the Cadence website and available for replay through 5:00 p.m. PST on Friday, January 3, 2020.\n\nWHERE:\nThe webcast will be available online at cadence.com/cadence/investor_relations.\n\nAbout Cadence\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners. \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191119005349/en/\nFor more information, please contact:\nInvestor Relations\nCadence Design Systems, Inc.\n408-944-7100\ninvestor_relations@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence’s John Wall to Present at Nasdaq 41st Investor Conference in London",
        "subtitle": "",
        "date": "Nov 18, 2019 6:00PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS):\n\nWHO:\nJohn Wall, senior vice president and chief financial officer, Cadence Design Systems, Inc. (NASDAQ: CDNS).\n\nWHAT:\nMr. Wall will participate in a fireside chat in addition to hosting individual meetings with investors at the Nasdaq 41st Investor Conference on December 3, 2019 at The May Fair Hotel, London.\n\nWHEN:\nMr. Wall’s talk will be available live by webcast at 11:45 a.m. GMT on Tuesday, December 3, 2019. The presentation will be archived on the Cadence website and available for replay through 5:00 p.m. PST on Friday, January 3, 2020.\n\nWHERE:\nThe webcast will be available online at cadence.com/cadence/investor_relations.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners. \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191118005902/en/\nFor more information, please contact:\nInvestor Relations\nCadence Design Systems, Inc.\n408-944-7100\ninvestor_relations@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "New Cadence UltraLink D2D PHY IP for Die-to-Die Connectivity Enables High-Performance Applications With Cost-Effective Packaging",
        "subtitle": "",
        "date": "Nov 13, 2019 10:45AM EST",
        "content": "\nSilicon-proven, high-bandwidth, low-latency interface extends Cadence high-performance computing IP portfolio for AI/ML, 5G, cloud computing and networking\n\nHighlights\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (Nasdaq: CDNS) today announced the Cadence® UltraLink™ D2D PHY IP, a high-performance, low-latency PHY for die-to-die connectivity targeted at the AI/ML, 5G, cloud computing and networking market segments. The UltraLink D2D PHY IP is an enabling technology for chiplet and system-in-package (SiP) applications, which empower system-on-chip (SoC) providers to deliver more customized solutions that offer higher performance and yields while also shortening development cycles and reducing costs through greater IP reuse. For more information, please visit www.cadence.com/go/ultralink.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191113005154/en/Cadence® Ultralink™ D2D PHY IP 40G Transmit Eye (Graphic: Business Wire)\nThe UltraLink D2D PHY IP delivers up to 40Gbps wire speed in an NRZ serial interface, providing up to 1Tbps/mm unidirectional bandwidth. The IP includes built-in de-skew and scrambling/de-scrambling logic to enable easy system integration. Its low wire count of 28 data wires for 1Tbps bandwidth enables easier routing and potentially reduces package cost, whereas alternative solutions can require 30% or more wires. While some existing lower speed die-to-die solutions require a silicon interposer to achieve the same bandwidth, the UltraLink D2D PHY IP offers significant cost advantages by supporting multi-chip modules on organic substrates. This IP features latency as low as 5ns round trip from receiver to transmitter, utilizes standard non-return-to zero (NRZ) coding and achieves better than 10-15 bit error rate (BER) without requiring forward error correction (FEC). The UltraLink D2D PHY IP is silicon proven in an advanced 7nm FinFET process.\n\n“As AI and ML in the cloud pose more aggressive computing demands, Cadence continues to invest in design and interface IP that addresses our customers’ rapidly evolving requirements,” said Rishi Chugh, vice president of product marketing, IP Group at Cadence. “Maximizing data transfer with minimal area and power consumption is paramount. The UltraLink D2D PHY IP is the latest addition to our HPC IP portfolio and a critical new technology delivering high bandwidth, low power and latency while extending Cadence’s ongoing investment to support heterogeneous integrated packaging solutions and designs.”\n\nThe Cadence UltraLink D2D PHY IP extends Cadence’s broad high-performance computing (HPC) IP portfolio in support of its Intelligent System Design™ strategy, enabling SoC design excellence. It is available now for broad customer engagements.\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine’s 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191113005154/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com    \n\n \nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Two Endowed Professorships Created to Support Carnegie Mellon Computer Science and Electrical and Computer Engineering Faculty",
        "subtitle": "Gifts totaling $6 million by Cadence Design Systems and CEO Lip-Bu Tan to advance emerging technology research and teaching",
        "date": "Nov 12, 2019 3:15PM EST",
        "content": "PITTSBURGH, Nov. 12, 2019 /PRNewswire/ -- Carnegie Mellon University (CMU) today announced that Cadence Design Systems, Inc. (Nasdaq:CDNS) and its CEO, Lip-Bu Tan, have made significant gifts of $3 million each to support faculty members working in computer-related fields at CMU.Cadence, a leading multinational company in the electronic design automation industry, has created the Cadence Design Systems Endowed Chair in Computer Science. Tan and his wife, Ysa Loo, have created the Tan Family Endowed Chair in Electrical and Computer Engineering (ECE). Together, the gifts total $6 million, which will provide funding to advance faculty members' activities, including research and teaching. \"Exceptional people with pioneering ideas have fueled Carnegie Mellon's game-changing research and education from the very beginning, so investing in human capital development is one of the most important ways that we can retain our global leadership,\" CMU President Farnam Jahanian said. \"Endowed professorships provide a singularly powerful tool to support these bright minds, and we are grateful to Cadence, Lip-Bu and Ysa for their exceptional generosity toward this critical priority.\"Cadence's products are used by electronic systems and semiconductor companies to create innovative and transformational end products. Cadence's Academic Network Program, of which CMU is a member, promotes the proliferation of technology expertise among selected universities, research institutes and industry advisors in the area of microelectronic systems development.\"Cadence is privileged to institute an endowed chair in the School of Computer Science,\" said John Shoven, chairman of the Board of Directors of Cadence Design Systems. \"We are fortunate to have many CMU CS graduates on our Cadence team and look forward to enabling the advancement of faculty members' research priorities.\" \"The connection between Cadence's work and computer science cannot be overstated,\" said Martial Hebert, dean of the School of Computer Science. \"This new professorship is another indication of the deepening connections among computer science, electronic design automation and related areas.\" Tan has been the CEO of Cadence since 2009 and joined the company's board of directors in 2004. He is also the founder and chairman of Walden International, a venture capital firm, which he launched in 1987. He is a member of The Business Council and serves on the board of directors of Hewlett Packard Enterprise Company and Schneider Electric SE. Tan also serves on CMU's Board of Trustees and is a member of the College of Engineering's Dean's Advisory Council. The couple's two sons, Andrew and Elliott, both received their master's degrees from CMU's College of Engineering.\"Carnegie Mellon's ECE department has provided world-class education and an incredible learning experience to our two sons,\" Tan said. \"Ysa and I are delighted to support the ECE department as it continues pushing the frontiers of cutting-edge, innovative research.\" Tan and Loo previously endowed a graduate student fellowship in the Department of Electrical and Computer Engineering. \"I'm excited by the opportunity to recognize and support one of our star faculty as the Tan Family Professor in ECE,\" said Jon Cagan, interim dean of the College of Engineering. \"We deeply value the additional support of research in the college by Lip-Bu Tan and his family.\" ABOUT CMUCarnegie Mellon (www.cmu.edu) is a private, internationally ranked university with programs in areas ranging from science, technology and business to public policy, the humanities and the arts. More than 14,000 students in the university's seven schools and colleges benefit from a small faculty-to-student ratio and an education characterized by its focus on creating and implementing solutions for real world problems, interdisciplinary collaboration and innovation.With more than 1,100 students, the Electrical and Computer Engineering Department is the largest in the College of Engineering. This year, its highly regarded programs were ranked by U.S. News & World Report at #2 for computer engineering and #8 for electrical engineering for undergraduate education, and #3 for computer engineering and #8 for electrical engineering for graduate education.The School of Computer Science is consistently ranked among the top programs in the world, including most recently at #1 for both computer science overall and artificial intelligence by U.S. News & World Report. The school, with more than 2,400 enrolled students, recently introduced the first major in artificial intelligence in the U.S. ABOUT CADENCECadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence® software, hardware and semiconductor (IP) are used by customers to deliver products to market faster. The company's Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at www.cadence.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/two-endowed-professorships-created-to-support-carnegie-mellon-computer-science-and-electrical-and-computer-engineering-faculty-300956781.htmlSOURCE  Carnegie Mellon University"
    },
    {
        "title": "Cadence Announces Tempus Power Integrity Solution for Signoff Timing-Aware IR Drop Analysis",
        "subtitle": "",
        "date": "Nov 6, 2019 10:45AM EST",
        "content": "\nHighlights:\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced the Tempus™ Power Integrity Solution, the industry’s first comprehensive static timing/signal integrity analysis and power integrity analysis tool, which enables engineers to create reliable designs at 7nm and below. The Tempus Power Integrity Solution is the result of an integration between the widely used Cadence Tempus Timing Signoff Solution and the Voltus™ IC Power Integrity Solution. Using the new tool, customers can significantly lower IR drop design margins without sacrificing signoff quality, thus improving power and area. Early use cases demonstrated that the Tempus Power Integrity Solution correctly identified IR drop errors, avoiding silicon failure prior to tapeout and improving the maximum frequency in silicon by up to 10%.\n\nFor more information on the Cadence Tempus Power Integrity Solution, visit www.cadence.com/go/tempuspipr.\n\nThe new Tempus Power Integrity Solution combines the proven Cadence Tempus Timing Signoff Solution and Voltus IC Power Integrity Solution signoff engines, which let the designer assess the overall timing impact on IR drop, reducing the engineering workload and speeding design closure. The tool’s other key benefits include:\n\n“IR drop analysis is a key signoff technology that is increasingly critical, especially for today’s high-speed chips operating with highly resistive lower metal layers,” said Marlin Frederick, Jr., Fellow, Physical Design Group at Arm. “Our evaluation of the Tempus Power Integrity Solution highlights that Cadence’s integrated approach provides better coverage than traditional vector-based flows for reasonable amounts of compute.”\n\n“Our relentless focus on creating deep integrations with our complete RTL-to-GDS solution has made it possible to deliver new capabilities that help customers achieve design excellence and in a way that’s unprecedented in the industry,” Dr. Chin-Chi Teng, senior vice president and general manager of the Digital & Signoff Group at Cadence. “The Tempus Power Integrity Solution resolves the issue of timing being dependent on IR drop, and vice-versa. Additionally, our combined signoff engines provide customers with a solution that’s faster and easier to use.”\n\nThe Tempus Power Integrity Solution is part of the broader Cadence digital implementation and signoff full flow, which provides customers with a fast path to design closure and better predictability. The new tool supports the company’s Intelligent System Design™ strategy, enabling advanced-node system-on-chip (SoC) design excellence.\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. Arm is a registered trademark of Arm Limited (or its subsidiaries) in the US and/or elsewhere. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191106005373/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Presented With Four 2019 TSMC Partner of the Year Awards",
        "subtitle": "",
        "date": "Oct 30, 2019 10:45AM EDT",
        "content": "\nCadence achieves recognition for joint development of N6 design infrastructure, SoIC design solution, cloud-based productivity solution and DSP IP\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced that it was presented with four TSMC Partner of the Year awards at the TSMC 2019 Open Innovation Platform® (OIP) Ecosystem Forum. Cadence achieved recognition for the joint development of the N6 design infrastructure, SoIC design solution, cloud-based productivity solution and DSP IP.\n\nThese awards were given to Cadence based on the following work that has been delivered:\n\n“Our continued collaboration with Cadence is enabling our customers to utilize our advanced technologies to design with confidence and meet design goals,” said Suk Lee, TSMC senior director of the Design Infrastructure Marketing Division. “We look forward to seeing our customers unleash their silicon innovations in their respective markets using our advanced N6, TSMC-SoIC®, cloud, and DSP IP solutions.”\n\n“Through our close collaboration with TSMC, we’re enabling mutual customers to consistently deliver successful innovations using our latest technologies,” said Dr. Chin-Chi Teng, senior vice president and general manager of the Digital & Signoff Group at Cadence. “These awards from TSMC exemplify Cadence’s commitment to delivering upon its Intelligent System Design strategy, which enables customers to achieve SoC design excellence.”\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005309/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Announces First-to-Market NVMe 1.4 Verification IP for High-Performance Computing",
        "subtitle": "",
        "date": "Oct 22, 2019 10:45AM EDT",
        "content": "\nCadence VIP with TripleCheck reduces time to market and supports the next-generation NVMe standard\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced the availability of the industry’s first Verification IP (VIP) in support of the new NVM Express 1.4 (NVMe) protocol. The Cadence® VIP for NVMe 1.4 enables designers to quickly and thoroughly verify their storage, data center and high-performance computing (HPC) system-on-chip (SoC) designs with less effort and a greater assurance that the SoC will meet the protocol standards.\n\nThe Cadence VIP for NVMe 1.4 supports the company’s Intelligent System Design™ strategy, enabling SoC design excellence through best-in-class IP. For more information on the Cadence VIP for NVMe 1.4, please visit www.cadence.com/go/NVMeVIP.\n\nThe new Cadence VIP for NVMe 1.4 provides customers with a comprehensive verification solution to develop high-quality NVMe host and device controllers quickly, helping reduce overall time to market. The NVMe 1.4 VIP supports built-in integration with the Cadence VIP for PCI Express® (PCIe®) 5.0 and includes a complete UVM SystemVerilog API for fast integration and SoC-level test creation. Built with Cadence TripleCheck™ technology, customers have access to a verification plan with measurable objectives linked to the specification features and a comprehensive test suite with ready-to-run tests to ensure support for the specification.\n\n“The design team in our company has successfully used the Cadence VIP for NVMe while developing our products for the flash memory controller,” said Mr. Takehiko Tsuchiya, Group Manager, Design Technology Group, Design Technology Innovation Division at KIOXIA Corporation. “The NVMe 1.4 VIP is important for the development of the next generation of our products, supporting the need for a high-performance data interface.”\n\n“The new NVMe 1.4 specification is designed to address the growing needs of enterprise systems that utilize PCIe-based solid-state storage,” said Moshik Rubin, Verification IP Product Management Group Director, System and Verification Group at Cadence. “Cadence is fully dedicated to supporting the latest standard to ensure customers have the tools they need to create differentiated end products. Our release of the first-to-market VIP for NVMe 1.4 is enabling early adopters of the protocol to reduce risk and ensure their designs comply with the specification while achieving the fastest path to IP and SoC verification closure.”\n\nThe Cadence VIP for NVMe 1.4 with TripleCheck technology is part of the Cadence Verification Suite and is optimized for Xcelium™ Parallel Logic Simulation, along with supported third-party simulators. The Verification Suite is comprised of best-in-class core engines, verification fabric technologies that support the Cadence Intelligent System Design strategy, enabling SoC design excellence.\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. PCI Express and PCIe are registered trademarks or trademarks of PCI-SIG. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005331/en/\nFor more information, please contact:\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Reports Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 21, 2019 4:05PM EDT",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced results for the third quarter of 2019.\n\nCadence reported third quarter 2019 revenue of $580 million, compared to revenue of $532 million reported for the same period in 2018. On a GAAP basis, Cadence achieved operating margin of 21 percent and recognized net income of $102 million, or $0.36 per share on a diluted basis, in the third quarter of 2019, compared to operating margin of 19 percent and net income of $99 million, or $0.35 per share on a diluted basis, for the same period in 2018.\n\nUsing the non-GAAP measure defined below, operating margin for the third quarter of 2019 was 32 percent and net income was $153 million, or $0.54 per share on a diluted basis, compared to operating margin of 32 percent and net income of $139 million, or $0.49 per share on a diluted basis, for the same period in 2018.\n\n“Major industry trends led by AI and data analytics are driving strong design activity, which coupled with innovation and outstanding execution by Cadence, again led to strong operating results, as Cadence delivered 9 percent year-over-year revenue growth,” said Lip-Bu Tan, chief executive officer. “Our Intelligent System Design strategy enables us to provide more capabilities and value to our customers, while also expanding our total addressable market.”\n\n“I am pleased with our third quarter results and outlook,” said John Wall, senior vice president and chief financial officer. “We are raising our outlook for revenue, operating margin, earnings and cash from operations for the year while we continue to invest in proliferation opportunities with market-shaping customers.”\n\nCFO Commentary\n\nCommentary on the third quarter 2019 financial results by John Wall, senior vice president and chief financial officer, is available at www.cadence.com/cadence/investor_relations.\n\nBusiness Outlook\n\nFor the fourth quarter of 2019, the company expects total revenue in the range of $590 million to $600 million. Fourth quarter GAAP operating margin is expected to be approximately 20 percent and GAAP net income per diluted share is expected to be in the range of $0.33 to $0.35. Using the non-GAAP measure defined below, operating margin is expected to be approximately 30 percent and net income per diluted share is expected to be in the range of $0.52 to $0.54.\n\nFor 2019, the company expects total revenue in the range of $2.327 billion to $2.337 billion. On a GAAP basis, operating margin is expected to be in the range of 21.3 percent to 21.8 percent and net income per diluted share for 2019 is expected to be in the range of $1.50 to $1.52. Using the non-GAAP measure defined below, operating margin for 2019 is expected to be in the range of 31.5 percent to 32.0 percent and net income per diluted share for 2019 is expected to be in the range of $2.18 to $2.20.\n\nIn October 2019, Cadence initiated a series of transactions involving a realignment of its international operating structure. Cadence expects that this realignment may significantly increase its foreign deferred tax assets. This outlook does not include the income tax impact to GAAP net income related to these transactions. Cadence expects to complete its analysis and record the income tax impact in the fourth quarter of 2019.\n\nA schedule showing a reconciliation of the business outlook from GAAP operating margin, GAAP net income and diluted net income per share to non-GAAP operating margin and non-GAAP net income and diluted net income per share is included in this release.\n\nAudio Webcast Scheduled\n\nLip-Bu Tan, chief executive officer, and John Wall, senior vice president and chief financial officer, will host the third quarter 2019 financial results audio webcast today, October 21, 2019, at 2 p.m. (Pacific) / 5 p.m. (Eastern). Attendees are asked to register at the website at least 10 minutes prior to the scheduled webcast. An archive of the webcast will be available starting October 21, 2019 at 5 p.m. (Pacific) and ending December 13, 2019 at 5 p.m. (Pacific). Webcast access is available at www.cadence.com/cadence/investor_relations.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design™ strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine’s 100 Best Companies to Work For. Learn more at www.cadence.com.\n\nCadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\n\nThe statements contained above, as well as the information in the Business Outlook section, are or include forward-looking statements based on current expectations and preliminary assumptions that are subject to factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. These forward-looking statements are subject to a number of risks, uncertainties and other factors, many of which are outside Cadence’s control, including, among others: (i) Cadence’s ability to compete successfully in the electronic design automation product and the commercial electronic design and methodology services industries; (ii) the success of Cadence’s efforts to improve operational efficiency and growth; (iii) the mix of products and services sold and the timing of significant orders for and delivery of Cadence’s products and services; (iv) change in customer demands that could result in delays in purchases or deliveries of Cadence’s products and services, including those resulting from consolidation among Cadence’s customers, restructurings and other efforts to improve operational efficiency of Cadence’s customers, economic conditions, government regulations or trade restrictions; (v) economic and industry conditions and trade restrictions in regions in which Cadence does business; (vi) fluctuations in rates of exchange between the U.S. dollar and the currencies of other countries in which Cadence does business; (vii) capital expenditure requirements, legislative or regulatory requirements, changes in tax laws, interest rates and Cadence’s ability to access capital and debt markets; (viii) the acquisition of other companies or technologies or the failure to successfully integrate and operate these companies or technologies Cadence acquires, including the potential inability to retain customers, key employees or vendors; (ix) the effects of Cadence’s efforts to improve operational efficiency in its business, including strategic, customer and supplier relationships, and its ability to retain key employees; (x) events that affect cash flow, liquidity, reserves or settlement assumptions Cadence may take from time to time with respect to accounts receivable, taxes and tax examinations, litigation or other matters; and (xi) the effects of any litigation or other proceedings to which Cadence is or may become a party. In addition, the timing and amount of Cadence’s repurchase of its common stock under the authorizations will be subject to business and market conditions, corporate and regulatory requirements, stock price, acquisition opportunities and other factors.\n\nFor a detailed discussion of these and other cautionary statements related to Cadence’s business, please refer to Cadence’s filings with the U.S. Securities and Exchange Commission, which include Cadence’s most recent reports on Form 10-K and Form 10-Q, including Cadence’s future filings.\n\nGAAP to Non-GAAP Reconciliation\n\nNon-GAAP financial measures should not be considered as a substitute for or superior to measures of financial performance prepared in accordance with generally accepted accounting principles, or GAAP. Investors are encouraged to review the reconciliation of non-GAAP financial measures contained within this press release with their most directly comparable GAAP financial results. Investors are also encouraged to look at the GAAP results as the best measure of financial performance.\n\nTo supplement Cadence’s financial results presented on a GAAP basis, Cadence management uses non-GAAP measures that it believes are helpful in understanding Cadence’s performance. One such measure is non-GAAP net income, which is a financial measure not calculated under GAAP. Non-GAAP net income is calculated by Cadence management by taking GAAP net income and excluding, as applicable, amortization of intangible assets, stock-based compensation expense, acquisition and integration-related costs including retention expenses, investment gains or losses, income or expenses related to Cadence’s non-qualified deferred compensation plan, restructuring and other significant items not directly related to Cadence’s core business operations, and the income tax effect of non-GAAP pre-tax adjustments.\n\nCadence management uses non-GAAP net income because it excludes items that are generally not directly related to the performance of Cadence’s core business operations and therefore provides supplemental information to Cadence management and investors regarding the performance of the business operations, facilitates comparisons to the historical operating results and allows the review of Cadence’s business from the same perspective as Cadence management, including forecasting and budgeting.\n\nThe following tables reconcile the specific items excluded from GAAP operating margin, GAAP net income and GAAP net income per diluted share in the calculation of non-GAAP operating margin, non-GAAP net income and non-GAAP net income per diluted share for the periods shown below:\n\nCadence expects that its corporate representatives will meet privately during the quarter with investors, the media, investment analysts and others. At these meetings, Cadence may reiterate the business outlook published in this press release. At the same time, Cadence will keep this press release, including the business outlook, publicly available on its website.\n\nPrior to the start of the Quiet Period (described below), the public may continue to rely on the business outlook contained herein as still being Cadence’s current expectations on matters covered unless Cadence publishes a notice stating otherwise.\n\nBeginning December 13, 2019, Cadence will observe a Quiet Period during which the business outlook as provided in this press release and the most recent Annual Report on Form 10-K and Quarterly Report on Form 10-Q no longer constitute Cadence’s current expectations. During the Quiet Period, the business outlook in these documents should be considered historical, speaking as of prior to the Quiet Period only and not subject to any update by Cadence. During the Quiet Period, Cadence’s representatives will not comment on Cadence’s business outlook, financial results or expectations. The Quiet Period will extend until Cadence’s fourth quarter 2019 earnings release is published, which is currently scheduled for February 12, 2020.\n\nCDNS-IR\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005759/en/\nCadence Investor Relations\n408-944-7100\ninvestor_relations@cadence.com\n\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Custom/AMS Flow Certified for Samsung 5LPE Process Technology",
        "subtitle": "",
        "date": "Oct 17, 2019 10:55AM EDT",
        "content": "\nSamsung and Cadence collaborate to deliver an integrated flow for designing analog and mixed-signal applications at the 5nm node\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced that its custom and analog/mixed-signal (AMS) IC design flow has achieved certification for Samsung Foundry’s 5nm Low-Power Early (5LPE) process technology. This certification ensures mutual customers of Cadence and Samsung Foundry have immediate access to a highly automated circuit design, layout, signoff and verification flow needed to design efficiently at 5LPE.\n\nThe automated Cadence® custom and AMS full flow supports the company’s Intelligent System Design™ strategy, enabling SoC design excellence. For more information on the Cadence custom and AMS flow that supports the Samsung 5LPE process technology, visit www.cadence.com/go/Samsung5LPE.\n\nThe certified Cadence custom and AMS flow enables customers to develop their solutions using the 5LPE process for automotive, mobile, data center, artificial intelligence (AI) and other emerging applications. The tools in the flow incorporate key features that are well suited for digitally assisted analog designs such as high performance, best-in-class analysis and verification capabilities developed in the Cadence Spectre® Accelerated Parallel Simulator (APS). Additionally, the Cadence Virtuoso® Layout flow provides a high level of automation and integration, enabling faster design closure with reduced numbers of iterations critical for completing complex designs at the 5LPE process.\n\nThe complete custom and AMS flow that is certified by Samsung Foundry includes the Virtuoso Analog Design Environment (ADE), Virtuoso Schematic Editor, Virtuoso Layout Suite, Virtuoso Space-Based Router, Virtuoso Layout Suite EAD, Virtuoso Integrated Physical Verification System, Spectre APS, Voltus™-Fi Custom Power Integrity Solution, Quantus™ Extraction Solution, Litho Physical Analyzer (LPA), LDE Electrical Analyzer (LEA) and Physical Verification System (PVS). Key technical capabilities include:\n\nIn addition to the custom and AMS flow certification, a process design kit (PDK) techfile is now Mixed-Signal Open Access-ready, allowing customers to use the highly integrated Virtuoso-Innovus™ Implementation System flow. This enables users to create a layout, and to perform static timing analysis and signoff for mixed-signal designs more effectively and in a shorter amount of time.\n\n“We’ve validated that the entire Cadence AMS flow meets our requirements for designing at 5LPE technology,” said Jongshin Shin, vice president of Foundry IP Development Team at Samsung Electronics. “This high-performance flow represents a major milestone in our ongoing collaboration. With the Cadence flow now readily available, customers have access to advanced capabilities needed to design applications more efficiently, while meeting rigorous market requirements.”\n\n“In collaboration with Samsung, we’ve achieved certification for our integrated flow for AMS design at 5LPE to drive the advancement of next-generation designs,” said Wilbur Luo, vice president, product management in the Custom IC and PCB Group at Cadence. “Based on the industry-leading Virtuoso and Spectre platforms, the flow enables highly efficient design of AMS IP at this advanced node for use in complex SoCs for mobile, data center and AI applications.”\n\nAbout Cadence \n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191017005168/en/\nFor more information, please contact:\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence Automotive Reference Flow Certified by Samsung Foundry for Advanced-Node Design Creation",
        "subtitle": "",
        "date": "Oct 17, 2019 10:50AM EDT",
        "content": "\nHighlights:\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced that Samsung Foundry certified a new Cadence® reference flow for the creation of advanced-node automotive designs. Cadence and Samsung Foundry collaborated on the development of the reference design, which was validated using the Samsung Foundry 8nm Low-Power Plus (8LPP) process technology. The certified flow is available on a wide range of Samsung Foundry nodes and includes the Cadence digital implementation and signoff, verification and custom IC design suites, offering customers optimal power, performance and area (PPA) and a faster path to achieving automotive system-on-chip (SoC) safety, quality and reliability targets. For more information, customers can contact Samsung Foundry.\n\nThe certified Cadence automotive flow includes the following technologies:\n\n“The investment between Samsung and Cadence on this automotive reference flow provides our customers with a complete solution for functional safety, reliability and quality,” said Jung Yun Choi, vice president of the Design Technology Team at Samsung Electronics. “The Cadence flow has been through extensive validation at Samsung Foundry. Through our collaborative work, our mutual customers can now adopt this high-performance flow with confidence to create innovative automotive applications on a wide range of process technologies.”\n\n“Through our collaboration with Samsung Foundry and our focus on semiconductor design excellence across all aspects of the design and verification flow, we’re enabling our customers to deliver the next generation of automotive and safety-critical systems,” said Alessandra Nardi, automotive solution engineering group director at Cadence. “Samsung Foundry has confirmed, through certification, that our flow is ready for use, and we look forward to collaborating with customers using this new flow that is optimized for automotive designs.”\n\nThe Cadence automotive reference flow, including the digital and signoff, verification and custom IC design suites, provides customers with a faster path to design closure and better predictability. The reference flow supports the company’s Intelligent System Design™ strategy, facilitating advanced-node system-on-chip (SoC) design excellence for automotive applications. Furthermore, the Cadence tools in the automotive reference flow are included in automotive Functional Safety Documentation Kits, which have achieved the “Fit for Purpose – Tool Confidence Level 1 (TCL1)” certification, enabling automotive semiconductor manufacturers, OEMs and component suppliers to meet stringent ISO 26262 automotive safety requirements. For more information on the Cadence automotive solution, visit www.cadence.com/go/autospr.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191017005344/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    },
    {
        "title": "Cadence 3D-IC Advanced Packaging Integration Flow Certified by Samsung Foundry for its 7LPP Process Technology",
        "subtitle": "",
        "date": "Oct 17, 2019 10:45AM EDT",
        "content": "\nCadence full flow enables the planning, implementation and analysis of advanced multi-die and chiplet-based IC packaging\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nCadence Design Systems, Inc. (NASDAQ: CDNS) today announced that the complete, integrated Cadence® 3D-IC advanced packaging integration flow has achieved certification for the Samsung Foundry MDI™ (Multi-Die-Integration) packaging flow based on the 7nm Low Power Process (7LPP) technology. The reference flow was developed in close collaboration with Samsung Foundry to provide mutual customers with a full planning, implementation and analysis flow for 3D multi-die packages. For more information on the Cadence tools that support the Samsung Foundry MDI packaging technology, please visit www.cadence.com/go/3dicspr.\n\nThe use of multiple stacked chips in a single package is becoming a key trend for mobile, IoT and data center designs, which is also extending into the AI and 5G market segments due to the rapid and efficient integration of complete functions that can be implemented via the optimal process node into a system in package (SiP). The Cadence technology provides customers with analysis, implementation and physical verification capabilities within a single canvas and offers unique, early-stage system-level pathfinding and highly-complex design capabilities for 3D signoff. The Cadence flow has been optimized to enable customers to achieve all the benefits the Samsung Foundry MDI packaging technology has to offer in order to deliver new products to market with greater speed and agility.\n\n“Mutual customers addressing various types of design sizes and complexities can benefit from the new MDI flow based on Cadence’s flexible suite of advanced 3D packaging tools, which aims to support the integration of multiple application-specific die and chiplets into a single packaged device that is optimized for their target application,” said Jung Yun Choi, vice president of Foundry Design Technology Team at Samsung Electronics. “This collaboration between Cadence and Samsung provides customers with both reduction in cost and turnaround time through the accurate, broad analysis of system-level and complex interconnects.”\n\nA full suite of Cadence digital and signoff as well as IC package and PCB analysis tools have been optimized for the Samsung MDI technology to guarantee seamless integration for handling multiple dies including the Innovus™ Implementation System, Quantus™ Extraction Solution, Tempus™ Timing Signoff Solution, Voltus™ IC Power Integrity Solution, OrbitIO™ interconnect designer, SiP Layout, Sigrity™ XtractIM™ technology, Sigrity XcitePI™ technology, Sigrity SystemSI™ technology, and Sigrity PowerDC™ technology.\n\n“This is an example of how, through our continued partnership with Samsung Foundry, we’re developing innovative solutions for our mutual customers,” said KT Moore, vice president, product management, Digital & Signoff Group at Cadence. “This seamless 3D integrated flow developed by Cadence and Samsung Foundry enables our customers to design multi-die offerings in a single integrated environment, enabling the delivery of complex products much faster.”\n\nThe Cadence 3D-IC packaging flow provides a fast path to design closure and supports the company’s overall Intelligent System Design™ strategy, enabling advanced-node system-on-chip (SoC) design excellence.\n\nAbout Cadence\n\nCadence enables electronic systems and semiconductor companies to create the innovative end products that are transforming the way people live, work and play. Cadence’s software, hardware and semiconductor IP are used by customers to deliver products to market faster. The company’s Intelligent System Design strategy helps customers develop differentiated products—from chips to boards to intelligent systems—in mobile, consumer, cloud, data center, automotive, aerospace, IoT, industrial and other market segments. Cadence is listed as one of Fortune Magazine's 100 Best Companies to Work For. Learn more at cadence.com.\n\n© 2019 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. in the US and/or elsewhere. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191017005275/en/\nCadence Newsroom\n408-944-7039\nnewsroom@cadence.com\nSource: Cadence Design Systems, Inc."
    }
]