[
    {
        "title": "Benjamin D. Chereskin to Retire from CDW’s Board of Directors",
        "subtitle": "",
        "date": "Feb 28, 2020 8:30AM EST",
        "content": "    LINCOLNSHIRE, Ill.--(BUSINESS WIRE)--\nCDW Corporation (NASDAQ:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that Benjamin D. Chereskin will retire from CDW’s board of directors immediately prior to CDW’s 2020 annual meeting of stockholders, consistent with the Company’s policy on term limits.\n\n“I want to thank Ben for his 12 years of dedicated service to CDW,” said Christine A. Leahy, chief executive officer, CDW. “Ben’s personal commitment, insights and contributions on the board were invaluable as we shaped and executed against our strategic plans for profitable sustainable growth and superior returns. Ben’s steadfast dedication to success on behalf of our stakeholders has been greatly appreciated.”\n\n“Serving on the CDW board has been an honor,” Chereskin said. “I’m proud to have played some part in the profitable growth and success of CDW. But the real credit goes to the leadership team and nearly 10,000 coworkers who have a relentless focus on understanding and delivering for their customers every day. I look forward to cheering on their continued success.”\n\nAbout CDW \n\nCDW Corporation (Nasdaq: CDW) is a leading multi-brand technology solutions provider of business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and a member of the S&P 500 Index, CDW was founded in 1984 and employs almost 10,000 coworkers. For the year ended December 31, 2019, the company generated Net sales over $18 billion. For more information about CDW, please visit www.CDW.com.\n\nCDWPR-CO\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200228005090/en/\nInvestor Inquiries\nBrittany A. Smith\nVice President, Investor Relations and Financial Planning and Analysis\n847-968-0238\ninvestorrelations@cdw.com\n\nMedia Inquiries\nSara Granack\nVice President, Corporate Communications\n847-419-7411\nmediarelations@cdw.com\nSource: CDW Corporation"
    },
    {
        "title": "CDW to Present at the Raymond James 41st Annual Institutional Investors Conference",
        "subtitle": "",
        "date": "Feb 25, 2020 4:15PM EST",
        "content": "LINCOLNSHIRE, Ill., Feb.  25, 2020  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that Christine A. Leahy, chief executive officer, CDW, will present at the Raymond James 41st Annual Institutional Investors Conference to be held at the JW Marriott Orlando Grande Lakes in Orlando, Florida on Monday, March 2, 2020, at 8:40 am ET/7:40 am CT. The presentation will also be webcast live at http://investor.cdw.com. An archived copy of the presentation will be available for 180 days on the same website.About CDWCDW Corporation (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs almost 10,000 coworkers. For the year ended December 31, 2019, the company generated Net sales over $18 billion. For more information about CDW, please visit www.CDW.com.Investor Inquiries                      Brittany A. Smith                   Vice President, Investor Relations andFinancial Planning and Analysis(847) 968-0238Media InquiriesSara GranackVice President, Corporate Communications(847) 419-7411"
    },
    {
        "title": "CDW Declares Quarterly Cash Dividend of $0.380 Per Share",
        "subtitle": "",
        "date": "Feb 6, 2020 7:05AM EST",
        "content": "LINCOLNSHIRE, Ill., Feb.  06, 2020  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW), today announced that its Board of Directors has declared a quarterly cash dividend of $0.380 per common share to be paid on March 10, 2020 to all stockholders of record as of the close of business on February 25, 2020.  This represents a 28.8 percent increase over last year’s dividend. Future dividends will be subject to Board of Director approval.“Annual dividend increases are an important part of our capital allocation strategy, along with maintaining our leverage ratio, making strategic acquisitions and share repurchases,\" said Collin B. Kebo, chief financial officer, CDW. “Since our IPO in June 2013, our dividend has increased nearly nine-fold and we have returned more than $2.9 billion to shareholders through share repurchases and dividends. We intend to continue to execute against our capital allocation priorities to deliver value to our shareholders just as we’ve delivered value to our customers and partners for over 35 years.”About CDWCDW Corporation (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and a member of the S&P 500 Index, CDW was founded in 1984 and employs almost 10,000 coworkers. For the year ended December 31, 2019, the company generated Net sales over $18 billion. For more information about CDW, please visit www.CDW.com.Forward-Looking StatementsStatements in this release that are not statements of historical fact are forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including without limitation statements regarding the future dividends, earnings growth, leverage ratio and other strategic plans of CDW. These statements involve risks and uncertainties that could cause actual results to differ materially from those described in such statements. Although CDW believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to have been correct. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions \"Forward-Looking Statements\" and \"Risk Factors\" in CDW's Annual Report on Form 10-K for the year ended December 31, 2018 and subsequent filings with the SEC. CDW undertakes no obligation to update or revise any of its forward-looking statements, whether as a result of new information, future events or otherwise, unless required by law.Investor InquiriesBrittany A. SmithVice President, Investor Relations and Financial Planning and Analysis847-968-0238investorrelations@cdw.comMedia InquiriesSara GranackVice President, Corporate Communications847-419-7411mediarelations@cdw.com"
    },
    {
        "title": "CDW Reports Record Fourth Quarter and Full Year Net Sales",
        "subtitle": "",
        "date": "Feb 6, 2020 7:00AM EST",
        "content": "LINCOLNSHIRE, Ill., Feb.  06, 2020  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced fourth quarter and year end 2019 results. CDW also announced the approval by its Board of Directors of a quarterly cash dividend to be paid in March 2020.\"We delivered excellent topline growth and profitability in the quarter and for the full year while continuing to invest in the future and deliver shareholder value,\" said Christine A. Leahy, chief executive officer, CDW. \"These results reinforce the strength of our strategy and power of our business model - underpinned by our balance across customer end markets, the breadth of our product and solutions portfolio and the ongoing execution of our strategy for growth.\"\"Excellent operating results were amplified by share repurchases, delivering an 18 percent increase in Non-GAAP net income per diluted share for 2019,\" said Collin B. Kebo, chief financial officer, CDW. \"Our performance drove strong free cash flow and enabled us to return $840 million to our shareholders in 2019 through share repurchases and dividends.\"\"For 2020, we expect to continue to outpace US IT market growth by 200 to 300 basis points on a constant currency basis. To accomplish this, we will continue our laser-focus on meeting the needs of our more than 250,000 customers in the United States, the United Kingdom and Canada and remaining the partner of choice for more than 1,000 leading and emerging technology brands as the technology market continues to evolve,\" concluded Leahy.A quarterly cash dividend of $0.380 per share, which is 28.8 percent higher than the prior year period, will be paid on March 10, 2020 to all stockholders of record as of the close of business on February 25, 2020.Fourth Quarter of 2019 Highlights:Total Net sales in the fourth quarter of 2019 were $4,537 million, compared to $4,075 million in the fourth quarter of 2018, an increase of 11.3 percent. There were 63 selling days for both the three months ended December 31, 2019 and 2018. Net sales on a constant currency basis increased 11.3 percent versus the fourth quarter of 2018. Fourth quarter Net sales performance included:Gross profit was $778 million in the fourth quarter of 2019, compared to $694 million in the fourth quarter of  2018, representing an increase of 12.1 percent. Gross profit margin was 17.1 percent in the fourth quarter of 2019 versus 17.0 percent in the fourth quarter in 2018.  This increase was primarily driven by product margin, partially offset by the mix of netted down revenues that are booked net of cost of goods sold not growing as fast as Net sales.Total selling and administrative expenses, including advertising expense, were $494 million in the fourth quarter of 2019, compared to $451 million in the fourth quarter of 2018, representing an increase of 9.5 percent. This increase was primarily driven by higher sales payroll expenses consistent with higher gross profit.Operating income was $284 million in the fourth quarter of 2019, compared to $243 million in the fourth quarter of 2018, representing an increase of 16.8 percent. Non-GAAP operating income was $342 million in the fourth quarter of 2019, compared to $300 million in the fourth quarter of 2018, representing an increase of 14.3 percent. The Non-GAAP operating income margin was 7.5 percent for the fourth quarter of 2019 versus 7.3 percent in the fourth quarter of 2018.Net interest expense was $38 million in the fourth quarter of 2019, compared to $37 million in the fourth quarter of 2018, representing an increase of 3.2 percent.The effective tax rate was 21.4 percent in the fourth quarter of 2019, compared to 22.9 percent in the fourth quarter of 2018, which resulted in tax expense of $50 million and $47 million, respectively.Net income was $186 million in the fourth quarter of 2019, compared to $159 million in the fourth quarter of 2018, representing an increase of 16.5 percent. Non-GAAP net income was $229 million in the fourth quarter of 2019, compared to $201 million in the fourth quarter of 2018, representing an increase of 14.2 percent.Weighted average diluted shares outstanding were 146 million for the fourth quarter of 2019, compared to 152 million for the fourth quarter of 2018. Net income per diluted share for the fourth quarter of 2019 was $1.27, compared to $1.05 for the fourth quarter of 2018, representing an increase of 20.8 percent. Non-GAAP net income per diluted share for the fourth quarter of 2019 was $1.57, compared to $1.32 for the fourth quarter of 2018, representing an increase of 18.4 percent.Full Year 2019 Highlights:Total Net sales in 2019 were $18,032 million, compared to $16,241 million in 2018, an increase of 11.0 percent. There were 254 selling days for both the years ended December 31, 2019 and 2018. Net sales growth on a constant currency basis was 11.5 percent. Currency impact to Net sales growth was primarily driven by unfavorable translation of the British pound and Canadian dollar to the US dollar. Full year Net sales performance included:Gross profit was $3,040 million in 2019, compared to $2,707 million for 2018, representing an increase of 12.3 percent. Gross profit margin was 16.9 percent in 2019 versus 16.7 percent in 2018. Gross profit margin was positively impacted by product margin and an increase in the mix of netted down revenues that are booked net of costs of goods sold, partially offset by Net sales growth outpacing partner funding growth.Total selling and administrative expenses, including advertising expense, were $1,906 million in 2019, compared to $1,720 million in 2018, representing an increase of 10.9 percent. This increase was primarily driven by higher sales payroll expenses consistent with higher gross profit.Operating income was $1,134 million in 2019, compared to $987 million in 2018, representing an increase of 14.8 percent. Non-GAAP operating income was $1,368 million in 2019, compared to $1,217 million for 2018, representing an increase of 12.5 percent. The Non-GAAP operating income margin was 7.6 percent for 2019 versus 7.5 percent for 2018.Net interest expense was $159 million in 2019, compared to $149 million in 2018, representing an increase of 7.3 percent. This increase was primarily due to paying an effective interest rate on the term loan in 2019 that exceeded the capped rate in 2018 and higher interest expense to finance the Scalar acquisition.The effective tax rate was 22.4 percent in 2019, compared to 23.5 percent in 2018, which resulted in tax expense of $213 million and $198 million, respectively.Net income was $737 million in 2019, compared to $643 million in 2018, representing an increase of 14.6 percent. Non-GAAP net income was $902 million in 2019, compared to $794 million in 2018, representing an increase of 13.6 percent.Weighted average diluted shares outstanding were 148 million in 2019, compared to 154 million in 2018. Net income per diluted share in 2019 was $4.99, compared to $4.19 in 2018, representing an increase of 19.1 percent. Non-GAAP net income per diluted share in 2019 was $6.10, compared to $5.17 in 2018, representing an increase of 18.0 percent.Forward-Looking StatementsStatements in this release that are not statements of historical fact are forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including without limitation statements regarding the future financial performance of CDW. These statements involve risks and uncertainties that could cause actual results to differ materially from those described in such statements. These risks and uncertainties include, among others, global and regional economic and political conditions; decreases in spending on technology products and services; CDW's relationships with vendor partners and availability of their products; continued innovations in hardware, software and services offerings by CDW's vendor partners; substantial competition that could reduce CDW's market share; CDW's substantial indebtedness and ability to generate sufficient cash to service such indebtedness; restrictions imposed by agreements relating to CDW's indebtedness on its operations and liquidity; changes in, or the discontinuation of, CDW's share repurchase program or dividend payments; the continuing development, maintenance and operation of CDW's information technology systems; potential breaches of data security and failure to protect our information technology systems from cybersecurity threats; potential failures to comply with Public segment contracts or applicable laws and regulations; potential failures to provide high-quality services to CDW's customers; potential losses of any key personnel; potential interruptions of the flow of products from suppliers; potential adverse occurrences at one of CDW's primary facilities or customer data centers; increases in the cost of commercial delivery services or disruptions of those services; CDW's exposure to accounts receivable and inventory risks; fluctuations in foreign currency; future acquisitions or alliances; fluctuations in CDW's operating results; current and future legal proceedings and audits; changes in laws, including regulations or interpretations thereof; and other risk factors or uncertainties identified from time to time in CDW's filings with the SEC. Although CDW believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to have been correct. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions \"Forward-Looking Statements\" and \"Risk Factors\" in CDW's Annual Report on Form 10-K for the year ended December 31, 2018 and subsequent filings with the SEC. CDW undertakes no obligation to update or revise any of its forward-looking statements, whether as a result of new information, future events or otherwise, unless required by law.Non-GAAP Financial InformationNon-GAAP operating income excludes, among other things, charges related to the amortization of acquisition-related intangible assets, equity-based compensation and related payroll taxes, and acquisition and integration expenses. Non-GAAP operating income margin is defined as Non-GAAP operating income as a percentage of Net sales. Non-GAAP income before income taxes and Non-GAAP net income exclude, among other things, charges related to acquisition-related intangible asset amortization, equity-based compensation, acquisition and integration expenses, and the associated tax effects of each. Net sales growth on a constant currency basis is defined as Net sales growth excluding the impact of foreign currency translation on Net sales compared to the prior period.Non-GAAP operating income, Non-GAAP operating income margin, Non-GAAP income before income taxes, Non-GAAP net income, Non-GAAP net income per diluted share and Net sales growth on a constant currency basis are considered non-GAAP financial measures. Generally, a non-GAAP financial measure is a numerical measure of a company’s performance or financial position that either excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with GAAP.CDW believes these measures provide analysts, investors and management with helpful information regarding the underlying operating performance of CDW’s business, as they remove the impact of items that management believes are not reflective of underlying operating performance. CDW uses these measures to evaluate period-over-period performance as management believes they provide a more comparable measure of the underlying business.Our annual targets are provided on a non-GAAP basis because certain reconciling items are dependent on future events that either cannot be controlled, such as currency impacts or interest rates, or reliably predicted because they are not part of CDW's routine activities, such as refinancing activities or acquisition and integration expenses.The financial statement tables that accompany this press release include a reconciliation of non-GAAP financial measures to the applicable most comparable GAAP financial measures. Non-GAAP measures used by CDW may differ from similar measures used by other companies, even when similar terms are used to identify such measures.About CDWCDW Corporation (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs almost 10,000 coworkers. For the year ended December 31, 2019, the company generated net sales over $18 billion. For more information about CDW, please visit www.CDW.com.WebcastCDW Corporation will hold a conference call today, February 6, 2020 at 7:30 a.m. CT/8:30 a.m. ET to discuss its fourth quarter and full year financial results. The conference call, which will be broadcast live via the Internet, and a copy of this press release along with supplemental slides used during the call, can be accessed on CDW’s website at investor.cdw.com. For those unable to participate in the live call, a replay of the webcast will be available at investor.cdw.com approximately 90 minutes after the completion of the call and will be accessible on the site for approximately one year.Investor Inquiries Brittany A. Smith Vice President, Investor Relations andFinancial Planning and Analysis (847) 968-0238Media InquiriesSara GranackVice President, Corporate Communications(847) 419-7411CDWPR-FI CDW CORPORATION AND SUBSIDIARIESCONSOLIDATED STATEMENTS OF OPERATIONS(dollars in millions, except per share amounts)    * Not meaningful(i)  There were 63 selling days for both the three months ended December 31, 2019 and 2018.  There were 254 selling days for both the years ended December 31, 2019 and 2018.CDW CORPORATION AND SUBSIDIARIESNON-GAAP FINANCIAL MEASURE RECONCILIATIONSCDW has included reconciliations of Non-GAAP operating income, Non-GAAP operating income margin, Non-GAAP income before income taxes, Non-GAAP net income, Non-GAAP net income per diluted share and Net sales growth on a constant currency basis for the three months and years ended December 31, 2019 and 2018 below.CDW CORPORATION AND SUBSIDIARIESNON-GAAP OPERATING INCOME AND NON-GAAP OPERATING INCOME MARGIN(dollars in millions)(unaudited)(i)  Includes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.(ii)  Includes other expenses such as payroll taxes on equity-based compensation.CDW CORPORATION AND SUBSIDIARIESNON-GAAP INCOME BEFORE INCOME TAXES, NON-GAAP NET INCOMEAND NON-GAAP NET INCOME PER DILUTED SHARE(dollars in millions, except per share amounts)(unaudited)(i)  Income tax on non-GAAP adjustments includes excess tax benefits associated with equity-based compensation and the impact of global intangible low-tax income (\"GILTI\") due to equity-based compensation and the amortization of intangibles.(ii)  Includes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.(iii)  Includes other expenses such as payroll taxes on equity-based compensation.CDW CORPORATION AND SUBSIDIARIESNON-GAAP INCOME BEFORE INCOME TAXES, NON-GAAP NET INCOMEAND NON-GAAP NET INCOME PER DILUTED SHARE(dollars in millions, except per share amounts)(unaudited)(i)  Income tax on non-GAAP adjustments includes excess tax benefits associated with equity-based compensation and the impact of GILTI due to equity-based compensation and the amortization of intangibles.(ii)  Includes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.(iii)  Includes a $3 million discrete tax benefit related to CDW Canada's acquisition of Scalar.(iv)  Includes other expenses such as payroll taxes on equity-based compensation.CDW CORPORATION AND SUBSIDIARIESNET SALES GROWTH ON A CONSTANT CURRENCY BASIS(dollars in millions)(unaudited)(i)  There were 63 selling days for both the three months ended December 31, 2019 and 2018.  There were 254 selling days for both the years ended December 31, 2019 and 2018.(ii)  Represents the effect of translating the prior period results of CDW UK and CDW Canada at the average exchange rates applicable in the current period.CDW CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED BALANCE SHEETS(dollars in millions) CDW CORPORATION AND SUBSIDIARIESNET SALES DETAIL(dollars in millions)(i)  There were 63 selling days for both the three months ended December 31, 2019 and 2018. There were 254 selling days for both the years ended December 31, 2019 and 2018.CDW CORPORATION AND SUBSIDIARIESDEBT AND WORKING CAPITAL INFORMATION(dollars in millions)(unaudited)(i)  Based on a rolling three-month average.CDW CORPORATION AND SUBSIDIARIESCASH FLOW INFORMATION(dollars in millions)(i)  Includes expenditures for revenue generating assets."
    },
    {
        "title": "CDW to Announce Fourth Quarter and Full Year 2019 Results on February 6",
        "subtitle": "",
        "date": "Jan 23, 2020 7:00AM EST",
        "content": "LINCOLNSHIRE, Ill., Jan.  23, 2020  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that it will host a webcast conference call to discuss its fourth quarter and full year 2019 results on Thursday, February 6, 2020 at 8:30 a.m. ET/7:30 a.m. CT.A live webcast (audio with slides) of the conference call will be accessible at investor.CDW.com. The press release and presentation slides will be posted on this website prior to the call. Please visit the website at least fifteen minutes prior to the call to register and to download and install any necessary software. A taped replay of the webcast will be available on the website shortly after the call.For questions, please email investorrelations@cdw.com.About CDWCDW Corporation (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,800 coworkers. For the trailing twelve months ended September 30, 2019, the company generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Investor InquiriesBrittany A. SmithVice President, Investor Relations andFinancial Planning and Analysis847-968-0238investorrelations@cdw.comMedia InquiriesSara GranackVice President, Corporate Communications847-419-7411mediarelations@cdw.com"
    },
    {
        "title": "CDW Names Christina Corley Chief Commercial and Operating Officer and Welcomes Sona Chawla as Chief Growth and Innovation Officer",
        "subtitle": "",
        "date": "Jan 21, 2020 9:20AM EST",
        "content": "LINCOLNSHIRE, Ill., Jan.  21, 2020  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq: CDW), announced today that Christina (Chris) M. Corley has been named chief commercial and operating officer.  Corley has held leadership roles of increasing responsibility since joining CDW in 2011, most recently serving as chief operating officer.  She will continue reporting to Chief Executive Officer, Christine A. Leahy, leading all of CDW’s customer-facing organizations globally, including sales, integrated technology solutions, CDW’s services business and international business units.“Chris is an outstanding leader who puts customers firmly at the center of all we do, and consistently delivers market-outperforming growth,” said Leahy.  “Her new title reflects the impact she has had and will continue to have on our customers’ success as CDW continues to grow and operate in a more complex, rapidly changing world.”The company also announced the addition of Sona Chawla to CDW in the newly formed role of chief growth and innovation officer, reporting to Leahy.Chawla joins CDW with a distinguished track record of success shaping omni-channel sales operations, building eCommerce businesses, developing digital platforms and driving innovation.  Most recently, Chawla was president at Kohl’s, and prior to that, chief operating officer.  Before Kohl’s, Chawla was at Walgreens, serving as president, digital and chief marketing officer.  “Sona is an exceptionally talented, agile executive and proven digital innovator at several Fortune 500 companies,” said Leahy.  “Her breadth of experience, passion for delivering results for customers, and strength in leading high-performing teams will be invaluable as CDW continues to advance its digital capabilities and offerings.  I look forward to her contributions working alongside our highly-talented executive committee and broader CDW team.”Forward-Looking Statements This press release includes “forward-looking statements.” Forward-looking statements are subject to known and unknown risks and uncertainties, many of which may be beyond our control, that could cause actual results to differ materially from those described in such statements. Such risks and uncertainties include, but are not limited to, the executive team’s ability to execute on future growth opportunities and other strategic plans of CDW. Although CDW believes that the forward-looking information presented in this press release is reasonable, it can give no assurance that such expectations will prove correct, and actual events may differ materially from those made in or suggested by the forward-looking information contained in this press release. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions “Forward-Looking Statements” and “Risk Factors” in CDW’s Annual Report on Form 10-K for the year ended December 31, 2018 and subsequent filings with the SEC. Any forward looking information presented herein is made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking information to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.About CDW CDW Corporation (Nasdaq: CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,800 coworkers. For the trailing twelve months ended September 30, 2019, CDW generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Investor InquiriesBrittany A. SmithVice President, Investor Relations andFinancial Planning and Analysis847-968-0238investorrelations@cdw.comMedia InquiriesSara GranackVice President, Corporate Communications847-419-7411mediarelations@cdw.com "
    },
    {
        "title": "CDW Announces Board Transition",
        "subtitle": "",
        "date": "Dec 23, 2019 8:30AM EST",
        "content": "\nCDW Names David W. Nelms Non-Executive Chairman of the Board\n    LINCOLNSHIRE, Ill.--(BUSINESS WIRE)--\nCDW Corporation (Nasdaq: CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers, today announced that David W. Nelms will become non-executive chairman of the board, effective January 1, 2020. He will succeed Thomas E. Richards, executive chairman, who will retire from the board as of December 31, 2019. This chairman succession is the culmination of a leadership transition that began several years ago.\n\n“David has been a valued board member for the past six years, and our entire board is pleased that he has accepted this additional leadership role and special responsibility to contribute to and serve CDW in this capacity,” said Christine A. Leahy, chief executive officer, CDW. “I look forward to working with David and our full board as CDW continues to execute our growth strategy.”\n\nLeahy also recognized the special role that Tom Richards has had in CDW’s success: “I am proud and privileged, on behalf of our Board of Directors and more than 9,800 coworkers and all CDW stakeholders, to thank Tom for his decade of exceptional contribution and service. Tom reminded us daily of our opportunity and responsibility to ‘make a difference,’ and Tom most surely did so. His exceptional legacy will carry on in countless ways.”\n\n“I am honored to serve as the next chairman for a company with such a rich history and bright future,” Nelms said. “I want to personally thank Tom for the excellent stewardship he has provided as chairman and for his outstanding leadership over a decade of service to CDW.”\n\nForward-Looking Statements\nThis press release includes “forward-looking statements.” Forward-looking statements are subject to known and unknown risks and uncertainties, many of which may be beyond our control that could cause actual results to differ materially from those described in such statements. Such risks and uncertainties include, but are not limited to, our anticipated Board leadership transition and the outlook for and future growth of CDW. Although CDW believes that the forward-looking information presented in this press release is reasonable, it can give no assurance that such expectations will prove correct, and actual events may differ materially from those made in or suggested by the forward-looking information contained in this press release. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions “Forward-Looking Statements” and “Risk Factors” in CDW’s Annual Report on Form 10-K for the year ended December 31, 2018 and subsequent filings with the SEC. Any forward-looking information presented herein is made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking information to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.\n\nAbout CDW\nCDW Corporation (Nasdaq: CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,800 coworkers. For the trailing twelve months ended September 30, 2019, CDW generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.\n\nCDWPR-CO\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191223005283/en/\nInvestor Inquiries\nBrittany A. Smith\nVice President, Investor Relations and\nFinancial Planning and Analysis\n847-968-0238\ninvestorrelations@cdw.com\n\nMedia Inquiries\nSara Granack\nVice President, Corporate Communications\n847-419-7411\nmediarelations@cdw.com\nSource: CDW Corporation"
    },
    {
        "title": "CDW to Participate in the Credit Suisse 23rd Annual Technology Conference",
        "subtitle": "",
        "date": "Nov 20, 2019 4:15PM EST",
        "content": "LINCOLNSHIRE, Ill., Nov.  20, 2019  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that Christine Leahy, chief executive officer, CDW, and Collin Kebo, chief financial officer, CDW, will participate in a question and answer session at the Credit Suisse 23rd Annual Technology Conference to be held at The Phoenician in Scottsdale, Arizona on Tuesday, December 3, 2019, at 8:45 am MT / 10:45 am ET.The session will be webcast live at http://investor.cdw.com/. An archived copy of the webcast will be available for 180 days on the same website.About CDWCDW Corporation (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,800 coworkers. For the trailing twelve months ended September 30, 2019, CDW generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Investor InquiriesBrittany A. SmithVice President, Investor Relations andFinancial Planning and Analysis(847) 968-0238Media InquiriesSara GranackVice President, Corporate Communications(847) 419-7411"
    },
    {
        "title": "CDW Declares Quarterly Cash Dividend of $0.38 Per Share, Updates Payout Ratio Target",
        "subtitle": "",
        "date": "Oct 31, 2019 7:05AM EDT",
        "content": "LINCOLNSHIRE, Ill., Oct.  31, 2019  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW) announced that earlier today its Board of Directors declared a quarterly cash dividend of $0.38 per common share to be paid on December 10, 2019 to all shareholders of record as of the close of business on November 25, 2019.  This represents a 28.8 percent increase over last year’s dividend.  The annualized fourth quarter dividend puts the company on track to achieve the target of delivering a dividend payout of 30 percent of free cash flow by year-end 2019, which was announced in November 2014. Future dividends will be subject to Board of Director approval. “Going forward, we will target our annualized fourth quarter dividend to be approximately 25 percent of Non-GAAP net income, updating the dividend to grow in-line with earnings,\" said Collin Kebo, chief financial officer, CDW. “Annual dividend increases are an important part of our capital allocation strategy, along with maintaining our leverage ratio, making strategic acquisitions and share repurchases.  Since our IPO in June 2013, our dividend has increased nearly nine-fold and we have returned more than $2.7 billion to shareholders through share repurchases and dividends.”About CDWCDW Corporation (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and a member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,800 coworkers. For the trailing twelve months ended September 30, 2019, the company generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Forward-Looking StatementsStatements in this release that are not statements of historical fact are forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including without limitation statements regarding the future dividends, earnings growth, leverage ratio and other strategic plans of CDW. These statements involve risks and uncertainties that could cause actual results to differ materially from those described in such statements. Although CDW believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to have been correct. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions \"Forward-Looking Statements\" and \"Risk Factors\" in CDW's Annual Report on Form 10-K for the year ended December 31, 2018 and subsequent filings with the SEC. CDW undertakes no obligation to update or revise any of its forward-looking statements, whether as a result of new information, future events or otherwise, unless required by law.Investor InquiriesBrittany A. SmithVice President, Investor Relations andFinancial Planning and Analysis847-968-0238investorrelations@cdw.comMedia InquiriesSara GranackVice President, Corporate Communications847-419-7411mediarelations@cdw.comCDWPR-FI "
    },
    {
        "title": "CDW Reports Record Third Quarter Net Sales",
        "subtitle": "",
        "date": "Oct 31, 2019 7:00AM EDT",
        "content": "LINCOLNSHIRE, Ill., Oct.  31, 2019  (GLOBE NEWSWIRE) -- CDW Corporation (Nasdaq:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced third quarter results. CDW also announced the approval by its Board of Directors of a 28.8 percent increase to its quarterly cash dividend. The cash dividend of $0.38 per share will be paid on December 10, 2019 to all stockholders of record as of the close of business on November 25, 2019.\"We delivered excellent topline growth and profitability in the quarter while continuing to invest in the future and deliver shareholder value,\" said Christine Leahy, chief executive officer, CDW. \"These results reinforce the strength of our strategy and power of our business model - underpinned by balanced performance across our customer end markets, the breadth of our product and solutions portfolio and the ongoing execution of our strategy for growth.\"\"Excellent operating results were amplified by share repurchases, delivering a 20 percent increase in Non-GAAP net income per diluted share,\" said Collin Kebo, chief financial officer, CDW. \"Given this quarter's results and our expectations for the balance of the year, we are now targeting 2019 constant currency Non-GAAP net income per diluted share growth in the mid-teens.\"\"We expect to exceed our 2019 target to outpace US IT market growth by 200 to 300 basis points on a constant currency organic basis. To accomplish this, we will continue our laser focus on meeting the needs of our more than 250,000 customers in the United States, the United Kingdom and Canada and remaining the partner of choice for more than 1,000 leading and emerging technology brands as the technology market continues to evolve,\" concluded Leahy.Third Quarter of 2019 Highlights:Total Net sales in the third quarter of 2019 were $4,908 million, compared to $4,373 million in the third quarter of 2018, an increase of 12.2 percent. There were 64 and 63 selling days for the three months ended September 30, 2019 and 2018, respectively. Net sales growth on an average daily sales basis was 10.5 percent and Net sales growth on a constant currency average daily sales basis was 10.9 percent. Currency impact to Net sales growth was driven by unfavorable translation of the British pound and Canadian dollar to US dollar. Third quarter Net sales performance, on an average daily sales basis, included:Gross profit for the third quarter of 2019 was $816 million, compared to $714 million for the same period in 2018, representing an increase of 14.4 percent. Gross profit margin was 16.6 percent for the third quarter of 2019 versus 16.3 percent in the third quarter of 2018. Gross profit margin was positively impacted by an increase in the mix of netted down revenues, such as Software as a Service and warranties.Total selling and administrative expenses, including advertising expense, were $496 million in the third quarter of 2019, compared to $439 million in the third quarter of 2018, representing an increase of 13.0 percent. This was primarily driven by increased sales payroll expenses, the inclusion of Scalar expenses, and performance-based compensation consistent with higher attainment against goals.Operating income was $321 million in the third quarter of 2019, compared to $275 million in the third quarter of 2018, an increase of 16.7 percent. Non-GAAP operating income was $380 million in the third quarter of 2019, compared to $334 million in the third quarter of 2018, representing an increase of 13.9 percent. The Non-GAAP operating income margin was 7.8 percent for the third quarter of 2019 versus 7.6 percent in the third quarter of 2018.Net interest expense was $42 million in the third quarter of 2019 compared to $37 million in the third quarter of 2018, representing an increase of 15.6 percent. This increase was primarily due to paying an effective interest rate on the term loan in 2019 that exceeded the capped rate in 2018.The effective tax rate for the third quarter of 2019 was 22.7 percent, compared to 22.9 percent for the third quarter of 2018, which resulted in tax expense of $59 million and $55 million, respectively.Net income was $202 million in the third quarter of 2019, compared to $184 million in the third quarter of 2018, representing an increase of 9.8 percent. Non-GAAP net income was $250 million in the third quarter of 2019, compared to $218 million in the third quarter of 2018, representing an increase of 14.8 percent.Weighted average diluted shares outstanding were 147 million for the third quarter of 2019, compared to 154 million for the third quarter of 2018. Net income per diluted share for the third quarter of 2019 was $1.37, compared to $1.20 for the third quarter of 2018, representing an increase of 14.6 percent. Non-GAAP net income per diluted share for the third quarter of 2019 was $1.70, compared to $1.42 for the third quarter of 2018, representing an increase of 19.8 percent.Year to Date 2019 Highlights:Total Net sales in the first nine months (\"year to date\") of 2019 were $13,495 million, compared to $12,166 million for year to date 2018, an increase of 10.9 percent. There were 191 selling days for both 2019 and 2018 periods. Net sales growth on a constant currency basis was 11.6 percent. Currency impact to Net sales growth was driven by unfavorable translation of the British pound and Canadian dollar to US dollar. The year to date Net sales performance included:Gross profit for year to date 2019 was $2,262 million, compared to $2,013 million for 2018, representing an increase of 12.4 percent. Gross profit margin was 16.8 percent for year to date 2019 versus 16.5 percent for 2018.  Gross profit margin was positively impacted by an increase in the mix of netted down revenues, such as Software as a Service and warranties.Total selling and administrative expenses, including advertising expense, were $1,413 million for year to date 2019, compared to $1,269 million for 2018, representing an increase of 11.3 percent. This increase was primarily driven by increased sales payroll expenses, the inclusion of Scalar expenses, and performance-based compensation consistent with higher attainment against goals.Operating income was $850 million for year to date 2019, compared to $744 million in 2018, an increase of 14.2 percent. Non-GAAP operating income was $1,026 million for year to date 2019, compared to $917 million for 2018, representing an increase of 11.9 percent. The Non-GAAP operating income margin was 7.6 percent for 2019 versus 7.5 percent for 2018.Net interest expense was $121 million for year to date 2019 compared to $112 million for 2018, representing an increase of 8.6 percent. This increase was primarily due to paying an effective interest rate on the term loan in 2019 that exceeded the capped rate in 2018.The effective tax rate for year to date 2019 was 22.8 percent, which resulted in tax expense of $162 million, compared to a 23.7 percent effective tax rate and tax expense of $150 million for 2018. The decrease in the effective tax rate primarily reflects higher excess tax benefits on equity-based compensation and a discrete tax benefit related to CDW Canada's acquisition of Scalar.Net income was $551 million for year to date 2019, compared to $484 million for 2018, representing an increase of 14.0 percent. Non-GAAP net income was $673 million for year to date 2019, compared to $594 million for 2018, representing an increase of 13.4 percent.Weighted average diluted shares outstanding were 148 million for year to date 2019, compared to 154 million for 2018. Net income per diluted share for year to date 2019 was $3.72 compared to $3.14 for 2018, representing an increase of 18.5 percent. Non-GAAP net income per diluted share for year to date 2019 was $4.54, compared to $3.85 for 2018, representing an increase of 17.9 percent.Forward-Looking StatementsStatements in this release that are not statements of historical fact are forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including without limitation statements regarding the future financial performance of CDW. These statements involve risks and uncertainties that could cause actual results to differ materially from those described in such statements. These risks and uncertainties include, among others, global and regional economic and political conditions; decreases in spending on technology products and services; CDW's relationships with vendor partners and availability of their products; continued innovations in hardware, software and services offerings by CDW's vendor partners; substantial competition that could reduce CDW's market share; CDW's substantial indebtedness and ability to generate sufficient cash to service such indebtedness; restrictions imposed by agreements relating to CDW's indebtedness on its operations and liquidity; changes in, or the discontinuation of, CDW's share repurchase program or dividend payments; the continuing development, maintenance and operation of CDW's information technology systems; potential breaches of data security and failure to protect our information technology systems from cybersecurity threats; potential failures to comply with Public segment contracts or applicable laws and regulations; potential failures to provide high-quality services to CDW's customers; potential losses of any key personnel; potential interruptions of the flow of products from suppliers; potential adverse occurrences at one of CDW's primary facilities or customer data centers; increases in the cost of commercial delivery services or disruptions of those services; CDW's exposure to accounts receivable and inventory risks; fluctuations in foreign currency; future acquisitions or alliances; fluctuations in CDW's operating results; current and future legal proceedings and audits; changes in laws, including regulations or interpretations thereof; and other risk factors or uncertainties identified from time to time in CDW's filings with the SEC. Although CDW believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to have been correct. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions \"Forward-Looking Statements\" and \"Risk Factors\" in CDW's Annual Report on Form 10-K for the year ended December 31, 2018 and subsequent filings with the SEC. CDW undertakes no obligation to update or revise any of its forward-looking statements, whether as a result of new information, future events or otherwise, unless required by law.Non-GAAP Financial InformationNon-GAAP operating income excludes, among other things, charges related to the amortization of acquisition-related intangible assets, equity-based compensation and related payroll taxes, and acquisition and integration expenses. Non-GAAP operating income margin is defined as Non-GAAP operating income as a percentage of Net sales. Non-GAAP income before income taxes and Non-GAAP net income exclude, among other things, charges related to acquisition-related intangible asset amortization, equity-based compensation, net loss on extinguishment of long-term debt, acquisition and integration expenses, and the associated tax effects of each. Net sales growth on a constant currency basis is defined as Net sales growth excluding the impact of foreign currency translation on Net sales compared to the prior period.Non-GAAP operating income, Non-GAAP operating income margin, Non-GAAP income before income taxes, Non-GAAP net income, Non-GAAP net income per diluted share and Net sales growth on a constant currency basis are considered non-GAAP financial measures. Generally, a non-GAAP financial measure is a numerical measure of a company’s performance or financial position that either excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with GAAP.CDW believes these measures provide analysts, investors and management with helpful information regarding the underlying operating performance of CDW's business, as they remove the impact of items that management believes are not reflective of underlying operating performance. CDW uses these measures to evaluate period-over-period performance as management believes they provide a more comparable measure of the underlying business.Our annual targets are provided on a non-GAAP basis because certain reconciling items are dependent on future events that either cannot be controlled, such as currency impacts or interest rates, or reliably predicted because they are not part of CDW's routine activities, such as refinancing activities or acquisition and integration expenses.The financial statement tables that accompany this press release include a reconciliation of non-GAAP financial measures to the applicable most comparable GAAP financial measures. Non-GAAP measures used by CDW may differ from similar measures used by other companies, even when similar terms are used to identify such measures.About CDWCDW (Nasdaq:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,800 coworkers. For the trailing twelve months ended September 30, 2019, CDW generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.WebcastCDW will hold a conference call today, October 31, 2019 at 7:30 a.m. CT/8:30 a.m. ET to discuss its third quarter financial results. The conference call, which will be broadcast live via the Internet, and a copy of this press release along with supplemental slides used during the call, can be accessed on CDW’s website at investor.cdw.com. For those unable to participate in the live call, a replay of the webcast will be available at investor.cdw.com approximately 90 minutes after the completion of the call and will be accessible on the site for approximately one year.Investor Inquiries                                                                           Brittany A. Smith                                                                            Vice President, Investor Relations and                      Financial Planning and Analysis                                 (847) 968-0238                                                                              Media InquiriesSara GranackVice President, Corporate Communications(847) 419-7411CDWPR-FICDW CORPORATION AND SUBSIDIARIESCONSOLIDATED STATEMENTS OF OPERATIONS(dollars and shares in millions, except per-share amounts)(unaudited)*Not meaningful(i) There were 64 and 63 selling days for the three months ended September 30, 2019 and 2018, respectively. There were 191 selling days for both the nine months ended September 30, 2019 and 2018.CDW CORPORATION AND SUBSIDIARIESNON-GAAP FINANCIAL MEASURE RECONCILIATIONSCDW has included reconciliations of Non-GAAP operating income, Non-GAAP operating income margin, Non-GAAP income before income taxes, Non-GAAP net income, Non-GAAP net income per diluted share and Net sales growth on a constant currency basis for the three and nine months ended September 30, 2019 and 2018 below.CDW CORPORATION AND SUBSIDIARIESNON-GAAP OPERATING INCOME AND NON-GAAP OPERATING INCOME MARGIN(dollars in millions)(unaudited)(i) Includes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.(ii) Includes other expenses such as payroll taxes on equity-based compensation.NON-GAAP INCOME BEFORE INCOME TAXES, NON-GAAP NET INCOMEAND NON-GAAP NET INCOME PER DILUTED SHARE(dollars and shares in millions, except per-share amounts)(unaudited)(i) Income tax on non-GAAP adjustments includes excess tax benefits associated with equity-based compensation and the impact of global intangible low tax income (“GILTI”) due to equity-based compensation and amortization of intangibles.(ii) Includes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.(iii) Includes other expenses such as payroll taxes on equity-based compensation.CDW CORPORATION AND SUBSIDIARIESNON-GAAP INCOME BEFORE INCOME TAXES, NON-GAAP NET INCOMEAND NON-GAAP NET INCOME PER DILUTED SHARE(dollars and shares in millions, except per-share amounts)(unaudited)(i) Income tax on non-GAAP adjustments includes excess tax benefits associated with equity-based compensation and the impact of GILTI due to equity-based compensation and amortization of intangibles.(ii) Includes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.(iii) Includes a $3 million discrete tax benefit related to CDW Canada's acquisition of Scalar.(iv) Includes other expenses such as payroll taxes on equity-based compensation.CDW CORPORATION AND SUBSIDIARIESNET SALES GROWTH ON A CONSTANT CURRENCY BASIS(dollars in millions)(unaudited)(i) There were 64 and 63 selling days for the three months ended September 30, 2019 and 2018, respectively.(ii) There were 191 selling days for both the nine months ended September 30, 2019 and 2018.(iii) Represents the effect of translating the prior year results of CDW UK and CDW Canada at the average exchange rates applicable in the current year.CDW CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED BALANCE SHEETS(dollars in millions)CDW CORPORATION AND SUBSIDIARIESNET SALES DETAIL(dollars in millions)(unaudited)(i) There were 64 and 63 selling days for the three months ended September 30, 2019 and 2018, respectively. There were 191 selling days for both the nine months ended September 30, 2019 and 2018.CDW CORPORATION AND SUBSIDIARIESDEBT AND WORKING CAPITAL INFORMATION(dollars in millions)(i)   Based on a rolling three-month average.CDW CORPORATION AND SUBSIDIARIESCASH FLOW INFORMATION(dollars in millions)(unaudited)"
    },
    {
        "title": "CDW to Announce Third Quarter 2019 Results on October 31",
        "subtitle": "",
        "date": "Oct 17, 2019 7:00AM EDT",
        "content": "LINCOLNSHIRE, Ill., Oct.  17, 2019  (GLOBE NEWSWIRE) -- CDW Corporation (NASDAQ:CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that it will host a webcast conference call to discuss its third quarter 2019 results on Thursday, October 31, 2019 at 8:30 a.m. ET/7:30 a.m. CT.A live webcast (audio with slides) of the conference call will be accessible at investor.CDW.com. The press release and presentation slides will be posted on this website prior to the call. Please visit the website at least fifteen minutes prior to the call to register and to download and install any necessary software. A taped replay of the webcast will be available on the website shortly after the call.For questions, please email investorrelations@cdw.com.About CDWCDW Corporation (NASDAQ:CDW) is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&P 500 Index, CDW was founded in 1984 and employs more than 9,700 coworkers. For the trailing twelve months ended June 30, 2019, the company generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Investor Inquiries Brittany A. Smith Vice President, Investor Relations and Financial Planning and Analysis 847-968-0238 investorrelations@cdw.com Media InquiriesSara GranackVice President, Corporate Communications847-419-7411mediarelations@cdw.com CDWPR-FI"
    },
    {
        "title": "CDW Set to Join S&P 500",
        "subtitle": "",
        "date": "Sep 17, 2019 6:23PM EDT",
        "content": "NEW YORK, Sept. 17, 2019 /PRNewswire/ -- CDW Corp. (NASD: CDW) will replace Total System Services Inc. (NYSE: TSS) in the S&P 500 effective prior to the open of trading on Monday, September 23.  S&P 500 constituent Global Payments Inc. (NYSE: GPN) is acquiring Total System Services in a transaction expected to be completed after the market close today. CDW Corp provides integrated information technology solutions to business, government, education, and healthcare customers. Headquartered in Lincolnshire, IL the company will be added to the S&P 500 GICS (Global Industry Classification Standard) Technology Distributors index.Following is a summary of the change:For more information about S&P Dow Jones Indices, please visit www.spdji.comABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has become home to over 1,000,000 indices across the spectrum of asset classes that have helped define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit www.spdji.com.FOR MORE INFORMATION:S&P Dow Jones Indicesindex_services@spglobal.comMedia Inquiriesspdji.comms@spglobal.comIndex Governance InquiriesIGCC@spglobal.com  View original content:http://www.prnewswire.com/news-releases/cdw-set-to-join-sp-500-300920269.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "CDW Corporation Announces Upsizing and Pricing of Registered Offering of $600 Million of Senior Notes due 2028",
        "subtitle": "",
        "date": "Sep 12, 2019 4:45PM EDT",
        "content": "LINCOLNSHIRE, Ill., Sept.  12, 2019  (GLOBE NEWSWIRE) -- CDW Corporation (NASDAQ: CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that its wholly owned subsidiaries CDW LLC and CDW Finance Corporation (together, the “Issuers”) have priced an offering of $600 million in aggregate principal amount of 4.25% senior notes due 2028 (the “Notes”), representing an increase of $50 million in aggregate principal amount from the initially proposed offering size, in an offering registered under the Securities Act of 1933, as amended (the “Note Offering”). The Notes were priced at 100% of par. The sale of the Notes is expected to be completed on September 26, 2019, subject to customary closing conditions.The Issuers intend to use the proceeds from the Note Offering, (a) to fund the redemption of all of their outstanding $525 million aggregate principal amount of Senior Notes due 2023 (the “2023 Senior Notes”) at a redemption price of 102.5% of the principal amount redeemed plus accrued and unpaid interest to the date of redemption and (b) to pay fees and expenses related to such redemption and the Note Offering. The remaining proceeds will be used for general corporate purposes. The Issuers have issued a conditional notice of redemption to holders of the 2023 Senior Notes. The redemption of the 2023 Senior Notes is contingent upon the closing of the Notes Offering.The Notes will be fully and unconditionally guaranteed, jointly and severally, on a senior unsecured basis by CDW Corporation and by certain of CDW LLC’s current and future direct and indirect wholly owned domestic subsidiaries.Morgan Stanley & Co. LLC, J.P. Morgan Securities LLC, Barclays Capital Inc., Goldman Sachs & Co. LLC, MUFG Securities Americas Inc. and Wells Fargo Securities, LLC are acting as joint book‑running managers and BofA Securities, Inc., Capital One Securities, Inc., RBC Capital Markets, LLC and U.S. Bancorp Investments, Inc. are acting as co-managers for the Note Offering. The Note Offering is being made only by means of a prospectus supplement and an accompanying base prospectus. Copies of the preliminary prospectus supplement and the accompanying base prospectus relating to the Note Offering may be obtained from (i) Morgan Stanley & Co. LLC, Attention:  Prospectus Department, 180 Varick Street, New York, NY 10014, by telephone (toll-free) at (866) 718-1649 or by e-mail at prospectus@morganstanley.com, (ii) J.P. Morgan Securities LLC, 383 Madison Avenue, 3rd Floor, New York, NY 10179, Attention: Syndicate Desk or by telephone (toll-free) at (800) 245-8812 or by e-mail at hy_syndicate@restricted.chase.com, (iii) Barclays Capital Inc., c/o Broadridge Financial Solutions , 1155 Long Island Avenue, Edgewood, NY 11717 by e-mail at Barclaysprospectus@broadridge.com, (iv) Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, telephone: 1-866-471-2526, facsimile: 212-902-9316 or by emailing Prospectus-ny@ny.email.gs.com, (v) MUFG Securities Americas Inc., Attention: Capital Markets Group, 1221 Avenue of the Americas, 6th Floor, New York, NY 10020 by telephone at (877) 649-6848, (vi) Wells Fargo Securities, LLC, by telephone (toll-free) at (800) 326-5897, (vii) BofA Securities, Inc., BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte NC  28255-0001, Attn: Prospectus Department, or by email at dg.prospectus_requests@baml.com, (viii) RBC Capital Markets, LLC, 200 Vesey Street, 8th Floor New York, New York 10281, Attention: Leveraged Capital Markets; or by telephone at 1-877-280-1299 or (ix) U.S. Bancorp Investments, Inc., by telephone (toll-free) at (877) 558-2607.CDW Corporation, the Issuers and the subsidiary guarantors of the Notes filed a Registration Statement on Form S-3ASR, which was effective upon filing on October 16, 2017, including a base prospectus dated October 16, 2017, and a preliminary prospectus supplement dated September 12, 2019, to which this communication relates. Copies of the Registration Statement on Form S-3ASR, the base prospectus and the preliminary prospectus supplement and, when available, copies of the final prospectus supplement can be accessed through the Securities and Exchange Commission’s website at www.sec.gov.This press release is for informational purposes only and shall not constitute (i) an offer to sell or the solicitation of an offer to buy the Notes or any other securities or (ii) an offer to buy, or a notice of redemption with respect to, the 2023 Senior Notes or any other securities. The Note Offering is not being made to any person in any jurisdiction in which the offer, solicitation or sale is unlawful. Forward-Looking StatementsThis press release includes “forward-looking statements,” including with respect to the Note Offering and the anticipated redemption of the 2023 Senior Notes. Forward-looking statements are subject to known and unknown risks and uncertainties, many of which may be beyond our control that could cause actual results to differ materially from those described in such statements. Such risks and uncertainties include, but are not limited to, whether the Issuers will consummate the Note Offering, which is subject to customary closing conditions, and the anticipated use of the proceeds of the Note Offering. Although CDW believes that the forward-looking information presented in this press release are reasonable, it can give no assurance that such expectations will prove correct, and actual events may differ materially from those made in or suggested by the forward-looking information contained in this press release. Any forward‑looking information presented herein is made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking information to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.About CDWCDW is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company with multi-national capabilities, CDW was founded in 1984 and employs more than 9,700 coworkers. For the trailing twelve months ended June 30, 2019, the company generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Contact:Investor Inquiries:Brittany A. SmithVice President, Investor Relations and Financial Planning and Analysis(847) 968-0238Media Inquiries:Sara GranackVice President, Corporate Communications(847) 419-7411CDWPR-FI"
    },
    {
        "title": "CDW Corporation Announces Proposed Registered Offering of $550 Million of Senior Notes due 2028",
        "subtitle": "",
        "date": "Sep 12, 2019 7:05AM EDT",
        "content": "LINCOLNSHIRE, Ill., Sept.  12, 2019  (GLOBE NEWSWIRE) -- CDW Corporation (NASDAQ: CDW), a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that its wholly owned subsidiaries CDW LLC and CDW Finance Corporation (together, the “Issuers”) intend to offer, subject to market and other customary conditions, $550 million in aggregate principal amount of senior notes due 2028 (the “Notes”) in an offering registered under the Securities Act of 1933, as amended (the “Note Offering”).The Issuers intend to use the proceeds from the Note Offering, (a) to fund the redemption of all of their outstanding $525 million aggregate principal amount of Senior Notes due 2023 (the “2023 Senior Notes”) at a redemption price of 102.5% of the principal amount redeemed plus accrued and unpaid interest to the date of redemption and (b) to pay fees and expenses related to such redemption and the Note Offering. Any remaining proceeds may be used for general corporate purposes. The Issuers have issued a conditional notice of redemption to holders of the 2023 Senior Notes. The redemption of the 2023 Senior Notes is contingent upon the pricing and closing of the Note Offering.The Notes will be fully and unconditionally guaranteed, jointly and severally, on a senior unsecured basis by CDW Corporation and by certain of CDW LLC’s current and future direct and indirect wholly owned domestic subsidiaries.Morgan Stanley & Co. LLC, J.P. Morgan Securities LLC, Barclays Capital Inc., Goldman Sachs & Co. LLC, MUFG Securities Americas Inc. and Wells Fargo Securities, LLC are acting as joint book‑running managers and BofA Securities, Inc., Capital One Securities, Inc., RBC Capital Markets, LLC and U.S. Bancorp Investments, Inc. are acting as co-managers for the Note Offering. The Note Offering is being made only by means of a prospectus supplement and an accompanying base prospectus. Copies of the preliminary prospectus supplement and the accompanying base prospectus relating to the Note Offering may be obtained from (i) Morgan Stanley & Co. LLC, Attention:  Prospectus Department, 180 Varick Street, New York, NY 10014, by telephone (toll-free) at (866) 718-1649 or by e-mail at prospectus@morganstanley.com,  (ii) J.P. Morgan Securities LLC, 383 Madison Avenue, 3rd Floor, New York, NY 10179, Attention: Syndicate Desk or by telephone (toll-free) at (800) 245-8812 or by e-mail at hy_syndicate@restricted.chase.com, (iii) Barclays Capital Inc., c/o Broadridge Financial Solutions , 1155 Long Island Avenue, Edgewood, NY 11717 by e-mail at Barclaysprospectus@broadridge.com, (iv) Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, telephone: 1-866-471-2526, facsimile: 212-902-9316 or by emailing Prospectus-ny@ny.email.gs.com, (v) MUFG Securities Americas Inc., Attention: Capital Markets Group, 1221 Avenue of the Americas, 6th Floor, New York, NY 10020 by telephone at (877) 649-6848, (vi) Wells Fargo Securities, LLC, by telephone (toll-free) at (800) 326-5897, (vii) BofA Securities, Inc., BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte NC  28255-0001, Attn: Prospectus Department, or by email at dg.prospectus_requests@baml.com, (viii) RBC Capital Markets, LLC, 200 Vesey Street, 8th Floor New York, New York 10281, Attention: Leveraged Capital Markets; or by telephone at 1-877-280-1299 or (ix) U.S. Bancorp Investments, Inc., by telephone (toll-free) at (877) 558-2607.CDW Corporation, the Issuers and the subsidiary guarantors of the Notes filed a Registration Statement on Form S-3ASR, which was effective upon filing on October 16, 2017, including a base prospectus dated October 16, 2017, and a preliminary prospectus supplement dated September 12, 2019, to which this communication relates. Copies of the Registration Statement on Form S-3ASR, the base prospectus and the preliminary prospectus supplement can be accessed through the Securities and Exchange Commission’s website at www.sec.gov.This press release is for informational purposes only and shall not constitute (i) an offer to sell or the solicitation of an offer to buy the Notes or any other securities or (ii) an offer to buy, or a notice of redemption with respect to, the 2023 Senior Notes or any other securities. The Note Offering is not being made to any person in any jurisdiction in which the offer, solicitation or sale is unlawful.Forward-Looking StatementsThis press release includes “forward-looking statements,” including with respect to the proposed Note Offering and the anticipated redemption of the 2023 Senior Notes. Forward-looking statements are subject to known and unknown risks and uncertainties, many of which may be beyond our control that could cause actual results to differ materially from those described in such statements. Such risks and uncertainties include, but are not limited to, whether the Issuers will in fact offer the Notes or consummate the Note Offering, which is subject to various conditions, and the anticipated use of the proceeds of the Note Offering. Although CDW believes that the forward-looking information presented in this press release are reasonable, it can give no assurance that such expectations will prove correct, and actual events may differ materially from those made in or suggested by the forward-looking information contained in this press release. Any forward‑looking information presented herein is made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking information to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.About CDWCDW is a leading multi-brand technology solutions provider to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company with multi-national capabilities, CDW was founded in 1984 and employs more than 9,700 coworkers. For the trailing twelve months ended June 30, 2019, the company generated Net sales over $17 billion. For more information about CDW, please visit www.CDW.com.Contact:Investor Inquiries:                                                         Brittany A. Smith                                                           Vice President, Investor Relations and                            Financial Planning and Analysis                                     (847) 968-0238Media Inquiries:Sara GranackVice President, Corporate Communications(847) 419-7411CDWPR-FI"
    },
    {
        "title": "CDW to Announce First Quarter 2019 Results on May 1",
        "subtitle": "",
        "date": "Apr 17, 2019 7:00AM EDT",
        "content": "LINCOLNSHIRE, Ill., April 17, 2019 (GLOBE NEWSWIRE) -- CDW Corporation (NASDAQ:CDW), a leading provider of technology solutions to business, government, education and healthcare, announced that it will host a webcast conference call to discuss its first quarter 2019 results on Wednesday, May 1, 2019 at 8:30 a.m. ET/7:30 a.m. CT.A live webcast (audio with slides) of the conference call will be accessible at investor.CDW.com. The press release, financial highlights and presentation slides will be posted on this website prior to the call. Please visit the website at least fifteen minutes prior to the call to register and to download and install any necessary software. A taped replay of the webcast will be available on the website shortly after the call.For questions, please email investorrelations@cdw.com.About CDWCDW is a leading multi-brand technology solutions provider to business, government, education and healthcare organizations in the United States, the United Kingdom and Canada. A Fortune 500 company with multi-national capabilities, CDW was founded in 1984 and employs more than 9,000 coworkers. For the year ended December 31, 2018, the company generated net sales over $16 billion. For more information about CDW, please visit www.CDW.com.Investor InquiriesBeth CoronelliVice President, Investor Relations(847) 419-7524investorrelations@cdw.com Media InquiriesSara GranackVice President, Corporate Communications(847) 419-7411mediarelations@cdw.comCDWPR-FI   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: CDW Corporation"
    },
    {
        "title": "CDW to Participate in Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Feb 21, 2019 7:00AM EST",
        "content": "LINCOLNSHIRE, Ill., Feb. 21, 2019 (GLOBE NEWSWIRE) -- CDW Corporation (NASDAQ:CDW), a leading provider of technology solutions to business, government, education and healthcare, announced today that Christine A. Leahy, chief executive officer of CDW, and Collin B. Kebo, senior vice president and chief financial officer, will participate in a question and answer session at the Morgan Stanley Technology, Media & Telecom Conference to be held at the Palace Hotel in San Francisco, California on Thursday, February 28, 2019 at 8:25 am PST/10:25 am CST. The session will be webcast live on http://investor.cdw.com. An archived copy of the webcast will be available for 180 days on the same website.Christine A. Leahy will also present at the Raymond James 40th Annual Institutional Investors Conference to be held at the JW Marriott Orlando Grande Lakes in Orlando, Florida on Monday, March 4, 2019 at 7:30 am EST/6:30 am CST. The presentation will also be webcast live on http://investor.cdw.com. An archived copy of the presentation will be available for 180 days on the same website.About CDWCDW is a leading multi-brand technology solutions provider to business, government, education and healthcare organizations in the United States, the United Kingdom and Canada. A Fortune 500 company with multi-national capabilities, CDW was founded in 1984 and employs more than 9,000 coworkers. For the year ended December 31, 2018, the company generated net sales over $16 billion. For more information about CDW, please visit www.CDW.com.Investor InquiriesBeth CoronelliVice President, Investor Relations(847) 419-7524Media InquiriesSara GranackVice President, Corporate Communications(847) 419-7411CDWPR-FI   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: CDW Corporation"
    },
    {
        "title": "CDW Authorizes $1 Billion Share Repurchase Program Increase and Declares Cash Dividend of $0.295 Per Share",
        "subtitle": "",
        "date": "Feb 7, 2019 7:05AM EST",
        "content": "LINCOLNSHIRE, Ill., Feb. 07, 2019 (GLOBE NEWSWIRE) -- CDW Corporation (NASDAQ:CDW), today announced that its Board of Directors has authorized a $1 billion increase to the company's share repurchase program and declared a quarterly cash dividend. The cash dividend of $0.295 per common share will be paid on March 12, 2019, to all stockholders of record as of the close of business on February 25, 2019. This represents a 40 percent increase over last year's dividend.\"Since our IPO in June 2013, our dividend has increased nearly seven-fold and we have returned approximately $2.1 billion to stockholders through share repurchases and dividends,\" said Collin B. Kebo, Senior Vice President & Chief Financial Officer, CDW. \"Share repurchases and annual dividend increases are important components of our capital allocation strategy to deliver value to our stockholders just as we have delivered value to our customers and partners for more than 30 years.\"Future dividends and share repurchase authorizations will be subject to approval by CDW's Board of Directors. The $1 billion authorization is incremental to the $336 million unused in the repurchase program as of December 31, 2018. The program was initially authorized for $500 million in November, 2014 and reauthorized for an incremental $750 million in both May, 2016 and August, 2017. Share repurchases under the program will be made from time to time in private transactions, open market purchases or other transactions as permitted by securities laws and other legal requirements. The timing and amounts of any purchases will be based on market conditions and other factors including but not limited to price, regulatory requirements and capital availability. The program does not require the purchase of any minimum dollar amount or number of shares and the program may be modified, suspended or discontinued at any time.About CDWCDW is a leading multi-brand technology solutions provider to business, government, education and healthcare organizations in the United States, the United Kingdom and Canada. A Fortune 500 company with multi-national capabilities, CDW was founded in 1984 and employs more than 9,000 coworkers. For the year ended December 31, 2018, the company generated net sales over $16 billion. For more information about CDW, please visit www.CDW.com.Investor InquiriesBeth CoronelliVice President, Investor Relations(847) 419-7524investorrelations@cdw.comMedia InquiriesSara GranackVice President, Corporate Communications(847) 419-7411mediarelations@cdw.comCDWPR-FI   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: CDW Corporation"
    }
]