[
    {
        "title": "Cerner to Webcast Investment Community Meeting",
        "subtitle": "",
        "date": "Mar 4, 2020 9:00AM EST",
        "content": "KANSAS CITY, Mo., March  04, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health care technology company, announced today it will host its 2020 Investment Community Meeting March 10, 2020, and make the live meeting available through a webcast. The webcast will begin at 9 a.m. ET and end at approximately 11:30 a.m. ET. During this meeting, Cerner leadership will discuss the company’s business, market environment and long-term goals, and answer questions from the investment community. The webcast may include discussion of Cerner developments, and forward-looking and other material information about business and financial matters.The audio webcast will be available live and archived on the Investor Relations section of Cerner’s website for at least 30 days following the webcast.About CernerCerner’s health technologies connect people and information systems at thousands of contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram,  LinkedIn or Twitter. Nasdaq: CERN. Health care is too important to stay the same.Media ContactsCernerMisti Preston, Director, External Communications & Public Relations, (816) 299-2037, Misti.Preston@cerner.com   Allan Kells, Senior Vice President, Investor Relations, (816) 201-2445, AKells@cerner.com"
    },
    {
        "title": "Cerner Announces Leadership Changes Focused on Increasing Alignment With Client Success ",
        "subtitle": "",
        "date": "Feb 18, 2020 5:56PM EST",
        "content": "KANSAS CITY, Mo., Feb.  18, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (NASDAQ: CERN) today announced the appointment of Don Trigg to President and John Peterzalek to Chief Client and Services Officer.“I want to congratulate Don and John on their expanded roles,” said Brent Shafer, chairman and CEO, Cerner. “These appointments, along with other enhancements we are making to Cerner’s leadership structure to create better alignment and accountability, will build on the progress we’ve made since launching Cerner’s new operating model in 2019 to align more closely with our clients’ strategic objectives and position Cerner for long-term growth.”Don will be responsible for Clinical EHR, Revenue Cycle Management and Strategic Growth businesses, which include Real-Time Health Systems, Health Networks, Data-as-a-Service, Long-Term and Post-Acute Care, Consumer and Employer.In his expanded role, Trigg, who joined Cerner in 2002, will lead the long-term vision of Cerner’s product portfolio, key product lines and performance and profitability. He also will be responsible for driving the strategy and programmatic efforts involved with Cerner’s platform modernization and the company’s development of the cognitive platform for health care.“Don is a proven leader in defining and operationalizing disruptive strategies and innovation to expand Cerner beyond the EHR era,” Shafer said. “I’m looking forward to Don’s continued leadership at this critical juncture in health care.”“There has never been a better moment to innovate at the intersection of health care and information technology,” Trigg said. “Providers are building out health networks to manage the health and care of the individual. Data holds the promise to deliver a new era of cognitive precision and personalization. We believe Cerner is well positioned to define and lead it.”In addition to Trigg’s appointment, John Peterzalek has been appointed to Chief Client and Services Officer, assuming expanded responsibility for Cerner’s Services, Consulting, Support and Hosting. These services organizations include more than 10,000 Cerner associates focused on delivering, running and supporting Cerner solutions. Peterzalek, who joined Cerner in 2003, will continue to oversee worldwide client relationship management and sales.“John’s expanded role fully aligns Cerner’s client-facing resources under his direction, creating further alignment between his organization and the success of our clients,” Shafer said. “We’re also establishing a Client Success office under John that will ensure clients are achieving value and experiencing world-class service.”“I’m pleased to have the opportunity to lead a refreshed focus on delivering high-value solutions and a first-class client experience to our clients around the world,” Peterzalek said. “Our direct alignment with the success of our clients is the cornerstone of our mission to relentlessly seek breakthrough innovation that will shape the health care of tomorrow.”About CernerCerner’s health technologies connect people and information systems in thousands of worldwide facilities dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Health care is too important to stay the same.Media ContactMisti Preston, Director of External Communications & Public Relations, MediaRelations@cerner.com."
    },
    {
        "title": "Intermountain Healthcare and Cerner Extend Health Technology and Innovation Agreement",
        "subtitle": "",
        "date": "Feb 18, 2020 9:00AM EST",
        "content": "KANSAS CITY, Mo., Feb.  18, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health care technology company, and Intermountain Healthcare, an integrated, not-for-profit health system serving the western U.S., announced a multiyear expansion of the two organizations’ longstanding commitment to improve the safety, quality and experience of health care for patients and caregivers. For years, Intermountain has been one of Cerner’s most closely aligned health system clients, both committed to finding new ways to advance the science and practice of medicine and improve patient care. Cerner will continue to support Intermountain’s mission to help people live the healthiest lives possible, delivering on a shared vision of a seamless and connected world where everyone thrives.Across its 24 hospitals, 2,400 physicians and 210 clinics, Intermountain has adopted a wide breadth of Cerner solutions, from clinical to financials, to support improved patient safety, quality of care and controlled costs. Through this expansion, Cerner will continue to increase the speed of innovation and help effectively address business and patient needs today and in the future. Intermountain will continue to provide expert guidance that helps direct developments to improve experiences for caregivers, system operators and patients around the globe.“The partnership between Cerner and Intermountain has never been stronger,” said Marc Probst, vice president and CIO, Intermountain Healthcare. “We continue to diligently work toward the goals we set out to accomplish together and have a renewed sense of pride about this relationship and where we are headed. We have the incredible opportunity—and ultimately the responsibility—to improve the lives of caregivers and patients in the communities we serve and be a model of care delivery for health systems around the world, of which Cerner is instrumental in achieving.”With a strong focus on safety, reliability and resiliency, the two organizations have committed to drive change for Intermountain’s population and beyond. Intermountain has had a considerable impact on health systems across the globe, serving as a resource eager to share its successes, knowledge and lessons learned to help others improve care delivery, enhance system operations and standardize processes. Advancements at Intermountain have the potential to positively impact and guide Cerner clients worldwide.“Our renewed commitment with Intermountain is a result of what we can achieve when we put our minds together and focus on what’s really important, improving patients’ health and clinicians’ ability to provide potentially lifesaving care,” said Brent Shafer, chairman and CEO, Cerner. “We are focused on supporting our clients with the resources they need to succeed, and as one of the most robust users of our technology, Intermountain is an outstanding example of the advancements a relationship like this can bring. When we do our part to deliver the best that Cerner has to offer, we support health systems like Intermountain to keep people healthy, improve outcomes and change lives.”Intermountain is an award-winning organization recognized on numerous occasions as a thought leader and forward-thinking health system. CIO Marc Probst’s most recent honor from CHIME and HIMSS as the 2019 CIO of the year recognizes his three-decade career and pioneering work in health IT. As part of the Cerner Government Advisory Board, Cerner is drawing on Marc and Intermountain’s expertise and experience in providing care to Veterans and active Service members to inform the development of leading-edge solutions and innovations that will help shape care for federal agencies.About Cerner CorporationCerner’s health technologies connect people and information systems in thousands of worldwide facilities dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Health care is too important to stay the same.About Intermountain HealthcareIntermountain Healthcare is a Utah-based, not-for-profit system of 24 hospitals (includes \"virtual\" hospital), a Medical Group with more than 2,400 physicians and advanced practice clinicians at about 210 clinics, a health plans division called SelectHealth, and other health services. Helping people live the healthiest lives possible, Intermountain is widely recognized as a leader in clinical quality improvement and efficient healthcare delivery.Media Contacts:Cerner CorporationAustin Cozzolino, External Communications, (816) 786-2154, austin.cozzolino@cerner.comIntermountain HealthcareHolly Nelson, Media Relations, (801) 442-3218, holly.nelson2@imail.org"
    },
    {
        "title": "Cerner Receives ‘Best in KLAS’ Distinctions in Health Care Technology",
        "subtitle": "",
        "date": "Feb 7, 2020 10:01AM EST",
        "content": "KANSAS CITY, Mo., Feb.  07, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (NASDAQ: CERN), a global health care technology company, has achieved 2020 Best in KLAS honors, recognizing the company’s outstanding efforts in three distinct areas to help health care professionals deliver better patient care. KLAS Research, a leading health care IT data insights company, has named Cerner Best in KLAS for Most Improved Physician Practices and Global Acute Care EMR for the Middle East/Africa market for the second year in a row. The company has also been named Category Leader for Behavioral Health.“Providers and payers demand better performance, usability and interoperability from their vendor partners every year. Best in KLAS winners set the standard of excellence in their market segment,” said Adam Gayle, president, KLAS. “Earning a Best in KLAS award should both excite and humble the recipients. It serves as a signal to providers that they should expect only the best from the winning vendors.”For the first time, the Cerner Behavioral Health EHR has been named a Category Leader. The EHR offers core features required by organizations that specialize in the delivery of mental and behavioral health services, while also offering advanced functionality, like interoperability and client portals, needed to navigate the challenges of value-based care. The National Alliance on Mental Illness (NAMI) reports the average delay between symptom onset and treatment of mental health is 11 years, with one in five adults in the U.S experiencing the illness. Cerner’s KLAS distinction furthers its commitment to help clinicians speed-up the diagnosis process and track symptoms across disparate systems.“Behavioral Health is an area of growing crisis worldwide,” said Donald Trigg, executive vice president, Strategic Growth, Cerner. “For individuals and families that seek help, our unified Cerner solution is designed to make it easier for providers to deliver the integrated care that successful treatment demands. We are excited to receive recognition as a category leader in this area and to advance our capabilities even further in the future.”    Additionally, Cerner has earned 2020 Best in KLAS designation for Global Acute EMR in the Middle East/Africa Market for the second consecutive year. In a diverse global EMR Market, this report shows Cerner is widely used, meeting and exceeding industry standards for clients around the world. Cerner has worked to become a technology leader in the Middle East/Africa Market by implementing strategic changes to better support clients and adjusting its client engagement model to provide more personalized client experiences and support. The company will continue to strive toward excellence in this region by advancing its commitment to deliver tangible value for clients to drive their success.KLAS also awarded Cerner most improved Physician Practice. The 2020 Best in KLAS annual report finds small physician practices (2–10 physicians) that use Cerner Practice Management report a 10% increase in their overall satisfaction, with satisfaction increasing in all areas measured by KLAS. According to the report, these practices have seen improved relationships with Cerner and describe the system as a solid technology platform with which they can run their practices. Cerner’s support personnel are empowered to solve problems and do so in an efficient manner.“Earning recognition by KLAS conveys Cerner’s commitment to the systemic improvement of health care delivery and the health of communities,” said Trigg. “We are proud to be recognized by an industry-leading organization and trusted by many clients across the globe in this space.”About KLASKLAS is a data-driven company on a mission to improve the world's health care by enabling provider and payer voices to be heard and counted. Working with thousands of health care professionals, KLAS collects insights on software, services and medical equipment to deliver reports, trending data and statistical overviews. KLAS data is accurate, honest and impartial. The research directly reflects the voice of health care professionals and acts as a catalyst for improving vendor performance. To learn more about KLAS and the insights we provide, visit KLASresearch.com.About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Media Contacts: CernerShayla Wilkinson, Public Relations, (816) 718-6988, Shayla.wilkinson@cerner.com"
    },
    {
        "title": "Cerner Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Feb 4, 2020 4:01PM EST",
        "content": "KANSAS CITY, Mo., Feb.  04, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN) today announced results for the 2019 fourth quarter and full year that ended December 28, 2019.Fourth quarter 2019 revenue was $1.442 billion, an increase of 6 percent compared to $1.366 billion in the fourth quarter of 2018, and in line with the Company’s expectations.  Full-year 2019 revenue was $5.693 billion, up 6 percent compared to 2018 revenue of $5.366 billion.Bookings in the fourth quarter of 2019 were above the Company’s expectations at $1.665 billion.  Full-year 2019 bookings were $5.990 billion compared to 2018 bookings of $6.721 billion.  The decline in bookings was primarily driven by the Company being more selective in the types of contracts it pursues, which led to fewer large, long-term outsourcing contracts.On a U.S. Generally Accepted Accounting Principles (GAAP) basis, fourth quarter 2019 net earnings were $154.3 million and diluted earnings per share were $0.49.  Fourth quarter 2018 GAAP net earnings were $131.3 million and diluted earnings per share were $0.40.  For the full year, 2019 GAAP net earnings were $529.5 million and diluted earnings per share were $1.65.  Full year 2018 GAAP net earnings were $630.1 million and diluted earnings per share were $1.89.Adjusted Net Earnings for fourth quarter 2019 were $237.2 million, compared to $208.1 million of Adjusted Net Earnings in the fourth quarter of 2018.  Adjusted Diluted Earnings Per Share were $0.75 in the fourth quarter of 2019, in line with the Company’s expectations and up 19 percent compared to $0.63 of Adjusted Diluted Earnings Per Share in the year-ago quarter.  For the full year 2019, Adjusted Net Earnings were $862.1 million and Adjusted Diluted Earnings Per Share were $2.68, compared to full year 2018 Adjusted Net Earnings of $818.5 million and Adjusted Diluted Earnings Per Share of $2.45.Adjusted Net Earnings and Adjusted Diluted Earnings Per Share are not recognized terms under GAAP.  These non-GAAP financial measures should not be substituted for GAAP net earnings or GAAP diluted earnings per share, respectively, as measures of Cerner’s performance, but instead should be utilized as supplemental measures of financial performance in evaluating our business.  Please see the accompanying schedule, titled “Reconciliation of GAAP Results to Non-GAAP Results,” where our non-GAAP financial measures are defined and reconciled to the most comparable GAAP measures.Other Highlights:“I am pleased with our strong finish to the year, with all of our key operating metrics at or above our expectations in the fourth quarter,” said Brent Shafer, Chairman and CEO.  “2019 was an important and productive year for Cerner.  We made meaningful progress on driving value for our clients, delivering operating efficiencies, simplifying our business, and refining our growth strategy.  These efforts are ongoing, and I believe they position us for long-term profitable growth.”Future Period GuidanceCerner currently expects:Earnings Conference CallCerner will host an earnings conference call to provide additional detail on the Company’s results and outlook at 3:30 p.m. CT on February 4, 2020.  On the call, Cerner will discuss its fourth quarter and full-year 2019 results and answer questions from the investment community.  The call may also include discussion of Cerner developments, and forward-looking and other material information about business and financial matters.  The dial-in number for the conference call is (678)-509-7542; the passcode is Cerner.  Cerner recommends joining the call 15 minutes early for registration.An audio webcast will be available live and archived on Cerner’s website at www.cerner.com under the About Us section (click Investor Relations, then Presentations and Webcasts).About CernerCerner’s health technologies connect people and information systems in thousands of worldwide facilities dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter.  Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Certain trademarks, service marks and logos set forth herein are property of Cerner Corporation and/or its subsidiaries.All statements in this press release that do not directly and exclusively relate to historical facts constitute forward-looking statements.  These forward-looking statements are based on the current beliefs, expectations and assumptions of Cerner's management with respect to future events and are subject to a number of significant risks and uncertainties.  It is important to note that Cerner's performance, and actual results, financial condition or business could differ materially from those expressed in such forward-looking statements. The words “expects”, “guidance”, “position”, “believe”, “expectations”, “plan”, “future”, “approximately”, “targeted”, “intend”, “potential”, “opportunities” or the negative of these words, variations thereof or similar expressions are intended to identify such forward-looking statements. For example, our forward-looking statements include statements regarding future period guidance.  Factors that could cause or contribute to such differences include, but are not limited to the possibility of significant costs and reputational harm related to product and service-related liabilities; potential claims for system errors and warranties; the possibility of interruption at our data centers or client support facilities, or those of third parties with whom we have contracted (such as public cloud providers), that could expose us to significant costs and reputational harm; the possibility of increased expenses, exposure to legal claims and regulatory actions and reputational harm associated with a cyberattack or other breach in our IT security or the IT security of third parties on which we rely; material adverse resolution of legal proceedings or other claims or reputational harm stemming from negative publicity related to such claims or legal proceedings; risks associated with our global operations, including without limitation greater difficulty in collecting accounts receivable; risks associated with fluctuations in foreign currency exchange rates; changes in tax laws, regulations or guidance that could adversely affect our tax position and/or challenges to our tax positions in the U.S. and non-U.S. countries; risks associated with the unexpected loss or recruitment and retention of key personnel or the failure to successfully develop and execute succession planning to assure transitions of key associates and their knowledge, relationships and expertise; risks related to our dependence on strategic relationships and third party suppliers; risks inherent with business acquisitions or strategic investments and the failure to achieve projected synergies; risks associated with volatility and disruption resulting from global economic or market conditions; significant competition and our ability to anticipate or respond quickly to market changes, changing technologies and evolving pricing and deployment methods and to bring competitive new solutions, devices, features and services to market in a timely fashion; managing growth in the new markets in which we offer solutions, health care devices or services; long sales cycles for our solutions and services; risks inherent in contracting with government clients, including without limitation, complying with strict compliance and disclosure obligations, navigating complex procurement rules and processes, and defending against bid protests; risks associated with our outstanding and future indebtedness, such as compliance with restrictive covenants, which may limit our flexibility to operate our business; the potential for losses resulting from asset impairment charges; changing political, economic, regulatory and judicial influences, which could impact the purchasing practices and operations of our clients and increase costs to deliver compliant solutions and services; non-compliance with laws, government regulation or certain industry initiatives or failure to deliver solutions or services that enable our clients to comply with laws or regulations applicable to their businesses; variations in our quarterly operating results; potential variations in our sales forecasts compared to actual sales; inability to achieve expected operating efficiencies and sustain or improve operating expense reductions; risks that Cerner’s revenue growth may be lower than anticipated and/or that the mix of revenue shifts to low margin revenue; and risk that our capital allocation strategy will not be fully implemented or enhance long-term shareholder value. Additional discussion of these and other risks, uncertainties and factors affecting Cerner's business is contained in Cerner's filings with the Securities and Exchange Commission. The reader should not place undue reliance on forward-looking statements, since the statements speak only as of the date that they are made. Except as required by law, Cerner undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events, or changes in our business, results of operations or financial condition over time.Investor Contact:  Allan Kells, (816) 201-2445, akells@cerner.comMedia Contact:  Misti Preston, (816) 299-2037, misti.preston@cerner.comCerner’s Internet Home Page:  www.cerner.com"
    },
    {
        "title": "Cerner Client Cornwall Community Hospital (CCH) Earns Highest Level of Accreditation for Excellence in Care",
        "subtitle": "",
        "date": "Jan 21, 2020 4:01PM EST",
        "content": "CORNWALL, Ontario, Jan.  21, 2020  (GLOBE NEWSWIRE) -- Today Cerner Corporation, a global health care technology company, recognizes Cornwall Community Hospital (CCH) for receiving Canada’s highest level of accreditation through Accreditation Canada's Qmentum International Accreditation Program. The accreditation program is designed to focus on quality and safety throughout all aspects of an organization’s services, from leadership to direct care. CCH uses Cerner’s electronic health record (EHR) to help doctors and nurses view patient information in near-real time, aiding in the delivery of streamlined and efficient care.“Cerner is extremely proud of the CCH leadership team and their clinicians’ continuous quest to make health care more integrated, better informed and safer for their patients,” said Jim Shave, president, Cerner Canada. “By implementing technology throughout their organization, CCH has shown a great example of their commitment to continuous improvement of their hospital and their community.”Cerner is focused on developing leading-edge medical technology to help shape health care around the world. With technology designed to focus on patient safety, privacy and simplifying the workflow for clinicians, CCH selected Cerner for healthcare innovation as it worked to implement improvement practices and strategies.“I would like to acknowledge the hard work and dedication made by CCH staff and physicians on a continuous basis to provide exceptional care to patients. I am proud of my staff for earning this well-deserved achievement,” said Jeanette Despatie, president and CEO, CCH. “CCH is committed to continually improving our services. To this end, we voluntarily participated in the Qmentum program with Accreditation Canada, to learn what we are doing well, and where we can improve.\"CCH was evaluated by Accreditation Canada in numerous categories, including clinical leadership, competency and episode of care, achieving a more than 99% compliance rate. In addition, the hospital also met all applicable criteria in the Population Focus, Accessibility, Work-life, Continuity and Efficiency dimensions.Stated in the report, Accreditation Canada's Qmentum International Accreditation Program recognizes Cerner’s EHR as being a well-established tool for the efficient transfer of patient information and a useful tool for promoting timely decision support. The report also highlights patient safety programs and alerts that are embedded into Cerner’s EHR. CCH physicians have proven their thorough understanding and use of the technology to improve the quality of care provided to patients, which helped the hospital achieve Canada’s highest level of accreditation.CCH and Cerner have been working together since 2014. In 2018, the health care provider reached Healthcare Information and Management Systems Society (HIMSS) Electronic Medical Record Adoption Model (EMRAM) Stage 6.About Cornwall Community HospitalCornwall Community Hospital (CCH) provides a full range of acute inpatient, outpatient and community mental health services to their catchment area of 100 000 people from the communities of Cornwall, the United Counties of Stormont, Dundas and Glengarry and to the Mohawk Community of Akwesasne. With over 150 beds, 1120 employees and 140 physicians, services at CCH include emergency, surgical, medicine and rehabilitation services, mental health and addiction programs as well as a family birthing centre. Cornwall Community Hospital was incorporated in 2004 with the amalgamation of the Cornwall General Hospital and the acute care services of the Hotel Dieu Hospital, both with over 100 years of health care service to Cornwall and surrounding area. With the completion of a major redevelopment project in 2014, and the construction the Addiction and Mental Health Centre at the end of 2016, the hospital consolidated all acute care and community based services on their McConnell avenue site. Having everything on one campus positions the hospital well to serve its community for many years to come.About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Media ContactsCornwall Community HospitalJolene Soares, Communications Coordinator, (613) 938-4240 ext. 2722CernerShayla Wilkinson, Public Relations, (816) 718-6988, Shayla.Wilkinson@cerner.com"
    },
    {
        "title": "Cerner Named Best in Client Service and Technical Support for Fourth Consecutive Year",
        "subtitle": "",
        "date": "Jan 16, 2020 4:02PM EST",
        "content": "KANSAS CITY, Mo., Jan.  16, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health care technology company, has been named best in Client Service and Technical Support by health IT market research organization Black Book for the fourth year in a row. As Cerner supports clients through the next era of health care digitization, this achievement signals the company’s continued commitment to enhancing the client experience and meeting the needs of an evolving, complex industry.“It’s an honor to be recognized once again for the high level of service we provide and a testament to the outstanding work our associates put into supporting our clients every day,” said Jody Buchman, senior vice president, Cerner Support Services. “While we celebrate this accomplishment, the hard work doesn’t stop here. We’re motivated to innovate further and deliver an even higher level of support that continues to put Cerner in a class of its own.”Throughout 2019, Black Book surveyed nearly 2,500 validated electronic health record (EHR) users on their satisfaction with technical client service & support on more than 100 EHR systems. The users rated a variety of factors on a scale from one to 10, ranking Cerner first across all comprehensive hospital technology support services.Cerner is the only EHR vendor to receive this recognition that offers comprehensive, multi-tier levels of support through experienced support staff and engineers to quickly resolve issues and create a better user experience. Cerner clients have access to a mission-critical support team 24-hours a day, 365 days a year.“Health care software support is on the cusp of change and as health care technologies evolve and improve, they are reshaping the very nature of what is client services and tech support,” said Doug Brown, president of Black Book Research. “Companies like Cerner that invest in their technical support remain ahead of the curve and provide client partners a more effective service.”An overwhelming number of respondents agreed that technical support should be forward-looking to offer solutions that bridge present and future to ensure support remains consistent. Leveraging its legacy of innovation, Cerner is seeking new ways to build on existing support and developing new solutions to shape the future of health care.Last year, Cerner was named one of the top EHR vendors across the globe in Black Book’s, “2019 State of Global EHR & Healthcare IT Adoption” report.About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.About Black BookBlack Book™, its founders, management and staff do not own or hold any financial interest in any of the vendors covered and encompassed in the surveys it conducts. Black Book reports the results of the collected satisfaction and client experience rankings in publication and to media prior to vendor notification of rating results and does not solicit vendor participation fees, review fees, inclusion or briefing charges, and/or vendor collaboration as Black Book polls vendors' clients. For methodology, auditing, resources, comprehensive research and ranking data see: blackbookmarketresearch.com or contact research@blackbookmarketresearch.com.Media Contacts:CernerAnamarie Rebori Simmons, Public Relations, (816) 506-0992, Anamarie.ReboriSimmons@cerner.com"
    },
    {
        "title": "HealthTap Announces Plan to Extend Cerner's On-site and Near-site Health Center Experience with 24/7 Digital Primary Care",
        "subtitle": "HealthTap chosen for comprehensive digital primary care, including text and video visits and searchable content written by physicians",
        "date": "Jan 13, 2020 10:00AM EST",
        "content": "MOUNTAIN VIEW, Calif., Jan. 13, 2020 /PRNewswire/ -- HealthTap, a leading virtual primary care provider, today announced a collaboration with Cerner Corporation (Nasdaq: CERN), a global health care technology company, to further extend health care experiences beyond on-site and near-site health and pharmacy centers. By combining digital technology with high-quality in-person care, employers can provide their employees with access to care anytime, anywhere through HealthTap's digital primary care physician network. The result of these collective capabilities is designed to help employers lessen expensive urgent care and ER visits.As consumers increasingly turn to digital platforms from retail to banking, they expect similar conveniences and ease of access to health care. At the same time, health care costs are rising, driving the industry to seek more efficient ways to treat patients and keep people healthy. Digital care options can provide the opportunity to help consumers get convenient, cost-effective health care at the time they need it.\"At Cerner, we are focused on bringing innovative solutions to some of health care's most urgent challenges, and digital technology offers employers the opportunity to provide convenient and cost-efficient services,\" said David Bradshaw, senior vice president, Consumer and Employer Solutions, Cerner. \"We look forward to bringing HealthTap's digital care to employers to help keep their employees healthy while managing health care costs.\" Bringing together Cerner's expertise in workforce health services with HealthTap's digital platform will support self-funded employers to offer end-to-end primary care services to their workforces, regardless of proximity to on-site and near-site health centers.Cerner clients using HealthTap can offer their employees the ability to connect with a U.S.-based, board-certified physician 24 hours a day, seven days a week, on-demand. Additionally, through an AI-powered symptom checker, users can search physician-written answers to questions, post their own questions and receive personalized care guidance using HealthTap. Working with companies like HealthTap, Cerner is further expanding its portfolio and continuing to focus on meeting demands for affordable, flexible health care solutions.\"HealthTap is thrilled to have been chosen as a digital primary care complement to Cerner's on-site and near-site health centers, on which thousands of employees and their families across the country depend,\" said Sean Mehra, chief strategy officer, HealthTap. \"When employees are travelling, work in remote locations or just spike a fever at 2 a.m., HealthTap makes it easy to connect with a doctor – no stress, no hassle.\"About HealthTapHealthTap combines proprietary technology and its network of certified doctors to deliver real-time access to high-quality, affordable primary care. HealthTap members enjoy 24/7 access to virtual doctor visits from any digital device, with an average wait time of less than 1 minute, as well as submit written questions to doctors. HealthTap AI triages symptoms and gives guidance based on a person's specific traits and even geographical area. With HealthTap, businesses can offer primary care to workers for less than they typically spend providing free coffee. HealthTap is available throughout North America, and has provided more than 100,000 virtual doctor visits to date. For more information, visit www.healthtap.com.About CernerCerner's health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram,  LinkedIn or  Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.  View original content:http://www.prnewswire.com/news-releases/healthtap-announces-plan-to-extend-cerners-on-site-and-near-site-health-center-experience-with-247-digital-primary-care-300985326.htmlSOURCE  HealthTap"
    },
    {
        "title": "Cerner to Release Fourth Quarter 2019 Earnings Results February 4",
        "subtitle": "",
        "date": "Jan 9, 2020 4:52PM EST",
        "content": "KANSAS CITY, Mo., Jan.  09, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN) today announced it will release its fourth quarter 2019 earnings results after the market closes Tuesday, February 4. Following the release, the company will hold a conference call at 3:30 p.m. CT that can be accessed via dial-in or webcast. On the call, Cerner will discuss its results and outlook and answer questions from the investment community. The call may also include discussion of Cerner developments and other material and forward-looking information about business and financial matters.The dial-in number for the conference call is (678) 509-7542; the passcode is Cerner. The company recommends joining the call 15 minutes early for registration. An audio webcast will be available live and archived on Cerner’s website in the Investor Relations section.About Cerner Cerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. Media Contact: Misti Preston, Public Relations, (816) 299-2037Investor Contact: Allan Kells, Investor Relations, (816) 201-2445"
    },
    {
        "title": "Cerner Board Members Recognized Among Most Influential Corporate Directors",
        "subtitle": "",
        "date": "Jan 8, 2020 4:01PM EST",
        "content": "KANSAS CITY, Mo., Jan.  08, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation, a global health care technology company, announced that three board members, Linda Dillman, Julie Gerberding and Melinda Mount, have been named as WomenInc.’s Most Influential Corporate Board Directors for their achievements in business and contributions to advance technology and innovation. The magazine, which is dedicated to comprehensive coverage of women’s achievement in business, released the listing in their winter 2019 edition.“We congratulate Linda, Julie and Melinda for this well-deserved recognition and their contributions to Cerner,” said Brent Shafer, chairman & CEO, Cerner. “Health care is constantly impacted by demographic, technological, political and technical dynamics. The expertise, leadership and experience that our Board brings helps Cerner continue evolving in the changing landscape and remain successful. We are proud and fortunate to have these three innovative and talented minds working with us.”WomenInc. recognizes high-achieving women serving on the boards of S&P 1000 public companies and is the most comprehensive listing of women executives, influencers and achievers contributing leadership to corporate boards. “WomenInc. is proud to recognize this distinguished group of women serving on public boards,” said Catrina Young, executive vice president and chief communications officer, WomenInc. “We are inspired by these accomplished executives, their distinguished careers and the corporations that demonstrate inclusive board composition.” Read more about each recognized Cerner board member below:Linda Dillman  Linda Dillman is a former chief information officer for QVC, Inc. Prior to her work at QVC, Dillman was senior vice president of enterprise services/global functions IT for Hewlett-Packard Company. She also served as executive vice president of benefits and risk management and executive vice president and chief information officer for Wal-Mart Stores, Inc. Dillman is a member of the GS1 US Board of Governors and the University of Indianapolis Advisory Board. Julie Gerberding  Dr. Julie Gerberding is executive vice president and chief patient officer at Merck & Co., Inc. Previously, Dr. Gerberding was director of the Centers for Disease Control, where she led the agency through more than 40 emergency public health crisis responses. Dr. Gerberding also serves on the Boards of Biotechnology Innovation Organization (BIO) and the MSD Wellcome Trust Hilleman Laboratories. Dr. Gerberding has received more than 50 awards/honors, including recognition by the U.S. Department of Health and Human Services for her leadership in responses to anthrax bioterrorism and the Sept. 11 attacks. In 2018, she was selected as the Healthcare Businesswomen Association’s Woman of the Year and received the Lifetime Achievement Award from eyeforpharma.Melinda Mount  Melinda Mount most recently served as the president of AliphCom, Inc. Previously, she held various senior level positions at Microsoft Corporation, including corporate vice president and chief financial officer of the Online Services Division. Prior to joining Microsoft, Mount served as the vice president of strategy and development at Time Warner, Inc. and executive vice president and co-managing director of the United Kingdom Division of AOL Inc. She also previously served as vice president of Mergers and Acquisitions at Morgan Stanley. She is a member of the Board of Directors of the University of Wisconsin Foundation.  About Cerner Cerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com,  The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. Media Contacts:  Shayla Wilkinson, Public Relations, (816) 718-6988, Shayla.Wilkinson@cerner.com  "
    },
    {
        "title": "Cerner to Present at 38th Annual J.P. Morgan Healthcare Conference",
        "subtitle": "",
        "date": "Jan 7, 2020 5:23PM EST",
        "content": "KANSAS CITY, Mo., Jan.  07, 2020  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health care technology company, announced today that Brent Shafer, chairman and CEO, Donald Trigg, executive vice president of Strategic Growth and Marc Naughton, chief financial officer, will present at the 38th Annual J.P. Morgan Healthcare Conference in San Francisco. The presentation begins at 11:00 a.m. PST on Jan. 14, and will be available live and archived on Cerner’s website in the Investor Relations section.Cerner is ushering in a new era of digital transformation in health care with a focus on improving care and making clinicians’ work easier. In the presentation, Cerner leadership will showcase corporate transformation efforts and the strategic framework for growth, as well as the company’s work in developing technology to shape health care of tomorrow. About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. Media Contacts: CernerMisti Preston, Public Relations, (816) 299-2037, misti.preston@cerner.com "
    },
    {
        "title": "Cerner Announces Quarterly Dividend and Increases Share Repurchase Program",
        "subtitle": "",
        "date": "Dec 13, 2019 9:00AM EST",
        "content": "KANSAS CITY, Mo., Dec.  13, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health care technology company, today announced that its Board of Directors declared a cash dividend to stockholders of $0.18 per issued and outstanding share.  The cash dividend will be payable on Jan. 9, 2020, to shareholders of record as of the close of business on Dec. 27, 2019.Cerner intends to pay regular quarterly cash dividends, with future declarations subject to approval by its Board of Directors and their determination that the declaration of dividends remains in the best interests of Cerner and its shareholders. The decision of whether to pay future dividends and the amount of any such dividends will be based on the company's financial position, results of operations, cash flows, capital requirements, the requirements of applicable law and any other factors the Board of Directors may deem relevant.Cerner also announced that its Board has approved an amendment to its stock repurchase program, authorizing the repurchase of an additional $1.5 billion of its common stock. Cerner has repurchased $1.3 billion of its shares in 2019 and had $0.2 billion of available authorization remaining prior to the increase announced today.  The total authorized amount available for repurchase is now $1.7 billion.Cerner plans to repurchase shares in the open market, by block purchase, in privately negotiated transactions or possibly through other transactions managed by broker-dealers. No time limit was set for completion of the program, and the timing and amount of repurchases will depend on how much funding is used for other purposes, such as acquisitions.  The Company intends to fund its capital allocation program, including share repurchases, dividend payments and other uses, with cash from operations and debt.\"The Board of Directors and our leadership team believe Cerner's shares are an attractive investment, and our expanded repurchase program and quarterly dividend reflect our ongoing commitment to returning capital to shareholders and the company's belief in Cerner’s long-term potential,\" said Marc Naughton, executive vice president and chief financial officer.  \"We have a strong balance sheet and expect to continue generating strong cash flow that can support ongoing investments in growth and a balanced capital allocation strategy.\"About CernerCerner's health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Certain trademarks, service marks and logos set forth herein are property of Cerner Corporation and/or its subsidiaries.All statements in this press release that do not directly and exclusively relate to historical facts constitute forward-looking statements. These forward-looking statements are based on the current beliefs, expectations and assumptions of Cerner's management with respect to future events and are subject to a number of significant risks and uncertainties. It is important to note that Cerner's performance, and actual results, financial condition or business could differ materially from those expressed in such forward- looking statements. The words \"intends,\" \"future\", or the negative of these words, variations thereof or similar expressions are intended to identify such forward-looking statements. For example, our forward-looking statements include statements regarding future dividends and plans to repurchase Cerner stock under the expanded authorization. Factors that could cause or contribute to such differences include, but are not limited to: possibility of significant costs and reputational harm related to product related liabilities; potential claims for system errors and warranties; the possibility of interruption at our data centers or client support facilities, or those of third parties with whom we have contracted (such as public cloud providers), that could expose us to significant costs and reputational harm; the possibility of increased expenses, exposure to legal claims and regulatory actions and reputational harm associated with a cyberattack or other breach in our IT security or the IT security of third parties on which we rely; our proprietary technology may be subject to claims for infringement or misappropriation of intellectual property rights of others, or may be infringed or misappropriated by others; material adverse resolution of legal proceedings or other claims; risks associated with our global operations, including without limitation greater difficulty in collecting accounts receivable and stringent data privacy regulations; risks associated with fluctuations in foreign currency exchange rates; changes in tax laws, regulations or guidance that could adversely affect our tax position and/or challenges to our tax positions in the U.S. and non-U.S. countries; risks related to our dependence on strategic relationships and third-party suppliers; risks associated with volatility and disruption resulting from global economic or market conditions; significant competition and our ability to quickly respond to market changes, changing technologies and evolving pricing and deployment methods and to bring competitive new solutions, devices, features and services to market in a timely fashion; managing growth in the new markets in which we offer solutions, health care devices or services; long sales cycles for our solutions and services; risks associated with our outstanding and future indebtedness, such as compliance with restrictive covenants, which may limit our flexibility to operate our business;  changing political, economic, regulatory and judicial influences, which could impact the purchasing practices and operations of our clients and increase costs to deliver compliant solutions and services; non-compliance with laws, government regulation or certain industry initiatives or failure to deliver solutions or services that enable our clients to comply with laws or regulations applicable to their businesses; variations in our quarterly operating results; potential variations in our sales forecasts compared to actual sales; volatility in the trading price of our common stock and the timing and volume of market activity; inability to manage organizational change and reduce expenses and costs to the extent currently anticipated; risks that Cerner's revenue growth may be lower than anticipated and/or that the mix of revenue shifts to low margin revenue; risks that our stock repurchase program or quarterly dividend program will not be fully implemented or enhance long-term shareholder value; and risks that Cerner's business may be negatively affected as a result of future proxy fights or the actions of activist shareholders. Additional discussion of these and other risks, uncertainties and factors affecting Cerner's business is contained in Cerner's filings with the Securities and Exchange Commission. The reader should not place undue reliance on forward-looking statements, since the statements speak only as of the date that they are made. Except as required by law, Cerner undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events, or changes in our business, results of operations or financial condition over time.Investor Contact: Allan Kells, (816) 201-2445, akells@cerner.comMedia Contact: Misti Preston, (816) 299-2037, misti.preston@cerner.comCerner's Internet Home Page: www.cerner.com"
    },
    {
        "title": "Cerner, AWS Work to Reduce Patient Re-Admissions and Time Spent Documenting Patient Visits",
        "subtitle": "",
        "date": "Dec 3, 2019 12:41PM EST",
        "content": "Prediction Tools to Prevent Health Care Re-Admissions New Virtual Scribe Helps Physicians Capture More Info in Shorter TimeKANSAS CITY, Mo. , Dec.  03, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global leader in health care technology, today announced its plans to assist clients to further lower re-admission rates for patients, reduce health care waste and help cut the amount of time physicians spend documenting patient visits. At the 2019 Amazon Web Services (AWS) re:Invent in Las Vegas, Cerner CEO and Chairman of the Board Brent Shafer addressed some of health care’s biggest challenges, and ways Cerner is combatting them. Shafer was joined on stage by AWS CEO Andy Jassy who introduced him to tens of thousands of business and IT professionals.“For 40 years, Cerner ushered in health care’s digital age by moving medical data from paper charts and manila folders into electronic health records,” Shafer told the audience. “As we enter into a new era of digital transformation, our work with AWS will lead a wave of breakthrough innovations focused on making health care better and clinicians’ work easier.”Globally, the health care industry spends more than $7 trillion each year, with the U.S. accounting for nearly half of that spend ($3.5 trillion). The American Medical Association recently estimated that a quarter of all U.S. spending – nearly $1 trillion – is wasted on unnecessary follow ups to doctor’s appointments, overtreating patients and gaps in digital information caused by people seeking care from different doctors and health systems over a lifetime. Cerner is working to reduce this financial waste by leveraging de-identified patient data to help make early determinations of what is causing return hospitalizations. The insights that Cerner unveils will give physicians the resources to make more informed decisions on treatment approaches, thereby helping reduce patient re-admissions.As an example, a Cerner client—one of the largest providers of post-acute health care in the U.S.—recently asked for help predicting the patients at risk of being re-admitted from a rehabilitation facility back to the hospital. By applying machine learning to historical data migrated to the AWS Cloud, Cerner created a model that helped the health care system reach the lowest re-admission rate in more than a decade and sent more patients directly from rehabilitation to their homes.Earlier this year, Cerner announced its focus on addressing macro trends in health care, including physician burnout. During his keynote, Shafer also addressed a challenge many physicians face, the time it takes to document patient visits. Reports have shown that physicians spend more than half of their days documenting patient information. Shafer announced that Cerner is developing a digital virtual scribe, working with Amazon Transcribe Medical, to help reduce the documentation burden.“The digitization of health care has inadvertently caused an increase in documentation for physicians,” said Shafer. “Working with AWS will allow us to capture doctor-patient interaction and integrate it directly into the electronic workflow of the physician. This new advancement will help doctors and providers spend less time filling out forms and more quality time with their patients.”  Cerner’s focus on developing leading-edge technology will help shape health care of tomorrow. Recently, Cerner reached an important milestone, it’s 500th issued patent. The new patent, featuring voice-activated documentation, captures important details shared between the clinician and patient, further showcasing the company’s focus on leveraging voice inputs and natural language processing to reduce the physician’s burden of documentation.“As we work to transform Cerner, we’re relentlessly seeking innovation and new ways to deliver faster, more scalable, more secure solutions to our clients and patients – it’s part of who we are,” said Shafer. “We live in a connected world and are working with others like AWS to solve the quadruple aim of health care – improving the health of individuals and populations while reducing costs and increasing clinician satisfaction. And it’s just the beginning of this exciting new venture.”About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers integrated clinical and financial systems to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram,  LinkedIn or  Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. Media Contacts: Austin Cozzolino, (816) 786-2154, Austin.Cozzolino@Cerner.com   "
    },
    {
        "title": "Cerner Achieves 500th Patent With Voice-Assisted Technology",
        "subtitle": "",
        "date": "Dec 2, 2019 4:12PM EST",
        "content": "KANSAS CITY, Mo., Dec.  02, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health care technology company, has achieved its 500th patent, a new innovative voice-assisted technology designed to make it easier for clinicians to document the details of a patient visit on a mobile device. This milestone builds on Cerner’s legacy of technological advancement and industry-leading patent portfolio, validating the company’s rich 40-year history of transformation at the intersection of health care and technology.Documentation becomes easier, faster and hands free with voice-assisted technology, bringing clinicians out from behind the keyboard and instead engaging directly with patients about their health. Cerner’s 500th patent expands its work in leveraging voice inputs and natural language processing to reduce the clinician’s documentation burden. The technology captures the verbal interaction between a clinician and patient to document the medical visit. Information relevant to the patient’s care is identified, extracted and presented directly on the clinician’s mobile device. The shorthand clinical note created helps the clinician complete more comprehensive documentation at a later time.  “Our development of emerging technologies like voice recognition will help arm clinicians with tools that empower them to more fully engage with their patients and deliver smarter care,” said Dr. Tanuj Gupta, vice president and physician executive, Cerner Intelligence. “We’re tapping into our renowned history and expertise in health care technology to set the pace of advancement in the industry. Through our agile iterative approach, we’re bringing new innovation to our clients faster than before with the goal of making care delivery easier for clinicians and simpler for patients.”With its 500th issued patent, Cerner has signaled a competitive edge in supporting clients through the next era of health care digitization. The company’s strong commitment to R&D is proof of its dedication to bringing forth new technologies that improve clinician and patient experiences and revolutionize how care is delivered. Leveraging its legacy of innovation and disruption, Cerner continues to seek new ways to build on top of the platforms it created and develop new solutions to shape the future of health care.Cerner’s patent program is constantly evolving to address health care’s macro trends and advance the way clients deliver care. The company is exploring additional patents that support the migration of data to the cloud, intelligence and analytics to improve clinician and patient experiences, and predictive analytics and AI to improve health outcomes.About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers integrated clinical and financial systems to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram,  LinkedIn or  Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. Media Contacts:CernerAustin Cozzolino, Public Relations, (816) 786-2154, Austin.Cozzolino@Cerner.com "
    },
    {
        "title": "Vively Health(TM) and Cerner Take on Population Health Management for America's Sickest Patients",
        "subtitle": "Companies collaborate to help improve the lives of patients with multiple chronic conditions",
        "date": "Oct 29, 2019 6:37AM EDT",
        "content": "DENVER, Oct. 29, 2019 /PRNewswire/ -- Vively Health, a risk-based provider delivering home-based primary care to the nation's Most Vulnerable Patients (MVPs), today announced a five-year collaboration with Cerner Corporation (Nasdaq: CERN), a global health platform and innovation company, to revolutionize care delivery and help improve health outcomes for those with multiple chronic conditions.According to the Centers for Disease Control and Prevention, 60% of adults in the U.S. live with a chronic condition, and 40% of adults live with multiple chronic conditions. In fact, 12% of individuals with five or more chronic conditions drive 41% of U.S. health care spend. Vively will integrate Cerner's industry-leading technology across its home-based offerings, including its electronic health record (EHR), population health management platform and consumer framework, which is designed to help lower the cost of care by supporting care teams to better address the unique needs of MVPs.\"The ability to work with Cerner to drive a higher level of care for MVPs—at scale—is energizing,\" said Hank Schlissberg, president for Vively. \"Cerner's commitment to relentlessly seeking breakthrough innovation strengthens our ability to fulfill our mission to significantly improve the quality of life for medically complex patients in the U.S. health care system.\" Cerner's 40-year history of technological developments has helped reduce the complexities of health care and drive meaningful advancements, directly benefiting providers and consumers. Vively will use Cerner's integrated platforms and technology to support an improved patient experience through seamless coordination of care. \"Vively continues to find new ways to address health care delivery for those living with chronic conditions, and we are proud to offer our technology and expertise to help address this national health concern,\" said Sam Pettijohn, senior vice president of Investor Owned Client Relationships for Cerner. \"As a leading cause of death and disability in the nation, chronic conditions are driving up health care spend at an alarming rate and it will take innovative collaborations like this to find lasting solutions that help people live healthier lives.\"Vively's vision is to provide accessible, comprehensive and coordinated care for health plans' most vulnerable members—individuals with an interrelated set of chronic conditions—who are frequent utilizers of the emergency room, hospital and greater health care system. To do so, Vively requires technology that offers comprehensive, intuitive functionality that can support conversion of data into insights to drive more-informed clinical decisions, improved operational performance and continuous innovation.By leveraging a single digital health record, Vively has the opportunity to provide a more comprehensive picture of an individual's health and financial information. The Cerner Millennium® EHR will support Vively's patients and clinicians by having a complete record of each individual's important health information in one place. This helps increase efficiencies within patients' homes, enhancing the ability of Vively clinicians to surface issues prior to and during care visits. Vively will also be supported by Cerner's population health management platform, HealtheIntent®, designed to help providers know and predict the health of their populations. Vively care teams will use the platform to help better understand and track its MVP population's health by aggregating and normalizing multiple data sources into a single, consolidated view. Providers will also be able to share this data with other clinicians, hospitals and care organizations, supporting a coordinated approach to better help individuals. Cerner's digital, consumer-centric experience, HealtheLifeSM, will help Vively care teams support interaction and engagement between patients, providers and other health care organizations. This engagement will empower doctors, nurses, social workers, behavioral health specialists, palliative care specialists and other members of the care team to document and share information in a single location. It also gives individuals access to, and ownership of, their health record so that they can be an active participant in their health and care.To learn more about Vively Health visit VivelyHealth.com. To learn more about Cerner visit Cerner.com.About Vively HealthVively Health delivers home-based primary care to the nation's Most Vulnerable Patients, individuals with an interrelated set of chronic conditions such as diabetes, cardiovascular disease, chronic kidney disease, COPD, depression and anxiety. Under full risk arrangements, Vively's community-based, physician-led care teams deliver medical, behavioral, social and palliative care to chronically ill patients within the home. The company's house calls programs have enhanced the lives of thousands of patients with a 91% satisfaction rating; 35-40% reduction in hospitalizations; 10-15% reduction in emergency room visits; and 15-20% reduction in cost of care. Vively leverages nearly 20 years of experience in managing high-risk patients under at-risk arrangements with payors and risk-bearing entities. Vively Health is a standalone subsidiary of DaVita Inc. For more information, visit VivelyHealth.com.About CernerCerner's health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Media Contacts:Vively HealthAshley Henson303-876-6626ashley.henson@vivelyhealth.com CernerAustin Cozzolino816-786-2154austin.cozzolino@cerner.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/vively-health-and-cerner-take-on-population-health-management-for-americas-sickest-patients-300945766.htmlSOURCE  Vively Health"
    },
    {
        "title": "Cerner Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 24, 2019 4:01PM EDT",
        "content": "KANSAS CITY, Mo., Oct.  24, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN) today announced results for the 2019 third quarter that ended Sept. 28, 2019.Bookings in the third quarter of 2019 were at the high-end of the company’s expectations at $1.651 billion.Third quarter 2019 revenue was $1.429 billion, an increase of 7% compared to $1.340 billion in the third quarter of 2018, and in line with the company’s expectations.On a U.S. Generally Accepted Accounting Principles (GAAP) basis, third quarter 2019 net earnings were $81.9 million and diluted earnings per share were $0.26. Third quarter 2018 GAAP net earnings were $169.4 million and diluted earnings per share were $0.51.   Adjusted Net Earnings for third quarter 2019 were $211.7 million, compared to $209.4 million of Adjusted Net Earnings in the third quarter of 2018. Adjusted Diluted Earnings Per Share were $0.66 in the third quarter of 2019, in line with the company’s expectations and up 5% compared to $0.63 of Adjusted Diluted Earnings Per Share in the year-ago quarter.Adjusted Net Earnings and Adjusted Diluted Earnings Per Share are not recognized terms under GAAP.  These non-GAAP financial measures should not be substituted for GAAP net earnings or GAAP diluted earnings per share, respectively, as measures of Cerner’s performance, but instead should be utilized as supplemental measures of financial performance in evaluating our business. Please see the accompanying schedule, titled “Reconciliation of GAAP Results to Non-GAAP Results,” where our non-GAAP financial measures are defined and reconciled to the most comparable GAAP measures.Other Highlights:“I am pleased with our execution in the third quarter as we again delivered against the expectations we set while also continuing to advance Cerner’s broader transformation,” said Brent Shafer, chairman and CEO, Cerner  “I believe the balanced focus of near-term operational improvements combined with our innovation and growth strategies position Cerner to deliver sustainable and profitable growth.”Future Period GuidanceCerner currently expects:Earnings Conference CallCerner will host an earnings conference call to provide additional detail on the company’s results and outlook at 3:30 p.m. CT on Oct. 24, 2019. On the call, Cerner will discuss its third quarter 2019 results and answer questions from the investment community. The call may also include discussion of Cerner developments, and forward-looking and other material information about business and financial matters. The dial-in number for the conference call is (678) 509-7542; the passcode is Cerner. Cerner recommends joining the call 15 minutes early for registration.  An audio webcast will be available live and archived on Cerner’s website at www.cerner.com under the About Us section (click Investor Relations, then Presentations and Webcasts).About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter.  Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Certain trademarks, service marks and logos set forth herein are property of Cerner Corporation and/or its subsidiaries.All statements in this press release that do not directly and exclusively relate to historical facts constitute forward-looking statements.  These forward-looking statements are based on the current beliefs, expectations and assumptions of Cerner's management with respect to future events and are subject to a number of significant risks and uncertainties.  It is important to note that Cerner's performance, and actual results, financial condition or business could differ materially from those expressed in such forward-looking statements. The words “expects”, “guidance”, “position”, “believe”, “expectations”, “plan”, “outlook”, “future”, “approximately”, “targeted”, “intend”, “potential”, “opportunity” or the negative of these words, variations thereof or similar expressions are intended to identify such forward-looking statements. For example, our forward-looking statements include statements regarding future period guidance.  Factors that could cause or contribute to such differences include, but are not limited to the possibility of significant costs and reputational harm related to product-related liabilities; potential claims for system errors and warranties; the possibility of interruption at our data centers or client support facilities, or those of third parties with whom we have contracted (such as public cloud providers), that could expose us to significant costs and reputational harm; the possibility of increased expenses, exposure to legal claims and regulatory actions and reputational harm associated with a cyberattack or other breach in our IT security or the IT security of third parties on which we rely; our proprietary technology may be subject to claims for infringement or misappropriation of intellectual property rights of others, or may be infringed or misappropriated by others; potential claims or other risks associated with relying on open source software in our proprietary software solutions or technology-enabled services; material adverse resolution of legal proceedings or other claims; risks associated with our global operations, including without limitation greater difficulty in collecting accounts receivable; risks associated with fluctuations in foreign currency exchange rates; changes in tax laws, regulations or guidance that could adversely affect our tax position and/or challenges to our tax positions in the U.S. and non-U.S. countries; risks associated with the unexpected loss or recruitment and retention of key personnel or the failure to successfully develop and execute succession planning to assure transitions of key associates and their knowledge, relationships and expertise; risks related to our dependence on strategic relationships and third party suppliers; risks inherent with business acquisitions and combinations and the integration thereof into our business or relating to disputes involving such acquisitions or combinations; risks associated with volatility and disruption resulting from global economic or market conditions; significant competition and our ability to quickly respond to market changes, changing technologies and evolving pricing and deployment methods and to bring competitive new solutions, devices, features and services to market in a timely fashion; managing growth in the new markets in which we offer solutions, health care devices or services; long sales cycles for our solutions and services; risks inherent in contracting with government clients, including without limitation, complying with strict compliance and disclosure obligations, navigating complex procurement rules and processes and defending against bid protests; risks associated with our outstanding and future indebtedness, such as compliance with restrictive covenants, which may limit our flexibility to operate our business; changes in accounting standards; the potential for losses resulting from asset impairment charges; changing political, economic, regulatory and judicial influences, which could impact the purchasing practices and operations of our clients and increase costs to deliver compliant solutions and services; non-compliance with laws, government regulation or certain industry initiatives or failure to deliver solutions or services that enable our clients to comply with laws or regulations applicable to their businesses; variations in our quarterly operating results; potential variations in our sales forecasts compared to actual sales; volatility in the trading price of our common stock and the timing and volume of market activity; inability to manage organizational change and reduce expenses and costs to the extent currently anticipated; risks that Cerner’s revenue growth may be lower than anticipated and/or that the mix of revenue shifts to low margin revenue; risk that our capital programs will not be fully implemented or enhance long-term shareholder value; and risks that Cerner’s business may be negatively affected as a result of future proxy fights or the actions of activist shareholders. Additional discussion of these and other risks, uncertainties and factors affecting Cerner's business is contained in Cerner's filings with the Securities and Exchange Commission. The reader should not place undue reliance on forward-looking statements, since the statements speak only as of the date that they are made. Except as required by law, Cerner undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events, or changes in our business, results of operations or financial condition over time.Investor Contact:  Allan Kells, (816) 201-2445, akells@cerner.comMedia Contact:  Misti Preston, (816) 299-2037, misti.preston@cerner.com  "
    },
    {
        "title": "Cerner to Acquire AbleVets Further Expanding Strategic and Technical Expertise in U.S. Federal Health Market",
        "subtitle": "",
        "date": "Oct 18, 2019 9:00AM EDT",
        "content": "KANSAS CITY, Mo., Oct.  18, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN), a global health platform and innovation company, announced today a definitive agreement to acquire AbleVets—a strategic IT consulting and engineering firm—as a wholly-owned subsidiary. The acquisition of the Washington, DC area-based company will provide Cerner even greater scale and technical expertise in designing and implementing modernization solutions, particularly in the federal space. The companies expect to complete the transaction in the fourth quarter. “AbleVets has been a trusted partner to Cerner and is providing critical support to our federal programs,” said Travis Dalton, president, Cerner Government Services. “Integrating the team into our business is a natural next step of our relationship. We expect AbleVets’ technical expertise and execution in solving complex problems will accelerate Cerner’s success in providing integrated, seamless care for Veterans, Service members and their families.” AbleVets was founded as a Service-Disabled Veteran-Owned Small Business and focuses on the unique missions of federal health clients. AbleVets brings 350 professionals—many of whom are Veterans—specialized in cybersecurity, agile engineering, analytics and technology enablement to Cerner. These professionals have deep experience in delivering value to federal health clients, while reducing the time, cost and risk associated with IT modernization efforts. “I launched AbleVets to deliver health IT solutions that improve Veteran health,” said Dr. Wyatt Smith, founder and CEO of AbleVets, who served as an oncologist in the Navy. “By working with Cerner over the past year, we’ve been able to make important strides in laying the groundwork on our shared mission to transform care for those who served our country. By combining AbleVets’ strategic and technical expertise in the federal space with Cerner’s global scale, technology and innovation, we can expand our collective reach, accelerate developments and make the greatest impact on improving outcomes across the care continuum. We’re excited to join forces with Cerner and bring even more value and quality health care to those who have served.”   Cerner brings a high caliber of talent to support our federal clients. The company leverages internal expertise, innovative partners and with the AbleVets acquisition, external talent to fortify its implementation of the program.“As Cerner continues to drive health care innovation, we continue to seek top talent to enable our clients to deliver the highest quality of care. Teaming up with health technology leaders that bring specialized industry expertise and capabilities—like AbleVets for the federal market—will further help us drive optimal outcomes at an exceptional value for our clients and taxpayers. This is a transformational program and Cerner is building for our immediate needs while making decisions and investments to ensure we have the right talent in place for long-term success,” said Dalton.About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial systems to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. All statements in this press release that do not directly and exclusively relate to historical facts constitute forward-looking statements.  These forward-looking statements are based on the current beliefs, expectations and assumptions of Cerner's management with respect to future events and are subject to a number of significant risks and uncertainties.  It is important to note that Cerner's performance, and actual results, financial condition or business could differ materially from those expressed in such forward-looking statements. The words “expects”  or the negative of these words, variations thereof or similar expressions are intended to identify such forward-looking statements. For example, our forward-looking statements include statements regarding the expected benefits of the acquisition of AbleVets.  Factors that could cause or contribute to such differences include, but are not limited to: the possibility of significant costs and reputational harm related to product-related liabilities; potential claims for system errors and warranties; the possibility of interruption at our data centers or client support facilities, or those of third parties with whom we have contracted (such as public cloud providers), that could expose us to significant costs and reputational harm; the possibility of increased expenses, exposure to legal claims and regulatory actions and reputational harm associated with a cyberattack or other breach in our IT security or the IT security of third parties on which we rely; our proprietary technology may be subject to claims for infringement or misappropriation of intellectual property rights of others, or may be infringed or misappropriated by others; potential claims or other risks associated with relying on open source software in our proprietary software solutions or technology-enabled services; material adverse resolution of legal proceedings or other claims; risks associated with the unexpected loss or recruitment and retention of key personnel or the failure to successfully develop and execute succession planning to assure transitions of key associates and their knowledge, relationships and expertise; risks associated with failure to timely or effectively manage publicity related to harassment or discrimination claims and legal proceedings if such claims are raised against key personnel; risks related to our dependence on strategic relationships and third party suppliers; risks inherent with business acquisitions and combinations and the integration thereof into our business or relating to disputes involving such acquisitions or combinations; significant competition and our ability to quickly respond to market changes, changing technologies and evolving pricing and deployment methods and to bring competitive new solutions, devices, features and services to market in a timely fashion; managing growth in the new markets in which we offer solutions, health care devices or services; long sales cycles for our solutions and services; risks inherent in contracting with government clients, including without limitation, complying with strict compliance and disclosure obligations, navigating complex procurement rules and processes and defending against bid protests; changing political, economic, regulatory and judicial influences, which could impact the purchasing practices and operations of our clients and increase costs to deliver compliant solutions and services; and non-compliance with laws, government regulation or certain industry initiatives or failure to deliver solutions or services that enable our clients to comply with laws or regulations applicable to their businesses; Additional discussion of these and other risks, uncertainties and factors affecting Cerner's business is contained in Cerner's filings with the Securities and Exchange Commission. The reader should not place undue reliance on forward-looking statements, since the statements speak only as of the date that they are made. Except as required by law, Cerner undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events, or changes in our business, results of operations or financial condition over time.Contacts: Cerner Austin Cozzolino, Senior Communications Partner, (816) 786-2154, Austin.Cozzolino@Cerner.com "
    },
    {
        "title": "Cerner to Release Third Quarter 2019 Earnings Results October 24",
        "subtitle": "",
        "date": "Oct 10, 2019 9:00AM EDT",
        "content": "KANSAS CITY, Mo., Oct.  10, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (Nasdaq: CERN) today announced it will release its third quarter 2019 earnings results after the market closes Thursday, October 24. Following the release, the company will hold a conference call at 3:30 p.m. CT that can be accessed via dial-in or webcast. On the call, Cerner will discuss its results and outlook and answer questions from the investment community. The call may also include discussion of Cerner developments and other material and forward-looking information about business and financial matters.The dial-in number for the conference call is (678) 509-7542; the passcode is Cerner. The company recommends joining the call 15 minutes early for registration. An audio webcast will be available live and archived on Cerner’s website in the Investor Relations section.About Cerner Cerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial systems to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram,  LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. Media Contact: Misti Preston, Public Relations, (816) 299-2037Investor Contact: Allan Kells, Investor Relations, (816) 201-2445"
    },
    {
        "title": "Cerner CEO Unveils Next-Generation Cognitive Platform in Health Conference Keynote",
        "subtitle": "",
        "date": "Oct 8, 2019 4:24PM EDT",
        "content": "KANSAS CITY, Mo., Oct.  08, 2019  (GLOBE NEWSWIRE) -- During his keynote at Cerner Health Conference (CHC), the company’s Chairman and CEO, Brent Shafer, unveiled a next-generation cognitive health platform, introduced new tools that allow the company’s clients to get more from Cerner technology, announced new predictive modeling built directly into the opioid toolkit and opened up free access to the company’s training modules.“Health care will change more in the next five years than it has in the past 30,” Shafer told an audience of 5,000 clients, innovators and other health care industry professionals during the keynote address. “As we have for the past four decades, Cerner’s technology, and collaborative programs, along with the most respected providers, will lead a wave of disruptive innovation focused on making health care better.”Aligning with the conference’s theme of Now / Next, Shafer shared enhancements to benefit Cerner clients today [NOW], then announced a NEXT-generation health platform. Code named “Project Apollo,” this initiative brings a more cognitive approach to practicing medicine. Leveraging the powerful combination of its health care technology and the AWS infrastructure, Cerner’s new cloud-based platform will accelerate the speed that innovations are integrated by removing manual steps for clients that slow the pace of adoption. Additionally, Cerner is creating an intelligence ecosystem to innovate next-generation user experiences and care delivery algorithms. This future innovation will support caregivers in giving their full focus to delivering high quality, patient-centric care, supported by the power of Cerner’s intelligent platform.  Another focus of Shafer’s keynote addressed the ongoing effort to eliminate deaths caused by opioid abuse. It’s estimated that two million Americans live with an opioid disorder. Each day, nearly 130 U.S. citizens die from an opioid overdose. Using artificial intelligence and predictive analytics, Cerner is giving clients an enhanced toolkit that goes beyond prescribing history to identifying potential at-risk patients. As part of his remarks, Shafer issued a challenge to reduce the number of opioid-related deaths by 90%.  “Last year, deaths from opioid overdoses dropped by 5%,” said Shafer. “It was the first time since 1990 the number has declined. Even more progress needs to be made and I appeal to the health care industry to eradicate this epidemic.”As Shafer addressed the international audience, he also introduced improvements ranging from better toolkits, dashboards and analytics to improved data interoperability. Stemming from Cerner’s collaborative work in the federal space, the company is soon to roll out “Cerner Seamless Interoperability.” Essentially, the enhancement takes data from connectivity to usability and the new Cerner Seamless Interoperability can help give invaluable time back to clinicians.The company is also rolling out the Cerner Learning Framework—a web-based training platform—available to Cerner clients at no cost. “We started by asking our clients, ‘what’s in the way of giving your patients the best quality of care,’” said Shafer. “As we constructed our commitments and guiding principles, a relentless focus on our clients’ success became the overriding focus of everything we do at Cerner.”About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial system to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog or connect on Facebook, Instagram, LinkedIn, Twitter or The Cerner Podcast. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You.Media Contacts:CernerMisti Preston, Cerner public relations, (816) 299-2037, Misti.Preston@Cerner.com"
    },
    {
        "title": "Cerner and ResMed Join Forces to Connect Health Networks and the Home",
        "subtitle": "",
        "date": "Oct 7, 2019 9:00AM EDT",
        "content": "KANSAS CITY, Mo., Oct.  07, 2019  (GLOBE NEWSWIRE) -- Cerner Corporation (NASDAQ: CERN), a global health platform and innovation company, and ResMed (NYSE: RMD, ASX: RMD), a world-leading digital health company, today announced a new collaboration agreement to help providers make more informed treatment decisions, control costs and deliver seamless care across health systems to the home.As the population continues to age and payment models shift toward value-based care, home care is becoming more favored by patients and providers. To address this trend, Cerner designated ResMed’s Brightree Home Health and Hospice platform as its preferred solution in the space to integrate with its Cerner Millennium® electronic health record (EHR). The resulting flow of insightful data will provide caregivers better tools to make more informed decisions and more easily transition patients from acute settings to out-of-hospital care.“Both Cerner and ResMed believe in a system of health where the individual is at the center,” said Don Trigg, executive vice president, Strategic Growth, Cerner. “This relationship brings a top home health solution to Cerner clients and advances our larger, strategic vision to build a person-centric health network in every community.”Cerner also plans to connect other ResMed digital health data platforms—including those that support 10 million-plus cloud-connectable sleep apnea and respiratory care devices—to its EHR and HealtheIntent® population health platform. Having more of a patient’s comprehensive health data available in a place that clinicians use in their daily work can help everyone better understand and improve health outcomes.“Supporting seamless transitions of care between acute and post-acute settings is a fundamental part of ResMed’s strategy to improve people’s quality of life and reduce health care costs. Working with Cerner is a significant step toward that reality,” said Raj Sodhi, SaaS Business president, ResMed. “A person’s health data is their own and should move with them, giving providers the information they need to deliver personalized care. We look forward to supporting Cerner and its clients in shaping the future through connected care that improves people’s well-being and lowers costs for providers.”ResMed will present the Brightree Home Health and Hospice platform at the annual Cerner Health Conference 2019, beginning today through Oct. 9 in Kansas City.About CernerCerner’s health technologies connect people and information systems at more than 27,500 contracted provider facilities worldwide dedicated to creating smarter and better care for individuals and communities. Recognized globally for innovation, Cerner assists clinicians in making care decisions and assists organizations in managing the health of their populations. The company also offers an integrated clinical and financial systems to help manage day-to-day revenue functions, as well as a wide range of services to support clinical, financial and operational needs, focused on people. For more information, visit Cerner.com, The Cerner Blog, The Cerner Podcast or connect on Facebook, Instagram, LinkedIn or Twitter. Nasdaq: CERN. Smarter Care. Better Outcomes. Healthier You. About ResMedAt ResMed (NYSE: RMD, ASX: RMD) we pioneer innovative solutions that treat and keep people out of the hospital, empowering them to live healthier, higher-quality lives. Our cloud-connected medical devices transform care for people with sleep apnea, COPD and other chronic diseases. Our comprehensive out-of-hospital software platforms support the professionals and caregivers who help people stay healthy in the home or care setting of their choice. By enabling better care, we improve quality of life, reduce the impact of chronic disease and lower costs for consumers and healthcare systems in more than 120 countries. To learn more, visit ResMed.com and follow @ResMed.Contacts: Cerner MEDIA: Austin Cozzolino, (816) 786-2154, Austin.Cozzolino@Cerner.comResMedMEDIA: Jayme Rubenstein, (858) 836-6798, news@resmed.com INVESTORS: Amy Wakeham, (858) 836-5000, investorrelations@resmed.com "
    }
]