[
    {
        "title": "Check Point’s SecureAcademy Hits Major Milestone as 100th Academic Institution Joins the Global Education Program",
        "subtitle": "",
        "date": "Mar 3, 2020 6:00AM EST",
        "content": "SAN CARLOS, Calif., March  03, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has today announced that its Check Point SecureAcademy™ education initiative reached a major milestone with the 100th academic institution joining the program to provide a comprehensive cyber security curriculum to students.SecureAcademy offers an in-depth academic program to higher learning institutions worldwide, promoting educational and career opportunities in cyber security for students. SecureAcademy courses are now available at 100 universities in 40 countries, helping to shape the cyber-experts of the future and narrowing the cyber skills gap. Recent research shows the number of unfilled cyber security roles now stands at 4.07 million professionals globally, up from 2.93 million last year.Check Point works with recognized national and international universities, colleges and accredited higher education institutions to deliver the SecureAcademy program’s courses. These introduce students to cyber security concepts such as identifying and resolving security threats, and give hands-on experience with leading security solutions.  Completing the course gives students industry-recognised certifications in cyber security skills.Check Point offers the SecureAcademy instructor training courseware, instructor certification, software licenses and marketing support completely free of charge. Students who pass the certification exam upon completion will be extended an interview opportunity for employment at Check Point global offices or its network of more than 5000 affiliate organizations.“This milestone clearly shows the value that both students and leading educations institutions place on the SecureAcademy program, which is helping to equip the next generation of cyber-warriors with the skills they need to succeed in the industry,” said Shay Solomon, director for education services, Check Point Software Technologies. “The cybersecurity skills gap is large and still growing, so initiatives such as SecureAcademy and our innovative Knowledge Programs will be key to attracting and engaging students to help bridge that gap.  By offering range of opportunities for formal learning and professional development, we can give students a deeper understanding of the sector, and a fast-track route to employment.” As part of Check Point’s commitment to develop the next generation of cyber security professionals, it is also offering a new, free 4.5 hour online technical training course via Cybrary.it, the Massive Open Online Course (MOOC) provider which delivers IT and cyber security training to anyone, anywhere, and every skill level.  The Check Point course covers cyber security threats and security management.  Further free training modules will be available in 2020 covering cloud security, IoT security, mobile security and threat prevention.  Check Point also offers CloudGuard Cyber-Range training.  These courses deliver immersive cyber security training in simulated environments via the flexible Cyber Range cloud platform, offering an engaging, gamified learning environment.  Training is fully adaptive to users’ needs with built-in debriefing and progression tracking. For more information on Check Point’s SecureAcademy visit: https://www.checkpoint.com/support-services/secureacademy/Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprise’s cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.MEDIA CONTACT: Emilie Beneitez Lefebvre Check Point Software Technologiespress@checkpoint.com INVESTOR CONTACT:Kip E. MeintzerCheck Point Software Technologies  ir@checkpoint.com"
    },
    {
        "title": "Check Point SandBlast Agent Earns NSS Labs ‘AA’ Rating in 2020 Advanced Endpoint Protection Test",
        "subtitle": "",
        "date": "Feb 25, 2020 12:20PM EST",
        "content": "SAN CARLOS, Calif., Feb.  25, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, today announced that its Check Point SandBlast Agent advanced endpoint protection and threat prevention solution achieved an ‘AA’ rating in the recent NSS Labs 2020 Advanced Endpoint Protection (AEP) Test.NSS Labs, a globally recognized and trusted source for independent, fact-based cybersecurity testing, gave the ‘AA’ rating to SandBlast Agent – no ‘AAA’ were awarded in the AEP group test – which means the solution’s capacity to meet its commitments to customers is very strong. SandBlast Agent detected 100% of HTTP and email threats, 100% of malware using sophisticated evasion techniques, and 100% resistance to evasion.This represents Check Point’s 21st high rating by NSS Labs since it began testing Check Point’s solutions in 2010, consistently validating Check Point’s ability to protect organizations against the most advanced new cyber-attacks.“The latest generation of attacks are extremely fast-moving and evasive across multiple vectors. By the time these attacks are detected by traditional security products, the damage has already been done. The NSS test results show that SandBlast Agent blocks the vast majority of unknown attacks before they can infiltrate networks, preventing them from causing any damage,” said Itai Greenberg, VP of Product Management and Marketing, Check Point Software Technologies. “The NSS ‘AA’ rating for endpoint protection clearly demonstrates our ability to develop and deliver the most advanced threat prevention technologies.”The NSS AEP test report stated the strengths of SandBlast Agent include:SandBlast Agent is an integral component of Check Point’s fully consolidated cyber security architecture, Infinity, which protects all aspects of today’s IT infrastructures, including on-premise networks, endpoints, cloud and mobile. It leverages real-time threat intelligence from Check Point’s ThreatCloud knowledge database to continually monitor for threats across all platforms through a single pane of glass.SandBlast Agent provides purpose-built advanced Zero-Day Protection capabilities to protect web browsers and endpoints, leveraging Check Point’s industry-leading network protections. SandBlast Agent ensures complete real-time coverage across threat vectors, enabling employees to work safely no matter where they are without compromising productivity.For more information or to download a complimentary copy of the NSS Labs report of Check Point’s SandBlast Agent Next Generation AV’s test results, visit: https://pages.checkpoint.com/2020-nss-advanced-endpoint-protection-test.htmlFollow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprise’s cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.MEDIA CONTACT:                                                        INVESTOR CONTACT:Emilie Beneitez Lefebvre                                            Kip E. MeintzerCheck Point Software Technologies                              Check Point Software Technologies         press@checkpoint.com                                                 ir@checkpoint.com"
    },
    {
        "title": "Check Point Software Technologies Recognized as a Microsoft Security 20/20 Partner Award Winner for Most Prolific Integration Partner",
        "subtitle": "",
        "date": "Feb 25, 2020 9:00AM EST",
        "content": "SAN CARLOS, Calif., Feb.  25, 2020  (GLOBE NEWSWIRE) -- Check Point Software Technologies today announced it has been named a Microsoft Security 20/20 award winner for the Most Prolific Integration Partner category. The company was honored among a global field of top Microsoft partners for demonstrating excellence in innovation, integration, and customer implementation with Microsoft technology.At the inaugural Microsoft Security 20/20 partner awards, held February 23, Microsoft announced award winners in 16 categories that span security integration partners, system integrators and managed security service providers. Check Point Software Technologies is a winner for Microsoft Security 20/20 Most Prolific Partner award.Today, the cloud computing environment is the most complex it has ever been. The number of cloud services offered to enterprises has grown exponentially. The manner in which businesses store and scale data has changed dramatically. At the same time, the number of technologies deployable in the cloud has multiplied significantly, while application architecture has moved to micro-services, which has redefined the perimeter for security to that of the workload. All of these changes have made for a drastic increase in attack surface in today’s cloud computing environment. Enterprises everywhere face the stern reality of multiple attack points - both ephemeral in nature and fragmented across a vast landscape in the cloud.To meet the unique security needs of today’s cloud and that of Azure customers, Microsoft and Check Point began working together. Microsoft shares Check Point’s belief that prevention supersedes detection. That, if you’ve detected an attack - most likely in the form of a breach - it means that you are already undergoing damage control to your company and brand. As a result, multiple integrations connect Microsoft and Check Point CloudGuard security products, including Azure Security Center, Azure Sentinel and Intune. These integrations ensure the assets of Azure customers are fully protected while allowing them to benefit from the elastic, dynamic and cost effective nature of Azure cloud.Azure customers are choosing Check Point as their top choice in cloud security. Microsoft’s Most Prolific Integration Partner Award underscores Check Point’s leadership and vision in cloud security, and further emphasizes Check Point’s ability to meet the new and complex nature that surrounds today’s cloud.“Microsoft and Check Point have significantly aligned their efforts,” said Itai Greenberg, VP, Product Management and Product Marketing Check Point Software Technologies. “Security is continually cited as a key barrier to wide-spread enterprise cloud adoption and expansion. Together, Microsoft and Check Point deliver one of the most advanced threat prevention solution to Azure customers, keeping their cloud network, data and applications protected from the most sophisticated Gen VI cyberattacks today.”Only through collaborations can organizations help customers get clarity and become more secure. The security ecosystem must work together to create a vision for the future where people, information, and companies are made safer. Microsoft Security 20/20 provides an opportunity to honor Microsoft partners that have developed and delivered exceptional Microsoft-based solutions and services during the past year.Deployed by over 4,000 organizations worldwide, the Check Point CloudGuard portfolio of cloud security solutions addresses all aspects of the Cloud threat landscape. The solution delivers public and private cloud advanced threat prevention, posture management and compliance, runtime protection for cloud workloads, SaaS application security, as well as cloud threat intelligence and analytics.Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprise’s cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "January 2020’s Most Wanted Malware: Coronavirus-themed Spam Spreads Emotet Malware",
        "subtitle": "",
        "date": "Feb 13, 2020 6:00AM EST",
        "content": "SAN CARLOS, Calif., Feb.  13, 2020  (GLOBE NEWSWIRE) -- Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has published its latest Global Threat Index for January 2020. The research team reported that Emotet was the leading malware threat for the fourth month running, and was being spread during the month using a Coronavirus-themed spam campaign.The emails appear to be reporting where Coronavirus is spreading, or offering more information about the virus, encouraging the victim to open the attachments or click the links which, if opened, attempt to download Emotet on their computer. Emotet is primarily used as a distributor of ransomware or other malicious campaigns.January also saw an increase in attempts to exploit the ‘MVPower DVR Remote Code Execution’ vulnerability, impacting 45% of organizations globally. This rose from being the third most exploited vulnerability in December to the top position this month. If successfully exploited, a remote attacker can exploit this weakness to execute arbitrary code on the targeted machine.“As with last month, the ‘most wanted’ malicious threats impacting organizations continue to be versatile malware such as Emotet, XMRig and Trickbot, which collectively hit over 30% of organizations worldwide,” said Maya Horowitz, Director, Threat Intelligence & Research, Products at Check Point. “Businesses need to ensure their employees are educated about how to identify the types of topical spam emails that are typically used to propagate these threats, and deploy security that actively prevents these threats from infecting their networks and leading to ransomware attacks or data exfiltration.”January 2020’s Top 3 ‘Most Wanted’ Malware:*The arrows relate to the change in rank compared to the previous month.Emotet is holding the 1st place impacting 13% of organizations globally, followed by XMRig and Trickbot impacting 10% and 7% of organizations worldwide respectively.January’s Top 3 ‘Most Wanted’ Mobile Malware:xHelper retains its 1st place in the most prevalent mobile malware, followed by Guerilla and AndroidBauts.January’s ‘Most Exploited’ vulnerabilities:The “MVPower DVR Remote Code Execution” was the most common exploited vulnerability, impacting 45% of organizations globally, followed by “Web Server Exposed Git Repository Information Disclosure” with an impact of 44% and the “PHP DIESCAN information disclosure” vulnerability impacting 42%.Check Point’s Global Threat Impact Index and its ThreatCloud Map is powered by Check Point’s ThreatCloud intelligence, the largest collaborative network to fight cybercrime which delivers threat data and attack trends from a global network of threat sensors. The ThreatCloud database holds over 250 million addresses analyzed for bot discovery, more than 11 million malware signatures and over 5.5 million infected websites, and identifies millions of malware types daily.The complete list of the top 10 malware families in December can be found on the Check Point Blog.Follow Check Point Research via:Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearch_About Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "Facebook is Most Imitated Brand for Phishing Attempts: Check Point Research’s Q4 2019 Brand Phishing report",
        "subtitle": "",
        "date": "Feb 6, 2020 6:00AM EST",
        "content": "VIENNA, Austria, Feb.  06, 2020  (GLOBE NEWSWIRE) -- Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has published its new Brand Phishing Report for Q4 2019.  The report highlights the brands which were most frequently imitated by criminals in their attempts to steal individuals’ personal information or payment credentials during Q4, which includes the busiest online shopping periods of the year.In a brand phishing attack, criminals try to imitate the official website of a well-known brand by using a similar domain name or URL and web-page design to the genuine site.  The link to the fake website can be sent to targeted individuals by email or text message, redirected during web browsing, or triggered from a fraudulent mobile application.  The fake website often contains a form intended to steal users’ credentials, payment details or other personal information.Top phishing brands in Q4 2019The top brands are ranked by their overall appearance in brand phishing attempts:Top phishing brands by platformDuring Q4 there were significant differences in the brands being used in each phishing vector:  for example the focus in the mobile vector was on major technology & social media brands as well as banks, while in the email vector, #2 was part of a shopping phishing campaign before Black Friday in November 2019.Email (27% of all phishing attacks during Q4)Web (48% of all phishing attacks in Q4)Mobile (25% of all phishing attacks in Q4)“Cybercriminals are using a variety of attack vectors to trick their intended victims into giving up personal information and login credentials or transferring money.  Although this is often done using spam emails, we have also seen attackers obtain credentials to email accounts, study their victim for weeks and craft a targeted attack against partners and customers to steal money,” said Maya Horowitz, Director, Threat Intelligence & Research, Products at Check Point.  “Over the last two years, incidences of this type of attack have spiked with the increased use of cloud-based email, which makes it easier for criminals to disguise themselves as a trusted party. Phishing will continue to be a growing threat in 2020.”Check Point’s Brand Phishing Report is powered by Check Point’s ThreatCloud intelligence, the largest collaborative network to fight cybercrime which delivers threat data and attack trends from a global network of threat sensors.  The ThreatCloud database holds over 250 million addresses analyzed for bot discovery, more than 11 million malware signatures and over 5.5 million infected websites, and identifies millions of malware types daily.Check Point’s Threat Prevention Resources are available at:  http://www.checkpoint.com/threat-prevention-resources/index.htmlFollow Check Point Research via:Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearchAbout Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "Check Point Delivers Unified Security Management as a Cloud Service to Cut Security Operations Time by 60%",
        "subtitle": "",
        "date": "Feb 5, 2020 6:00AM EST",
        "content": "VIENNA, Austria, Feb.  05, 2020  (GLOBE NEWSWIRE) -- CPX - Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has today announced that its R80 unified security software is now available as a cloud service. This gives customers the quickest route to deploying Check Point’s unified security management across their entire network fabric from their web browser, with no deployment time needed, and no need for ongoing maintenance or manual updates.The new R80 Security Management-as-a-Service (MaaS) solution extends Check Point’s Fast Track Network Security suite of solutions to deliver unprecedented protection, scalability, and ease of deployment and control for enterprises. R80 Security MaaS gives holistic visibility of security across organizations’ entire infrastructures in a customizable visual dashboard, enabling the most complex environments to be managed more efficiently, cutting operational time by up to 60% compared with other solutions.R80 is the industry’s most advanced unified security software for on-premise and cloud environments, with over 160 technology integrations. The latest version, R80.40 has over 100 new features to extend protection, streamline operational processes and enhance productivity. R80 Security MaaS delivers:“R80 Management-as-a-Service further accelerates and simplifies enterprise security management processes, by eliminating manual maintenance and updates and supporting on-demand scalability,” said Itai Greenberg, VP Product Management at Check Point. “Together with the Fast Track Network Security suite of advanced gateways, it gives customers the quickest route to hyperscale, high-performance network security while improving the efficiency of their operations.”Fast Track Network Security comprises five new Quantum Security Gateways™ which feature Check Point’s ThreatCloud and award-winning SandBlast™ Zero-Day Protection. The new range starts with the 3600 model for branch offices and extends to the large enterprise with the 16000 Turbo Hyperscale gateway, which delivers 17.6 Gbps of Gen V Threat Prevention throughput – over 2x faster than rival high-end gateways, while using less than half the energy.Fast Track Network Security’s combination of new Security Gateways, the enhanced R80.40 software and its availability as a cloud service offering enables organizations to deploy the most advanced, fully scalable and easy-to-manage protections against evolving fifth-generation threats.For product specifications or to learn more about functionality, please visit: https://www.checkpoint.com/products/security-management-as-a-serviceAvailability Check Point Fast Track Network Security will be available from our global network of partners.Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprise’s cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes. "
    },
    {
        "title": "The Dark Side of Smart Lighting:  Check Point Research Shows How Business and Home Networks Can Be Hacked from a Lightbulb",
        "subtitle": "",
        "date": "Feb 5, 2020 6:00AM EST",
        "content": "VIENNA, Austria, Feb.  05, 2020  (GLOBE NEWSWIRE) -- CPX – Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has today revealed vulnerabilities that would enable a hacker to deliver ransomware or other malware to business and home networks by taking over smart lightbulbs and their controller.Check Point’s researchers showed how a threat actor could exploit an IoT network (smart lightbulbs and their control bridge) to launch attacks on conventional computer networks in homes, businesses or even smart cities.  Researchers focused on the market-leading Philips Hue smart bulbs and bridge, and found vulnerabilities (CVE-2020-6007) that enabled them to infiltrate networks using a remote exploit in the ZigBee low-power wireless protocol that is used to control a wide range of IoT devices.In an analysis of the security of ZigBee-controlled smart lightbulbs that was published in 2017, researchers were able to take control of a Hue lightbulb on a network, install malicious firmware on it and propagate to other adjacent lightbulb networks. Using this remaining vulnerability, our researchers decided to take this prior work one step further and used the Hue lightbulb as a platform to take over the bulbs’ control bridge and ultimately, attacking the target's computer network. It should be noted that more recent hardware generations of Hue lightbulbs do not have the exploited vulnerability.The attack scenario is as follows:“Many of us are aware that IoT devices can pose a security risk, but this research shows how even the most mundane, seemingly ‘dumb’ devices such as lightbulbs can be exploited by hackers and used to take over networks, or plant malware,” said Yaniv Balmas, Head of Cyber Research, Check Point Research. “It’s critical that organizations and individuals protect themselves against these possible attacks by updating their devices with the latest patches and separating them from other machines on their networks, to limit the possible spread of malware. In today’s complex fifth-generation attack landscape, we cannot afford to overlook the security of anything that is connected to our networks.”The research, which was done with the help of the Check Point Institute for Information Security (CPIIS) in Tel Aviv University, was disclosed to Philips and Signify (owner of the Philips Hue brand) in November 2019. Signify confirmed the existence of the vulnerability in their product, and issued a patched firmware version (Firmware 1935144040) which is now  via an automatic update. We recommend users to make sure that their product received the automatic update of this firmware version.“We are committed to protecting our users’ privacy and do everything to make our products safe. We are thankful for responsible disclosure and collaboration from Checkpoint, it has allowed us to develop and deploy the necessary patches to avoid any consumers being put at risk,” says George Yianni, Head of Technology Philips Hue.Here is a demo video of how the attack works. The full technical research details will be published at a later date in order to give users time to successfully patch their vulnerable devices.Check Point is the first vendor to provide a consolidated security solution that hardens and protects the firmware of IoT devices. Utilizing a recently acquired technology, Check Point allows organization to mitigate device level attacks before devices are compromised utilizing on-device run time protection.Follow Check Point Research via:Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearch_About Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "Check Point Software Technologies Announces Expansion of Share Repurchase Program",
        "subtitle": "",
        "date": "Feb 3, 2020 5:00AM EST",
        "content": "SAN CARLOS, Calif., Feb.  03, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, today announced that its board of directors has authorized the expansion of the company’s on-going share repurchase program by an additional $2 billion. Under the share repurchase program, as extended, Check Point is authorized to continue to repurchase up to $325 million each quarter.As of December 31, 2019, Check Point has approximately 145.5 million ordinary shares outstanding. Since the beginning of the share repurchase program, Check Point has repurchased approximately 171.1 million shares for a total purchase price of approximately $9.2 billion. The updated plan extends the company’s existing repurchase program, which had provided for the repurchase of up to $325 million shares each quarter, up to an aggregate of $2 billion, and which is expected to be completed in the second quarter of 2020.Share purchases under the extended repurchase program will take place in open market transactions or in privately negotiated transactions and may be made from time to time depending on market conditions, share price, trading volume, and other factors. Such purchases will be made in accordance with applicable U.S. securities laws and regulations. For all or a portion of the authorized repurchase amount, Check Point may enter into a plan that is compliant with Rule 10b5-1 of the United States Securities Exchange Act of 1934 that is designed to facilitate these purchases. The repurchase program does not require Check Point to acquire a specific number of shares, and may be suspended from time to time or discontinued. The share repurchases are expected to be funded from available working capital.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Its solutions protect customers from cyber-attacks with an industry leading catch rate of malware, ransomware and other types of attacks. Check Point offers a multilevel security architecture that defends enterprises’ cloud, network and mobile device held information, plus the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.Legal Notice Regarding Forward-Looking Statements This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934.  Forward-looking statements generally relate to future events or our future financial or operating performance. Forward-looking statements in this press release include, but are not limited to, statements related to statements related to our expectations regarding Check Point’s share repurchase program and the updated share repurchase program.  Check Point’s expectations and beliefs regarding these matters may not materialize, and actual results in future periods are subject to risks and uncertainties that could cause actual results to differ materially from those projected. These risks include our ability to continue to develop platform capabilities and solutions; customer acceptance and purchase of our existing solutions and new solutions; the market for IT security continuing to develop; competition from other products and services; general market, political, economic and business conditions; the market conditions, share price, trading volume of Check Point’s ordinary shares; Check Point’s strategic decisions regarding use of capital; and Check Point’s working capital available for share repurchases. The forward-looking statements contained in this press release are also subject to other risks and uncertainties, including those more fully described in our filings with the Securities and Exchange Commission, including Check Point’s Annual Report on Form 20-F filed with the Securities and Exchange Commission on April 23, 2019. The forward-looking statements in this press release are based on information available to Check Point as of the date hereof, and Check Point disclaims any obligation to update any forward-looking statements, except as required by law.©2020 Check Point Software Technologies Ltd. All rights reserved."
    },
    {
        "title": "Check Point Software Technologies Reports 2019 Fourth Quarter and Full Year Financial Results",
        "subtitle": "",
        "date": "Feb 3, 2020 5:00AM EST",
        "content": "SAN CARLOS, Calif., Feb.  03, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), today announced its financial results for the fourth quarter and full year ended December 31, 2019.Fourth Quarter 2019          Full Year 2019“We closed out the last decade with nearly two billion dollars in annual revenues and over one billion dollars in non-GAAP operating income. Over the last decade we introduced our security-as-a-service subscription model, which delivers the most advanced technologies in cyber.  In 2019, subscription reached over six hundred million dollars in revenues and was driven by cloud, mobile and zero-day advanced threat prevention technologies,” said Gil Shwed, Founder and CEO of Check Point Software Technologies. “We began the new decade with the introduction of Infinity NEXT, the industry’s most comprehensive cyber security platform with over 60 security technologies that support over 50 types of assets including operating systems, cloud workloads, IoT devices, mobile devices and network of any type,” Shwed concluded.Financial Highlights for the Fourth Quarter of 2019Financial Highlights for the Year Ended December 31, 2019For information regarding the non-GAAP financial measures discussed in this release, as well as a reconciliation of such non-GAAP financial measures to the most directly comparable GAAP financial measures, please see “Use of Non-GAAP Financial Information” and “Reconciliation of GAAP to Non-GAAP Financial Information.”Check Point business highlights includes key announcements for 2019 to date addressing architecture, network security, threat prevention, cloud, workload and IOT security. Consolidated Security ArchitectureInfinity NEXT Infinity NEXT is the industry’s most complete, consolidated security architecture. Infinity NEXT utilizes cloud native architecture and is designed to protect any asset, anywhere via innovative Nano Agent technology and a full spectrum of over 60 adaptive threat prevention security practices delivered as a service.Network SecurityR80.40 Software R80 is the industry’s most advanced threat prevention and security management software for data centers, cloud, mobile, endpoint and IoT. The new R80.40 software has over 100 new features, including inspection of SSH and HTTP/2 protocols, optimal CPU utilization based on dynamic workloads technology, zero-touch deployment for new appliances, and IoT policy and enforcement.  Quantum Security Gateways The new Quantum Security Gateways include six new Security Gateways which feature Check Point’s ThreatCloud and SandBlast Zero-Day Protection. The new range includes the 3600, 6200, 6600 and 6900 Quantum Security Gateways, and the Check Point Maestro Gateways 16000 and 26000 Turbo Hyperscale, which delivers 120Gbps of Gen V Threat Prevention throughput.Series 1500 Gateways – SMB SecurityNew series of small and medium business appliances set new standards of protection against the most advanced fifth-generation cyberattacks, and offer unrivalled ease of deployment and management with up to two times more performance from previous generations. The 1550 Gateway offers 450Mbps of threat prevention performance, and the 1590 Gateway offers 660Mbps.Maestro - Cloud Grade Elasticity & ResiliencyCheck Point Maestro is a revolutionary new architecture that enables businesses of any size to enjoy the power of cloud-grade elasticity and resiliency in a security platform. Maestro enables seamless expansion of existing security gateways to hyper scale capacity by allowing businesses to expand from one gateway up to 52 gateways in minutes and realize the performance of massive Terabits/second firewall throughput.CloudGuard Connect & Edge – SD-WAN Cloud delivered network securityCheck Point CloudGuard Connect and CloudGuard Edge deliver top-rated Threat Prevention updated in real-time with the latest ThreatCloud intelligence, flexibility to deploy branch office security in minutes from the cloud or on-premise, seamless integration with leading SD-WAN providers like VMware and Silver Peak, and a unified threat and access management platform that can significantly reduce operational expense.Threat PreventionMalware DNA - Artificial Intelligence-Based Malware Detection EngineMalware DNA accelerates Zero-Day Threat Prevention. New engine scans unknown malware for code patterns that match existing known malware, further accelerating the identification and blocking of previously undiscovered malware, and reducing response times.Highest Security Effectiveness Score - Second NSS Labs Breach Prevention Systems Test NSS Labs tested Check Point’s Next Gen Firewall Security Gateway, Threat Prevention and Advanced Endpoint Security, earning the solution a “Recommended” rating for its security effectiveness and TCO per protected Mbps. The rating further validates Check Point’s ongoing ability to protect organizations by preventing the most advanced cyber-attacks.SandBlast Mobile Recognized as Security Leader Check Point achieved a 99% security rating in Miercom’s Mobile Threat Defense (MTD) Industry Assessment for its solution, SandBlast Mobile, surpassing all tested vendors’ solutions.Cloud & Workload SecurityCloudGuard Log.ic - Analytics Solution Exposes Unseen Cloud ThreatsCloudGuard Log.ic provides threat protection and context-rich security intelligence in the public cloud, enabling operations teams to see every IaaS and PaaS asset, understand cloud activities, and easily launch forensics.Cloud Security Leadership Extended with Unmatched Serverless ProtectionCheck Point announced a new Serverless security technology.  Check Point is first to market with a consolidated security solution for cloud workload protection (CWPP) and security posture management (CSPM), delivering continuous serverless security with unmatched run time protection and application hardening. Protego, an Israeli startup, provides a serverless security technology that prevents malicious attacks on serverless functions in run time, and prevents vulnerable code from being deployed into production.CloudGuard Exended with Fully-integrated Support for KubernetesCheck Point delivers fully Integrated Cloud security for Kubernetes - extended the capabilities of its CloudGuard cloud security platform to support Kubernetes computing services, including Amazon Elastic Kubernetes Service (Amazon EKS) and Amazon Elastic Container Service (Amazon ECS). Customers can ensure that their Kubernetes configurations continuously comply with established container security baselines and secures traffic between Kubernetes and on premise or cloud assets using IPsec VPNIOTRevolutionizing IOT Cyber Security Check Point announced new IoT cyber security technology.  Check Point provides a consolidated security solution that hardens and protects the firmware of IoT devices and is designed to make them secure against the most sophisticated attacks. The technology is provided through the acquisition of Cymplify, a startup based in Tel Aviv.  The new technology will be integrated into Check Point’s Infinity architecture.Check Point Research https://research.checkpoint.com uncovered numerous findings that included WhatsApp, TikTok and Android Applications. We also published new findings about malware families including multiple types of Ransomware, malware on computers and mobile devices.Vulnerabilities in Applications & InfrastructureWeb Conferencing Vulnerabilities Have you ever wondered if someone can eavesdrop on your company’s meetings and learn the details of your biggest secrets? Imagine a stranger sitting just next to you in the same room, when you are discussing your “next big thing.” In this publication we describe a technique which would have allowed a threat actor to perform exactly that type of attack over the Zoom web conferencing platform.Don’t be silly, it’s only a lightbulb After analyzing the security of ZigBee IoT devices, specifically the smart hub that bridges between the IP and Zigbee network. By masquerading as a legitimate Zigbee lightbulb, Check Point Research was able to find and exploit vulnerabilities in the bridge that enabled them to infiltrate the IP network using a remote over-the-air ZigBee exploit.AzureStack SSRF to Info Disclosure Check Point Research discovered major flaws in Microsoft's popular cloud platform that is intended to poke a hole in the (false) security concept provided by the cloud providers.Vulnerabilities in TikTok Our research revealed multiple vulnerabilities in TikTok. The research found that an attacker could send a spoofed SMS message to a user containing a malicious link and that Tiktok's subdomain https://ads.tiktok.com was vulnerable to XSS attacks. These vulnerabilities could have allowed an attacker to manipulate content on a user’s account and even extract confidential personal information saved on these accounts.WhatsApp Crash & Data Loss Bug Check Point Research found a vulnerability in WhatsApp that could allow an attacker to deliver a malicious group chat message that would crash the app and cause data loss. To regain use of WhatsApp, users would need to uninstall and reinstall it, then delete the group which contains the message.Vulnerabilities in Android Applications Discovered that multiple applications on the Google Play store, including Facebook, are vulnerable to very old vulnerabilities. The vulnerabilities could potentially allow an attacker to steal data related to the app and gain Android permissions which the app has access to such as a user’s location.Ransomware ResearchDeCypherIT To evade detection, malware developers use packers to encrypt their malicious crafts before releasing them to the wild. Check Point Research discusses a case study where they were able to decrypt a specific packer that is very popular among malware developers. The developers of this packer offer it for sale on the internet, and promise it is undetectable.Incident Response Casefile – A successful BEC leveraging lookalike domains Cyber criminals hacked a wire transfer between a Chinese venture capital firm and an Israeli startup. After the criminals hijacked a one million dollar wire transaction, Check Point's Incidence Response Team investigated the case.Phorpiex botnet The Phorpiex botnet is spread through exploit kits and with the help of other malware, has infected more than 1,000,000 Windows computers. The annual criminal revenue generated by Phorpiex botnet is approximately half a million US dollars.In the Footsteps of a Sextortion Campaign Check Point Research exposed a spam botnet, dubbed Phorpiex, which is responsible for a large portion of the sextortion traffic seen in the wild. We monitored the operation and recorded Bitcoin transfers to the Phorpiex campaign wallets whose current value is over $110,000.Eye on the Nile-a cyber-operation Check Point’s research team uncovered an operation against civil rights activists, as well as Amnesty members in Egypt. Following an initial report by Amnesty International in March, CPR uncovered the scope and means of a sophisticated attack allegedly linked to the Egyptian ministry and government site.Conference Call and Webcast Information Check Point will host a conference call with the investment community on February 3, 2020, at 8:30 AM ET/5:30 AM PT. To listen to the live webcast or replay, please visit the website www.checkpoint.com/ir.First Quarter 2020 Investor Conference Participation ScheduleMembers of Check Point's management team are expected to present at these conferences and discuss the latest company strategies and initiatives. Check Point’s conference presentations are expected to be available via webcast on the company's web site. To hear these presentations and access the most updated information, please visit the company's web site at www.checkpoint.com/ir. The schedule is subject to change.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Its solutions protect customers from cyber-attacks with an industry leading catch rate of malware, ransomware and other types of attacks. Check Point offers a multilevel security architecture that defends enterprises’ cloud, network and mobile device held information, plus the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.©2020 Check Point Software Technologies Ltd. All rights reservedLegal Notice Regarding Forward-Looking StatementsThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934.  Forward-looking statements generally relate to future events or our future financial or operating performance. Forward-looking statements in this press release include, but are not limited to, statements related to our expectations regarding our products and solutions, customer and market acceptance of our products and solutions, and our participation in investor conferences during the first quarter of 2020.  Our expectations and beliefs regarding these matters may not materialize, and actual results or events in the future are subject to risks and uncertainties that could cause actual results or events to differ materially from those projected.  These risks include our ability to continue to develop platform capabilities and solutions; our ability to successfully integrate and offer acquired products and services; customer acceptance and purchase of our existing solutions and new solutions; the market for IT security continuing to develop; competition from other products and services; and general market, political, economic and business conditions.  The forward-looking statements contained in this press release are also subject to other risks and uncertainties, including those more fully described in our filings with the Securities and  Exchange Commission, including our Annual Report on Form 20-F filed with the Securities and Exchange Commission on April 23, 2019. The forward-looking statements in this press release are based on information available to Check Point as of the date hereof, and Check Point disclaims any obligation to update any forward-looking statements, except as required by law.Use of Non-GAAP Financial Information  In addition to reporting financial results in accordance with generally accepted accounting principles, or GAAP, Check Point uses non-GAAP measures of operating income, net income and earnings per diluted share, which are adjustments from results based on GAAP to exclude or include certain items. Check Point’s management believes the non-GAAP financial information provided in this release is useful to investors’ understanding and assessment of Check Point’s ongoing core operations and prospects for the future. Historically, Check Point has also publicly presented these supplemental non-GAAP financial measures in order to assist the investment community to see the Company “through the eyes of management,” and thereby enhance understanding of its operating performance. The presentation of this non-GAAP financial information is not intended to be considered in isolation or as a substitute for results prepared in accordance with GAAP. A reconciliation of the non-GAAP financial measures discussed in this press release to the most directly comparable GAAP financial measures is included with the financial statements contained in this press release. Management uses both GAAP and non-GAAP information in evaluating and operating the business internally and as such has determined that it is important to provide this information to investors.CHECK POINT SOFTWARE TECHNOLOGIES LTD. CONSOLIDATED STATEMENT OF INCOME(Unaudited, in millions, except per share amounts)CHECK POINT SOFTWARE TECHNOLOGIES LTD. SELECTED FINANCIAL METRICS(Unaudited, in millions, except per share amounts)CHECK POINT SOFTWARE TECHNOLOGIES LTD.RECONCILIATION OF GAAP TO NON GAAP FINANCIAL INFORMATION(Unaudited, in millions, except per share amounts)CHECK POINT SOFTWARE TECHNOLOGIES LTD.CONDENSED CONSOLIDATED BALANCE SHEET DATA(Unaudited, in millions)ASSETSLIABILITIES ANDSHAREHOLDERS’ EQUITYCHECK POINT SOFTWARE TECHNOLOGIES LTD.SELECTED CONSOLIDATED CASH FLOW DATA(Unaudited, in millions)"
    },
    {
        "title": "Check Point Software Launches New Global Partner Program to Accelerate and Scale Channel Success",
        "subtitle": "",
        "date": "Jan 27, 2020 11:45AM EST",
        "content": "SAN CARLOS, Calif., Jan.  27, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions, today announced the launch of its new global partner program. Developed in close consultation with hundreds of Check Point partners, the program encourages closer alignment with Check Point’s channel teams while implementing best practices, speed, agility, time to market, and customer value.The program enables deeper collaboration with Check Point, giving access to expert support and resources to speed up customer sales cycles. Partners will enjoy predictable growth margins and recognition when winning new accounts, closing strategic win-backs, and accelerating customer adoption and success in cloud security. Mutual customers will also benefit from a great day-one experience, and flexible solutions that give them more versatility and value in their security purchasing decisions. “The focus for the Check Point Partner Growth Program is to deliver the best growth opportunities and rewards in the industry and help our partners be more successful and profitable,” said Frank Rauch, Check Point’s Head of Worldwide Channels. “With the program’s new initiatives, we are doubling down on our commitment to helping our partners win new business and build even stronger relationships with existing Customers.”  Dan Yerushalmi, Chief Customer Officer at Check Point said, “Partners continue to be a key pillar in Check Point’s growth strategy. I am very pleased with our team’s work on the Check Point Partner Growth Program, which aligns well to our strategic initiatives of acquiring new customers and next generation security. I want to personally thank the hundreds of partners who provided amazing feedback and showed confidence in Check Point. We have listened and executed on your behalf to take advantage of the incredible opportunities available in 2020 and beyond.”The program introduces a new “Elite” tier, empowering partners to expand the breadth of the solutions they offer to customers. The program’s tiered levels incentivize channel partners with competitive deal registration management, enabling partners to take full advantage of new opportunities available in the growing network and data security market. The program also rewards partners for supporting Check Point’s solutions with their value-add Professional Services and MSSP initiatives, helping them to reap further benefits from innovating and optimizing the overall customer experience.The Check Point Partner Growth Program also provides access to more expert resources to help customers with solution deployments and improve the overall product experience so that customers can benefit from best-in-class security and flexible consumption models. The Program aims to accelerate, increase and reward customer value through helping partners to grow their capabilities and brand. Check Point endorses industry alliances and unique product integrations with platform providers including Microsoft Azure, Amazon Web Services, VMWare and Silver Peak.“Sirius continues to invest in and align with top strategic partners to provide the right solutions for our clients,” said Deborah L. Bannworth, Sr. Vice President, Strategic Alliances, Inside Sales, Maintenance Sales & Support at Sirius. “Check Point’s proven technology solutions, with a focus on customer value, align well with Sirius’ strategy. We are proud to partner with them to help resolve the complexities of the of our customers next generation cybersecurity requirements. Together, we provide the turnkey solutions our clients need to ensure they are protected end-to-end, across all lines of their business, and regardless of the evolving threat landscape.” Read more about Check Point Partner Growth Program on our partner portal. Learn about the latest cyber threats and vulnerabilities from Check Point’s Threat Intelligence Group and researchers on our new podcast, cp.Follow Check Point via: Twitter: http://www.twitter.com/checkpointsw Facebook: https://www.facebook.com/checkpointsoftware Blog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobal LinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends enterprise’s cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "Check Point Software Technologies Receives 2 New Common Criteria Certifications to Meet the Security Needs of 31 Nations",
        "subtitle": "",
        "date": "Jan 16, 2020 5:00AM EST",
        "content": "SAN CARLOS, Calif., Jan.  16, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, is proud to announce the successful completion of two Common Criteria Certifications for its R80.30 Security Management and Gateway appliances. The EAL4+ and Protection Profile compliance certifications follow an international standard for validating products that meet specific security requirements for Governments around the world.This milestone marks an important step toward expanding the company’s ability to serve the 31 Nations who are members of the Common Criteria Recognition Agreement (CCRA). The Protection Profile certifications are required for security products used by government sectors in the US, Canada, UK, Australia and New Zealand. EAL4+ compliance is generally required for products securing the Government and public networks in Europe, and Asia. Check Point is proud to have certified both the R80 SmartConsole and REST APIs, which provide the leading ease-of-use and ease-of-automation security management.Check Point’s products have undergone evaluation and validation in accordance with the provisions for 3 National Information Assurance Partnership (NIAP) approved Community Protection Profiles for Network Devices, Firewall and VPN.  R80.30 was certified at EAL4+ including the new Firewall stateful inspection engine and IPS Blade Pattern Matcher. EAL4+ validates Check Point’s development methodology, internal systems, processes, security and support process.  Both evaluations included independent feature and penetration testing and a vulnerability analysis. Both R80.30 certificates give accreditation for Smart-1 appliances and a set of enterprise appliances including TE and CloudGuard.“Check Point is focused on delivering solutions that consistently meet and exceed the requirements established by internationally recognized standards, proving our dedication to provide the highest level of security for government and enterprise organizations,” said Itai Greenberg, Vice President of Product Management at Check Point. “This certification demonstrates Check Point’s commitment to deliver innovative and unmatched security protection.”R80.30 is now listed by NIAP-CCEVS on their Product Compliant List, by the Netherlands NSCIB certification scheme, and the NSA CSFC list for protecting classified NSS data, and qualifies for listing by NIAPC (NATO Information Assurance Product Catalogue), and the UK National Cyber Security Center (NCSB) Commercial Product Assurance (CPA) certification.  For more information about the Common Criteria Portal, visit: https://www.commoncriteriaportal.org/For more information on Check Point’s additional certification efforts and capabilities, visit:  https://www.checkpoint.com/about-us/product-certifications/. Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "No Immunity from Cyber Attacks, Shows Check Point Research's Cyber Security report",
        "subtitle": "",
        "date": "Jan 16, 2020 1:00AM EST",
        "content": "BANGKOK, Thailand, Jan.  16, 2020  (GLOBE NEWSWIRE) -- CPX – Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has published its 2020 Cyber Security Report. The Report highlights the main tactics cyber-criminals are using to attack organizations worldwide across all industries, and gives cyber security professionals and C-Level executives the information they need to protect their organizations from today’s fifth-generation cyber-attacks and threats.The 2020 Security Report reveals the key attack vectors and techniques observed by Check Point researchers during the past year. Highlights include:“2019 presented a complex threat landscape where nation states, cybercrime organizations and private contractors accelerated the cyber arms race, elevating each other’s capabilities at an alarming pace, and this will continue into 2020,”  said Lotem Finkelsteen: Major Intelligence Officer, Check Point Software Technologies. “Even if an organization is equipped with the most comprehensive, state-of-the-art security products, the risk of being breached cannot be completely eliminated. Beyond detection and remediation, organizations need to adopt a proactive plan to stay ahead of cybercriminals and prevent attacks. Detecting and automatically blocking the attack at an early stage can prevent damage. Check Point’s 2020 Security Report shares what organizations need to look out for, and how they can win the war against cyber attacks through key best practices.”Check Point’s 2020 Security Report is based on data from Check Point’s ThreatCloud intelligence, the largest collaborative network for fighting cybercrime which delivers threat data and attack trends from a global network of threat sensors; from Check Point’s research investigations over the last 12 months; and on a brand new survey of IT professionals and C-level executives that assesses their preparedness for today’s threats.  The report examines the latest emerging threats against various industry sectors, and gives a comprehensive overview of the trends observed in the malware landscape, in emerging data breach vectors, and in nation-state cyber-attacks.  It also includes expert analysis from Check Point’s thought leaders, to help organizations understand and prepare themselves for today’s and tomorrow’s complex threat landscape.For more details download the full report or read the blog.Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends enterprise’s cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.MEDIA CONTACT:     Jacinta Paul                                                                        Check Point Software Technologies                                press@us.checkpoint.com                                         INVESTOR CONTACT:Kip E. MeintzerCheck Point Software Technologies ir@us.checkpoint.com "
    },
    {
        "title": "Check Point Software Fast Tracks Network Security with New Security Gateways, Giving Ultra-scalable, Power Efficient Protection against Gen V Cyber Threats",
        "subtitle": "",
        "date": "Jan 15, 2020 1:00AM EST",
        "content": "BANGKOK, Thailand, Jan.  15, 2020  (GLOBE NEWSWIRE) -- CPX Bangkok -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has today announced Fast Track Network Security, a new suite of solutions which deliver unprecedented protection, scalability, and ease of deployment and control for enterprises, from branch offices to corporate data centers.According to the 2019 IBM Cost of a Data Breach study, the lifecycle of a malicious attack from breach to containment averages 314 days, and costs organizations $3.9M on average. Check Point Fast Track Network Security directly addresses the three main security challenges facing enterprises today: lacking a full set of security technologies to protect against advanced Gen V cyber-attacks; an inability to quickly scale up security according to business need; and complex, disjointed security management processes.“Security breaches continue to impact enterprises across the globe at an alarming rate. The cost of a breach continues to rise as attackers have become more efficient, causing more damage in less time. Businesses need agile cybersecurity solutions that actively prevent breaches before they can cause disruption,\" said John Grady, Senior Principal Analyst from the Enterprise Strategy Group (ESG). \"Check Point's continuing innovation around threat prevention and performance provides on-demand scalability, enabling enterprises to stay ahead of the attack landscape while meeting the changing needs of the business.\"The Fast Track Network Security suite features five new Check Point Quantum Security Gateways™ for branch office to mid-size enterprises, and one gateway designed for Maestro Hyperscale orchestrations for large enterprises and data centers.  All the gateways feature Check Point ThreatCloud and its award-winning SandBlast™ Zero-Day Protection. The new range starts with the 3600 gateway for branch offices, and extends to the 16000 Turbo Hyperscale gateway for enterprise data centers. All the Fast Track Network Security solutions include the latest release of Check Point’s R80 unified security software, R80.40 which has over 100 new features to extend protection, streamline processes and enhance productivity.“The principle behind Fast Track Network Security is simple. It enables enterprises to deploy the industry’s leading threat prevention capabilities at all points of their infrastructure, and to scale security almost infinitely according to their changing business needs.  It also dramatically accelerates the efficiency of their security operations,” said Itai Greenberg, VP Product Management and Product Marketing at Check Point. “This enables enterprises to prevent and block even the most advanced attacks, before they can disrupt business.”New higher-performance, power efficient gatewaysThe new Fast Track Network Security series of gateways all deliver over 2x the performance and half the energy consumption of rival high-end appliances. The range includes:All of the gateways deliver a 100% block score for malware prevention for email and web, exploit resistance and post-infection catch rate, as seen in the NSS Labs’ recent Breach Prevention Systems (BPS) Group Test.  They also feature lightning fast SSL-encrypted traffic inspection for maximum security and are Hyperscale-ready, capable of scaling up to 1.6 Tera-bps of Threat Prevention performance.  The appliances are also equipped with dual, enterprise grade SSD storage and deliver faster processing with optimal CPU utilization based on dynamic workloads technology.  R80.40 simplifies and automates securityR80 is the industry’s most advanced threat prevention and security management software for data centers, cloud, mobile, endpoint and IoT. The newest R80.40 software release has over 100 new features, including zero-touch deployment capability that enables new security appliances to be set up and running within five minutes, and support for Check Point IoT Security which automates policy enforcement for IoT devices.By consolidating all aspects of enterprise security environments seamlessly, R80 gives enterprises full visibility into security across their entire network fabric in a customizable visual dashboard, enabling them to manage the most complex environments easily and efficiently directly from their web browser.Fast Track Network Security’s combination of advanced new Quantum Security Gateways™, Maestro Hyperscale technology and the innovations of R80.40 software gives Check Point customers the quickest route to achieving Hyperscale network security with tera-bit levels of threat prevention performance, while accelerating and simplifying management processes.For product specifications or to learn more about functionality, please visit:https://www.checkpoint.com/products/next-generation-firewall/ https://www.checkpoint.com/products/cyber-security-management/Availability Check Point Fast Track Network Security will be available from our global network of partners.Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.MEDIA CONTACT:                                            Emilie Beneitez Lefebvre                             Check Point Software Technologiespress@checkpoint.comINVESTOR CONTACT:Kip E. MeintzerCheck Point Software Technologiesir@checkpoint.com                                 "
    },
    {
        "title": "December 2019’s Most Wanted Malware: Christmas and Greta Thunberg-themed Spam Used to Spread Emotet Malware",
        "subtitle": "",
        "date": "Jan 13, 2020 5:00AM EST",
        "content": "SAN CARLOS, Calif., Jan.  13, 2020  (GLOBE NEWSWIRE) -- Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has published its latest Global Threat Index for December 2019. The research team reported that Emotet was the leading malware threat for the third month running, and was being  spread using a range of spam email campaigns including ‘Support Greta Thunberg - Time Person of the Year 2019’ and ‘Christmas Party!’The emails in both campaigns contained a malicious Microsoft Word document which, if opened by the recipient, attempts to download Emotet onto their computer. Emotet is primarily used as a distributor of ransomware or other malicious campaigns.December also saw a significant increase in attempts to exploit the ‘Command Injection Over HTTP’ vulnerability, with 33% of organizations globally being targeted.  This vulnerability rose from being the 5th most exploited in November to the top position last month. If successfully exploited, the payload was a DDoS botnet:  the malicious file used in the attack also contained a number of links to payloads exploiting vulnerabilities in several IoT devices from manufacturers including D-Link, Huawei and RealTek, with the aim of recruiting these devices into botnets.“Over the past three months, the threats impacting most organizations have been versatile, multi-purpose malware like Emotet and xHelper. These give cyber-criminals multiple options for monetizing attacks, as they can be used for distributing ransomware or spreading further spam campaigns,” said Maya Horowitz, Director, Threat Intelligence & Research, Products at Check Point. “The aim for criminals is to get a foothold in as many organizations and devices as possible, so that subsequent attacks can be more lucrative and damaging.  So it’s critical that organizations educate their employees about the risks of opening email attachments, downloading resources or clicking on links that do not come from a trusted source or contact.”December 2019’s Top 3 ‘Most Wanted’ Malware:*The arrows relate to the change in rank compared to the previous month.Emotet impacted 13% of organizations globally in December, up from 9% in November. XMRig and Trickbot each impacted 7% of organizations.December’s Top 3 ‘Most Wanted’ Mobile Malware:xHelper and Guerrilla continue to hold the top two positions of the mobile malware index.December’s ‘Most Exploited’ vulnerabilities:The ‘Command Injection Over HTTP’ was the most common exploited vulnerability, impacting 33% of organizations globally. In 2nd place, the MVPower DVR Remote Code Execution vulnerability impacted 32% of organizations, and the Web Server Exposed Git Repository Information Disclosure impacted 29%.Check Point’s Global Threat Impact Index and its ThreatCloud Map is powered by Check Point’s ThreatCloud intelligence, the largest collaborative network to fight cybercrime which delivers threat data and attack trends from a global network of threat sensors. The ThreatCloud database holds over 250 million addresses analyzed for bot discovery, more than 11 million malware signatures and over 5.5 million infected websites, and identifies millions of malware types daily.The complete list of the top 10 malware families in December can be found on the Check Point Blog.Check Point’s Threat Prevention Resources are available at:  http://www.checkpoint.com/threat-prevention-resources/index.htmlFollow Check Point Research via:Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearch_About Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "Check Point Research Reveals Multiple Vulnerabilities in TikTok",
        "subtitle": "",
        "date": "Jan 8, 2020 1:52PM EST",
        "content": "SAN CARLOS, Calif., Jan.  08, 2020  (GLOBE NEWSWIRE) -- Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, revealed today that it uncovered multiple vulnerabilities in TikTok that could have allowed attacks to manipulate content on user accounts and even extract confidential personal information saved on these accounts.TikTok is used mainly by teenagers and kids that use this app to share, save and keep private (and sometimes very sensitive) videos of themselves and their loved ones. The research found that an attacker could send a spoofed SMS message to a user containing a malicious link. When the user clicked on the malicious link, the attacker was able to get a hold of the TikTok account and manipulate its content by deleting videos, uploading unauthorized videos, and making private or \"hidden\" videos public.The research also found that Tiktok's subdomain https://ads.tiktok.com was vulnerable to XSS attacks, a type of attack in which malicious scripts are injected into otherwise benign and trusted websites. Check Point researchers leveraged this vulnerability to retrieve personal information saved on user accounts including private email addresses and birthdates.Check Point Research informed TikTok developers of the vulnerabilities exposed in this research and a fix was responsibly deployed to ensure its users can safely continue using the TikTok app.“Data is pervasive but data breaches are becoming an epidemic, and our latest research shows that the most popular apps are still at risk,” said Oded Vanunu, Check Point’s Head of Product Vulnerability Research. “Social media applications are highly targeted for vulnerabilities as they provide a good source for private data and offer a good attack surface gate. Malicious actors are spending large amounts of money and putting in great effort to penetrate into such huge applications. Yet most users are under the assumption that they are protected by the app they are using.”Luke Deshotels, PhD, TikTok Security Team: “TikTok is committed to protecting user data. Like many organizations, we encourage responsible security researchers to privately disclose zero day vulnerabilities to us. Before public disclosure, CheckPoint agreed that all reported issues were patched in the latest version of our app. We hope that this successful resolution will encourage future collaboration with security researchers.\"Available in over 150 markets, used in 75 languages globally, and with over 1 billion users, TikTok is definitely one of the most downloaded apps around. As of October 2019, TikTok is the most downloaded app in the United States, making it the first Chinese app to have achieved such a record.More information on the research is available on the Check Point Research blog.Follow Check Point Research via:Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearch_About Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprise's cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.MEDIA CONTACT:                                                          Jacinta Paul                                                               Check Point Software Technologies                                       +65 9430 4020                                                            press@us.checkpoint.com                                              INVESTOR CONTACT:    Kip E. MeintzerCheck Point Software Technologies               +1 650.628.2040ir@us.checkpoint.com "
    },
    {
        "title": "Check Point Software to Announce 2019 Fourth Quarter and Full Year Financial Results on February 3, 2020",
        "subtitle": "",
        "date": "Jan 3, 2020 9:00AM EST",
        "content": "SAN CARLOS, Calif., Jan.  03, 2020  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, today announced that it will release its fourth quarter and full year financial results for the quarter and year ended December 31, 2019, on Monday, February 3, 2020, before the U.S. financial markets open. Management will host a conference call with the investment community at 8:30 AM EST/5:30 AM PST on February 3. A live webcast of the call will be hosted on the company’s website at http://www.checkpoint.com/ir.To follow this and other Check Point news visit:About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Its solutions protect customers from cyber-attacks with an industry leading catch rate of malware, ransomware and other types of attacks. Check Point offers a multilevel security architecture that defends enterprises’ cloud, network and mobile device held information, plus the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes. ©2020 Check Point Software Technologies Ltd. All rights reserved."
    },
    {
        "title": "Check Point Research Leads to WhatsApp Group Chat Crash Issue Fix",
        "subtitle": "",
        "date": "Dec 17, 2019 6:00AM EST",
        "content": "SAN CARLOS, Calif., Dec.  17, 2019  (GLOBE NEWSWIRE) -- Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, recently helped mitigate a new vulnerability in WhatsApp that could allow a bad actor to deliver a malicious group chat message that would crash the app for all members of the group. To regain use of WhatsApp, users would need to uninstall and reinstall it, then delete the group which contains the message.To create the malicious message that would impact a WhatsApp group, the bad actor would need to be a member of the target group (WhatsApp allows up to 256 users per group). From there, the bad actor would need to use WhatsApp Web and their web browser’s debugging tool to edit specific message parameters and send the edited text to the group. This edited message would cause a crash loop for group members, denying users access to all WhatsApp functions until they reinstall WhatsApp and delete the group with the malicious message.Oded Vanunu, Check Point’s Head of Product Vulnerability Research said: “Because WhatsApp is one of the world’s leading communication channels for consumers, businesses and government agencies, the ability to stop people using WhatsApp and delete valuable information from group chats is a powerful weapon for bad actors. All WhatsApp users should update to the latest version of the app to protect themselves against this possible attack.” Check Point Research responsibly disclosed its findings to the WhatsApp bug bounty program on August 28th, 2019. WhatsApp acknowledged the findings and developed a fix to resolve the issue, which is available since WhatsApp version number 2.19.58.  Users should manually apply on their devices. “WhatsApp responded quickly and responsibly to deploy the mitigation against exploitation of this vulnerability,” said Oded Vanunu.“WhatsApp greatly values the work of the technology community to help us maintain strong security for our users globally,” said WhatsApp Software Engineer Ehren Kret. “Thanks to the responsible submission from Check Point to our bug bounty program, we quickly resolved this issue for all WhatsApp apps in mid-September. We have also recently added new controls to prevent people from being added to unwanted groups to avoid communication with untrusted parties all together.”The Check Point Research team found the vulnerability by inspecting the communications between WhatsApp and WhatsApp Web, the web version of the app which mirrors all messages sent and received from the user’s phone. This enabled researchers to see the parameters used for WhatsApp communications and manipulate them. This new research builds on the 'FakesApp' flaws discovered by Check Point Research, which allowed group chat messages to be edited to spread fake news. WhatsApp has 1.5 billion users and more than a billion groups, making it the most popular instant messaging app worldwide. Over 65 billion messages are sent via WhatsApp per day.Watch the demo video of how the attack works, and read the full technical details in our research report here.Follow Check Point Research via: Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearchAbout Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Its solutions protect customers from cyber-attacks with an industry leading catch rate of malware, ransomware and other types of attacks. Check Point offers a multilevel security architecture that defends enterprises’ cloud, network and mobile device held information, plus the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes. "
    },
    {
        "title": "November 2019’s Most Wanted Malware: Researchers Warn of Fast-growing Mobile Threat While Emotet’s Impact Declines",
        "subtitle": "",
        "date": "Dec 11, 2019 9:00AM EST",
        "content": "SAN CARLOS, Calif., Dec.  11, 2019  (GLOBE NEWSWIRE) -- Check Point Research, the Threat Intelligence arm of Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has published its latest Global Threat Index for November 2019. The research team reported that for the first time in over three years, a mobile trojan has entered the overall top malware listing as well as being the most prevalent mobile threat over the past month.The mobile trojan is xHelper, which was first seen in the wild in March 2019. xHelper is a multi-purpose trojan targeting Android users that can download other malicious applications as well as display malicious advertisements.  It is also reported to be a persistent application, able to reinstall itself even if it is uninstalled by the victim. During the past six months the malware’s code has been constantly updated, helping it to evade mobile antivirus solutions and to keep on infecting new victims. As a result, it has entered the overall top 10 malware list at #8. November’s most wanted malware was the Emotet botnet, retaining the #1 position from October.  However, in November, it impacted 9% of organizations globally, down from 14% the previous month.“Both Emotet and xHelper are versatile, multi-purpose malware that can be adapted to criminals’ needs, such as distributing ransomware, spreading spam campaigns or distributing malvertising to users’ devices.  This shows that criminals are trying multiple different illicit tactics to monetize their operations, rather than following a single trend like cryptomining which dominated the sector in 2018,” said Maya Horowitz, Director, Threat Intelligence & Research, Products at Check Point. “As such, it’s essential that organizations deploy the latest generation anti-malware solutions on their networks as well as on employees’ mobile devices, to protect all enterprise endpoints. They should also educate employees about the dangers of opening email attachments, downloading resources or clicking on links that do not come from a trusted source or contact.”November 2019’s Top 3 ‘Most Wanted’ Malware:*The arrows relate to the change in rank compared to the previous month.Emotet has maintained its position at the top of the malware list with a global impact of 9%. XMRig was the second most popular malware impacting 7% of organizations worldwide, followed by Trickbot, impacting 6% of organizations globally.November’s Top 3 ‘Most Wanted’ Mobile Malware:This month xHelper - a new entry to our top malware list – was the most prevalent mobile malware, followed by Guerilla and Lotoor.November’s ‘Most Exploited’ vulnerabilities:This month the three top exploited remained the same as in the previous month – SQL injection techniques continue to lead the list, impacting 39% of organizations globally, followed by the OpenSSL TLS DTLS Heartbeat Information Disclosure vulnerability and MVPower DVR Remote Code Execution - impacting 34% and 33% of organizations worldwide respectively.Check Point’s Global Threat Impact Index and its ThreatCloud Map is powered by Check Point’s ThreatCloud intelligence, the largest collaborative network to fight cybercrime which delivers threat data and attack trends from a global network of threat sensors. The ThreatCloud database holds over 250 million addresses analyzed for bot discovery, more than 11 million malware signatures and over 5.5 million infected websites, and identifies millions of malware types daily.The complete list of the top 10 malware families in November can be found on the Check Point Blog.  Follow Check Point Research via:Blog: https://research.checkpoint.com/ Twitter: https://twitter.com/_cpresearch_About Check Point Research Check Point Research provides leading cyber threat intelligence to Check Point Software customers and the greater intelligence community. The research team collects and analyzes global cyber-attack data stored on ThreatCloud to keep hackers at bay, while ensuring all Check Point products are updated with the latest protections. The research team consists of over 100 analysts and researchers cooperating with other security vendors, law enforcement and various CERTs.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    },
    {
        "title": "Check Point Announces Fully-integrated Cloud Security for Kubernetes and Serverless Cloud Services",
        "subtitle": "",
        "date": "Dec 4, 2019 9:00AM EST",
        "content": "SAN CARLOS, Calif., Dec.  04, 2019  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, has extended the capabilities of its CloudGuard cloud security platform to support Kubernetes computing services, including Amazon Elastic Kubernetes Service (Amazon EKS) and Amazon Elastic Container Service (Amazon ECS). CloudGuard also delivers additional security capabilities for Amazon Web Services (AWS) Serverless computing solutions, including AWS Lambda and related services like AWS Fargate, Amazon API Gateway, Amazon DynamoDB, and Amazon Kinesis.With the recent acquisition of Protego – a company providing serverless security - Check Point further delivers on its vision of ensuring consistent and complete security for any enterprise workload in any cloud.In a 2019 survey, 87% of respondents were running container technologies, up from 55% in 2017. Serverless is the fastest-growing extended cloud service, with 50% growth over 2018. However, rapid adoption of these technologies can create challenges for organizations in getting visibility of, and enforcing consistent security and compliance across their cloud deployments. This increases the risk of misconfigurations and security holes which expose organizations to the risk of data breaches and cyber-attacks.With CloudGuard, customers can ensure that their Kubernetes configurations continuously comply with established container security baselines such as CIS Kubernetes Benchmarks or NIST 800-190. This new functionality complements CloudGuard’s existing ability to secure traffic between Kubernetes and on premise or cloud assets using IPsec VPN. CloudGuard’s new Serverless Code Scanning feature detects, alerts on and remediates security and compliance risks in a Serverless environment.  “No matter which cloud resources organizations choose, it’s critical that they have complete visibility and control over them to meet Cloud workload protection (CWPP) and Cloud Security Posture Management (CSPM) requirements,” said Zohar Alon, Head of Cloud Products at Check Point. “These enhancements to CloudGuard, including the recent acquisition of Protego, deliver powerful CSPM and CWPP capabilities across enterprises’ entire cloud deployments, continuously analyzing, detecting any misconfigurations or security issues, and remediating them. This ensures organizations can fully exploit the cloud’s agility without compromising their security posture.”Check Point is a Platinum Sponsor of AWS re:Invent 2019 in Las Vegas between December 2-6. For more information about this announcement, visit Check Point at booth #408.For more information on CloudGuard, visit: https://www.checkpoint.com/solutions/cloud-security.About Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally. Its solutions protect customers from cyber-attacks with an industry leading catch rate of malware, ransomware and other types of attacks. Check Point offers a multilevel security architecture that defends enterprises’ cloud, network and mobile device held information, plus the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes.Follow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologies"
    },
    {
        "title": "Check Point CloudGuard Log.ic Helps Improve Security Incident Response for Customers",
        "subtitle": "",
        "date": "Dec 3, 2019 3:00PM EST",
        "content": "LAS VEGAS, Dec.  03, 2019  (GLOBE NEWSWIRE) -- Check Point® Software Technologies Ltd. (NASDAQ: CHKP), a leading provider of cyber security solutions globally, announced the integration of CloudGuard Log.ic with Amazon Detective, a security service from Amazon Web Services (AWS) that is designed to easily analyze, investigate, and quickly identify the root cause of security findings or suspicious activities. CloudGuard Log.ic complements Amazon Detective by delivering cloud security intelligence, analytics, and simplified visualization of potential security incidents to customers.Today, security professionals struggle to establish context to a security incident in the cloud, especially when associated incident data is disparate and large-scale. According to a recent IBM Security Report, conducted by Ponemon Institute, the average time it takes to detect a cybersecurity incident in 2019 is 206 days, and an additional 73 days to contain a breach, if one occurs. Together, Amazon Detective and CloudGuard Log.ic are constructed to help improve incident response times by delivering meaningful context via a graphical representation of a customer’s security posture and cloud attack surface. As an example, a security professional can use Amazon Detective and CloudGuard Log.ic to visualize abnormal behavior by an adversary attempting to access sensitive data in the cloud.Through Check Point CloudGuard Log.ic’s automated machine learning capabilities and Amazon Detective’s threat hunting capabilities, customers can now gain important alerts on cloud traffic compliance issues and violations and scale investigations by providing context that helps enrich the incident response process. Amazon Detective and CloudGuard Log.ic are designed to enable customers to accelerate the detection of some of the most serious security issues in the cloud,” said Zohar Alon, Head of Cloud Product Line at Check Point Software Technologies. “The integration leverages machine learning to help incident responders bring quick and meaningful logic to a potential risk in their cloud environment.”“We’re delighted to be working with Check Point Cloud Guard Log.ic,” said Dan Plastina, Vice President, Security Services, Amazon Web Services, Inc. “With this integration, security professionals can further complement the management of their cloud security posture and gain insight into potential cybersecurity attacks in the cloud. Now, customers can gain a more complete view of the threat landscape, while drastically improving incident response times in the cloud.”Furthermore, the integration between CloudGuard IaaS and Amazon VPC Ingress Routing, which was announced at AWS re:Invent 2019 this week, helps improve customers’ flexibility to control traffic flow and inspection.For more information about CloudGuard Solutions, visit: https://www.checkpoint.com/solutions/cloud-security/For more information on Amazon Detective, visit: https://aws.amazon.com/detectiveFollow Check Point via:Twitter: http://www.twitter.com/checkpointswFacebook: https://www.facebook.com/checkpointsoftwareBlog: http://blog.checkpoint.com YouTube: http://www.youtube.com/user/CPGlobalLinkedIn: https://www.linkedin.com/company/check-point-software-technologiesAbout Check Point Software Technologies Ltd.Check Point Software Technologies Ltd. (www.checkpoint.com) is a leading provider of cyber security solutions to governments and corporate enterprises globally.  Check Point’s solutions protect customers from 5th generation cyber-attacks with an industry leading catch rate of malware, ransomware and advanced targeted threats. Check Point offers a multilevel security architecture, “Infinity Total Protection with Gen V advanced threat prevention”, this combined product architecture defends an enterprises’ cloud, network and mobile devices. Check Point provides the most comprehensive and intuitive one point of control security management system. Check Point protects over 100,000 organizations of all sizes."
    }
]