[
    {
        "title": "Charter Prices $2.5 Billion Senior Unsecured Notes",
        "subtitle": "",
        "date": "Mar 4, 2020 9:51PM EST",
        "content": "STAMFORD, Conn., March 4, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp. (collectively, the \"Issuers\"), have priced $2.5 billion in aggregate principal amount of notes consisting of the following securities: \n                        \n                    \n                Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including repaying certain indebtedness of the Issuers, including to potentially refinance the Issuers' existing 5.250% senior notes due 2022 and 5.125% senior notes due 2023, as well as to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC. Charter expects to close the offering of the Notes on March 18, 2020, subject to customary closing conditions.The Notes were sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. The offering is subject to, among other things, market conditions.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, the potential offering.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" and \"potential,\" among others. All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-prices-2-5-billion-senior-unsecured-notes-301016919.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Offers Senior Unsecured Notes",
        "subtitle": "",
        "date": "Mar 4, 2020 8:54AM EST",
        "content": "STAMFORD, Conn., March 4, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp. (collectively, \"CCO Holdings\"), intend to offer senior unsecured notes due 2030 (the \"Notes\"). The Notes will form a part of the same series of 4.500% Senior Unsecured Notes issued on February 18, 2020 in the aggregate principal amount of $1.65 billion.\n                        \n                    \n                Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including repaying certain indebtedness at CCO Holdings as well as to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC.The Notes will be sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. The offering is subject to, among other things, market conditions.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful. About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, the potential offering.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" and \"potential,\" among others. All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-offers-senior-unsecured-notes-301016372.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Makes $10 Million Commitment And Launches Spectrum Community Investment Loan Fund",
        "subtitle": "",
        "date": "Feb 27, 2020 9:00AM EST",
        "content": "STAMFORD, Conn., Feb. 27, 2020 /PRNewswire/ -- Charter Communications, Inc. today announced the creation of the Spectrum Community Investment Loan Fund. The Loan Fund focuses on making loans through community development financial institutions (CDFIs) to small businesses whose goods and services help meet core needs in underserved communities within Charter's 41-state operating footprint.The Loan Fund will invest $10 million in capital by the end of 2021, making loans up to $1 million to each CDFI. In addition, Charter will provide each CDFI with a separate additional grant, which will provide these small businesses with additional training and technical expertise to assist in establishing sound business practices necessary for long-term growth and continuity.  \"Charter is committed to having a meaningful impact in the communities where our customers and employees live and work, and the Loan Fund is the latest Spectrum Community Impact program designed to do just that,\" said Tom Rutledge, Chairman and CEO of Charter Communications. \"Through these investments in local small businesses, Charter will positively impact financially underserved communities by providing growth capital, creating new jobs and strengthening businesses.\" During the first half of 2020, the Spectrum Community Investment Loan Fund will invest $1 million in Pursuit Community Finance (formerly known as the Excelsior Growth Fund) in New York, and $1 million in PeopleFund, a CDFI based in Texas. The Loan Fund also expects to invest $1 million in an Ohio-based CDFI later this year. By the end of the first quarter in 2021, the Loan Fund program plans to invest an additional $4 million, collectively, in selected CDFIs in California, Florida, North Carolina and Wisconsin. The initial $7 million investments will be in states comprising 70% of Charter's more than 29 million customers.\"Pursuit welcomes the Charter investment, which will help catalyze responsible lending to neighborhood small businesses in communities throughout New York State,\" said Steve Cohen, president of Pursuit Community Finance.  \"It is noteworthy to have a public company express a commitment to community lending alongside our more typical bank investors.\"Charter's $10 million commitment will have an amplified economic impact, serving as the anchor investment for the small business community programs into which each CDFI will direct additional third-party capital commitments. Charter's $3 million phase one investment in New York, Texas and Ohio is expected to be combined with more than $12 million in total capital from other sources and lead to the creation of hundreds of new jobs in underserved communities throughout those states.\"It is a true honor for PeopleFund being selected by Charter to be part of this initiative and we applaud their commitment in support of CDFIs to help our most vulnerable communities,\" said Gustavo Lasala, president and CEO of PeopleFund. \"Each dollar that Charter invests in a CDFI has a multiplier effect. We will leverage each dollar from Charter with four dollars from other sources for a grand total of $5 million to be invested in small businesses throughout Texas. This will have an enormous positive economic impact in the communities where these businesses operate by creating hundreds of jobs and helping hundreds of families achieve financial stability and independence.\"Charter has engaged Cabrera Capital Markets, a diverse-owned investment bank based in Chicago, to spearhead the due diligence process on the Loan Fund's first three CDFI investments. Cabrera Capital Markets has partnered with the Local Initiatives Support Corporation (also known as LISC), one of the nation's largest CDFIs, to supplement its CDFI underwriting capabilities. Charter has selected Siebert Williams Shank & Co. and CastleOak Securities, L.P., two other diverse-owned investment banks, to provide due diligence support and related advisory services on its future CDFI investments. About CharterCharter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at http://corporate.charter.com.About PursuitAt Pursuit, our mission is simple: to provide businesses with affordable loans and resources so that they can reach higher, transform and grow. Pursuit is a community-focused lender where businesses can access more than 15 loan programs that provide financing from $10,000 to $5.5 million with affordable rates and terms. Last year alone, Pursuit provided more than $234 million in funding through 488 business loans, creating more than 2,900 jobs. Pursuit is a nationally recognized organization that focuses on serving businesses and lending partners in New Jersey, New York, and Pennsylvania. Pursuit Community Finance is the non-profit, CDFI affiliate of Pursuit. Learn more at www.pursuitlending.com.About PeopleFundPeopleFund is a registered 501(c)3 nonprofit organization established in 1994. It is a U.S. Treasury certified Community Development Financial Institution (CDFI) and SBA certified lender. PeopleFund provides business loans up to $350,000 to Texas businesses that do not qualify for bank loans. It also provides client business assistance and education. 97% of loans are to target market of minority, women, and veteran business owners and those residing in low to moderate income census tracts. 59% of current loans are to startups and non-profit organizations. It also makes SBA 504 loans up to $5 million and closes multiple high impact new market tax credit transactions. Through access to capital and educational opportunities, PeopleFund creates economic opportunity and financial stability for underserved people to build healthy small businesses. PeopleFund inspires, educates, funds, and elevates entrepreneurs on the path to prosperity and the American dream. www.peoplefund.org. View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-makes-10-million-commitment-and-launches-spectrum-community-investment-loan-fund-301012243.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter to Participate in Morgan Stanley Technology, Media & Telecom Conference",
        "subtitle": "",
        "date": "Feb 25, 2020 4:30PM EST",
        "content": "STAMFORD, Conn., Feb. 25, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that Christopher Winfrey, Chief Financial Officer, will participate in the Morgan Stanley Technology, Media & Telecom Conference in San Francisco, California on Tuesday, March 3, 2020. Mr. Winfrey's remarks are scheduled to begin at 11:00 a.m. PT (2:00 p.m. ET).A live webcast of the event can be accessed on Charter's investor relations website, ir.charter.com. Following the live broadcast, the webcast will be archived at ir.charter.com.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-to-participate-in-morgan-stanley-technology-media--telecom-conference-301011151.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Closes $1.65 Billion Senior Unsecured Notes",
        "subtitle": "",
        "date": "Feb 18, 2020 4:10PM EST",
        "content": "STAMFORD, Conn., Feb. 18, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp., have closed on $1.65 billion in aggregate principal amount of senior unsecured notes due 2030 (the \"Notes\"). The Notes bear interest at a rate of 4.500% per annum and were issued at a price of 100.000% of the aggregate principal amount.The Notes were sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-closes-1-65-billion-senior-unsecured-notes-301006816.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Advance/Newhouse Notifies Charter of Intent to Establish Credit Facility Collateralized by Stake in Charter Communications Holdings, LLC",
        "subtitle": "",
        "date": "Feb 5, 2020 7:40AM EST",
        "content": "STAMFORD, Conn., Feb. 5, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that Advance/Newhouse Partnership (\"A/N\") has notified Charter that A/N intends to establish a credit facility collateralized by a portion of A/N's Common Units in Charter Communications Holdings, LLC. A/N has also indicated to Charter that A/N remains committed to being a long-term shareholder of Charter and currently has no intent to sell any units/shares other than through its continued pro-rata participation in Charter's buyback program.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, our plans, strategies and prospects, both business and financial.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" \"estimated,\" \"aim,\" \"on track,\" \"target,\" \"opportunity,\" \"tentative,\" \"positioning,\" \"designed,\" \"create,\" \"predict,\" \"project,\" \"initiatives,\" \"seek,\" \"would,\" \"could,\" \"continue,\" \"ongoing,\" \"upside,\" \"increases,\" \"focused on\" and \"potential,\" among others.  All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication. View original content to download multimedia:http://www.prnewswire.com/news-releases/advancenewhouse-notifies-charter-of-intent-to-establish-credit-facility-collateralized-by-stake-in-charter-communications-holdings-llc-300999441.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Prices $1.65 Billion Senior Unsecured Notes",
        "subtitle": "",
        "date": "Feb 3, 2020 8:55PM EST",
        "content": "STAMFORD, Conn., Feb. 3, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp. (collectively, the \"Issuers\"), have priced $1.65 billion in aggregate principal amount of senior unsecured notes due 2030 (the \"Notes\"). The Notes will bear interest at a rate of 4.500% per annum and will be issued at a price of 100.000% of the aggregate principal amount.Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including repaying certain indebtedness of the Issuers as well as to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC. Charter expects to close the offering of the Notes on February 18, 2020, subject to customary closing conditions.The Notes were sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. The offering is subject to, among other things, market conditions.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, the potential offering.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" and \"potential,\" among others. All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication. View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-prices-1-65-billion-senior-unsecured-notes-300998108.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Offers Senior Unsecured Notes",
        "subtitle": "",
        "date": "Feb 3, 2020 8:49AM EST",
        "content": "STAMFORD, Conn., Feb. 3, 2020 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp. (collectively, \"CCO Holdings\"), intend to offer senior unsecured notes due 2030 (the \"Notes\"). Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including repaying certain indebtedness at CCO Holdings as well as to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC.The Notes will be sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. The offering is subject to, among other things, market conditions.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful. About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, the potential offering.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" and \"potential,\" among others. All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-offers-senior-unsecured-notes-300997622.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Announces Fourth Quarter 2019 Results",
        "subtitle": "",
        "date": "Jan 31, 2020 7:00AM EST",
        "content": "STAMFORD, Conn., Jan. 31, 2020 /PRNewswire/ -- Charter Communications, Inc. (along with its subsidiaries, the \"Company\" or \"Charter\") today reported financial and operating results for the three and twelve months ended December 31, 2019.Key highlights:\"Our operating strategy continues to deliver strong results and in 2019, we created over 1.1 million new customer relationships, substantially more than in 2018. And we added over 1.4 million new Internet customers, also more than in 2018,\" said Tom Rutledge, Chairman and CEO of Charter Communications. \"As we look to 2020, we remain focused on driving customer growth by offering superior services and value to our customers, improving the efficiency of our operations, and delivering sustainable free cash flow growth, by driving EBITDA growth, while reducing capital intensity.\"1.  Adjusted EBITDA, cable Adjusted EBITDA, free cash flow and cable free cash flow are non-GAAP measures defined in the \"Use of Adjusted EBITDA and Free Cash Flow Information\" section and are reconciled to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, in the addendum of this news release.Key Operating ResultsDuring the fourth quarter of 2019, Charter's residential customer relationships grew by 240,000, while fourth quarter 2018 residential customer relationships grew by 207,000. As of December 31, 2019, Charter had 27.3 million residential customer relationships, with year-over-year growth of 1.0 million, or 3.8%.Charter added 313,000 residential Internet customers in the fourth quarter of 2019, versus fourth quarter 2018 residential Internet customer net additions of 289,000. As of December 31, 2019, Charter had 24.9 million residential Internet customers, with 85% subscribing to tiers that provided 100 Mbps or more of speed. Over the course of 2019, Charter doubled minimum Internet speeds in a number of markets at no additional cost to new and existing Spectrum Internet® customers. Currently, 200 Mbps is the slowest speed offered to new Internet customers in approximately 60% of Charter's footprint, with 100 Mbps the slowest speed offered in the remaining 40% of its footprint.Residential video customers decreased by 105,000 in the fourth quarter of 2019, while fourth quarter 2018 residential video customers decreased by 36,000. As of December 31, 2019, Charter had 15.6 million residential video customers.During the fourth quarter of 2019, residential wireline voice customers declined by 152,000, while fourth quarter 2018 voice customers declined by 83,000. As of December 31, 2019, Charter had 9.4 million residential wireline voice customers.Fourth quarter 2019 residential revenue per residential customer (excluding mobile) totaled $113.79, and grew by 1.8% compared to the prior year period, given promotional rate step-ups, rate adjustments and a lower rate of customers migrating to Spectrum pricing and packaging, partly offset by a higher percentage of non-video customers, a higher mix of streaming and lighter video packages within Charter's video customer base and lower pay-per-view and video on demand revenue.During the fourth quarter of 2019, Charter added 288,000 mobile lines, and as of December 31, 2019, Charter served a total of 1.1 million mobile lines. Spectrum Mobile is available to all new and existing Spectrum Internet customers and runs on America's most awarded LTE network combined with Spectrum WiFi. Spectrum Mobile customers can choose one of two simple ways to pay for data, \"Unlimited\" for $45 a month (per line), or \"By the Gig\" at $14/GB, in both cases including applicable fees and taxes.SMB customer relationships grew by 28,000 during the fourth quarter of 2019, compared to growth of 41,000 during the fourth quarter of 2018. As of December 31, 2019, Charter had 2.0 million SMB customer relationships, with year-over-year growth of 6.8%. Enterprise PSUs grew by 3,000 during the fourth quarter of 2019 compared to growth of 5,000 during the fourth quarter of 2018. As of December 31, 2019, Charter had 267,000 enterprise PSUs, with growth of 7.6% year-over-year.Fourth Quarter Financial ResultsRevenuesFourth quarter revenue increased by 4.7% year-over-year to $11.8 billion, driven by growth in Internet, mobile, video and SMB revenue. Excluding mobile revenue and advertising revenue, which benefited from political spend in the fourth quarter of 2018, revenue grew by 4.8% year-over-year.Video revenue totaled $4.5 billion in the fourth quarter, an increase of 2.6% compared to the prior year period. Video revenue growth was driven by rate adjustments and promotional rolloff, partly offset by a decline in video customers during the last year, a higher mix of streaming and lighter video packages within Charter's video customer base and lower pay-per-view and video on demand revenue.Internet revenue grew by 11.5%, compared to the year-ago quarter, to $4.3 billion, driven by growth in Internet customers during the last year, promotional rolloff and rate adjustments.Voice revenue totaled $450 million in the fourth quarter, a decrease of 12.5% compared to the fourth quarter of 2018, driven by a decline in wireline voice customers over the last twelve months and value-based pricing.Commercial revenue increased to $1.6 billion, an increase of 1.8% over the prior year period, driven by SMB revenue growth of 6.3%, partly offset by a decline in enterprise revenue of 4.5%. Fourth quarter commercial revenue was impacted by Charter's sale of Navisite, its managed cloud services business within Spectrum Enterprise, in the third quarter of 2019. Excluding Navisite revenue from the fourth quarter of 2018, commercial and enterprise revenue grew by 4.3% and 1.3% over the prior year period, respectively.Fourth quarter advertising sales revenue of $434 million declined by 22.7% compared to the year-ago quarter, driven by lower political revenue. Excluding political revenue in both periods, advertising sales revenue grew by 4.6% year-over-year.Fourth quarter mobile revenue totaled $236 million, an increase of $147 million year-over-year.Other revenue totaled $220 million in the fourth quarter, a decrease of 6.6% year-over-year, driven by lower processing fees and home shopping revenue, partly offset by video customer premise equipment (\"CPE\") sold to customers.Operating Costs and ExpensesFourth quarter total operating costs and expenses increased by $165 million, or 2.3% year-over-year, but were in-line with the prior year quarter when excluding fourth quarter mobile costs.Fourth quarter programming costs increased by $17 million, or 0.6% as compared to the fourth quarter of 2018, reflecting contractual programming increases and renewals, partly offset by lower video customers, a higher mix of streaming and lighter video packages within Charter's video customer base and lower pay-per-view expenses.Regulatory, connectivity and produced content expenses increased by $25 million, or 4.3% year-over-year, primarily driven by video CPE sold to customers and original programming costs.Costs to service customers decreased by $41 million, or 2.3% year-over-year, despite year-over-year residential and SMB customer growth of 4.0%. The year-over-year decrease in costs to service customers was primarily driven by lower service transactions per customer and lower churn.Marketing expenses increased by $16 million, or 2.1% year-over-year.Other expenses decreased by $13 million, or 1.4% as compared to the fourth quarter of 2018 primarily driven by lower advertising sales costs and the sale of Navisite.Fourth quarter mobile costs totaled $372 million, an increase of $161 million year-over-year, and were comprised of device costs, customer acquisition costs, and service and operating costs.Adjusted EBITDAFourth quarter Adjusted EBITDA of $4.5 billion grew by 8.8% year-over-year, reflecting growth in revenue and operating expenses of 4.7% and 2.3%, respectively. Fourth quarter cable Adjusted EBITDA grew by 8.9% year-over-year reflecting cable revenue growth of 3.4% and cable operating expenses that were in-line with the prior year.Net Income Attributable to Charter ShareholdersNet income attributable to Charter shareholders totaled $714 million in the fourth quarter of 2019, compared to $296 million in the fourth quarter of 2018. The year-over-year increase in net income attributable to Charter shareholders was primarily driven by higher Adjusted EBITDA, a non-cash loss on financial instruments in the prior year period versus a gain in the current year period and lower other operating expenses, net.Net income per basic common share attributable to Charter shareholders totaled $3.36 in the fourth quarter of 2019 compared to $1.31 during the same period last year. The increase was primarily the result of the factors described above in addition to a 6.3% decrease in weighted average common shares outstanding versus the prior year period.Capital ExpendituresProperty, plant and equipment expenditures totaled $2.3 billion in the fourth quarter of 2019, compared to $2.4 billion during the fourth quarter of 2018, primarily driven by declines in CPE and scalable infrastructure spending. The decrease in CPE spending was primarily driven by a higher mix of boxless video outlets, lower video gross additions, a decline in the pace of migration of Legacy TWC and Legacy Bright House customers to Spectrum pricing and packaging, increasing customer self-installations and the completion of Charter's all-digital initiative in 2018. The year-over-year decrease in scalable infrastructure spending was primarily driven by the completion of the rollout of DOCSIS 3.1 technology in 2018 and the associated bandwidth benefit in 2019. Fourth quarter capital expenditures included $151 million of mobile costs, most of which were included in support capital.Cash Flow and Free Cash FlowDuring the fourth quarter of 2019, net cash flows from operating activities totaled $3.4 billion, compared to $3.2 billion in the prior year quarter. The year-over-year increase in net cash flows from operating activities was primarily due to higher Adjusted EBITDA.Consolidated free cash flow for the fourth quarter of 2019 totaled $1.6 billion, compared to $885 million during the same period last year. Cable free cash flow for the fourth quarter of 2019 totaled $1.9 billion, compared to $1.2 billion during the same period last year. The year-over-year increases in consolidated free cash flow and cable free cash flow were driven by an increase in accrued expenses related to capital expenditures, a decline in capital expenditures and an increase in net cash flows from operating activities.Liquidity & FinancingAs of December 31, 2019, total principal amount of debt was $78.4 billion and Charter's credit facilities provided approximately $4.7 billion of additional liquidity in excess of Charter's $3.5 billion cash position.In October 2019, CCO Holdings, LLC (\"CCO Holdings\") and CCO Holdings Capital Corp. issued $1.35 billion of 4.750% senior unsecured notes due 2030. The net proceeds were used to finance a tender offer and subsequent call of $500 million aggregate principal amount of CCO Holdings' outstanding 5.250% senior notes due 2021 and $850 million aggregate principal amount of CCO Holdings' outstanding 5.750% senior notes due 2024. An additional $500 million and $1.2 billion of the same 4.750% senior unsecured notes due 2030 were issued in late October and December, respectively. The proceeds were or will be used for general corporate purposes, including to fund buybacks of Charter Class A common stock and/or Charter Holdings common units and to repay certain indebtedness.In October 2019, Charter Communications Operating, LLC (\"Charter Operating\") and Charter Communications Operating Capital Corp. issued $1.5 billion of 4.800% senior secured notes due 2050. In December, an additional $1.3 billion of the same 4.800% senior secured notes due 2050 were issued. The proceeds were or will be used for general corporate purposes, including to fund buybacks of Charter Class A common stock and/or Charter Holdings common units and to repay certain indebtedness.In October 2019, Charter Operating repriced $4.5 billion of revolver and $4.0 billion of term loan A to LIBOR plus 125 basis points (from 150 basis points) and its existing term loan B to LIBOR plus 175 basis points (from 200 basis points). In addition, $4.5 billion of the revolver and $4.0 billion of term loan A maturities were extended to 2025 (from 2023 and 2024) and $3.8 billion of term loan B maturities were extended to 2027 (from 2025).Share RepurchasesDuring the three months ended December 31, 2019, Charter purchased approximately 5.6 million shares of Charter Class A common stock and Charter Holdings common units for approximately $2.6 billion.Year to Date Financial ResultsRevenueFor the year ended December 31, 2019, revenues increased to $45.8 billion, 4.9% higher than in 2018 driven by growth in Internet, mobile, video and commercial revenue. Excluding mobile revenue and advertising revenue, which benefited from political spend in 2018, revenue grew by 4.1% year-over-year.Operating Costs and ExpensesOperating costs and expenses totaled $28.9 billion in 2019, an increase of $1.3 billion, or 4.8% compared to the year ended December 31, 2018, primarily driven by increases in mobile, programming, other expenses and regulatory, connectivity and produced content expenses, and grew by 1.6% year-over-year when excluding mobile costs.Adjusted EBITDAAdjusted EBITDA totaled $16.9 billion for the year ended December 31, 2019, an increase of 5.0% compared to 2018, reflecting growth in revenue and operating expenses of 4.9% and 4.8%, respectively. For the year ended December 31, 2019, cable Adjusted EBITDA grew by 6.6% year-over-year reflecting growth in cable revenue and cable operating expenses of 3.5% and 1.6%, respectively.Net Income Attributable to Charter ShareholdersNet income attributable to Charter shareholders totaled $1.7 billion for the year ended December 31, 2019, compared to $1.2 billion in 2018. The year-over-year increase in net income was primarily driven by   higher Adjusted EBITDA and lower depreciation and amortization expense, partly offset by higher pension costs, income tax expense and interest expense.Net income per basic common share attributable to Charter shareholders totaled $7.60 for the year ended December 31, 2019, compared to $5.29 during the same period last year. The increase was primarily the result of the factors described above in addition to a 5.5% decrease in weighted average common shares outstanding versus the prior year period.Capital ExpendituresCapital expenditures totaled $7.2 billion for the year ended December 31, 2019, compared to $9.1 billion in 2018. The decrease was primarily driven by declines in CPE and scalable infrastructure spending. For the full year 2019, mobile capital expenditures totaled $432 million versus $242 million for the full year 2018.Charter currently expects 2020 cable capital expenditures to decline as a percentage of cable revenue versus 2019.Cash Flow & Free Cash FlowFor the year ended December 31, 2019, net cash flows from operating activities totaled $11.7 billion, in-line with the prior year. Net cash flows from operating activities were positively impacted by higher Adjusted EBITDA in 2019 versus 2018, offset by a higher unfavorable change in working capital.Free cash flow for the year ended December 31, 2019 was $4.6 billion, compared to $2.2 billion during the same period last year primarily driven by lower capital expenditures. Cable free cash flow for the year ended December 31, 2019 totaled $5.8 billion, compared to $2.8 billion in 2018.Share RepurchasesFor the year ended December 31, 2019, Charter purchased approximately 19.0 million shares of Charter Class A common stock and Charter Holdings common units for approximately $7.6 billion.Conference CallCharter will host a conference call on Friday, January 31, 2020 at 8:30 a.m. Eastern Time (ET) related to the contents of this release.The conference call will be webcast live via the Company's investor relations website at ir.charter.com. The call will be archived under the \"Financial Information\" section two hours after completion of the call. Participants should go to the webcast link no later than 10 minutes prior to the start time to register.Those participating via telephone should dial 866-919-0894 no later than 10 minutes prior to the call. International participants should dial 706-679-9379. The conference ID code for the call is 9162126.A replay of the call will be available at 855-859-2056 or 404-537-3406 beginning two hours after the completion of the call through the end of business on February 14, 2020. The conference ID code for the replay is 9162126.Additional Information Available on WebsiteThe information in this press release should be read in conjunction with the financial statements and footnotes contained in the Company's Annual Report on Form 10-K for the year ended December 31, 2019, which will be posted on the \"Financial Information\" section of our investor relations website at ir.charter.com, when it is filed with the Securities and Exchange Commission (the \"SEC\"). A slide presentation to accompany the conference call and a trending schedule containing historical customer and financial data will also be available in the \"Financial Information\" section.Use of Adjusted EBITDA and Free Cash Flow InformationThe company uses certain measures that are not defined by U.S. generally accepted accounting principles (\"GAAP\") to evaluate various aspects of its business. Adjusted EBITDA and free cash flow are non-GAAP financial measures and should be considered in addition to, not as a substitute for, net income attributable to Charter shareholders and net cash flows from operating activities reported in accordance with GAAP. These terms, as defined by Charter, may not be comparable to similarly titled measures used by other companies. Adjusted EBITDA and free cash flow are reconciled to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, in the Addendum to this release.Adjusted EBITDA is defined as net income attributable to Charter shareholders plus net income attributable to noncontrolling interest, net interest expense, income taxes, depreciation and amortization, stock compensation expense, loss on extinguishment of debt, (gain) loss on financial instruments, net, other pension (benefits) costs, net, other (income) expense, net and other operating (income) expenses, such as special charges and (gain) loss on sale or retirement of assets. As such, it eliminates the significant non-cash depreciation and amortization expense that results from the capital-intensive nature of the Company's businesses as well as other non-cash or special items, and is unaffected by the Company's capital structure or investment activities. However, this measure is limited in that it does not reflect the periodic costs of certain capitalized tangible and intangible assets used in generating revenues and the cash cost of financing. These costs are evaluated through other financial measures.Free cash flow is defined as net cash flows from operating activities, less capital expenditures and changes in accrued expenses related to capital expenditures.Management and Charter's board of directors use Adjusted EBITDA and free cash flow to assess Charter's performance and its ability to service its debt, fund operations and make additional investments with internally generated funds. In addition, Adjusted EBITDA generally correlates to the leverage ratio calculation under the Company's credit facilities or outstanding notes to determine compliance with the covenants contained in the facilities and notes (all such documents have been previously filed with the the SEC). For the purpose of calculating compliance with leverage covenants, the Company uses Adjusted EBITDA, as presented, excluding certain expenses paid by its operating subsidiaries to other Charter entities. The Company's debt covenants refer to these expenses as management fees, which were $301 million and $274 million for the three months ended December 31, 2019 and 2018, respectively, and were $1.2 billion and $1.1 billion for the years ended December 31, 2019 and 2018, respectively.Cable Adjusted EBITDA is defined as Adjusted EBITDA less mobile revenues plus mobile operating costs and expenses. Cable free cash flow is defined as free cash flow plus mobile net cash outflows from operating activities and mobile capital expenditures. Management and Charter's board of directors use cable Adjusted EBITDA and cable free cash flow to provide management and investors a more meaningful year-over-year perspective on the financial and operational performance and trends of our core cable business without the impact of the revenue, costs and capital expenditures in the initial funding period to grow a new product line as well as the negative working capital impacts from the timing of device-related cash flows when we provide the handset or tablet to customers pursuant to equipment installment plans.About CharterCharter Communications, Inc. (NASDAQ: CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, our plans, strategies and prospects, both business and financial.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" \"estimated,\" \"aim,\" \"on track,\" \"target,\" \"opportunity,\" \"tentative,\" \"positioning,\" \"designed,\" \"create,\" \"predict,\" \"project,\" \"initiatives,\" \"seek,\" \"would,\" \"could,\" \"continue,\" \"ongoing,\" \"upside,\" \"increases,\" \"focused on\"  and \"potential,\" among others.  Important factors that could cause actual results to differ materially from the forward-looking statements we make in this communication are set forth in our annual report on Form 10-K, and in other reports or documents that we file from time to time with the SEC, and include, but are not limited to:All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.       View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-announces-fourth-quarter-2019-results-300996701.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "Charter Closes $1.2 Billion Senior Unsecured Notes",
        "subtitle": "",
        "date": "Dec 16, 2019 4:01PM EST",
        "content": "STAMFORD, Conn., Dec. 16, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp. (collectively, the \"Issuers\"), have closed on $1.2 billion in aggregate principal amount of senior unsecured notes due 2030 (the \"Notes\"). The Notes form a part of the same series as the Issuers' senior unsecured notes due 2030 issued on October 1, 2019 and on October 24, 2019, which bear interest at a rate of 4.750% per annum, and were issued at a price of 101.125% of the aggregate principal amount.The Notes were sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-closes-1-2-billion-senior-unsecured-notes-300974088.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Closes $1.3 Billion Senior Secured Notes",
        "subtitle": "",
        "date": "Dec 16, 2019 4:01PM EST",
        "content": "STAMFORD, Conn., Dec. 16, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, Charter Communications Operating, LLC and Charter Communications Operating Capital Corp. (collectively, the \"Issuers\"), have closed on $1.3 billion in aggregate principal amount of senior secured notes due 2050 (the \"Notes\"). The Notes form a part of the same series as the Issuers' senior secured notes due 2050 issued on October 24, 2019, which bear interest at a rate of 4.800% per annum, and were issued at a price of 101.964% of the aggregate principal amount.The Notes were issued pursuant to an effective automatic shelf registration statement on Form S-3 filed with the Securities and Exchange Commission (\"SEC\").The joint book-running managers for the senior secured notes offering were Deutsche Bank Securities Inc., Mizuho Securities USA LLC and Morgan Stanley & Co. LLC. The offering was made only by means of a prospectus supplement dated December 2, 2019 and the accompanying base prospectus, copies of which can be made available by contacting Deutsche Bank Securities Inc., Attention: Prospectus Group, 60 Wall Street, New York, NY 10005; Telephone: (800) 503-4611; E-mail: prospectus.CPDG@db.com, or by contacting Mizuho Securities USA LLC, Attention: Debt Capital Markets, 320 Park Avenue, 12th Floor, New York, NY 10022, Telephone: (866) 271-7403, or by contacting Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; Telephone: (866) 718-1649; E-mail: prospectus@morganstanley.com. Electronic copies of the prospectus supplement and the accompanying base prospectus are also available on the SEC's website at www.sec.gov. This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ: CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-closes-1-3-billion-senior-secured-notes-300974090.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter to Hold Conference Call to Discuss Fourth Quarter and Full Year 2019 Financial and Operating Results",
        "subtitle": "",
        "date": "Dec 6, 2019 4:01PM EST",
        "content": "STAMFORD, Conn., Dec. 6, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (the \"Company\" or \"Charter\") will host a conference call on Friday, January 31, 2020 at 8:30 a.m. Eastern Time (ET) to discuss financial and operating results for the quarter and year ended December 31, 2019. A press release reporting such results will be issued at 7:00 a.m. ET that day.The conference call will be webcast live via the Company's investor relations website at ir.charter.com. Participants should go to the call link at least 10 minutes prior to the call start time in order to register.Those participating via telephone should dial 866-919-0894 no later than 10 minutes prior to the call. International participants should dial 706-679-9379. The passcode for the call is 9162126.The call will be archived at ir.charter.com approximately two hours after completion of the call. A replay of the call will be available at 855-859-2056 or 404-537-3406 beginning two hours after completion of the call through February 14, 2020. The passcode for the replay is 9162126.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-to-hold-conference-call-to-discuss-fourth-quarter-and-full-year-2019-financial-and-operating-results-300970259.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Prices $1.2 Billion Senior Unsecured Notes",
        "subtitle": "",
        "date": "Dec 2, 2019 8:42PM EST",
        "content": "STAMFORD, Conn., Dec. 2, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp. (collectively, the \"Issuers\"), have priced $1.2 billion in aggregate principal amount of senior unsecured notes due 2030 (the \"Notes\"). The Notes will form a part of the same series as the Issuers' senior unsecured notes due 2030 issued on October 1, 2019 and on October 24, 2019, which bear interest at a rate of 4.750% per annum. The Notes will be issued at a price of 101.125% of the aggregate principal amount.Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC, as well as repaying certain indebtedness, which may include all or a portion of the 3.579% senior secured notes due 2020 issued by Charter Communications Operating, LLC and Charter Communications Operating Capital Corp. Charter expects to close the offering of the Notes on December 16, 2019, subject to customary closing conditions.The Notes were sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, the potential offering.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" and \"potential,\" among others. All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-prices-1-2-billion-senior-unsecured-notes-300967817.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Prices $1.3 Billion Senior Secured Notes",
        "subtitle": "",
        "date": "Dec 2, 2019 8:40PM EST",
        "content": "STAMFORD, Conn., Dec. 2, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, Charter Communications Operating, LLC and Charter Communications Operating Capital Corp. (collectively, the \"Issuers\"), have priced $1.3 billion in aggregate principal amount of senior secured notes due 2050 (the \"Notes\"). The Notes will form a part of the same series as the Issuers' senior secured notes due 2050 issued on October 24, 2019, which bear interest at a rate of 4.800% per annum. The Notes will be issued at a price of 101.964% of the aggregate principal amount.Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC, as well as repaying certain indebtedness, which may include all or a portion of the Issuers' 3.579% senior secured notes due 2020. Charter expects to close the offering of the Notes on December 16, 2019, subject to customary closing conditions.The offering and sale of the Notes were made pursuant to an effective automatic shelf registration statement on Form S-3 filed with the Securities and Exchange Commission (the \"SEC\"). Deutsche Bank Securities Inc., Mizuho Securities USA LLC and Morgan Stanley & Co. LLC were Joint Book-Running Managers for the senior secured notes offering. The offering was made only by means of a prospectus supplement dated December 2, 2019 and the accompanying base prospectus, copies of which, when available, may be obtained on the SEC's website at www.sec.gov or by contacting Deutsche Bank Securities Inc., Attention: Prospectus Group, 60 Wall Street, New York, NY 10005; Telephone: (800) 503-4611; E-mail: prospectus.CPDG@db.com, or by contacting Mizuho Securities USA LLC, Attention: Debt Capital Markets, 320 Park Avenue, 12th Floor, New York, NY 10022, Telephone: (866) 271-7403, or by contacting Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; E-mail: prospectus@morganstanley.com.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale, nor is it an offer to purchase, or the solicitation of an offer to sell the Notes in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, our plans, strategies and prospects, both business and financial.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" \"estimated,\" \"aim,\" \"on track,\" \"target,\" \"opportunity,\" \"tentative,\" \"positioning,\" \"designed,\" \"create,\" \"predict,\" \"project,\" \"initiatives,\" \"seek,\" \"would,\" \"could,\" \"continue,\" \"ongoing,\" \"upside,\" \"increases\" and \"potential,\" among others.  All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication. View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-prices-1-3-billion-senior-secured-notes-300967816.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Offers Senior Secured Notes",
        "subtitle": "",
        "date": "Dec 2, 2019 9:05AM EST",
        "content": "STAMFORD, Conn., Dec. 2, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, Charter Communications Operating, LLC (\"CCO\") and Charter Communications Operating Capital Corp. (together with CCO, the \"Issuers\"), intend to offer senior secured fixed rate notes due 2050 (the \"Notes\"). The Notes will form a part of the same series of 4.800% Senior Secured Notes issued on October 24, 2019 in the aggregate principal amount of $1.5 billion.Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC, as well as repaying certain indebtedness, which may include all or a portion of the Issuers' 3.579% Senior Secured Notes due 2020.The offering and sale of the Notes will be made pursuant to an effective automatic shelf registration statement on Form S-3 filed with the Securities and Exchange Commission (the \"SEC\"). The offering is subject to, among other things, market conditions.Deutsche Bank Securities Inc., Mizuho Securities USA LLC and Morgan Stanley & Co. LLC will act as Joint Book-Running Managers for the senior secured notes offering. The offering will be made only by means of a prospectus supplement dated December 2, 2019 and the accompanying base prospectus, copies of which, when available, may be obtained on the SEC's website at www.sec.gov or by contacting Deutsche Bank Securities Inc., Attention: Prospectus Group, 60 Wall Street, New York, NY 10005; Telephone: (800) 503-4611; E-mail: prospectus.CPDG@db.com, or by contacting Mizuho Securities USA LLC, Attention: Debt Capital Markets, 320 Park Avenue, 12th Floor, New York, NY 10022, Telephone: (866) 271-7403, or by contacting Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; E-mail: prospectus@morganstanley.com.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale, nor is it an offer to purchase, or the solicitation of an offer to sell the Notes in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, our plans, strategies and prospects, both business and financial.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" \"estimated,\" \"aim,\" \"on track,\" \"target,\" \"opportunity,\" \"tentative,\" \"positioning,\" \"designed,\" \"create,\" \"predict,\" \"project,\" \"initiatives,\" \"seek,\" \"would,\" \"could,\" \"continue,\" \"ongoing,\" \"upside,\" \"increases\" and \"potential,\" among others.  All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-offers-senior-secured-notes-300967365.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Offers Senior Unsecured Notes",
        "subtitle": "",
        "date": "Dec 2, 2019 9:04AM EST",
        "content": "STAMFORD, Conn., Dec. 2, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiaries, CCO Holdings, LLC and CCO Holdings Capital Corp., intend to offer senior unsecured notes due 2030 (the \"Notes\"). The Notes will form a part of the same series of 4.750% Senior Unsecured Notes issued on October 1, 2019 in the aggregate principal amount of $1.35 billion and on October 24, 2019 in the aggregate principal amount of $500 million.Charter intends to use the net proceeds from the sale of the Notes to pay related fees and expenses and for general corporate purposes, including to fund potential buybacks of Class A common stock of Charter or common units of Charter Communications Holdings, LLC, as well as repaying certain indebtedness, which may include all or a portion of the 3.579% Senior Secured Notes due 2020 issued by Charter Communications Operating, LLC and Charter Communications Operating Capital Corp.The Notes will be sold to qualified institutional buyers in reliance on Rule 144A and outside the United States to non-U.S. persons in reliance on Regulation S. The Notes have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. The offering is subject to, among other things, market conditions.This news release is neither an offer to sell nor a solicitation of an offer to buy the Notes and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful. About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, the potential offering.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" and \"potential,\" among others. All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.  View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-offers-senior-unsecured-notes-300967363.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Ovation TV Partners With Charter Communications For 2019 Stand For The Arts Awards Initiative",
        "subtitle": "Ovation to Contribute $120,000 to Arts and Cultural Organizations in 12 Charter Spectrum Markets",
        "date": "Nov 13, 2019 12:05PM EST",
        "content": "LOS ANGELES, Nov. 13, 2019 /PRNewswire/ -- Expanding upon its Stand for the Arts Awards initiative launched in 2017, Ovation, America's only arts network, will partner again with Charter Communications, Inc. in 2019 to recognize outstanding local arts, cultural, and educational organizations and programs in 12 of Charter's Spectrum markets across the country. The initiative is part of the independent network's national arts advocacy platform called Stand for the Arts, which will commit $120,000 to support arts education in these Spectrum markets. The announcement was made today by Sol Doten, Senior Vice President, Content Distribution Marketing, Ovation.Stand for the Arts Awards are granted based on how well an organization empowers the community, builds strategic partnerships, drives engagement through volunteerism and delivers creative programming. \"Ovation is committed to advocating for access to the arts for all,\" said Mr. Doten. \"Charter has a history of working closely with the communities it serves and in demonstrating its commitment to civic engagement and our partnership with them helps Ovation amplify its commitment to supporting the arts.\"  \"These twelve local organizations are doing meaningful and creative work, and are strong examples of how access to the arts and arts education can bring diverse communities together and enrich the lives of people who live in them,\" said Adam Falk, Senior Vice President, State Government Affairs at Charter. \"Charter is excited to extend this partnership with Ovation for a third consecutive year; it's a great example of our commitment to better the lives of people in the communities we serve.\"Each organization will be awarded a $10,000 Stand for the Arts grant to support their efforts. The Spectrum markets and the arts organizations being recognized are:Albany Center Gallery (Albany, NY)The mission of Albany Center Gallery is to promote and exhibit contemporary visual art produced by emerging and established artists living primarily in the region and to inspire interest and provide enjoyment to an increasingly diverse audience.Art Center of Western Colorado (Grand Junction, CO)Founded in 1958, The Art Center of Western Colorado is a regional arts organization dedicated to enriching lives by promoting the enjoyment and understanding of the arts.Berkshire Museum (Pittsfield, MA)Berkshire Museum combines art, science, and history to create thought-provoking experiences for all ages inside the Museum and throughout our community.The Cheech Marin Center for Chicano Art, Culture & Industry of the Riverside Art Museum (Riverside, CA)The Riverside Art Museum strives to integrate art into the lives of people in a way that engages, inspires, and builds community by presenting thought-provoking exhibits and providing quality art classes that instill a lifelong love of the arts. The Cheech Marin Center for Chicano Art, Culture & Industry of the Riverside Art Museum as Cheech Marin says, will be the \"center of Chicano art, not only painting, but sculpture, photography, and video arts.\" Opening in 2021, The Cheech explores Chicano culture from the barrio to the Bay, cholos to Cesar Chavez, pre-Columbian to modern murals.Creative City Project (Orlando, FL)The Creative City Project's mission is to cultivate a thriving arts community in Orlando, nurture a deeper sense of ownership of and care for Orlando amongst its residents and to shape the global perception of our city as one known for innovation and creativity.Dallas Black Dance Theatre (Dallas, TX)The mission of Dallas Black Dance Theatre is to create and produce contemporary modern dance at its highest level of artistic excellence. DBDT accomplishes its mission through performances and educational programs that bridge cultures, reach diverse communities, and encompass ever-expanding global audiences. The company's key initiatives include professional dance concert performances, arts-in-education programs, community outreach activities and dance training classes.East West Players (Los Angeles, CA)Founded in 1965, East West Players is committed to raising the visibility of the Asian American experience by presenting inventive world-class theatrical productions, developing artists of color, and providing impactful youth education programs.Guadalupe Cultural Arts (San Antonio, TX)The Guadalupe Cultural Arts Center presents, preserves and promotes Latino, Chicano and Native American arts and culture through multi-disciplinary arts – dance, music, literature, media, theater, and visual arts.  Kumu Kahua Theatre (Honolulu, HI)The mission of Kumu Kahua Theatre is to provide theatrical opportunities for the expression of local community lifestyles, whether contemporary or historical. To stage locally written plays set in Hawai'i or dealing with some aspect of the Hawaiian experience of residents; to provide training and theatrical experiences for local playwrights, director, performers and other theatrical artists; and to develop an increasingly large audience sensitive to plays and theatre pieces dealing specifically and truthfully with local subject matter.Lima Symphony Orchestra (Lima, OH)The Lima Symphony Orchestra recognizes the profound impact of classical music, and we are committed to bringing the power of music to every corner of our region. We are dedicated to preserving musical excellence as a living part of our community, now and for future generations, through performance, education, engagement and community partnerships. It is our responsibility --  and privilege --  to keep the arts relevant, to lead important social dialogues, to remove barriers and create a place of belonging and respect and finally to reflect accurately the people we serve in our programming, our audience and the musicians on our stage.Louisville Leopard Percussionists (Louisville, KY)The Louisville Leopard Percussionists, ordinary kids transformed by an extraordinary musical experience since 1993. Muse Machine (Dayton, OH)Muse changes the lives of young people through the arts.For more information about Stand for the Arts and the Stand for the Arts Awards, visit:  www.standforthearts.comAbout OVATION America's Only Arts NetworkArt has the power to inspire us, elevate our thinking, and awaken our senses. As an independent television, production and digital media company, OVATION has an unparalleled commitment to the arts, culture and captivating entertainment. Showcasing a lineup of critically-acclaimed premium dramas, arts-related specials and documentaries, and iconic films, OVATION salutes innovative storytelling, lives for the art in entertainment, finds beauty in the everyday, and applauds art in unexpected places. OVATION is available to nearly 50M subscribers via cable, satellite and telco systems including Comcast Cable/Xfinity, DIRECTV/AT&T U-verse, SPECTRUM, Verizon FiOS, as well as on VOD. Through THE OVATION FOUNDATION, the company is committed to advocating for the arts, nationally and locally, and has provided more than $15M in contributions and in kind support to arts institutions and arts education.  You can follow OVATION on Facebook, Twitter, YouTube, Pinterest, OvationTV.com, and through our App, OVATION NOW.About CharterCharter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ovation-tv-partners-with-charter-communications-for-2019-stand-for-the-arts-awards-initiative-300957460.htmlSOURCE  Ovation"
    },
    {
        "title": "Charter Announces Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 25, 2019 7:00AM EDT",
        "content": "STAMFORD, Conn., Oct. 25, 2019 /PRNewswire/ -- Charter Communications, Inc. (along with its subsidiaries, the \"Company\" or \"Charter\") today reported financial and operating results for the three and nine months ended September 30, 2019.Key highlights:\"Our strategy of offering high-quality products with good service at attractive prices is working and continues to produce strong customer relationship growth,\" said Tom Rutledge, Chairman and CEO of Charter Communications. \"In the third quarter, customer relationship growth continued to accelerate and our operating strategy keeps us well-positioned to take advantage of the growth opportunity in front of Charter.\"Key Operating ResultsDuring the third quarter of 2019, Charter's residential customer relationships grew by 282,000, while third quarter 2018 residential customer relationships grew by 192,000. As of September 30, 2019, Charter had 27.0 million residential customer relationships, with year-over-year growth of 3.7%.Charter added 351,000 residential Internet customers in the third quarter of 2019, versus third quarter 2018 residential Internet customer net additions of 266,000. As of September 30, 2019, Charter had 24.6 million residential Internet customers, with 85% subscribing to tiers that provided 100 Mbps or more of speed. Charter recently doubled its minimum Internet speeds to 200 Mbps in a number of additional markets at no additional cost to new and existing Spectrum Internet residential and SMB customers. Currently, 200 Mbps is the slowest speed offered to new Internet customers in approximately 60% of Charter's footprint, with 100 Mbps offered as the slowest speed in the remaining 40% of its footprint.Residential video customers decreased by 77,000 in the third quarter of 2019, while third quarter 2018 video customers decreased by 66,000. As of September 30, 2019, Charter had 15.7 million residential video customers.During the third quarter of 2019, residential wireline voice customers declined by 213,000, while third quarter 2018 voice customers declined by 107,000. As of September 30, 2019, Charter had 9.6 million residential wireline voice customers.Third quarter 2019 residential revenue per residential customer (excluding mobile) totaled $112.00, and grew by 0.8% compared to the prior year period, as promotional rate step-ups and rate adjustments were partly offset by a higher percentage of non-video customers, a higher mix of Choice and Stream customers within our video customer base and lower pay-per-view and video on demand revenue.In September of 2018, Charter completed the full market launch of its Spectrum MobileTM service across its footprint. Spectrum Mobile is available to all new and existing Spectrum Internet customers and runs on America's most awarded LTE network combined with Spectrum WiFi. Spectrum Mobile customers can choose one of two simple ways to pay for data, \"Unlimited\" for $45 a month (per line), or \"By the Gig\" at $14/GB, in both cases including applicable fees and taxes. Late in the second quarter of 2019, Charter expanded its Bring Your Own Device (BYOD) program to all of its sales channels. During the third quarter of 2019, Charter added 276,000 mobile lines, and as of September 30, 2019, Charter served a total of 794,000 mobile lines.SMB customer relationships grew by 28,000 during the third quarter of 2019, compared to growth of 42,000 during the third quarter of 2018. As of September 30, 2019, Charter had 1.9 million SMB customer relationships, with year-over-year growth of 7.7%. Enterprise PSUs grew by 6,000 during the third quarter of 2019 compared to growth of 8,000 during the third quarter of 2018. As of September 30, 2019, Charter had 264,000 enterprise PSUs, with growth of 8.8% year-over-year.Third Quarter Financial ResultsRevenuesThird quarter revenue rose 5.1% year-over-year to $11.5 billion, driven by growth in Internet, mobile, commercial and video revenue. Excluding mobile revenue and advertising revenue, which benefited from political spend in the third quarter of 2018, revenue grew 4.1% year-over-year.Video revenue totaled $4.4 billion in the third quarter, an increase of 0.6% compared to the prior year period. Video revenue growth was driven by rate adjustments and promotional rolloff, partly offset by a decline in video customers during the last year, a higher mix of Choice and Stream customers within our video base and lower pay-per-view and video on demand revenue.Internet revenue grew 10.1%, compared to the year-ago quarter, to $4.2 billion, driven by growth in Internet customers during the last year, promotional rolloff and rate adjustments.Voice revenue totaled $477 million in the third quarter, a decrease of 6.8% compared to the third quarter of 2018, driven by a decline in wireline voice customers over the last twelve months and value-based pricing.Commercial revenue rose to $1.6 billion, an increase of 4.1% over the prior year period, driven by SMB revenue growth of 5.7% and enterprise revenue growth of 1.8%. Third quarter commercial revenue was impacted by Charter's sale of Navisite, its managed cloud services business within Spectrum Enterprise, on September 6. Excluding Navisite revenue from both the third quarter of 2019 and 2018, commercial and enterprise revenue grew 5.2% and 4.4% over the prior year period, respectively.Third quarter advertising sales revenue of $394 million declined 10.6% compared to the year-ago quarter, driven by lower political revenue. Excluding political revenue in both periods, advertising sales revenue grew by 5.8% year-over-year.Third quarter mobile revenue totaled $192 million, an increase of $175 million year-over-year.Other revenue totaled $215 million in the third quarter, a decrease of 5.6% year-over-year, driven by lower home shopping revenue and processing fees, partly offset by video customer premise equipment (\"CPE\") sold to customers.Operating Costs and ExpensesThird quarter total operating costs and expenses increased by $423 million, or 6.1% year-over-year, and 2.6% when excluding third quarter mobile costs.Third quarter programming expense increased by $12 million, or 0.4% as compared to the third quarter of 2018, reflecting contractual programming increases and renewals, partly offset by lower video customers, a higher mix of Choice and Stream customers within our video base and lower pay-per-view expenses.Regulatory, connectivity and produced content expenses increased by $66 million, or 12.3% year-over-year, primarily driven by higher regulatory and franchise pass-through fees, original programming costs and costs of video CPE sold to customers.Costs to service customers increased by $40 million, or 2.2% year-over-year, despite year-over-year residential and SMB customer growth of 4.0%. Cost to service customers excluding bad debt declined by 0.1% year-over-year.Marketing expenses increased by $3 million, or 0.4% year-over-year.Other expenses increased by $59 million, or 6.7% as compared to the third quarter of 2018 primarily driven by software costs, enterprise labor costs and insurance costs.Third quarter mobile costs totaled $337 million, an increase of $243 million year-over-year, and were comprised of device costs, service and operating costs.Adjusted EBITDAThird quarter Adjusted EBITDA of $4.1 billion grew by 3.4% year-over-year, reflecting revenue growth and operating expense growth of 5.1% and 6.1%, respectively. Third quarter cable Adjusted EBITDA grew by 5.0% year-over-year reflecting cable revenue growth and cable operating expense growth of 3.5% and 2.6%, respectively.Net Income Attributable to Charter ShareholdersNet income attributable to Charter shareholders totaled $387 million in the third quarter of 2019, compared to $493 million in the third quarter of 2018. The year-over-year decrease in net income attributable to Charter shareholders was primarily driven by a pension remeasurement gain which benefited the third quarter of 2018 and higher interest expense, partly offset by higher Adjusted EBITDA and lower depreciation and amortization costs.Net income per basic common share attributable to Charter shareholders totaled $1.77 in the third quarter of 2019 compared to $2.14 during the same period last year. The decrease was primarily the result of the factors described above in addition to a 5.2% decrease in weighted average common shares outstanding versus the prior year period.Capital ExpendituresProperty, plant and equipment expenditures totaled $1.7 billion in the third quarter of 2019, compared to $2.1 billion during the third quarter of 2018, primarily driven by declines in CPE, scalable infrastructure and support spending. The decrease in CPE spending was primarily driven by a decline in the pace of migration of Legacy TWC and Legacy Bright House customers to Spectrum pricing and packaging, the completion of Charter's all-digital initiative in 2018, increasing customer self-installations and a higher mix of boxless video outlets. The year-over-year decrease in scalable infrastructure spending was primarily driven by the completion of the rollout of DOCSIS 3.1 technology in 2018 and the associated bandwidth benefit in 2019. The decrease in support capital was due to lower insourcing and integration-related spend, partly offset by higher mobile capital spending. Third quarter capital expenditures included $100 million of mobile costs, of which $78 million were included in support capital.Charter currently expects capital expenditures, excluding capital expenditures related to mobile, to be slightly below $7 billion in 2019, versus $8.9 billion in 2018.Cash Flow and Free Cash FlowDuring the third quarter of 2019, net cash flows from operating activities totaled $2.9 billion, compared to $2.8 billion in the prior year quarter. The year-over-year increase in net cash flows from operating activities was primarily due to higher Adjusted EBITDA.Consolidated free cash flow for the third quarter of 2019 totaled $1.3 billion, compared to $532 million during the same period last year. Cable free cash flow for the third quarter of 2019 totaled $1.5 billion, compared to $681 million during the same period last year. The year-over-year increases in consolidated free cash flow and cable free cash flow were driven by a decline in capital expenditures and an increase in net cash flows from operating activities.Liquidity & FinancingAs of September 30, 2019, total principal amount of debt was $74.2 billion. Charter's credit facilities provided approximately $4.3 billion of additional liquidity in excess of Charter's $508 million cash position.In July 2019, CCO Holdings, LLC (\"CCO Holdings\") and CCO Holdings Capital Corp. issued $750 million of 5.375% senior unsecured notes due 2029. Charter used the net proceeds for general corporate purposes, including funding buybacks of Charter Class A common stock and/or Charter Holdings common units and for repaying certain indebtedness.In July 2019, Charter Communications Operating, LLC (\"Charter Operating\") and Charter Communications Operating Capital Corp. issued $1.25 billion of 5.125% senior secured notes due 2049. The net proceeds will be used to repay certain indebtedness, which may include the 5.000% senior notes due 2020 issued by Time Warner Cable, LLC, with any remaining proceeds used for general corporate purposes, including to fund potential buybacks of Charter Class A common stock and/or Charter Holdings common units.In October 2019, CCO Holdings and CCO Holdings Capital Corp. issued $1.35 billion of 4.750% senior unsecured notes due 2030. The net proceeds were used to finance a tender offer and subsequent call of $500 million aggregate principal amount of CCO Holdings' outstanding 5.250% senior notes due 2021 and $850 million aggregate principal amount of CCO Holdings' outstanding 5.750% senior notes due 2024. Later in October, an additional $500 million of the same 4.750% senior unsecured notes due 2030 were issued. The proceeds will be used for general corporate purposes, including to fund potential buybacks of Charter Class A common stock and/or Charter Holdings common units and to repay certain indebtedness.In October 2019, Charter Operating and Charter Communications Operating Capital Corp. issued $1.5 billion of 4.800% senior secured notes due 2050. The proceeds will be used for general corporate purposes, including to fund potential buybacks of Charter Class A common stock and/or Charter Holdings common units and to repay certain indebtedness.In October 2019, Charter Operating repriced $4.5 billion of revolver and $4.0 billion of term loan A to LIBOR plus 125 basis points and its existing term loan B to LIBOR plus 175 basis points. In addition, $4.5 billion of the revolver and $4.0 billion of term loan A maturities were extended to 2025 and $3.8 billion of term loan B maturities were extended to 2027.Share RepurchasesDuring the three months ended September 30, 2019, Charter purchased approximately 7.8 million shares of Charter Class A common stock and Charter Holdings common units for approximately $3.1 billion.Conference CallCharter will host a conference call on Friday, October 25, 2019 at 8:30 a.m. Eastern Time (ET) related to the contents of this release.The conference call will be webcast live via the Company's investor relations website at ir.charter.com. The call will be archived under the \"Financial Information\" section two hours after completion of the call. Participants should go to the webcast link no later than 10 minutes prior to the start time to register.Those participating via telephone should dial 866-919-0894 no later than 10 minutes prior to the call. International participants should dial 706-679-9379. The conference ID code for the call is 2697386.A replay of the call will be available at 855-859-2056 or 404-537-3406 beginning two hours after the completion of the call through the end of business on November 8, 2019. The conference ID code for the replay is 2697386.Additional Information Available on WebsiteThe information in this press release should be read in conjunction with the financial statements and footnotes contained in the Company's Quarterly Report on Form 10-Q for the three and nine months ended September 30, 2019, which will be posted on the \"Financial Information\" section of our investor relations website at ir.charter.com, when it is filed with the Securities and Exchange Commission (the \"SEC\"). A slide presentation to accompany the conference call and a trending schedule containing historical customer and financial data will also be available in the \"Financial Information\" section.Use of Adjusted EBITDA and Free Cash Flow InformationThe company uses certain measures that are not defined by U.S. generally accepted accounting principles (\"GAAP\") to evaluate various aspects of its business. Adjusted EBITDA and free cash flow are non-GAAP financial measures and should be considered in addition to, not as a substitute for, consolidated net income and net cash flows from operating activities reported in accordance with GAAP. These terms, as defined by Charter, may not be comparable to similarly titled measures used by other companies. Adjusted EBITDA and free cash flow are reconciled to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, in the Addendum to this release.Adjusted EBITDA is defined as net income attributable to Charter shareholders plus net income attributable to noncontrolling interest, net interest expense, income taxes, depreciation and amortization, stock compensation expense, (gain) loss on financial instruments, other (income) expense, net and other operating (income) expenses, such as special charges and (gain) loss on sale or retirement of assets. As such, it eliminates the significant non-cash depreciation and amortization expense that results from the capital-intensive nature of the Company's businesses as well as other non-cash or special items, and is unaffected by the Company's capital structure or investment activities. However, this measure is limited in that it does not reflect the periodic costs of certain capitalized tangible and intangible assets used in generating revenues and the cash cost of financing. These costs are evaluated through other financial measures.Free cash flow is defined as net cash flows from operating activities, less capital expenditures and changes in accrued expenses related to capital expenditures.Management and Charter's board of directors use Adjusted EBITDA and free cash flow to assess Charter's performance and its ability to service its debt, fund operations and make additional investments with internally generated funds. In addition, Adjusted EBITDA generally correlates to the leverage ratio calculation under the Company's credit facilities or outstanding notes to determine compliance with the covenants contained in the facilities and notes (all such documents have been previously filed with the the SEC). For the purpose of calculating compliance with leverage covenants, the Company uses Adjusted EBITDA, as presented, excluding certain expenses paid by its operating subsidiaries to other Charter entities. The Company's debt covenants refer to these expenses as management fees, which were $317 million and $916 million for the three and nine months ended September 30, 2019, respectively, and $278 million and $816 million for the three and nine months ended September 30, 2018, respectively.Cable Adjusted EBITDA is defined as Adjusted EBITDA less mobile revenues plus mobile operating costs and expenses. Cable free cash flow is defined as free cash flow plus mobile net cash outflows from operating activities and mobile capital expenditures. Management and Charter's board of directors use cable Adjusted EBITDA and cable free cash flow to provide management and investors a more meaningful year-over-year perspective on the financial and operational performance and trends of our core cable business without the impact of the revenue, costs and capital expenditures in the initial funding period to grow a new product line as well as the negative working capital impacts from the timing of device-related cash flows when we provide the handset or tablet to customers pursuant to equipment installment plans.About CharterCharter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, our plans, strategies and prospects, both business and financial.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" \"estimated,\" \"aim,\" \"on track,\" \"target,\" \"opportunity,\" \"tentative,\" \"positioning,\" \"designed,\" \"create,\" \"predict,\" \"project,\" \"initiatives,\" \"seek,\" \"would,\" \"could,\" \"continue,\" \"ongoing,\" \"upside,\" \"increases\" and \"potential,\" among others.  Important factors that could cause actual results to differ materially from the forward-looking statements we make in this communication are set forth in our annual report on Form 10-K, and in other reports or documents that we file from time to time with the SEC, and include, but are not limited to:All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication.       View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-announces-third-quarter-2019-results-300945384.htmlSOURCE  Charter Communications, Inc."
    },
    {
        "title": "Charter Extends Maturities and Reduces Pricing of Certain of its Credit Facilities",
        "subtitle": "",
        "date": "Oct 24, 2019 4:30PM EDT",
        "content": "STAMFORD, Conn., Oct. 24, 2019 /PRNewswire/ -- Charter Communications, Inc. (NASDAQ: CHTR) (along with its subsidiaries, \"Charter\") today announced that its subsidiary, Charter Communications Operating, LLC (\"CCO\"), entered into an amendment to its Credit Agreement (i) converting all of its outstanding Term B Loans into new Term B-1 Loans and/or new Term B-2 Loans, (ii) converting some of its outstanding Term A-2 Loans and all of its outstanding Term A-3 Loans into new Term A-4 Loans and (iii) extending the maturity of and reducing the pricing with respect to approximately $4.5 billion of its $4.75 billion revolving credit facility.  The Lenders under the Credit Agreement converted (i) approximately $2.4 billion of the existing Term B Loans into Term B-1 Loans, which mature on April 30, 2025, and (ii) approximately $3.8 billion of the remaining Term B Loans into Term B-2 Loans, which mature on February 1, 2027. Pricing on the Term B-1 Loans and the Term B-2 Loans was set at LIBOR plus 175 basis points.  The Lenders under the Credit Agreement also converted (i) approximately $158 million of the existing Term A-2 Loans and (ii) 100% of the approximately $3.9 billion existing Term A-3 Loans into a new tranche of Term A-4 Loans, which mature on February 1, 2025. Pricing on the Term A-4 Loans was set at LIBOR plus 125 basis points.  Lastly, pricing on approximately $4.5 billion of the $4.75 billion revolving credit facility was reduced from LIBOR plus 150 basis points to LIBOR plus 125 basis points, and the maturity date with respect thereto was extended from March 29, 2024 to February 1, 2025. Remaining portions of the Term A-2 Loans and the revolving credit facility mature on March 31, 2023.  This news release is neither an offer to sell nor a solicitation of an offer to buy any securities and shall not constitute an offer, solicitation or sale, nor is it an offer to purchase, or the solicitation of an offer to sell any securities in any jurisdiction in which such offer, solicitation, or sale is unlawful.About Charter Charter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTSThis communication includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, regarding, among other things, our plans, strategies and prospects, both business and financial.  Although we believe that our plans, intentions and expectations as reflected in or suggested by these forward-looking statements are reasonable, we cannot assure you that we will achieve or realize these plans, intentions or expectations.  Forward-looking statements are inherently subject to risks, uncertainties and assumptions including, without limitation, the factors described under \"Risk Factors\" from time to time in our filings with the SEC.  Many of the forward-looking statements contained in this communication may be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"will,\" \"may,\" \"intend,\" \"estimated,\" \"aim,\" \"on track,\" \"target,\" \"opportunity,\" \"tentative,\" \"positioning,\" \"designed,\" \"create,\" \"predict,\" \"project,\" \"initiatives,\" \"seek,\" \"would,\" \"could,\" \"continue,\" \"ongoing,\" \"upside,\" \"increases\" and \"potential,\" among others.  All forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement.  We are under no duty or obligation to update any of the forward-looking statements after the date of this communication. View original content to download multimedia:http://www.prnewswire.com/news-releases/charter-extends-maturities-and-reduces-pricing-of-certain-of-its-credit-facilities-300945229.htmlSOURCE  Charter Communications, Inc."
    }
]