[
    {
        "title": "Comcast to Participate in Deutsche Bank Investor Conference",
        "subtitle": "",
        "date": "Feb 27, 2020 2:00PM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nOn Monday, March 9, 2020, Jeremy Darroch, Group Chief Executive of Sky (Nasdaq: CMCSA), will participate in Deutsche Bank’s 28th Annual Media, Internet & Telecom Conference in Palm Beach, Florida.\n\nA live webcast of the event will be available on the Company's Investor Relations website at www.cmcsa.com on Monday, March 9, 2020 at 12:00 P.M. Eastern Time. An on-demand replay will be available shortly after the conclusion of the presentation.\n\nTo automatically receive Comcast financial news by e-mail, please visit www.cmcsa.com and subscribe to E-mail Alerts.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005812/en/\nInvestor Contacts:\nMarci Ryvicker (215) 286-4781\nJane Kearns (215) 286-4794\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Corporation Promotes Jennifer Khoury to Chief Communications Officer",
        "subtitle": "",
        "date": "Feb 20, 2020 1:00PM EST",
        "content": "\nAfter 16 years leading Corporate Communications, D’Arcy Rudnay Retires\n    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation today announced it has promoted Jennifer Khoury to Chief Communications Officer, succeeding D’Arcy Rudnay who, after a 16-year career at Comcast, is retiring. Effective today, Ms. Khoury will oversee the company’s comprehensive external and internal corporate communications functions for the enterprise.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200220005754/en/Jennifer Khoury, Chief Communications Officer, Comcast Corporation (Photo: Business Wire)\n“I can’t thank D’Arcy enough for her friendship and leadership, her unwavering commitment to our success, and her dedication and service to our company,” said Brian L. Roberts, Chairman and Chief Executive Officer, Comcast Corporation. “D’Arcy created our corporate brand and has led our communications strategy through some of the most important milestones in our history. We’ve been side-by-side through game-changing acquisitions, including NBCUniversal and Sky, industry-shaping technological innovations, and an incredible period of growth. D’Arcy has been a trusted partner to me for nearly two decades and her impact on our company cannot be overstated.”\n\nMs. Rudnay will remain with the company through the end of the year, serving as senior advisor to Comcast’s Executive Leadership Team.\n\nMr. Roberts further commented on Ms. Khoury’s new role, stating, “Jenn is a fantastic leader and the perfect person to lead us into the future. This well-deserved promotion will come as no surprise to those who know and have worked with Jenn. Her strategic vision and deep knowledge of the company and the industry has earned her the respect and support of our entire management team.”\n\nMs. Khoury joined Comcast over 20 years ago and has been responsible for leading communications for Comcast Cable and has managed strategic communications for numerous campaigns and product and technology launches. She also oversees the corporate digital communications team, a function she built over the last decade to reflect the rapidly changing communications landscape.\n\nMs. Khoury will report to Mr. Roberts and to Adam Miller, who was also promoted to Senior Executive Vice President of Comcast Corporation in addition to his Executive Vice President role at NBCUniversal.\n\nMs. Khoury received a B.A. in communications from Boston College and earned a master’s degree from The Annenberg School for Communication at the University of Pennsylvania.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005754/en/\nJohn Demming\n(215) 286-8011\nJohn_Demming@Comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast to Participate in Morgan Stanley Investor Conference",
        "subtitle": "",
        "date": "Feb 18, 2020 2:00PM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nOn Tuesday, March 3, 2020, Brian L. Roberts, Chairman and Chief Executive Officer of Comcast Corporation (Nasdaq: CMCSA), will participate in Morgan Stanley’s 2020 Technology, Media & Telecom Conference in San Francisco, California.\n\nA live webcast of the event will be available on the Company's Investor Relations website at www.cmcsa.com on Tuesday, March 3, 2020 at 11:45 A.M. Eastern Time. An on-demand replay will be available shortly after the conclusion of the presentation.\n\nTo automatically receive Comcast financial news by e-mail, please visit www.cmcsa.com and subscribe to E-mail Alerts.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200218005882/en/\nInvestor Contacts:\nMarci Ryvicker (215) 286-4781\nJane Kearns (215) 286-4794\nSource: Comcast Corporation"
    },
    {
        "title": "Xfinity Mobile to Offer New Samsung Galaxy S20+ 5G and Galaxy S20 Ultra 5G Devices",
        "subtitle": "",
        "date": "Feb 11, 2020 3:00PM EST",
        "content": "\nNew and Existing Xfinity Mobile Customers Can Receive $300 Back When They Purchase A New Samsung Device\n    PHILADELPHIA--(BUSINESS WIRE)--\nComcast today announced that Xfinity Mobile will carry the new highly anticipated Samsung Galaxy S20+ 5G and Galaxy S20 Ultra 5G. Xfinity Mobile customers can pre-order the phone for its March 6th release, starting February 21st online or in Xfinity Stores nationwide.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200211005600/en/Comcast today announced that Xfinity Mobile will carry the new highly anticipated Samsung Galaxy S20+ 5G and Galaxy S20 Ultra 5G. (Graphic: Business Wire)\nIn addition, any customer that switches to Xfinity Mobile between February 21st and April 5th will receive $300 off the new Samsung Galaxy S20 series and other select Samsung devices. Existing Xfinity Mobile customers can also receive a $300 pre-paid card with the purchase of the S20 series or select Samsung devices.1\n\n“We are thrilled to add one of the most anticipated new mobile devices of 2020 to our portfolio – the Samsung Galaxy S20 devices,” said Billy Stephens, Senior Vice President of Wireless Devices for Xfinity Mobile. “We continue to differentiate by delivering a better wireless experience for less money on the most popular devices – and we’re excited to be able to bring the Samsung Galaxy S20+ 5G and S20 Ultra 5G to our customers, with plans to launch 5G data options soon so our customers can take full advantage of all these devices have to offer.”\n\nThe Galaxy S20 series introduces a brand-new camera architecture that combines AI with Samsung’s largest image sensor yet for stunning image quality. The Galaxy S20+ 5G has a 64MP camera. The Galaxy S20 Ultra 5G has 108MP camera. Another benefit is that the larger sensors take in more light, so you get rich image quality even in low light situations.\n\nBuilt with Samsung’s latest innovations and upgraded essential features, the Galaxy S20 series feature new Space Zoom technology that zooms in super close from afar, as well as Single Take, which lets you capture a number of photo and videos, such as live focus, cropped, ultra wide and more and use AI to recommend the best shots. The Galaxy S20 devices also offer stunning 8K video shooting, so users can capture their world in true-to-life color and quality.2\n\nAlong with the camera, the Galaxy S20 makes the experience of everything we love to do with our phones, easier and better. Now, from the dialer, you can tap Google Duo to start a video call to video chat easily with all of the most important people in your life. And with the new Music Share feature, extend your paired Bluetooth connection to a car stereo or speaker via your device, so you and your friend can take turns DJ-ing during the road trip or party.3\n\nThe Galaxy S20 phones also include an all-day intelligent battery, as well as super fast charging and Wireless Powershare.4 The devices have up to 512GB of internal storage plus up to 1TB via MicroSD.5 The Galaxy S20+ 5G is 6.7” and Galaxy S20 Ultra 5G is 6.9”.6\n\nXfinity Mobile is available to Xfinity Internet customers and includes up to five lines of unlimited nationwide talk and text, and no phone line access fees. Customers can choose from two straightforward data options – “By the Gig” shared data starting at 1 GB for $12 (3 GB for $30 and 10 GB for $60), or Unlimited for $45 per month per line*.\n\nUnlike most wireless carriers, Xfinity Mobile gives customers the flexibility to mix-and-match data options per user on an account, and switch any line on an account between data options, at any time during their billing cycle. These features, plus the ability to access millions of Xfinity WiFi hotspots for free, are helping most Xfinity Mobile customers save hundreds of dollars per year on their wireless bills.\n\nTo find the Xfinity Store closest to you where you can purchase the new Samsung Galaxy S20 devices, go here. For more information and to subscribe to Xfinity Mobile online, go to XfinityMobile.com. To download images and assets, go to corporate.comcast.com/mobile.\n\nAbout Xfinity Mobile\n\nXfinity Mobile is the nation’s first wireless service combining America’s largest and most reliable LTE network with 19 million Xfinity WiFi hotspots to deliver a great wireless experience, for less money, on the most popular devices. Available with Xfinity Internet, Xfinity Mobile customers can pay “By the Gig” starting at $12 per GB, or select the unlimited data option – easily switching from “By the Gig” to “Unlimited” at any time and no cost using the Xfinity Mobile app. For more information on Xfinity Mobile, go to XfinityMobile.com.\n\nAbout Comcast\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\n\n*Cellular data speeds for Xfinity Mobile customers reduced after 20 GB of cellular data consumed. Wi-Fi usage does not count towards the 20 GB data threshold.\n\n1 Terms and conditions apply. For more information, visit www.xfinitymobile.com beginning 2/21.\n2 Functionality may vary by country or carrier. Optimal 5G connection required on both devices. See carrier for more details.\n3 Available only on Galaxy S20 devices.\n4 Wireless PowerShare limited to Samsung or other brand smartphones and accessories with WPC Qi wireless charging. Check samsung.com for compatibility. May not work with certain accessories, covers, or other brand devices. May affect call reception or data services, depending on your network environment. Speed and power efficiency of charge varies by device.\n5 MicroSD card sold separately.\n6 Measured diagonally, Galaxy S20+'s screen size is 6.7\" in the full rectangle and 6.5\" with accounting for the rounded corners; and Galaxy S20 Ultra's screen size is 6.9\" in the full rectangle and 6.7\" with accounting for the rounded corners; actual viewable area is less due to the rounded corners and camera hole.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005600/en/\nJoel Shadle\njoel_shadle@comcast.com\n215-286-4675\n\nRachel Zabinski\nRachel_zabinski@comcast.com\n215-286-1516\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Announces Redemption of $1.005 Billion of 4.45% Senior Notes due March 2047",
        "subtitle": "",
        "date": "Feb 7, 2020 11:16AM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation (Nasdaq: CMCSA) announced today it has elected to exercise its option to redeem on March 15, 2020 (to be paid on March 16, 2020) all $1.005 billion principal amount outstanding of its 4.45% Senior Notes due March 15, 2047 (ISIN No. XS1569497107) at a redemption price equal to 100% of the principal amount of the Notes being redeemed plus any accrued and unpaid interest to, but not including, the redemption date. The Notes are traded on the Taipei Exchange. The Bank of New York Mellon Trust Company, N.A. is the trustee for the Notes.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200207005409/en/\nInvestor Contacts:\nMarci Ryvicker (215) 286-4781\nJane Kearns (215) 286-4794\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast California Adds Two New Executives to Its Senior Leadership Team",
        "subtitle": "",
        "date": "Feb 6, 2020 12:13PM EST",
        "content": "\nTwo New Vice Presidents to Lead Technical Operations and Human Resources\n    LIVERMORE, Calif.--(BUSINESS WIRE)--\nComcast California has named two new vice presidents to its senior leadership team. The appointments include Sonya Echols, Vice President of Human Resources and Mike Burnett, Vice President of Technical Operations.\n\nSonya Echols is the new Vice President of Human Resources for Comcast California and will lead a team of 45 people that oversee the policies, learning & development, well-being and career momentum of Comcast’s approximately 5,000 California employees. Her team’s responsibilities include employee relations, recruitment, organizational and employee development, talent management, compensation and benefits, internal communications, and environmental health and safety. Prior to Comcast, Sonya led Human Resources for 13,000 employees at DaVita Medical Group in Denver, CO and brings over 20 years of leadership experience with her to this role at Comcast. Sonya has a Master’s of Business Administration and Bachelor of Science in Business Management from Pepperdine University.\n\nMike Burnett is Comcast California’s new Vice President of Technical Operations. Mike will be responsible for overseeing a team of 2,000 employees and all aspects of Comcast California’s Technical Operations. Mike brings over 20 years of experience and extensive knowledge of the media, cable and telecommunications industry. Prior to his role in California, Mike served as the Vice President of Field Operations in Comcast’s Oregon/Southwest Washington region and before that, he was Vice President of Sales Channel Effectiveness for the Comcast West Division. Mike graduated from the University of Arkansas with a Bachelor’s Degree in Marketing.\n\n“We are thrilled to have leaders like Sonya and Mike join our top-notch California regional senior leadership team,\" said John Gauder, Regional Senior Vice President for Comcast California. “California is among Comcast’s largest regions and we need leaders of the caliber of Sonya and Mike on our team to drive business growth and produce results -- from delivering the best customer experience to positioning Comcast as the leading provider of innovative, reliable products and services that connect our customers to moments that matter.”\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest video, high-speed internet, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005006/en/\nAdriana Arvizo\n925-200-1919\nadriana_arvizo@comcast.com\n\nJoan Hammel\n925-519-4874\njoan_hammel@comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Acquires Blueface; Global Provider of Unified Communications as a Service (UCaaS) to Complement Comcast Business Solutions",
        "subtitle": "",
        "date": "Jan 27, 2020 9:30AM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast today announced it has completed the acquisition of Blueface® – a Dublin, Ireland-based global technology provider and leader in unified communications solutions. Terms of the acquisition were not disclosed.\n\nThe acquisition adds Blueface’s proprietary and fully customizable cloud voice unified communications platform to Comcast Business’s portfolio of business-grade solutions; helping to provide businesses the ability to communicate and collaborate seamlessly and globally.\n\n“The addition of Blueface’s Unified Communications (UC) solution to the Comcast Business portfolio will provide customers access to industry-leading audio and video tools to connect employees across devices and locations,” said Bill Stemper, President, Comcast Business. “Whether connecting within a company or directly to customers, Blueface technology, powered by Comcast Business, will provide businesses a seamless communications experience. We look forward to delivering innovative solutions that enable businesses to help power employee productivity and extraordinary customer experiences in 2020 and beyond.”\n\n“Blueface is the only truly global Unified Communications-as-a-Service platform that can equip service providers with a customised unified communications solution for businesses large and small,” said Alan Foy, CEO, Blueface. “We are thrilled to join Comcast and work with the Comcast Business team to invest in and scale our technology roadmap to create compelling B2B product offerings. Together, we will enable businesses to connect better with an unmatched network and suite of communication tools that enable improved employee productivity.”\n\nFor more information on Comcast Business and Blueface, visit: www.blueface.com/blog/comcast-acquires-blueface\n\nAbout Comcast Business\n\nComcast Business offers Ethernet, Internet, WiFi, Voice, TV and Managed Enterprise Solutions to help organizations of all sizes transform their business. Powered by an advanced network, and backed by 24/7 customer support, Comcast Business is one of the largest contributors to the growth of Comcast Cable. Comcast Business is the nation’s largest cable provider to small and mid-size businesses and has emerged as a force in the Enterprise market; recognized over the last two years by leading industry associations as one of the fastest growing providers of Ethernet services.\n\nFor more information, call 866-429-3085. Follow on Twitter @ComcastBusiness and on other social media networks at http://business.comcast.com/social.\n\nAbout Blueface\n\nBlueface is a leading Unified Communications-as-a-Service Technology Provider to Businesses, Enterprises and Carriers/Service Providers with a strong commitment to product innovation and development. Founded in 2004, Blueface’s proprietary cloud voice UC Platform services Business customers of all sizes ranging from SME’s through to Large Multinational Enterprises. Blueface’s Enterprise-Ready cloud voice solutions are recognised as cutting edge and global best in class. Customers need reliable, feature rich, flexible and scalable UC solutions and Blueface embraces the best in unified communications features across cloud voice, unified communications, messaging, conferencing, contact center, global services, workforce mobility and a suite of cloud-based business applications. Visit ​www.blueface.com​ for more information.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest video, high-speed internet, video and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200127005037/en/\nMedia Contacts:\nMatt Helmke, Comcast Business\n215.286.8666\nmatt_helmke@comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Increases Dividend by 10% to $0.92 Per Share on an Annualized Basis In 2020",
        "subtitle": "",
        "date": "Jan 23, 2020 7:05AM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation (NASDAQ: CMCSA) announced today that it increased its dividend by $0.08 to $0.92 per share on an annualized basis, up 10% year-over-year. In accordance with the increase, the Board of Directors declared a quarterly cash dividend of $0.23 a share on the company’s common stock, payable on April 22, 2020 to shareholders of record as of the close of business on April 1, 2020.\n\nTo automatically receive Comcast financial news by e-mail, please visit www.cmcsa.com and subscribe to E-mail Alerts.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005367/en/\nInvestor Contacts:\nJason Armstrong (215) 286-7972\nJane Kearns (215) 286-4794\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Reports 4th Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Jan 23, 2020 7:00AM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation (NASDAQ: CMCSA) today reported results for the quarter and year ended December 31, 2019.\n\nBrian L. Roberts, Chairman and Chief Executive Officer of Comcast Corporation, said, \"We delivered strong operational and financial results in the fourth quarter, capping another great year for Comcast, including double-digit growth in full-year adjusted EPS, record free cash flow and 1.4 million broadband net additions in the U.S. Our teams at Cable, NBCUniversal and Sky continued to execute at a high level, strengthening our leadership position in our markets. Looking ahead, in 2020 we are leaning into exciting opportunities, including: further differentiating our broadband product in the U.S. through innovations like Flex and xFi Advanced Security; accelerating the deployment of Sky Q; launching a new broadband service in Italy; debuting Super Nintendo World at Universal Studios Japan; and introducing a world-class streaming service - Peacock - which leverages capabilities from across Comcast. Underscoring our confidence in the continued success of our company, we are pleased to announce a 10% increase in our dividend, our 12th consecutive annual increase.\"\n\nFull Year 2019 Highlights:\n\n4th Quarter 2019 Highlights:\n\nDividends:\n\nConsolidated Financial Results\n\nThe comparability of our consolidated results was impacted by the fourth quarter 2018 Sky transaction. Sky’s results of operations are included in our consolidated financial statements following the acquisition date.\n\nConsolidated Revenue for the fourth quarter of 2019 increased 2.0% to $28.4 billion. Consolidated Net Income Attributable to Comcast increased 25.9% to $3.2 billion. Consolidated Adjusted EBITDA increased 3.0% to $8.4 billion.\n\nFor the twelve months ended December 31, 2019, consolidated revenue increased 15.3% to $109 billion compared to 2018. Consolidated net income attributable to Comcast increased 11.3% to $13.1 billion. Consolidated Adjusted EBITDA increased 13.6% to $34.3 billion.\n\nEarnings per Share (EPS) for the fourth quarter of 2019 was $0.68, an increase of 23.6% compared to the fourth quarter of 2018. On an adjusted basis, EPS increased 9.7% to $0.79 (see Table 5).\n\nFor the twelve months ended December 31, 2019, EPS was $2.83, a 11.9% increase compared to the prior year. On an adjusted basis, EPS increased 14.7% to $3.13 (see Table 5).\n\nCapital Expenditures decreased 2.5% to $3.1 billion in the fourth quarter of 2019. Cable Communications’ capital expenditures decreased 7.8% to $2.1 billion. NBCUniversal’s capital expenditures increased 7.6% to $641 million. Sky had capital expenditures of $228 million.\n\nFor the twelve months ended December 31, 2019, capital expenditures increased 1.8% to $10.0 billion compared to 2018. Cable Communications' capital expenditures decreased 10.5% to $6.9 billion. NBCUniversal's capital expenditures increased 19.7% to $2.1 billion. Sky had capital expenditures of $768 million.\n\nNet Cash Provided by Operating Activities was $6.2 billion in the fourth quarter of 2019. Free Cash Flow was $2.5 billion (see Table 4).\n\nFor the twelve months ended December 31, 2019, net cash provided by operating activities was $25.7 billion. Free cash flow was $13.4 billion (see Table 4).\n\nDividends paid during the fourth quarter of 2019 totaled $957 million. For the full year, Comcast made four cash dividend payments totaling $3.7 billion.\n\nToday Comcast announced that it increased its dividend by 10% to $0.92 per share on an annualized basis for 2020. In accordance with the increase, the Board of Directors declared a quarterly cash dividend of $0.23 a share on the company's stock, payable April 22, 2020 to shareholders of record as of the close of business on April 1, 2020.\n\nConsolidated Pro Forma Financial Results\n\nPro forma results are presented as if the Sky transaction occurred on January 1, 2017. The pro forma amounts are based on historical results of operations and are primarily adjusted for the allocation of purchase price and excluding costs directly related to the transaction. These amounts are not necessarily indicative of what our results would have been had we operated Sky since January 1, 2017 (see Table 7 for reconciliations of pro forma financial data).\n\nConsolidated Pro Forma Revenue for the fourth quarter of 2019 was consistent with the prior year period at $28.4 billion. Consolidated Pro Forma Adjusted EBITDA increased 2.1% to $8.4 billion.\n\nFor the twelve months ended December 31, 2019, consolidated pro forma revenue decreased 0.5% to $109 billion compared to 2018. Consolidated Pro Forma Adjusted EBITDA increased 5.9% to $34.3 billion.\n\nCable Communications\n\nRevenue for Cable Communications increased 2.6% to $14.8 billion in the fourth quarter of 2019, driven primarily by increases in high-speed internet, business services and wireless revenue, partially offset by a decrease in advertising revenue. High-speed internet revenue increased 8.8%, driven by an increase in the number of residential high-speed internet customers and rate adjustments. Business services revenue increased 8.8%, due to an increase in the number of customers receiving our services and an increase in average rates. Wireless revenue increased 39.4%, primarily reflecting an increase in the number of customer lines. Advertising revenue decreased 19.1%, reflecting a decrease in political advertising revenue. Excluding political advertising revenue, advertising revenue was consistent with the prior year period. Video revenue decreased 1.2%, reflecting a decrease in the number of residential video customers, partially offset by rate adjustments. Voice revenue decreased 3.6%, primarily due to a decrease in the number of residential voice customers. Other revenue decreased 2.3%, primarily reflecting the timing of X1 licensing revenue, partially offset by higher security and automation services revenue.\n\nFor the twelve months ended December 31, 2019, Cable revenue increased 3.7% to $58.1 billion compared to 2018, driven by growth in high-speed internet, business services, wireless and other revenue, partially offset by a decrease in advertising, video and voice revenue.\n\nTotal Customer Relationships increased by 372,000 to 31.5 million in the fourth quarter of 2019. Residential customer relationships increased by 352,000 and business customer relationships increased by 20,000. Total high-speed internet customer net additions were 442,000, total video customer net losses were 149,000, total voice customer net losses were 2,000 and total security and automation customer net additions were 10,000. In addition, Cable Communications added 261,000 wireless lines in the quarter.\n\nFor the year ended December 31, 2019, total customer relationships increased by 1.1 million. Residential customer relationships increased by 1.0 million and business customer relationships increased by 94,000. Total high-speed internet customer net additions were 1.4 million, total video customer net losses were 733,000, total voice customer net losses were 173,000 and total security and automation customer net additions were 59,000. In addition, Cable Communications added 816,000 wireless lines during the year.\n\nAdjusted EBITDA for Cable Communications increased 5.4% to $5.9 billion in the fourth quarter of 2019, reflecting higher revenue, partially offset by a 0.8% increase in operating expenses. Non-programming expenses increased 1.6%, primarily reflecting higher technical and product support expenses, partially offset by lower other operating costs and advertising, marketing and promotional costs. Non-programming expenses per customer relationship decreased 1.9%. Programming costs decreased 0.6% due to the timing of programming contract renewals and video subscriber declines. This quarter's Adjusted EBITDA per customer relationship increased 1.8%, and Adjusted EBITDA margin was 39.8% compared to 38.8% in the fourth quarter of 2018. Cable Communications results include a loss of $116 million from our wireless business, compared to a loss of $191 million in the prior period.\n\nFor the twelve months ended December 31, 2019, Cable Adjusted EBITDA increased 7.3% to $23.3 billion compared to 2018, driven by higher revenue, partially offset by a 1.4% increase in operating expenses. The higher expenses were due to a 1.5% increase in non-programming expenses and a 1.1% increase in programming costs. For the twelve months ended December 31, 2019, Adjusted EBITDA per customer relationship increased 3.5%, and Adjusted EBITDA margin was 40.1% compared to 38.7% in 2018. Cable Communications results include a loss of $401 million from our wireless business, compared to a loss of $743 million in the prior period.\n\nCapital Expenditures for Cable Communications decreased 7.8% to $2.1 billion in the fourth quarter of 2019. Cable capital expenditures represented 14.5% of Cable revenue in the fourth quarter of 2019 compared to 16.1% in last year's fourth quarter.\n\nFor the twelve months ended December 31, 2019, Cable capital expenditures decreased 10.5% to $6.9 billion. Cable capital expenditures represented 11.9% of Cable revenue compared to 13.8% in 2018.\n\nNBCUniversal\n\nRevenue for NBCUniversal decreased 2.6% to $9.2 billion in the fourth quarter of 2019. Adjusted EBITDA decreased 4.7% to $2.0 billion.\n\nFor the twelve months ended December 31, 2019, NBCUniversal revenue decreased 5.0% to $34.0 billion compared to last year's results, which included an incremental $1.6 billion of revenue generated by the broadcasts of the 2018 PyeongChang Olympics and the NFL's Super Bowl LII at our TV Businesses. Adjusted EBITDA increased 2.0% to $8.8 billion.\n\nCable Networks\n\nCable Networks revenue increased 1.2% to $2.9 billion in the fourth quarter of 2019, primarily reflecting higher advertising and content licensing and other revenue. Advertising revenue increased 2.0%, reflecting higher rates, partially offset by audience ratings declines. Content licensing and other revenue increased 3.4%, due to higher revenue from our digital businesses. Distribution revenue was consistent with the prior year period, reflecting contractual rate increases and the timing of contract renewals, offset by a decline in subscribers. Adjusted EBITDA decreased 1.4% to $1.0 billion in the fourth quarter of 2019, reflecting higher revenue, more than offset by an increase in operating costs and expenses.\n\nFor the twelve months ended December 31, 2019, revenue from the Cable Networks segment decreased 2.2% to $11.5 billion compared to 2018, primarily reflecting lower content licensing and other and advertising revenue. Excluding $378 million of revenue generated by the broadcast of the 2018 PyeongChang Olympics in the first quarter of 2018, Cable Networks revenue increased 1.0% (see Table 6). Adjusted EBITDA of $4.4 billion was consistent with the prior year period, reflecting lower revenue, offset by a decrease in operating costs and expenses, including programming and production costs, due to the broadcast of the 2018 PyeongChang Olympics in the first quarter of 2018.\n\nBroadcast Television\n\nBroadcast Television revenue increased 2.1% to $3.2 billion in the fourth quarter of 2019, reflecting higher distribution and other and content licensing revenue, partially offset by a decrease in advertising revenue. Distribution and other revenue increased 9.9%, primarily due to higher retransmission consent fees. Content licensing revenue increased 5.8%, primarily due to the timing of content provided under licensing agreements. Advertising revenue decreased 1.5%, due to a decrease in political advertising revenue. Excluding political advertising revenue, advertising revenue increased in the low-single-digits, reflecting higher pricing, partially offset by audience ratings declines. Adjusted EBITDA increased 14.2% to $471 million in the fourth quarter of 2019, primarily reflecting higher revenue and consistent operating costs and expenses.\n\nFor the twelve months ended December 31, 2019, revenue from the Broadcast Television segment decreased 10.3% to $10.3 billion compared to 2018, primarily reflecting a decrease in advertising revenue. Excluding $770 million of revenue generated by the broadcast of the 2018 PyeongChang Olympics in the first quarter of 2018 and $423 million of revenue generated by the broadcast of the NFL's Super Bowl LII in the first quarter of 2018, Broadcast Television revenue of $10.3 billion was consistent with the prior year period (see Table 6). Adjusted EBITDA increased 4.4% to $1.7 billion compared to 2018, with lower revenue more than offset by a decrease in programming and production costs, primarily due to decreased sports programming costs associated with the broadcasts of the 2018 PyeongChang Olympics and the NFL's Super Bowl LII in the first quarter of 2018.\n\nFilmed Entertainment\n\nFilmed Entertainment revenue decreased 21.0% to $1.6 billion in the fourth quarter of 2019, primarily reflecting lower theatrical revenue. Theatrical revenue decreased 59.1%, reflecting the volume and strength of releases in last year's fourth quarter, including Dr. Seuss' The Grinch and Halloween. Adjusted EBITDA decreased 48.9% to $91 million in the fourth quarter of 2019, reflecting lower revenue, partially offset by lower programming and production costs.\n\nFor the twelve months ended December 31, 2019, revenue from the Filmed Entertainment segment decreased 9.2% to $6.5 billion compared to 2018, primarily reflecting lower theatrical revenue, partially offset by higher content licensing revenue. Adjusted EBITDA increased 13.5% to $833 million compared to 2018, reflecting lower revenue, more than offset by lower operating expenses.\n\nTheme Parks\n\nTheme Parks revenue increased 3.2% to $1.6 billion in the fourth quarter of 2019, due to increases in guest spending. Adjusted EBITDA decreased 4.5% to $636 million in the fourth quarter of 2019, reflecting higher revenue, more than offset by higher operating expenses.\n\nFor the twelve months ended December 31, 2019, revenue from the Theme Parks segment increased 4.4% to $5.9 billion compared to 2018, due to increases in guest spending and higher attendance. Adjusted EBITDA of $2.5 billion was consistent with the prior year period, reflecting an increase in revenue, offset by higher operating expenses.\n\nHeadquarters, Other and Eliminations\n\nNBCUniversal Headquarters, Other and Eliminations include overhead and eliminations among the NBCUniversal businesses. For the quarter ended December 31, 2019, NBCUniversal Headquarters, Other and Eliminations Adjusted EBITDA loss was $204 million, compared to a loss of $176 million in the fourth quarter of 2018.\n\nFor the twelve months ended December 31, 2019, NBCUniversal Headquarters, Other and Eliminations Adjusted EBITDA loss was $690 million compared to a loss of $676 million in 2018.\n\nSky\n\nPro forma results are presented as if the Sky transaction occurred on January 1, 2017. The pro forma amounts are based on historical results of operations and are primarily adjusted for the allocation of purchase price and excluding costs directly related to the transaction. These amounts are not necessarily indicative of what our results would have been had we operated Sky since January 1, 2017, (see Table 7 for reconciliations of pro forma financial data).\n\nPro Forma Revenue for Sky of $5.0 billion was consistent with the prior year period. Excluding the impact of currency, revenue increased 1.4%, driven by higher direct-to-consumer and content revenue, partially offset by lower advertising revenue. Direct-to-consumer revenue increased 2.3% to $4.0 billion, driven by an increase in customer relationships. Content revenue increased 2.7% to $371 million, reflecting higher rates for wholesaling of our programming. Advertising revenue decreased 4.1% to $647 million, reflecting an unfavorable impact from a change in legislation related to gambling advertisements in the UK and Italy, as well as overall market weakness.\n\nFor the twelve months ended December 31, 2019, pro forma Sky revenue decreased 3.0% to $19.2 billion compared to 2018. Excluding the impact of currency, revenue increased 1.7%, reflecting growth in content and direct-to-consumer revenue, partially offset by lower advertising revenue.\n\nPro Forma Total Customer Relationships increased by 77,000 to 24.0 million in the fourth quarter of 2019. For the twelve months ended December 31, 2019, total customer relationships increased by 394,000.\n\nPro Forma Adjusted EBITDA for Sky of $765 million was consistent with the prior year period. Excluding the impact of currency, Adjusted EBITDA increased 0.4%, reflecting higher revenue, partially offset by higher operating expenses.\n\nFor the twelve months ended December 31, 2019, pro forma Sky Adjusted EBITDA increased 7.1% to $3.1 billion compared to 2018. Excluding the impact of currency, Adjusted EBITDA increased 12.2%.\n\nCorporate, Other and Eliminations\n\nCorporate, Other and Eliminations primarily relate to corporate operations and Comcast Spectacor, as well as eliminations among Comcast's businesses. For the quarter ended December 31, 2019, the Corporate, Other and Eliminations Adjusted EBITDA6 loss was $232 million, an increase of $30 million compared to 2018, primarily driven by start up costs associated with Peacock.\n\nFor the twelve months ended December 31, 2019, the Corporate, Other and Eliminations Adjusted EBITDA6 loss was $879 million, an increase of $73 million compared to 2018, primarily driven by start up costs associated with Peacock.\n\nConference Call and Other Information\n\nComcast Corporation will host a conference call with the financial community today, January 23, 2020 at 8:30 a.m. Eastern Time (ET). The conference call and related materials will be broadcast live and posted on its Investor Relations website at www.cmcsa.com. Those parties interested in participating via telephone should dial (800) 263-8495 with the conference ID number 3469916. A replay of the call will be available starting at 12:00 p.m. ET on January 23, 2020, on the Investor Relations website or by telephone. To access the telephone replay, which will be available until Thursday, January 30, 2020 at midnight ET, please dial (855) 859-2056 and enter the conference ID number 3469916.\n\nFrom time to time, we post information that may be of interest to investors on our website at www.cmcsa.com and on our corporate website, www.comcastcorporation.com. To automatically receive Comcast financial news by email, please visit www.cmcsa.com and subscribe to email alerts.\n\nCaution Concerning Forward-Looking Statements\n\nThis press release contains forward-looking statements. Readers are cautioned that such forward-looking statements involve risks and uncertainties that could cause actual events or our actual results to differ materially from those expressed in any such forward-looking statements. Readers are directed to Comcast’s periodic and other reports filed with the Securities and Exchange Commission (SEC) for a description of such risks and uncertainties. We undertake no obligation to update any forward-looking statements.\n\nNon-GAAP Financial Measures\n\nIn this discussion, we sometimes refer to financial measures that are not presented according to generally accepted accounting principles in the U.S. (GAAP). Certain of these measures are considered “non-GAAP financial measures” under the SEC regulations; those rules require the supplemental explanations and reconciliations that are in Comcast’s Form 8-K (Quarterly Earnings Release) furnished to the SEC.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights.\n\nVisit www.comcastcorporation.com for more information.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005366/en/\nInvestor Contacts:\nJason Armstrong (215) 286-7972\nJane Kearns (215) 286-4794\n\nPress Contacts:\nD’Arcy Rudnay (215) 286-8582\nJohn Demming (215) 286-8011\nSource: Comcast Corporation"
    },
    {
        "title": "NBCUniversal Unveils Peacock, A Free Premium Ad-Supported Streaming Service With Subscription Tiers",
        "subtitle": "",
        "date": "Jan 16, 2020 4:00PM EST",
        "content": "\nPeacock to Launch April 15 to Comcast’s Xfinity X1 and Flex Customers; Debuts Nationally July 15 \n\nPeacock Strikes Bundled Distribution Deals with Cox and Comcast, Bringing the Service to a Combined Total of More Than 24 Million Initial Subscribers\n\nBrands Including Eli Lilly and Company, State Farm, Target and Unilever Sign on as First Set of Launch Sponsors of Peacock\n\nJuggernaut Law and Order and Chicago Brands From Dick Wolf’s Wolf Entertainment to Stream on Peacock\n\nPeacock Signs Multi-Year Deal With Kevin Hart’s Laugh Out Loud Network\n\nThe Tonight Show Starring Jimmy Fallon and Late Night with Seth Meyers to Stream Early on Peacock Each Day\n\nExclusive Live, Daily Olympic Programming From the 2020 Summer Games Featured on Peacock\n    NEW YORK--(BUSINESS WIRE)--\nAt a Comcast investor presentation held in the iconic Studio 8H of 30 Rock, NBCUniversal unveiled Peacock, a free premium ad-supported streaming service with subscription tiers offering more than 600 movies and 400 series, as well as compelling live and on-demand content across news, sports, late night, and reality. From world-class originals and treasured hits, to blockbuster films and streaming channels, Peacock will offer consumers everything fans love to watch, all in one place.\n\nTaking a different strategic approach, the company announced a tiered offering that gives consumers broad access to Peacock across web, mobile and connected-TV devices:\n\nThe company expects to bundle Peacock Premium with additional partners in the coming months.\n\nPremium customers can upgrade to an ad-free experience for an additional $5.00 per month, or any customer can purchase the ad-free experience directly for $9.99 per month.\n\n“This is a very exciting time for our company, as we chart the future of entertainment,” said Steve Burke, Chairman of NBCUniversal. “We have one of the most enviable collections of media brands and the strongest ad sales track record in the business. Capitalizing on these key strengths, we are taking a unique approach to streaming that brings value to customers, advertisers and shareholders.”\n\n“Peacock will provide consumers with a destination that goes beyond movies and television, aggregating a variety of content that fans want on one service,” said Matt Strauss, Chairman of Peacock and NBCUniversal Digital Enterprises. “By delivering timely and topical content like breaking news, live sports, and watercooler moments from late night, Peacock is uniquely bringing a pulse to the world of streaming that does not exist in today’s marketplace.”\n\nLAUNCH DATES & SUBSCRIBER TARGET:\n\nXfinity X1 and Flex customers will have early bird access to Peacock Premium starting April 15. And beginning July 15, taking full advantage of the massive promotional opportunity of the Tokyo Olympics, Peacock Free and Peacock Premium will be available nationally on popular web, mobile and connected-TV devices. The company expects to reach 30-35 million active accounts by 2024.\n\nBRAND SPONSORS:\n\nPeacock will launch with a select group of top brand sponsors, bringing in hundreds of millions of initial advertising revenue. Peacock’s launch sponsors include Eli Lilly and Company, State Farm, Target and Unilever. Each launch sponsor will have the exclusive opportunity to define Peacock’s new advertising experience to give consumers the best content at the best price: free.\n\nNEW CONTENT ANNOUNCEMENTS:\n\nPeacock announced a broad slate of new, high-profile TV and film acquisitions, as well as a robust programming strategy around late night, sports, kids, news, and more, including:\n\nTV ACQUISITIONS:\n\nPeacock will stream the ratings juggernaut brands from Dick Wolf’s Wolf Entertainment, including “Law and Order,” “Law and Order: SVU,” “Law and Order: Criminal Intent,” “Chicago Fire,” “Chicago P.D.,” and “Chicago Med.” These dramas are consistently among the top-rated shows on television and among the most-streamed shows across platforms.\n\nPeacock will also stream Paramount Network hit series “Yellowstone,” the record-breaking drama, licensed from ViacomCBS. “Yellowstone” is co-created by Taylor Sheridan and John Linson, and is co-produced by David Glasser’s 101 Studios. Additionally, “Two and a Half Men,” and “The George Lopez Show” from Warner Brothers were announced.\n\nAs previously announced, Peacock will offer some of the most popular NBC and classic TV series of all time, including “30 Rock,” “Bates Motel,” “Battlestar Galactica,” “Brooklyn Nine-Nine,” “Cheers,” “Chrisley Knows Best,” “Covert Affairs,” “Downton Abbey,” “Everybody Loves Raymond,” “Frasier,” “Friday Night Lights,” “House,” “Keeping Up with the Kardashians,” “King of Queens,” “Married…With Children,” “Monk,” “The Office,” “Parks and Recreation,” “Parenthood,” “Psych,” “Royal Pains,” “Saturday Night Live,” “Superstore,” and “Will & Grace.”\n\nPEACOCK ORIGINALS:\n\nPeacock has signed a multi-year partnership with Kevin Hart’s Laugh Out Loud network, which includes an equity investment in the company, a first look deal with LOL, and the distribution of LOL’s catalog on the service. As part of the agreement, Laugh Out Loud will produce a Kevin Hart stand-up comedy special and an original interview series called “Hart to Heart,” and a series of short-form content exclusively for Peacock.\n\nAdditional newly announced Peacock originals include Tina Fey-produced original series “Girls5Eva,” about a one-hit-wonder girl group from the 90’s that reunites to give their pop star dreams one more shot; international series from NBCUniversal International Studios, including drama thriller “The Capture,” fresh off its rating success on the BBC in the UK, and comedy “Lady Parts,” launching on Channel 4 in the U.K., as well as three highly anticipated new comedies from Sky Studios: “Intelligence” starring David Schwimmer, “Code 404,” and “Hitmen”; a racing series from Dale Earnhardt Jr.; and a behind-the-scenes documentary series that follows USA Basketball superstars on their journey to Tokyo, produced in partnership with the NBA.\n\nNoteworthy original series in development for Peacock include: “Expecting,” from Mindy Kaling, “Division One,” from Amy Poehler, “Clean Slate,” from Norman Lear and “MacGruber,” from Will Forte.\n\nPreviously announced Peacock scripted originals include comedies such as “Rutherford Falls,” “Saved by the Bell,” “A.P. Bio,” “Punky Brewster,” and the movie spinoff “Psych 2: Lassie Come Home,” as well as dramas “Dr. Death,” “Battlestar Galactica,” “Brave New World,” “Angelyne,” and “Armas de Mujer.”\n\nLATE NIGHT EARLY:\n\nFor the first time ever, fans will get exclusive early access to NBC’s acclaimed late night shows. Starting in July on Peacock Premium, NBC’s late night talk shows will be streaming on Peacock beginning at 8 p.m. ET with “The Tonight Show Starring Jimmy Fallon,” followed by “Late Night with Seth Meyers” at 9 p.m. ET.\n\nSPORTS:\n\nOLYMPICS:\n\nPeacock will give viewers a front-row seat for the most-watched event of 2020, the Tokyo Olympics. Peacock will feature live coverage of the Opening and Closing Ceremonies before they air on NBC in primetime, and three daily Olympic shows including, “Tokyo Live,” with live coverage of one of the day’s most exciting events; “Tokyo Daily Digest,” with mid-day highlights of the Games; and “Tokyo Tonight,” a complement to the primetime show that will help audiences catch up on the day’s events. Peacock will also live stream more than 1,000 hours of exclusive coverage from the Tokyo Paralympics. And following Tokyo, in partnership with the US Paralympic Committee, Peacock will add the Olympic Channel: Home of Team USA, 24/7, 365, featuring live coverage and can’t-miss content as America’s best athletes prepare for the 2022 Winter Olympics and beyond.\n\nPREMIER LEAGUE & RYDER CUP:\n\nBeginning in August 2020, soccer fans will be treated to 2,000 hours of Premier League coverage, including more than 140 matches that aren’t available on television, as well as clips and replays of the most exciting moments from the pitch.\n\nThe Ryder Cup golf tournament will be coming to the service in September 2020 with featured groups of Europe’s and America’s best pairings.\n\nFILM:\n\nPeacock will have the exclusive streaming rights for the 2020 Universal film slate and beyond in the network window. Films will include some of the biggest live action feature films of all time, including “Fast & Furious 9” and “Jurassic World 3.”\n\nThis is in addition to the previously announced premium original films and animated series in development for Peacock from Universal Pictures and DreamWorks Animation, and hundreds of critically-acclaimed films and box-office hits including “American Pie,” “Bridesmaids,” “Knocked Up,” “Meet the Parents,” “Meet the Fockers,” “A Beautiful Mind,” “Back to the Future,” “Brokeback Mountain,” “Casino,” “Dallas Buyers Club,” “Do the Right Thing,” “Erin Brockovich,” “E.T. The Extra Terrestrial,” “Field of Dreams,” “Jaws,” “Mamma Mia!,” “Shrek,” “The Breakfast Club,” and franchises including “Bourne,” “Despicable Me,” and “Fast & Furious.”\n\nKIDS:\n\nPeacock will have access to the first pay window for DreamWorks Animation films “Trolls World Tour,” “The Boss Baby 2,” and “The Croods 2.” \n\nPeacock will also be the exclusive streaming home to new episodes of “Curious George,” one of the most beloved children’s titles in the history of animation.\n\nNew original series from DreamWorks Animation will also stream on Peacock, including “TrollsTopia,” “Madagascar: A Little Wild,” “The Mighty Ones,” “Cleopatra in Space” and “Where’s Waldo?”\n\nAdditionally, popular family film titles from DreamWorks, Illumination Entertainment and Universal Kids will be available on Peacock including “Shrek,” “Shark Tale,” and “Despicable Me.”\n\nNEWS:\n\nUnique among the major streaming services, Peacock will be home to live breaking news coverage – just as all eyes turn to the highly anticipated 2020 presidential election. NBC News NOW, the newly launched streaming network, will bring Peacock viewers “NBC Nightly News with Lester Holt” as well as original video from “TODAY” and across the NBC News portfolio. The longest running show in television history will also be part of the newest streaming platform – with an original offering from “Meet the Press with Chuck Todd” on Peacock each weekday. In addition, NBC News will create signature, original documentaries for Peacock – delving deep into politics, biographies and history. Peacock will also be home to full episodes of “Dateline” – the true crime original. And America’s most-watched news brand will go global, with coverage of the biggest stories shaping the planet as NBC News unveils a brand new international news network in collaboration with Sky.\n\nFor more information about the Comcast NBCUniversal Investor Meeting, please visit www.cmcsa.com.\n\nABOUT PEACOCK:\n\nPeacock (www.peacocktv.com) is NBCUniversal’s new streaming service, launching in 2020. Peacock will deliver a world-class slate of exclusive originals, on-demand libraries of hit TV shows, including two of the most-watched streaming series “The Office” and “Parks and Recreation,” plus critically-acclaimed films from the vaults Universal Pictures, Focus Features, DreamWorks Animation, Illumination and Hollywood’s biggest studios. In addition, Peacock will tap into NBCUniversal’s unmatched ability to deliver a broad range of compelling topical content across news, sports, late-night and reality. NBCUniversal is a subsidiary of Comcast Corporation.\n\nABOUT COMCAST CORPORATION:\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200116005806/en/\nPeacock\nLisa Scalzo\nLisa_Scalzo@comcast.com\n818.395.8443\n\nNBCUniversal Corporate Communications\nHilary Smith\nHilary.Smith@nbcuni.com\n212.664.2617\n\nLauren Skowronski\nLauren.Skowronski@nbcuni.com\n212.664.2432\n\nNBCUniversal Ad Sales\nJoe Benarroch\nJoe.Benarroch@nbcuni.com\n212.664.3215\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast NBCUniversal Launches SportsTech, A Global Accelerator for Sports Technology Startups",
        "subtitle": "",
        "date": "Jan 14, 2020 9:00AM EST",
        "content": "\nUnique international partnership combines Comcast NBCUniversal, one of the world’s largest sports content distributors, with six iconic sports brands and venture capital expertise\n\nApplications open today through May 15; Inaugural class begins in August 2020\n    ATLANTA--(BUSINESS WIRE)--\nComcast NBCUniversal today announced the launch of SportsTech, a global accelerator for sports technology startups. SportsTech will feature an unprecedented partnership of three of Comcast NBCUniversal’s sports brands – NBC Sports, Sky Sports and Golf Channel – alongside NASCAR and two US Olympic sports organizations: U.S. Ski & Snowboard and USA Swimming. Comcast Ventures, the company’s San Francisco-based venture capital arm, will round out the partnership. Each partner will serve on an advisory committee that influences the innovation priorities of SportsTech, and each will provide startups with direct access to strategic industry relationships, mentorship, and partnership opportunities.\n\nEarly stage startups from around the world are encouraged to apply for the inaugural class, which will begin in August, at www.comcastsportstech.com.\n\nBased in The Battery Atlanta/SunTrust Park, where Comcast Cable’s Central Division headquarters are located, the new accelerator is designed to provide sports tech startups with the resources and relationships to succeed by giving them access to a broad international consortium of advisors, a custom sports tech curriculum shaped by industry experts, and investment capital. Partners will have early exposure to emerging sports tech trends and technologies that cross multiple sports, gaining insight into how these technologies can potentially reshape and benefit their businesses.\n\nSportsTech is the third accelerator created by Comcast NBCUniversal in the last three years, joining LIFT Labs Accelerator, powered by TechStars, based out of the company’s global headquarters at the Comcast Technology Center in Philadelphia, and The Farm, powered by Boomtown, located in Atlanta.\n\n“We are delighted to introduce SportsTech to our suite of accelerators to help founders build sports technology and products, refine their business models, tell their stories, and benefit from the unique assets and talent of Comcast NBCUniversal,” said Sam Schwartz, Chief Business Development Officer, Comcast Cable. “Comcast NBCUniversal has some of the most prominent sports brands and we are excited to partner with founders through SportsTech.”\n\n“The demand for sports technology across the globe has never been greater, yet most sports startups don’t have access to the resources they need to succeed nor an ability to develop relationships with the right people inside the industry,” said Jenna Kurath, Vice President of Startup Partner Development, Comcast Cable. “SportsTech will provide the curriculum and platform for founders to develop their ideas while obtaining mentorship from leaders in multiple sports, enabling them to further deploy their technologies to dramatically improve sports experiences for athletes and audiences alike.”\n\nBeginning in August 2020, SportsTech will offer a three-month custom-tailored program for up to 10 startups. Initial focus areas will include technologies and products in several key categories:\n\nThe deadline to submit an application for SportsTech is May 15. The selected startups will reside in Atlanta for the duration of the program, operating out of SportsTech’s flagship location at The Battery at SunTrust Park, where Comcast’s The Farm accelerator is also based. It will be directed by Boomtown Accelerators, a leading accelerator program headquartered in Boulder, CO. Boomtown operates The Farm for Comcast NBCUniversal and has established itself as a preeminent home for early-stage startups.\n\nComcast NBCUniversal has a proud history of supporting founders and startup communities, dating back to its own founder Ralph Roberts, who had the vision to see how a small cable startup in 1963 could transform into one of the most innovative global media and technology companies. In addition to SportsTech and The Farm, run at the Central Division in Atlanta, the company also offers the Comcast NBCUniversal LIFT Labs Accelerator. Both accelerators are currently accepting applications for startups from around the world to build and refine their business. To learn about the 2020 focus areas and apply, visit www.ComcastNBCULIFT.com and www.TheFarmATL.com.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005182/en/\nBrian Farley\nComcast\nBrian_Farley@cable.comcast.com\n770 825 1438 (mobile)\n\nMatthew Mirandi\nBerk Communications\nmatthew@berkcommunications.com\n201 575 9605 (mobile)\nSource: Comcast Corporation"
    },
    {
        "title": "Marci Ryvicker to Join Comcast Corporation as Senior Vice President, Investor Relations",
        "subtitle": "",
        "date": "Jan 8, 2020 12:30PM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation announced today that Marci Ryvicker will join the company as Senior Vice President, Investor Relations, in mid-January. She will report to Mike Cavanagh, Chief Financial Officer of Comcast Corporation.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200108005621/en/Marci Ryvicker to Join Comcast Corporation as Senior Vice President, Investor Relations (Photo: Business Wire)\n“Marci has tremendous expertise in the media, technology, cable, and broadcast industries, and is one of the most well-known and highly-respected analysts on Wall Street,” said Mr. Cavanagh. “I look forward to her bringing her leadership and talents to our strong investor relations and finance teams, which do a terrific job communicating our company strategy to the analyst and shareholder communities.”\n\nPrior to joining Comcast, Ms. Ryvicker was a Managing Director and Senior Equity Analyst at Wolfe Research. Previously, she spent 16 years leading the Media research practice as a Managing Director and Senior Equity analyst at Wells Fargo Securities with a specific focus on diversified entertainment, broadcast, cable, and satellite. During her tenure at Wells Fargo, she was ranked as the top research analyst in its internal client and sales polls 2012-2018. She has also been recognized as a top analyst by Institutional Investor magazine. Ms. Ryvicker began her career as a certified public accountant at PricewaterhouseCoopers, LLC. She earned a BS in Economics from The Wharton School of the University of Pennsylvania and an MBA from Harvard Business School.\n\nMs. Ryvicker succeeds Jason Armstrong, who was recently promoted to Group Chief Financial Officer at Sky, effective February 1, 2020.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005621/en/\nInvestor Contacts:\nJason Armstrong\n(215) 286-7972\nJason_Armstrong@Comcast.com\n\nGreg Horn\n(215) 286-8347\nGreg_Horn@Cable.Comcast.com\n\nJane Kearns\n(215) 286-4794\nJane_Kearns@Comcast.com\n\nMedia Contact:\nJohn Demming\n(215) 286-8011\nJohn_Demming@Comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Xfinity Gives Advanced Cybersecurity to 18 Million xFi Customers for Free",
        "subtitle": "",
        "date": "Jan 6, 2020 5:00PM EST",
        "content": "\n      Only Provider to Offer this $72 Annual Value for No Additional Cost\n    \n      Customers Can Now Protect All of Their Connected Devices in a Matter\n      of Minutes\n        PHILADELPHIA--(BUSINESS WIRE)--\n      Cybersecurity is a top priority for Xfinity customers and the majority\n      of U.S. consumers. With that in mind, Comcast announced today that xFi\n      Advanced Security, a feature that automatically protects devices from\n      online threats, will be included free for customers who lease an xFi\n      gateway. Comcast is the only provider to offer this service at no\n      additional cost – a $72 annual value.\n    \nThis press release features multimedia. View the full release here:\nhttps://www.businesswire.com/news/home/20200106005674/en/\nComcast announced that xFi Advanced Security will be included free for customers who lease an xFi gateway. (Photo: Business Wire)  \n      New customers will receive Advanced Security immediately upon activating\n      an xFi Gateway, and the feature will begin rolling out to 18 million\n      existing eligible xFi customers over the coming weeks. It requires no\n      software download or additional set-up other than logging into xFi via\n      the mobile app or online, making it simple and easy to protect wired and\n      WiFi connected devices in the home; including smart TVs or thermostats,\n      or devices without keyboards or screens like security cameras or smart\n      speakers.\n    \n      Key features include:\n    \n      “We want you to have the peace of mind to know that in just a few\n      minutes all the devices you connect in the home, and the people that\n      use them, are safe and secured,” said Dana Strong, President of Xfinity\n      Consumer Services, Comcast. “Our customers asked for a better way to\n      stream content and we answered with Xfinity Flex for free. Now, we’re\n      giving them the protection they asked for with Advanced Security. That’s\n      an incredible amount of value for our internet customers, and we’re just\n      getting started.”\n    \n      Advanced Security, initially launched in January 2019 as an optional\n      $5.99 upgrade, was developed based on customer feedback requesting a way\n      to protect IoT devices in this smart home era. It uses AI and machine\n      learning technology to monitor and analyze WiFi traffic in the home, and\n      automatically blocks identified suspicious activity in real time.\n    \n      It is the latest addition to Comcast’s Xfinity\n      xFi platform, which gives customers a simple, digital dashboard to\n      set up and manage their home WiFi networks and see what devices are\n      connected, set parental\n      controls, get notifications\n      about activities on the home network, and even pause\n      WiFi access to certain devices during dinner or bedtime. xFi users\n      can also ensure whole-home WiFi coverage by adding xFi\n      Pods; small, easy to install devices that plug into any electrical\n      outlet and extend connectivity to hard to reach areas of their home.\n      And, now with Xfinity\n      Flex, customers can easily manage streaming entertainment and\n      connected devices on the television using the award-winning Xfinity\n      Voice Remote.\n    \n      For more information about xFi Advanced Security and all of the ways\n      Comcast is providing more value to its internet customers subscription,\n      visit www.comcastcorporation.com/CES.\n    \n      About Comcast\n    \n      Comcast Corporation (Nasdaq: CMCSA) is a global media and technology\n      company with three primary businesses: Comcast Cable, NBCUniversal, and\n      Sky. Comcast Cable is one of the United States’ largest high-speed\n      internet, video, and phone providers to residential customers under the\n      Xfinity brand, and also provides these services to businesses. It also\n      provides wireless and security and automation services to residential\n      customers under the Xfinity brand. NBCUniversal is global and operates\n      news, entertainment and sports cable networks, the NBC and Telemundo\n      broadcast networks, television production operations, television station\n      groups, Universal Pictures, and Universal Parks and Resorts. Sky is one\n      of Europe's leading media and entertainment companies, connecting\n      customers to a broad range of video content through its pay television\n      services. It also provides communications services, including\n      residential high-speed internet, phone, and wireless services. Sky\n      operates the Sky News broadcast network and sports and entertainment\n      networks, produces original content, and has exclusive content rights.\n      Visit www.comcastcorporation.com for\n      more information.\n    \n    View source version on businesswire.com: https://www.businesswire.com/news/home/20200106005674/en/\n      Joel Shadle, Comcast215-286-4675joel_shadle@comcast.com\n    \n      Rachel Zabinski215-286-1516Rachel_zabinski@comcast.com\n    \n    Source: Comcast Corporation"
    },
    {
        "title": "Applications Open for the Comcast NBCUniversal LIFT Labs Accelerator, Powered by Techstars",
        "subtitle": "",
        "date": "Jan 6, 2020 10:00AM EST",
        "content": "\nStartups working on breakthroughs in connectivity, media, and entertainment for all abilities are focus of third program in Philadelphia\n    PHILADELPHIA--(BUSINESS WIRE)--\nComcast NBCUniversal LIFT Labs Accelerator, powered by Techstars, announced today it is now accepting applications for its next program and is seeking startup companies developing the next generation of connectivity, media, and entertainment technologies from around the world. Founders are encouraged to apply now through April 5, 2020 for this year’s program that begins July 13, 2020 at the Comcast Technology Center in Philadelphia.\n\nThe accelerator is part of Comcast NBCUniversal LIFT Labs, a collection of programs that gives talented entrepreneurs access to Comcast’s, NBCUniversal's, and Sky’s renowned network of partners, brands, and mentors to foster rapid product innovation breakthroughs. Since its launch in 2018, 21 companies from around the world have completed the program, with 15 of them securing pilots or proofs of concept with Comcast NBCUniversal brands. Founders have hailed from multiple countries and more than half were women or people of color.\n\n“The Comcast NBCUniversal LIFT Labs Accelerator is a unique program that offers entrepreneurs an exclusive opportunity to collaborate with mentors from across Comcast, NBCUniversal, and Sky through a variety of workshops, training sessions, and personalized business development plans,” said Sam Schwartz, Chief Business Development Officer. “In just two years, the program has produced phenomenal alumni companies who have gone on to secure pilot programs and venture capital funding, while building their independent businesses. Entrepreneurialism and innovation are embedded in what we do at Comcast NBCUniversal, and we are excited to discover this year’s class of founders.”\n\nSpecific focus areas for 2020 include:\n\nThe accelerator is focused on startups utilizing innovative technologies including, but not limited to, accessibility tech; enhanced broadband connectivity; artificial intelligence; machine learning; blockchain; voice control; virtual, augmented, and mixed reality.\n\nComcast NBCUniversal and Techstars will select up to 12 startups to participate in this immersive 13-week program with Demo Day scheduled for October 1, 2020 in the Ralph J. Roberts Forum at Comcast Technology Center in Philadelphia. The startups will work directly with mentors and product experts from across Comcast NBCUniversal’s businesses, including the XFINITY technology, products, and services teams; NBC owned stations; cable networks; Sky; Universal Studios; Universal Theme Parks; DreamWorks Animation; Illumination; Comcast Business; Strategic Development; Comcast Spectacor (including esports joint venture T1 Entertainment & Sports and professional esports team Philadelphia Fusion); Comcast Ventures; and LIFT Labs, as well as mentors from Techstars’ expansive network. The companies also receive access to workspace for a year in LIFT Labs PHL in the Comcast Technology Center in Philadelphia.\n\nTechstars’ KJ Singh will serve as the Managing Director of the 2020 accelerator for the second year, leveraging his extensive business experience to help lead the program’s strategy, and recruit, select, and elevate the class, working in collaboration with the Comcast NBCUniversal LIFT Labs team led by Danielle Cohn, Vice President, Entrepreneurial Engagement and Head of LIFT Labs. During the program, he will advise the companies on product and market fit, growth tactics, fundraising strategies, and other topics.\n\n“I am super excited about running this year’s Comcast NBCUniversal LIFT Labs Accelerator, powered by Techstars. It’s very clear that this is a special program,” said KJ Singh, Managing Director, Comcast NBCUniversal LIFT Labs Accelerator, powered by Techstars. “Founders get access to mentorship from Techstars as well as Comcast, NBCUniversal, and Sky at the most senior level. Applying to this program is a smart choice for founders looking to get access to key decision makers at a leading Fortune 40 company.”\n\nSumorwuo Zaza, Founder and CEO of NICKL PASS, and alumni of the 2019 Comcast NBCUniversal LIFT Labs Accelerator, powered by Techstars, said of his experience: “I encourage anyone who wants to be more bold, more ambitious and more impactful in what they are building to apply. You have access to incredible leaders who give you feedback and advice, which can supercharge you in a meaningful way.”\n\nComcast has a long history of supporting startup communities, and LIFT Labs is just one of the many ways in which entrepreneurs can gain valuable access and insights to Comcast NBCUniversal. Comcast launched its first venture arm, Comcast Interactive Capital, in 1999, which was combined with NBCUniversal’s Peacock Fund in 2011 to form Comcast Ventures and has since grown into one of the most active corporate venture arms in the country. For more information, including access to free resources, visit www.ComcastNBCULIFT.com or follow @LIFT_Labs on Twitter.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\n\nAbout Techstars\n\nTechstars is the worldwide network that helps entrepreneurs succeed. Techstars founders connect with other entrepreneurs, experts, mentors, alumni, investors, community leaders, and corporations to grow their companies. Techstars operates three divisions: Techstars Startup Programs, Techstars Mentorship-Driven Accelerator Programs, and Techstars Corporate Innovation Partnerships. Techstars accelerator portfolio includes more than 1,600 companies with a market cap of $16.1 Billion. www.techstars.com\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005135/en/\nJennifer Sala\nComcast Corporation\n215-286-8403\nJennifer_Sala@comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Announces Redemption of $1.49 Billion of 4.60% Senior Notes Due February 2046",
        "subtitle": "",
        "date": "Dec 18, 2019 9:30AM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation (Nasdaq: CMCSA) announced today it has elected to exercise its option to redeem on February 1, 2020 (to be paid on February 3, 2020) all $1.49 billion principal amount outstanding of its 4.60% Senior Notes due February 1, 2046 (ISIN No. XS1327147119) at a redemption price equal to 100% of the principal amount of the Notes being redeemed plus any accrued and unpaid interest to, but not including, the redemption date. The Notes are traded on the Taipei Exchange. The Bank of New York Mellon Trust Company, N.A. is the trustee for the Notes.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191218005456/en/\nInvestors:\nJason Armstrong (215) 286-7972\nGreg Horn (215) 286-8347\nJane Kearns (215) 286-4794\nSource: Comcast Corporation"
    },
    {
        "title": "NBCUniversal CEO Steve Burke to Retire in August 2020, on the Heels of Unprecedented Growth at the Company",
        "subtitle": "",
        "date": "Dec 16, 2019 8:30AM EST",
        "content": "\nJeff Shell Named CEO of NBCUniversal, Effective January 2020\n    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation (Nasdaq: CMCSA) today announced that NBCUniversal CEO Steve Burke will retire on August 14, 2020, following the Summer Olympics in Tokyo. Effective January 1, 2020, Jeff Shell will become CEO of NBCUniversal, reporting to Burke, who will move to the role of Chairman, NBCUniversal. Upon Burke’s retirement, Shell will report directly to Brian Roberts, Chairman and CEO of Comcast.\n\n“I cannot thank Steve enough for the incredible impact he has had on this entire company. I will miss Steve’s trusted partnership, and I know I speak for both myself and my late father Ralph when I say that we will be forever grateful to him for shaping first Comcast and then NBCUniversal into the great companies they are today. When Comcast acquired NBCUniversal in 2011, I never imagined it would become the fastest growing media company. Steve’s leadership and the team that he built has had everything to do with this outstanding performance,” said Mr. Roberts.\n\nMr. Roberts continued, “Jeff Shell is the ideal executive to take the helm at NBCUniversal. He has a stellar track record across both the film and TV side of the business, as well as a wealth of international experience. I have worked closely with Jeff for many years and he is an extraordinary leader who inspires loyalty, delivers strong results and cares deeply about our company, its employees and partners. I could not be more confident in his ability to lead NBCUniversal into the future.”\n\nMr. Burke commented, “It has been a privilege to work so closely with Brian for the last 22 years, and particularly to have had the opportunity to lead NBCUniversal for the last nine. This is a very special company and I am proud of the people I have worked with and the things we have accomplished together. While this has been a dream job, it has always been my plan to hand off the baton at the right moment and move on to the next chapter of my life where I can pursue a different set of interests. It is great to know I am leaving the company in terrific hands with Jeff, who is the right leader to usher in the next phase of growth and success for NBCUniversal.”\n\nMr. Shell added, “It is truly an honor to step into this role, and I am excited that Brian and the Comcast board are giving me the incredible opportunity to help steer the future of NBCUniversal. I’m sincerely grateful to Steve, who has been an amazing boss and mentor for the last 15 years and leaves behind an extraordinary legacy of visionary leadership and success. I look forward to building on this strong track record and partnering with the many talented leaders across the company.”\n\nBurke has presided over NBCUniversal during a time of unprecedented growth and achievements for the company. Under his leadership, NBCUniversal increased its adjusted EBITDA from $3.4 billion to $8.6 billion since the Comcast acquisition of NBCUniversal in 2011 through 2018 – achieving the fastest annual growth rate of any major media company.\n\nAgainst the backdrop of the most competitive content landscape in history, the television networks of NBCUniversal enjoyed record success. NBC ascended from fourth place to number one, winning the primetime season for six years in a row. The cable networks achieved record profit levels, with USA Network continuing its reign as the number one cable entertainment network. The news division reached new heights with all four NBC News programs ranking number one, while MSNBC enjoyed tremendous success as one of the fastest growing cable networks. Additionally, Telemundo eclipsed Univision as the number one Spanish-language network in primetime.\n\nThe film business also achieved new milestones, as Universal Pictures had a string of blockbusters that yielded two of the most profitable years in the studio’s 107-year history, thanks to a successful franchise strategy and a key partnership with Illumination that spawned hits such as Fast & Furious, Jurassic World and Despicable Me.\n\nIn a strategic move to double the company’s animated film output, Burke helped engineer the acquisition of DreamWorks Animation, home to Shrek, Kung Fu Panda, How to Train Your Dragon, Boss Baby and countless other hits.\n\nThe company’s success in animated film created new IP that became the basis from some of the most popular theme park attractions at Universal Parks and Resorts, which helped transform this business into one of NBCUniversal’s biggest growth drivers. The Parks business also underwent a fruitful expansion, with the opening of the Volcano Bay water park in Orlando, the extraordinarily popular Harry Potter attractions, and five new hotels.\n\nUnder Burke’s leadership, the company won the broadcast rights for the Olympics in a landmark deal that locked in the games for NBC Sports through 2032. Over the years, the Games have been the most-watched television events of the year – from London to Sochi to Rio – and have generated record profits.\n\nOne of the hallmarks of Burke’s tenure at the company was the collaborative culture he created. Burke designed a cross-company effort, nicknamed “Symphony,” where every NBCUniversal brand, in addition to Comcast, puts its promotional muscle behind a singular marketing priority. This initiative has yielded some of the biggest box office hits, TV series premieres and higher theme park attendance.\n\nPrior to running NBCUniversal, Burke served as Chief Operating Officer of Comcast, following 11 years as President of its cable division. There, he helped grow the company into the largest cable and internet provider and led the highly successful integration of AT&T Broadband with Comcast.\n\nBefore Comcast, Burke held several leadership roles at The Walt Disney Company, including as President of ABC Broadcasting, and President and Chief Operating Officer of Euro Disney S.A. Burke serves on the board of directors of Berkshire Hathaway Inc., and J.P. Morgan Chase & Co.\n\nJeff Shell currently oversees the company’s film and network television businesses including NBC Entertainment, Universal Filmed Entertainment Group (UFEG), Telemundo and NBCUniversal International. Prior to that, he served as Chairman of UFEG and led the film division to record profit crossing the $5 billion mark in global box office in both 2015 and 2017.\n\nPreviously, as Chairman of NBCUniversal International, Shell managed all aspects of NBCUniversal’s international businesses including International TV Distribution, Global Television Networks and International Television Production. He also oversaw, in partnership with their domestic leaders, CNBC International, International Theatrical Marketing and Distribution, International Home Entertainment and International Theme Parks Operations.\n\nPrior to joining NBCUniversal, Shell served as President of Comcast Programming Group where he was responsible for managing Comcast’s national and regional television networks including E! Entertainment Network, the Golf Channel, International Channel Networks, and Comcast Sports Group. Under his leadership, Comcast’s networks grew significantly in distribution, viewership and profitability during his six-year tenure.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191216005205/en/\nInvestor Contacts:\nJason Armstrong\n(215) 286-7972\nJason_Armstrong@Comcast.com\n\nGreg Horn\n(215) 286-8347\nGreg_Horn@Cable.Comcast.com\n\nJane Kearns\n(215) 286-4794\nJane_Kearns@Comcast.com \n\nMedia Contacts:\nHilary Smith\n(212) 664-2617\nHilary.Smith@NBCUni.com\n\nJohn Demming\n(215) 286-8011\nJohn_Demming@Comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast to Host Fourth Quarter and Full Year 2019 Earnings Conference Call",
        "subtitle": "",
        "date": "Dec 12, 2019 2:00PM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nComcast Corporation will host a conference call with the financial community to discuss financial results for the fourth quarter and full year 2019 on Thursday, January 23, 2020 at 8:30 a.m. Eastern Time (ET). Comcast will issue a press release reporting its results earlier that morning.\n\nThe conference call will be broadcast live on Comcast’s Investor Relations website at www.cmcsa.com. Those parties interested in participating via telephone should dial (800) 263-8495 with the conference ID number 3469916.\n\nA replay of the call will be available starting at 12:00 p.m. ET on Thursday, January 23, 2020 on the Investor Relations website or by telephone. To access the telephone replay, which will be available until Thursday, January 30, 2020 at midnight ET, please dial (855) 859-2056 and enter the conference ID number 3469916.\n\nTo automatically receive Comcast financial news by email, please visit our Investor Relations website and subscribe to Email Alerts.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191212005628/en/\nInvestor Contacts:\nJason Armstrong (215) 286-7972\nGreg Horn (215) 286-8347\nJane Kearns (215) 286-4794\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Partners With NuEyes to Enable Customers With Visual Disabilities to See TV With Smartglasses",
        "subtitle": "",
        "date": "Dec 11, 2019 12:00PM EST",
        "content": "\nCompanies work together to integrate Comcast’s Xfinity Stream into NuEyes smart assistive technology\n    PHILADELPHIA--(BUSINESS WIRE)--\nComcast today announced a partnership with wearable technology startup NuEyes to bring the Xfinity Stream entertainment viewing experience to visually impaired customers through NuEyes virtual reality technology. The Xfinity Stream app, which allows customers to watch live TV and On Demand content on any device, is now available on the NuEyes e2 smartglasses and VR magnifying device that enhances the usable vision of a person who is visually impaired. Xfinity Stream is pre-installed on NuEyes e2, allowing users with visual disabilities to see TV shows, news, movies, live sports, and more, independently.\n\nFounded by a veteran, NuEyes’ mission is to give millions of people across the U.S. who are visually impaired the independence they may have lost due to conditions like macular degeneration, glaucoma, and retinitis pigmentosa. The lightweight design of the NuEyes e2, paired with handsfree and wireless functionality, gives people with low vision the ability to participate in their everyday lives in ways that were once difficult or impossible, like clearly seeing loved ones’ faces, reading, cooking and enjoying television.\n\n“Being blind since birth, I know firsthand the power of technology to enhance independence,” said Tom Wlodkowski, Vice President of Accessibility at Comcast. “Our partnership with NuEyes is an extension of our commitment to designing great entertainment experiences for people of all abilities.”\n\nJames Baldwin, an 18-year Army Veteran, began losing his vision three years ago due to an injury sustained during his service. He lives with a prosthetic left eye and limited vision in his right eye. James was one of the first customers to experience Xfinity Stream on NuEyes e2, allowing him to watch TV again for the first time in years. You can watch James' story here, including James’ reaction to seeing his wife Claudia, a fellow blind veteran, for the first time using NuEyes.\n\n“Collaborating with Comcast has been an absolute joy,” said Mark Greget, Founder and CEO of NuEyes. “To be able to stream content directly to our consumers’ eyes in a way that has never been done before enables millions of visually impaired people to continue enjoying their TV experience and more.”\n\nOver the past several years, Comcast launched the industry’s first talking TV guide, introduced a voice-activated remote control, launched X1 eye control for the TV and produced the first live entertainment show in U.S. broadcast history, The Wiz Live, to be accessible to people with a visual disability. Comcast also has a service center specifically dedicated to customers with disabilities where agents are specially trained in the company’s accessibility features and general support issues.\n\nAbout NuEyes Technologies Inc. \n\nNuEyes is a veteran-owned technology company based in Orange County, California, that was launched in January 2016 to assist those with eye conditions such as macular degeneration, glaucoma and retinitis pigmentosa via a mobile, wireless and light-weight solution. Over the past two years, the company has seen extensive sales growth and has won awards at CES and also obtained federal, state and insurance reimbursement for its devices. NuEyes is excited to bring such advanced products to market that will leapfrog the technology currently available for someone dealing with legal blindness. With the leadership of NuEyes having over 16 years of combined experience in this space, we understand what it takes to successfully bring a new product to market.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest video, high-speed internet, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005559/en/\nKate Panarese\nComcast Corporation\n215-286-2754\nKate_Panarese@Comcast.com\n\nRegina Chatman\nNuEyes Technologies Inc.\n800-605-4033\nregina@nueyes.com\nSource: Comcast Corporation"
    },
    {
        "title": "FCC Chairman Pai and CRTC Chairman Scott Complete First International Authenticated STIR/SHAKEN Calls Using Xfinity Voice and Telus Wireless",
        "subtitle": "",
        "date": "Dec 9, 2019 1:43PM EST",
        "content": "\nMilestone Marks Another Breakthrough in the Fight to Protect Consumers from Fraudulent Robocalls\n    PHILADELPHIA--(BUSINESS WIRE)--\nToday, U.S. FCC Chairman Ajit Pai, and Canada’s CRTC Chairman Ian Scott completed the first-of-their-kind end-to-end international authenticated calls using the STIR/SHAKEN protocol using Xfinity Voice and Telus wireless phone services. The milestone represents another breakthrough in the fight to protect consumers from fraudulent robocalls.\n\nCaller ID spoofing is a widespread problem that causes significant harm to American consumers. The FCC has cited predictions that, by the end of 2019, over 44 percent of all calls to mobile phones will be scam calls, and that nine out of 10 scam calls will be spoofed so that they appear to come from a familiar area code.\n\n“Comcast has been at the forefront of these efforts from day one, and will continue working diligently to eradicate the nuisance calls that have plagued consumers for years,” said Tony Werner, President of Technology, Product and Xperience, Comcast Cable. “We applaud Chairman Pai and the FCC’s leadership to protect consumers by working with voice providers like Xfinity to pave the way for broader implementation of STIR/SHAKEN and other robocall mitigation techniques.”\n\nSTIR (Secure Telephony Identity Revisited) and SHAKEN (Secure Handling of Asserted information using toKENs) is a revolutionary emerging technology that enables voice providers to “sign” and “verify” caller ID information, thus preventing bad actors from manipulating or “spoofing” caller ID information in an effort to deceive and defraud consumers.\n\nThe protocol’s deployment has been implemented steadily for domestic calls. Comcast, for instance, announced in March of 2019 that it had completed the first exchange of authenticated calls under the STIR/SHAKEN protocol with AT&T, and announced in April that it had begun exchanging authenticated calls with T-Mobile.\n\nWhile these efforts are making a difference domestically, a large number of fraudulent spoofed robocalls originate from overseas, prompting a need for cross-border coordination on caller ID authentication. The groundbreaking, fully authenticated calls between Chairman Pai and Chairman Scott—involving two voice providers from different countries—illustrate that it is possible to extend the substantial benefits of STIR/SHAKEN to international calls and open a new front in consumer protection.\n\nFor more information about what Comcast is doing to fight robocalls, visit www.corporate.comcast.com.\n\nAbout Comcast\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005701/en/\nMedia Contact:\nJoel Shadle, Comcast\n215-286-4675\njoel_shadle@comcast.com\nSource: Comcast Corporation"
    },
    {
        "title": "Comcast Unveils Three New Xfinity Stores in Two New Locations Plus One Remodel in December",
        "subtitle": "",
        "date": "Dec 9, 2019 12:48PM EST",
        "content": "\nLatest stores deliver a new level of customer experience \n    BEAVERTON, Ore.--(BUSINESS WIRE)--\nComcast is announcing the imminent opening of three brand-new Xfinity stores in the Portland metro area – two in new locations -- and the re-reopening of a newly remodeled store. These stores are an important component of Comcast’s strategic efforts to transform the customer experience, with the ultimate goal of ensuring that the majority of customers can get to an Xfinity store in 15 minutes or less.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191209005659/en/New Xfinity Store in Happy Valley at Clackamas Mall Set to Open December 12. (Photo: Business Wire)\n“This is a significant expansion of our retail presence in the Portland metro area,” said David Tashjian, Regional Vice President of Comcast Oregon/SW Washington. “Our new Xfinity stores provide a best-in-class customer experience, designed to encourage customers to explore, learn about and interact with the latest Xfinity products and services.”\n\nOpening on Dec. 12, the Happy Valley Xfinity store at the Clackamas Mall (12130 SE 82nd Ave. Suite H241) will replace the Xfinity store on SE Oak Street in Milwaukie, which will close on Dec. 11. The new 4,700-square-foot retail center will feature enhanced demonstration displays to enable customers to interact with products, along with the entire suite of Xfinity home security products and mobile phones.\n\nAnother new Xfinity store will open at Eastport Plaza (4124 SE 82nd Ave, Suite 500) on Dec. 23, just in time for last-minute holiday shopping. “This is a new neighborhood for us,” said Matt Quantz, Vice President of Sales and Marketing for Comcast Oregon/SW Washington. “We’re thrilled with this location which will better meet the needs of new and existing customers in southeast Portland.”\n\nIn Hillsboro, customers will appreciate the completely remodeled Xfinity store at its original location on NW 185th Ave. Opening Dec. 21, the store features a more spacious floorplan, additional customer seating, and hands-on technologies and displays. And in the rapidly expanding area of South Hillsboro, residents will have a new Xfinity store to explore at the Sunset Esplanade at 2231 SE TV Highway. That store will open on Dec. 19.\n\n“All our new – and remodeled – Xfinity stores feature iPads for individual demonstrations of our products and services,” said Quantz. “Our associates love showing customers the latest features of our award-winning X1 voice remote, Xfinity apps that help customers manage their accounts and services, and how they can integrate their Netflix and Amazon Prime accounts into our easy-to-navigate platform.”\n\nQuantz is also excited about Xfinity Flex, a brand-new technology that enables Xfinity Internet customers access to a 4K UHD streaming device, the X1 voice remote and over 10,000 free movies and shows. Said Quantz, “Flex enables customers to bring all their streaming content into one place, eliminating the need to pogo stick among streaming apps and remember various passwords. And it’s no additional cost for Xfinity Internet-only customers.”\n\nAll Xfinity stores are open from 10 a.m. to 8 p.m. Monday through Saturday and 11 a.m. to 6 p.m. on Sundays. On Christmas Eve (Dec. 24) stores will close at 4 p.m. and will remain closed on Dec. 25, Christmas Day. New Year’s Eve (Dec. 31) stores will also close at 4 p.m. and re-open on Jan. 1, New Year’s Day, at 11 a.m.\n\nAbout Comcast Corporation\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest video, high-speed internet, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005659/en/\nMedia Contacts:\nAmy Keiter\nComcast\n503-605-6350\nAmy_Keiter@comcast.com\n\n\nChet Murray\nLEWIS\n781-418-2469\nchet.murray@teamlewis.com\nSource: Comcast Corporation"
    }
]