[
    {
        "title": "Copart Reports Second Quarter Fiscal 2020 Financial Results",
        "subtitle": "",
        "date": "Feb 19, 2020 5:55PM EST",
        "content": "    DALLAS--(BUSINESS WIRE)--\nCopart, Inc. (NASDAQ: CPRT) today reported financial results for the quarter ended January 31, 2020.\n\nFor the three months ended January 31, 2020, revenue, gross profit, and net income were $575.1 million, $259.9 million, and $168.7 million, respectively. These represent an increase in revenue of $90.2 million, or 18.6%; an increase in gross profit of $51.7 million, or 24.8%; and an increase in net income of $37.3 million, or 28.4%, respectively, from the same period last year. Fully diluted earnings per share for the three months were $0.71 compared to $0.55 last year, an increase of 29.1%.\n\nFor the six months ended January 31, 2020, revenue, gross profit, and net income were $1.1 billion, $514.8 million, and $386.9 million, respectively. These represent an increase in revenue of $183.3 million, or 19.4%; an increase in gross profit of $110.6 million, or 27.4%; and an increase in net income of $141.4 million, or 57.6%, respectively, from the same period last year. Fully diluted earnings per share for the six months were $1.62 compared to $1.01 last year, an increase of 60.4%.\n\nExcluding the impact of discrete income tax items, disposal of non-operating assets, foreign currency-related gains, certain income tax benefits and payroll taxes related to accounting for stock option exercises, and the effect on common equivalent shares from ASU 2016-09, non-GAAP fully diluted earnings per share for the three and six months ended January 31, 2020 and 2019, were $0.65, $0.52, $1.30 and $0.99, respectively. A reconciliation of non-GAAP financial measures to the most directly comparable financial measures computed in accordance with U.S. generally accepted accounting principles (GAAP) can be found in the tables attached to this press release.\n\nOn Thursday, February 20, 2020, at 11 a.m. Eastern Time, Copart will conduct a conference call to discuss the results for the quarter. The call will be webcast live and can be accessed at http://stream.conferenceamerica.com/copart022020. A replay of the call will be available through April 20, 2020 by calling (877) 919-4059. Use confirmation code: 44749280.\n\nAbout Copart\n\nCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart’s innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. Copart offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters, and in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers and also sells vehicles sourced from individual owners. With operations at over 200 locations in 11 countries, Copart has more than 150,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), Brazil (Copart.com.br), the Republic of Ireland (Copart.ie), Germany (Copart.de), Finland (Copart.fi), the United Arab Emirates, Oman and Bahrain (Copartmea.com), and Spain (Copart.es). For more information, or to become a Member, visit Copart.com/Register.\n\nUse of Non-GAAP Financial Measures\n\nIncluded in this release are certain non-GAAP financial measures, including non-GAAP net income per diluted share, which exclude the impact of discrete income tax items, disposal of non-operating assets, foreign currency-related gains, certain income tax benefits and payroll taxes related to accounting for stock option exercises, and the effect on common equivalent shares from ASU 2016-09. These non-GAAP financial measures do not represent alternative financial measures under GAAP. In addition, these non-GAAP financial measures may be different from non-GAAP financial measures used by other companies. Furthermore, these non-GAAP financial measures do not reflect a comprehensive view of Copart’s operations in accordance with GAAP and should only be read in conjunction with the corresponding GAAP financial measures. This information constitutes non-GAAP financial measures within the meaning of Regulation G adopted by the U.S. Securities and Exchange Commission. Accordingly, Copart has presented herein, and will present in other information it publishes that contains these non-GAAP financial measures, a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures.\n\nCopart believes the presentation of non-GAAP net income per diluted share included in this release in conjunction with the corresponding GAAP financial measures provides meaningful information for investors, analysts and management in assessing Copart’s business trends and financial performance. From a financial planning and analysis perspective, Copart management analyzes its operating results with and without the impact of discrete income tax items, disposal of non-operating assets, foreign currency-related gains, certain income tax benefits and payroll taxes related to accounting for stock option exercises, and the effect on common equivalent shares from ASU 2016-09.\n\nCautionary Note About Forward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of federal securities laws, and these forward-looking statements are subject to substantial risks and uncertainties. These forward-looking statements are subject to certain risks, trends and uncertainties that could cause actual results to differ materially from those projected or implied by our statements and comments. For a more complete discussion of the risks that could affect our business, please review the “Management’s Discussion and Analysis” and the other risks identified in Copart’s latest Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K, as filed with the Securities and Exchange Commission. We encourage investors to review these disclosures carefully. We do not undertake to update any forward-looking statement that may be made from time to time on our behalf.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219006043/en/\nMelissa Hunter, Executive Support Manager, Office of the Chief Financial Officer\n972-391-5090 or melissa.hunter@copart.com\nSource: Copart, Inc."
    },
    {
        "title": "Copart, Inc. to Webcast Second Quarter Fiscal 2020 Results",
        "subtitle": "",
        "date": "Feb 14, 2020 12:26PM EST",
        "content": "    DALLAS--(BUSINESS WIRE)--\nCopart, Inc. (NASDAQ: CPRT) announced today that it will release earnings for the second quarter of fiscal 2020 after the close of market on Wednesday, February 19, 2020.\n\nOn Thursday, February 20, 2020, at 11:00 a.m. Eastern Time (10:00 a.m. Central), Copart will conduct a conference call to discuss the results for the quarter. The call will be webcast live and can be accessed at http://stream.conferenceamerica.com/copart022020. A replay of the call will be available through April 20, 2020 by calling 877-919-4059. Use confirmation code 44749280.\n\nAbout Copart\n\nCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart’s innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. Copart offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters, and in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers and also sells vehicles sourced from individual owners. With operations at over 200 locations in 11 countries, Copart has more than 150,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), Brazil (Copart.com.br), the Republic of Ireland (Copart.ie), Germany (Copart.de), Finland (avk.fi), the United Arab Emirates, Oman and Bahrain (Copartmea.com), and Spain (Copart.es). For more information, or to become a Member, visit Copart.com/Register. Join the conversation and follow Copart on Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200214005421/en/\nMelissa Hunter, Executive Support Manager\nOffice of the Chief Financial Officer\n972-391-5090 or melissa.hunter@copart.com\nSource: Copart, Inc."
    },
    {
        "title": "Copart Opens a New Location in Fort Wayne, Indiana",
        "subtitle": "",
        "date": "Feb 10, 2020 12:14PM EST",
        "content": "DALLAS, Feb. 10, 2020 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, opened a new 25-acre location in Fort Wayne, Indiana. This is the fourth Copart location in the state.\"We are excited to announce our new Fort Wayne facility, which has increased our capacity to store vehicles for our sellers and buyers,\" said Jay Adair, CEO of Copart.Auctions at Copart Fort Wayne are held at 9 a.m. Central Time (10 a.m. Eastern Time) every Monday. Eligible buyers can bid on current inventory using Copart's patented online auction platform, VB3.\"We look forward to providing our buyers and sellers with the best customer service, made possible by our outstanding people, processes and technology,\" said Copart Fort Wayne General Manager Sheila Mason. For a list of all Copart locations and to find the one nearest you, please visit Copart.com/locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. Copart offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters, and in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers and sells vehicles sourced from individual owners. With operations at over 200 locations in 11 countries, Copart has more than 150,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), Brazil (Copart.com.br), the Republic of Ireland (Copart.ie), Germany (Copart.de), Finland (Copart.fi), the United Arab Emirates, Oman and Bahrain (Copartmea.com), and Spain (Copart.es). For more information, or to become a Member, visit Copart.com/register. Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206 View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-opens-a-new-location-in-fort-wayne-indiana-301002061.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Germany Opens its New Munich East Location",
        "subtitle": "",
        "date": "Jan 10, 2020 9:37AM EST",
        "content": "DÜREN, Germany, Jan. 10, 2020 /PRNewswire/ -- Copart Deutschland GmbH (Copart Germany), a subsidiary of the global online vehicle auction company Copart, Inc. (NASDAQ: CPRT), opened its new Munich East location at Hitzinger Wiesen 5, 94431 Pilsting. \"With our new Munich East location, we are pleased to make it more convenient for our buyers to purchase vehicles from Copart,\" said Kai Siersleben, Managing Director of Copart Germany. Copart's Munich East location is 17.3 acres and has the capacity to store 1,800 vehicles.\"I am proud of the Copart Germany team's successful opening of the Munich East location,\" said Copart Chief Executive Officer Jay Adair. \"From Munich to Berlin, Copart now has the largest network of salvage auction facilities in Germany.\"Registered buyers can bid on vehicles on Copart.de or via the Copart mobile app for iOS and Android devices.About Copart: Copart Inc. was founded in 1982 and is a leading global provider of online vehicle auctions. Copart's innovative technology and online auction platform connect sellers with more than 750,000 members in more than 170 countries. The company offers processing and selling services for accident vehicles and used vehicles to dealers, recyclers, repair shops and exporters, and in some cases also to end users. Copart sells vehicles for insurance companies, banks, financial institutions, fleet operators, dealers and private individuals. Boasting more than 200 locations in 11 countries, Copart has more than 150,000 vehicles available online every day. Copart is currently active in the USA (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (Copart.fi). Contact: Nina KutscherauerPhone: + 49 (0)7248 93131-12Mobile: +49 (0)171 / 2633096nina.kutscherauer@copart.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-germany-opens-its-new-munich-east-location-300984757.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Canada and Promutuel Insurance Renew Contract",
        "subtitle": "",
        "date": "Dec 24, 2019 8:47AM EST",
        "content": "MONTREAL, Dec. 24, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global vehicle auction company, is proud to announce the renewal of their contract with Promutuel Insurance. Headquartered in Quebec, Promutuel Insurance provides insurance across the provinces of Quebec and New Brunswick. This renewal was signed at Copart Canada's 2019 Client Advisory Board. \"We are extremely pleased to renew our partnership with Promutuel Insurance,\" said Managing Director of Copart Canada Steve Macaluso. \"We look forward to growing both of our businesses.\"  Promutuel is leveraging Copart's Ready for Guidewire accelerator, which reduces the integration effort with Guidewire ClaimCenter™ significantly.  Copart's accelerator, available on the Guidewire Marketplace, creates efficiencies for both organizations by allowing seamless, integrated access and updates related to vehicles. With this agreement, Promutuel will continue to benefit from Copart's global buyer base and national footprint, while buyers will continue to take advantage of the insurance company's inventory. Copart's auction platform allows global buyers to participate in live online auctions from their homes or offices. Similarly, the Copart Mobile App provides buyers with a convenient way to participate on the go, and stay connected with live online auctions.Copart Canada operates in Edmonton, Calgary, Toronto, London, Montreal, Moncton and Halifax. For more information, visit Copart.ca or contact any Copart Canada location.ABOUT COPART CANADACopart first entered the Canadian market in 2003 with the opening of its Toronto, Ontario location. Since then, it has seen tremendous growth, including the opening of five additional locations, offering extensive coverage of the Canadian market. With the introduction of French language options on the Copart.com website and the launch of Canada's unique website, Copart.ca, Copart Canada continues to expand its reach to better serve its Canadian buyers and sellers.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, and individual owners. With operations at over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es), and Finland (Copart.fi). For more information, or to become a Member, visit Copart.com/register. Join the conversation and follow Copart on Facebook.Contact:Jessica Frederick, Marketing and Communications Specialist, CopartJessica.Frederick@Copart.com | 905-232-2653 SOURCE  Copart, Inc."
    },
    {
        "title": "Copart Reports First Quarter Fiscal 2020 Financial Results",
        "subtitle": "",
        "date": "Nov 20, 2019 5:55PM EST",
        "content": "    DALLAS--(BUSINESS WIRE)--\nCopart, Inc. (NASDAQ: CPRT) today reported financial results for the quarter ended October 31, 2019.\n\nFor the three months ended October 31, 2019, revenue, gross profit, and net income were $554.4 million, $254.9 million, and $218.2 million, respectively. These represent an increase in revenue of $93.1 million, or 20.2%; an increase in gross profit of $59.0 million, or 30.1%; and an increase in net income of $104.1 million, or 91.2%, respectively, from the same period last year. Fully diluted earnings per share for the three months were $0.91 compared to $0.47 last year, an increase of 93.6%.\n\nExcluding the impact of discrete income tax items, foreign currency-related gains, certain income tax benefits and payroll taxes related to accounting for stock option exercises, and the effect on common equivalent shares from ASU 2016-09, non-GAAP fully diluted earnings per share for the three months ended October 31, 2019 and 2018, were $0.65 and $0.47, respectively. A reconciliation of non-GAAP financial measures to the most directly comparable financial measures computed in accordance with U.S. generally accepted accounting principles (GAAP) can be found in the tables attached to this press release.\n\nOn Thursday, November 21, 2019, at 11 a.m. Eastern Time, Copart will conduct a conference call to discuss the results for the quarter. The call will be webcast live and can be accessed at http://stream.conferenceamerica.com/copart112119. A replay of the call will be available through January 20, 2020 by calling (877) 919-4059. Use confirmation code: 98898573.\n\nAbout Copart\n\nCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart’s innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. Copart offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters, and in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers and also sells vehicles sourced from individual owners. With operations at over 200 locations in 11 countries, Copart has more than 150,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), Brazil (Copart.com.br), the Republic of Ireland (Copart.ie), Germany (Copart.de), Finland (Copart.fi), the United Arab Emirates, Oman and Bahrain (Copartmea.com), and Spain (Copart.es). For more information, or to become a Member, visit Copart.com/Register.\n\nUse of Non-GAAP Financial Measures\n\nIncluded in this release are certain non-GAAP financial measures, including non-GAAP net income per diluted share, which exclude the impact of discrete income tax items, foreign currency-related gains, certain income tax benefits and payroll taxes related to accounting for stock option exercises, and the effect on common equivalent shares from ASU 2016-09. These non-GAAP financial measures do not represent alternative financial measures under GAAP. In addition, these non-GAAP financial measures may be different from non-GAAP financial measures used by other companies. Furthermore, these non-GAAP financial measures do not reflect a comprehensive view of Copart’s operations in accordance with GAAP and should only be read in conjunction with the corresponding GAAP financial measures. This information constitutes non-GAAP financial measures within the meaning of Regulation G adopted by the U.S. Securities and Exchange Commission. Accordingly, Copart has presented herein, and will present in other information it publishes that contains these non-GAAP financial measures, a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures.\n\nCopart believes the presentation of non-GAAP net income per diluted share included in this release in conjunction with the corresponding GAAP financial measures provides meaningful information for investors, analysts and management in assessing Copart’s business trends and financial performance. From a financial planning and analysis perspective, Copart management analyzes its operating results with and without the impact of discrete income tax items, foreign currency-related gains, certain income tax benefits and payroll taxes related to accounting for stock option exercises, and the effect on common equivalent shares from ASU 2016-09.\n\nCautionary Note About Forward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of federal securities laws, and these forward-looking statements are subject to substantial risks and uncertainties. These forward-looking statements are subject to certain risks, trends and uncertainties that could cause actual results to differ materially from those projected or implied by our statements and comments. For a more complete discussion of the risks that could affect our business, please review the “Management’s Discussion and Analysis” and the other risks identified in Copart’s latest Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K, as filed with the Securities and Exchange Commission. We encourage investors to review these disclosures carefully. We do not undertake to update any forward-looking statement that may be made from time to time on our behalf.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005968/en/\nMelissa Hunter, Executive Support Manager, Office of the Chief Financial Officer\n972-391-5090 or melissa.hunter@copart.com\nSource: Copart, Inc."
    },
    {
        "title": "Copart, Inc. to Webcast First Quarter Fiscal 2020 Results",
        "subtitle": "",
        "date": "Nov 14, 2019 8:00PM EST",
        "content": "    DALLAS, Texas--(BUSINESS WIRE)--\nCopart, Inc. (NASDAQ: CPRT) announced today that it will release earnings for the first quarter of fiscal 2020 after the close of market on Wednesday, November 20, 2019.\n\nOn Thursday, November 21, 2019, at 11:00 a.m. Eastern Time (10:00 a.m. Central), Copart will conduct a conference call to discuss the results for the quarter. The call will be webcast live and can be accessed at http://stream.conferenceamerica.com/copart112119. A replay of the call will be available through January 20, 2020 by calling 877-919-4059. Use confirmation code 98898573.\n\nAbout Copart\n\nCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart’s innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. Copart offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters, and in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers and also sells vehicles sourced from individual owners. With operations at over 200 locations in 11 countries, Copart has more than 150,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), Brazil (Copart.com.br), the Republic of Ireland (Copart.ie), Germany (Copart.de), Finland (Copart.fi), the United Arab Emirates, Oman and Bahrain (Copartmea.com), and Spain (Copart.es). For more information, or to become a Member, visit Copart.com/Register. Join the conversation and follow Copart on Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191114005945/en/\nMelissa Hunter, Executive Support Manager\nOffice of the Chief Financial Officer\n972-391-5090 or melissa.hunter@copart.com\nSource: Copart, Inc."
    },
    {
        "title": "Copart Germany Opens New Location Near Berlin",
        "subtitle": "",
        "date": "Nov 12, 2019 9:30AM EST",
        "content": "DÜREN, Germany, Nov. 12, 2019 /PRNewswire/ -- Copart Deutschland GmbH (Copart Germany), a subsidiary of the global online vehicle auction company Copart, Inc. (NASDAQ: CPRT), opened its new Berlin, Germany location at Robert-Guthmann-Str. 20, 15713 Königs Wusterhausen (Niederlehme district). Including the new 22-acre (90,000 square meters) Berlin location, Copart currently operates 13 facilities in Germany.\"With the opening of Copart Berlin, I am pleased that we are able to offer our buyers a greater selection of vehicles,\" said Copart Deutschland's General Manager Kai Siersleben. Copart Berlin currently has the capacity to store more than 1,800 vehicles. Registered buyers can place bids on vehicles stored at this location, on Copart.de or on the Copart mobile app (available for iOS and Android devices).  \"Thanks to our investment in land, technology, logistics, and people in the German market, as well as our unmatched global buyer base, we are well positioned to grow our business by providing strong auction returns and excellent service to our customers,\" said Copart Chief Executive Officer Jay Adair. To find out more about Copart Germany, please visit https://www.copart.de/.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, and individual owners. With operations at over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (Copart.fi). For more information, or to become a Member, visit Copart.com/Register.Contact:Michelle Hoffman, Vice President of Marketing, Copart Michelle.Hoffman@Copart.com | (972)-391-5082Fatima Ali, Communications Manager, Copart Fatima.Ali@Copart.com | (972)-391-5206 View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-germany-opens-new-location-near-berlin-300955088.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Expands Montreal, Quebec Location in Canada",
        "subtitle": "",
        "date": "Oct 10, 2019 1:07PM EDT",
        "content": "DALLAS, Oct. 10, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, announced a 24-acre expansion to its Montreal location in Quebec, Canada.\"We are excited to grow our capacity in Canada by expanding our Montreal location,\" said Managing Director of Copart Canada Steve Macaluso. \"This will enable us to grow our vehicle inventory and offer our members even more choices.\"Copart's Montreal auctions are held every Tuesday at 9 a.m. Central Time (10 a.m. Eastern Time). This location is one of seven Copart locations in Canada including: Calgary, Edmonton,  Moncton, Halifax, London and Toronto.\"With this expansion, we can more efficiently serve our customers and support their growth,\" said Copart Montreal General Manager Yves Poulin.For a list of all Copart locations and to find the one nearest you, please visit Copart.com/locations.ABOUT COPART CANADACopart first entered the Canadian market in 2003 with the opening of its Toronto, Ontario location. Since then, it has seen tremendous growth, including the opening of five additional locations, offering extensive coverage of the Canadian market. With the launch of Canada's unique website, Copart.ca, Copart Canada continues to expand its reach to better serve its Canadian buyers and sellers.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (Copart.fi). For more information, or to become a Member, visit Copart.com/Register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-expands-montreal-quebec-location-in-canada-300936691.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Expands Calgary, Alberta Location in Canada",
        "subtitle": "",
        "date": "Aug 28, 2019 12:50PM EDT",
        "content": "DALLAS, Aug. 28, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, announced the expansion of its location in Calgary, Alberta in Western Canada. The location added 20 acres of operational capacity, making it a 38-acre facility. This expansion will accommodate the increased business demands from buyers and sellers in Alberta.\"We are extremely pleased with our continued business growth in Alberta,\" said Copart Canada Managing Director Steve Macaluso. \"The increased vehicle storage will provide more options for both our sellers and buyers.\"Copart's Calgary auctions are held every Tuesday at 1 p.m. CT (12 p.m. MT). This is one of Copart's two locations in Alberta.\"Our buyers and sellers are excited about the additional vehicle storage space,\" said Copart Calgary General Manager William Spinks. \"And we're perfectly positioned to serve them with an unmatched experience.\"For a list of all Copart locations and to find the one nearest you, please visit Copart.ca/locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland. For more information, or to become a Member, visit Copart.com/register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206Meta Description:Copart expanded its location in Calgary, Alberta in Western Canada. This addition accommodates increased business demands.  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-expands-calgary-alberta-location-in-canada-300908604.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Expands Atlanta East, Georgia Location",
        "subtitle": "",
        "date": "Aug 16, 2019 10:03AM EDT",
        "content": "DALLAS, Aug. 16, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, today announced a 40 acre expansion to its Atlanta East location. This is the second time Copart has expanded this location this year as it continues to execute on its capacity growth initiative. \"We are thrilled that we can meet our customers' growing needs by expanding the Atlanta East facility,\" said Jay Adair, CEO of Copart. Copart's Atlanta East auctions are held every Monday at 9 a.m. Central Time or 10 a.m. Eastern Time. This location is one of nine Copart locations in Georgia.\"We plan to use our people, process and technology to provide the best experience to buyers who purchase vehicles from our location,\" said Copart Atlanta East General Manager Tiffany Todd.For a list of all Copart locations and to find the one nearest you, please visit Copart.com/Locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/Register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-expands-atlanta-east-georgia-location-300902991.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Expands Memphis, Tennessee Location",
        "subtitle": "",
        "date": "Aug 6, 2019 2:25PM EDT",
        "content": "DALLAS, Aug. 6, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company announced the expansion of its Memphis, Tennessee location. Copart added 35 acres to the existing 46-acre facility to meet the needs of its buyers and sellers. This 81-acre location hosts vehicle auctions every Thursday at 12 p.m. CT.\"Adding operational space to our Memphis location has provided us with further capacity to serve Tennessee,\" said Jay Adair, CEO of Copart.This location's expansion will bring additional opportunities for auto enthusiasts, rebuilders and other buyers by offering more vehicles at the location.Eligible buyers can bid on available inventory using our VB3 online auction platform, the Copart Mobile App or at kiosks at the location during normal business hours.\"This expansion will allow us to provide the highest levels of service to our clients,\" said General Manager Jeremy Dodson.For a list of all Copart locations and to find the one nearest you, please visit Copart.com/Locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland. For more information, or to become a Member, visit Copart.com/Register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-expands-memphis-tennessee-location-300897367.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Opens New Location in Macon, Georgia",
        "subtitle": "",
        "date": "Jul 25, 2019 8:13AM EDT",
        "content": " DALLAS, July 25, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company today announced the opening of its new location in Macon, Georgia. The 35 acre facility is Copart's ninth location in Georgia.\"Opening in Macon allows us to offer increased convenience and additional options to our sellers and buyers in Georgia,\" said Copart CEO Jay Adair. \"This new location is a strategic step in expanding our footprint.\" The Copart Macon Georgia location hosts weekly auctions on Thursdays at 9 a.m. Central Time or 9 a.m. Eastern Time. Eligible buyers can place bids online through Copart's proprietary VB3 auction technology or via Copart's mobile app.\"We are thrilled to serve the needs of our customers in Georgia, especially considering Macon's growing population and ease of access,\" said General Manager Amanda McCallister. Visit the Copart Macon Georgia page on Copart.com to view the location's contact information, sale lists and inventory. For a list of all Copart locations, please visit Copart.com/locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, and individual owners. With operations at over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es), and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/register. Join the conversation and follow Copart on Facebook.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 489-3713 View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-opens-new-location-in-macon-georgia-300890731.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Opens New Location in Buffalo, New York",
        "subtitle": "",
        "date": "Jul 17, 2019 12:55PM EDT",
        "content": "DALLAS, July 17, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ:CPRT), a global online vehicle auction company today announced the opening of its new location in Buffalo, New York, the second largest city in the state. The Buffalo facility is the sixth in the state and will complement Copart's Rochester location in providing capacity for operations in the western part of New York.\"Expanding our business to Buffalo is another step in creating a denser network of facilities in the state, allowing us to address the increasing demands of our buyers and sellers,\" said Copart CEO Jay Adair. \"We are thrilled about the opportunity to serve our customers with our new facility.\" The Copart Buffalo location hosts bi-weekly auctions on Mondays at 9 a.m. Central Time or 10 a.m. Eastern Time starting July 29, 2019. Eligible buyers will be able to place bids online through Copart's proprietary VB3 auction technology or via Copart's mobile app. There will also be a bidding kiosk onsite.\"We look forward to providing Buffalo with an unmatched buying and selling experience through our people, processes and technology,\" said General Manager Tim Bennett. Visit the Copart Buffalo page on Copart.com to view the location's contact information, sale lists and inventory. For a list of all Copart locations, please visit Copart.com/Locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, and individual owners. With operations at over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es), and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/Register. Join the conversation and follow Copart on Facebook.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 489-3713 View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-opens-new-location-in-buffalo-new-york-300886717.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Opens Second Location in Hartford, Connecticut",
        "subtitle": "",
        "date": "Jul 10, 2019 1:27PM EDT",
        "content": "DALLAS, July 10, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ:CPRT), a global online vehicle auction company, opened a new location in Hartford, Connecticut. This location was formerly Hartford-Springfield Auto Auction. This is Copart's second location in the state.\"Our new Hartford location will provide capacity to accommodate our continuing growth in volume and additional convenience for our buyers in the region,\" said Copart CEO Jay Adair.Copart hosts online auctions at its Hartford Springfield location every Thursday at 9 a.m. Central Time, with the next auction planned for July 18, 2019. Eligible buyers can bid on current inventory from computers, smartphones and tablets, or via bidding kiosks available at the location.As a leading innovator in the salvage industry, Copart is proud to bring its business and jobs to one of the United States' oldest cities.\"We are excited to provide our customers with the best service in the industry, made possible by our people, processes and technology,\" said General Manager Brian Phillips.Visit the Copart Hartford Springfield page on Copart.com to view the location's contact information, browse its sale lists and search its inventory. For a list of all Copart locations and to find the one nearest you, please visit Copart.com/locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, and individual owners. With operations at over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es), and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/register. Join the conversation and follow Copart on Facebook.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 489-3713 View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-opens-second-location-in-hartford-connecticut-300882806.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Opens West Mifflin, Pennsylvania Location",
        "subtitle": "",
        "date": "May 15, 2019 9:00AM EDT",
        "content": " DALLAS, May 15, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, acquired a new 68-acre location at 1451 Lebanon School Rd West Mifflin, Pennsylvania, 15122. This property was previously the General Motors Fisher Body Plant from the 1940's through 2007. Copart has renovated the facility to accommodate the needs of its operations as well as those of its buyers and sellers. This facility is currently available for vehicle storage with auctions beginning soon. \"I am thrilled with the purchase of our second West Mifflin location in Pennsylvania and look forward to serving our customers in and around the area,\" said Jay Adair, CEO of Copart. This is Copart's eleventh location in the state of Pennsylvania, purchased to meet the increased demands of buyers and sellers in the area.Auction times for Copart West Mifflin will be available on its location page on Copart.com soon. Eligible buyers will be able to bid on available inventory using our VB3 online auction platform, or at kiosks at the location during normal business hours.\"This new facility will greatly increase our operational capabilities and readiness for increased volume in the Greater Pittsburgh area,\" said General Manager William Shay.For a list of all Copart locations and to find the one nearest you, please visit Copart.com/locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers, and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-opens-west-mifflin-pennsylvania-location-300850731.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Opens Fredericksburg, Virginia Location",
        "subtitle": "",
        "date": "Apr 29, 2019 10:07AM EDT",
        "content": "DALLAS, April 29, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, opened a new location at 4717 Massaponax Church Road, Fredericksburg, Virginia, 22408. This facility will serve our customers from Washington, D.C. and both Richmond and Charlottesville, Virginia.\"I am proud of our team's hard work in making this location a reality for our customers,\" said Jay Adair, CEO of Copart. Auction times for Copart Fredericksburg will be available on its location page soon. Eligible buyers will be able to bid on available inventory using our patented VB3 online auction platform, or at kiosks at the location during normal business hours.\"We are very excited to have this new facility in one of the most historic cities in our country,\" said General Manager Consuela Harrison. \"We look forward to providing our buyers and sellers with the highest level of service with our people, processes, and technology.\"For a list of all Copart locations and to find the one nearest you, please visit Copart.com/Locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers, and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/Register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-opens-fredericksburg-virginia-location-300839755.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "CrashedToys Sacramento, Calif. Location Open for Business",
        "subtitle": "",
        "date": "Apr 5, 2019 12:33PM EDT",
        "content": "SACRAMENTO, Calif., April 5, 2019 /PRNewswire/ -- CrashedToys, a Copart brand, announced that its new facility at 8687 Weyand Ave Suite B, Sacramento, CA 95828 is now open for business. Copart is the leading global remarketer of motorcycles and other powersports vehicles. Every month, CrashedToys locations host auctions of hundreds of motorcycles, ATVs, and watercraft. CrashedToys Sacramento hosts monthly auctions, with the next auction taking place at 12 p.m. Pacific Time Monday, April 22, 2019.\"The opening of our new facility represents the success of the CrashedToys brand and the value that this unique powersports platform provides our sellers and buyers,\" said CrashedToys Director Currey Hall. \"We look forward to serving Northern California and the Pacific Northwest with our new one-stop-shop for rebuildable powersports vehicles.\" CrashedToys Sacramento is open Monday through Friday from 8 a.m. to 5 p.m. Pacific Time. Eligible buyers can bid on current inventory using our patented online auction platform, VB3, through the CrashedToys mobile app or at kiosks at the location during normal business hours. To register, please visit www.crashedtoys.com.About CopartCopart, Inc. (NASDAQ: CPRT), founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, and individual owners. With operations at over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es), and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/register. Join the conversation and follow Copart on Facebook.Contact:Michelle Hoffman, VP of Marketing, Copart Michelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, Copart Fatima.Ali@Copart.com | (972) 391-5206 View original content to download multimedia:http://www.prnewswire.com/news-releases/crashedtoys-sacramento-calif-location-open-for-business-300825482.htmlSOURCE  Copart, Inc."
    },
    {
        "title": "Copart Expands its Chicago South Location",
        "subtitle": "",
        "date": "Mar 29, 2019 9:39AM EDT",
        "content": "DALLAS, March 29, 2019 /PRNewswire/ -- Copart, Inc. (NASDAQ: CPRT), a global online vehicle auction company, added 44 acres to its Chicago South facility located at 89 E. Sauk Trail, Chicago Heights, Illinois, 60411. With this expansion, the facility is now 80-acres allowing Copart to accommodate the growth it is experiencing in this market. \"This expansion is a great win for our business and helps grow our footprint in the region to meet buyer and seller needs,\" said Jay Adair, CEO of Copart.Auctions are held every Friday at 12 p.m. Central Time at Copart's Chicago South location. Eligible buyers can bid on current inventory using our proprietary online auction platform, VB3 or at kiosks at the location during normal business hours.\"I am thrilled that we will be able to meet our client needs with the expansion of this yard,\" said Copart Chicago South General Manager Don Winn. For a list of all Copart locations and to find the one nearest you, please visit Copart.com/locations.ABOUT COPARTCopart, Inc., founded in 1982, is a global leader in online vehicle auctions. Copart's innovative technology and online auction platform links sellers to more than 750,000 Members in over 170 countries. The company offers services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some cases, to end users. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers, and individual owners. With operations in over 200 locations in 11 countries, Copart has more than 125,000 vehicles available online every day. Copart currently operates in the United States (Copart.com), Canada (Copart.ca), the United Kingdom (Copart.co.uk), the Republic of Ireland (Copart.ie), Brazil (Copart.com.br), Germany (Copart.de), the United Arab Emirates, Oman and Bahrain (Copartmea.com), Spain (Copart.es) and Finland (AVK.fi). For more information, or to become a Member, visit Copart.com/register.Contact:Michelle Hoffman, VP of Marketing, CopartMichelle.Hoffman@Copart.com | (972) 391-5082Fatima Ali, Communications Manager, CopartFatima.Ali@Copart.com | (972) 391-5206  View original content to download multimedia:http://www.prnewswire.com/news-releases/copart-expands-its-chicago-south-location-300821002.htmlSOURCE  Copart, Inc."
    }
]