[
    {
        "title": "Cisco Expands Simple and Secure Portfolio to Help Small Businesses Thrive",
        "subtitle": "",
        "date": "Mar 3, 2020 8:00AM EST",
        "content": "SAN JOSE, Calif., March 3, 2020 /PRNewswire/ -- Today, Cisco is accelerating its focus on serving small businesses by announcing new offers tailored to the small business buyer. In November 2019, Cisco introduced the new Cisco 'Designed for Business' portfolio at Partner Summit. Now the portfolio is growing with the addition of Cisco technology that originally powered Fortune 100 organizations, and can now bring the same innovation to meet the needs of small businesses. \n                        \n                    \n                Small business is big business and accounts for 44 percent of all IT spending – as a segment it's faster growing than the enterprises segment[1] Now more than ever, small businesses need to be agile when digitizing their business models. Ultimately, technology is critical to helping them grow their revenue, optimize their customer experiences and differentiate themselves to remain competitive. Small businesses need to connect securely and focus on protecting their users, data and devices at all times.To help address these needs, and allow small businesses to focus on their core activities, Cisco is announcing brand new updates to the Cisco 'Designed for Business' portfolio bringing together the power of machine learning, AI and cloud-driven solutions, and created to make buying, installation and maintenance simple. The simplified experience includes:Partner and customer quotes:  \"Our mission at Stratus Information Systems is to find the right networking solutions for our SMB customers that can free them up to focus on their core businesses rather than the complexity of a pieced together network and security products. Having the breadth of the Cisco Designed portfolio is a real advantage for them and for us.  Whether it's the cloud-managed Meraki portfolio or the zero-config Cisco Business Products or the new wireless mobile application it makes it simpler for us and our customers to install, manage and expand.\" Jason Lacey, Regional Sales Director Stratus Information Systems \"Talent Garden is the largest European network of campuses for professionals working in the tech and digital industries. Our mission is to create local, vibrant, globally connected campuses that empower digital & tech communities. A secure, reliable network is the backbone of our business and our members experience. Since we introduced Cisco Designed for Business technologies such as Meraki access points and smart cameras to our campuses, it has freed our team up to focus on delivering on our mission. We deployed more than 500 managed access points and 250 cameras across our 26 locations in a short space of time. This infrastructure is managed by APIs without the need for a dedicated team. Now our local staff across the Talent Garden network can focus on customer satisfaction, using these tools to understand potential problems and make requests for improvements in our operation.\" Alessandro Braga, Chief Digitization Officer, Talent GardenAdditional Resources: Check out the new Small Business Cisco.com page Hear from a Cisco Designed for Business customer  Read the Blog: The Small Business Conundrum Follow Cisco Small Business on Twitter, Facebook and LinkedIn  Learn more about new promotions and offers Find out about Financing Options for Small Business About Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at thenetwork.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word \"partner\" does not imply a partnership relationship between Cisco and any other company.[1] World Trade Organization  \n                        \n                    \n                 View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-expands-simple-and-secure-portfolio-to-help-small-businesses-thrive-301015082.htmlSOURCE  Cisco"
    },
    {
        "title": "Oxbotica and Cisco to Solve Autonomous Vehicle Data Challenge with Pioneering OpenRoaming Platform",
        "subtitle": "",
        "date": "Feb 27, 2020 4:00AM EST",
        "content": "- Autonomous vehicles generate 1.2TB of data per day – the equivalent of 500 HD movies or 200,000 songs- OpenRoaming is key to unlocking seamless and secure sharing of high-volume data by autonomous fleets- The partnership marks an important operational milestone for Oxbotica as the company prepares for large-scale deployment of its autonomy software - Together, Oxbotica and Cisco aim to enable cost-effective and fully-scalable deployment globallyLONDON, Feb. 27, 2020 /PRNewswire/ -- Oxbotica, a global leader in autonomous vehicle software, and Cisco have partnered to demonstrate how OpenRoaming can unlock the potential of fully-connected autonomous vehicle fleets, enabling the seamless and secure sharing of high-volume data while on the move.Autonomous vehicles (AVs) make 150 independent vehicle detections every second and generate up to 80GB of data per driven-hour from sensors such as LiDAR, cameras and RADAR as well as Advanced Driver Assistance Systems (ADAS) logs. This constant activity means amassing 1.2TB of data in a 16-hour day – the equivalent of over 500 HD movies or over 200,000 songs – much of which is gathered when the vehicle returns to base. By 2024, over 70 million new connected vehicles will enter the market every year, with each required to upload and download 8.3GB of data per day, including streamed infotainment, HD navigation, vehicle telemetry and ADAS settings – as well as safety critical information like severe weather updates or passenger ill health. By comparison, the average smartphone will contribute just a fifth of this daily volume. Stretched across an autonomous fleet, which could include hundreds or even thousands of vehicles in a city or region, this would produce an abundance of data beyond that which could be shared efficiently and cost-effectively using existing 4G, or emerging 5G, networks. Oxbotica has already started work on addressing this challenge with on-road trials taking place in Stratford, East London last September.OpenRoaming offers the ability to unlock solutions to the large data transfer challenge for autonomous vehicle fleets. OpenRoaming, a Cisco-initiated federation of providers utilising standards-based wireless technology, enables devices, whether it be smartphones or AVs, to automatically connect to trusted Wi-Fi hotspots and networks without the need to enter usernames and passwords, instead using embedded credentials issued by identity providers – in this case OEMs or AV software companies. OpenRoaming is particularly suited for connected vehicles, with opportunities for Wi-Fi hotspots to be deployed in locations such as gas stations, EV charging locations, parking structures and vehicle service centers.The Next Generation Connected Vehicles Co-Innovation trial collaboration with Cisco demonstrates how Oxbotica customers will be able to access, customise and integrate the world's leading mobile autonomy IP into their own products. The platform to be tested is designed to be fully-scalable, capable of being deployed across various fleet networks no matter the size or location, while delivering cost-effective and secure data offload.Ozgur Tohumcu, CEO at Oxbotica, said: \"As part of our Universal Autonomy vision, our pioneering software already reduces the amount of data sharing that is required, allowing vehicles to operate wherever they are, with or without network connection. In fact, our software has been designed to operate not dependent on any infrastructure, so it can understand the vehicle's environment in infinite detail. However, we fully recognise that in an autonomous world, fleets will need to upload and download vast amounts of data and the partnership with Cisco offers us the chance to solve one of the greatest data challenges of the future, already today.\"Matt MacPherson, Wireless CTO at Cisco, said: \"Today's autonomous vehicles generate enormous amounts of data when they operate. The challenge is how to gather that information from the vehicle automatically and, perhaps more importantly, cost-effectively. Tomorrow's connected cars will face the same issue.\"\"For industrial applications where devices, such as autonomous vehicles rather than people, are moving through areas that are covered by Wi-Fi, this technology is designed to enable that simple, automatic connection that users experience when using mobile networks. OpenRoaming opens up the possibility of a cost-effective alternative for transporting high-volume data to and from the vehicle, autonomously.\"NOTES TO EDITORSFor more information: https://www.oxbotica.com/ Cisco Newsroom: Cisco and Oxbotica partner to bring OpenRoaming to autonomous cars   About OxboticaOxbotica is a global leader in autonomous vehicle software. Oxbotica was founded in 2014 as an Oxford University spin-out with a simple mission to develop autonomy software that will transform all industries where people and goods move. Oxbotica's autonomy software works with any vehicle, any time, and in any place. This is Universal Autonomy. Oxbotica's autonomous vehicle software is deployed across multiple industries, bringing the benefits of autonomy to enterprises globally. Oxbotica is building an ecosystem that supports the adoption of autonomous vehicles, leveraging key partnerships to accelerate the deployment of Universal Autonomy.About CiscoCisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks.Availability Disclaimer: The products and features described herein remain in varying stages of development and will be offered on a when-and-if-available basis. These products and features are subject to change at the sole discretion of Cisco, and Cisco will have no liability for delay in the delivery or failure to deliver any of the products or features set forth in this document.  View original content to download multimedia:http://www.prnewswire.com/news-releases/oxbotica-and-cisco-to-solve-autonomous-vehicle-data-challenge-with-pioneering-openroaming-platform-301012266.htmlSOURCE  Cisco Systems, Inc."
    },
    {
        "title": "Cisco Announces March 2020 Events with the Financial Community",
        "subtitle": "",
        "date": "Feb 26, 2020 5:00AM EST",
        "content": "SAN JOSE, Calif., Feb. 26, 2020 /PRNewswire/ -- Cisco today announced that it will participate in the following conferences with the financial community during the month of March. These sessions will be webcast.  Interested parties can view these events on Cisco's Investor Relations website at investor.cisco.com.KeyBanc Emerging Technology SummitMarch 4, 202012:00 p.m. PT / 3:00 p.m. ETSan Francisco, CAAmy Chang, EVP and General Manager, Cisco Collaboration2020 Morgan Stanley Technology, Media & Telecom Investor ConferenceMarch 5, 20207:50 a.m. PT / 10:50 a.m. ETSan Francisco, CASachin Gupta, Sr. Vice President Product Management, Enterprise NetworkingAbout Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries.  A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners.  The use of the word partner does not imply a partnership relationship between Cisco and any other company.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-announces-march-2020-events-with-the-financial-community-301011388.htmlSOURCE  Cisco Systems, Inc."
    },
    {
        "title": "Cisco Simplifies Security and Tackles Complexity with New Cloud-Native Platform, SecureX",
        "subtitle": "",
        "date": "Feb 24, 2020 8:00AM EST",
        "content": "Cisco SecureX provides greater visibility across the entire security portfolio, delivers security analytics, and automates workflows to speed threat detection and responseSAN FRANCISCO, Feb. 24, 2020 /PRNewswire/ --Cisco SecureX Summary:RSA Conference 2020 -- Cisco, the leader in enterprise security, today unveiled a radical simplification in the way customers experience Cisco Security's portfolio and addresses complexity —one of the top pain points for CISOs. Building on a decade of significant investment in innovation, partnerships, acquisitions, customer research and open-source standards, Cisco is now offering customers the broadest, most integrated cloud-native security platform in the industry, Cisco SecureX. Cisco SecureX provides a comprehensive user experience across the breadth of Cisco's integrated security portfolio and customers' existing security infrastructure. Cisco SecureX unifies visibility, identifies unknown threats, and automates workflows to strengthen customers' security across network, endpoint, cloud, and applications. Because simplicity is essential to securing today's digital transformation, Cisco SecureX is included with every Cisco Security product. As businesses embrace digital transformation, expanding to the cloud, incorporating IoT and high-speed wireless access increases the corresponding attack surface. Securing this complex environment becomes difficult with various technologies that don't interoperate. Cisco's 2020 CISO Benchmark Study of 2800 security professionals surveyed found that twenty-eight percent feel that managing a multi-vendor environment is very challenging, an increase of eight points from last year's survey. \"As a CISO, it is a real security challenge to protect our students, staff, and the sensitive data that comes with them. Having a holistic security platform has helped us simplify and accelerate our security operations. All of our tools seamlessly integrated and Cisco's platform approach gives us one view into our layered protection and valuable time back,\" said Don Bryant, CISO, The University of North Carolina at Pembroke. \"Nearly one-third (31 percent) of organizations base cybersecurity monitoring and protection on more than 50 different security products. This not only adds cost and complexity but also makes it harder to detect and respond to cybersecurity incidents in a timely fashion,\" said Jon Oltsik, Senior Principal Analyst and Fellow at the Enterprise Strategy Group (ESG). \"Integrated cybersecurity technology platforms like Cisco SecureX have the potential to address these economic, technical, and resource challenges by providing more comprehensive threat detection, automated incident response, and ease-of-operations capabilities.\"Foundational capabilities of Cisco SecureX include:\"The industry has been flooded with thousands of point products that were meant to help customers but instead created unmanageable environments with products that don't work together. This has created gaps in businesses' security posture,\" said Gee Rittenhouse, SVP and GM of Cisco's Security Business Group. \"In addition to bad actors, complexity has become another risk that security teams have to overcome. Cisco SecureX is a fundamental shift in the customers security experience by removing the complexity and providing one unified view on the state of customers' security services and alerts. In doing so, security teams can become more efficient with resources and be a business enabler that propels the digital transformation forward.\" Cisco SecureX is scheduled for general availability in June. Customers can join the beta program waitlist, or request a demonstration information.Additional Resources:Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks Press contact: Raquel Prieto, raqpriet@cisco.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-simplifies-security-and-tackles-complexity-with-new-cloud-native-platform-securex-301009658.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco 2020 CISO Benchmark Report Shows Increased Investment in Cloud Security and Automation Technologies to Combat Complexity",
        "subtitle": "",
        "date": "Feb 24, 2020 8:00AM EST",
        "content": "SAN FRANCISCO, Feb. 24, 2020 /PRNewswire/ -- RSA Conference 2020 — Today, Cisco published its sixth annual CISO Benchmark Report surveying the security posture of 2,800 security professionals from 13 countries around the globe. The report provides 20 cybersecurity considerations for 2020 – gleaned from data analysis of survey results and a panel of Advisory CISOs. Complexity Continues to be Cybersecurity's Worst Enemy  Digital transformation continues to present itself as an opportunity for IT and security leaders to innovate and gain competitive advantage. But it also carries a tsunami of infrastructure change, which often creates new challenges for security professionals with defeating unknown sophisticated threats looming as a top concern.In today's security landscape, the average company uses more than 20 security technologies. While vendor consolidation is steadily increasing with 86 percent of organizations using between 1 and 20 vendors, more than 20 percent feel that managing a multi-vendor environment is very challenging, which has increased by 8 percent since 2017. Other notable findings:To combat complexity, security professionals are increasing investments in automation to simplify and speed up response times in their security ecosystems; using cloud security to improve visibility into their networks; and sustaining collaboration between networking, endpoint and security teams.  \"As organizations increasingly embrace digital transformation, CISOs are placing higher priority in adopting new security technologies to reduce exposure against malicious actors and threats. Often, many of these solutions don't integrate, creating substantial complexity in managing their security environment,\" said Steve Martino, Senior Vice President and Chief Information Security Officer, Cisco. \"To address this issue, security professionals will continue steady movement towards vendor consolidation, while increasing reliance on cloud security and automation to strengthen their security posture and reduce the risk of breaches.\"The following findings highlight additional CISO challenges and opportunities for improvement:Security professionals have made positive developments to improve their security posture:Recommendations for CISOs:Additional Resources: Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks  Press contact: Raquel Prieto, raqpriet@cisco.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-2020-ciso-benchmark-report-shows-increased-investment-in-cloud-security-and-automation-technologies-to-combat-complexity-301009684.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Innovates Cellular IoT Connectivity Management with 5G Readiness and Machine Learning",
        "subtitle": "",
        "date": "Feb 20, 2020 11:30AM EST",
        "content": "SAN JOSE, Calif., Feb. 20, 2020 /PRNewswire/ --News Summary:Today, Cisco announced advancements to its IoT portfolio that enable service provider partners to offer optimized management of cellular IoT environments and new 5G use-cases. New wireless technologies – such as 5G, Wi-Fi 6 – will lead to more devices and new advanced Industrial IoT (IIoT) use cases and will give service providers the tools to create competitive cellular IoT offerings for their customers. Machine-to-machine connections are expected to rise 19% and account for 50% of all connections by 2023, according to Cisco's 2020 Annual Internet Report. \"Cellular IoT deployments are accelerating across connected cars, utilities and transportation industries and with 5G and Wi-Fi 6 on the horizon IoT adoption will grow even faster. Cisco is investing in connectivity management, IoT networking, IoT security, and edge computing to accelerate the adoption of IoT use-cases,\" said Vikas Butaney, vice president product management IoT, Cisco. \"With today's advancements, Cisco is further enabling our service provider partners with machine learning to simplify and accelerate cellular IoT services while creating new bundled services to grow their revenues.\" Advancing Cellular IoTCisco IoT Control Center (formerly Jasper Control Center), the market leader in connectivity management platforms, is introducing new innovations to improve management and reduce deployment complexity. These include:Cisco IoT Control Center provides the visibility and simplicity necessary to address today's IoT challenges. Cisco service provider partners and customers are already taking advantage of the new machine-learning capabilities. The Journey Towards 5GWith the introduction of 5G, use cases from low-power to the most demanding requirements will become possible.  Industrial environments can benefit from the advanced IoT capabilities presented by 5G, with use cases such as flexible manufacturing, higher throughput, and autonomous vehicles. Cisco IoT Control Center has taken steps towards 5G readiness to incubate and promote high value 5G business use cases that customers can easily adopt.Additional Resources:About Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.  Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company.   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-innovates-cellular-iot-connectivity-management-with-5g-readiness-and-machine-learning-301008113.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco is #4 on Fortune 100 Best Companies to Work For Ranking",
        "subtitle": "",
        "date": "Feb 18, 2020 8:33AM EST",
        "content": "SAN JOSE, Calif., Feb. 18, 2020 /PRNewswire/ -- News Summary:Cisco was named No. 4 on the list of 2020 Fortune 100 Best Companies to Work For®.  The company was No. 6 on the list last year and has appeared on the list every year since it began 23 years ago.\"Cisco is proud to be recognized by our employees as one of the Fortune 100 Best Companies to Work For®,\" said Francine Katsoudas, executive vice president and chief people officer, Cisco. \"We believe our Conscious Culture continues to put a focus on trust and transparency, and living to our Principles.\"One Cisco program that allows employees to feel empowered and recognizes their efforts is The Bridge Awards. The program features employees who make a difference in our community by making a positive impact on people, society, and our planet.Bridge Award winner Shawn Tylka, senior manager of people and communities at Cisco, reflects on how winning the award has inspired her. \"Being a member of a group of people who are celebrated for their selfless actions and their work to make the world a better place has humbled and inspired me.\"Career significance and diversity are two areas that Carlos Pignataro, a chief technology officer at Cisco, values as an employee. \"In the tech industry, 20 years is an extraordinarily long time to stay at one company. When people ask me why I've stayed this long, I tell them it's very simple: In 20 years, I've had many different careers at Cisco; I rarely have two days that are the same. I pioneer innovation in tech while also building career reinvention.\"He added that he has had the opportunity to teach and evangelize skills broadly to others at Cisco and then move on to a new Cisco job in a different area to start the process over again. \"It's a dream scenario for someone who is intellectually curious, restless, an 'intrapreneur' and a lifelong learner.\"To determine the Fortune 100 Best Companies to Work For® list, Great Place to Work® analyzed responses from more than 650,000 employees at Great Place to Work-Certified™ organizations across the country. Great Place to Work, a global people analytics and consulting firm, evaluated more than 60 elements of team members' experience on the job. These included the extent to which employees trust leaders, the respect with which people are treated, the fairness of workplace decisions, and how much camaraderie there is among the team. Rankings are based on employees' feedback and reward companies who best include all employees, no matter who they are or what they do for the organization.About the Fortune 100 Best Companies to Work For® listGreat Place to Work based its ranking on a data-driven methodology applied to anonymous Trust Index™ survey responses from more than 650,000 employees at Great Place to Work-Certified organizations across the country. About Great Place to WorkGreat Place to Work® is the global authority on workplace culture. They help organizations quantify their culture and produce better business results by creating a high-trust work experience for all employees. Emprising®, their culture management platform, empowers leaders with the surveys, real-time reporting, and insights they need to make data-driven people decisions. They use their unparalleled benchmark data to recognize Great Place to Work-Certified™ companies and the Best Workplaces™ in the US and more than 60 countries, including the 100 Best Companies to Work For® list published annually in Fortune. About CiscoCisco (Nasdaq: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Contact: Kyrk Storer, kstorer@cisco.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-is-4-on-fortune-100-best-companies-to-work-for-ranking-301006586.htmlSOURCE  Cisco"
    },
    {
        "title": "New Cisco Annual Internet Report Forecasts 5G to Support More Than 10% of Global Mobile Connections by 2023",
        "subtitle": "",
        "date": "Feb 18, 2020 8:00AM EST",
        "content": "SAN JOSE, Calif., Feb. 18, 2020 /PRNewswire/ -- News Summary: By 2023:  According to the new Cisco Annual Internet Report, 5G will support more than 10% of the world's mobile connections by 2023. The average 5G speed will be 575 megabits per second, or 13 times faster than the average mobile connection. With advanced performance capabilities, 5G will deliver more dynamic mobile infrastructures for AI and emerging IoT applications including autonomous cars, smart cities, connected health, immersive video and more.For the past 50 years, each decade introduced a new mobile technology with cutting-edge innovations. Mobile bandwidth requirements have evolved from voice calls and texting to ultra-high-definition (UHD) video and a variety of augmented reality/virtual reality (AR/VR) applications. Consumers and business users worldwide continue to create new demands and expectations for mobile networking. This ongoing trend is clearly highlighted by the adoption and use of mobile applications. Social networking, video streaming and downloads, business productivity, e-commerce and gaming will drive the continued growth of mobile applications with nearly 300 billion downloaded by 2023.\"What we are seeing from our research is a continuous rise in internet users, devices, connections, and more demand on the network than we could have imagined,\" said Roland Acra, Senior Vice President and Chief Technology Officer at Cisco. \"The insights and knowledge gained by our Annual Internet Report are helping global businesses, governments and service providers prepare and secure networks for the ongoing growth in connections and applications. Strategic planning and partnerships will be essential for all organizations to capitalize on their technology innovations and investments.\"Cisco Annual Internet Report Highlights (2018 – 2023)The Cisco Annual Internet Report covers mobile, Wi-Fi and fixed broadband networking with quantitative projections on the growth of users, devices and connections as well as network performance and relevant trends over a five-year forecast period (2018 – 2023).1.  Global mobile and internet user projections by 20232.  Global devices and connections projections by 20233.  Global mobile projections by 20234.  Global Wi-Fi projections by 20235.  Global network performance projections (mobile, Wi-Fi, and fixed broadband) by 20236.  Global cybersecurity trends from 2018 to 2019Cisco Annual Internet Report ForecastThe Cisco Annual Internet Report is a global, regional and country level forecast/analysis that assesses digital transformation and is developed by the same analyst team that created the Cisco Visual Networking Index (VNI) Forecast. The report covers fixed broadband, Wi-Fi, and mobile (3G and below, 4G, 5G) networking. Quantitative projections are provided on the growth of internet users, devices and connections as well as network performance and new application requirements. Qualitative analyses and assessments are also provided in four strategic areas: applications, security, infrastructure transformation, and empowering employees and teams. Cisco Annual Internet Report MethodologyThe Cisco Annual Internet Report™ for 2018 to 2023 relies upon independent analyst forecasts and Cisco's own intellectual property. A detailed methodology description is included in the complete report. The Cisco® Annual Internet Report aims to provide credible industry metrics for internet growth to businesses national governments, network regulators, academic researchers, telecommunications companies, technology experts and industry/business press and analysts around the globe.Supporting ResourcesRSS feed for Cisco: http://newsroom.cisco.com/rss-feedsAbout Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks.  View original content to download multimedia:http://www.prnewswire.com/news-releases/new-cisco-annual-internet-report-forecasts-5g-to-support-more-than-10-of-global-mobile-connections-by-2023-301006163.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Reports Second Quarter Earnings",
        "subtitle": "",
        "date": "Feb 12, 2020 4:05PM EST",
        "content": "Dividend Increased 3 PercentSAN JOSE, Calif., Feb. 12, 2020 /PRNewswire/ -- Cisco today reported second quarter results for the period ended January 25, 2020. Cisco reported second quarter revenue of $12.0 billion, net income on a generally accepted accounting principles (GAAP) basis of $2.9 billion or $0.68 per share, and non-GAAP net income of $3.3 billion or $0.77 per share.\"I am incredibly proud of the innovation our teams continue to drive,\" said Chuck Robbins, chairman and CEO of Cisco. \"I am confident in our long-term growth opportunities as we help our customers build out the networks for the future.\"Reconciliations between net income, EPS, and other measures on a GAAP and non-GAAP basis are provided in the tables located in the section entitled \"Reconciliations of GAAP to non-GAAP Measures.\"Cisco Increases Quarterly Cash DividendCisco has declared a quarterly dividend of $0.36 per common share, a $0.01 increase or up 3% over the previous quarter's dividend, to be paid on April 22, 2020 to all shareholders of record as of the close of business on April 3, 2020. Future dividends will be subject to Board approval.\"We executed well this quarter by delivering strong margins and EPS growth while driving more software and subscriptions,\" said Kelly Kramer, CFO of Cisco. \"Our increased dividend shows confidence in the strength of our ongoing cash flows and demonstrates our commitment to shareholder return.\"Financial SummaryAll comparative percentages are on a year-over-year basis unless otherwise noted.Q2 FY 2020 HighlightsRevenue -- Total revenue was $12.0 billion, down 4%, with product revenue down 6% and service revenue up 5%. Revenue by geographic segment was: Americas down 5%, EMEA down 3%, and APJC down 1%. Product revenue was led by growth in Security, up 9%.  Infrastructure Platforms and Applications were each down 8%.Gross Margin -- On a GAAP basis, total gross margin, product gross margin, and service gross margin were 64.7%, 63.9%, and 66.6%, respectively, as compared with 62.5%, 61.0%, and 66.6%, respectively, in the second quarter of fiscal 2019.On a non-GAAP basis, total gross margin, product gross margin, and service gross margin were 66.4%, 65.9%, and 67.7%, respectively, as compared with 64.1%, 62.8%, and 67.7%, respectively, in the second quarter of fiscal 2019.Total gross margins by geographic segment were: 66.9% for the Americas, 65.8% for EMEA and 65.6% for APJC.Operating Expenses -- On a GAAP basis, operating expenses were $4.4 billion, down 4%. Non-GAAP operating expenses were $3.9 billion, down 1%, and were 32.7% of revenue.Operating Income -- GAAP operating income was $3.4 billion, up 5%, with GAAP operating margin of 28.2%. Non-GAAP operating income was $4.0 billion, up 1%, with non-GAAP operating margin at 33.7%.Provision for Income Taxes -- The GAAP tax provision rate was 18.6%. The non-GAAP tax provision rate was 20.0%.Net Income and EPS -- On a GAAP basis, net income was $2.9 billion and EPS was $0.68. On a non-GAAP basis, net income was flat at $3.3 billion, and EPS was $0.77, an increase of 5%.Cash Flow from Operating Activities -- $3.8 billion for the second quarter of fiscal 2020, flat compared with $3.8 billion for the second quarter of fiscal 2019.Balance Sheet and Other Financial HighlightsCash and Cash Equivalents and Investments -- $27.1 billion at the end of the second quarter of fiscal 2020, compared with $33.4 billion at the end of fiscal 2019.Deferred Revenue -- $18.7 billion, up 8% in total, with deferred product revenue up 19%. Deferred service revenue was up 2%.Remaining Performance Obligations -- $24.9 billion at the end of the second quarter of fiscal 2020, up 11%.Capital Allocation -- In the second quarter of fiscal 2020, we returned $2.4 billion to shareholders through share buybacks and dividends. We declared and paid a cash dividend of $0.35 per common share, or $1.5 billion, and repurchased approximately 18 million shares of common stock under our stock repurchase program at an average price of $46.71 per share for an aggregate purchase price of $870 million. The remaining authorized amount for stock repurchases under the program is $11.8 billion with no termination date.Guidance for Q3 FY 2020Cisco expects to achieve the following results for the third quarter of fiscal 2020:Cisco estimates that GAAP EPS will be $0.62 to $0.67 in the third quarter of fiscal 2020.A reconciliation between the Guidance for Q3 FY 2020 on a GAAP and non-GAAP basis is provided in the table entitled \"GAAP to non-GAAP Guidance for Q3 FY 2020\" located in the section entitled \"Reconciliations of GAAP to non-GAAP Measures.\"Editor's Notes: The Consolidated Statements of Operations include the results of the divested Service Provider Video Software Solutions (SPVSS) business for the six months ended January 26, 2019.Amounts may not sum and percentages may not recalculate due to rounding.During the second quarter of fiscal 2019 on October 28, 2018, we completed the divestiture of the SPVSS business. SPVSS business revenue for the six months ended January 26, 2019 was $168 million. Amounts may not sum and percentages may not recalculate due to rounding.During the second quarter of fiscal 2019 on October 28, 2018, we completed the divestiture of the SPVSS business. SPVSS business revenue for the six months ended January 26, 2019 was $168 million.      Amounts may not sum and percentages may not recalculate due to rounding. (1) In the third quarter of fiscal 2020, we initiated a restructuring plan in order to realign the organization and enable further investment in key priority areas with estimated pretax charges of approximately $300 million consisting of severance and other one-time termination benefits, and other costs. We expect to recognize approximately $150 million of these charges in the third quarter of fiscal 2020.(2) Estimated adjustments to GAAP earnings per share are shown after income tax effects.Except as noted above, this guidance does not include the effects of any future acquisitions/divestitures, asset impairments, restructurings and significant tax matters or other events, which may or may not be significant unless specifically stated.Forward Looking Statements, Non-GAAP Information and Additional InformationThis release may be deemed to contain forward-looking statements, which are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, among other things, statements regarding future events (such as our ability to continue to drive innovation, our long-term growth opportunities as we help our customers build out the networks for the future, the continued strength of our ongoing cash flows and our ability to continue to return value to our shareholders) and the future financial performance of Cisco (including the guidance for Q3 FY 2020) that involve risks and uncertainties. Readers are cautioned that these forward-looking statements are only predictions and may differ materially from actual future events or results due to a variety of factors, including: business and economic conditions and growth trends in the networking industry, our customer markets and various geographic regions; global economic conditions and uncertainties in the geopolitical environment; overall information technology spending; the growth and evolution of the Internet and levels of capital spending on Internet-based systems; variations in customer demand for products and services, including sales to the service provider market and other customer markets; the return on our investments in certain priorities, key growth areas, and in certain geographical locations, as well as maintaining leadership in routing, switching and services; the timing of orders and manufacturing and customer lead times; changes in customer order patterns or customer mix; insufficient, excess or obsolete inventory; variability of component costs; variations in sales channels, product costs or mix of products sold; our ability to successfully acquire businesses and technologies and to successfully integrate and operate these acquired businesses and technologies; our ability to achieve expected benefits of our partnerships; increased competition in our product and service markets, including the data center market; dependence on the introduction and market acceptance of new product offerings and standards; rapid technological and market change; manufacturing and sourcing risks; product defects and returns; litigation involving patents, intellectual property, antitrust, shareholder and other matters, and governmental investigations; our ability to achieve the benefits of the announced restructuring and possible changes in the size and timing of the related charges; cyber-attacks, data breaches or malware; vulnerabilities and critical security defects; terrorism; natural catastrophic events; a pandemic or epidemic; our ability to achieve the benefits anticipated from our investments in sales, engineering, service, marketing and manufacturing activities; our ability to recruit and retain key personnel; our ability to manage financial risk, and to manage expenses during economic downturns; risks related to the global nature of our operations, including our operations in emerging markets; currency fluctuations and other international factors; changes in provision for income taxes, including changes in tax laws and regulations or adverse outcomes resulting from examinations of our income tax returns; potential volatility in operating results; and other factors listed in Cisco's most recent reports on Forms 10-Q and 10-K filed on November 19, 2019 and September 5, 2019, respectively. The financial information contained in this release should be read in conjunction with the consolidated financial statements and notes thereto included in Cisco's most recent reports on Forms 10-Q and 10-K as each may be amended from time to time. Cisco's results of operations for the three and six months ended January 25, 2020 are not necessarily indicative of Cisco's operating results for any future periods. Any projections in this release are based on limited information currently available to Cisco, which is subject to change. Although any such projections and the factors influencing them will likely change, Cisco will not necessarily update the information, since Cisco will only provide guidance at certain points during the year. Such information speaks only as of the date of this release.This release includes non-GAAP net income, non-GAAP gross margins, non-GAAP operating expenses, non-GAAP operating income and margin, non-GAAP effective tax rates, non-GAAP interest and other income (loss), net, and non-GAAP net income per share data for the periods presented. It also includes future estimated ranges for gross margin, operating margin, tax provision rate and EPS on a non-GAAP basis.These non-GAAP measures are not in accordance with, or an alternative for, measures prepared in accordance with generally accepted accounting principles and may be different from non-GAAP measures used by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. Cisco believes that non-GAAP measures have limitations in that they do not reflect all of the amounts associated with Cisco's results of operations as determined in accordance with GAAP and that these measures should only be used to evaluate Cisco's results of operations in conjunction with the corresponding GAAP measures.Cisco believes that the presentation of non-GAAP measures when shown in conjunction with the corresponding GAAP measures, provides useful information to investors and management regarding financial and business trends relating to its financial condition and its historical and projected results of operations.For its internal budgeting process, Cisco's management uses financial statements that do not include, when applicable, share-based compensation expense, amortization of acquisition-related intangible assets, acquisition-related/divestiture costs, significant asset impairments and restructurings, significant litigation settlements and other contingencies, gains and losses on equity investments, the income tax effects of the foregoing and significant tax matters. Cisco's management also uses the foregoing non-GAAP measures, in addition to the corresponding GAAP measures, in reviewing the financial results of Cisco. In prior periods, Cisco has excluded other items that it no longer excludes for purposes of its non-GAAP financial measures. From time to time in the future there may be other items that Cisco may exclude for purposes of its internal budgeting process and in reviewing its financial results. For additional information on the items excluded by Cisco from one or more of its non-GAAP financial measures, refer to the Form 8-K regarding this release furnished today to the Securities and Exchange Commission.Cisco divested its Service Provider Video Software Solutions business (SPVSS) during the second quarter of fiscal 2019 on October 28, 2018. This release includes, where indicated, financial measures that exclude the SPVSS business. Cisco believes that the presentation of these measures provides useful information to investors and management regarding financial and business trends relating to its financial condition and its historical and projected results of operations because the SPVSS business will not be part of Cisco on a go forward basis. Cisco's management also uses the financial measures excluding the SPVSS business in reviewing the financial results of Cisco.About CiscoCisco (Nasdaq: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Copyright © 2020 Cisco and/or its affiliates. All rights reserved. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. To view a list of Cisco trademarks, go to: www.cisco.com/go/trademarks. Third-party trademarks mentioned in this document are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company. This document is Cisco Public Information.RSS Feed for Cisco: https://newsroom.cisco.com/rss-feeds   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-reports-second-quarter-earnings-301004015.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Announces February 2020 Event with the Financial Community",
        "subtitle": "",
        "date": "Jan 30, 2020 8:00AM EST",
        "content": "SAN JOSE, Calif., Jan. 30, 2020 /PRNewswire/ -- Cisco today announced that it will participate in the following conference with the financial community during the month of February. The session will be webcast.  Interested parties can view the event on Cisco's Investor Relations website at investor.cisco.com.Goldman Sachs Technology and Internet Conference 2020February 13, 202010:10 a.m. PT / 1:10 p.m. ETSan Francisco, CAChuck Robbins, Chairman and CEOAbout Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries.  A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners.  The use of the word partner does not imply a partnership relationship between Cisco and any other company.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-announces-february-2020-event-with-the-financial-community-300995564.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Schedules Conference Call for Q2 Fiscal Year 2020 Financial Results",
        "subtitle": "",
        "date": "Jan 29, 2020 4:30PM EST",
        "content": "SAN JOSE, Calif., Jan. 29, 2020 /PRNewswire/ -- Cisco has scheduled a conference call for Wednesday, February 12, 2020, at 1:30 PM (PT); 4:30 PM (ET) to announce its second quarter fiscal year 2020 financial results for the period ending Saturday, January 25, 2020.Financial results will be released over PR Newswire via US National and European Financial distribution, after the close of the market on Wednesday, February 12, 2020.Cisco's quarterly earnings press release will be posted at www.cisco.com under the \"Newsroom\" section. An archived version of the webcast will be available on Cisco Systems' Investor Relations website at https://investor.cisco.com. About Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company.RSS Feed for Cisco: http://newsroom.cisco.com/rss-feeds   View original content:http://www.prnewswire.com/news-releases/cisco-schedules-conference-call-for-q2-fiscal-year-2020-financial-results-300994629.htmlSOURCE  Cisco Systems, Inc."
    },
    {
        "title": "Cisco Accelerates Applications in a Hybrid Multicloud World",
        "subtitle": "",
        "date": "Jan 28, 2020 3:00AM EST",
        "content": "BARCELONA, Spain, Jan. 28, 2020 /PRNewswire/ -- News Summary:Businesses are realizing that applications are the business and the gateway to their customers. 78 percent of customers say their expectations of digital experiences are growing*.  As companies pivot towards becoming app-centric businesses, it places enormous strain on enterprise IT, exposing dangerous silos between teams and technologies. To help businesses address the increasing demand for flawless digital experiences, Cisco today unveiled a multi-domain approach that bridges application and infrastructure teams with full-stack visibility and operational insight, allowing both real-time and automated troubleshooting to ensure optimal application performance. A new Kubernetes-based application platform makes it easier for both DevOps and IT to embrace a multicloud world. New innovations from Cisco: \"Applications are now at the heart of every business but managing the IT infrastructure to ensure a positive user experience has never been more complex,\" said Liz Centoni, Senior Vice President and General Manager, Cloud, Compute and IoT at Cisco. \"These new technologies provide full visibility and deep insights into all aspects of infrastructure through the lens of application, simplifying real-time correction and automated predictability to identify and fix issues before they even happen. While some vendors provide visibility into apps or an individual tier of physical or virtual infrastructure, Cisco is the first to bridge all three with insight and proactive optimization up and down the stack. And with the HyperFlex Application Platform we are making Kubernetes, the new defacto standard for app developers, much easier to deploy and manage for both app and infrastructure teams.\"  \"Applications are changing the patient experience, offering new opportunities but also new challenges for our IT teams,\" said John Gaede, Director of Information Systems, Sky Lakes Medical Center. \"This new operating model from Cisco will arm my IT team with new insight and self-optimization, freeing us from day-to-day manual intervention, and allowing IT and DevOps to work together to increase innovation and deliver better outcomes for our patients.\" \"As organizations continue to rapidly adopt modern application architectures, IT teams are challenged by the increased complexity, scale and velocity of these environments,\" stated Bob Laliberte, Sr Analyst, ESG. \"This will drive organizations to embrace technology that connects application performance to infrastructure automation, increasing IT productivity, simplifying day two operations for Kubernetes and helping make IT more relevant and critical for DevOps teams and for the lines of businesses.\" Availability: Additional Resources: About Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Availability Disclaimer: Many of the products and features described herein remain in varying stages of development and will be offered on a when-and-if-available basis. This products and features are subject to change at the sole discretion of Cisco, and Cisco will have no liability for delay in the delivery or failure to deliver any of the products or features set forth in this document.*reference: App Attention Index 2019  View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-accelerates-applications-in-a-hybrid-multicloud-world-300994021.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Launches a Comprehensive Security Architecture for Industrial IoT",
        "subtitle": "",
        "date": "Jan 28, 2020 3:00AM EST",
        "content": "BARCELONA, Spain, Jan. 28, 2020 /PRNewswire/ --News Summary:Networks have become the foundational backbone for the operational technology (OT) that underpins critical infrastructure including energy, transportation, and manufacturing. Organizations increasingly require real-time access into the data these systems hold to improve production, manage costs, and enhance safety metrics. Today, Cisco introduced an IoT security architecture that provides enhanced visibility across both IT and OT environments, and protects industrial processes. Cisco's new solutions enable the collection and extraction of data from the IoT edge so organizations can increase efficiencies to make better business decisions and accelerate digitization projects. The volume of cyber security threats within critical infrastructure environments is rising and continues to pose significant human safety and financial risk. \"Changes in devices and connections need to be detected rapidly, assessed for vulnerabilities, and addressed before the organization's security erodes,\" states ARC Advisory Group Vice President, Sid Snitkin. Cisco is delivering comprehensive security by converging the IT and OT within security operations centers to provide advanced anomaly detection with built-in threat intelligence. \"Organizations need complete visibility into the most disparate of network environments in order to secure their industrial edge, lower the risk of cyber threats, and optimize industrial processes,\" said Liz Centoni, Senior Vice President and General Manager, Cloud, Compute and IoT at Cisco.Cisco's new IoT security architecture innovations include:Cisco has removed the complexity of a multi-vendor, multi-data, and multi-asset infrastructure to deliver simple IoT cyber security solutions that can be managed on any of Cisco's gateways, switches, or routers, bringing end-to-end security and simplified data management together. Additional Resources:About Cisco Cisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.  Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company.   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-launches-a-comprehensive-security-architecture-for-industrial-iot-300993998.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Contact Center Portfolio Enhancements Revolutionize Customer and Agent Experiences",
        "subtitle": "",
        "date": "Jan 28, 2020 3:00AM EST",
        "content": "BARCELONA, Spain, Jan. 28, 2020 /PRNewswire/ --News Summary:The world's best brands earn customer loyalty over years, even decades – only to lose it in a few seconds if the customer experience is not stellar. While customer needs and expectations have changed, the ways in which companies respond have not kept pace. It's time for a radical change. Today, Cisco announced three developments that will help bring about this radical change—an AI infusion, a new customer experience solution, and a new cloud contact center product. Together, they fundamentally transform the customer experience with contact centers, for the better.First, Cisco announced new integrations with Voicea and Google Cloud's Contact Center AI (CCAI), that turn agents into \"super agents\". Cisco also announced Cisco Webex Experience Management (formerly CloudCherry), which empowers contact center staff with real-time visibility into how customers are feeling, in order to radically change the experience. Additionally, all of this innovation is now available on Cisco Webex Contact Center Enterprise. \"For decades, Cisco has partnered with the world's largest contact centers to solve their most complex problems. Today, we are making possible an entirely new and improved customer and agent experience,\" said Omar Tawakol, Vice President and General Manager, Contact Center at Cisco Collaboration. \"Through the application of AI, we will help contact centers of all sizes radically transform their customer's experiences to meet the demands of today's sophisticated consumer.\"Announcement highlights include:Cisco (Voicea) and Google Cloud's Contact Center AI Integrations Cisco is looking to massively transform the customer and agent experience by infusing AI into its contact center portfolio – empowering agents to provide high-touch customer support and improved overall customer experience. To accomplish this, we're taking a best-of-breed approach that combines our proprietary AI capabilities through recent acquisitions, along with best-in-class partner technology such as Google Cloud's Contact Center AI. The integration of Voicea turns contact center agents into super agents. As an agent talks to a customer on the phone, Voicea provides a call transcript and summary to automate the agent's call wrap-up, ensuring no action item goes unaddressed. Additionally, call highlights can be automatically synched with your CRM so that agents and supervisors can easily reference past support issues. We will continue to add new capabilities into Voicea (and customers will automatically have access to new features as they're added). Additionally, Cisco is excited to expand its partnership with Google Cloud to bring CCAI-enabled capabilities (such as conversational IVR, chatbots and agent assist) to its contact center portfolio. With conversational IVR, businesses can move beyond rigid phone trees to provide the next generation of natural, conversational experiences to the contact center. Customers can say or chat in a few words what they're looking to do and using Google Cloud's NLU the customer can either self-serve simple tasks (change password or check account balance), or be routed to the best available agent for more complex asks. By incorporating Google Cloud's Contact Center AI capabilities into the contact center, customers have 24/7 access to virtual agents to self-serve simple tasks. Additionally, for more complex issues, conversational routing accelerates the ability to connect customers to a live agent. \"When it comes to the contact center, Cisco and Google Cloud share a common goal: improve the customer experience while increasing operational efficiency. That's why we're working together so closely to build an end-to-end solution for our customers,\" said Antony Passemard, Conversational AI and CCAI Lead, Google Cloud. \"By combining Cisco's rich contact center technology with Google Cloud's CCAI NLU and Speech capabilities, businesses will be able to reduce average handle time, help agents provide the best possible customer service, and ultimately increase the brand's NPS/CSAT scores.\" Webex Experience Management Webex Experience Management drives the industry forward by blending contact center data and sentiment data. Contact centers have had the tools to engage with their customers via chat, email, and SMS. However, what's been missing is the intelligence telling them when, who, and how to engage with a customer.Webex Experience Management (based on the CloudCherry acquisition) empowers contact center staff with real-time visibility into how customers are feeling in order to radically change their experience, helping companies drive loyalty and improve CES, NPS, and CSAT scores. It removes data siloes that make it impossible to do a meaningful analysis of what customers are experiencing as they navigate throughout the organization. It also identifies \"at risk\" customers so organizations can \"close the loop\" and be proactive in serving them better. For example:Webex Contact Center Enterprise  All this great innovation is available on the new Webex Contact Center Enterprise, a new cloud solution that provides a trustworthy path to the cloud for large contact center enterprises. It's a Cisco-backed solution combining security, reliability, and feature richness – the first of its kind. It is based on Cisco's mature, market-leading Contact Center Enterprise product, so you get proven stability, reliability, and the deep feature set that's made Cisco a leader. It's also built on the Webex Platform for Contact Center, an open and flexible multi-tenant cloud architecture that enables fast access to new capabilities, agility, and speed of innovation. Like the rest of our portfolio, it is supported across the globe with data centers in North America, Europe, Australia, and Asia. It is included in Cisco's Collaboration Flex Plan, which provides current customers a financial path for on-premises to cloud migration at a pace that works for them.  It supports up to 24,000 agents and includes all the great features you'd expect from a market leader who has spent 20 years working to delight the world's largest contact centers.Key Facts Additional ResourcesAbout CiscoCisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Availability Disclaimer: Many of the products and features described herein remain in varying stages of development and will be offered on a when-and-if-available basis. These products and features are subject to change at the sole discretion of Cisco, and Cisco will have no liability for delay in the delivery or failure to deliver any of the products or features set forth in this document.   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-contact-center-portfolio-enhancements-revolutionize-customer-and-agent-experiences-300993945.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Webex Delivers AI, Secure Intelligent Collaboration for All",
        "subtitle": "",
        "date": "Jan 28, 2020 3:00AM EST",
        "content": "BARCELONA, Spain, Jan. 28, 2020 /PRNewswire/ --News Summary: Would you like to have better, more engaged meetings? Today at Cisco Live Europe, Cisco announced innovations to do just that—using only your voice. We're introducing new AI-powered voice intelligence capabilities to Webex Meetings to help turn talk into action. The Cisco Webex Assistant for Webex Meetings is powered by technology from the recent Voicea acquisition, turning Webex meetings into a digital treasure trove.\"Voicea users have reported saving more than six hours per week per user with more actionable and efficient meetings – and we believe Webex users will experience similar results,\" said Sri Srinivasan, Senior Vice President and General Manager, Team Collaboration at Cisco. \"We're excited to bring this and other cognitive features to the 300 million users we already serve with Cisco Collaboration. This technology will fundamentally change how we are able to deliver massively personalized experiences and transform the way we work.\"Webex Assistant for Meetings becomes the first digital in-meeting assistant for the enterprise. With it, voice commands automate mundane meeting tasks (like taking notes, transcribing and follow-up) so users can focus on the meeting. Not only can you see closed captioning and instantly transcribe what is said, you can also tell Webex what points to highlight. The recorded transcripts become searchable—not just within the meeting, but across meetings. It also creates action items, so no one forgets who committed to do what. And, speaker labeling makes sure you know who is saying what during the meeting. In addition, a host of post-meeting features enable easy editing and sharing of all the meeting assets. (In related news, Voicea technology is also integrated into the Cisco contact center portfolio. Read more here).Customer benefits include:Cisco also announced three additional important updates which include: Webex Assistant Learns Spanish: \"¡Hola, Webex!\"Cisco added conversational AI to Webex Rooms in 2017. With Webex Assistant for Webex Rooms, you can use your voice to join meetings, make a call, and control our room devices. It makes life a lot easier.   Spanish is one of the most spoken languages in the world—and it was the #1 customer request for what language Webex Assistant should learn next. So, Webex Assistant is learning Spanish! Soon, users will be able to speak either English or Spanish to Webex Room devices, and Webex Assistant will understand and talk back in the preferred language.  You'll be able to say things like:Now that the hard engineering work of making sure Webex is ready to handle other languages is done, Webex is busy learning other languages, too. What's next? Stay tuned!  Continued industry-leading commitment to security and data privacyCisco is the world's largest cybersecurity company, so it should come as no surprise that the security and privacy of your data is top of mind for us. Building on our true end-to-end encryption and multilayer security, we now give customers a choice as to whether their Webex Teams data (Users, Keys, Messages and Files) will be stored in Europe or the United States. We already provide this for Webex Meetings – this is a continuation of our commitment to your security and data privacy. Cisco is the only collaboration company solving these complex problems for customers. No other full-stack collaboration company has addressed these issues.New Cisco Webex Room USBSmall and mid-sized businesses are under as much pressure as larger organizations to transform. The new Cisco Webex Room USB gives smaller organizations collaboration without compromise—amazing quality and security in an affordable, entry-level video device for huddle rooms and small open spaces. It is an attractive alternative to other entry-level solutions in this space, but with the quality experience you'd expect from Cisco in addition to easy installation and management. It's perfect for the smaller organization getting started with video room devices, but looking for a business-class solution that doesn't create added complexity and cost.  Research has found there may already be as many as 25 million huddle spaces around the world, with more springing up daily. However, 78 percent of respondents expressed dissatisfaction with current meeting room techniques; and 65 percent said half or more of their huddle spaces need video conferencing capabilities. Clearly, as more spaces are added, IT will need the manageability that Cisco is known for. Additional ResourcesAbout CiscoCisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Availability Disclaimer: Many of the products and features described herein remain in varying stages of development and will be offered on a when-and-if-available basis. These products and features are subject to change at the sole discretion of Cisco, and Cisco will have no liability for delay in the delivery or failure to deliver any of the products or features set forth in this document.   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-webex-delivers-ai-secure-intelligent-collaboration-for-all-300993943.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Live 2020 Barcelona Showcases Latest Transformative Technologies",
        "subtitle": "",
        "date": "Jan 28, 2020 2:59AM EST",
        "content": "BARCELONA, Spain, Jan. 28, 2020 /PRNewswire/ --News Summary:Cisco Live 2020 Barcelona opens today, and runs through January 31, at Fira de Barcelona in Spain, bringing together nearly 20,000 customers, partners, IT professionals and visionaries. The event is designed to help customers realize the full realm of opportunities open to them, and give them the cutting-edge knowledge, skills, and technologies to make it happen.Throughout the week, innovations across Cisco's cybersecurity, networking and collaboration portfolios, as well as within its DevNet program will be unveiled – all designed to help businesses scale, stay secure, and drive digitization. Keynote presentations from Cisco's President of Europe, Middle East, Africa and Russia (EMEAR) region, Wendy Mars, and the Executive Vice President and General Manager of Cisco's Networking and Security Business, David Goeckeler, as well as other Cisco business leaders, will showcase the company's strategy to help partners and customers seize new business opportunities in the era of digital transformation. \"Cisco is central to helping customers achieve business outcomes beyond what was once thought possible, amidst the fastest and largest tech transition in history,\" said Mars. \"Organizations worldwide - small to large and across all sectors - are still in the early days of harnessing the sheer potential of many emerging technologies like AI, 5G, adaptive and predictive cybersecurity, intelligent IoT, and more. We are delighted to welcome our customers and partners to Cisco Live and help them capture the real business value that these exciting new technologies can deliver.\"News highlights include:Conference highlights include:Additional ResourcesAbout CiscoCisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at cisco.newsroom.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries.  A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners.  The use of the word partner does not imply a partnership relationship between Cisco and any other company.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-live-2020-barcelona-showcases-latest-transformative-technologies-300994131.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco Appoints AMD President and CEO Dr. Lisa T. Su to Board of Directors",
        "subtitle": "",
        "date": "Jan 27, 2020 4:30PM EST",
        "content": "SAN JOSE, Calif., Jan. 27, 2020 /PRNewswire/ --News Summary:Cisco today announced the appointment of Dr. Lisa T. Su, AMD president and CEO, to its board of directors effective today. \"Lisa is an accomplished business leader with deep expertise in the semiconductor industry,\" said Chuck Robbins, chairman and CEO, Cisco. \"We look forward to her contributions to Cisco's board and our business as we continue to develop ground breaking technologies, and a new internet for the 5G era that will help our customers innovate faster than ever before.\"Dr. Su, 50, joined AMD in 2012 and has held the position of President and Chief Executive Officer since October 2014. She also serves on AMD's Board of Directors. Previously, Dr. Su served as Senior Vice President and General Manager, Networking and Multimedia at Freescale Semiconductor, Inc., and was responsible for global strategy, marketing and engineering for the company's embedded communications and applications processor business. Dr. Su joined Freescale in 2007 as Chief Technology Officer, where she led the company's technology roadmap and research and development efforts. Dr. Su spent the previous 13 years at IBM in various engineering and business leadership positions, including Vice President of the Semiconductor Research and Development Center responsible for the strategic direction of IBM's silicon technologies, joint development alliances and semiconductor R&D operations. Prior to IBM, she was a member of the technical staff at Texas Instruments Incorporated from 1994 to 1995. Dr. Su has a Bachelor of Science, Master of Science and Doctorate degrees in Electrical Engineering from the Massachusetts Institute of Technology (MIT). For more information about Cisco's board of directors visit here.About CiscoCisco (NASDAQ: CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco.Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company.   View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-appoints-amd-president-and-ceo-dr-lisa-t-su-to-board-of-directors-300993828.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco 2020 Data Privacy Benchmark Study Confirms Positive Financial Benefits of Strong Corporate Data Privacy Practices",
        "subtitle": "",
        "date": "Jan 27, 2020 8:30AM EST",
        "content": "SAN JOSE, Calif., Jan. 27, 2020 /PRNewswire/ --News Summary:Cisco, today, published its 2020 Data Privacy Benchmark Study, the company's third annual look into corporate data privacy practices worldwide and shows growing tangible benefits for businesses that adopt strong privacy practices. The Study is based on results from a double-blind survey of over 2,800 security professionals in organizations of various sizes across 13 countries.  It provides deep insight into the state of privacy a year and a half after the effective date of the European Union's General Data Protection Regulation (GDPR), widely considered a turning point on how organizations control and manage the use of personal data. Customer demands for increased data protection and privacy, the ongoing threat of data breaches and misuse by both unauthorized and authorized users, and preparation for the GDPR and similar laws around the globe spurred many organizations to make considerable privacy investments – which are now delivering strong returns. Key findings include: Cisco Vice President & Chief Privacy Officer Harvey Jang noted, \"With this Study, we now have empirical evidence of privacy investments paying off for companies—particularly with improved customer relationships, revenue impact, and real bottom-line results.\"As markets continue to evolve, organizations should consider prioritizing their privacy investments on:  To learn more about how Cisco manages personal data in its products and services, please see Cisco's Data Privacy Sheets and Cisco's Data Privacy Maps. The data maps provide a visual representation of how Cisco products collect and handle personal data.Additional Resources About CiscoCisco (NASDAQ:CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks. View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-2020-data-privacy-benchmark-study-confirms-positive-financial-benefits-of-strong-corporate-data-privacy-practices-300993214.htmlSOURCE  Cisco"
    },
    {
        "title": "Cisco and Goldman Sachs to host ESG Conference Call/Webcast for the Financial Community on 1/14/2020",
        "subtitle": "",
        "date": "Jan 7, 2020 8:00AM EST",
        "content": " SAN JOSE, Calif., Jan. 7, 2020 /PRNewswire/ -- Cisco and Goldman Sachs will host an ESG (Environmental, Social and Governance) Conference Call/Webcast for the Financial Community at 8:00 a.m. PT/11:00 a.m. ET/4:00 p.m. GMT, on Tuesday, January 14th 2020. Katherine Toch, Director, People and Communities, and Darrel Stickler, Global Environmental Sustainability Lead at Cisco, will provide an overview of Cisco's Corporate Social Responsibility (CSR) strategy and priorities, provide an update on progress towards goals, and explain why Cisco's CSR initiatives play an important role in overall shareholder value creation. The call will be hosted by Derek Bingham and Evan Tylenda CFA, analysts in Goldman Sachs' Global Investment Research division and authors of the GS SUSTAIN ESG research series. Interested parties can participate by dialing toll-free: 877-208-2954 or international: +1 973-528-0056, Code: 785452, or listening to the webcast at cisco.investor.com Further information and Cisco's 2019 CSR Report can be found at csr.cisco.com About Cisco Cisco (NASDAQ:CSCO) is the worldwide technology leader that has been making the Internet work since 1984. Our people, products, and partners help society securely connect and seize tomorrow's digital opportunity today. Discover more at newsroom.cisco.com and follow us on Twitter at @Cisco. Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. A listing of Cisco's trademarks can be found at www.cisco.com/go/trademarks.About GS SUSTAINGS SUSTAIN is a global investment strategy focused on the generation of long-term alpha through identifying high quality industry leaders. The GS SUSTAIN 50 list includes leaders believed to be well positioned to deliver long-term outperformance through superior returns on capital, sustainable competitive advantage and effective management of ESG risks vs. global industry peers. Candidates are selected largely on a combination of quantifiable analysis of these three aspects of corporate performance.    View original content to download multimedia:http://www.prnewswire.com/news-releases/cisco-and-goldman-sachs-to-host-esg-conference-callwebcast-for-the-financial-community-on-1142020-300982169.htmlSOURCE  Cisco"
    },
    {
        "title": "Tech-Enabled Legal Services Disrupt Counterfeiters",
        "subtitle": "Rowan TELS Helps Cisco Shut Down Counterfeit Networks",
        "date": "Dec 16, 2019 9:00AM EST",
        "content": "SAN FRANCISCO, Dec. 16, 2019 /PRNewswire/ -- Global sales of counterfeit goods is projected to reach 1.82 Trillion USD annually by the year 20201, representing approximately 3.5% percent of global trade2–underscoring the acute need for new and innovative approaches. The technology industry is the most highly targeted by counterfeiters, according to the OECD2, accounting for 42% of counterfeit products sold globally. Relying upon research and analytics provided by technology-enabled legal services (TELS) company Rowan, a federal judge barred four criminal confederations of foreign companies from selling counterfeit Cisco networking products on thousands of websites and online marketplaces.Rowan's approach changes the economics of counterfeiting by using technology to identify the largest networks of high-volume counterfeiters (HVCs). The approach uses litigation to quickly obtain broad injunctive relief that strikes at the basic tools of commerce used by counterfeiters. Cisco obtained a broad injunction that will prevent sales of counterfeit products by these defendants and will send a message that Cisco will pursue all available options to protect its customers and partners.\"Online counterfeit sales have long been viewed as an insurmountable cost of doing business,\" said John Amster, Founder and CEO of Rowan.  \"Our technology enabled approach provides a scalable, cost-effective solution that will benefit manufacturers, marketplaces and consumers.\"\"Combating counterfeiting and intellectual property theft is a sizeable challenge facing the entire tech sector and puts public health, safety and national security at risk,\" said Mark Chandler, Executive Vice President, General Counsel at Cisco. \"Rowan's approach disrupts the counterfeiters' entire ecosystem, and we encourage all companies facing this pervasive problem to join this effort.\"1 Research and Markets2 OECD View original content to download multimedia:http://www.prnewswire.com/news-releases/tech-enabled-legal-services-disrupt-counterfeiters-300975012.htmlSOURCE  Cisco; Rowan"
    }
]