[
    {
        "title": "CoStar Group Promotes Two Female Leaders, Adding to the Company’s Robust Executive Team",
        "subtitle": "",
        "date": "Mar 4, 2020 2:36PM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group (NASDAQ: CSGP), the leading provider of commercial real estate information, analytics and online marketplaces, is pleased to announce the promotion of Jaye Campbell to General Counsel and Secretary and Jeannette C. Koonce to Chief Compliance Officer.\n\nMs. Campbell is responsible for leading CoStar Group’s legal team and overseeing legal affairs. She joined CoStar Group in 2013 and has held various positions in CoStar Group’s legal department, most recently, Head of Litigation. Prior to joining CoStar Group, Ms. Campbell practiced at the law firm Drinker, Biddle & Reath, where she specialized in intellectual property and technology law. She received her Juris Doctor degree from The George Washington University Law School and holds a bachelor’s degree in foreign service from Georgetown University.\n\nOf Campbell’s accomplishments at CoStar Group, she is most proud of the team she has helped build to meet the needs of a company that is still growing. Campbell describes her team as “talented, hard-working, and diverse” – a mix of talent from inside CoStar Group, attorneys from law firms, and lawyers from other in-house roles. “We're the legal team that helps CoStar Group get to 'yes' in business matters,” Campbell said. “We have a track record of identifying legal cases to bring forward to protect CoStar content for customers, shareholders, and our employees who have invested in that content.”\n\nCampbell's work at CoStar Group led to a half-billion dollar judgment in the company's favor, the largest judgment for infringement of copyrighted images in history. \"The case had spectacular twists and turns,\" Campbell said, including her team unearthing evidence that ultimately was used to indict a third party on criminal charges related to child sex trafficking. \"When I left private practice in 2013,\" Campbell said, \"I would have laughed if you said that in my role at CoStar, I would train the FBI on how to process terabytes of electronic evidence.\"\n\nAs for the legal team's future challenges, Campbell believes CoStar Group is \"at a size and scale where we need to focus on risk management, and there is no one better to lead that effort than Jeannette [Koonce].”\n\nMs. Koonce joined the CoStar Group team in January 2006 as Deputy General Counsel. She oversees and makes recommendations with respect to risk management and corporate governance. Prior to joining CoStar Group, Ms. Koonce was an associate at Venable LLP, where she practiced securities, mergers and acquisitions, and general corporate law. Ms. Koonce received her Juris Doctor from the College of William and Mary and a bachelor’s degree in political science from Boston College. Koonce is a graduate of the KPMG Executive Leadership Institute for Women, a year-long program that provided her with a comprehensive understanding of the principles and practical skills necessary to be an excellent leader.\n\nOver the past 14 years, Koonce has played an active role in CoStar Group’s robust mergers and acquisitions activity, completing more than 25 domestic and international acquisitions, including the company’s acquisition of Apartments.com, which introduced CoStar Group to the apartments listings business. During her tenure, CoStar Group’s market cap has increased from approximately $750 million to over $25 billion. Koonce also handles CoStar Group’s filings with the Securities and Exchange Commission, including equity offerings and periodic reports.\n\nDuring her time at CoStar Group, Koonce has also been a valuable contributor and advisor to the company's philanthropic arm, CoStar Group Builds, for nearly five years and previously served on the board of Mentors, Inc., one of the organizations CoStar Group Builds supports, for more than four years. Koonce was instrumental in guiding the merger of Mentors, Inc. with Kid Power in July 2019.\n\n“I look forward to overseeing CoStar Group’s international risk management and corporate governance in my new role,” Koonce said. She will continue to be involved with the company’s mergers and acquisitions growth strategy.\n\n“Both Jaye and Jeannette possess remarkable expertise and leadership that is invaluable to the continued growth and success of our organization,” said Founder and CEO Andrew Florance. “We are incredibly proud of their accomplishments and appreciate the dedication and commitment they bring to their new roles. I know they will continue to play an integral role in the company’s achievements.”\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 47 million unique monthly visitors in aggregate in the fourth quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe, Canada and Asia with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005739/en/\nMedia Contact:\nMatthew Blocher\nCoStar Group\n(202) 346-6775\nmblocher@costar.com\nSource: CoStar Group"
    },
    {
        "title": "CoStar Group 2019 Net Income Increases 32% Year-over-Year on Revenue Growth of 17%",
        "subtitle": "",
        "date": "Feb 25, 2020 4:00PM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP), the leading provider of commercial real estate information, analytics and online marketplaces, announced today that revenue for the year ended December 31, 2019, was $1.4 billion, an increase of 17% over revenue of $1.2 billion for the full year of 2018. Revenue for the fourth quarter ended December 31, 2019, was $375 million, an increase of 19% over revenue of $316 million for the fourth quarter of 2018.\n\nNet income for the year ended December 31, 2019 was $315 million, an increase of 32% compared to net income of $238 million for the full year of 2018. Net income for the fourth quarter of 2019 was $88 million or $2.39 per diluted share, an increase of 5% compared to net income of $84 million for the fourth quarter of 2018. EBITDA for the full year of 2019 was $445 million, an increase of 27% compared to EBITDA of $351 million for the full year of 2018.\n\n“2019 was a banner year for CoStar Group in both revenue and sales growth,” said Andrew C. Florance, Founder and Chief Executive Officer of CoStar Group. “We reported $1.4 billion in revenue for the full year, adding over $200 million of revenue over the full year 2018. Our team delivered outstanding net new sales bookings of $210 million, up 24% over 2018. Over the past year, we have been talking about the huge potential for the next chapter of LoopNet. In the fourth quarter of 2019, we saw concrete results when we sold 5X the LoopNet Signature Ads compared to the same quarter a year ago. Our Apartments.com team had an exceptional year, growing Multifamily revenue 21% year-over-year. We have had great success this past year selling solutions to the massive, relatively untapped sub-100-unit apartment market and the residential rental market.”\n\n\"We are now even more excited about the potential of a great company like STR combined with CoStar’s resources and technology.\" Florance continued, “Our immediate focus is on creating a more powerful STR by consolidating disparate STR products and CoStar into one seamlessly integrated platform. We expect STR to contribute revenue in the range of $61 to $63 million in 2020.\"\n\nAdjusted EBITDA (which excludes stock-based compensation, acquisition and integration related costs and other items as described below) for the full year of 2019 was $507 million, an increase of 21% compared to adjusted EBITDA of $418 million for the full year of 2018.\n\nNon-GAAP net income (which excludes amortization of acquired intangible assets, stock-based compensation and other items as described below) for the full year of 2019 was $373 million or $10.19 per diluted share, an increase of $72 million or 24% versus the full year of 2018.\n\n2020 Outlook\n\nThe Company expects revenue in the range of $1.650 billion to $1.665 billion for the full year of 2020, representing growth of 18% to 19% for the year. This guidance includes an estimated full year 2020 revenue contribution from STR of $61 to $63 million. We expect revenue for the first quarter of 2020 in the range of $387 million to $392 million, representing revenue growth of 19% at the midpoint of the range.\n\nThe Company expects adjusted EBITDA in a range of $520 million to $530 million for the full year of 2020, an increase of 4% at the midpoint of the range. For the first quarter of 2020, the Company expects adjusted EBITDA in a range of $115 million to $120 million.\n\nWe expect full-year 2020 non-GAAP net income per diluted share in a range of $10.20 to $10.40 based on 36.8 million shares. For the first quarter of 2020, we expect non-GAAP net income per diluted share in a range of $2.25 to $2.35 based on 36.7 million shares. These ranges include a non-GAAP tax rate of 25%.\n\nThe preceding guidance does not include any operating results from the proposed RentPath acquisition.\n\nThe preceding forward-looking statements reflect CoStar Group’s expectations as of February 25, 2020, including forward-looking non-GAAP financial measures on a consolidated basis. Given the risk factors, uncertainties and assumptions discussed above, actual results may differ materially. Other than in publicly available statements, the Company does not intend to update its forward-looking statements until its next quarterly results announcement.\n\nReconciliation of EBITDA, adjusted EBITDA, non-GAAP net income and non-GAAP net income per diluted share and other disclosed non-GAAP financial measures to their GAAP basis results are shown in detail below, along with definitions for those terms. A reconciliation of forward-looking non-GAAP guidance to the most directly comparable GAAP measure, net income, can be found within the tables included in this release.\n\nNon-GAAP Financial Measures\n\nFor information regarding the purpose for which management uses the non-GAAP financial measures disclosed in this release and why management believes they provide useful information to investors regarding the Company’s financial condition and results of operations, please refer to the Company’s latest periodic report.\n\nEBITDA is a non-GAAP financial measure that represents GAAP net income attributable to CoStar Group before interest and other income (expense), loss on debt extinguishment, income taxes, depreciation and amortization.\n\nAdjusted EBITDA is a non-GAAP financial measure that represents EBITDA before stock-based compensation expense, acquisition- and integration-related costs for pending and completed acquisitions, restructuring costs, and settlements and impairments incurred outside the Company’s normal course of business.\n\nNon-GAAP net income is a non-GAAP financial measure determined by adjusting GAAP net income attributable to CoStar Group for stock-based compensation expense, acquisition- and integration-related costs for pending and completed acquisitions, restructuring costs, settlement and impairment costs incurred outside the Company's normal course of business and loss on debt extinguishment, as well as amortization of acquired intangible assets and other related costs, and then subtracting an assumed provision for income taxes. In 2020, the Company is assuming a 25% tax rate in order to approximate our statutory corporate tax rate excluding the impact of discrete items.\n\nNon-GAAP net income per diluted share is a non-GAAP financial measure that represents non-GAAP net income divided by the number of diluted shares outstanding for the period used in the calculation of GAAP net income per diluted share. For periods with GAAP net losses and non-GAAP net income, the weighted average outstanding shares used to calculate non-GAAP net income per share includes potentially dilutive securities that were excluded from the calculation of GAAP net income per share as the effect was anti-dilutive.\n\nEarnings Conference Call\n\nManagement will conduct a conference call at 5:00 PM EST on Tuesday, February 25, 2020 to discuss earnings results for the fourth quarter and full year 2019 and the Company’s outlook. The audio portion of the conference call will be broadcast live over the Internet at investors.costargroup.com. To join the conference call by telephone, please dial (844) 721-7241 (from the United States and Canada) or (409) 207-6955 (from all other countries) and refer to access code 910916. The webcast replay will also be available in the Investor section of CoStar Group's website for a period of time following the call.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 47 million unique monthly visitors in aggregate in the fourth quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe, Canada and Asia with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\n\nThis news release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about CoStar's plans, objectives, expectations, beliefs and intentions and other statements including words such as “hope,” “anticipate,” “may,” “believe,” “expect,” “intend,” “will,” “should,” “plan,” “estimate,” “predict,” “continue” and “potential” or the negative of these terms or other comparable terminology. Such statements are based upon the current beliefs and expectations of management of CoStar and are subject to many risks and uncertainties. Actual results may differ materially from the results anticipated in the forward-looking statements. The following factors, among others, could cause or contribute to such differences: the risk that the trends stated or implied by this release cannot or will not be sustained at the current pace, including trends related to revenue, net income, non-GAAP net income, EBITDA, adjusted EBITDA, and sales bookings; the risk that the Company is unable to sustain current revenue, earnings and bookings growth rates or increase them; the risk that CoStar’s and STR’s products cannot be combined successfully into a seamless integrated platform when or as expected; the risk that the amount of revenue STR contributes in 2020 will not be as expected and stated in this release; the risk that revenues for the first quarter and full year 2020 will not be as stated in this press release; the risk that net income for the first quarter and full year 2020 will not be as stated in this press release; the risk that adjusted EBITDA for the first quarter and full year 2020 will not be as stated in this press release; the risk that non-GAAP net income and non-GAAP net income per diluted share for the first quarter and full year 2020 will not be as stated in this press release; and the risk that the tax rate estimates stated in this press release are incorrect or may change. More information about potential factors that could cause results to differ materially from those anticipated in the forward-looking statements include, but are not limited to, those stated in CoStar’s filings from time to time with the Securities and Exchange Commission, including in CoStar’s Annual Report on Form 10-K for the year ended December 31, 2018, and Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, each of which is filed with the SEC, including in the “Risk Factors” section of those filings, as well as CoStar’s other filings with the SEC available at the SEC’s website (www.sec.gov). All forward-looking statements are based on information available to CoStar on the date hereof, and CoStar assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225006019/en/\nScott Wheeler\nChief Financial Officer\n(202) 336-6920\nswheeler@costar.com\n\nSarah Spray\nVice President\nInvestor Relations\n(202) 346-6394\nsspray@costar.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group Expands Recognition of Elite Brokers, Launches Power Broker Quarterly Deals",
        "subtitle": "",
        "date": "Feb 20, 2020 3:48PM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP), the leading provider of commercial real estate information, analytics and online marketplaces, is expanding the way it recognizes brokers and the deals that make a notable impact on the commercial real estate industry.\n\nAs part of that effort, CoStar Group announces the launch of Power Broker Quarterly Deals, which are designed to recognize brokers and their top deals every calendar quarter. Power Broker Quarterly Deals winners will enjoy a suite of benefits and promotions, including being reported on by CoStar News and being featured on CoStar.com, which is used by more than 140,000 commercial real estate professionals including 95% of the top 1,000 brokerage firms.\n\n“CoStar Group is excited about the opportunity to bring increased recognition to brokers and the exceptional deals they work hard on,” said Lisa Ruggles, CoStar Senior Vice President of Global Marketing Research.\n\nPower Broker Quarterly Deals winners will be determined based on transaction price and square footage. To be considered for the First Quarter 2020 Power Broker Quarterly Deals to be recognized among commercial real estate’s elite, brokers must submit deals by April 7, 2020.\n\nFor more information and to enter your deals for consideration visit costarpowerbrokers.com.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005900/en/\nMatthew Blocher\nCoStar Group\nmblocher@costar.com\n202.346.6775\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group Agrees to Acquire RentPath from Chapter 11 Bankruptcy",
        "subtitle": "",
        "date": "Feb 11, 2020 7:07PM EST",
        "content": "\nCoStar Group expects to invest in Rent.com and ApartmentGuide.com to preserve and grow leads for RentPath’s 28,000 clients\n\nCoStar Management to Hold Conference Call at 8:00 AM Wednesday February 12 to Discuss\n    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP) the leading provider of commercial real estate information, analytics and online marketplaces, announced today that it has signed an agreement to acquire RentPath’s business for $588 million in cash, in connection with RentPath’s recently announced Chapter 11 bankruptcy process.\n\nRentPath’s primary service is digital marketing for rental properties through a network of Internet listing websites, including Rent.com, ApartmentGuide.com, Rentals.com and Lovely.com. The RentPath network of websites generated over 21 million monthly visits and almost 9 million monthly unique visitors in 2019, according to comScore, and had approximately 28,000 properties advertised on its network as of December, 2019. RentPath is headquartered in Atlanta, Georgia and has approximately 770 employees.\n\n“RentPath has a 30-year track record of outstanding service to the multifamily industry, developing thousands of meaningful customer relationships,” said Andrew C. Florance, Founder and Chief Executive Officer of CoStar Group. “Obviously, it is very challenging for newspapers, magazines, and print directories to reinvent themselves as profitable digital businesses. RentPath was burdened with a heavy debt load that prevented the company from making the necessary investments in building brand recognition and generating traffic from Google. As the cost of Google traffic soared, RentPath was unable to keep pace. Following restructuring in bankruptcy, CoStar Group expects the combined companies to benefit from synergies and plans to invest in building RentPath’s online brands and traffic to provide improved quantity and quality of lead flow to advertising clients. The Apartments.com network of sites generated 842 million visits last year, and we intend to use this valuable audience to generate leads for RentPath clients as well.”\n\n“We believe there is untapped potential to serve the millions of landlords traditionally overlooked by online apartment marketplaces, which tend to focus on large apartment communities with over 100 units. We believe that investing in an excellent URL like Rent.com is the perfect vehicle for reaching that underserved audience.”\n\n“CoStar Group operates a number of large and growing online marketplaces,” continued Florance. “We believe that RentPath’s talented and experienced employees will become valuable contributors not only to our Apartments.com network of sites but across all of our marketplaces.”\n\nRentPath’s 2019 unaudited financials reflect revenue of approximately $227 million and adjusted EBITDA of approximately $47 million. Total revenue declined approximately 9% from 2018, while adjusted EBITDA declined approximately 24% in the same period. “Following successful conclusion of the bankruptcy process and regulatory review, we expect the acquisition to add scale to our Apartments.com business and be highly accretive to CoStar earnings once fully integrated,” said CoStar Group Chief Financial Officer Scott Wheeler.\n\n“We are very excited to be joining CoStar as part of the Apartments.com network,” said Marc Lefar, Chief Executive Officer of RentPath. “Our customers have an ever increasing number of choices when considering where to spend their marketing dollars. With CoStar’s commitment to invest in the RentPath family of sites, we will be in a position to offer our customers the best options to reach potential renters.”\n\nThe Company plans to provide revenue and earnings guidance for 2020 in its quarterly financial results release for the fourth quarter expected to be issued on February 25, 2020. Revenue and earnings guidance related to the transaction is not expected to be available until later in the year.\n\nThe closing of the transaction is subject to various conditions, including approval by the bankruptcy court and regulatory approval. Subject to bankruptcy court oversight and pending closing, we expect that RentPath’s operations will continue in the ordinary course.\n\nThe preceding forward-looking statements reflect CoStar Group's expectations as of February 11, 2020. We are not able to forecast with certainty whether or when certain events, such as acquisition-related costs, the exact timing of closing of the acquisition, or the exact amounts or timing of any investments related to the acquisition will occur. Given the risk factors, uncertainties and assumptions discussed above, actual results may differ materially. Other than in publicly available statements, the Company does not intend to update its forward-looking statements until its next quarterly results announcement.\n\nConference Call\n\nManagement will conduct a conference call at 8:00am EST on February 12, 2020 to discuss the acquisition. The audio portion of the conference call will be broadcast live over the Internet at www.costargroup.com/investors/events. To join the conference call by telephone, please dial 844-721-7241 (from the United States and Canada) or 409-207-6955 (from all other countries) and conference code 9109916 if needed. An audio recording of the conference call will be available for replay approximately one hour after the call's completion and will remain available for a period of time following the call. To access the recorded conference call, please dial 866-207-1041 (from the U.S. and Canada) or 402-970-0847 (from all other countries) using access code 8752015. The webcast replay will also be available in the Investors section of CoStar Group's website for a period of time following the call.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit CoStarGroup.com.\n\nThis news release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about CoStar Group's financial expectations, the Company's plans, objectives, expectations and intentions and other statements including words such as “hope,” \"anticipate,\" \"may,\" \"believe,\" \"expect,\" \"intend,\" \"will,\" \"should,\" \"plan,\" \"estimate,\" \"predict,\" \"continue\" and \"potential\" or the negative of these terms or other comparable terminology. Such statements are based upon the current beliefs and expectations of management of CoStar Group and are subject to significant risks and uncertainties. Actual results may differ materially from the results anticipated in the forward-looking statements. The following factors, among others, could cause or contribute to such differences: the possibility that the acquisition of RentPath does not close when expected or at all; the possibility that the parties are unable to obtain bankruptcy court or regulatory approval; the risk that the businesses of RentPath and Apartments.com may not be combined successfully or in a timely and cost-efficient manner; the risk that the combination does not produce the expected benefits for RentPath and CoStar or their customers and consumers as stated in this release; the risk that business disruption relating to the RentPath acquisition may be greater than expected; the risk that the bankruptcy process may cause greater business disruption for RentPath than currently expected and may cause RentPath to change the way it operates its business and that it may be unable to operate in the ordinary course pending closing; the risk that synergies from the acquisition of RentPath may not be as expected, may not be fully realized, or may take longer to realize than expected; the risk that the acquisition does not produce the expected results for CoStar, Apartments.com and RentPath or their advertisers and consumers, including increased scale of our Apartments.com business, the acquisition being highly accretive once integrated, and as otherwise stated in this release; the risk that expected investments in RentPath, or the timing of any such investments, may change or may not produce the expected results as stated in this release; the risk that revenue results will differ from expectations; and the risk that the combination and integration of RentPath will disrupt CoStar Group's, Apartments.com’s or RentPath’s operations or result in the loss of customers or key employees. Additional factors that could cause results to differ materially from those anticipated in the forward-looking statements can be found in CoStar’s Annual Report on Form 10-K for the year ended December 31, 2018, and CoStar’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, each of which is filed with the SEC, including in the “Risk Factors” section of those filings, as well as CoStar’s other filings with the SEC available at the SEC’s website (www.sec.gov). All forward-looking statements are based on information available to CoStar on the date hereof, and CoStar assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211006128/en/\nInvestor Contacts\n\nScott Wheeler\nChief Financial Officer\n(202) 336-6920,\nswheeler@costar.com\n\nSarah Spray\nInvestor Relations\n(202) 346 6394,\nsspray@costar.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group to Report Financial Results for Fourth Quarter 2019 on February 25, 2020",
        "subtitle": "",
        "date": "Feb 5, 2020 2:00PM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP) will announce financial results for the fourth quarter and year end 2019 following the market close on Tuesday, February 25, 2020. Management will conduct a conference call to discuss the fourth quarter and full year results, as well as the Company’s 2020 outlook at 5:00 PM EST that same day.\n\nTo participate in the conference call, please dial (844) 721-7241 (from the United States and Canada) or (409) 207-6955 (from all other countries) and refer to access code 9109916 or access via webcast using the link provided on our webpage at investors.costargroup.com.\n\nThe webcast audio replay will also be available in the Investor section of the website for a period of time following the call.\n\nAbout CoStar Group\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\n\nForward-Looking Statements\n\nThis news release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about CoStar's plans, objectives, expectations, beliefs and intentions and other statements including words such as “hope,” “anticipate,” “may,” “believe,” “expect,” “intend,” “will,” “should,” “plan,” “estimate,” “predict,” “continue” and “potential” or the negative of these terms or other comparable terminology. Such statements are based upon the current beliefs and expectations of management of CoStar and are subject to many risks and uncertainties. Actual results may differ materially from the results anticipated in the forward-looking statements. More information about potential factors that could cause results to differ materially from those anticipated in the forward-looking statements include, but are not limited to, those stated in CoStar’s filings from time to time with the Securities and Exchange Commission, including in CoStar’s Annual Report on Form 10-K for the year ended December 31, 2018, and Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, each of which is filed with the SEC, including in the “Risk Factors” section of those filings, as well as CoStar’s other filings with the SEC available at the SEC’s website (www.sec.gov). All forward-looking statements are based on information available to CoStar on the date hereof, and CoStar assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200205005720/en/\nScott Wheeler, Chief Financial Officer, (202) 336-6920, swheeler@costar.com\nSarah Spray, Investor Relations, (202) 346-6394, sspray@costar.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group Joins the NASDAQ 100",
        "subtitle": "",
        "date": "Jan 13, 2020 10:00AM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nAs of December 23, 2019, CoStar Group, Inc. (NASDAQ: CSGP), the leading provider of commercial real estate information, analytics and online marketplaces, has been added to the NASDAQ 100 Index®, one of the world’s preeminent large-cap growth indexes.\n\nHome to the world’s leading companies such as Apple, Google, and Tesla, the NASDAQ 100 Index®, is composed of the largest domestic and international non-financial companies listed on the NASDAQ Stock Market®. Fifty-four percent (54%) of the index is comprised of technology-focused companies known for disrupting markets with their innovation and leadership.\n\nCoStar Group’s brands service the entire commercial real estate ecosystem. These brands include CoStar, which delivers immediate, verified commercial real estate information to commercial real estate professionals, LoopNet – the most heavily-trafficked mobile and online commercial real estate marketplace, Apartments.com – the premier online apartment listing resource, BizBuySell – the internet’s largest and most heavily-trafficked business-for-sale marketplace, Lands of America – the largest rural real estate marketplace, and STR – which provides performance benchmarking and comparative analytics to hotels.\n\nThe inclusion of CoStar Group in the NASDAQ 100 is a significant capital markets milestone and underscores CoStar Group’s mission to continue revolutionizing the commercial real estate industry with technology, research and innovation.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit costargroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005068/en/\nMedia Contacts:\nMatt Blocher\nCoStar Group\n(202) 346-6775\nMblocher@costar.com\n\nMegan Sweat/Christine Dusome\nThe Zimmerman Agency\n(850) 668-2222\ncostarpr@zimmerman.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group Appoints Two Members to Board of Directors",
        "subtitle": "",
        "date": "Jan 9, 2020 2:00PM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc., today announced the expansion of its Board of Directors to nine members with the appointment of two new directors, Louise S. Sams and Robert W. Musslewhite.\n\n“As CoStar Group continues to grow and diversify our business both in product scope and internationally, I’m excited to have new members with experience in large, diverse international organizations,” said Andrew Florance, Founder and CEO of CoStar Group. “By electing Ms. Sams and Mr. Musslewhite, the Board gains significant corporate experience, enhancing its independence, depth of experience and diversity.”\n\nLouise Sams joins the Board with extensive experience as both a media executive and practicing attorney. As a result of her broad range of business and legal experience, Sams brings valuable business development, corporate governance, technology, and international experience to the Board. Previously, Sams was the Executive Vice President and General Counsel of Turner Broadcasting System, Inc., overseeing legal work related to all of the business activities of Turner and its subsidiaries worldwide. Most recently, Sams’ focus was on issues related to technology, information security, use of data and consumer privacy, as well as enterprise-wide risk management.\n\nRobert Musslewhite joins the Board with nearly twenty years of leadership experience in information services businesses, including The Advisory Board Company (Nasdaq: ABCO) where he served as Chairman and Chief Executive Officer. Now, following the acquisition of ABCO by Optum, Musslewhite is the Chief Executive Officer of OptumInsight. He brings an abundance of experience in executive management and leadership; business operations and development; growth strategies; and research and technology. Prior to ABCO, Musslewhite served as an Associate Principal with McKinsey & Company, a global management consulting firm. He also serves on the board of Ascend Learning.\n\nFor more information on CoStar Group’s Board of Directors, visit investors.costargroup.com/leadership.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit CoStarGroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005633/en/\nMatthew Blocher\nCoStar Group\nmblocher@costar.com\n202.346.6775\nSource: CoStar Group, Inc."
    },
    {
        "title": "2019 CoStar Power Brokers Award “Call for Entry” Period Open",
        "subtitle": "",
        "date": "Dec 2, 2019 11:00AM EST",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc., the leading provider of commercial real estate information, analytics and online marketplaces, is now accepting entries for this year’s Power Broker Awards, which honor the industry’s brokers, power players and deal makers who closed the highest transaction volume in commercial real estate deals and leads in their respective markets.\n\nNow in its 20th year and having recently expanded into 26 new markets, the CoStar Power Broker Award recognizes the top-performing firms and brokers operating in office leasing, retail leasing, industrial leasing and sales. This year also marks the first time building owners are eligible to enter deals for award consideration.\n\n\"CoStar proudly recognizes leaders in the industry for their unmatched performance throughout the year,” said Lisa Ruggles, CoStar Senior Vice President of Global Research. “In a constantly growing and competitive industry, each year’s award winners display strong dedication and passion for their markets.”\n\nThe 2019 Annual Power Broker Awards will be determined based on all 2019 deals submitted by and completed on or before January 15, 2020 at midnight EST. Power Broker winners are expected to be announced on March 13, 2020.\n\nFor more information and to enter yourself or your firm, visit costarpowerbrokers.com.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 4,300 worldwide, including the industry’s largest professional research organization. For more information, visit CoStarGroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005685/en/\nMatthew Blocher\nCoStar Group\nmblocher@costar.com\n202.346.6775\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group Third Quarter 2019 Revenue Grows 15% and Net Income Increases 34% Year-over-Year; Company Closes STR Acquisition",
        "subtitle": "",
        "date": "Oct 22, 2019 4:05PM EDT",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP), the leading provider of commercial real estate information, analytics and online marketplaces, announced today that revenue for the quarter ended September 30, 2019, was $353 million, an increase of 15% over revenue of $306 million for the third quarter of 2018. Net income for the third quarter of 2019 was $79 million, an increase of 34% over net income of $59 million for the third quarter of 2018.\n\nEBITDA for the third quarter of 2019 was $113 million, an increase of 24% versus EBITDA of $91 million for the third quarter of 2018. Adjusted EBITDA (which excludes stock-based compensation, acquisition and integration related costs and other items as described below) for the third quarter of 2019 was $129 million, an increase of 18% compared to adjusted EBITDA of $110 million for the third quarter of 2018.\n\nEarlier today, CoStar completed the previously announced acquisition of STR, Inc. and STR Global, Ltd. for an aggregate consideration of approximately $450 million in cash, subject to certain adjustments per the definitive agreements.\n\n“We achieved very strong third quarter 2019 financial results,” said Andrew C. Florance, Founder and Chief Executive Officer of CoStar Group. “We continue to deliver excellent results as we generated Company-wide net new bookings of $50 million in the third quarter, an increase of 27% year-over-year. Through the first three quarters of this year, our quarterly net new bookings average was $52 million, a 32% increase over the average quarterly bookings for the comparable period in 2018. We are also very pleased with the continued growth of Apartments.com, which generated 20% year-over year revenue growth in the third quarter of 2019 and is now at an annual revenue run rate of over $500 million.”\n\nFlorance continued, “We are very excited about closing our acquisition of STR so quickly. We believe that combining STR’s superior hospitality service offerings with CoStar will benefit all industry participants as we work together to create valuable new and improved tools.”\n\n“CoStar Group profitability continues to be exceptional with year-over-year growth in net income of 34% in the third quarter of 2019,” said Florance. “I am very pleased that we have grown net income while investing for the future growth of the business.”\n\nNon-GAAP net income for the third quarter of 2019 (which excludes amortization of acquired intangible assets, stock-based compensation and other items as described below) was $96 million or $2.61 per diluted share, an increase of $17 million or 22% versus the third quarter of 2018.\n\n2019 Outlook\n\nThe Company expects that STR will contribute between $3 million to $4 million in revenue in the fourth quarter of 2019. Due to the impact of integration costs and purchase accounting adjustments for deferred revenue, we expect STR adjusted EBITDA of negative $5 million to $6 million in the fourth quarter of 2019. These estimated results for STR are included in our revised outlook.\n\nThe Company is increasing revenue guidance to a range of $1.385 billion to $1.391 billion for the full year of 2019, an increase of $2 million at the midpoint of the range compared to the prior outlook. We expect revenue for the fourth quarter of 2019 in the range of $360 million to $366 million, representing revenue growth of 15% over the fourth quarter of 2018 at the midpoint of the range.\n\nThe Company expects adjusted EBITDA in a range of $494 million to $500 million for the full year of 2019, a decrease of $5 million at the midpoint of the range. For the fourth quarter of 2019, the Company expects adjusted EBITDA in a range of $129 million to $135 million.\n\nWe expect full-year 2019 non-GAAP net income per diluted share in a range of $9.90 to $10.02 based on 36.6 million shares, a decrease of $0.11 at the midpoint versus the previously provided outlook. For the fourth quarter of 2019, we expect non-GAAP net income per diluted share in a range of $2.52 to $2.64 based on 36.7 million shares. These ranges include a non-GAAP tax rate of 25%.\n\nThe preceding forward-looking statements reflect CoStar Group’s expectations as of October 22, 2019, including forward-looking non-GAAP financial measures on a consolidated basis. Given the risk factors, uncertainties and assumptions discussed above, actual results may differ materially. Other than in publicly available statements, the Company does not intend to update its forward-looking statements until its next quarterly results announcement.\n\nReconciliation of EBITDA, adjusted EBITDA, non-GAAP net income and non-GAAP net income per diluted share and other disclosed non-GAAP financial measures to their GAAP basis results are shown in detail below, along with definitions for those terms. A reconciliation of forward-looking non-GAAP guidance to the most directly comparable GAAP measure, net income, can be found within the tables included in this release.\n\nNon-GAAP Financial Measures\n\nFor information regarding the purpose for which management uses the non-GAAP financial measures disclosed in this release and why management believes they provide useful information to investors regarding the Company’s financial condition and results of operations, please refer to the Company’s latest periodic report.\n\nEBITDA is a non-GAAP financial measure that represents GAAP net income attributable to CoStar Group before interest and other income (expense), loss on debt extinguishment, income taxes, depreciation and amortization.\n\nAdjusted EBITDA is a non-GAAP financial measure that represents EBITDA before stock-based compensation expense, acquisition- and integration-related costs, restructuring costs and settlements and impairments incurred outside the Company’s normal course of business.\n\nNon-GAAP net income is a non-GAAP financial measure determined by adjusting GAAP net income attributable to CoStar Group for stock-based compensation expense, acquisition- and integration-related costs, restructuring costs, settlement and impairment costs incurred outside the Company's normal course of business and loss on debt extinguishment, as well as amortization of acquired intangible assets and other related costs, and then subtracting an assumed provision for income taxes. In 2019, the Company is assuming a 25% tax rate in order to approximate our statutory corporate tax rate excluding the impact of discrete items.\n\nNon-GAAP net income per diluted share is a non-GAAP financial measure that represents non-GAAP net income divided by the number of diluted shares outstanding for the period used in the calculation of GAAP net income per diluted share. For periods with GAAP net losses and non-GAAP net income, the weighted average outstanding shares used to calculate non-GAAP net income per share includes potentially dilutive securities that were excluded from the calculation of GAAP net income per share as the effect was anti-dilutive.\n\nEarnings Conference Call\n\nManagement will conduct a conference call at 5:00 PM EDT on Tuesday, October 22, 2019 to discuss earnings results for the third quarter and the Company’s outlook. The audio portion of the conference call will be broadcast live over the Internet at investors.costargroup.com. To join the conference call by telephone, please dial (800) 230-1059 (from the United States and Canada) or (612) 234-9959 (from all other countries) and refer to conference code 472986. An audio recording of the conference call will be available for replay approximately one hour after the call's completion and will remain available for a period of time following the call. To access the recorded conference call, please dial (800) 475-6701 (from the U.S. and Canada) or (320) 365-3844 (from all other countries) using access code 472986. The webcast replay will also be available in the Investors section of CoStar Group's website for a period of time following the call.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. LoopNet is the most heavily trafficked commercial real estate marketplace online with over 6 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 51 million unique monthly visitors in aggregate in the third quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 3,900 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\n\nThis news release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about CoStar Group's financial expectations, the Company's plans, objectives, expectations and intentions and other statements including words such as “hope,” \"anticipate,\" \"may,\" \"believe,\" \"expect,\" \"intend,\" \"will,\" \"should,\" \"plan,\" \"estimate,\" \"predict,\" \"continue\" and \"potential\" or the negative of these terms or other comparable terminology. Such statements are based upon the current beliefs and expectations of management of CoStar Group and are subject to significant risks and uncertainties. Actual results may differ materially from the results anticipated in the forward-looking statements. The following factors, among others, could cause or contribute to such differences: the risk that the trends stated or implied by this release cannot or will not be sustained at the current pace, including trends related to revenue, net income, non-GAAP net income, EBITDA, adjusted EBITDA, and sales bookings; the risk that the Company is unable to sustain current revenue, earnings and bookings growth rates or increase them; the risk that CoStar and STR cannot be combined successfully or that the acquisition does not produce the expected results, including creation of valuable new and improved tools; the risk that the Company’s estimated results for STR, including fourth quarter revenue and adjusted EBITDA, will not be as expected and stated in this release; the risk that revenues for the fourth quarter and full year 2019 will not be as stated in this press release; the risk that net income for the fourth quarter and full year 2019 will not be as stated in this press release; the risk that adjusted EBITDA for the fourth quarter and full year 2019 will not be as stated in this press release; the risk that non-GAAP net income and non-GAAP net income per diluted share for the fourth quarter and full year 2019 will not be as stated in this press release; and the risk that the tax rate estimates stated in this press release are incorrect or may change. Additional factors that could cause results to differ materially from those anticipated in the forward-looking statements can be found in CoStar’s Annual Report on Form 10-K for the year ended December 31, 2018, and CoStar’s Quarterly Report on Form 10-Q for the period ended June 30, 2019, each of which is filed with the SEC, including in the “Risk Factors” section of those filings, and the Company’s other filings with the SEC available at the SEC’s website (www.sec.gov). CoStar assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022006116/en/\nScott Wheeler\nChief Financial Officer\n(202) 336-6920\nswheeler@costar.com\n\nRichard Simonelli\nInvestor Relations\n(202) 346-6394\nrsimonelli@costar.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "The FASB Officially Delays Deadline for Private Company Lease Accounting Standard Adoption",
        "subtitle": "",
        "date": "Oct 17, 2019 2:24PM EDT",
        "content": "\nCoStar Advises How Organizations Should Take Advantage of Extra Time to Comply with ASC 842\n    ATLANTA--(BUSINESS WIRE)--\nThe Financial Accounting Standards Board (FASB) officially voted to approve delaying the effective date for a number of significant accounting standards for private companies and nonprofit organizations from December 15, 2019 to December 15, 2020. Included in these proposed changes is Accounting Standards Update (ASU) No. 2016-02, Leases (2021 calendar year). This is a one-year deferral of the effective date.\n\nThe delay comes on the heels of the FASB receiving a letter from the AICPA Technical Issues Committee, requesting such a delay. FASB took up the matter on July 17, 2019, allowing for public comment over a 30-day period.\n\nPrivate companies now have more time to prepare for the most significant accounting change in 40 years. Industry experts at CoStar Real Estate Manager recommend the time be put to good use.\n\n“Many public companies underestimated the time needed to gather lease data and get it into a proven system that can handle the complex calculations required to meet the new ASC 842 standard,” said Matt Waters, CPA and director of lease accounting with CoStar. “Even with the one-year delay, private companies should not slow down their efforts to understand the requirements and get various department stakeholders involved in the compliance project.”\n\nA major challenge in implementing the new lease standard is the amount of work needed to review lease contracts and identify what qualifies as a lease. Many companies that have started this effort are realizing there is much more work to do to capture all the lease data than they initially believed. “This extra time will help companies identify the entire population, especially embedded leases in service contracts,” Waters said.\n\nAdditionally, CoStar Real Estate Manager recommends companies evaluate lease accounting software proven to work for public companies, most of which implemented solutions to meet the earlier FASB compliance deadlines required for public companies. Such solutions should ideally include comprehensive real estate and equipment lease management functionality to optimize the business value from the compliance-driven investments. “Private companies should rely on the feedback and experience of their accounting advisors and other private companies to quickly narrow down software vendors who have proven functionality and additional features to ensure a continuous flow of accounting processes,” Waters added.\n\nFor more information and to download a whitepaper on Enterprise Lease Accounting Lessons Learned, please visit www.costarmanager.com.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. LoopNet is the most heavily trafficked commercial real estate marketplace online with 5.8 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 52 million unique monthly visitors in aggregate in the second quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 3,900 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191017005839/en/\nMedia Contact:\nMegan Sweat/Christine Dusome\nThe Zimmerman Agency\n(850) 668-2222\ncostarpr@zimmerman.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group to Report Financial Results for Third Quarter 2019 on October 22, 2019",
        "subtitle": "",
        "date": "Oct 7, 2019 2:09PM EDT",
        "content": "    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP) will announce financial results for the third quarter 2019 following the market close on Tuesday, October 22, 2019. Management will conduct a conference call to discuss the third quarter results, as well as the Company’s outlook at 5:00 PM EDT that same day.\n\nTo participate in the conference call, please dial (800) 230-1059 (from the United States and Canada) or (612) 234-9959 (from all other countries) and refer to conference code 472986. To listen to the conference call over the Internet, please access the audio webcast link available in the Investors section of CoStar Group's website at investors.costargroup.com.\n\nAn audio recording of the conference call will be available for replay approximately one hour after the call's completion and will remain available for a period of time following the call. To access the recorded conference call, please dial (800) 475-6701 (from the U.S. and Canada) or (320) 365-3844 (from all other countries) using access code 472986. The webcast replay will also be available in the Investors section of CoStar Group's website for a period of time following the call.\n\nAbout CoStar Group\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. LoopNet is the most heavily trafficked commercial real estate marketplace online with 5.8 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 52 million unique monthly visitors in aggregate in the second quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 3,900 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\n\nForward-Looking Statements\n\nThis news release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about CoStar's plans, objectives, expectations, beliefs and intentions and other statements including words such as “hope,” “anticipate,” “may,” “believe,” “expect,” “intend,” “will,” “should,” “plan,” “estimate,” “predict,” “continue” and “potential” or the negative of these terms or other comparable terminology. Such statements are based upon the current beliefs and expectations of management of CoStar and are subject to many risks and uncertainties. Actual results may differ materially from the results anticipated in the forward-looking statements. More information about potential factors that could cause results to differ materially from those anticipated in the forward-looking statements include, but are not limited to, those stated in CoStar's filings from time to time with the Securities and Exchange Commission , including in CoStar’s Annual Report on Form 10-K for the year ended December 31, 2018, and CoStar’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, each of which is filed with the SEC, including in the “Risk Factors” section of those filings, as well as CoStar’s other filings with the SEC available at the SEC’s website ( www.sec.gov ). All forward-looking statements are based on information available to CoStar on the date hereof, and CoStar assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191007005750/en/\nInvestor Contacts:\nScott Wheeler, Chief Financial Officer, (202) 336-6920, swheeler@costar.com\nRichard Simonelli, Investor Relations, (202) 346-6394, rsimonelli@costar.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group to Acquire STR, a Global Leader in Benchmarking & Analytics for the Hospitality Industry",
        "subtitle": "",
        "date": "Oct 1, 2019 6:30AM EDT",
        "content": "\nTransaction Enables CoStar to Provide Comprehensive and Precise Data and Analytics on the $3 Trillion Hotel Commercial Real Estate Asset Class \n\nCoStar’s Management to Hold Conference Call at 9:00 a.m. EDT today to discuss\n    WASHINGTON--(BUSINESS WIRE)--\nCoStar Group, Inc. (NASDAQ: CSGP) the leading provider of commercial real estate information, analytics and online marketplaces, announced today that it plans to acquire STR for $450 million in cash, subject to adjustments in the definitive agreements. The transaction is expected to close in the fourth quarter of 2019, subject to customary closing conditions.\n\nSTR was founded in 1985 as Smith Travel Research to provide performance benchmarking and comparative analytics to hotels. Over the past 34 years, STR has grown its data assets, product offerings and geographic reach to become the gold standard in the global hospitality industry for premium data analytics, performance benchmarking and market insights. Today, STR aggregates data from over 65,000 hotels worldwide, representing nearly nine million guest rooms in over 180 countries. The company’s flagship product - the STARreport – provides hotel brands, owners and management companies vital performance benchmark information with more than 1.2 million reports distributed each month. STR is headquartered in Hendersonville, Tennessee and has 370 employees in 15 countries.\n\n“The STR team has built an extraordinary company that partners with the hotel industry to create benchmarks and analytics that are the primary tools hotel management and investors rely on to optimize and improve their assets,” said Andrew C. Florance, Founder and Chief Executive Officer of CoStar Group. “STR brings an unrivaled reputation within the global hospitality industry for their data integrity, reliability and strict confidentiality, and we look forward to continuing to build on these core values in the next chapter of STR’s growth.”\n\nThe value of the STR benchmarks extends well beyond optimizing hotel operations. Valued at over $3 trillion globally, hotels are a massive commercial real estate asset class. In the way that CoStar’s acquisition of Apartments.com enabled CoStar to extend valuable new services to investors and service providers in multifamily real estate, we believe that STR will complement CoStar’s existing offerings and empower CoStar to provide valuable new services to investors and service providers in the hospitality industry. CoStar currently provides basic building information on 80,000 hotels, 45,000 hotel sale comparables, and 4,500 hotels offered for sale. Among many other things, STR’s information provides aggregated anonymized information on occupancy rates, average room rates, and revenue per available room. We believe that the combination of the two companies’ offerings will allow us to create valuable new and improved tools for investors, lenders, and service providers for use in developing, financing, valuing, and selling hotel properties.\n\nAs we integrate the complementary capabilities of STR and CoStar, we plan to focus on a number of attractive growth areas.\n\nCreate Powerful Hotel Data and Analytics in CoStar Suite \n\nWe plan to integrate STR data with CoStar to create exciting new products that provide building data, income level and trend reports, sales comps, for sale information, etc. We believe this product will bring substantial benefits to customers, thereby enabling the sale of more CoStar subscriptions to investors, brokers, appraisers, lenders, and developers who can use the information to understand investments, assess potential new developments and support property purchase and sale decisions. There is a clear opportunity to utilize the CoStar sales force to reach thousands of additional potential clients.\n\nDrive International Penetration\n\nSTR is currently selling to over 15,000 hotel customers outside of the United States, representing a small fraction of the over 350,000 international hotels. We believe the combined international presence of STR and CoStar will create opportunities for further penetration around the world.\n\nBuild and Sell New Products\n\nSTR primarily focuses on providing historical data around timely revenue and occupancy benchmarking. We perceive a growing demand from hotel clients for additional aggregated and anonymized bookings and revenue information, including robust forecasts. Our combined technology design and development capabilities is expected to accelerate these new product efforts, and bring them to market more broadly. In addition, CoStar plans to invest in and grow STR’s net operating income benchmarking and analytics products.\n\nExpand Benchmarking to Other Areas\n\nSTR has exceptional expertise in all aspects of benchmarking, which we plan to extend to other commercial real estate segments within CoStar. Combining STR’s capabilities with the significant CoStar data assets will allow for the creation of new benchmark products for commercial leases and multifamily operating metrics that would be extremely valuable to owners, brokers, lenders, tenants, and property managers.\n\n\"We are very excited to become part of CoStar,\" said Amanda Hite, STR’s President and CEO. “CoStar brings leading technologies, analytics and sales capabilities that we believe will enable STR to accelerate growth and increase the value and insights we provide to our hospitality clients. This combination also represents an outstanding career opportunity for all of our employees around the world.”\n\nSTR revenue for 2019 is expected to be approximately $64 million and EBITDA is estimated at approximately $16 million, for an EBITDA margin of 25%. CoStar expects that within the next three to four years, the investments in new products and growth focus of the combined businesses will generate annual revenue growth above 20%, approximately two times the current growth rate, and profit margins in line with CoStar’s long-term goal of 40% adjusted EBITDA margins by 2023.\n\nBased on preliminary estimates and assuming a November 2019 close, the Company expects that STR will contribute between $3 - 4 million in revenue in the fourth quarter of 2019. Due to the impact of integration costs and purchase accounting adjustments for deferred revenue, we expect STR will be slightly dilutive on a non-GAAP net income per share basis in the fourth quarter of 2019.\n\nThe preceding forward-looking statements reflect CoStar Group’s expectations as of October 1, 2019. We are not able to forecast with certainty whether or when certain events, such as acquisition-related costs, the exact timing of closing of the acquisition, or the exact amounts or timing of any investments related to the acquisition will occur. Given the risk factors, uncertainties and assumptions discussed above, actual results may differ materially. Other than in publicly available statements, the Company does not intend to update its forward-looking statements until its next quarterly results announcement.\n\nNon-GAAP Financial Measures\n\nFor information regarding the purpose for which management uses the non-GAAP financial measures disclosed in this release and why management believes they provide useful information to investors regarding the Company’s financial condition and results of operations, please refer to the Company’s latest periodic report.\n\nEBITDA is a non-GAAP financial measure that represents GAAP net income before (i) interest income (expense), (ii) provision for income taxes, and (iii) depreciation and amortization.\n\nAdjusted EBITDA is a non-GAAP financial measure that represents EBITDA before (i) stock-based compensation expense, (ii) acquisition and integration related costs, (iii) restructuring charges and related costs, and (iv) settlements and impairments incurred outside the company’s normal business operations.\n\nNon-GAAP net income is a non-GAAP financial measure that represents GAAP net income before (i) amortization of acquired intangible assets, (ii) stock-based compensation expense, (iii) acquisition and integration related costs, (iv) purchase accounting adjustments, (v) restructuring charges and related costs, and (vi) settlements and impairments. From this figure, we then subtract an assumed provision for income taxes to arrive at non-GAAP net income. The company assumes a 38% tax rate in order to approximate our long-term effective corporate tax rate.\n\nNon-GAAP net income per diluted share (also referred to as non-GAAP EPS) is a non-GAAP financial measure that represents non-GAAP net income divided by the number of diluted shares outstanding for the period. For periods with GAAP net losses and non-GAAP net income, the weighted-average outstanding shares used to calculate non-GAAP net income per share includes potentially dilutive securities that were excluded from the calculation of GAAP net income per share as the effect was anti-dilutive.\n\nConference Call\n\nManagement will conduct a conference call at 9:00 a.m. EDT on October 1, 2019 to discuss the acquisition and its impact on the Company’s outlook for 2019 and beyond. The audio portion of the conference call will be broadcast live over the Internet at www.costargroup.com/investors/events. To join the conference call by telephone, please dial (800) 553-0358 (from the United States and Canada) or (612) 288-0337 (from all other countries) and conference code 472856 if needed. An audio recording of the conference call will be available for replay approximately one hour after the call's completion and will remain available for a period of time following the call. To access the recorded conference call, please dial (800) 475-6701 (from the U.S. and Canada) or (320) 365-3844 (from all other countries) using access code 472856. The webcast replay will also be available in the Investors section of CoStar Group's website for a period of time following the call.\n\nAbout CoStar Group, Inc.\n\nAbout CoStar Group\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. LoopNet is the most heavily trafficked commercial real estate marketplace online with 5.8 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 52 million unique monthly visitors in aggregate in the second quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 3,900 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\n\nThis news release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about CoStar Group's financial expectations, the Company's plans, objectives, expectations and intentions and other statements including words such as “hope,” \"anticipate,\" \"may,\" \"believe,\" \"expect,\" \"intend,\" \"will,\" \"should,\" \"plan,\" \"estimate,\" \"predict,\" \"continue\" and \"potential\" or the negative of these terms or other comparable terminology. Such statements are based upon the current beliefs and expectations of management of CoStar Group and are subject to significant risks and uncertainties. Actual results may differ materially from the results anticipated in the forward-looking statements. The following factors, among others, could cause or contribute to such differences: the possibility that the acquisition of STR does not close when expected or at all; the risk that the businesses of STR, and CoStar may not be combined successfully or in a timely and cost-efficient manner; the risk that the combination does not produce the expected benefits for STR’s and CoStar’s customers and users or result in further market penetration and accelerated STR growth as stated in this release; the risk that business disruption relating to the STR acquisition may be greater than expected; the risk that synergies from the acquisition of STR, including as a result of cross-selling and cost efficiencies, may not be as expected, may not be fully realized, may take longer to realize than expected; the risk that the acquisition and combination of services does not produce the expected results for CoStar or its customers and advertisers, including as stated in this release; the risk that STR revenues, EBITDA and EBITDA margins for 2019 will not be as stated in this press release; the risk that STR revenues and the impact on non-GAAP net income per share in the fourth quarter of 2019 will not be as stated in this release; the risk that expected investments in STR, or the timing of any such investments, may change or may not produce the expected results as stated in this release; the risk that the Company is unable to achieve its adjusted EBITDA margin goal as stated in this release; and the risk that the combination and integration of STR will disrupt CoStar Group's or STR’s operations or result in the loss of customers or key employees. Additional factors that could cause results to differ materially from those anticipated in the forward-looking statements can be found in CoStar’s Annual Report on Form 10-K for the year ended December 31, 2018, and CoStar’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, each of which is filed with the SEC, including in the “Risk Factors” section of those filings, and the Company’s other filings with the SEC available at the SEC’s website (www.sec.gov). CoStar assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191001005467/en/\nInvestors\nScott Wheeler\nChief Financial Officer\n(202) 336-6920\nswheeler@costar.com\n\nRichard Simonelli\n(202) 346-6394\nrsimonelli@costar.com\nSource: CoStar Group, Inc."
    },
    {
        "title": "CoStar Group Donates 100,000 Meals Benefiting Food-Insecure Washington D.C. Residents",
        "subtitle": "",
        "date": "Sep 6, 2019 10:01AM EDT",
        "content": "\nCoStar Employees to Pack Meals on National Day of Service and Remembrance\n    WASHINGTON--(BUSINESS WIRE)--\nIn honor of the National Day of Service and Remembrance, CoStar Group employees are participating in a meal packing event Sept. 11, 2019, from 1 p.m. to 5 p.m. at CoStar Group’s main headquarters in Washington DC. CoStar Group employees will package and donate 100,000 meals to local organizations supporting low-income and food-insecure residents.\n\n“CoStar Group employees are dedicated to helping improve, sustain and brighten the communities in which we live and work,” said Andrew Florance, CEO and Founder of CoStar Group. “We are humbled that nearly 500 of our local employees immediately stepped up to help our neighbors in need.”\n\nAccording to Bread for the City, 324,000 D.C. households currently don’t have access to the food necessary to lead a healthy life. Through this event facilitated by Feeding Children Everywhere, CoStar Group is providing low-income residents access to nutritious, flavorful meals of red lentil jambalaya. The meals will be distributed to Bread for the City, So Others Might Eat (SOME), and New Beginning Temporary Shelter, who all work to fight poverty and hunger in the local area.\n\n“On behalf of the Bread for the City community, we are beyond grateful to be named a beneficiary of this incredible gift from CoStar Group,” said George Jones, CEO of Bread for the City. “With CoStar’s donation, we will be able to make a greater impact on the health and wellness of thousands of DC families throughout the year because of their service. It has been an honor to partner with CoStar over the past 8 years, and we look forward to continuing this great work with their team.”\n\nThis philanthropic effort is part of the CoStar Builds program, through which employees volunteer hundreds of hours each year to enhance and sustain the communities in which they live and work.\n\nFor more information about how CoStar Group makes a difference and brings value to the communities we serve, please visit www.costargroup.com/corporate-responsibility.\n\nAbout CoStar Group, Inc.\n\nCoStar Group, Inc. (NASDAQ: CSGP) is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Our suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. LoopNet is the most heavily trafficked commercial real estate marketplace online with 5.8 million monthly unique visitors. Realla is the UK’s most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. CoStar Group’s websites attracted an average of over 52 million unique monthly visitors in aggregate in the second quarter of 2019. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe and Canada with a staff of over 3,900 worldwide, including the industry’s largest professional research organization. For more information, visit www.costargroup.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190906005224/en/\nMegan Sweat/Christine Dusome\nThe Zimmerman Agency\n(850) 668-2222\ncostarpr@zimmerman.com\nSource: CoStar Group, Inc."
    }
]