[
    {
        "title": "CSX Corp. Chief Executive Officer to Address  J.P. Morgan Aviation, Transportation and Industrials Conference",
        "subtitle": "",
        "date": "Mar 4, 2020 10:00AM EST",
        "content": "JACKSONVILLE, Fla., March  04, 2020  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) President and chief executive officer James M. Foote will address the 2020 J.P. Morgan Aviation, Transportation and Industrials Conference in New York Wednesday, March 11, at 8:45 a.m. Eastern time.This address will be webcast live at http://investors.csx.com. A replay and accompanying audio will be available following the conclusion of this event. This announcement, as well as additional financial information, is available on the company’s website at http://investors.csx.com.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural and consumer products. For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corp. and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX).Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Corp. Announces Increase to Quarterly Dividend",
        "subtitle": "",
        "date": "Feb 12, 2020 4:05PM EST",
        "content": "JACKSONVILLE, Fla., Feb.  12, 2020  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) today announced that the Company’s board of directors has authorized an 8% increase in its quarterly dividend, from $0.24 to $0.26 per share. The new $0.26 quarterly dividend is payable March 13, 2020, to shareholders of record at the close of business Feb. 28, 2020.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural and consumer products.  For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Facebook (http://www.facebook.com/OfficialCSX). The social media channels used by CSX may be updated from time to time. More information about CSX and its subsidiaries is available at www.csx.com.Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Corp. Executives to Address Citi and Barclays Investor Conferences",
        "subtitle": "",
        "date": "Feb 12, 2020 10:00AM EST",
        "content": "JACKSONVILLE, Fla., Feb.  12, 2020  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) executive vice president, Sales & Marketing, Mark Wallace, will address the Citi Global Industrials Conference Wednesday, Feb. 19, at 8:45 a.m. Eastern time in Miami Beach, Florida.Executive vice president and chief financial officer, Kevin Boone, will address the Barclays Industrial Select Conference in Miami Beach, Florida Wednesday, Feb. 19, at 10:20 a.m. Eastern time.These addresses will be webcast live at http://investors.csx.com. Replays and accompanying audio will be available following the conclusion of these events. This announcement, as well as additional financial information, is available on the company’s website at http://investors.csx.com.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural and consumer products. For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corp. and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX).Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Announces Fourth Quarter and Full Year 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 16, 2020 4:01PM EST",
        "content": "JACKSONVILLE, Fla., Jan.  16, 2020  (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ: CSX) today announced fourth quarter 2019 net earnings of $771 million, or $0.99 per share, versus $843 million, or $1.01 per share in the same period last year. CSX’s operating ratio set a company fourth quarter record of 60.0 percent, compared with 60.3 percent in the prior year.For the full year 2019, CSX generated net earnings of $3.33 billion, or $4.17 per share, versus $3.31 billion, or $3.84 per share in 2018, an increase of 1% and 9%, respectively. CSX’s full year 2019 operating ratio of 58.4% represents a new U.S. Class I railroad record, improving upon last year’s record result of 60.3 percent.“The railroad has never run better and we are delivering great service to our customers,” said James M. Foote, president and chief executive officer. “What is really amazing is how our employees stepped up to produce efficiencies during tough economic conditions.”Revenue for the fourth quarter decreased 8 percent versus prior year to $2.89 billion due to lower volumes and negative mix from coal market headwinds. Expenses decreased 9 percent year over year to $1.73 billion, driven by continued efficiency gains and volume-related savings. Operating income was down 8 percent to $1.15 billion compared to the same period last year.CSX executives will conduct a conference call with the investment community this afternoon, January 16, at 4:30 p.m. Eastern time. Investors, media and the public may listen to the conference call by dialing 1-888-327-6279 (1-888-EARN-CSX). For callers outside the U.S., dial 1-773-756-0199. Participants should dial in 10 minutes prior to the call and enter in 3276279 as the passcode.In conjunction with the call, a live webcast will be accessible and presentation materials will be posted on the company's website at http://investors.csx.com. Following the earnings call, an internet replay of the presentation will be archived on the company website.This earnings announcement, as well as additional detailed financial information, is contained in the CSX Quarterly Financial Report available through the company’s website at http://investors.csx.com and on Form 8-K with the Securities and Exchange Commission.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Facebook (http://www.facebook.com/OfficialCSX). The social media channels used by CSX may be updated from time to time. More information about CSX Corporation and its subsidiaries is available at www.csx.com.Non-GAAP Disclosure CSX reports its financial results in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). CSX also uses certain non-GAAP measures that fall within the meaning of Securities and Exchange Commission Regulation G and Regulation S-K Item 10(e), which may provide users of the financial information with additional meaningful comparison to prior reported results. Non-GAAP measures do not have standardized definitions and are not defined by U.S. GAAP. Therefore, CSX’s non-GAAP measures are unlikely to be comparable to similar measures presented by other companies. The presentation of these non-GAAP measures should not be considered in isolation from, as a substitute for, or as superior to the financial information presented in accordance with GAAP.Forward-looking StatementsThis information and other statements by the company may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act with respect to, among other items: projections and estimates of earnings, revenues, margins, volumes, rates, cost-savings, expenses, taxes, liquidity, capital expenditures, dividends, share repurchases or other financial items, statements of management's plans, strategies and objectives for future operations, and management's expectations as to future performance and operations and the time by which objectives will be achieved, statements concerning proposed new services, and statements regarding future economic, industry or market conditions or performance. Forward-looking statements are typically identified by words or phrases such as “will,” “should,” “believe,” “expect,” “anticipate,” “project,” “estimate,” “preliminary” and similar expressions. Forward-looking statements speak only as of the date they are made, and the company undertakes no obligation to update or revise any forward-looking statement. If the company updates any forward-looking statement, no inference should be drawn that the company will make additional updates with respect to that statement or any other forward-looking statements.Forward-looking statements are subject to a number of risks and uncertainties, and actual performance or results could differ materially from that anticipated by any forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by any forward-looking statements include, among others; (i) the company's success in implementing its financial and operational initiatives; (ii) changes in domestic or international economic, political or business conditions, including those affecting the transportation industry (such as the impact of industry competition, conditions, performance and consolidation); (iii) legislative or regulatory changes; (iv) the inherent business risks associated with safety and security; (v) the outcome of claims and litigation involving or affecting the company; (vi) natural events such as severe weather conditions or pandemic health crises; and (vii) the inherent uncertainty associated with projecting economic and business conditions.Other important assumptions and factors that could cause actual results to differ materially from those in the forward-looking statements are specified in the company's SEC reports, accessible on the SEC's website at www.sec.gov and the company's website at www.csx.com.Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "Suzanne M. Vautrinot Elected to CSX Corp. Board of Directors",
        "subtitle": "",
        "date": "Dec 19, 2019 4:05PM EST",
        "content": "JACKSONVILLE, Fla., Dec.  19, 2019  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) today announced that retired Maj. Gen. Suzanne M. Vautrinot has been appointed to the company's board of directors, effective immediately.\"Suzanne brings extraordinary cybersecurity expertise and leadership skills to the CSX board,\" said John J. Zillmer, chairman of the board. \"We are honored that she has agreed to serve as a director and to help guide the company as it continues its quest to be the best run railroad in North America.\"Ms. Vautrinot is the president of Kilovolt Consulting, Inc., a cybersecurity strategy and technology consulting firm.Ms. Vautrinot retired from the United States Air Force in October 2013, as major general. During her distinguished 31-year career, she served in various assignments, including cyber operations, plans and policy, strategic security and space operations. From 2011 - 2013, she was Commander, 24th Air Force and Commander, Air Forces Cyber where she oversaw a multibillion dollar global cyber enterprise with 14,000 military personnel, civilians and contractors. Ms. Vautrinot also served as Director of Plans and Policy, U.S. Cyber Command and Deputy Commander, Network Warfare, U.S. Strategic Command, as well as Commander, Air Force Recruiting Service.Ms. Vautrinot currently serves on the board of directors of Wells Fargo & Co., Ecolab, Inc. and Parsons Corporation. She earned her Bachelor of Science from the U.S. Air Force Academy, a Master of Science from the University of Southern California and was a National Security Fellow at the John F. Kennedy School of Government at Harvard University.Ms. Vautrinot will serve on the company's Audit Committee and Governance Committee.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural and consumer products. For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corp. and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX).Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/8b961971-a585-4ea1-886f-d633b88aca9a"
    },
    {
        "title": "CSX Corporation Announces Date for Fourth-Quarter Earnings Release and Earnings Call",
        "subtitle": "",
        "date": "Dec 19, 2019 10:00AM EST",
        "content": "JACKSONVILLE, Fla., Dec.  19, 2019  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) will release fourth-quarter financial and operating results after the market close Thursday, Jan. 16, 2020. This will be followed by a conference call and live webcast hosted by the company’s management team at 4:30 p.m. Eastern time.Those interested in participating via teleconference may dial 1-888-327-6279 (1-888-EARN-CSX). Callers outside the U.S. dial 1-773-756-0199. Participants should dial in 10 minutes before the call and enter in 3276279 as the passcode.Presentation materials and access to the audio webcast will be available on the company’s website at http://investors.csx.com. Following the earnings call, a webcast replay and an MP3 audio file will be archived on the company’s website.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX).  The social media channels used by CSX may be updated from time to time.More information about CSX Corp. and its subsidiaries is available at www.csx.com and on Facebook (http://www.facebook.com/OfficialCSX).Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Announces New Vice President of Labor Relations",
        "subtitle": "",
        "date": "Dec 16, 2019 3:28PM EST",
        "content": "JACKSONVILLE, Fla., Dec.  16, 2019  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) today announced the appointment of Jeffery D. Wall as vice president of Labor Relations.With more than 20 years of labor relations and negotiating experience, Wall will be responsible for overall labor strategy and working with unions that represent nearly 17,000 CSX employees. He will report to Diana Sorfleet, executive vice president and chief administrative officer.“Jeff is a proven leader whose knowledge of the broader transportation industry will be a tremendous asset to CSX,” said Sorfleet. “He understands the vital importance of safe and efficient operations in the rail industry and respects the contributions of the union-represented employees who provide exceptional service to our customers.”Most recently, Wall was a partner at FordHarrison LLP, in Washington, D.C., where he represented major airlines and other carriers. Previously, he was vice president of labor relations at United Airlines and served in labor-focused leadership positions at United Continental Holdings and Continental Airlines.About CSX CSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corp. and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX).Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Corp. Chief Executive Officer to Address Credit Suisse Industrials Conference",
        "subtitle": "",
        "date": "Nov 27, 2019 2:00PM EST",
        "content": "JACKSONVILLE, Fla., Nov.  27, 2019  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) President and chief executive officer James M. Foote will address the Credit Suisse 7th Annual Industrials Conference in Palm Beach, FL on Tuesday, Dec. 3, at 2 p.m. Eastern time.This address will be webcast live at http://investors.csx.com. A replay and accompanying audio will be available following the conclusion of this event. This announcement, as well as additional financial information, is available on the company’s website at http://investors.csx.com.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural and consumer products. For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corp. and its subsidiaries is available at http://www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX).Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Corp. Chief Executive Officer to Address 2019 Stephens Nashville Investment Conference",
        "subtitle": "",
        "date": "Nov 6, 2019 10:00AM EST",
        "content": "JACKSONVILLE, Fla., Nov.  06, 2019  (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) president and chief executive officer James M. Foote will address the 2019 Stephens Nashville Investment Conference Wednesday, Nov. 13, at 8:30 a.m. Eastern time.This address will be webcast live at http://investors.csx.com. A replay and accompanying audio will be available after the conclusion of this event. This announcement, as well as additional financial information, is available on the company website at http://investors.csx.com.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural and consumer products.  For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.  More information about CSX Corp. and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX).  Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Corporation Chief Executive Officer to Address Baird’s 2019 Global Industrial Conference",
        "subtitle": "",
        "date": "Oct 30, 2019 10:00AM EDT",
        "content": "JACKSONVILLE, Fla., Oct.  30, 2019  (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ: CSX) President and Chief Executive Officer James M. Foote will address Baird’s 2019 Global Industrial Conference in Chicago on Wednesday, November 6, at 11:30 a.m. Eastern time.This address will be webcast live at http://investors.csx.com. A replay and accompanying audio will be available following the conclusion of this event. This announcement, as well as additional financial information, is available on the company’s website at http://investors.csx.com.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corporation and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX). Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "Thinking about trading options or stock in Adobe, TD Ameritrade, American Express, CSX, or Lowe's?",
        "subtitle": "",
        "date": "Oct 22, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 22, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ADBE, AMTD, AXP, CSX, and LOW.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-adobe-td-ameritrade-american-express-csx-or-lowes-300943002.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "CSX Announces Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 16, 2019 4:02PM EDT",
        "content": "JACKSONVILLE, Fla., Oct.  16, 2019  (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ: CSX) today announced third quarter 2019 net earnings of $856 million, or $1.08 per share, versus $894 million, or $1.05 per share in the same period last year (an earnings per share increase of 3 percent). CSX’s operating ratio set a new company record of 56.8 percent, improved from 58.7 percent in the prior year.“I am extremely proud of our dedicated team of CSX railroaders for once again setting new records for operating efficiency, customer service, and safety this quarter,” said James M. Foote, president and chief executive officer. “These results reflect our continued commitment toward being the best run railroad in North America and providing our customers with best-in-class service.”Revenue for the third quarter decreased by 5 percent over the prior year to $2.98 billion, as Merchandise revenue growth was more than offset by Coal and Intermodal declines. Expenses decreased 8 percent year over year to $1.69 billion, driven by continued efficiency gains and volume-related savings. Operating income was roughly flat at $1.29 billion compared to the same period last year.CSX executives will conduct a conference call with the investment community this afternoon, October 16, at 4:30 p.m. Eastern Time. Investors, media and the public may listen to the conference call by dialing 1-888-327-6279 (1-888-EARN-CSX). For callers outside the U.S., dial 1-773-756-0199. Participants should dial in 10 minutes prior to the call and enter in 3276279 as the passcode.In conjunction with the call, a live webcast will be accessible and presentation materials will be posted on the company's website at http://investors.csx.com. Following the earnings call, an internet replay of the presentation will be archived on the company website.This earnings announcement, as well as additional detailed financial information, is contained in the CSX Quarterly Financial Report available through the company’s website at http://investors.csx.com and on Form 8-K with the Securities and Exchange Commission.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Facebook (http://www.facebook.com/OfficialCSX). The social media channels used by CSX may be updated from time to time. More information about CSX Corporation and its subsidiaries is available at www.csx.com.Non-GAAP Disclosure CSX reports its financial results in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). CSX also uses certain non-GAAP measures that fall within the meaning of Securities and Exchange Commission Regulation G and Regulation S-K Item 10(e), which may provide users of the financial information with additional meaningful comparison to prior reported results. Non-GAAP measures do not have standardized definitions and are not defined by U.S. GAAP. Therefore, CSX’s non-GAAP measures are unlikely to be comparable to similar measures presented by other companies. The presentation of these non-GAAP measures should not be considered in isolation from, as a substitute for, or as superior to the financial information presented in accordance with GAAP.Forward-looking StatementsThis information and other statements by the company may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act with respect to, among other items: projections and estimates of earnings, revenues, margins, volumes, rates, cost-savings, expenses, taxes, liquidity, capital expenditures, dividends, share repurchases or other financial items, statements of management's plans, strategies and objectives for future operations, and management's expectations as to future performance and operations and the time by which objectives will be achieved, statements concerning proposed new services, and statements regarding future economic, industry or market conditions or performance. Forward-looking statements are typically identified by words or phrases such as “will,” “should,” “believe,” “expect,” “anticipate,” “project,” “estimate,” “preliminary” and similar expressions. Forward-looking statements speak only as of the date they are made, and the company undertakes no obligation to update or revise any forward-looking statement. If the company updates any forward-looking statement, no inference should be drawn that the company will make additional updates with respect to that statement or any other forward-looking statements.Forward-looking statements are subject to a number of risks and uncertainties, and actual performance or results could differ materially from that anticipated by any forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by any forward- looking statements include, among others; (i) the company's success in implementing its financial and operational initiatives; (ii) changes in domestic or international economic, political or business conditions, including those affecting the transportation industry (such as the impact of industry competition, conditions, performance and consolidation); (iii) legislative or regulatory changes; (iv) the inherent business risks associated with safety and security; (v) the outcome of claims and litigation involving or affecting the company; (vi) natural events such as severe weather conditions or pandemic health crises; and (vii) the inherent uncertainty associated with projecting economic and business conditions.Other important assumptions and factors that could cause actual results to differ materially from those in the forward-looking statements are specified in the company's SEC reports, accessible on the SEC's website at www.sec.gov and the company's website at www.csx.com.Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Announces Senior Sales and Marketing Appointments",
        "subtitle": "",
        "date": "Oct 7, 2019 4:05PM EDT",
        "content": "JACKSONVILLE, Fla., Oct.  07, 2019  (GLOBE NEWSWIRE) -- CSX (NASDAQ: CSX) today announced the appointment of Farrukh Bezar as senior vice president of Marketing and Arthur Adams as vice president of Merchandise Sales. These two senior appointments highlight the company’s intense focus on leveraging its operating model and industry-leading service product to grow the business, especially in the critically important merchandise segment.Bezar, who joined CSX in May as senior vice president and chief strategy officer, will now lead the company’s merchandise marketing groups, in addition to continuing his corporate strategy role. Bezar will draw on more than 25 years of experience as a transportation and logistics industry strategist to identify growth opportunities in the important merchandise markets that represent the core of CSX’s business.“Farrukh brings a fresh perspective with proven industry experience that will energize our teams to capitalize on the potential of our leading service product to meet customers’ needs in innovative new ways,” said Mark Wallace, executive vice president of Sales and Marketing. “I’m extremely confident in his ability to help us effectively identity, develop and execute on initiatives to further expand our business portfolio, capture market share and grow the franchise.”Adams will be responsible for leading all sales portfolios within the industrial products, food and agriculture, fertilizers and regional sales segments. He will also continue to oversee customer engagement and TRANSFLO services. Adams has been with CSX for 12 years and has played a critical role in strengthening the company’s market position and customer relationships.“Arthur is an exceptional sales executive and has consistently demonstrated an unparalleled understanding of our customers’ business needs and an ability to build strong relationships that drive growth and improve customer service,” Wallace said. “I’m confident in his ability to excel in this expanded role as we continually enhance our customer experience and develop comprehensive solutions that meet the needs of shippers.”Among the Sales and Marketing leadership changes, Dean Piacente, vice president of Industrial Products and Tim McNulty, vice president of Food and Agricultural Products, have announced their retirements from the company after more than 30 years of service.“Dean and Tim have been valued members of the CSX team during their tenures and have provided exceptional service to the company, particularly during the past two years of transformative change,” Wallace said. “CSX is well positioned to deliver even greater performance in the years ahead – benefitting our customers, our shareholders and our employees – and we look forward to driving the company’s growth strategies with the powerful sales and marketing leadership team we’ve established.”Other members of the CSX Sales and Marketing leadership team — Maryclare Kenney, vice president of Intermodal and Automotive; Adam Longson, vice president of Energy; and Shantel Davis, vice president of Real Estate and Facilities Management — will continue in their current roles.About CSXCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.  More information about CSX Corporation and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX). Contact:Bill Slater, Investor Relations 904-359-1334Bryan Tucker, Corporate Communications 855-955-6397 "
    },
    {
        "title": "CSX Corporation Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Oct 3, 2019 9:00AM EDT",
        "content": "JACKSONVILLE, Fla., Oct.  03, 2019  (GLOBE NEWSWIRE) -- Yesterday, the Board of Directors of CSX Corporation (NASDAQ: CSX) approved a $0.24 per share quarterly dividend on the company's common stock. The dividend is payable on December 13, 2019, to shareholders of record at the close of business on November 29, 2019.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Facebook (http://www.facebook.com/OfficialCSX). The social media channels used by CSX may be updated from time to time. More information about the company and its subsidiaries is available at www.csx.com.Contacts: Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Announces Executive Leadership Appointments",
        "subtitle": "",
        "date": "Oct 2, 2019 4:05PM EDT",
        "content": "JACKSONVILLE, Fla., Oct.  02, 2019  (GLOBE NEWSWIRE) -- CSX (NASDAQ: CSX) today announced the appointments of Kevin Boone as executive vice president and chief financial officer and Jamie Boychuk as executive vice president of Operations. Ed Harris, who previously led the Operations function, will continue as executive vice president with a combination of operating and general executive responsibilities. “Both Kevin and Jamie have played a significant role in the company’s recent transformation and are great additions to our executive team,” said CSX President and Chief Executive Officer James M. Foote. “Kevin’s strong and diverse finance background will be invaluable as we strive to operate efficiently and create shareholder value.”  Boone was named interim chief financial officer in May 2019. He joined CSX in 2017 as vice president of corporate affairs and chief investor relations officer, and then was appointed vice president of marketing and strategy to lead research and data analysis to advance growth strategies. Boone has over 18 years of experience in finance, mergers and acquisitions, and accounting, primarily focused on the transportation and industrial sectors. Prior to joining CSX, Boone worked as a senior equity research analyst at Janus Capital, vice president at Morgan Stanley in equity research and associate at Merrill Lynch in the mergers and acquisitions group.    “Jamie has demonstrated great skill in producing record-setting results in service and efficiency gains throughout his over 20-year railroad operating career,” said Foote. “In addition, I could not be more pleased that 50-year veteran railroad operator Ed Harris has agreed to work with Jamie as CSX strives to strengthen its leadership position in the industry. I am proud that we have the best team of railroaders in the business.”Boychuk joined CSX in 2017, and has held the positions of assistant vice president of transportation support; vice president of scheduled railroading; and most recently, senior vice president of network operations, mechanical, engineering and intermodal operations. He came to CSX from the Canadian National Railway, where he served for 20 years in various operational roles of increasing responsibility.Harris joined CSX in January 2018 as executive vice president of Operations. In his new role, he will continue to train, coach and mentor operations leadership while maintaining oversight of several key functional areas, including safety, performance metrics and operational planning. About CSXCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.  More information about CSX Corporation and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX). Contact:Bill Slater, Investor Relations 904-359-1334Bryan Tucker, Corporate Communications 855-955-6397"
    },
    {
        "title": "CSX Named to Dow Jones Sustainability Index for North America for Ninth Consecutive Year",
        "subtitle": "",
        "date": "Sep 19, 2019 2:00PM EDT",
        "content": "JACKSONVILLE, Fla., Sept.  19, 2019  (GLOBE NEWSWIRE) -- CSX (NASDAQ: CSX) was named to the Dow Jones Sustainability Index for North America for the ninth consecutive year, recognizing the company’s leadership in sustainable and responsible business practices. CSX was the only U.S.-based railroad included on the North American index in 2019.“CSX is achieving unprecedented goals – in safety, fuel efficiency, operating performance, and sustainability,” said James M. Foote, president and chief executive officer. “CSX is also partnering with customers to find new ways to convert more freight from highway to rail, so together we can reduce our carbon footprint, minimize impacts on the environment and help create a more efficient supply chain.”CSX was recognized for performance in corporate citizenship and philanthropy, environmental policy and management systems, and human capital development.  “With changing market dynamics, the need for a safe yet agile freight rail provider is more crucial than ever for our customers,” said Foote. “We are positioned to look for unique ways to bring value to our customers, shareholders, employees and communities where we operate while running a sustainable, best-in-class business.”The DJSI North America index is a partnership between the Dow Jones Indices and RobecoSAM Sustainability Assessments, which tracks the leading sustainability-driven companies based on an analysis of financially material economic, environmental and governance criteria. To learn more about sustainability at CSX, view the company’s most recent Corporate Social Responsibility Report at https://www.csx.com/index.cfm/about-us/responsibility/. About CSXCSX, based in Jacksonville, Florida, is a premier transportation company.  It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.  For nearly 200 years, CSX has played a critical role in the nation’s economic expansion and industrial development.  Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides.  It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.  More information about CSX Corporation and its subsidiaries is available at www.csx.com. Like us on Facebook (http://facebook.com/OfficialCSX) and follow us on Twitter (http://twitter.com/CSX). Contact:Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "CSX Corporation Announces Date for Third-Quarter Earnings Release and Earnings Call",
        "subtitle": "",
        "date": "Sep 18, 2019 10:00AM EDT",
        "content": "JACKSONVILLE, Fla., Sept.  18, 2019  (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ: CSX) will release third-quarter financial and operating results after the market close on Wednesday, October 16, 2019. This will be followed by a conference call and live webcast hosted by the company’s management team at 4:30 p.m. Eastern Time.Those interested in participating via teleconference may dial 1-888-327-6279 (1-888-EARN-CSX). Callers outside the U.S. dial 1-773-756-0199. Participants should dial in 10 minutes prior to the call and enter in 3276279 as the passcode.Presentation materials and access to the audio webcast will be available on the company’s website at http://investors.csx.com. Following the earnings call, a webcast replay and an MP3 audio file will be archived on the company’s website.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Facebook (http://www.facebook.com/OfficialCSX). The social media channels used by CSX may be updated from time to time. More information about CSX Corporation and its subsidiaries is available at www.csx.com.Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397"
    },
    {
        "title": "Option-trading opportunities on CSX Corp., Intel Corp., JPMorgan Chase & Co., Qualcomm Inc., and Unum Group",
        "subtitle": "",
        "date": "Apr 18, 2019 9:31AM EDT",
        "content": "NEW YORK, April 18, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CSX, INTC, JPM, QCOM, and UNM.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/option-trading-opportunities-on-csx-corp-intel-corp-jpmorgan-chase--co-qualcomm-inc-and-unum-group-300834638.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "CSX Announces Record First Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Apr 16, 2019 4:02PM EDT",
        "content": "JACKSONVILLE, Fla., April 16, 2019 (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ:CSX) today announced first quarter 2019 net earnings of $834 million, or $1.02 per share, versus $695 million, or $0.78 per share in the same period last year (an earnings per share increase of 31 percent). CSX's operating ratio set a company first quarter record of 59.5 percent, significantly improved from 63.7 percent in the prior year.\"The CSX team of exceptional railroaders continues to execute across all aspects of our business, delivering new all-time high service levels,\" said James M. Foote, president and chief executive officer. \"These results reflect the strength of our Company's operating model and our commitment to providing a best-in-class service offering to our customers.\"Revenue for the first quarter increased 5 percent over the prior year to $3.01 billion, driven by Merchandise volume growth and broad-based pricing gains. Expenses decreased 2 percent year over year to $1.79 billion, driven by continued efficiency gains. This combination yielded operating income growth of 17 percent for the quarter to $1.22 billion compared to $1.04 billion in the same period last year.CSX executives will conduct a conference call with the investment community this afternoon, April 16, at 4:30 p.m. Eastern Time. Investors, media and the public may listen to the conference call by dialing 1-888-327-6279 (1-888-EARN-CSX). For callers outside the U.S., dial 1-773-756-0199. Participants should dial in 10 minutes prior to the call and enter in 3276279 as the passcode.In conjunction with the call, a live webcast will be accessible and presentation materials will be posted on the company's website at http://investors.csx.com. Following the earnings call, an internet replay of the presentation will be archived on the company website.This earnings announcement, as well as additional detailed financial information, is contained in the CSX Quarterly Financial Report available through the company's website at http://investors.csx.com and on Form 8-K with the Securities and Exchange Commission.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Slideshare (http://www.slideshare.net/HowTomorrowMoves). The social media channels used by CSX may be updated from time to time.More information about CSX Corporation and its subsidiaries is available at www.csx.com and on Facebook (http://www.facebook.com/OfficialCSX).Non-GAAP DisclosureCSX reports its financial results in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). CSX also uses certain non-GAAP measures that fall within the meaning of Securities and Exchange Commission Regulation G and Regulation S-K Item 10(e), which may provide users of the financial information with additional meaningful comparison to prior reported results. Non-GAAP measures do not have standardized definitions and are not defined by U.S. GAAP. Therefore, CSX's non-GAAP measures are unlikely to be comparable to similar measures presented by other companies. The presentation of these non-GAAP measures should not be considered in isolation from, as a substitute for, or as superior to the financial information presented in accordance with GAAP.Forward-looking StatementsThis information and other statements by the company may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act with respect to, among other items: projections and estimates of earnings, revenues, margins, volumes, rates, cost-savings, expenses, taxes, liquidity, capital expenditures, dividends, share repurchases or other financial items, statements of management's plans, strategies and objectives for future operations, and management's expectations as to future performance and operations and the time by which objectives will be achieved, statements concerning proposed new services, and statements regarding future economic, industry or market conditions or performance. Forward-looking statements are typically identified by words or phrases such as \"will,\" \"should,\" \"believe,\" \"expect,\" \"anticipate,\" \"project,\" \"estimate,\" \"preliminary\" and similar expressions. Forward-looking statements speak only as of the date they are made, and the company undertakes no obligation to update or revise any forward-looking statement. If the company updates any forward-looking statement, no inference should be drawn that the company will make additional updates with respect to that statement or any other forward-looking statements.Forward-looking statements are subject to a number of risks and uncertainties, and actual performance or results could differ materially from that anticipated by any forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by any forward- looking statements include, among others; (i) the company's success in implementing its financial and operational initiatives; (ii) changes in domestic or international economic, political or business conditions, including those affecting the transportation industry (such as the impact of industry competition, conditions, performance and consolidation); (iii) legislative or regulatory changes; (iv) the inherent business risks associated with safety and security; (v) the outcome of claims and litigation involving or affecting the company; (vi) natural events such as severe weather conditions or pandemic health crises; and (vii) the inherent uncertainty associated with projecting economic and business conditions.Other important assumptions and factors that could cause actual results to differ materially from those in the forward-looking statements are specified in the company's SEC reports, accessible on the SEC's website at www.sec.gov and the company's website at www.csx.com.Contact:Bill Slater, Investor Relations904-359-1334Bryan Tucker, Corporate Communications855-955-6397Source: CSX Corporation"
    },
    {
        "title": "CSX Corporation Announces Date for First-Quarter Earnings Release and Earnings Call",
        "subtitle": "",
        "date": "Mar 19, 2019 10:00AM EDT",
        "content": "JACKSONVILLE, Fla., March 19, 2019 (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ:CSX) will release first-quarter financial and operating results after the market close on Tuesday, April 16, 2019. This will be followed by a conference call and live webcast hosted by the company's management team at 4:30 p.m. Eastern Time.Those interested in participating via teleconference may dial 1-888-327-6279 (1-888-EARN-CSX). Callers outside the U.S. dial 1-773-756-0199. Participants should dial in 10 minutes prior to the call and enter in 3276279 as the passcode.Presentation materials and access to the audio webcast will be available on the company's website at http://investors.csx.com. Following the earnings call, a webcast replay and an MP3 audio file will be archived on the company's website.About CSX and its DisclosuresCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.This announcement, as well as additional financial information, is available on the company's website at http://investors.csx.com. CSX also uses social media channels to communicate information about the company. Although social media channels are not intended to be the primary method of disclosure for material information, it is possible that certain information CSX posts on social media could be deemed to be material. Therefore, we encourage investors, the media, and others interested in the company to review the information we post on Twitter (http://twitter.com/CSX) and on Slideshare (http://www.slideshare.net/HowTomorrowMoves). The social media channels used by CSX may be updated from time to time.More information about CSX Corporation and its subsidiaries is available at www.csx.com and on Facebook (http://www.facebook.com/OfficialCSX).Contact:Kevin Boone, Investor Relations904-359-1090Bryan Tucker, Corporate Communications855-955-6397Source: CSX Corporation"
    }
]