[
    {
        "title": "Cintas Survey Shows Majority of Americans Value Workplace Restroom Care",
        "subtitle": "",
        "date": "Mar 3, 2020 9:16AM EST",
        "content": "    CINCINNATI--(BUSINESS WIRE)--\nA new online survey commissioned by Cintas Corporation (NASDAQ: CTAS) revealed that 90% of Americans think employers who deep clean their workplace restrooms regularly care more about the health and wellness of their employees than employers who don’t. The survey also found that nine in 10 Americans (90%) believe employers who pay consistent attention to their workplace restroom cleanliness care more about their employees than those who do not. The survey of more than 2,000 U.S. adults was conducted for Cintas by The Harris Poll.\n\n“Just like customers, employees deserve a clean, sanitized and well-stocked restroom,” said Christiny Betsch, Marketing Manager, Cintas. “This study shows that implementing a comprehensive restroom cleaning program could enhance an employer’s image and providing high-quality restroom products could boost employee morale.”\n\nThe poll also revealed:\n\nWith the Cintas UltraClean® restroom service, organizations can exceed employees’ expectations by sanitizing surfaces and removing build-up, soil and bacteria. The high-pressure cleaning process uses chemicals that are formulated to clean restroom surfaces while leaving a pleasant scent.\n\nOffering businesses a stylish and higher-quality alternative to the traditional, industrial look of restroom accessories and supplies, Cintas Signature Series® includes everything from soap and toilet paper dispensers to air fresheners and trash cans — all in a sleek, functional and customizable design.\n\nFor more information about Cintas facility services, visit Cintas.com/facilityservices.\n\nSurvey Method:\n\nThis survey was conducted online within the United States by The Harris Poll on behalf of Cintas from January 6-8, 2020 among 2,007 U.S. adults ages 18 and older. This online survey is not based on a probability sample and therefore no estimate of theoretical sampling error can be calculated. For complete survey methodology, including weighting variables and subgroup sample sizes, please contact jkoerner@mulberrymc.com.\n\nAbout Cintas Corporation \n\nCintas Corporation helps more than one million businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®.  Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.  \n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200303005110/en/\nJessie Koerner \nMulberry Marketing Communications  \n312-664-1532 \njkoerner@mulberrymc.com   \nSource: Cintas Corporation"
    },
    {
        "title": "Design Collective by Cintas Creates High Fashion on the High Seas with Virgin Voyages Apparel Collection",
        "subtitle": "",
        "date": "Mar 2, 2020 10:16AM EST",
        "content": "\nBritish fashion designer Gareth Pugh and Design Collective™ by Cintas collaborate on modern wardrobe collection\n    CHICAGO--(BUSINESS WIRE)--\nRichard’s Branson’s new cruise line Virgin Voyages is scheduled to set sail in April 2020. Today Design Collective™ by Cintas Corporation (NASDAQ: CTAS) announced that it will execute a modern apparel collection designed by British fashion designer Gareth Pugh for the crew. Virgin Voyages led a collaboration with Design Collective by Cintas to bring Gareth’s fashion-forward designs to life with apparel pieces that mirror the vivacity which is synonymous with the Virgin brand.\n\n“We’re honored for the opportunity to work hand-in-hand with Virgin Voyages and Gareth to bring together modern and luxurious designs to Virgin Voyages,” said Todd McKeown, President and COO of Design Collective by Cintas. “Richard Branson puts his employees first, so it was critical for every crew member to feel confident and comfortable in the apparel, so they can be a critical part of the total passenger experience. We used our extensive experience in designing and manufacturing for the cruise industry and worked with Gareth Pugh and the Virgin Voyages team to develop this game changing program.”\n\nThe core collection includes sustainable fabrics and garments designed for a range of job functions, climates and body types. The program breaks with cruise stereotypes by removing epaulettes (shoulder stripes designating rank for officers), ties and waistcoats. It features a distinct combination of structure and fluidity and includes a wide range of looks from slick razor-sharp tailoring to relaxed pillow-case tunic shirts referencing the early days of British punk, and more.\n\n“We really wanted to shake up the industry and redefine cruise fashion. Working with fashion Designer Gareth Pugh helped us create a fantastic wardrobe collection for our crew reflecting a modern sailing holiday experience,” said Dee Cooper, SVP Design and Customer Experience at Virgin Voyages. “We decided to partner with Design Collective by Cintas to make sure the garments would really deliver on all levels. Their knowledge of fabrics and application made the designs functional for the cruise environment, and they helped create an Epic Sea Change for all.”\n\nVirgin Voyages currently has four ships on order, and will launch its first adults-only vessel, Scarlet Lady, in Spring 2020.\n\nFor more information about Design Collective by Cintas, please visit: www.cintas.com/designcollective.\n\nAbout Design Collective™ by Cintas\n\nThe Design Collective by Cintas is a distinctive fashion house dedicated to creating a modern wardrobe for employees. With design studios in Las Vegas, Chicago, Toronto and Miami, Design Collective’s award-winning designers blend garments from our ready-to-wear line with custom-designed pieces to curate apparel collections that enhance brand identity. These collections are often complemented with garments from our retail brand collaborations, giving employees wardrobes they love to wear. Design Collective is a division of Cintas Corporation, a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\n\nAbout Virgin Voyages \n\nVirgin Voyages is a global lifestyle brand committed to creating the world’s most irresistible holidays. The brand currently has four ships on order with master shipbuilder Fincantieri and has operations in the US, UK and Europe. With its inaugural season beginning this year, Virgin Voyages’ first ship, Scarlet Lady was designed to reflect a yacht’s sleek luxury. Featuring spaces designed by some of the top names in contemporary interiors, Scarlet Lady will be Adult-by-Design, a sanctuary at sea for the 18+ traveler. A dose of Vitamin Sea will be naturally intertwined across the entire ship, with well-being activated through a mix of high-energy moments coupled with relaxation and rejuvenation. Scarlet Lady will also feature alluring entertainment and 20+ world-class intimate eateries on board. Putting a twist on luxury, Virgin Voyages will offer incredible value for its sailors with all restaurants, group fitness classes, soft drinks, and many more Virgin surprises.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005650/en/\nChristina Alvarez\nMulberry Marketing Communications\n708-908-0898\ncalvarez@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "Cintas Corporation Launches Two90 Award Program",
        "subtitle": "",
        "date": "Feb 27, 2020 9:00AM EST",
        "content": "\nEveryday bystanders and trained caregivers honored for taking action to help save a life\n    CINCINNATI--(BUSINESS WIRE)--\nFebruary is American Heart Month and each year, 356,000 people of all ages experience sudden cardiac arrest (SCA), but using an automated external defibrillator (AED) with CPR in the first two minutes can improve survival by 90%1. Cintas Corporation (NASDAQ: CTAS), a leading provider of workplace first aid, safety supplies and training services, launched the Two90 award program, which recognizes both the company for deciding to get an AED through Cintas that saved a life and the individual who deployed the unit saving a life. The award honors everyday bystanders who act in time to help save a life by using an AED that their company purchased through Cintas.\n\n“In 2019, the AED units we deployed saved, on average, one life per week,” said Katie Gough-Edwards, Marketing Director - First Aid & Safety, Cintas. “This award program provides companies the opportunity to acknowledge individuals who take action and use an AED and perform CPR in an emergency. Their quick thinking and willingness to act in stressful, uncertain situations serve as a worthy example and inspiration.”\n\nThe Two90 award is an honor that is reserved for companies who demonstrate devotion to the well-being of employees and visitors by deciding to make AED units available in the workplace. Individual recipients receive a letter of commendation and “thanks” from Cintas, as well as a brass pin that places them in exclusive company with others who share these admirable qualities. The individual’s employer will also receive a letter, certificate and Two90 Note from Cintas leadership to proudly display, making employees and customers aware that they value life-saving technology and training.\n\n“What is more important to a business than the health and safety of their employees and customers?” added Mark Carter, President & COO – First Aid and Safety, Cintas.\n\nFor more information about the Two90 award program or to nominate an individual for the award, Cintas customers can contact their Cintas representative to complete a questionnaire.\n\nCintas offers three of the major AED units in the marketplace – Zoll, Defibtech Reviver line, and Philips. Cintas also offers first aid and safety products and services to help business prepare for and treat emergencies. For more information on Cintas’ products and services, please visit https://www.cintas.com/firstaidsafety/.\n\nAbout Cintas Corporation:\n\nCintas Corporation helps more than one million businesses of all types and sizes get ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and training and compliance courses, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\n\n1 Newman, Christenson, Eisenberg. Community CPR-AED Programs. Retrieved from http://www.sca-aware.org/community-cpr-aed-programs\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005547/en/\nChristina Alvarez\nMulberry Marketing Communications\n708-908-0898\nCalvarez@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "Children’s Heart Association of Cincinnati “Takes Charge” of AEDs in Cincinnati School Districts",
        "subtitle": "",
        "date": "Feb 19, 2020 9:00AM EST",
        "content": "\nWinning school district will receive 20 Zoll AED Plus® units and first aid and CPR training from Cintas Corporation\n    CINCINNATI--(BUSINESS WIRE)--\nIn honor of American Heart Month, the Children’s Heart Association of Cincinnati introduces its Take Charge automated external defibrillator (AED) school program for local Cincinnati school districts. Twenty Zoll AEDs units will be installed by Cintas Corporation (NASDAQ: CTAS), a leading provider of workplace first aid, safety supplies and training services. The program is made possible through a grant from Anthem, Inc.\n\nPublic and private K-12 schools are encouraged to submit nominations for Take Charge via the Children’s Heart Association of Cincinnati’s Facebook page at www.AEDTakeCharge.com through March 31, 2020. Parents of students are also encouraged to nominate their child’s school for this program.\n\n“According to the American Heart Association, more than 7,000 children were affected by sudden cardiac arrest (SCA) last year1,” said Terry Karageorges, President of the Children’s Heart Association of Cincinnati. “When a victim collapses from SCA, high-quality CPR and AEDs are their best chance of survival. We are grateful to Anthem, Cintas and Zoll for their support in providing a local school district with the tools and knowledge necessary to be prepared if SCA strikes a student, staff member or visitor.”\n\nRepresentatives from Children’s Heart Association of Cincinnati will select a winning school or school district to receive the AED unit which will include pediatric and adult pads, wall-mounted cabinets, First Aid/CPR/AED training courses and AED demos.\n\n“Every second counts when treating sudden cardiac arrest,” said Katie Gough-Edwards, Director of Marketing for Cintas’ First Aid & Safety division. “By installing AEDs, schools have access to live-saving technology and the opportunity to play a critical role in the chain of survival when an emergency strikes. We hope this program raises awareness about SCA in schools and helps local schools be better prepared to save a life during a cardiac emergency.”\n\nFor more information about the Take Charge program or to nominate a school, visit the Children’s Heart Association of Cincinnati Facebook page at www.AEDTakeCharge.com.\n\nThe Children’s Heart Association of Cincinnati is a group of dedicated and local volunteers, many of whom have been affected personally by a child or grandchild born with a congenital heart defect. The organization helps to provide the best equipment, research and training for the Cardiology staff at Cincinnati Children's Hospital.\n\nCintas offers three of the major AED units in the marketplace – Zoll, Defibtech Reviver line, and Philips. Cintas also offers first-aid and safety products and services to help businesses prepare for and treat emergencies. For more information on Cintas’ products and services, please visit https://www.cintas.com/firstaidsafety/.\n\nAbout Children’s Heart Association of Cincinnati: \n\nThe mission of the Children’s Heart Association of Cincinnati is to inspire heartfelt hope in patients and families impacted by Congenital Heart Defects, as well as the medical practitioners that care for them, through the funding of groundbreaking research, global collaboration, and holistic well-being initiatives. Established in 1940, CHAoC is one of the oldest and most impactful congenital heart defect foundations supporting programs at the Heart Institute of Cincinnati Children's Hospital Medical Center and through additional global collaborations.\n\n1 Heart Disease and Stroke Statistics—2019 Update: A Report From the American Heart Association\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005549/en/\nChristina Alvarez\nMulberry Marketing Communications\n708-908-0898\nCalvarez@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "New Cintas Survey Shows Overwhelming Majority of Americans Prefer Anti-Fatigue Mats at Work",
        "subtitle": "",
        "date": "Feb 18, 2020 10:28AM EST",
        "content": "    CINCINNATI--(BUSINESS WIRE)--\nA new online survey commissioned by Cintas Corporation (NASDAQ: CTAS) revealed that 91% of U.S. adults feel that employers should supply anti-fatigue floor mats as a benefit for their employees who work long hours on their feet. It also found that 93% believe companies that provide anti-fatigue floor mats care more about their employees’ health and comfort than those that do not. The online survey of 2,050 U.S. adults aged 18 and older was conducted for Cintas by The Harris Poll from Nov. 5 – 7, 2019.\n\n“Long hours of standing can result in worker fatigue and reduced productivity,” said Sean Mulcahey, Marketing Manager, Cintas. “This study shows that Americans believe employers should provide services such as anti-fatigue mats to benefit employees who stand for long periods of time. This can enhance worker productivity and overall employee morale.”\n\nThe survey also revealed that 94% of Americans believe the health and comfort of employees who work on their feet for long hours should be a top priority for their employers.\n\nWith a Seal of Acceptance from the American Podiatric Medical Association, Cintas anti-fatigue mats are designed and constructed to ease the physical strain that comes with long periods of standing on the job. The mats include beveled edges to reduce curling, so the mats lay flat, longer and are certified for high-traction by the National Floor Safety Institute.\n\nOther key findings include:\n\n“Providing a comfortable work environment can lead to happier, more productive employees,” added Mulcahey. “Anti-fatigue mats are specially designed and constructed to ease the physical strain that comes with long periods of standing on the job.”\n\nFor more information on Cintas anti-fatigue mats, visit https://www.cintas.com/facilityservices/commercial-floor-mat-service/wellnessmats/\n\nSurvey Methodology\n\nThis survey was conducted online within the United States by The Harris Poll on behalf of Cintas from November 5-7, 2019, among 2,050 U.S. adults ages 18 and older. This online survey is not based on a probability sample and therefore no estimate of theoretical sampling error can be calculated. For complete survey methodology, including weighting variables and subgroup sample sizes, please contact jkoerner@mulberrymc.com\n\nAbout Cintas Corporation\n\nCintas Corporation helps more than one million businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®.  Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index. \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200218005748/en/\nJessie Koerner\nMulberry Marketing Communications\n312-664-1532\njkoerner@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "Cintas Shows Appreciation of School Custodians During Nationwide Contest",
        "subtitle": "",
        "date": "Feb 3, 2020 9:16AM EST",
        "content": "\nCintas’ seventh-annual Custodian of the Year contest is now underway\n    CINCINNATI--(BUSINESS WIRE)--\nCintas Corporation (NASDAQ: CTAS) is now accepting nominations for its seventh-annual Custodian of the Year contest, which honors the best-of-the-best amongst school custodians. Nominations are being accepted at http://www.custodianoftheyear.com/ until March 2, 2020.\n\nCreated to celebrate custodians who go above and beyond to support school cleanliness and student well-being, the contest awards $10,000 to the winning custodian and $5,000 in Cintas and Rubbermaid products and services to the winner’s school. The winner’s school will also receive a comprehensive training and development package from ISSA, The Worldwide Cleaning Industry Association, valued at $20,000. An additional nine finalists will receive $1,000 each and free tuition to one ISSA Cleaning Management Institute (CMI) training event, valued at $1,500.\n\n“By maintaining school facilities, custodians provide students, staff and visitors with a clean and healthy environment that supports learning,” said Christiny Betsch, Marketing Manager, Cintas. “Many are also the backbone of their school community, going the extra mile in everything they do. This contest highlights the important work custodians do each day.”\n\nThe Cintas Custodian of the Year contest is open to all elementary, middle, high school and university custodians who have worked at their school for at least two years. Nominations must be 500 words or less on why the nominee is deserving of the award and submitted by March 2. Cintas is announcing the top 10 finalists on March 16. The public can vote for their favorite custodian through April, and the finalist with the most votes will be crowned Custodian of the Year.\n\n“Custodians do much more than clean,” said John Barrett, Executive Director, ISSA. “They protect children in schools, elderly in long-term care facilities, guests in hotels, visitors in stores and so much more by creating clean, healthy and safe environments. ISSA is committed to changing the way the world views cleaning, and we are honored to help Cintas recognize dedicated custodians across the country.”\n\nRubbermaid Commercial Products’ Vice President of Marketing, Marta Aebischer, added: “We are proud to partner with Cintas to showcase the 2020 Custodian of the Year. We realize how important their hard work is to our communities and we are committed to providing innovative solutions that make their jobs easier and safer.”\n\nFor more information regarding Cintas’ Custodian of the Year contest, please contact Jessie Koerner at jkoerner@mulberrymc.com. A Custodian of the Year logo is available via email or Dropbox at https://www.dropbox.com/s/njrarsdrwbb39ui/COTY2020_Logo_CMYK.JPG?dl=0\n\nAbout Cintas Corporation:\n\nCintas Corporation helps more than one million businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\n\nAbout ISSA: \n\nWith more than 9,300 members—including distributors, manufacturers, manufacturer representatives, wholesalers, building service contractors, in-house service providers, residential cleaners, and associated service members—ISSA is the world’s leading trade association for the cleaning industry. The association is committed to changing the way the world views cleaning by providing its members with the business tools they need to promote cleaning as an investment in human health, the environment, and an improved bottom line. Headquartered in Northbrook, IL, USA, the association has regional offices in Mainz, Germany; Parramatta, Australia; Whitby, Canada; Seoul, South Korea; and Shanghai, China. Visit issa.com, join the discussion with ISSA’s LinkedIn group, and follow ISSA on our Facebook page and Twitter account. For more information, visit issa.com, or call 800-225-4772 (North America) or 847-982-0800.\n\nAbout Rubbermaid Commercial Products:\n\nRubbermaid Commercial Products (RCP), headquartered in Huntersville, N.C., is a manufacturer of innovative, solution-based products for commercial and institutional markets worldwide. Since 1968, RCP has pioneered technologies and system solutions in the categories of food services, sanitary maintenance, waste handling, material transport and away-from-home washroom and safety products. RCP, an ISO 9001:2000 manufacturer, is part of Newell Rubbermaid’s global portfolio of leading brands and continues to develop innovative products. Visit www.rubbermaidcommercial.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200203005498/en/\nJessie Koerner\nMulberry Marketing Communications\njkoerner@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "Cintas Named to FORTUNE’s Most Admired Companies List",
        "subtitle": "",
        "date": "Jan 28, 2020 11:00AM EST",
        "content": "    CINCINNATI--(BUSINESS WIRE)--\nCintas Corporation (NASDAQ: CTAS) is among FORTUNE’s “World’s Most Admired Companies” for 2020. This is the 13th time that Cintas has been recognized by FORTUNE for its strong reputation.\n\n“We’re honored to be included on this prestigious list of admired companies,” said Scott D. Farmer, chairman and CEO of Cintas. “This recognition is a direct reflection of our commitment to helping customers enhance their image and bottom line, as well as making a positive impact in the communities we serve.”\n\nTogether with global management consulting firm Korn Ferry, FORTUNE ranked the most admired companies across 52 industries. Companies were selected based on excellence in nine areas, including investment value, quality of management and products, social responsibility and ability to attract top talent. To make the list, a company’s score must rank in the top half of their industry.\n\nThe full list of FORTUNE’s Most Admired Companies will be published in the magazine’s February issue and is available at http://fortune.com/worlds-most-admired-companies.\n\nTo learn more about Cintas, visit cintas.com.\n\nAbout Cintas Corporation:\n\nCintas Corporation helps more than one million businesses of all types and sizes get ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and training and compliance courses, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005611/en/\nChristina Alvarez\nMulberry Marketing Communications\n708-908-0898\ncalvarez@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Cintas Corporation - CTAS",
        "subtitle": "",
        "date": "Jan 9, 2020 9:00AM EST",
        "content": " NEW YORK, Jan. 9, 2020 /PRNewswire/ -- Pomerantz LLP is investigating claims on behalf of investors of Cintas Corporation (\"Cintas\" or the \"Company\") (NASDAQ: CTAS).   Such investors are advised to contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888-476-6529, ext. 9980.The investigation concerns whether Cintas and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices.  [Click here for information about joining the class action] On November 13, 2019, Spruce Point Capital Management (\"Spruce Point\") issued a report on Cintas claiming to \"have evidence that Cintas' Fire Protection Services was charged with fraud and is causing a public safety hazard by having workers conduct fire and safety inspections without proper licenses or permits, and falsifying inspections.\"  Spruce Point additionally stated that \"Cintas is facing financial strain in its core uniform rental business from its 2017 levered acquisition of G&K [Services, Inc.] for $2.1 bn,\" asserting that \"it appears management may have suppressed G&K revenue and misguided expenses.\"  On this news, Cintas's stock price fell sharply during intraday trading.The Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com.CONTACT:Robert S. WilloughbyPomerantz LLPrswilloughby@pomlaw.com View original content:http://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-investigates-claims-on-behalf-of-investors-of-cintas-corporation---ctas-300981126.htmlSOURCE  Pomerantz LLP"
    },
    {
        "title": "LEAD PLAINTIFF DEADLINE: Johnson Fistel, LLP Encourages Investors to Contact the Firm",
        "subtitle": "",
        "date": "Jan 9, 2020 1:05AM EST",
        "content": " SAN DIEGO, Jan. 9, 2020 /PRNewswire/ -- Johnson Fistel, LLP announces that class action lawsuits have been commenced on behalf of shareholders of the publicly-traded companies listed below. The Private Securities Litigation Reform Act of 1995 permits any investor who purchased common stock during the Class Period to seek appointment as lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation.  The lead plaintiff can select a law firm of its choice.  An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.  If you wish to serve as lead plaintiff, you must move the Court no later than the dates listed below. If you wish to discuss this action or have any questions concerning this notice or your rights or interests, please contact lead analyst Jim Baker (jimb@johnsonfistel.com) at 619-814-4471. If emailing, please include a phone number.Additionally, you can Click Here  or any of the links below, there is no cost or obligation to you.About Johnson Fistel, LLP:Johnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York, and Georgia. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits. For more information about the firm and its attorneys, please visit https://www.johnsonfistel.com. Attorney advertising. Past results do not guarantee future outcomes.Contact:Johnson Fistel, LLPJim Baker, 619-814-4471jimb@johnsonfistel.com View original content:http://www.prnewswire.com/news-releases/lead-plaintiff-deadline-johnson-fistel-llp-encourages-investors-to-contact-the-firm-300984040.htmlSOURCE  Johnson Fistel, LLP"
    },
    {
        "title": "Cintas Corporation Announces Fiscal 2020 Second Quarter Results",
        "subtitle": "",
        "date": "Dec 17, 2019 4:15PM EST",
        "content": "    CINCINNATI--(BUSINESS WIRE)--\nCintas Corporation (Nasdaq: CTAS) today reported results for its fiscal 2020 second quarter ended November 30, 2019.\n\nRevenue for the second quarter of fiscal 2020 was $1.84 billion, an increase of 7.3% over last year’s second quarter. The organic revenue growth rate, which adjusts for the impacts of acquisitions and foreign currency exchange rate fluctuations, was also 7.3%. The organic revenue growth rate for the Uniform Rental and Facility Services operating segment was 5.8%, and the organic revenue growth rate for the First Aid and Safety Services operating segment was 10.6%.\n\nGross margin for the second quarter of fiscal 2020 of $852.4 million increased 10.0% from last year’s second quarter. Gross margin as a percentage of revenue was 46.2% for the second quarter of fiscal 2020 compared to 45.1% in the second quarter of fiscal 2019. Uniform Rental and Facility Services operating segment gross margin as a percentage of revenue improved 130 basis points from last year’s second quarter to 46.6%, and the First Aid and Safety Services operating segment gross margin as a percentage of revenue improved 40 basis points to 48.4%.\n\nOperating income for the second quarter of fiscal 2020 of $334.5 million increased 21.3% from last year’s second quarter operating income of $275.6 million. Operating income as a percentage of revenue was 18.1% in the second quarter of fiscal 2020 compared to 16.0% in the second quarter of fiscal 2019. Operating income in the second quarter of fiscal 2019 was impacted by non-recurring integration expenses related to the G&K Services, Inc. (G&K) acquisition of $7.8 million, or 50 basis points.\n\nNet income from continuing operations was $246.4 million for the second quarter of fiscal 2020, and earnings per diluted share (EPS) from continuing operations were $2.27. Net income from continuing operations was $243.0 million in the second quarter of fiscal 2019, and EPS from continuing operations were $2.18. Fiscal 2019 second quarter EPS from continuing operations included a one-time gain on the sale of a cost method investment of $0.47 and non-recurring G&K integration expenses of $0.05.\n\nThe following table provides a comparison of fiscal 2020 second quarter EPS to fiscal 2019 second quarter EPS:\n\nScott D. Farmer, Cintas' Chairman and Chief Executive Officer, stated, \"We are pleased with our second quarter and year-to-date performance. The Company is on pace to achieve another year of strong growth in revenue, earnings and cash flow generation. I thank our employee-partners for the consistently high execution that helps get our customers Ready for the Workday™.”\n\nMr. Farmer added, “Earlier this month, on December 6th, we paid an annual dividend of $2.55 per share, an increase of 24.4% over last year’s annual dividend. We have increased the annual dividend for 36 consecutive years. In the past 10 years, the annual dividend per share increased at a compound annual growth rate of 18.2%.”\n\nMr. Farmer concluded, “We are increasing our fiscal 2020 financial guidance. We are raising our annual revenue expectations from a range of $7.28 billion to $7.32 billion to a range of $7.29 billion to $7.33 billion and EPS from a range of $8.47 to $8.57 to a range of $8.65 to $8.75. This financial guidance does not include any future share buybacks. It does incorporate the impact of having one less workday in fiscal 2020 compared to fiscal 2019.”\n\nThe following table provides a comparison of fiscal 2020 revenue and EPS guidance to fiscal 2019 actual results:\n\nAbout Cintas\n\nCintas Corporation helps more than one million businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, floor care, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday™. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and the Nasdaq-100 Index.\n\nCAUTION CONCERNING FORWARD-LOOKING STATEMENTS\n\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor from civil litigation for forward-looking statements. Forward-looking statements may be identified by words such as “estimates,” “anticipates,” “predicts,” “projects,” “plans,” “expects,” “intends,” “target,” “forecast,” “believes,” “seeks,” “could,” “should,” “may” and “will” or the negative versions thereof and similar words, terms and expressions and by the context in which they are used. Such statements are based upon current expectations of Cintas and speak only as of the date made. You should not place undue reliance on any forward-looking statement. We cannot guarantee that any forward-looking statement will be realized. These statements are subject to various risks, uncertainties, potentially inaccurate assumptions and other factors that could cause actual results to differ from those set forth in or implied by this Press Release. Factors that might cause such a difference include, but are not limited to, risks inherent with the G&K transaction in the achievement of cost synergies and the timing thereof, including whether the transaction will be accretive and within the expected timeframe and the actual amounts of future integration expenses; the possibility of greater than anticipated operating costs including energy and fuel costs; lower sales volumes; loss of customers due to outsourcing trends; the performance and costs of integration of acquisitions, including G&K; fluctuations in costs of materials and labor including increased medical costs; costs and possible effects of union organizing activities; failure to comply with government regulations concerning employment discrimination, employee pay and benefits and employee health and safety; the effect on operations of exchange rate fluctuations, tariffs and other political, economic and regulatory risks; uncertainties regarding any existing or newly-discovered expenses and liabilities related to environmental compliance and remediation; the cost, results and ongoing assessment of internal controls for financial reporting required by the Sarbanes-Oxley Act of 2002; the effect of new accounting pronouncements; costs of our SAP system implementation; disruptions caused by the inaccessibility of computer systems data, including cybersecurity risks; the initiation or outcome of litigation, investigations or other proceedings; higher assumed sourcing or distribution costs of products; the disruption of operations from catastrophic or extraordinary events; the amount and timing of repurchases of our common stock, if any; changes in federal and state tax and labor laws; and the reactions of competitors in terms of price and service. Cintas undertakes no obligation to publicly release any revisions to any forward-looking statements or to otherwise update any forward-looking statements whether as a result of new information or to reflect events, circumstances or any other unanticipated developments arising after the date on which such statements are made. A further list and description of risks, uncertainties and other matters can be found in our Annual Report on Form 10-K for the year ended May 31, 2019 and in our reports on Forms 10-Q and 8-K. The risks and uncertainties described herein are not the only ones we may face. Additional risks and uncertainties presently not known to us or that we currently believe to be immaterial may also harm our business.\n\nReconciliation of Non-GAAP Financial Measures and Regulation G Disclosure\n\nThe press release contains non-GAAP financial measures within the meaning of Regulation G promulgated by the Securities and Exchange Commission. To supplement its consolidated condensed financial statements presented in accordance with U.S. generally accepted accounting principles (GAAP), the Company provides the additional non-GAAP financial measures of earnings per diluted share, cash flow and workday adjusted revenue growth. The Company believes that these non-GAAP financial measures are appropriate to enhance understanding of its past performance as well as prospects for future performance. A reconciliation of the differences between these non-GAAP financial measures with the most directly comparable financial measures calculated in accordance with GAAP are shown in the tables within the narrative of the press release or below.\n\nManagement uses free cash flow to assess the financial performance of the Company. Management believes that free cash flow is useful to investors because it relates the operating cash flow of the Company to the capital that is spent to continue, improve and grow business operations.\n\nManagement believes that workday adjusted revenue growth is valuable to investors because it reflects the revenue performance compared to a prior period with the same number of revenue generating days.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191217005810/en/\nFor additional information:\nJ. Michael Hansen, Executive Vice President and Chief Financial Officer - 513-972-2079\nPaul F. Adler, Vice President and Treasurer - 513-972-4195\nSource: Cintas Corporation"
    },
    {
        "title": "CTAS LOSS NOTICE: TOP RANKED ROSEN LAW FIRM Files Securities Class Action Lawsuit Against Cintas Corporation - CTAS",
        "subtitle": "",
        "date": "Dec 15, 2019 3:30PM EST",
        "content": "NEW YORK, Dec. 15, 2019 /PRNewswire/ -- Rosen Law Firm, a global investor rights law firm, announces it has filed a class action lawsuit on behalf of purchasers of the securities of Cintas Corporation (NASDAQ: CTAS) between March 6, 2017 and November 13, 2019, inclusive (the \"Class Period\"). The lawsuit seeks to recover damages for Cintas investors under the federal securities laws.To join the Cintas class action, go to http://www.rosenlegal.com/cases-register-1721.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.NO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR'S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFFAccording to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) Cintas never tracked legacy margins following the G&K acquisition; (2) the Company has systematically provided guidance with which it would outperform (a \"Beat and Raise\" scheme); (3) undisclosed to the investing public, the Company has breached the law multiple times; (4) as a result of publicly known and undisclosed breaches of law, the Company's Credit Agreement may be jeopardized; and (5) as a result, defendants' statements about its business, operations, and prospects, were materially false and misleading and/or lacked a reasonable basis at all relevant times. The lawsuit claims that when the truth was disclosed in the Spruce Point Capital Management investment research report, investors suffered damages.A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than February 10, 2020. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to http://www.rosenlegal.com/cases-register-1721.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at pkim@rosenlegal.com or cases@rosenlegal.com.Follow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm or on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm. Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013. Rosen Law Firm has secured hundreds of millions of dollars for investors. Contact Information:Laurence Rosen, Esq. Phillip Kim, Esq. The Rosen Law Firm, P.A. 275 Madison Avenue, 40th Floor New York, NY  10016 Tel: (212) 686-1060 Toll Free: (866) 767-3653 Fax: (212) 202-3827 lrosen@rosenlegal.com pkim@rosenlegal.com cases@rosenlegal.com www.rosenlegal.com View original content to download multimedia:http://www.prnewswire.com/news-releases/ctas-loss-notice-top-ranked-rosen-law-firm-files-securities-class-action-lawsuit-against-cintas-corporation--ctas-300974862.htmlSOURCE  Rosen Law Firm, P.A."
    },
    {
        "title": "HAGENS BERMAN, NATIONAL TRIAL ATTORNEYS, Encourages Cintas Corporation (CTAS) Investors with Significant Losses to Contact Its Attorneys, Securities Fraud Lawsuit Filed",
        "subtitle": "",
        "date": "Dec 12, 2019 9:21PM EST",
        "content": "SAN FRANCISCO, Dec. 12, 2019 /PRNewswire/ -- Hagens Berman urges Cintas Corporation (NASDAQ: CTAS) investors who have suffered significant losses to submit their losses now to learn if they qualify to recover their investment losses.  A securities fraud class action has been filed against the Company and senior executives.Cintas Corporation (CTAS) Securities Class ActionThe complaint alleges that throughout the Class Period Defendants falsely represented that its acquisition of competitor G&K Service would improve Cintas' legacy margins while it was discussing the acquisition to investors, but in truth, Cintas never developed or implemented measures to specifically track Cintas legacy margins.  In addition, the complaint alleges that Cintas repeatedly set low financial projections, only to raise and beat them to artificially increase its share price.  Finally, according to the complaint, Cintas concealed that its Fire Protection Services business had breached the law multiple times, placing the Company's Credit Agreement in jeopardy. On November 13, 2019, Spruce Point Capital published a scathing report about Cintas, accusing Cintas' Fire Protection Services of committing fraud.  Spruce Point further claimed that Cintas was over-estimating expenses, only to roll them back and claim outperformance.On this news, shares of Cintas fell $3.61 per share to close at $255.24 per share on November 13, 2019, damaging investors.If you invested in Cintas between Mar. 6, 2017 and Nov. 13, 2019 (the \"Class Period\") and suffered significant losses, you may qualify to be a lead plaintiff – one who selects and oversees the attorneys prosecuting the case.  Contact Hagens Berman immediately for more information about the case and being a lead plaintiff.\"We're focused on recovering investors' substantial losses, the matters raised in the analyst report, and the extent to which investors may have been misled,\" said Hagens Berman partner Reed Kathrein.If you purchased shares of Cintas and suffered significant losses, click here to discuss your legal rights with Hagens Berman.Whistleblowers: Persons with non-public information regarding Cintas should consider their options to help in the investigation or take advantage of the SEC Whistleblower program.  Under the new program, whistleblowers who provide original information may receive rewards totaling up to 30 percent of any successful recovery made by the SEC.  For more information, call Reed Kathrein at 844-916-0895 or email CTAS@hbsslaw.com.About Hagens BermanHagens Berman is a national law firm with nine offices in eight cities around the country and eighty attorneys.  The firm represents investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.Contact: Reed Kathrein, 844-916-0895 View original content to download multimedia:http://www.prnewswire.com/news-releases/hagens-berman-national-trial-attorneys-encourages-cintas-corporation-ctas-investors-with-significant-losses-to-contact-its-attorneys-securities-fraud-lawsuit-filed-300974445.htmlSOURCE  Hagens Berman Sobol Shapiro LLP"
    },
    {
        "title": "Cintas Corporation Announces Webcast for Second Quarter Fiscal Year 2020 Results",
        "subtitle": "",
        "date": "Dec 10, 2019 10:12AM EST",
        "content": "    CINCINNATI--(BUSINESS WIRE)--\nCintas Corporation (Nasdaq:CTAS) today announced that it will release fiscal year 2020 second quarter results on Tuesday, December 17, 2019, after the market closes. The Company will conduct a conference call to discuss the financial results. A live webcast of the call will be available to individual investors and the public beginning at 5:00 p.m., Eastern Time, on Tuesday, December 17, 2019.\n\nThe webcast will be available at www.Cintas.com. Click on the webcast icon and then follow instructions. For those unable to listen to the live webcast, a replay will be available on the Company's website beginning approximately two hours after the completion of the live call and will remain available for two weeks.\n\nAbout Cintas Corporation:\n\nCintas Corporation helps more than one million businesses of all types and sizes get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, floor care, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191210005708/en/\nQuestions concerning the webcast or conference call should be directed to:\nLeisha Smith\n(513) 972-2688\nsmithle@cintas.com\nSource: Cintas Corporation"
    },
    {
        "title": "ROSEN, A GLOBALLY RECOGNIZED LAW FIRM, Continues to Investigate Securities Claims Against Cintas Corporation - CTAS",
        "subtitle": "",
        "date": "Dec 6, 2019 11:26AM EST",
        "content": "NEW YORK, Dec. 6, 2019 /PRNewswire/ -- Rosen Law Firm, a global investor rights law firm, continues to investigate potential securities claims on behalf of shareholders of Cintas Corporation (NASDAQ: CTAS) resulting from allegations that Cintas may have issued materially misleading business information to the investing public.On November 13, 2019, Spruce Point Management published an investment research report on Cintas. According to the report, which largely relied on information received through FOIA requests, there is evidence that Cintas' Fire Protection Services was charged with fraud and is causing a public safety hazard by having workers conduct fire and safety inspections without proper licenses or permits, and by falsifying inspections. The report also raised potential issues in connection to Cintas' financial guidance following its levered acquisition of G&K Services, Inc. stating:  \"it appears management may have suppressed G&K revenue and misguided expenses\" as part of a \"beat and raise\" scheme.On this news, Cintas stock traded as low as $247.67, or down 4.25%, during intraday trading on November 13, 2019.Rosen Law Firm is preparing a class action lawsuit to recover losses suffered by Cintas investors. If you purchased shares of Cintas please visit the firm's website at http://www.rosenlegal.com/cases-register-1721.html to join the class action. You may also contact Phillip Kim of Rosen Law Firm toll free at 866-767-3653 or via email at pkim@rosenlegal.com or cases@rosenlegal.com.Follow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm or on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm. Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013. Rosen Law Firm has secured hundreds of millions of dollars for investors.Attorney Advertising. Prior results do not guarantee a similar outcome.Contact Information:     Laurence Rosen, Esq.     Phillip Kim, Esq.     The Rosen Law Firm, P.A.     275 Madison Avenue, 40th Floor     New York, NY 10016     Tel: (212) 686-1060     Toll Free: (866) 767-3653     Fax: (212) 202-3827     lrosen@rosenlegal.com     pkim@rosenlegal.com     cases@rosenlegal.com      www.rosenlegal.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/rosen-a-globally-recognized-law-firm-continues-to-investigate-securities-claims-against-cintas-corporation--ctas-300970691.htmlSOURCE  Rosen Law Firm, P.A."
    },
    {
        "title": "HAGENS BERMAN, NATIONAL TRIAL ATTORNEYS, Encourages Cintas Corporation (CTAS) Investors with Losses to Contact Its Attorneys, Firm Investigating Possible Securities Fraud",
        "subtitle": "",
        "date": "Nov 13, 2019 8:18PM EST",
        "content": "SAN FRANCISCO, Nov. 13, 2019 /PRNewswire/ -- Hagens Berman urges Cintas Corporation (NASDAQ: CTAS) investors who have suffered losses to submit their losses now to learn if they qualify to recover their investment losses.  The firm has opened an investigation into Cintas and investors may have valuable claims under the federal securities laws.   Cintas Corporation (CTAS) Investigation:The investigation centers on the accuracy of Cintas' historic financial statements.On November 13, 2019, Spruce Point Capital published a scathing report.  According to Spruce Point, (1) \"[b]ased on a new public FOIA and our research, we believe Cintas' Fire Protection Services business has committed fraud,\" (2) \"[o]ur research indicates that Cintas has a poor reputation, and that new private equity and public money is entering the space, which will compress its growth and margins,\" and (3) \"[e]ven worse, evidence points to Cintas over-estimating expenses, only to roll-them back and claim outperformance.\"This news sent the price of Cintas shares down as much as $11.10 during intraday trading on November 13, 2019.\"We're focused on recovering investors' substantial losses, the matters raised in the analyst report, and the extent to which investors may have been misled,\" said Hagens Berman partner Reed Kathrein.If you purchased shares of Cintas and suffered significant losses, click here to discuss your legal rights with Hagens Berman.Whistleblowers: Persons with non-public information regarding Cintas should consider their options to help in the investigation or take advantage of the SEC Whistleblower program.  Under the new program, whistleblowers who provide original information may receive rewards totaling up to 30 percent of any successful recovery made by the SEC.  For more information, call Reed Kathrein at 510-725-3000 or email CTAS@hbsslaw.com.About Hagens BermanHagens Berman is a national law firm with nine offices in eight cities around the country and eighty attorneys.  The firm represents investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.Contact: Reed Kathrein, 510-725-3000 View original content to download multimedia:http://www.prnewswire.com/news-releases/hagens-berman-national-trial-attorneys-encourages-cintas-corporation-ctas-investors-with-losses-to-contact-its-attorneys-firm-investigating-possible-securities-fraud-300957973.htmlSOURCE  Hagens Berman Sobol Shapiro LLP"
    },
    {
        "title": "Spruce Point Capital Management Releases A Strong Sell Research Opinion On Cintas Corporation (NASDAQ: CTAS)",
        "subtitle": "",
        "date": "Nov 13, 2019 10:15AM EST",
        "content": "NEW YORK, Nov. 13, 2019 /PRNewswire/ -- Report entitled \"Uniformly Bad Business Practices\" outlines how Cintas faces 60-75% downside risk to approximately $69.00 to $107.00 per share when accounting for its weakening fundamentals, aggressive accounting, regulatory and litigation risk related to the fire business, poor governance, and extreme valuation.-  Fundamental Challenges & Growing Signs Of Strain Following G&K Acquisition: Cintas acquired G&K for $2.1 billion in August 2016 after sweetening its offer three times.  Based on industry research and expert discussions, we believe that G&K had a very poor reputation with customers and carried meaningful exposure to the challenged oil, gas and mining sectors.  Despite this, the lofty acquisition was likely necessitated by Cintas' slow underlying growth in its core uniform business and the accounting flexibility that the acquisition would afford.      Despite analysts' praise of Cintas' performance following the acquisition, numerous signs indicate that the core uniform business is under strain.  Cintas' allowance for doubtful accounts, working capital requirements, and DSOs are all rising rapidly to record levels.  Our concerns over a slowdown are further heightened by sluggish inventory growth, new disclosures around discounts and rebates, and a reliance on a poorly-disclosed investment gain.  All of this has occurred while Cintas' leverage – which, we feel, is underappreciated given the magnitude of its foreign-domiciled and other restricted cash – is steadily rising.      In Spruce Point's opinion, the attractive picture painted by Cintas' management has been a product of its ability to spin a consistent \"beat and raise\" story.  However, after adjusting for questionable initial guidance around intangible asset amortization, G&K revenue suppression, and share repurchases, we find that Cintas delivered no outperformance last year relative to initial 2019 guidance.-  Playing With Fire – Instance Of Fraud And An Outstanding Wrongful Death Suit: Recent changes in revenue disclosure reveal for the first time that Cintas' fastest organically-growing business is fire inspection.  Based on our research, this industry faces serious headwinds from a shortage of qualified labor. Cintas has used an \"affiliate network\" to expand its reach, but this approach poses serious hurdles to the challenge of workforce monitoring, putting its quality standards and licensing practices at risk.  Using a recent Freedom of Information Act (FOIA) request, we found that, following an Aurora, IL fire, Cintas was charged with fraudulent business practices after it was determined that 8 of Cintas' 12 inspectors were unlicensed and unfit to carry out inspection duties for the 22 properties within Aurora's jurisdiction.  These inspectors consequently produced falsified inspection records. Based on our research, this may not be an isolated incident. We believe that Cintas may have breached its credit agreement by incorrectly representing that it holds all licenses necessary to conduct its business in compliance with the law. Further, a case is currently being heard in the Southern District of Indiana where a plaintiff is seeking damages against Cintas for the wrongful death of her husband because of purported negligence. In addition to the risks inherent in the business, waves of cash flooding into the industry could disrupt Cintas' national market position.  Fueled by cheap financing and the ability to leverage contractually-mandated inspection revenues, private equity players are creating regional platform acquisition vehicles to seize market share from disgruntled Cintas customers. Further, APi Group, a large national competitor, was recently acquired by a UK SPAC and will soon be listed on the NYSE, giving it broader access to public capital to compete against Cintas.   -  Poor Governance And Extreme Valuation:  Spruce Point has numerous concerns about Cintas' Board of Directors, including a relatively slim level of separation between its Chairman and CEO, relationships which call into question the independence of Board members, dubious compensation practices, and an unusually close relationship between the company and its auditor.  In fact, Cintas has been audited by Ernst & Young since 1968, and its E&Y engagement partner, Craig Andrew Marshall, was also the audit engagement partner at embattled Papa John's International.    Analysts and investors love Cintas for its ability to grow earnings consistently while returning capital through share repurchases and a modest dividend.  As a result, analysts reward Cintas with the highest multiple among its publicly-traded peers in the commercial and safety space. Yet, Cintas' average analyst price target of $255 already implies 1% downside to its current share price of $259, even before taking its underappreciated business headwinds into account.  Analysts fail to critically evaluate each of Cintas' business lines and apply proper multiples to reflect their dissimilar growth and risk profiles.  The company as a whole trades at 4x sales and 18x EBITDA, but, in light of recent industry deals carrying far more modest multiples of 1x-2x sales, none of its individual business lines deserves such a rich valuation. Taken together, Cintas' businesses are fairly-valued at $69 - $107 per share, implying 60% – 75% downside to current levels.Spruce Point Capital has a short position in Cintas Corporation (CTAS) and stands to benefit if its share price falls.About Spruce Point CapitalSpruce Point Capital Management, LLC, is a forensic fundamentally-oriented investment manager that focuses on short-selling, value and special situation investment opportunities.Contact Sean Donohue  Spruce Point Capital Management sean.donohue@sprucepointcap.com 212-519-9813Spruce Point Capital Management, LLC is a member of the Financial Industry Regulatory Authority, CRD number 288248. View original content:http://www.prnewswire.com/news-releases/spruce-point-capital-management-releases-a-strong-sell-research-opinion-on-cintas-corporation-nasdaq-ctas-300957543.htmlSOURCE  Spruce Point Capital Management, LLC"
    },
    {
        "title": "Cintas Corporation Announces Annual Dividend Increased for the 36th Consecutive Year",
        "subtitle": "",
        "date": "Oct 29, 2019 10:21AM EDT",
        "content": "\nAlso Announces Additional $1 Billion Stock Buyback Authorization\n    CINCINNATI--(BUSINESS WIRE)--\nCintas Corporation (Nasdaq: CTAS) announced that the Company’s Board of Directors approved a $2.55 per share annual dividend at its meeting today, representing an increase of 24.4% over last year’s dividend. This is the 36th consecutive year that the annual dividend has increased, which is every year since Cintas’ initial public offering in 1983. This dividend is payable on December 6, 2019 to shareholders of record as of November 8, 2019.\n\nCintas also announced that the Board of Directors approved an additional share buyback program under which the Company may buy up to $1.0 billion of Cintas common stock at market prices. The number of shares to be purchased and the timing will be determined at the discretion of the Board, and purchases may be discontinued at any time.\n\nScott D. Farmer, Cintas’ Chairman and Chief Executive Officer, stated, “We achieved record revenue and net income in our fiscal 2019, and this fiscal year is off to a good start. Given our excellent financial results and strong financial position, we are pleased to announce an increase in the annual dividend. The dividend, accompanied by our share buyback program, continues to demonstrate our commitment to increasing shareholder value.”\n\nAs of October 29, 2019, the Company has $263 million available under its existing share buyback program that was authorized on October 30, 2018. Since the Board authorized that $1 billion program, the Company has purchased 3.5 million shares at an average price of $209.82 for a total of $737 million. This program does not have an expiration date and will continue to be executed at the discretion of the Board.\n\nCollectively, as of October 29, 2019, Cintas has $1.263 billion available under the buyback programs.\n\nAbout Cintas\n\nCintas Corporation helps more than one million businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, floor care, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday™. Headquartered in Cincinnati, Cintas is a publicly held company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and the Nasdaq-100 Index.\n\nForward-Looking Statements\n\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor from civil litigation for forward-looking statements. Forward-looking statements may be identified by words such as “estimates,” “anticipates,” “predicts,” “projects,” “plans,” “expects,” “intends,” “target,” “forecast,” “believes,” “seeks,” “could,” “should,” “may” and “will” or the negative versions thereof and similar words, terms and expressions and by the context in which they are used. Such statements are based upon current expectations of Cintas and speak only as of the date made. You should not place undue reliance on any forward-looking statement. We cannot guarantee that any forward-looking statement will be realized. These statements are subject to various risks, uncertainties, potentially inaccurate assumptions and other factors that could cause actual results to differ from those set forth in or implied by this Press Release. Factors that might cause such a difference include, but are not limited to, risks inherent with the G&K transaction in the achievement of cost synergies and the timing thereof, including whether the transaction will be accretive and within the expected timeframe and the actual amounts of future integration expenses; the possibility of greater than anticipated operating costs including energy and fuel costs; lower sales volumes; loss of customers due to outsourcing trends; the performance and costs of integration of acquisitions, including G&K; fluctuations in costs of materials and labor including increased medical costs; costs and possible effects of union organizing activities; failure to comply with government regulations concerning employment discrimination, employee pay and benefits and employee health and safety; the effect on operations of exchange rate fluctuations, tariffs and other political, economic and regulatory risks; uncertainties regarding any existing or newly-discovered expenses and liabilities related to environmental compliance and remediation; the cost, results and ongoing assessment of internal controls for financial reporting required by the Sarbanes-Oxley Act of 2002; the effect of new accounting pronouncements; costs of our SAP system implementation; disruptions caused by the inaccessibility of computer systems data, including cybersecurity risks; the initiation or outcome of litigation, investigations or other proceedings; higher assumed sourcing or distribution costs of products; the disruption of operations from catastrophic or extraordinary events; the amount and timing of repurchases of our common stock, if any; changes in federal and state tax and labor laws; and the reactions of competitors in terms of price and service. Cintas undertakes no obligation to publicly release any revisions to any forward-looking statements or to otherwise update any forward-looking statements whether as a result of new information or to reflect events, circumstances or any other unanticipated developments arising after the date on which such statements are made. A further list and description of risks, uncertainties and other matters can be found in our Annual Report on Form 10-K for the year ended May 31, 2019 and in our reports on Forms 10-Q and 8-K. The risks and uncertainties described herein are not the only ones we may face. Additional risks and uncertainties presently not known to us, or that we currently believe to be immaterial, may also harm our business.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005723/en/\nJ. Michael Hansen, Executive Vice President and Chief Financial Officer - 513-972-2079\nPaul F. Adler, Vice President and Treasurer - 513-972-4195\nSource: Cintas Corporation"
    },
    {
        "title": "Cintas Launches Nationwide Search for 2020 Everyday Impact® Heroes",
        "subtitle": "",
        "date": "Oct 28, 2019 3:11PM EDT",
        "content": "\nTen workplace heroes will win a celebratory trip to Chicago\n    CHICAGO--(BUSINESS WIRE)--\nDo you know someone who goes above and beyond to create a better customer experience or helps fellow employees and their community? Cintas Corporation (NASDAQ: CTAS) is accepting nominations for its 3rd annual Everyday Impact® Hero program which celebrates individuals who make a real impact with their peers, family or community. Submissions for the 2020 program will be accepted online at www.cintas.com/everyday-impact/ now through December 31st at 5 p.m. CST.\n\n“The Everyday Impact program is a way for us to recognize some of the heroes who go to work every day wearing our apparel,” said Todd McKeown, President and COO of Direct Sale Strategic Markets, Cintas. “Each year our winners inspire us through their selfless acts that have a positive impact on their families, peers and communities. We look forward to this year’s program, and hearing the amazing stories of heroes throughout the workplace.”\n\nThe 2019 program winners included a native of Puerto Rico who raised funds and volunteered for Hurricane Maria recovery, as well as a driver who rescued a 92-year-old man trapped inside a house on fire. As continued recognition for their heroism, several of these winners were also recently featured on the Nasdaq tower in New York, NY.\n\nCintas is accepting submissions from the United States and Canada, excluding Quebec. The Everyday Impact Committee will review the nominations and select the top 10 stories to be featured in the 2020 Design Collective by Cintas catalog. Each hero will also receive:\n\nFor more information about the Everyday Impact Hero program, contact Christina Alvarez at calvarez@mulberrymc.com. For full program rules visit www.cintas.com/everydayimpact.\n\nAbout Cintas: \n\nCintas Corporation helps more than one million businesses of all types and sizes get ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and training and compliance courses, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191028005681/en/\nChristina Alvarez\nMulberry Marketing Communications\n708-908-0898\ncalvarez@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "No Lion, Cintas Crowns Nashville Zoo America’s Best Restroom®",
        "subtitle": "",
        "date": "Oct 22, 2019 10:30AM EDT",
        "content": "\nThe Nashville Zoo will receive $2,500 from Cintas \n    NASHVILLE, Tenn.--(BUSINESS WIRE)--\nThe public was not monkeying around when it came to choosing their favorite restroom. Cintas Corporation (NASDAQ: CTAS) today named Nashville Zoo in Nashville, Tennessee the winner of the 2019 America’s Best Restroom® contest. As this year’s winner, Nashville Zoo will get to properly crown their golden thrones with prizes from Cintas. This includes $2,500 in Cintas products and services for restroom cleaning or facility management to keep their restrooms Ready for the Workday®, along with a lifetime supply of bathroom bragging rights.\n\n“We’re thrilled to earn the title of America’s Best Restroom,” said Rick Schwartz, President and CEO of the Nashville Zoo. “As one of the top tourist attractions in Tennessee, we saw our restrooms as an opportunity to educate visitors and allow their trip to the zoo to continue even during a bathroom break. We wanted our restrooms to create dialogue and conversation, and it worked better than expected.”\n\nInside, the Nashville Zoo restrooms offer more than meets the eye. Nashville Zoo's Expedition Peru: Trek of the Andean Bear women's restroom features a floor-to-ceiling glass window through which a family of six cotton-top tamarins are visible. This extravagant indoor exhibit features these critically endangered primates and all their antics. Meanwhile, Nashville Zoo's Entry Village men's restroom features a floor-to-ceiling glass window with a view of the Boelens Python snake exhibit.\n\n“The Nashville Zoo was able to turn its public restrooms into another attraction, and the public responded in a very positive way,” said Sean Mulcahey, Marketing Manager, Cintas. “Public restrooms meet many needs, so it’s important that they’re not only clean and well-maintained, but also memorable because it can impact the success of your business.”\n\nCintas revealed the 10 contest finalists on August 5th and opened voting to the public through September 13th. The other finalists in the 2019 America’s Best Restroom contest included:\n\nThe 10 finalists were selected based on cleanliness, visual appeal, innovation, functionality and unique design elements. You can nominate a restroom for the 2020 contest here.\n\nFor more information about the contest, please contact Christina Alvarez at calvarez@mulberrymc.com or (708) 908-0898.\n\nAbout Cintas Corporation:\n\nCintas Corporation helps more than one million businesses of all types and sizes get Ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005631/en/\nChristina Alvarez\nMulberry Marketing Communications\n(708) 908-0898\ncalvarez@mulberrymc.com\nSource: Cintas Corporation"
    },
    {
        "title": "Cintas Introduces Germ-X to its Sanitizer Dispenser Line",
        "subtitle": "",
        "date": "Oct 8, 2019 3:56PM EDT",
        "content": "\nOn Global Handwashing Day, Cintas celebrates with…hand sanitizer\n    CINCINNATI--(BUSINESS WIRE)--\nIn honor of Global Handwashing Day, October 15, Cintas Corporation reminds those on the go and without immediate access to soap and water, that hand sanitizer is a viable option. But, not all sanitizers are created equal, which is why Cintas Corporation (NASDAQ: CTAS) has partnered with Germ-X to make the well-known consumer brand sanitizer available in all of its rental sanitizer dispensers.\n\n“Even though handwashing is the most effective way to remove germs on hands, it’s not always practical,” said Christiny Betsch, Marketing Manager, Cintas. “Installing Cintas’ Germ-X filled dispensers in common areas creates a powerful combination to help facility managers maintain a healthy, productive place of business.”\n\nAccording to the Centers for Disease Control and Prevention (CDC), if soap and water are not available, handwashers are to use an alcohol-based hand sanitizer that contains at least 60 percent alcoholi. Studies show that hand sanitizers with at least 60 percent alcohol are more effective at killing germs than those with a lower alcohol concentrationii.\n\nGerm-X Advanced hand sanitizer kills more than 99.9 percent of many common harmful germs and bacteria in as little as 15 seconds. Available through Cintas’ rental service program in both foam and gel formulations, Germ-x’s patented formulations contain 70 percent alcohol and are CHG, latex, vinyl and nitrile glove-compatible. The sanitizer also contains moisturizers to reduce dryness and leave hands soft.\n\nAvailable in multiple dispensers and colors, the Cintas rental sanitizer service will monitor, refill and maintain sanitizer dispensers to meet a facility’s changing needs.\n\nFor more information on ways Cintas can help facilities stay ready™ with convenient, effective hand sanitization, visit https://www.cintas.com/facilityservices/restroom-supplies/hand-sanitizer.aspx.\n\nAbout Cintas Corporation\n\nCintas Corporation helps more than one million businesses of all types and sizes get ready™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and training and compliance courses, Cintas helps customers get Ready for the Workday®. Headquartered in Cincinnati, Cintas is a publicly held Fortune 500 company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.\n\ni https://www.cdc.gov/handwashing/show-me-the-science-hand-sanitizer.html\nii https://www.cdc.gov/handwashing/show-me-the-science-hand-sanitizer.html\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191008005895/en/\nJennifer Petersen\nMulberry Marketing Communications\n312-664-1532\njpetersen@mulberrymc.com\nSource: Cintas Corporation"
    }
]