[
    {
        "title": "Cognizant Schedules Fourth Quarter 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Jan 13, 2020 1:29PM EST",
        "content": "TEANECK, N.J., Jan. 13, 2020 /PRNewswire/ -- Cognizant (Nasdaq: CTSH), a leading provider of information technology, consulting, and business process services, will announce results for the fourth quarter of 2019 on Wednesday, February 5, 2020, after market close.Following the release, Cognizant management will conduct a conference call at 5:00 p.m. (Eastern) to discuss operating performance for the quarter. To participate in the conference call, domestic callers can dial 877-810-9510 and international callers can dial 201-493-6778 and provide the following conference passcode: Cognizant Call.The conference call will also be available live on the Investor Relations section of the Cognizant website at http://investors.cognizant.com.  Please go to the website at least 15 minutes prior to the call to register and to download and install any necessary audio software.For those who cannot access the live broadcast, a replay will be available by dialing (877) 660-6853 for domestic callers or (201) 612-7415 for international callers and entering 13695115 from two hours after the end of the call until Wednesday, February 19, 2020. The replay will also be available at Cognizant's website http://investors.cognizant.com for 60 days following the call.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us on Twitter: Cognizant.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-schedules-fourth-quarter-2019-earnings-release-and-conference-call-300985877.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Named An AWS Outposts Partner",
        "subtitle": "Integrates Cloud and On-Premises Workloads for Improved Infrastructure Management, Agility, and Cost Savings",
        "date": "Dec 3, 2019 4:00PM EST",
        "content": "TEANECK, N.J., Dec. 3, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) announced today that it has capabilities to support AWS Outposts, fully managed and configurable compute and storage racks - built with Amazon Web Services (AWS)-designed hardware - that allow customers to run compute and storage on-premises, while seamlessly connecting to AWS's broad array of services in the cloud. As an AWS Outposts Partner, Cognizant experts have been trained and vetted in re-architecting complex workloads to run on AWS operations to deliver positive customer outcomes at scale. Cognizant will also work with clients to re-architect complex enterprise IT workloads to modernize and support their on-premises and cloud-based infrastructures. Cognizant is a Premier Consulting Partner in the AWS Partner Network (APN) that has achieved AWS Migration Competency status, with more than 4,500 certified AWS professionals and more than 300 customers globally, as part of a relationship that began in 2008. Cognizant's implementation of AWS Outposts for clients provides: \"Cognizant is excited to extend our long-standing relationship with AWS to offer AWS Outposts to our clients.  This service line will help clients to experience AWS native features on-premises, enabling them to build and run modern and secure digital platforms,\" said Raja Renganathan, Vice President - AWS Global Business, Cognizant. \"Our team of certified professionals is dedicated to helping companies accelerate modernization, fuel innovation, scale business services, and improve operational agility with AWS. AWS Outposts combines cloud economics with integrated management of a hybrid infrastructures to modernize IT workloads faster, drive efficiencies, and unlock new business opportunities.\" Learn More About Cognizant AWS Services and Solutions:https://www.cognizant.com/cognizant-digital-systems-technology/cloud-enablement-services/aws-cloud About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com  or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-named-an-aws-outposts-partner-300968592.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Named an AI Consultancy Leader in Asia Pacific by Independent Research Firm",
        "subtitle": "",
        "date": "Nov 20, 2019 12:01AM EST",
        "content": "SINGAPORE, Nov. 20, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) is recognized as an Artificial Intelligence (AI) Consultancies leader in the Asia Pacific (AP) region by Forrester Research, a leading global research and advisory firm. The Forrester Wave™: AI Consultancies In Asia Pacific, Q3 2019 report reviews the capabilities of 10 service providers on 24 criteria covering their current offering, strategy, and market presence.Cognizant received the highest rating possible in the data, data science and analytics, partner ecosystem, past performance, and deal size criteria.  The report also noted that: \"Consultancies with distinct strengths in data science and analytics, data engineering, and business domain expertise position themselves to successfully deliver positive AI business impact to their customers,\" wrote Achim Granzen of Forrester in the report. \"While many vendors have developed strong local practices or deep business expertise in selected domains and industries, very few provide consistent breadth and depth across all sub-regions, industries, and domains in AP…Organizations embarking upon their AI journey or expanding their use of AI should look for AI consultancies that excel in data science, analytics, and data engineering…marry business expertise and AI technology chops…[and] have a strong regional and local presence.\" \"As AI begins to dictate both the future and future-readiness of businesses in Asia Pacific, they are looking for a partner that can deliver end-to-end intelligence to solve complex business problems, facilitate decision-making, improve business processes, enhance user engagement, reduce costs, and drive growth and profitability,\" said Jayajyoti Sengupta, Head of Asia-Pacific and Japan, Cognizant. He added, \"Wherever these businesses are on their AI journey — ideas, iteration, piloting, data migration, or system implementation and expansion — and whatever their goals are — enhancing applications, workflows or processes, stitching together experiences, or exploring new channels of revenue and service, Cognizant is delivering thoughtful and human-centered ways to accelerate not just time-to-market, but also time-to-value and time-to-answers. We believe being named a leader in AI Consultancy in AP by Forrester is a testament to our capabilities and commitment to helping businesses augment what they and their employees, customers and partners can accomplish with intelligent machines.\"Cognizant's applied AI approach revolves around augmenting and enhancing, rather than automating and replacing, human experiences. The \"intelligence\" in Cognizant AI solutions is designed to perceive and behave in familiar ways, while the \"artificial\" provides scale and repeatability not otherwise possible. For example, a utility client uses a Cognizant-developed artificial intelligence solution to automatically scan drone-taken images of its power distribution network to dramatically reduce the cost of identifying equipment problems and repairs, while also preemptively alerting maintenance teams.Learn More:About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant.Logo - https://mma.prnewswire.com/media/722966/Cognizant_Logo_Logo.jpg "
    },
    {
        "title": "Cognizant Named an AI Consultancy Leader in Asia Pacific by Independent Research Firm",
        "subtitle": "",
        "date": "Nov 20, 2019 12:01AM EST",
        "content": "SINGAPORE, Nov. 20, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) is recognized as an Artificial Intelligence (AI) Consultancies leader in the Asia Pacific (AP) region by Forrester Research, a leading global research and advisory firm. The Forrester Wave™: AI Consultancies In Asia Pacific, Q3 2019 report reviews the capabilities of 10 service providers on 24 criteria covering their current offering, strategy, and market presence.Cognizant received the highest rating possible in the data, data science and analytics, partner ecosystem, past performance, and deal size criteria.  The report also noted that: \"Consultancies with distinct strengths in data science and analytics, data engineering, and business domain expertise position themselves to successfully deliver positive AI business impact to their customers,\" wrote Achim Granzen of Forrester in the report. \"While many vendors have developed strong local practices or deep business expertise in selected domains and industries, very few provide consistent breadth and depth across all sub-regions, industries, and domains in AP…Organizations embarking upon their AI journey or expanding their use of AI should look for AI consultancies that excel in data science, analytics, and data engineering…marry business expertise and AI technology chops…[and] have a strong regional and local presence.\" \"As AI begins to dictate both the future and future-readiness of businesses in Asia Pacific, they are looking for a partner that can deliver end-to-end intelligence to solve complex business problems, facilitate decision-making, improve business processes, enhance user engagement, reduce costs, and drive growth and profitability,\" said Jayajyoti Sengupta, Head of Asia-Pacific and Japan, Cognizant. He added, \"Wherever these businesses are on their AI journey — ideas, iteration, piloting, data migration, or system implementation and expansion — and whatever their goals are — enhancing applications, workflows or processes, stitching together experiences, or exploring new channels of revenue and service, Cognizant is delivering thoughtful and human-centered ways to accelerate not just time-to-market, but also time-to-value and time-to-answers. We believe being named a leader in AI Consultancy in AP by Forrester is a testament to our capabilities and commitment to helping businesses augment what they and their employees, customers and partners can accomplish with intelligent machines.\"Cognizant's applied AI approach revolves around augmenting and enhancing, rather than automating and replacing, human experiences. The \"intelligence\" in Cognizant AI solutions is designed to perceive and behave in familiar ways, while the \"artificial\" provides scale and repeatability not otherwise possible. For example, a utility client uses a Cognizant-developed artificial intelligence solution to automatically scan drone-taken images of its power distribution network to dramatically reduce the cost of identifying equipment problems and repairs, while also preemptively alerting maintenance teams.Learn More:About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant.Logo - https://mma.prnewswire.com/media/722966/Cognizant_Logo_Logo.jpg SOURCE  Cognizant"
    },
    {
        "title": "New Report Names Cognizant a Leader in Software Product Engineering",
        "subtitle": "Everest Group PEAK Matrix(TM) Positions Cognizant in Top Category for Digital Engineering Practice and Solutions that Enable Greater Agility and Automation",
        "date": "Nov 14, 2019 6:00AM EST",
        "content": "TEANECK, N.J., Nov. 14, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) has been named a Software Product Engineering Services Leader in the new Everest Group report: Software Product Engineering Services PEAK Matrix™ Assessment 2019: Engineering for the Digital World.  Everest Group assessed 25 service providers, evaluating them on capabilities including market adoption, portfolio, value, services, strategy, innovation and investments.  Cognizant has more than 14,000 product, design and engineering professionals around the world helping clients develop new products and experiences, transform legacy applications, and modernize their core infrastructure. In 2018, Cognizant acquired software product engineering leader, Softvision, forming a digital engineering division, Cognizant Softvision that creates impactful end-to-end digital products and solutions that connect brands with customers. For a major communications and technology infrastructure client, Cognizant managed their application modernization project and migration to the cloud. The new environment reduced costs by a projected $13 million a year, provided an almost 10-times improvement in efficiency with the time required to deploy a change to a virtual machine reduced from about eight hours to on-demand.In the new Everest Group report, Cognizant is named as a Leader for its: \"Now more than ever, software is playing an increasingly important role in helping enterprises bring innovation across products and services. It is enabling enterprises to deliver a superior user experience as well as introduce new and intelligent products to the market,\" said Akshat Vaid, Vice President, Everest Group. \"Cognizant's holistic investments across talent, solutions, ecosystem partnerships, and acquisitions in areas such as IoT and customer experience have enabled it to deliver value to its customers as well as emerge as a key player in this highly competitive market.\" \"Cognizant's digital engineering experts build some of the most engaging software products for the world's leading companies,\" said Malcolm Frank, President, Cognizant Digital Business.  \"Bringing our customer experience expertise together with innovations in machine learning, artificial intelligence, cloud and Internet of Things transforms how companies conceive, develop and realize business outcomes through software.\" Learn More: To view the Everest Group report: Software Product Engineering Services PEAK Matrix™ Assessment 2019: Engineering for the Digital World, visit: https://www.cognizant.com/Resources/software-product-engineering-services-peak-matrix-assessment-2019.pdf Cognizant Digital Engineering: https://www.cognizant.com/cognizant-digital-business/digital-engineeringCognizant Digital Business: https://www.cognizant.com/cognizant-digital-businessAbout CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/new-report-names-cognizant-a-leader-in-software-product-engineering-300957971.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant to Present at the RBC 2019 TIMT Conference",
        "subtitle": "",
        "date": "Nov 5, 2019 12:18PM EST",
        "content": "TEANECK, N.J., Nov. 5, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH), a leading provider of information technology, consulting, and business process services, today announced a presentation at the following investor conference:RBC 2019 TIMT ConferenceLive audio webcasts of the presentations will be available at Cognizant's website:  http://investors.cognizant.comA replay of the webcasts will remain available on the company's website for 90 days.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant. View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-to-present-at-the-rbc-2019-timt-conference-300952003.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Named an RPA Services Leader by Independent Research Firm",
        "subtitle": "Report Cites Cognizant as the RPA Turnaround Specialist",
        "date": "Oct 24, 2019 6:00AM EDT",
        "content": "TEANECK, N.J., Oct. 24, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) is recognized as a Robotic Process Automation (RPA) services leader in a new report on the rapidly evolving market by Forrester Research, a leading global research and advisory firm.  RPA uses software 'bots' to automate repetitive, time-consuming manual processes, freeing staff for higher value work and has quickly become an essential element of digital transformation strategies. The Forrester Wave™: Robotic Process Automation Services, Q4 2019 report evaluates the automation capabilities of 13 service providers on 22 criteria, including current offering, strategy and market presence. In the new Forrester report, Cognizant received the highest possible ratings in the customer and business outcomes, partner ecosystem, and commercial model criteria. In Cognizant's vendor profile, the report states: According to the report, \"The market for RPA products and services is evolving furiously…Automation leaders cite process identification and assessment, organizational challenges, and the inability to set up the right processes around governance, control, and management of bots as the top challenges to attaining value and scale. As a result of these trends, RPA services buyers should look for providers that have operational experience stabilizing and scaling RPA deployments [and] that can bring the broader automation ecosystem to bear.\"\"The diverse and innovative use of RPA allows clients to tap into benefits almost impossible to achieve manually – from real-time customer engagement to straight-through processing,\" said Ganesh Ayyar, President, Cognizant Digital Operations. \"Our expertise in deploying and managing software bots allows us to take clients from task-level solutions to enterprise wide automation. As smart technology becomes a bigger part of everyday life, we're pleased to be recognized by Forrester as a leader in this evaluation, which we believe demonstrates how we are helping clients realize the cost savings and business benefits derived from RPA.\"Offering a range of industry-specific RPA, Cognizant solutions make client processes smarter, more efficient and effective. For a major banking and financial services client, a Cognizant-developed RPA solution streamlined inefficient mortgage servicing processes. With RPA, the client reduced average handling time by more than 97% and realized a 60% increase in loan processing capacity among other benefits. Clients in other industries including healthcare, life sciences, insurance and others have also worked with Cognizant to improve efficiency, services and lower costs.Learn More:The Forrester Wave Report: https://reprints.forrester.com/#/assets/2/346/RES146255/reports Cognizant IPA Solutions: https://www.cognizant.com/cognizant-digital-operations/intelligent-process-automation Cognizant Digital Operations: https://www.cognizant.com/cognizant-digital-operationsAbout CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-named-an-rpa-services-leader-by-independent-research-firm-300944371.htmlSOURCE  Cognizant"
    },
    {
        "title": "SHAREHOLDER ALERT: Purcell Julie & Lefkowitz LLP Is Investigating Cognizant Technology Solutions Corporation for Potential Breaches of Fiduciary Duty By Its Board of Directors",
        "subtitle": "",
        "date": "Oct 23, 2019 1:57PM EDT",
        "content": "NEW YORK, Oct. 23, 2019 /PRNewswire/ -- Purcell Julie & Lefkowitz LLP, a class action law firm dedicated to representing shareholders nationwide, is investigating a potential breach of fiduciary duty claim involving the board of directors of Cognizant Technology Solutions Corporation (NASDAQ: CTSH). If you are a shareholder of Cognizant Technology Solutions Corporation and are interested in obtaining additional information regarding this investigation, free of charge, please visit us at:http://pjlfirm.com/cognizant-technology-solutions-corporation/ You may also contact Robert H. Lefkowitz, Esq. either via email at rl@pjlfirm.com or by telephone at 212-725-1000.  One of our attorneys will personally speak with you about the case at no cost or obligation. Purcell Julie & Lefkowitz LLP is a law firm exclusively committed to representing shareholders nationwide who are victims of securities fraud, breaches of fiduciary duty and other types of corporate misconduct. For more information about the firm and its attorneys, please visit http://pjlfirm.com.  Attorney advertising. Prior results do not guarantee a similar outcome.   View original content:http://www.prnewswire.com/news-releases/shareholder-alert-purcell-julie--lefkowitz-llp-is-investigating-cognizant-technology-solutions-corporation-for-potential-breaches-of-fiduciary-duty-by-its-board-of-directors-300944187.htmlSOURCE  Purcell Julie & Lefkowitz LLP"
    },
    {
        "title": "Cognizant Positioned as a Leader in Life Sciences Digital Services for Second Year in a Row",
        "subtitle": "New Everest Group PEAK Matrix Analysis Recognizes Cognizant's Vision for an Evolving Industry, Digital Offerings and Market Impact",
        "date": "Oct 22, 2019 6:05AM EDT",
        "content": " TEANECK, N.J., Oct. 22, 2019 /PRNewswire/ -- For a second straight year, Cognizant (Nasdaq: CTSH) has been named a top provider of digital services for life sciences organizations by Everest Group. The consulting and research firm's new Life Sciences Digital Services PEAK Matrix™ Assessment 2019 reviews 23 global service providers and highlights Cognizant's well-defined vision of helping pharmaceutical and other companies digitally transform to improve productivity, enhance drug safety and ensure regulatory compliance.Cognizant works with all of the top 30 global pharmaceutical companies, 9 of the top 10 biotech companies and 12 of the top 15 medical device companies helping them implement cloud, artificial intelligence (AI), automation, internet of things (IoT) and other technologies across their value chains. For one life sciences company, Cognizant implemented a robotic process automation (RPA) solution to replace repetitive manual activities related to an increasing volume of individual case safety reports.  The Cognizant solution was implemented in just seven months, reduced cycle time by 30% and achieved 99% first-time accuracy, among other benefits.The new Everest Group report evaluates digital services providers on their proprietary solutions, key investments and technological expertise along with various other market trends and business offerings. Cognizant received top marks for its sustained client engagement, ability to economically optimize client operations and its investments in the sector. Among them is the recent acquisition of Zenith Technologies, which boosted Cognizant's capabilities to design, implement and manage IT systems for connected biopharmaceutical and medical device manufacturers.\"The market size for life sciences digital services is estimated to grow at a rate of 15 to 20 percent through 2021 in North America, with other areas of the world growing at an even faster rate,\" said Abhishek Singh, Vice President, Everest Group. \"Companies like Cognizant, who provide the digital expertise and operational resilience to life sciences clients, will remain at the forefront of this evolving industry, paving the way for companies to meet the evolving needs of their customers and stay ahead of growing competition.\"\"The ability to leverage digital technologies, such as AI, automation, machine learning and the IoT within the life sciences industry continues to create new opportunities for Cognizant, our clients and most importantly to improve health outcomes of patients,\" said Srinivas Shankar, Vice President and Global Head of Life Sciences, Cognizant. \"Everest Group's analysis and recognition of Cognizant's life sciences investments and client solutions speaks to our important role in designing and implementing technologies that bring innovative drugs to market faster at a lower cost.\"To view an extract of the Everest Group PEAK Matrix Report, visit: https://www.cognizant.com/Resources/everest-group-peak-matix-for-life-sciences-digital-service-providers-2019.pdfLearn more about Cognizant Life Sciences Technology Solutions: https://www.cognizant.com/life-sciences-technology-solutions About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-positioned-as-a-leader-in-life-sciences-digital-services-for-second-year-in-a-row-300942258.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant to Acquire Contino, a Premier Enterprise DevOps and Cloud Transformation Consultancy",
        "subtitle": "Acquisition augments digital engineering and core modernization capabilities, deepening cloud-native architecture expertise in key geographies",
        "date": "Oct 16, 2019 7:00AM EDT",
        "content": "TEANECK, N.J., Oct. 16, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) today announced it has entered into an agreement to acquire Contino, a privately-held technology consulting firm. Contino specializes in helping Global 2,000 clients accelerate their digital transformation by leveraging enterprise DevOps methodologies, a cloud-native development approach, and advanced data platforms. Headquartered in London, Contino has approximately 350 employees worldwide with operations in the United Kingdom, the United States and Australia. Contino's five main areas of expertise are: Recognized as a global premier partner with Amazon Web Services, as well as for deep expertise in Microsoft Azure and Google Cloud Platform, Contino's consulting and engineering teams have completed more than 200 enterprise engagements since 2014. Clients have included more than 100 of the world's leading brands such as Adidas, Allianz, Barclays, Dow Jones, JetStar, Lloyds Bank, Morgan Stanley, National Australia Bank, and Vodafone, among others. Contino was co-founded by Matt Farmer and Benjamin Wootton, who serve as chief executive officer and chief technology officer, respectively. Contino was recognized in 2018 and 2019 as a \"LinkedIn Top Startup\" in the UK.\"Joining Cognizant enables us to expand and scale our offerings globally, build on our tremendous success, and provide an even richer portfolio of cloud strategy and engineering capabilities,\" said Matt Farmer, co-founder and CEO of Contino. \"We are thrilled to be joining an organization that shares our rich expertise in cloud technologies, DevOps, digital engineering, and data analytics. Our focus has always been on supporting the enterprise and their transformation using the 'Squad Model.' With this approach, we support our enterprise clients at every step, from engineering through to communicating the benefits of their journey, all for ultimate success.\" \"We look forward to welcoming Contino's talented team to Cognizant,\" said Brian Humphries, CEO of Cognizant. \"The DevOps approach to cloud migration, core modernization and cloud security is reshaping how enterprises in all industries are building their infrastructures. This new set of holistic cloud capabilities from Contino will enable us to offer and more readily deploy transformative cloud-based solutions.\"The transaction is expected to close in the fourth quarter of 2019, subject to satisfaction of closing conditions, including regulatory approvals. Financial details were not disclosed. Learn MoreAbout ContinoContino is an Enterprise DevOps and Cloud Transformation Consultancy. We specialize in helping highly-regulated enterprises transform their way of working, and accelerate the adoption of cloud-native technologies as a platform for innovation. We're experienced and referenceable experts in transforming people, process and technology together to enable the rapid digital transformation that success demands in today's accelerating marketplace. We've worked on over 200 enterprise engagements with over 100 of the world's leading brands, so we fully understand the challenges you face.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @CognizantForward-Looking StatementsThis press release includes statements which may constitute forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, the accuracy of which are necessarily subject to risks, uncertainties, and assumptions as to future events that may not prove to be accurate. These statements include, but are not limited to, express or implied forward-looking statements relating to expectations regarding the anticipated closing of the acquisition of Contino and the impact of the acquisition of Contino on the business and prospects of Cognizant and Contino. These statements are neither promises nor guarantees, but are subject to a variety of risks and uncertainties, many of which are beyond our control, which could cause actual results to differ materially from those contemplated in these forward-looking statements. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. Factors that could cause actual results to differ materially from those expressed or implied include general economic conditions, changes in the regulatory environment, including with respect to immigration and taxes, and the other factors discussed in our most recent Annual Report on Form 10-K and other filings with the Securities and Exchange Commission. Cognizant undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise, except as may be required under applicable securities law. View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-to-acquire-contino-a-premier-enterprise-devops-and-cloud-transformation-consultancy-300939109.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Named a Digital Workplace Services Leader in New Industry Report",
        "subtitle": "Everest Group PEAK Matrix Report Features Cognizant in Top Category for its Digital Workplace Experience Strategy",
        "date": "Oct 10, 2019 6:00AM EDT",
        "content": "TEANECK, N.J., Oct. 10, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) has been named a Leader and Star Performer in the Everest Group report: Digital Workplace Services PEAK Matrix™ Assessment 2019: Enterprises, It is Time to Humanize the Workplace Experience. The firm assessed the capabilities of 21 service providers in the report. Cognizant's Digital Workplace Services solution, WorkNEXT, encompasses a range of cloud, automation, analytics and personalization technologies that enable a workforce to securely and productively work from anywhere, anytime. The services include cognitive virtual assistants, augmented knowledge discovery, and experience analytics to automate tasks, improve productivity and enhance experiences using devices such as tablets and smartphones as extensions of office workstations. In the new report, Cognizant is recognized as a global leader for its vision and strategy, innovation and investments, and its delivery of services to personalize and enhance the employee experience. Everest Group highlights Cognizant's partnerships in key areas such as virtualization, analytics and AI and its strong thought leadership compared to peers based on multiple client engagements where organizations boosted business productivity by empowering employees to work remotely with secured and seamless access to resources. \"Cognizant's Digital Workplace Services portfolio is geared towards enabling client organizations to transform Employee Experience (EX) and establish a digital-native, personalized, and intuitive workplace,\" said Ashwin Venkatesan, Vice President, Cloud and Infrastructure Services at Everest Group. \"In addition to having credible thought leadership in this space, clients have highlighted Cognizant's responsiveness and willingness to showcase value addition through upfront investments within engagements as key strengths.\"\"The workplace, no matter the industry, is undergoing dramatic changes driven by disruptive business models, technology innovation, cost cutting, a push for increased productivity and better user experiences,\" said Vinod Kumar, Vice President, Cloud and Infrastructure Services, Cognizant. \"Cognizant has the extensive expertise and solutions for the personalization and consumerization of the workplace. This traditionally required a very complex and expensive IT environment. Our WorkNEXT solution addresses these challenges and has proven to reduce costs, minimize complexity, efficiently manage growth and takes less time to implement. Being named a Digital Workplace Services Leader and a Star Performer by Everest Group is a testament to Cognizant's experience and commitment to helping clients enhance business productivity and provide freedom of choice for employees to work.\" Learn More: Cognizant Digital Workplace Services: https://www.cognizant.com/cognizant-digital-systems-technology/cognizant-infrastructure-services/digital-workplace-servicesCognizant Digital Systems and Technology: https://www.cognizant.com/cognizant-digital-systems-technologyTo view customized version Everest Group's PEAK Matrix Report, visit: https://www.cognizant.com/Resources/everest-group-peak-matrix-for-digital-workplace-services-focus-on-cognizant.pdfAbout CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant. View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-named-a-digital-workplace-services-leader-in-new-industry-report-300934914.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Schedules Third Quarter 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Oct 2, 2019 1:44PM EDT",
        "content": "TEANECK, N.J., Oct. 2, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH), a leading provider of information technology, consulting, and business process services, will announce results for the third quarter of 2019 on Wednesday, October 30, 2019, after market close.Following the release, Cognizant management will conduct a conference call at 5:00 p.m. (Eastern) to discuss operating performance for the quarter. To participate in the conference call, domestic callers can dial 877-810-9510 and international callers can dial 201-493-6778 and provide the following conference passcode: Cognizant Call.The conference call will also be available live on the Investor Relations section of the Cognizant website at http://investors.cognizant.com.  Please go to the website at least 15 minutes prior to the call to register and to download and install any necessary audio software.For those who cannot access the live broadcast, a replay will be available by dialing (877) 660-6853 for domestic callers or (201) 612-7415 for international callers and entering 13695115 from two hours after the end of the call until Wednesday, November 13, 2019. The replay will also be available at Cognizant's website http://investors.cognizant.com for 60 days following the call.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us on Twitter: Cognizant.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-schedules-third-quarter-2019-earnings-release-and-conference-call-300929953.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Named an AI Consultancy Leader by Independent Research Firm",
        "subtitle": "",
        "date": "Sep 25, 2019 6:00AM EDT",
        "content": "TEANECK, N.J., Sept. 25, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) is recognized as an Artificial Intelligence (AI) services leader in the newest report on the space by Forrester Research, a leading global research and advisory firm.  The Forrester Wave™: AI Consultancies, Q3 2019 report reviews the capabilities of 13 service providers on 23 criteria, including their current offering, strategy and market presence.Cognizant received the highest rating possible in the technology, deployment, and innovation roadmap criteria.  The report also noted that: \"[AI] is a system designed to bring human-like intelligence to decisions and perform sophisticated and complex actions that past technology could not perform,\" wrote Michele Goetz, Forrester. \"To develop AI capabilities, firms need to take into account the head and body of the system when building their robots. This is no small task, as it requires a different approach to strategy, operations, culture, technology, analytics, and data than enterprises have taken in the past when investing in applications, databases, analytics, infrastructure, and talent.  As a result of these trends, AI Consultancy customers should look for providers that have made the leap and differentiate analytics to AI… address the entire AI system from design to production… [and] are a leader and innovator of business and AI.\" \"Businesses worldwide are now incorporating AI into their infrastructures to enhance customer experiences, and improve organizational agility, speed and productivity,\" said Malcolm Frank, President, Cognizant Digital Business.  \"Cognizant has made significant investments in both expertise and technology to become the strategic AI consultancy of choice for our clients.  Our unique capabilities allow clients to garner the right intelligence from their data to make more impactful business decisions that improve the bottom line, streamline processes, and gain more meaningful market and customer insights.  We believe being named a leader in AI Consultancy by Forrester is a testament to our commitment to our work with clients to deploy intelligent machines that augment their workforces.\"  Learn More:The Forrester Wave Report: https://www.cognizant.com/ai/gated-forrester Cognizant Artificial Intelligence: https://www.cognizant.com/ai/Cognizant Center for the Future of Work Report - The Symbiosis of Humans and Machines: Planning for Our AI-Augmented Future: https://www.cognizant.com/futureofwork/whitepaper/the-symbiosis-of-humans-and-machines-planning-for-our-ai-augmented-futureAbout CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-named-an-ai-consultancy-leader-by-independent-research-firm-300924646.htmlSOURCE  Cognizant"
    },
    {
        "title": "New Cognizant AI Insurance Claims Platform Enhances Processing, Accuracy and Customer Service Following Natural Disasters",
        "subtitle": "'Property Insights' Software Uses Machine Learning to Reduce Adjustment Costs and Expedite Payment for Damage Caused by Hurricanes and Other Catastrophic Events",
        "date": "Sep 24, 2019 6:00AM EDT",
        "content": "TEANECK, N.J., Sept. 24, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) today unveiled a new artificial intelligence-powered software platform that gives property insurers the ability to process large numbers of claims stemming from natural disasters or other catastrophic events in record time. Cognizant Property Insights is a software-as-a-service solution that combines satellite and aerial imagery and property data, with machine learning technologies to quickly assess damage caused by hurricanes, tornados, floods, wildfires and other disasters in just four to five days, significantly speeding payment of customer claims. Applying AI to before-and-after imagery in conjunction with location data provided by partner and global technology company Pitney Bowes ensures rapid, accurate damage assessments and expedited claims payment, while reducing handling expenses per claim to insurers by half compared to traditional processing. Insurers in several hurricane prone states, including Texas, Florida, New York, and Massachusetts, have beta tested the solution for the past several months. One such company, Velocity Risk Underwriters, LLC, is using these AI capabilities to reshape its future of claims processing.\"For homeowners who have experienced property damage following a natural disaster, it is especially difficult waiting for insurance claims to be settled given all of the other stress that goes along with such an experience,\" says Rod Harden, Chief Claims Officer from Velocity Risk Underwriters. \"After a hurricane, for example, it can take up to 30 days or more just to provide an assessment of property damage, and that's if the property location is accessible to field adjusters. Cognizant Property Insights automates much of the manual work involved, helping to make adjusters more efficient in their assessments. AI will transform how we do business and serve customers quickly and efficiently.\" \"Property insurance is a data driven business – whether it is helping insurers assess risk or using AI and machine learning to improve service and accuracy,\" said Shannon McWilliams, Senior Vice President, Global Software and Data Channels of Pitney Bowes. \"Our data sets integrated into Cognizant Property Insights are among the most authoritative in the industry and provide insurers with the confidence to quickly make decisions that help impacted customers get back on their feet.\"\"Leveraging AI when disasters strike can play a significant role in helping insurers with claims intake, self-adjudication and fraud detection,\" said Michael Clifton, Senior Vice President, Insurance Global Strategy and Venture Leader, Cognizant. \"We work with all of the major underwriters and understand the challenges they face as well as the opportunities that digital technologies provide. Cognizant Property Insights is a new tool that protects claims adjusters from dangerous field conditions, offers a highly competitive industry a new way to evolve their processes for better service and enables homeowners and others in impacted communities to get their claims processed faster for quicker recovery.\"Cognizant Property Insights will be showcased at InsureTech Connect 2019 in the Cognizant booth at the MGM Grand, Las Vegas, NV, along with all of Cognizant's digital insurance offerings.Learn More: Cognizant Property Insights: https://www.cognizant.com/property-insights-damage-estimate-softwareCognizant Insurance: https://www.cognizant.com/insurance-technology-solutionsAbout CognizantCognizant (Nasdaq: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/new-cognizant-ai-insurance-claims-platform-enhances-processing-accuracy-and-customer-service-following-natural-disasters-300923455.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant to Present at the Citi 2019 Global Technology Conference",
        "subtitle": "",
        "date": "Aug 28, 2019 3:20PM EDT",
        "content": "TEANECK, N.J., Aug. 28, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH), a leading provider of information technology, consulting, and business process services, today announced a presentation at the following investor conference:Citi 2019 Global Technology ConferenceLive audio webcasts of the presentations will be available at Cognizant's website:  http://investors.cognizant.comA replay of the webcasts will remain available on the company's website for 90 days.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant. View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-to-present-at-the-citi-2019-global-technology-conference-300908688.htmlSOURCE  Cognizant"
    },
    {
        "title": "MG Motor India Teams with Cognizant to Create Omnichannel Digital Customer Experience for India's First 'Connected Internet Car'",
        "subtitle": "",
        "date": "Aug 20, 2019 6:00AM EDT",
        "content": " TEANECK, N.J. and NEW DELHI, India, Aug. 20, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) today announced that it has designed and implemented a digital solution enabling MG Motor India to deliver a seamless and intuitive brand experience to customers of the Hector SUV – the country's first 'connected internet car'.  The next-generation customer experience and enterprise management solution forms the backbone of MG Motor's integrated marketing and customer engagement program across multiple channels and touchpoints.  Cognizant's industry, experience design, analytics and enterprise architecture experts developed the hyper-personalized digital channels with Adobe Experience Cloud.  It enables a consistent, high-quality experience for current as well as prospective customers as they interact with MG Motor India representatives throughout the pre-sales, sales and post-sales lifecycles. Cognizant also designed and developed an enterprise planning and management platform, based on SAP technology, which optimizes key enterprise processes including production, sales, distribution, materials/warehouse management, and finance for better operational efficiency and agility.The digital solution has enabled MG Motor India to extend its feature-rich, in-car connected vehicle experience to all phases of a customer's brand experience ― from consideration, evaluation, purchase to use. A data driven approach enables better customer and operational insights to provide information, experiences and services tailored to specific customer needs.\"As a brand, it has been our endeavor to look at new and innovative ways to excite our customers with experiences that truly stand out. In line with this vision, we are determined to create a customer experience outside the car that matches the deeply personal experience inside and while driving the car. We are pleased to partner with a digital technology leader like Cognizant to help us achieve this vision,\" said Gaurav Gupta, Chief Commercial Officer, MG Motor India.\"Today's digital native car buyers and drivers demand highly personalized and deeply engaging experiences,\" said Jayajyoti Sengupta, Head of Asia-Pacific and Japan, Cognizant. \"In the competitive automobile industry, companies are harnessing cutting-edge digital technologies to better integrate front and back office processes and deliver meaningful experiences to their customers, while also gaining operational efficiencies that help increase speed-to-market. We are very pleased to be a part of MG Motor's maiden car launch in the Indian market. By offering hyper-personalization and a unique brand experience, MG Motor is setting a new standard in integrated customer experience.\"In April 2019, Cognizant was named Adobe India's Digital Experience Partner of the Year for its work on the MG Motor launch.Learn More:Cognizant Digital BusinessCognizant Digital Systems and Technology About MG Motor IndiaFounded in the UK in 1924, Morris Garages vehicles were world famous for their sports cars, roadsters, and cabriolet series. MG vehicles were much sought after by many celebrities, including the British Prime Ministers and even the British Royal Family, for their styling, elegance, and spirited performance. The MG Car Club, set up in 1930 at Abingdon in the UK, has more than a million loyal fans, making it by far one of the world's largest clubs for a car brand. MG has evolved into a modern, futuristic and innovative brand over the last 95 years. With the introduction of its brand of vehicles in the Indian market, MG Motor India has commenced its manufacturing operations at its car manufacturing plant at Halol in Gujarat. For more information, please visit: MG Motor IndiaAbout Cognizant Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant. View original content to download multimedia:http://www.prnewswire.com/news-releases/mg-motor-india-teams-with-cognizant-to-create-omnichannel-digital-customer-experience-for-indias-first-connected-internet-car-300903765.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Named a Leader in Application Modernization and Migration Services Report by Independent Research Firm",
        "subtitle": "",
        "date": "Aug 14, 2019 6:00AM EDT",
        "content": "TEANECK, N.J., Aug. 14, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) is recognized as a leader in application modernization and migration services in a new report by Forrester Research, a leading global research and advisory firm.  The Forrester Wave™: Application Modernization and Migration Services, Q3 2019 report assesses 14 service providers on 26 criteria, including current offering, strategy and market presence.The report states that a strong point of Cognizant's vision is that \"modernization must provide service in the context of digital transformation\" and goes on to say that \"Cognizant is a strong choice for a broad range of modernization and migration tasks, including accelerated cloud migration.\" Client references state that Cognizant \"offers a broad range of cloud environments as targets, including both public cloud and hybrid cloud destinations, and its offerings benefit from a solid ecosystem and strong cloud-native development capabilities.\" Forrester also notes that Cognizant's 2018 acquisition of digital engineering leader Softvision expanded the company's range of go-forward engineering development skills.\"Cloud migration is driving the latest phase of application modernization — and companies of all sizes require assistance in making their cloud journeys,\" wrote Bill Martorelli, report author and Principal Analyst, Forrester. \"Services firms must possess both modernization and migration capabilities, encompassing legacy and cloud-native architectures, to qualify as full-service partners for the large enterprise segment.\" \"Cognizant's  global team of design, technical and engineering experts have a passion for designing and building customer-centric digital products and a proven track record of migrating applications to the cloud,\" said Malcolm Frank, President, Cognizant Digital Business. \"Traditional enterprises are moving critical applications to various cloud platforms to address growing threats from digital native competitors with the luxury of starting innovative software development from scratch.  We believe being ranked a leader by Forrester is a testament to the digital engineering and cloud migration expertise Cognizant has invested in and built over the past several years and our commitment to solving the most pressing problems of companies around the globe.\" Learn More:Cognizant Application Services: https://www.cognizant.com/cognizant-digital-systems-technology/application-servicesCognizant Digital Engineering: https://www.cognizant.com/cognizant-digital-business/softvision-digital-product-engineeringThe Forrester Wave Report: https://reprints.forrester.com/#/assets/2/346/RES144402/reports About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-named-a-leader-in-application-modernization-and-migration-services-report-by-independent-research-firm-300901012.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant to Present at the KeyBanc Capital Markets 21st Annual Technology Leadership Forum",
        "subtitle": "",
        "date": "Aug 5, 2019 11:29AM EDT",
        "content": "TEANECK, N.J., Aug. 5, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH), a leading provider of information technology, consulting, and business process services, today announced a presentation at the following investor conference:KeyBanc Capital Markets 21st Annual Technology Leadership Forum Live audio webcasts of the presentations will be available at Cognizant's website:  http://investors.cognizant.comA replay of the webcasts will remain available on the company's website for 90 days.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-to-present-at-the-keybanc-capital-markets-21st-annual-technology-leadership-forum-300896358.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Names Sandra Wijnberg to Board of Directors",
        "subtitle": "",
        "date": "Jul 18, 2019 7:00AM EDT",
        "content": "TEANECK, N.J., July 18, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH) today announced that Sandra Wijnberg has been appointed to its Board as a new independent director, effective July 16, 2019.  Ms. Wijnberg, 62, was most recently an Executive Advisor to Aquiline Holdings LLC, a registered investment advisory firm, from 2015 to early 2019, and from 2007 to 2014 was a partner and Chief Administrative Officer at the firm.  She was previously Chief Financial Officer at Marsh & McLennan Companies, Inc.; Treasurer and interim Chief Financial Officer of Yum! Brands, Inc.; Chief Financial Officer, KFC Corporation at PepsiCo, Inc.; and spent the early part of her career in investment banking at Morgan Stanley and Lehman Brothers.Ms. Wijnberg is a member of the Boards of T. Rowe Price Group, Inc. and Automatic Data Processing, Inc. She previously served on the Boards of Tyco International plc (now Johnson Controls International plc) and Tyco Electronics Ltd. (now TE Connectivity Ltd.).\"We are delighted that Sandra Wijnberg has joined the Cognizant Board,\" said Michael Patsalos-Fox, Cognizant's Chairman of the Board.  \"We believe Sandra's broad financial and professional services experience will make a significant contribution to Cognizant.\"From 2014 through 2015, Ms. Wijnberg was Deputy Head of Mission, Jerusalem for the Office of the Quartet (comprised of the United States, European Union, United Nations and Russia) to advance the Quartet's Palestinian economic development mandate.Ms. Wijnberg is a member of Paradigm for Parity, a trustee of The John Simon Guggenheim Memorial Foundation, and a director for numerous non-profit organizations. She holds a Bachelor's degree in English Literature from the University of California, Los Angeles, and an MBA from the University of Southern California, Marshall School of Business.About Cognizant Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant. View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-names-sandra-wijnberg-to-board-of-directors-300886916.htmlSOURCE  Cognizant"
    },
    {
        "title": "Cognizant Schedules Second Quarter 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Jul 10, 2019 12:26PM EDT",
        "content": "TEANECK, N.J., July 10, 2019 /PRNewswire/ -- Cognizant (Nasdaq: CTSH), a leading provider of information technology, consulting, and business process services, will announce results for the second quarter of 2019 on Wednesday, July 31, 2019, after market close.Following the release, Cognizant management will conduct a conference call at 5:00 p.m. (Eastern) to discuss operating performance for the quarter. To participate in the conference call, domestic callers can dial 877-810-9510 and international callers can dial 201-493-6778 and provide the following conference passcode: Cognizant Call.The conference call will also be available live on the Investor Relations section of the Cognizant website at http://investors.cognizant.com.  Please go to the website at least 15 minutes prior to the call to register and to download and install any necessary audio software.For those who cannot access the live broadcast, a replay will be available by dialing (877) 660-6853 for domestic callers or (201) 612-7415 for international callers and entering 13692449 from two hours after the end of the call until Wednesday, August 14, 2019. The replay will also be available at Cognizant's website http://investors.cognizant.com for 60 days following the call.About CognizantCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us on Twitter: Cognizant.  View original content to download multimedia:http://www.prnewswire.com/news-releases/cognizant-schedules-second-quarter-2019-earnings-release-and-conference-call-300882727.htmlSOURCE  Cognizant"
    }
]