[
    {
        "title": "Citrix Elects JD Sherman to Its Board of Directors",
        "subtitle": "",
        "date": "Mar 4, 2020 4:05PM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (Nasdaq: CTXS) today announced the election of JD Sherman to its board of directors, effective immediately.\n\n“We are fortunate to have JD join the Citrix board,” said David Henshall, president and chief executive officer for Citrix. “JD has extensive financial and operations executive experience. He will be a strong advisor for us as we continue to evolve our business.”\n\nSherman, 54, began his career at IBM where he held numerous finance and planning roles over 15 years. After IBM, Sherman served as chief financial officer at Akamai for 6 years, during which Akamai grew and evolved significantly under his financial leadership. Since 2012, Sherman has served as president and chief operating officer for HubSpot.\n\nSherman will join the audit committee of the Citrix board and qualifies as an independent director.\n\nSherman holds a BA in economics from Emory University, and an MBA from the University of Chicago.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005039/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216 396 4683\nKaren.master@citrix.com\n\nInvestor Contact:\nTraci Tsuchiguchi\nCitrix\n+1 408 790 8467\nTraci.tsuchiguchi@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix: Fueling Business Continuity in Tumultuous Times",
        "subtitle": "",
        "date": "Mar 2, 2020 8:30AM EST",
        "content": "\nOrganizations leverage digital workspace solutions to safely and securely operate in uncertain environments\n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nNatural disasters and public health emergencies can strike anywhere at any time. And when they do, organizations need to be prepared to protect their people and minimize disruptions to their business and the larger economy. Armed with digital workspace solutions from Citrix Systems, Inc. (NASDAQ:CTXS) many are creating flexible work environments that provide access to the tools and information employees need to work safely and securely in the face of unforeseen circumstances.\n\nKeep on Keeping on\n\n“From a disaster recovery perspective, we’d like our employees to able to work from anywhere,” says Kyle Edgeworth, Deputy CIO, City of Corona. “In the event of an emergency, we need to be agile. We need access to our systems and our data.\"\n\nTo enable this, the city, which has been affected by severe wildfires over the past two years, with citizens evacuated and homes destroyed, is implementing Citrix Workspace™ as part of a broader, cloud-first strategy to establish a platform for business continuity.\n\n“We want to get to a stage where employees understand that everything they need to carry out their work can be accessed through Citrix,” Edgeworth adds.\n\nContinue to Learn\n\nWith more than 14,000 students unable to travel to Australia from China due to imposed travel bans, the University of Sydney turned to its technology partners for help.\n\n“The safety and security of our students, staff and community members are paramount. To enable our staff to deliver high-quality education that the University of Sydney is known for, we need to lean on technology that allows us to facilitate the sharing and consumption of knowledge in ways that are safe and secure,” said Jordan Catling, Associate Director, Client Technology, ICT, University of Sydney.\n\nLeveraging Citrix® ADC, the University was able to connect its China-based staff and students to and Citrix Cloud in AWS Sydney and provide access to the applications and data they need to continue teaching and learning from the comfort and safety of their residences.\n\nPrepare for the Worst and Deliver Best\n\nCoronavirus is clearly taking a toll on the global economy. Productivity is lagging as companies restrict travel and workers in affected areas remain quarantined. Supply chains are being disrupted as manufacturing in key markets has ground to a halt. And corporate forecasts are being revised downward as a result.\n\nBut is isn’t the only crisis businesses today face. The talent crunch continues to wreak havoc as well. Korn Ferry recently forecast that by 2030, there will be a shortage of 85.2 million workers globally, and that it will result in lost revenue opportunities of $8.452 trillion. That’s a serious problem. But with digital workspaces, companies can overcome it too.\n\nThey can, for instance, dip into untapped pools of talent such as the “home force” and bring back parents who’ve put their careers on hold to care for children, or people who left jobs to tend to aging relatives. They can set up Baby Boomers who retired, but still want to work a few hours a week. And they might even entice part-time, contract and gig workers to take on more hours and fill the roles they need to advance their objectives.\n\n“Few things in business are certain except change. And the pace with which it is happening is faster than ever before,” said David Henshall, President and CEO, Citrix, “Companies that adopt digital workspace solutions and create flexible environments that provide employees with everything they need to be and perform at their best, can not only keep pace, but quickly move ahead.”\n\nCitrix provides a complete range of digital workspace solutions that unify everything an employee needs to be productive into a seamless, intuitive experience. With Citrix, companies can empower people to work in a flexible, secure and intelligent way that unlocks their creativity and innovation and enables them to deliver better business results. To learn more about Citrix solutions and the value they can create, visit www.citrix.com\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005070/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Renasant Bank Delivers Modern Employee Experience with Citrix",
        "subtitle": "",
        "date": "Feb 18, 2020 8:30AM EST",
        "content": "\nLeading financial institution leverages digital workspace solutions to create flexible environment in which people can work when, where and how they want \n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nToday’s employees want to work on flexible schedules from remote locations using the applications and devices of their choice. But corporate systems and data must be secure. So what’s an IT organization to do? Innovators like Renasant Bank are tapping into solutions from Citrix Systems, Inc. (NASDAQ:CTXS) to create digital environments in which people can work when, where and how they want in a secure and reliable manner.\n\n“The technology landscape seems to change on a daily basis and for IT, it’s a constant juggling act,” says Adam Archer, Director of Infrastructure and Senior Vice President, Renasant Bank. “There is a need to keep the user experience fresh so that our associates don’t feel we are behind in technology, but we also can’t forget about security.”\n\nUsing Citrix digital workspace solutions, including Citrix® Virtual Apps and Desktops and Citrix Workspace™, Archer and his team have been able to keep all the balls in the air.\n\n“It is a must for organizations to be able to deliver a user experience that the associates are confident in, but those solutions have to make sense from a scalability standpoint, “ Archer says. “With Citrix, both of these goals can be accomplished.”\n\nCitrix Virtual Apps and Desktops is an application virtualization solution with the option to implement a scalable VDI solution that helps IT organizations optimize productivity with universal access to virtual apps and server-based desktops from any device.\n\nCitrix Workspace is a powerful work platform that unifies everything an employee needs to be productive into one seamless, intuitive experience. It features:\n\n“With these solutions, we can deliver applications and desktop experiences to associates quickly and efficiently, whether they are in a new remote office, a home office or even just needing new applications in an existing office,” Archer says.\n\nAnd he adds that “Citrix Workspace is a game changer that simplifies the complexity of trying to manage all these different technologies with a single solution.\n\nTo learn more about Citrix digital workspace solutions and how they are helping to transforming the employee experience at companies around the world, visit www.citrix.com\n\nAbout Renasant Bank\n\nRenasant Bank is one of the Southeast’s strongest financial institutions with approximately $13.4 billion in assets and more than 190 banking, lending, wealth management and financial services offices in Mississippi, Alabama, Tennessee, Georgia and Florida. For more information on our banking services, visit: www.renasantbank.com\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200218005087/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix"
    },
    {
        "title": "Citrix Among Top Work Coordination Platforms",
        "subtitle": "",
        "date": "Feb 12, 2020 9:30AM EST",
        "content": "\nCompany Makes Constellation ShortList of solutions designed to optimize the way work gets done \n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nEmployees today have more ways to connect and collaborate and flexibility and choice in the applications and devices they use to get work done than ever before. And according to Constellation Research, Citrix Systems, Inc. (NASDAQ:CTXS) is among the top platforms companies can use to unify everything they need to be productive into one seamless, intuitive experience. The company today announced that it has been named to the 2020 Constellation ShortList™ for Work Coordination Platforms, annual evaluation designed to help companies select the right technologies to drive their digital transformation goals.\n\n“With the rise of digital communications and mass collaboration services such as team chat apps and enterprise social networks, today’s employees face new challenges trying to keep up engagement with an increasing number of colleagues and customers,” said Dion Hinchcliffe, Vice President and Principal Analyst, Constellation Research. “Work Coordination platforms aim to help alleviate these challenges by bringing structure, prioritization and accountability to work by helping employees better organize and optimize their productivity and effectiveness.”\n\nThe 2020 Constellation ShortList evaluated 20 vendors across 18 criteria, including:\n\nCitrix is among the “9 Solutions to Know” as identified by Constellation and noted for being “not a place to just have conversations, but instead manage and execute the projects and business processes that are key to a company’s business success.”\n\n“We are pleased to be recognized by Constellation as a solution companies can rely on to remove the complexity from work and create a highly personalized experience that enables employees to be their most productive,” said Calvin Hsu, Vice President, Product Marketing, Citrix.\n\nA Simpler, Smarter Way to Work\n\nCitrix®Workspace™ is a unified, secure and intelligent work platform that transforms the employee experience by organizing, guiding, and automating all activities people need to do their best work. With Citrix® Workspace, companies can serve up personalized access to the systems, information and tools their employees need in a single experience and dynamically apply security policies based on a user’s behavior and environment so they can work when, where and how they want with the confidence that their applications, information and devices are safe.\n\nClick here to learn more about Citrix digital workspace solutions and the value they can deliver for your organization.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500.\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200212005090/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Synergy 2020: Where Work Gets Smart",
        "subtitle": "",
        "date": "Feb 11, 2020 8:30AM EST",
        "content": "\nPremier digital work conference headed to Orlando May 19-21 \n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nIn the past, work was measured in terms of hours and output. Today, it all comes down to value and innovation. In May, leading companies from around the world will gather for Citrix Synergy 2020, the premier digital work conference hosted by Citrix Systems (NASDAQ: CTXS), to rethink the work experience and learn how they can enable people to work smarter, not harder, and in doing so, drive greater productivity, higher employee engagement, and increased business agility. The event is set to take place at the Orange County Convention Center in Orlando May 19-21.\n\n“Employee Experience is rapidly emerging as the competitive advantage for organizations around the world,” says Tim Minahan, Citrix Executive Vice President of Business Strategy and Chief Marketing Officer. “Businesses that provide the culture, physical space, and digital tools to keep employees engaged and productive drive higher growth, profitability, and retention than their peers. And employees at these organizations also feel more innovative, creative, and empowered. Citrix Synergy will showcase the digital workspace solutions and best practices needed to turn employee experience into a competitive advantage.”\n\nBreaking the Mold\n\nBusiness runs on people. And to get the right people in the right roles to achieve their goals in the tightest labor market the world has ever seen, companies need to reframe the way work gets done.\n\nEmployees today want a seamless and personalized experience that radically simplifies how they engage with technology and removes noise and friction from the workday so that they can take control of their work and be more purposeful, creative, and innovative.\n\nRedefining Employee Experience\n\nCitrix Synergy is a unique event where companies can learn how they can leverage the latest in digital workspace solutions to:\n\nLearning from the Best\n\nIn addition to keynotes from leading business executives and industry thought leaders, Citrix Synergy 2020 will feature:\n\nRegistration for this can’t–miss event is open today and early bird discounts are available until February 14. Click here to reserve your place.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005179/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix"
    },
    {
        "title": "Citrix Executives to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Feb 6, 2020 4:05PM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS) today announced its participation in two upcoming investor conferences:\n\nEvent: Goldman Sachs Technology and Internet Conference\nDate and Time: February 11, 2020 at 12:40 p.m. Eastern\nLocation: San Francisco, CA\nPresenter: David Henshall, president and chief executive officer\n\nEvent: Raymond James & Associates Institutional Investors Conference\nDate and Time: March 3, 2020 at 1:40 p.m. Eastern\nLocation: Orlando, FL\nPresenter: Traci Tsuchiguchi, vice president investor relations\n\nA webcast of each presentation will be available live on the investor section of the Citrix website at www.investors.citrix.com. A replay will be available for approximately 30 days.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500. Learn more at www.citrix.com.\n\nFor Citrix Investors\n\nThis release contain forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. These forward-looking statements do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with Citrix’s ability to advance its subscription business model transition, products and services, their development, integration, distribution and security, product demand and pipeline, customer acceptance of new products, economic and competitive factors, Citrix’s key strategic relationships, acquisition and related integration risks as well as other risks detailed in Citrix’s filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\n\n© 2020 Citrix Systems, Inc. All rights reserved. Citrix© is a registered trademark of Citrix Systems, Inc. in the U.S. and other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005816/en/\nFor media inquiries:\nEric Armstrong, Citrix Systems, Inc.\n(954) 267-2977 or eric.armstrong@citrix.com\n\nFor investor inquiries:\nTraci Tsuchiguchi, Citrix Systems, Inc.\n(408) 790-8467 or traci.tsuchiguchi@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "The Employee Experience is Broken: Here’s How to Fix It",
        "subtitle": "",
        "date": "Feb 4, 2020 8:30AM EST",
        "content": "\nNew research shows empowering employees to be their best improves engagement, productivity and business outcomes\n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nWhen it comes to growing a successful company, research shows it isn’t about getting the most out of employees, but delivering an experience that empowers them to be and do their best. And according to Priming a New Era of Digital Wellness, a new study conducted by Quartz Insights in partnership with Citrix Systems, Inc. (NASDAQ:CTXS), technology is the secret to doing so.\n\n“A superior employee experience is essential in fueling critical business goals, from successfully attracting and retaining talent to boosting customer satisfaction, brand loyalty and ultimately, revenue,” says Donna Kimmel, Executive Vice President and Chief People Officer, Citrix. “In creating flexible work environments and providing access to the tools people need and prefer to use to get things done, companies can deliver it and improve engagement, productivity and results.”\n\nDo Well by Delivering Good\n\nAnd the numbers prove it. In a global survey of more than 1,000 workers conducted across industries in the United States, United Kingdom, Germany, Brazil, China, Japan and Australia, Quartz researchers found that 90 percent of respondents with access to “good technology” reported being more productive.\n\nWhat defines “good technology?” In a word: simplicity. Of those who participated in the Quartz survey, nearly 84 percent said they just want applications that are intuitive and easy to use.\n\nDon’t Frustrate, Automate\n\nAnd three out of four indicated that technology should eliminate friction and automate the menial tasks that dominate their days so they can focus on the meaningful work they were hired and want to do.\n\n“People don’t want to spend their time submitting purchase orders, filing expenses or searching for information,” Kimmel adds. “They want to be creative and innovative and use their special skills to deliver value.”\n\nSet them Free\n\nModern employees also want – and expect – control over when, where and how they work and see digital technology, along with new, more flexible work arrangements, as a way to get it.\n\nWhen asked to rank factors in terms of their ability to create a workplace environment that allows them to do their best work in order of importance, respondents to the Quartz survey put flexible work arrangements third, just behind salary and leadership and ahead of access to effective technology.\n\nAnd more than 75 percent said that greater flexibility with their work schedule would help them innovate and be more creative.\n\n“It’s clear that to attract and retain talent in today’s tight labor market and move their business forward, companies need to rethink what `workplace' means and create digital environments that accommodate new work models and provide access to the tools and information employees need to do their best work when and how they want,” Kimmel notes.\n\nStrike a Balance\n\nTechnology has completely transformed the way work gets done. Today’s employees can connect to the office anywhere, anytime. But it doesn’t mean they should. According to the Quartz research, 67 percent of survey respondents believe being “always on” has a significant negative impact on their health and wellbeing. But there is a cure.\n\nLeveraging digital workspace solutions, companies can optimize the work day for every employee by organizing, guiding and automating work in an intelligent and personal way. Over 75 percent of those polled by Quartz believe doing so could help them strike a better balance between their work and personal lives and prevent them from burning out. And 80 percent say leadership should make this a priority.\n\nMeasure Value, not Output\n\n“When it comes to technology, it’s no longer a matter of the output it delivers, but the value it creates for employees,” Kimmel says. “The best companies recognize this and are focused on designing people-centric experiences that inspire and empower their employees to deliver transformative results.”\n\nFor more insights on how your organization can leverage technology to enhance employee engagement, boost workplace productivity and fuel business innovation, click here and download a complimentary copy of Priming a New Era of Digital Wellness. To learn more about how Citrix can help you redefine the employee experience and power a better way to work, visit www.citrix.com.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005016/en/\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Announces $1 Billion Accelerated Share Repurchase",
        "subtitle": "",
        "date": "Jan 31, 2020 7:05AM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS) today announced that as part of its capital return program it has entered into accelerated share repurchase (“ASR”) transactions with each of Goldman Sachs & Co. LLC and Wells Fargo Bank, National Association (each a “Dealer”) to repurchase an aggregate of $1 billion of its common stock.\n\nDavid Henshall, President and CEO of Citrix, stated, “At Citrix, we have a long track record of returning capital to shareholders, which reflects our focus on growing the business and driving long-term sustainable value. The ASR demonstrates a commitment to strong capital return for our shareholders and the future of Citrix.”\n\nUnder the terms of the ASR transactions, Citrix will receive an aggregate initial share delivery of approximately 6.53 million shares, with the remainder, if any, delivered upon completion of the transactions. The purchase price per share under each ASR transaction is expected to be based on the volume-weighted average price of Citrix’s common stock during the term of the ASR, less a discount. The exact number of shares repurchased pursuant to each ASR transaction will be determined based on such purchase price.\n\nThe ASR transactions were entered into pursuant to Citrix’s existing share repurchase program. Citrix previously announced that its board of directors had increased its repurchase authority by $1 billion in January 2020 which brought its total then-remaining repurchase authorization to approximately $1.75 billion. After taking into account the $1 billion shares repurchased pursuant to this ASR, Citrix will have approximately $750 million of remaining share repurchase authorization available.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500. Learn more at www.citrix.com.\n\nFor Citrix Investors\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. These forward-looking statements do not constitute guarantees of future performance. Investors are cautioned that statements in this release, which are not strictly historical statements, including, without limitation, statements regarding our expectations regarding repurchases or other means of return of capital to our shareholders and statements regarding the expected settlement terms of the ASR. These statements involve a number of factors that could cause actual results to differ materially, including: risks associated with the market price of Citrix common stock during the relevant term of the ASR; the ability of the Dealers to buy or borrow shares of Citrix common stock; the impact of global and regional economic and market conditions, including illiquidity and other risks of instability in the banking and financial services industry as well as other risks detailed in Citrix’s filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\n\nCitrix® is a trademark or registered trademark of Citrix Systems, Inc. and/or one or more of its subsidiaries, and may be registered in the U.S. Patent and Trademark Office and in other countries. All other trademarks and registered trademarks are property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200131005107/en/\nFor media inquiries, contact:\nEric Armstrong, Citrix Systems, Inc.\n(954) 267-2977 or eric.armstrong@citrix.com\nFor investor inquiries, contact:\nTraci Tsuchiguchi, Citrix Systems, Inc.\n(408) 790-8467 or traci.tsuchiguchi@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Reports Fourth Quarter and Fiscal Year 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 22, 2020 4:05PM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS) today reported financial results for the fourth quarter and fiscal year ended December 31, 2019 by posting an earnings letter on its Investor Relations website at http://www.citrix.com/investors. Citrix will host a conference call today at 4:45 p.m. ET to address questions.\n\nThe conference call may be accessed by dialing: (888) 799-0519 or (706) 634-0155, using passcode: CITRIX. A replay of the conference call can be accessed for approximately 90 days on the Investor Relations section of the Citrix corporate website at http://www.citrix.com/investors.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500. Learn more at www.citrix.com.\n\nFor Citrix Investors\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. These forward-looking statements do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with transitions in key personnel and succession, products, their development, integration and distribution, product demand and pipeline, customer acceptance of new products, economic and competitive factors, Citrix’s key strategic relationships, acquisition and related integration risks as well as other risks detailed in Citrix’s filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\n\nCitrix® is a trademark or registered trademark of Citrix Systems, Inc. and/or one or more of its subsidiaries, and may be registered in the U.S. Patent and Trademark Office and in other countries. All other trademarks and registered trademarks are property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200122005604/en/\nFor media inquiries:\nEric Armstrong, Citrix Systems, Inc.\n(954) 267-2977\neric.armstrong@citrix.com\n\n\nFor investor inquiries:\nTraci Tsuchiguchi, Citrix Systems, Inc.\n(408) 790-8467\ntraci.tsuchiguchi@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix and FireEye Mandiant Launch Indicator of Compromise Scanner",
        "subtitle": "",
        "date": "Jan 22, 2020 9:00AM EST",
        "content": "\nFree tool provides assessment of system compromise in connection with CVE-2019-19781\n    FORT LAUDERDALE, Fla. & MILPITAS, Calif.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ: CTXS) and FireEye Inc. (NASDAQ: FEYE) today announced the launch of a new tool for detection of compromise in connection with the previously announced CVE-2019-19781 vulnerability, which affects certain versions of Citrix Application Delivery Controller (ADC), Citrix Gateway, and two older versions of Citrix SD-WAN WANOP. This tool is freely accessible in both the Citrix and FireEye GitHub repositories.\n\nThe free tool is designed to allow customers to run it locally against their Citrix instances and receive a rapid assessment of potential indications of compromise in their systems based on known attacks and exploits. The tool is compatible with all supported versions of Citrix ADC and Citrix Gateway, including 11.1, 12.0, 12.1, 10.5, and 13.0, and Citrix SD-WAN WANOP versions 10.2.6 and 11.0.3. In addition to applying the previously released mitigation steps and installing the permanent updates being made available throughout this week, Citrix and FireEye strongly recommend that all Citrix customers run this tool as soon as possible to increase their overall level of awareness of potential compromise and take appropriate steps to protect themselves.\n\nCitrix announced the CVE-2019-19781 vulnerability along with mitigations on December 17, 2019. Exploits – tools to take advantage of the vulnerability – were published by multiple third parties in early January 2020. As a result, the risk to unmitigated customer systems rose significantly.\n\n“While our security and engineering teams have been working around the clock to develop, test and deliver permanent fixes to CVE-2019-19781, we have been actively thinking of ways to assist our customers in understanding if and how their systems may have been affected,” said Fermin J. Serna, Citrix’s Chief Information Security Officer.\n\n“We partnered with FireEye Mandiant, which is at the forefront of cyber threat intelligence and forensic analysis, to develop a tool that leverages their knowledge of recent attacks against CVE-2019-19781 to help organizations identify potential compromises. The tool utilizes our technical knowledge of the Citrix ADC and Gateway products and CVE-2019-19781, combined with industry-leading expertise in cyber forensics and recent FireEye frontline learnings from CVE-2019-19781 related compromises,” Serna said.\n\nCharles Carmakal, Chief Technology Officer of FireEye Mandiant consulting, said, “As we worked closely with various Citrix customers in their response to CVE-2019-19781, we developed an understanding of the active threats related to this vulnerability. We believe it is in the best interest of Citrix customers using affected product versions and the entire security community for us to join forces with Citrix to offer a free tool that organizations can rapidly deploy in their own environments to identify potential indicators of compromise of their systems.”\n\nThis tool is designed to provide increased awareness regarding potential indicators of compromise related to CVE-2019-19781 on an organization’s systems. The tool is not guaranteed to find all evidence of compromise, or all evidence of compromise related to CVE-2019-19781. If indications of compromise are identified on systems, organizations should perform a forensic examination of the compromised system to determine the scope and extent of the incident.\n\nInstructions on how to use the tool can be found on the aforementioned GitHub sites.\n\nInformation regarding permanent fixes and mitigation steps released by Citrix in relation to the CVE-2019-19781 vulnerability can be found on Citrix’s website.\n\nCitrix has provided additional context for customers regarding the forensic assessment tool in the following blog post: https://www.citrix.com/blogs/2020/01/22/citrix-and-fireeye-mandiant-share-forensic-tool-for-cve-2019-19781/.\n\nAdditional FireEye Mandiant findings associated with CVE-2019-19781 can be found in the following blog post: https://www.fireeye.com/blog/products-and-services/2020/01/fireeye-and-citrix-tool-scans-for-iocs-related-to-vulnerability.html.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nCitrix® is a registered trademark of Citrix Systems, Inc. in the U.S. and other countries. All other trademarks and registered trademarks are property of their respective owners.\n\nAbout FireEye, Inc.\n\nFireEye is the intelligence-led security company. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative security technologies, nation-state grade threat intelligence, and world-renowned Mandiant® consulting. With this approach, FireEye eliminates the complexity and burden of cyber security for organizations struggling to prepare for, prevent, and respond to cyber attacks. FireEye has over 8,500 customers across 103 countries, including more than 50 percent of the Forbes Global 2000.\n\nFireEye and Mandiant are registered trademarks or trademarks of FireEye, Inc. in the United States and other countries. All other brands, products, or service names are or may be trademarks or service marks of their respective owners.\n\nForward-Looking Statements\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks detailed in Citrix’s and FireEye’s respective filings with the Securities and Exchange Commission. These forward-looking statements are subject to change as a result of new information, future events or other circumstances and are expressly qualified in their entirety by this cautionary statement. Neither Citrix nor FireEye assume any obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200122005252/en/\nCitrix Media Contact:\nKaren Master\nCitrix\nKaren.master@citrix.com\n+1 216-396-4683\n\nFireEye Media Contact:\nMelanie Lombardi\nFireEye\nmedia.relations@fireeye.com\n+1 408-324-2439\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Launches Next-Generation Performance Analytics Service for Apps and Desktops",
        "subtitle": "",
        "date": "Jan 13, 2020 8:30AM EST",
        "content": "\nOffering combines intelligence with experience scores to deliver superior system performance, boost employee engagement, productivity and satisfaction\n    ORLANDO, Fla.--(BUSINESS WIRE)--\nIn the old days, analyzing system performance was all about monitoring speeds and feeds. Today, understanding the user experience (UX) is critical. And to help companies do this, Citrix Systems, Inc. (NASDAQ:CTXS), today announced the launch of Citrix® Analytics for Performance, a next-generation service that goes beyond monitoring server-side infrastructure, and enables IT administrators to identify performance issues at the individual user level and proactively address them to deliver a superior experience that engages employees and keeps them happy and productive. The news came during Citrix Summit being held in Orlando this week.\n\n“Modern employees expect consumer-like experiences in how they access their enterprise applications. And they have zero tolerance for poor system performance that slows them down,” said Steve Wilson, Vice President of Product for Workspace Ecosystem and Analytics, Citrix. “With Citrix Analytics for Performance, IT can gain a clear view into the end-user’s experience and the health of the apps they rely on within Citrix Virtual Apps and Desktops to provide a consistent, reliable experience that drives increased satisfaction and improved productivity.”\n\nImproving the UX\n\nUsing a proprietary machine learning engine that integrates real-time telemetry from Citrix Virtual Apps and Desktops, Citrix Analytics for Performance quantifies a user’s experience into a unique “UX Score,” taking into account not just machine performance, but items that impact application access such as user logon time, network latency and even network stability. Using this score, IT administrators can:\n\n“Insight and intelligence into the user experience is critical as businesses provide secure and consistent access to applications and data across any device,” said Mark Bowker, senior analyst at Enterprise Strategy Group. “Key to providing this seamless experience is having continuous visibility into network systems and applications to quickly spot and mitigate issues before they affect productivity.”\n\nAvailability \n\nCitrix Analytics for Performance is generally available and compatible with both cloud-based and on-premises Citrix Virtual Apps and Desktop installations. Click here to learn more about the service and the value it can deliver.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005112/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix"
    },
    {
        "title": "Citrix Systems to Announce Fourth Quarter and Fiscal Year 2019 Financial Results on Wednesday, January 22",
        "subtitle": "",
        "date": "Jan 9, 2020 4:05PM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS), today announced that it plans to report financial results for the fourth quarter and fiscal year ended December 31, 2019 on Wednesday, January 22, 2020 after market close. At approximately 4:05 p.m. ET the fourth quarter 2019 earnings letter discussing financial results, quarterly highlights, and business outlook will be posted at http://www.citrix.com/investors. A conference call will begin at 4:45 p.m. ET to address questions.\n\nThe conference call may be accessed by dialing:\n(888) 799-0519 or (706) 634-0155\nUsing passcode: CITRIX\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500. Learn more at www.citrix.com.\n\nFor Citrix Investors\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\n\nCitrix® is a registered trademark of Citrix Systems, Inc. in the U.S. and other countries. All other trademarks and registered trademarks are property of their respective owners. \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005786/en/\nInvestor Inquiries at Citrix:\nTraci Tsuchiguchi (408) 790-8467\n\nMedia Inquiries at Citrix:\nEric Armstrong (954) 267-2977\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix a Leader in Digital Workspace Solutions",
        "subtitle": "",
        "date": "Jan 7, 2020 8:30AM EST",
        "content": "\n      Company recognized as frontrunner in all technologies required to\n      create simple, intelligent work experience that engages employees and\n      empowers them to perform at their best\n        FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\n      Work today is broken. It requires too much technology that’s too hard to\n      use. Distractions from emails, texts, Tweets, Slacks and all the\n      channels we need to use to get things done are relentless. And\n      traditional models don’t provide the flexibility that modern workers\n      demand. Plenty of solutions aim to fix parts of this. But Citrix\n      Systems, Inc. (NASDAQ:CTXS) has been recognized as a leader in\n      providing all of the technologies needed to create intelligent, digital\n      workspaces that remove the complexity and frustration from work,\n      engage employees and empower them to be and perform at their best.\n    \n      A Leader in Unified Endpoint Management\n    \n      To keep employees happy and performing at their best, companies need to\n      provide simple, contextual access to the applications they need and\n      prefer to use anytime, anywhere on any device. But they can’t sacrifice\n      security.\n    \n      With Citrix\n      Endpoint Management, organizations can dynamically apply security\n      policies, procedures and technologies to protect their corporate data\n      regardless of where it is accessed or resides and enable device freedom\n      for the end user without getting in the way of their experience.\n    \n      In 2019,Citrix was ranked as a leader in Unified Endpoint Management\n      solutions by major independent research firms, including Forrester\n      Research, Inc. in a report titled “The Forrester Wave™: Unified Endpoint\n      Management, Q4 2019, The 13 Providers that Matter Most and How They\n      Stack Up.” (The Forrester Wave™: Unified Endpoint Management, Q4 2019,\n      Forrester Research, Inc., November 2019).\n    \n      Noted for its laser focus on improving the employee experience, Citrix\n      was cited for having “one of the best workspace experiences in the\n      evaluation, with comprehensive app support, self-service features, and\n      access to all content repositories, whether on-premises or in the\n      cloud.” In addition, the company received the highest possible scores in\n      the product roadmap and roadmap execution criteria and 4 out of 5 scores\n      in the security features criterion and strategy category.\n    \n      The company was also positioned as a Leader in the August 2019\n      Gartner Magic Quadrant for Unified Endpoint Management (UEM) Tools*.\n    \n      A Leader in Mobility\n    \n      Work today can happen anywhere. And with increasing frequency, it’s\n      outside of a physical office. Employees work from home or their local\n      coffee shop. They dial in from the car or train. And they connect using\n      any number of devices, including laptops, smartphones, tablets, and even\n      wearables.\n    \n      In 2019, Citrix was named a Leader in three IDC MarketScape reports\n      focused on mobility solutions:\n    \n      “At Citrix we are focused on helping our customers power a better way to\n      work,” said Calvin Hsu, Vice President, Product Marketing, Citrix. “We\n      are pleased to be recognized as a leader across all of the technologies\n      needed to do this and will maintain our focus on delivering a unified,\n      secure and intelligent work platform that transforms the employee\n      experience by organizing, guiding, and automating all activities people\n      need to perform at their best.”\n    \n      More than 400,000 companies around the world – including 98 percent of\n      the Fortune 100 - are using Citrix solutions to deliver the future of\n      work today. To learn more about the results they are achieving and the\n      transformation they can help you drive, visit www.citrix.com\n    \n      * Gartner does not endorse any vendor, product or service depicted in\n      its research publications, and does not advise technology users to\n      select only those vendors with the highest ratings or other designation.\n      Gartner research publications consist of the opinions of Gartner’s\n      research organization and should not be construed as statements of fact.\n      Gartner disclaims all warranties, express or implied, with respect to\n      this research, including any warranties of merchantability or fitness\n      for a particular purpose.\n    \n      About Citrix\n    \n      Citrix (NASDAQ:CTXS) is powering a better way to work with unified\n      workspace, networking, and analytics solutions that help organizations\n      unlock innovation, engage customers, and boost productivity, without\n      sacrificing security. With Citrix, users get a seamless work experience\n      and IT has a unified platform to secure, manage, and monitor diverse\n      technologies in complex cloud environments. Citrix solutions are in use\n      by more than 400,000 organizations including 98 percent of the Fortune\n      500.\n    \n      For Citrix Investors:\n    \n      This release contains forward-looking statements which are made pursuant\n      to the safe harbor provisions of Section 27A of the Securities Act of\n      1933 and of Section 21E of the Securities Exchange Act of 1934. The\n      forward-looking statements in this release do not constitute guarantees\n      of future performance. Those statements involve a number of factors that\n      could cause actual results to differ materially, including risks\n      associated with the impact of the global economy and uncertainty in the\n      IT spending environment, revenue growth and recognition of revenue,\n      products and services, their development and distribution, product\n      demand and pipeline, economic and competitive factors, the Company's key\n      strategic relationships, acquisition and related integration risks as\n      well as other risks detailed in the Company's filings with the\n      Securities and Exchange Commission. Citrix assumes no obligation to\n      update any forward-looking information contained in this press release\n      or with respect to the announcements described herein. The development,\n      release and timing of any features or functionality described for our\n      products remains at our sole discretion and is subject to change without\n      notice or consultation. The information provided is for informational\n      purposes only and is not a commitment, promise or legal obligation to\n      deliver any material, code or functionality and should not be relied\n      upon in making purchasing decisions or incorporated into any contract.\n    \n      © 2020 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks\n      appearing herein are the property of Citrix Systems, Inc. and may be\n      registered with the U.S. Patent and Trademark Office and in other\n      countries. All other marks are the property of their respective owners.\n    \n    View source version on businesswire.com: https://www.businesswire.com/news/home/20200107005078/en/\n      Media Contact:Karen MasterCitrix+1 216-396-4683Karen.master@citrix.com\n    Source: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Workspace Live for Google Cloud",
        "subtitle": "",
        "date": "Dec 16, 2019 12:00PM EST",
        "content": "\nSolution enables companies to deliver simple, intelligent work experience on Google devices and operating systems \n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nExpanding on the flexibility and choice it provides to companies in enabling a superior digital work experience, Citrix Systems, Inc. (NASDAQ:CTXS) today announced general availability of Citrix® Workspace™ for Google Cloud. Using the solution, companies can deliver unified access to the G Suite apps employees need and prefer to use and fuel a simple, intelligent experience that improves engagement and productivity.\n\n“When it comes to work today, employees don’t want to be distracted by technology. They want to be empowered by it to do their best work,” said Calvin Hsu, Vice President, Product Marketing, Citrix. “With Citrix Workspace, companies can quiet the digital noise that’s frustrating employees and enable them to focus on work that matters and thrive.”\n\n“We’re delighted that Citrix’s Workspace platform is now available to the millions of customers using G Suite around the world,” said Manvinder Singh, Director, Partnerships at Google Cloud. “By integrating with and extending G Suite, Citrix is providing new ways to help customers get work done in a more streamlined collaborative way.”\n\nA Better Way to Work\n\nCitrix Workspace is a unified, secure and intelligent work platform that transforms the employee experience by organizing, guiding, and automating all activities people need to perform at their best. And leading companies using Google Cloud are fast embracing it to do just this.\n\n“With the Citrix Workspace on Google Cloud, we can create a unified work experience where people can focus on creating value,” said Mari Wasström, IT Solutions Service Management Lead, Neste Oyj. “And that has a tremendous effect on efficiency and employee satisfaction.” \n\nA Productivity Powerhouse\n\nWith the latest release of Citrix Workspace, Google Cloud customers can incorporate the G Suite tools their employees prefer to use into an intelligent work feed and deliver productivity-boosting, time-saving microapps that integrate multiple workflows by automating and simplifying common tasks within minutes. Microapps for G Suite can be used to streamline everything from booking resources to sending event reminders and notifications to new team members. Through an easy-to-use microapp builder, companies can customize Citrix Workspace to accommodate their unique processes and needs.\n\nModern App Development for a Hybrid Cloud World\n\nUsing Google Cloud’s Anthos for hybrid and multi-cloud deployments, companies can build microservices applications and run them anywhere. With the validation of Citrix ADC™ for Anthos, customers can integrate Citrix ADCs, including MPX, VPX and CPX, into Anthos with confidence and maintain operational and policy consistency between on-prem and cloud environments to ease application migration. They can also use Citrix ADM Service Graphs to visualize microservice maps, gain insights about microservice health and detect anomalies and potential problems.\n\nEnterprise-Grade VDI \n\nAnd using Citrix Virtual Apps and Desktops Machine Creation Service (MCS), IT can quickly and efficiently provision Windows-based Citrix workloads at scale and create a modern digital work environment in which employees can access all of the tools they need to collaborate and perform at their best.\n\n“We run all of our IT in the cloud, and Google Cloud Platform (GCP) is one of the platforms we use,” said Ulrik Christensen, Principal Infrastructure Engineer at Oncology Venture. “With Citrix Machine Creation Service, our administrators can easily create and update images for workloads. All they need to do is boot up the image and make the requested changes, then shut down the image, create a snapshot, and update things from Citrix Studio. It saves us a great deal of time is the perfect technology to keep things running.”\n\nCitrix Workspace for Google Cloud is generally available today. For more information on the solution and the ways in which it can benefit your organization, visit: www.citrix.com/google\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2019 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191216005119/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix"
    },
    {
        "title": "Citrix Makes Work Personal",
        "subtitle": "",
        "date": "Dec 12, 2019 8:30AM EST",
        "content": "\nCompany delivers intelligent feed and personalized workflows within Citrix Workspace to cut digital noise and empower employees to do best work\n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nTechnology has made our personal lives easier than ever. But it’s complicating things in the office. On any given day, the average employee spends nearly 65 percent of their time on busy work and in meetings, 20 percent searching for information and just 15 percent doing what they want and are paid to do. Why? Because technology that was supposed to streamline work has only made it more complex. Citrix Systems, Inc. (NASDAQ:CTXS) is out to change this. The company today announced general availability of new features within Citrix® Workspace™ including an intelligent feed and personalized workflows designed to simplify work by eliminating digital noise and automating meaningless tasks so that employees can focus on their core jobs and be their best.\n\n“As consumers, we rely on things like Instagram and Uber to organize and manage our lives. And with a single click, we can accomplish what we set out to do,” said Tim Minahan, Executive Vice President of Strategy and Chief Marketing Officer, Citrix. “Then we get to the office and these streamlined and personalized experiences are replaced with company-issued technology that is cumbersome to use, slows us down, continually interrupts us, and keeps us from doing meaningful work.”\n\nQuieting the Noise\n\nIn the course of a typical day, employees:\n\n“When you add it all up, that leaves just 1.2 hours of uninterrupted time a day to focus on value-creating work,” Minahan said.\n\nEnabling the Future of Work Today\n\nBut this is about to change. By 2021, IDC Predicts that 60 percent of Global 2000 companies will have adopted a future-workspace model — a flexible, intelligent, collaborative virtual/physical work environment — to improve employee experience and productivity, with 10 percent adopting workspace as a service. And Citrix will be at the forefront of this transformation. (IDC FutureScape: Worldwide Future of Work 2019 Predictions, Doc # EMEA44255218, October 2018)\n\n“The future of work has recently become a common theme from a broad range of technology vendors and service providers. Some can clearly articulate that theme, but it takes a combination of work abstraction and application/client virtualization technologies to practically deliver the future-space,” notes IDC analyst Shannon Kalvar.\n\nPersonalizing Work\n\nUsing Citrix Workspace, companies can optimize the work day for every employee by organizing, guiding and automating work in an intelligent and personal way that enables them to focus on doing what they do best - and do it best.\n\n“At the end of the day, employees want to master their craft,” Minahan said. “With Citrix Workspace, employers can empower them to do so by freeing them from soul sucking tasks so that they can focus on building their skills and engaging work.”\n\nUnbundling Monolithic Apps\n\nInfused with innovative technologies such as machine learning and micro applications, Citrix Workspace enables organizations to create a single, unified experience that is intelligent and secure across apps and data. Leveraging out of the box integrations to the world’s most commonly used applications, including SAP (Ariba, Concur and SuccessFactors); Microsoft (Dynamics, Power BI and Teams); Google G-Suite (Drive, Calendar and Directory); Salesforce; Workday; Atlassian (Jira); Zendesk and ServiceNow; more than 100 pre-configured microapps and the new intelligent features, companies can:\n\nIn addition, companies can also connect through Citrix Workspace to legacy, homegrown systems and create engaging micro applications and micro automation using low-code tooling.\n\n“With Citrix, we have a partner on our side who covers all the important issues around delivering applications, desktops and data,” said Bernd Dausch, Chief Technical Officer Datacenter, Schuster & Walther IT-Kanzlei GmbH. “In the next few years, the demand for automated workflows and intelligent tools will continue to grow in law firms. With Citrix Workspace, we can address these exact issues.”\n\nUsing Citrix Workspace, companies can remove the complexity from work and create a highly personalized experience that enables employees to be their most productive and use the special skills they were hired for to create value. And this is exactly what Citrix partners like Fujitsu are aiming to help them do.\n\n“The intelligent feed and personalized workflows that Citrix has brought to market today are truly innovative and will bolster our ability to help companies deliver a simple, consumer-like work experience that enhances their employee experience and in turn, their business,” said Tim White, Corporate Executive Officer, SVP, Head of Global Delivery Group, Fujitsu.\n\nClick here to learn more about the new features and how Citrix Workspace can help your organization transform the employee experience and deliver the future of work today.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2019 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191212005023/en/\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Deepens Ties to Amazon Web Services",
        "subtitle": "",
        "date": "Dec 4, 2019 8:30AM EST",
        "content": "\nTurbocharged integrations provide greater flexibility and choice in deploying AWS; fuel secure and reliable user experience\n    LAS VEGAS--(BUSINESS WIRE)--\nHybrid environments are the reality of computing today. And Citrix Systems, Inc. (NASDAQ:CTXS) is making it easier than ever to manage them. The company today announced that it is deepening its relationship with Amazon Web Services (AWS) to provide businesses with greater flexibility and choice in deploying Citrix® ADC in hybrid environments and a convenient and easy way to deliver a secure, reliable experience that engages users and allows them to perform at their best. The news came during AWS re:Invent 2019, which is taking place in Las Vegas this week.\n\n“Users today don’t care where the applications they need to do their jobs are hosted. They just want them to perform in a consistent, dependable way so they can get things done,” said Mihir Maniar, Vice President of Product Management, Networking, Citrix. “Through the relationship between Citrix® ADC and AWS, we can bring a proven, enterprise-class solution to the masses in a convenient delivery model and enable a high performance experience that empowers people to do their best work.”\n\nA Consistent Experience \n\nThe move to the cloud is on. But not everything can go there. From regulatory and compliance requirements to latency issues and local processing needs, some apps need to stay on premises. As a newly validated AWS Outposts solution, Citrix ADC can be used to bring native AWS services, infrastructure, and operating models to on-premises facilities in a simple, cost-effective way and deliver a consistent hybrid experience.\n\nGreater Flexibility and Choice\n\nCompanies want the flexibility to control the routing path of their traffic and ability to direct traffic through virtual appliances of their choice. But it hasn’t been easy to achieve. Until now. Leveraging new Amazon Virtual Private Cloud (Amazon VPC) ingress routing features, companies can redirect traffic flowing in and out of a VPC through Citrix ADC to ensure highly available and reliable performance. Amazon VPC Ingress Routing is a service that helps customers simplify the integration of network and security appliances within their network topology.\n\nSimplified Deployment \n\nMigrating apps to the cloud has never been easier. Created in collaboration with AWS, the AWS Quick Start for Citrix ADC empowers companies to speed and automate configuration and greatly reduce the time, costs and skill level involved.\n\nA Comprehensive Approach\n\nCitrix offers a comprehensive range of solutions that are proven to scale and integrate in the AWS environment and ensure the security, reliability and high performance that application delivery and management today demands. And it continues to extend and expand these offerings.\n\nReliable and Secure Enterprise Connectivity\n\nCitrix also announced today that Citrix SD-WAN now supports AWS Transit Gateway to simplify how Amazon VPCs and on-premises networks are connected to reduce operational costs. Using the Citrix SD- WAN orchestration service, customers can quickly connect their branches and data centers to the AWS Transit Gateway and access resources across any Amazon VPC or other connected network.\n\nThese new capabilities make it easy for businesses to:\n\n“With these powerful Citrix networking solutions integrated with AWS and market-leading virtual applications, companies have everything they need to enable experience-driven application performance across modern networks that ultimately drives productivity.” said Chalan Aras, Vice President, Products, SD-WAN and Intelligent Traffic Management.\n\nTo learn more about Citrix networking and digital workspace solutions and the value they can deliver, click here. To see them in action at re:Invent, visit booth 3807.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2019 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204005041/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix Executives to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 14, 2019 4:05PM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS) today announced its participation in four upcoming investor conferences:\n\nEvent: RBC Global Technology, Internet, Media and Telecommunications Conference\nDate and Time: November 19 at 8:00 a.m. Eastern\nLocation: New York, NY\nPresenter: David Henshall, president and chief executive officer\n\nEvent: Credit Suisse Technology Conference\nDate and Time: December 3 at 11:55 a.m. Eastern\nLocation: Scottsdale, AZ\nPresenter: David Henshall, president and chief executive officer\n\nEvent: Wells Fargo TMT Summit\nDate and Time: December 3 at 4:35 p.m. Eastern\nLocation: Las Vegas, NV\nPresenter: Arlen Shenkman, executive vice president and chief financial officer\n\nEvent: Barclays Global Technology, Media and Telecommunications Conference\nDate and Time: December 12 at 4:30 p.m. Eastern\nLocation: San Francisco, CA\nPresenter: PJ Hough, executive vice president and chief product officer\n\nA webcast of each presentation will be available live on the investor section of the Citrix website at www.investors.citrix.com. A replay will be available for approximately 30 days.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500. Learn more at www.citrix.com.\n\nFor Citrix Investors\n\nThis release contain forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. These forward-looking statements do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with Citrix’s ability to advance its subscription business model transition, products and services, their development, integration, distribution and security, product demand and pipeline, customer acceptance of new products, economic and competitive factors, Citrix’s key strategic relationships, acquisition and related integration risks as well as other risks detailed in Citrix’s filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\n\n© 2019 Citrix Systems, Inc. All rights reserved. Citrix© is a registered trademark of Citrix Systems, Inc. in the U.S. and other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191114005711/en/\nFor media inquiries, contact:\nEric Armstrong, Citrix Systems, Inc.\n(954) 267-2977 or eric.armstrong@citrix.com\n\nFor investor inquiries, contact:\nTraci Tsuchiguchi, Citrix Systems, Inc.\n(408) 790-8467 or traci.tsuchiguchi@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Citrix a Leader in Unified Endpoint Management Solutions",
        "subtitle": "",
        "date": "Nov 11, 2019 2:56PM EST",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS) today announced that it has been ranked as a leader in Unified Endpoint Management solutions by independent research firm Forrester Research, Inc. in a report titled “The Forrester Wave™: Unified Endpoint Management, Q4 2019, The 13 Providers that Matter Most and How They Stack Up.” (The Forrester Wave™: Unified Endpoint Management, Q4 2019, Forrester Research, Inc., November 2019).\n\nDesigned to assess the current state of the market for unified endpoint management solutions, the report evaluated 13 providers using 23 criteria within the categories of current offering, strategy and market presence. Noted for its laser focus on improving the employee experience, Citrix was cited for having “one of the best workspace experiences in the evaluation, with comprehensive app support, self-service features, and access to all content repositories, whether on-premises or in the cloud.”\n\nIn addition, the company received the highest possible scores in the product roadmap and roadmap execution criteria and 4 out of 5 scores in the security features criterion and strategy category.\n\nUnified, Secure and Intelligent\n\nWhen it comes to work today, employees just want a simple way to get things done. Instead, they are forced to use hundreds of apps and cumbersome technology that make work overly complex and distract them from what they want and are paid to do. They’re fed up and it’s killing their productivity and engagement.\n\n“To keep employees happy and performing at their best, companies need to provide simple, contextual access to the applications they need and prefer to use anytime, anywhere on any device. But they can’t do so at the expense of security,” said Calvin Hsu, Vice President, Product Marketing.\n\nTogether with Citrix® Workspace™, Citrix® Endpoint Management™ enables companies to serve up personalized access to the systems, information and tools their employees need in one, unified experience and dynamically apply security policies based on a user’s behavior and environment so they can work when, where and how they want with the confidence that their applications, information and devices are safe.\n\n“We are pleased to be recognized by Forrester as a leader in unified endpoint management and will maintain our focus on transforming the employee experience through digital workspace solutions that remove the complexity from work and create a highly personalized experience that enables employees to be their most productive.”\n\nClick here to learn more about Citrix solutions and how you can leverage them to deliver a superior experience that enables your employees and organization to thrive.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500.\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2019 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191111005605/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Driven by Data – Aston Martin Red Bull Racing and Citrix Renew Partnership",
        "subtitle": "",
        "date": "Nov 1, 2019 8:30AM EDT",
        "content": "    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nCitrix Systems, Inc. (NASDAQ:CTXS) and Aston Martin Red Bull Racing today announced a renewal of their innovation partnership. A multi-year extension will see Citrix branding remain prominent on and off the Aston Martin Red Bull Racing car, while the Team will rely on Citrix’s innovative digital workspace solutions as it adapts to Formula One’s new technical and regulatory framework.\n\nCitrix has been a technical partner of the Team since 2007, delivering digital workspace solutions that allow the race team on the road to access the full processing power of the organization at base. More recently, Citrix has been providing support and guidance for the digitalization of the Team’s wider business processes. As Formula One becomes ever more time-sensitive and data-driven, the relationship between Citrix and Aston Martin Red Bull Racing has flourished and deepened, culminating in an innovation partnership in 2017.\n\n“Work is different today. It isn’t a place anymore, but a dynamic activity that happens anywhere,” said Tim Minahan, Executive Vice President of Business Strategy and Chief Marketing Officer, Citrix. “AMRBR clearly recognizes this and is using digital workspace solutions to rethink how they work at the track, the garage, the factory and everywhere in between. We are pleased to be a partner on their journey and look forward to working together with the Team to deliver the future of work and help them lap the competition.”\n\nWith Citrix technology, Aston Martin Red Bull Racing can access high-powered computing resources from anywhere in the world. This flexibility has proved vital in delivering the Team’s successes. A modern F1 team is a distributed and collaborative network that places an incredibly high value on speed and responsiveness. Against the backdrop of an expanding global racing series, Citrix enables Aston Martin Red Bull Racing to maximize its resources, wherever in the world team members are working.\n\n“Our relationship with Citrix has been developing for over a decade and we’re really pleased to be announcing this partnership extension today,” said Team Principal Christian Horner. “Citrix is a great example of an Innovation Partner that actively works with us to improve our Team’s performance on and off the track. Citrix is how we work anywhere – whether it’s at the track or the top of a high rise – and we’re looking forward to discovering what the future holds.”\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2019 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the U.S. Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191101005123/en/\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    },
    {
        "title": "Remote Work Key to Winning Battle for Talent",
        "subtitle": "",
        "date": "Oct 29, 2019 8:30AM EDT",
        "content": "\nNew study finds flexible work models could help narrow the widening gap between workers and jobs and boost US economy by more than $2 trillion annually \n    FORT LAUDERDALE, Fla.--(BUSINESS WIRE)--\nThe gap between jobs and skilled workers continues to grow. And it’s killing productivity and growth at companies large and small. But there is a way to narrow it. According to a new study conducted by the Centre of Economics and Business Research (Cebr) with support from Citrix Systems, Inc. (NASDAQ:CTXS), companies that leverage technology to enable flexible work models can not only attract talent, but increase employee engagement and productivity, potentially boosting the US economy by as much as $2.36 trillion a year.\n\n“The battle for talent is fierce and it’s hindering business growth and innovation around the globe,” said Tim Minahan, Executive Vice President of Strategy and Chief Marketing Officer, Citrix. “This research supports the idea that, when harnessed correctly, technology that enables remote work models can empower companies to draw talent from new and untapped pools and leverage their skills to unlock innovation, engage customers and move their business forward.”\n\nTapping the Home Force\n\nThrough an online survey of more than 2,500 US knowledge workers conducted in July, the Cebr study sought to determine the potential value to the US economy of the adoption of a more widespread, flexible working culture. And it found that in offering virtual/remote work options and providing the tools to enable them, companies can better compete in the battle for talent by dipping into untapped pools of workers. These include unemployed and economically inactive individuals such as:\n\nAccording to the survey, 69 percent of people who are currently unemployed or economically inactive indicated that they would be encouraged to start working if given the opportunity to work flexibly. And if they did, Cebr estimates it could drive upwards of $2 trillion in economic gains across the US economy and an increase in GDP of 10.2 percent.\n\nIn addition, companies offering flexible/remote working options can entice contract and part-time employees to take on more work. According to the survey, 65 percent of respondents working part-time said they would be inclined to work more hours if they could work remotely.\n\nKilling the Commute\n\nIf provided with the opportunity, 95 percent of the knowledge workers polled who are currently employed say they would work from home 2.4 days per week, on average. And between 60 percent and 70 percent of respondents would do so from other locations, including local coffee shops and shared workspaces, at least one day per week. According to Cebr, this would:\n\nRespondents to the online survey say it would also make them more productive. Of those polled,\n\n“Remote work has long been heralded as a key productivity hack, and now there’s proof that workers with flexible arrangements are likely to get more done,” Minahan said.\n\nStriking a Balance\n\nThe Cebr study further found that flexible work models can help employees strike a better work-life balance by freeing up 11.9 billion hours a year – or 105 hours per person – that can be devoted to personal and leisure activities. And according to Donna Kimmel, Executive Vice President and Chief People Officer, Citrix, giving employees time to focus on activities other than work pays dividends too.\n\n“Life happens. And people need to manage it – even during work hours,” she said. “In giving employees the flexibility and tools to work when, where and how they want, companies can help them to better integrate their work and lives and ultimately, improve their engagement and productivity.”\n\nReaping the Rewards\n\nThe benefits of remote work are clear. And to reap them, companies need to rethink what “workplace” means. “The future of work is dynamic and decentralized,” Kimmel said. “And businesses that create flexible digital environments in which employees can access the tools and information they need to perform at their best, from anywhere at any time, can deliver it today.”\n\nTo learn more about the role that technology can play in enabling remote work, click here. For a complimentary copy of the Cebr research, click here.\n\nAbout the Research \n\nThe findings of The Potential Economic Impacts of Flexible Working research are based on a study commissioned by Citrix and carried out by Cebr, the Centre for Economics and Business Research in July 2019, which sought to determine the potential value of the adoption of more widespread and flexible working cultures to the US economy. The analysis was based on data from an online survey of 2,502 US knowledge workers, conducted by Opinium across five key demographics, including:\n\nFor more detailed information on the methodology, or to ready the full report, click here.\n\nAbout Citrix\n\nCitrix (NASDAQ:CTXS) is powering a better way to work with unified workspace, networking, and analytics solutions that help organizations unlock innovation, engage customers, and boost productivity, without sacrificing security. With Citrix, users get a seamless work experience and IT has a unified platform to secure, manage, and monitor diverse technologies in complex cloud environments. Citrix solutions are in use by more than 400,000 organizations including 99 percent of the Fortune 100 and 98 percent of the Fortune 500.\n\nFor Citrix Investors:\n\nThis release contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The forward-looking statements in this release do not constitute guarantees of future performance. Those statements involve a number of factors that could cause actual results to differ materially, including risks associated with the impact of the global economy and uncertainty in the IT spending environment, revenue growth and recognition of revenue, products and services, their development and distribution, product demand and pipeline, economic and competitive factors, the Company's key strategic relationships, acquisition and related integration risks as well as other risks detailed in the Company's filings with the Securities and Exchange Commission. Citrix assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein. The development, release and timing of any features or functionality described for our products remains at our sole discretion and is subject to change without notice or consultation. The information provided is for informational purposes only and is not a commitment, promise or legal obligation to deliver any material, code or functionality and should not be relied upon in making purchasing decisions or incorporated into any contract.\n\n© 2019 Citrix Systems, Inc. Citrix, the Citrix logo, and other marks appearing herein are the property of Citrix Systems, Inc. and may be registered with the US Patent and Trademark Office and in other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005614/en/\nMedia Contact:\nKaren Master\nCitrix\n+1 216-396-4683\nKaren.master@citrix.com\nSource: Citrix Systems, Inc."
    }
]