[
    {
        "title": "Dollar Tree, Inc. Reports Results for the Fourth Quarter and Fiscal Year 2019",
        "subtitle": "",
        "date": "Mar 4, 2020 7:30AM EST",
        "content": "\n~ Consolidated Net Sales Increased 1.8% to $6.32 Billion ~\n~ GAAP Diluted Earnings per Share of $0.52 ~\n~ Adjusted EPS of $1.79 vs. Guidance Range of $1.70 to $1.80 ~\n~ Enterprise Same-Store Sales Increased 0.4% ~\n~ Same-Store Sales by Segment: Dollar Tree +1.4%, Family Dollar -0.8% ~\n~ 2020 Plans Include: 1,250 Family Dollar H2 Renovations; Launch of Dollar Tree Plus! 2.0 ~\n    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America's leading operator of discount variety stores, today reported financial results for its fourth quarter and fiscal year ended February 1, 2020.\n\n“I am proud of the team’s accomplishments in 2019, including the successful consolidation of our store support centers, the material acceleration in the Family Dollar store optimization program where we continue to see strong performance at renovated stores, and the initial launch of our Dollar Tree Plus! initiative. For the fourth quarter, despite the compressed holiday shopping season, we delivered positive comps for the enterprise, while managing margins and costs effectively to achieve adjusted earnings per share near the top of our guidance range,” stated Gary Philbin, Chief Executive Officer. “Our support functions are now working together in one location under one leadership team; which we expect will build greater collaboration, efficiencies and teamwork to enable us to support Dollar Tree and Family Dollar stores more effectively. Fiscal 2019 was a very important year for our organization to further develop the foundation to grow and improve our business.”\n\nFourth Quarter Results\n\nIn the fourth quarter, the Company incurred several discrete charges, as described below:\n\nDiscrete items, or adjustments, for fiscal 2019 and 2018 are included in the Reconciliation of Non-GAAP Financial Measures within the tables of this earnings release.\n\nFor the fourth quarter, including the impact of each of the items listed above, the Company reported GAAP earnings per share of $0.52. Adjusted earnings per share for the quarter, excluding the impact of the identified items, was $1.79, near the high end of the Company’s guidance range.\n\nConsolidated net sales increased 1.8% to $6.32 billion from $6.21 billion in the prior year’s fourth quarter. Enterprise same-store sales increased 0.4%. Same-store sales for the Dollar Tree segment increased 1.4% on a constant currency basis (or 1.5% when adjusted to include the impact of Canadian currency fluctuations). Same-store sales for the Family Dollar segment decreased 0.8%.\n\nGross profit increased 2.5% to $1.96 billion in the quarter compared to the prior year’s fourth quarter. As a percentage of net sales, gross margin was 31.0% compared to an adjusted gross margin of 31.5% in the prior year. The decrease in gross margin was driven by tariffs, partially offset by improved freight costs. Other contributors to the decrease were higher occupancy, distribution and shrink costs as a percentage of net sales.\n\nSelling, general and administrative expenses, including discrete charges, were 27.1% of net sales compared to 65.4% of net sales in the prior year's fourth quarter. Excluding the discrete charges in 2019 and 2018, adjusted selling, general and administrative expenses as a percentage of net sales were 21.9%, compared to 21.3% in the prior year’s quarter. The increase was driven primarily by higher payroll and depreciation costs.\n\nOperating income for the quarter was $249.4 million compared with an operating loss of $2.15 billion in the same period last year. Excluding the discrete charges from the fourth quarter of both years, adjusted operating income for the quarter was $580.4 million compared with $632.6 million in the prior year’s period. Adjusted operating income margin was 9.2% of net sales in the fourth quarter compared to 10.2% of net sales in last year’s quarter.\n\nNet income was $123.0 million in the fourth quarter and GAAP diluted earnings per share for the quarter were $0.52 compared to a loss of $9.69 per share in the prior year’s quarter. Excluding discrete costs from the fourth quarter of both years, adjusted diluted earnings per share were $1.79 in fiscal 2019, compared to $1.90 in fiscal 2018.\n\nDuring the quarter, the Company opened 112 new stores, expanded or relocated 17 stores, and closed 95 stores. Additionally, the Company opened 10 Dollar Tree stores that were re-bannered from Family Dollar and completed five renovations to the Family Dollar H2 format. Retail selling square footage at quarter end was approximately 121.3 million square feet.\n\nFull Year Results\n\nConsolidated net sales increased 3.5% to $23.61 billion from $22.82 billion in the prior year. Enterprise same-store sales increased 1.8%. Same-store sales for the Dollar Tree segment increased 2.3% (or 2.2% when adjusted to include the impact of Canadian currency fluctuations). Same-store sales for Family Dollar increased 1.4%.\n\nGross profit increased $93.2 million to $7.04 billion. As a percentage of net sales, gross margin was 29.8%, compared to an adjusted gross margin of 30.6% in the prior year.\n\nSelling, general and administrative expenses were 24.5% of net sales compared to 34.5% of net sales in the prior year. Excluding the discrete costs in 2019 and 2018, adjusted selling, general and administrative expenses as a percentage of net sales were 23.1% in 2019 compared to 22.6% in 2018.\n\nOperating income was $1.26 billion in 2019 compared to an operating loss of $939.5 million in 2018. Excluding the discrete charges in 2019 and 2018, adjusted operating income was $1.60 billion in 2019 and $1.84 billion in 2018. As a percentage of net sales, adjusted operating income margin decreased to 6.8% in 2019 from 8.1% in the prior year.\n\nNet income was $827.0 million in fiscal 2019 and GAAP diluted earnings per share were $3.47 compared to a loss of $6.69 per share in the prior year. Excluding the discrete items for 2019 and 2018, adjusted net income for fiscal 2019 was $1.13 billion and adjusted diluted earnings per share was $4.76 for fiscal 2019 compared to $5.42 in fiscal 2018.\n\nCompany Outlook\n\nThe Company’s fiscal 2020 outlook includes an estimated incremental impact of $47 million related to tariffs, with nearly all of it being incurred in the first half of the year. Additionally, the outlook includes an estimated impact of $15 million related to the new clean fuel regulations for ocean shipping. The outlook does not include any potential impact related to the supply chain or other aspects of the Company’s business for the COVID-19 coronavirus.\n\nThe Company estimates consolidated net sales for the first quarter of 2020 will range from $5.89 billion to $5.99 billion, based on a low single-digit increase in same-store sales for the enterprise. Diluted earnings per share for the quarter, including tariff costs, are estimated to be in the range of $1.00 to $1.09.\n\nConsolidated net sales for full-year fiscal 2020 are expected to range from $24.21 billion to $24.66 billion. This estimate is based on a low single-digit increase in same-store sales and approximately 3.1% selling square footage growth. Diluted earnings per share are expected to range from $4.80 to $5.15. While share repurchases are not included in the outlook, the Company currently has $800 million remaining under its board repurchase authorization.\n\n“As we enter 2020, our teams are aligned, energized and focused. Plans for the year include approximately 1,250 Family Dollar H2 renovations, the launch of Dollar Tree Plus! 2.0 initiative, and a focus on driving sales, improving gross margin and managing costs effectively,” Philbin added. “While our first quarter outlook includes expected pressure from the incremental tariffs and promotional activity, we believe we are well-positioned to deliver improved sales, operating margin and earnings in the following three quarters and for full-year fiscal 2020. We are focused on growing and improving our business to deliver long-term value to our shareholders.”\n\nConference Call Information\n\nOn Wednesday, March 4, 2020, the Company will host a conference call to discuss its earnings results at 9:00 a.m. Eastern Time. The telephone number for the call is 800-367-2403. A recorded version of the call will be available until midnight Tuesday, March 10, 2020, and may be accessed by dialing 888-203-1112. The access code is 8921588. A webcast of the call is accessible through Dollar Tree's website and will remain online through Tuesday, March 10, 2020.\n\nDollar Tree, a Fortune 200 Company, operated 15,288 stores across 48 states and five Canadian provinces as of February 1, 2020. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\n\nA WARNING ABOUT FORWARD-LOOKING STATEMENTS: Our press release contains \"forward-looking statements\" as that term is used in the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they address future events, developments or results and do not relate strictly to historical facts. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements include, without limitation, statements preceded by, followed by or including words such as “believe, anticipate, expect, intend, plan, view, target or estimate, may, will, should, predict, possible, potential, continue, or strategy,” and similar expressions. For example, our forward-looking statements include statements regarding first quarter 2020 and full-year fiscal 2020 results of operations, including consolidated net sales, same-store sales, diluted earnings per share and the estimated impact of tariffs and new clean fuel regulations; our expected square footage growth in fiscal 2020; our plans concerning fiscal 2020 Family Dollar H2 renovations and the launch of Dollar Tree Plus! 2.0; the impact of the COVID-19 coronavirus on our supply chain and fiscal 2020 outlook; our plans and expectations regarding improvements in fiscal 2020 sales, gross margin and managing costs; and our other plans, objectives, expectations (financial and otherwise) and intentions. These statements are subject to risks and uncertainties. For a discussion of the risks, uncertainties and assumptions that could affect our future events, developments or results, you should carefully review the \"Risk Factors,\" \"Business\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections in our Annual Report on Form 10-K filed March 27, 2019, and other filings with the Securities and Exchange Commission. We are not obligated to release publicly any revisions to any forward-looking statements contained in this press release to reflect events or circumstances occurring after the date of this report and you should not expect us to do so.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005373/en/\nDollar Tree, Inc.\nRandy Guiler, 757-321-5284\nVice President, Investor Relations\nwww.DollarTree.com\nDLTR-E\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Dollar Tree, Inc. to Host Fourth Quarter Earnings Conference Call",
        "subtitle": "",
        "date": "Feb 19, 2020 7:30AM EST",
        "content": "    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America's leading operator of discount variety stores, will host its conference call for investors and analysts to discuss financial results for the fourth quarter ended February 1, 2020.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005072/en/\nDollar Tree, Inc., Chesapeake\nRandy Guiler\n757-321-5284\nwww.DollarTree.com\nDLTR-E\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Dollar Tree Comments on TRC Capital “Mini-Tender” Offer",
        "subtitle": "",
        "date": "Dec 27, 2019 4:25PM EST",
        "content": "    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America’s leading operator of discount variety stores, has been notified that TRC Capital Investment Corporation (TRC) has made an unsolicited “mini-tender” offer to purchase up to 1,500,000 shares of Dollar Tree stock at $89.88 per share, or 4.44 percent below the closing share price of Dollar Tree stock on the last trading day before the date of the offer. The TRC offer price is also 3.19% below the closing trading price of Dollar Tree stock today.\n\nDollar Tree is in no way associated with TRC, and expresses no opinion and is remaining neutral toward TRC’s offer.\n\nMini-tender offers seek to acquire less than five percent of a company's outstanding shares, thereby avoiding many disclosure and procedural requirements under U.S. federal securities laws and the rules and regulations of the U.S. Securities and Exchange Commission (SEC). As a result, mini-tender offers do not provide investors with the same level of protections as provided by larger tender offers under the U.S. federal securities laws.\n\nOn its website, the SEC advises that the people behind these offers “frequently use mini-tender offers to catch shareholders off guard” and that investors “may end up selling at below-market prices.” The SEC's tips for investors regarding mini-tender offers may be found at http://www.sec.gov/investor/pubs/minitend.htm.\n\nPlease be aware that shareholders are not required to respond to TRC’s offer. If considering the offer, shareholders should obtain current stock quotes for their shares of Dollar Tree, consult their financial advisors, and exercise caution with respect to TRC’s offer. The offer is set to expire at 12:01 a.m., New York City time, on January 24, 2020, but TRC may extend the offer or terminate it before the expiration date.\n\nDollar Tree encourages broker-dealers and other market participants in the dissemination of the offer to review the SEC's recommendations to broker-dealers in these circumstances, which can be found on the SEC website at http://www.sec.gov/divisions/marketreg/minitenders/sia072401.htm. Dollar Tree requests that a copy of this news release be included with all distribution of materials related to TRC’s offer for shares of Dollar Tree common stock.\n\nAbout Dollar Tree, Inc.\n\nDollar Tree, a Fortune 200 Company, operated 15,262 stores across 48 states and five Canadian provinces as of November 2, 2019. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\n\nA WARNING ABOUT FORWARD-LOOKING STATEMENTS: Our press release contains “forward-looking statements” as that term is used in the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they address future events, developments or results and do not relate strictly to historical facts. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements include, without limitation, statements preceded by, followed by or including words such as “believe,” “anticipate,” “expect,” “intend,” “plan,” “view,” “target” or “estimate,” “may,” “will,” “should,” “predict,” “possible,” “potential,” “continue,” “strategy,” and similar expressions. For example, our forward-looking statements include statements regarding the purpose, terms and effect of the mini-tender offer by TRC, including without limitation our expectations regarding the percentage of the company’s shares to be purchased in the offer, the reduced protection of the federal securities laws relating to mini-tenders, the price to be paid to shareholders who tender their shares pursuant to the offer, the expiration date of the tender offer and the potential for TRC to extend the offer past the expiration date. These statements are subject to risks and uncertainties. For a discussion of the risks, uncertainties and assumptions that could affect our future events, developments or results, you should carefully review the “Risk Factors,” “Business” and “Management's Discussion and Analysis of Financial Condition and Results of Operations” sections in our Annual Report on Form 10-K filed March 27, 2019, and other filings with the Securities and Exchange Commission. We are not obligated to release publicly any revisions to any forward-looking statements contained in this press release to reflect events or circumstances occurring after the date of this report and you should not expect us to do so.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191227005282/en/\nDollar Tree, Inc.\nRandy Guiler, 757-321-5284\nVice President, Investor Relations\nwww.DollarTree.com\nDLTR-G\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Dollar Tree, Inc. Announces Enterprise-Level Organizational Leadership Changes",
        "subtitle": "",
        "date": "Dec 11, 2019 8:00AM EST",
        "content": "\n~ Changes Will Increase Focus and Accountability for Performance Across Dollar Tree and Family Dollar Segments; Improve Value for Shareholders and Customers ~\n    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America’s leading operator of discount variety stores, today announced changes to its organizational structure and leadership team designed to enhance the Company’s execution of its strategy and improve operational performance at its Dollar Tree and Family Dollar business segments. These changes, effective immediately, follow the recently completed consolidation of the organization’s two store support centers to the Company’s corporate office in Chesapeake, Virginia.\n\n“These and other actions we are taking are designed to increase enterprise-wide focus and accountability,” stated Gary Philbin, Chief Executive Officer of Dollar Tree, Inc. “With Mike, Rick and Tom, we will have our senior-most talent working together across the platform with more urgency to move the needle on metrics that will help us deliver greater value for our shareholders and customers.”\n\nPhilbin added, “Mike Witynski has been a key executive in driving performance across the organization. In particular, Mike has led the Store Excellence operational initiatives and merchandising programs to drive sales and margin, and has been hands-on in managing our tariff mitigation efforts the past eighteen months. His promotion to Enterprise President will continue our progression of elevating our customer-facing efforts in merchandising and operations.”\n\nMike Witynski, President of Dollar Tree, Inc., stated, “The reorganization enhances our ability to accelerate the timetable for implementing initiatives designed to improve margins and reduce costs for the Dollar Tree and Family Dollar segments.”\n\nAdditionally, Duncan Mac Naughton, President of Family Dollar, is leaving the Company.\n\n“On behalf of our Company, I want to thank Duncan for his efforts in leading the Family Dollar team,” said Philbin. “We wish him the best in his future endeavors.”\n\nAbout Michael A. Witynski\n\nMike Witynski, age 56, has been President and Chief Operating Officer of Dollar Tree Stores since June 2017. He previously served as Chief Operating Officer from July 2015 to June 2017, and as Senior Vice President of Stores from August 2010 to July 2015. Prior to joining Dollar Tree, Mr. Witynski was President of Shaw’s Supermarkets, and held senior leadership roles in Merchandising, Marketing, Private Brands and Operations at Supervalu, Inc. during his 29-year career in the grocery industry.\n\nAbout Richard L. McNeely\n\nRick McNeely, age 60, has been Chief Merchandising Officer of Dollar Tree Stores since May 2017. He previously served as Senior Vice President of Merchandising from April 2008 to May 2017. Prior to joining Dollar Tree, Mr. McNeely spent the first 28 years of his retail career in roles increasing responsibility within merchandising, marketing, global sourcing, and store operations with several retail companies, including Dollar General, Rose’s Stores and Fred’s, Inc.\n\nAbout Thomas R. O’Boyle, Jr.\n\nTom O’Boyle, age 50, has served as Chief Operating Officer of Family Dollar since October 2017. He is a broad-based retail executive with substantial leadership experience, supplemented with functional experience in operations, merchandising, marketing, supply chain and logistics. Prior to joining Family Dollar, Mr. O’Boyle served as Chief Executive Officer of Marsh Supermarkets for five years and prior to that time served as President of the Food, Drug and Pharmacy business at Sears/Kmart. Mr. O’Boyle spent the first 22 years of his career in leadership positions at Albertsons/American Stores (Jewel-Osco).\n\nAbout Dollar Tree, Inc.\n\nDollar Tree, a Fortune 200 Company, operated 15,262 stores across 48 states and five Canadian provinces as of November 2, 2019. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\n\nA WARNING ABOUT FORWARD-LOOKING STATEMENTS\n\nOur press release contains \"forward-looking statements\" as that term is used in the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they address future events, developments or results and do not relate strictly to historical facts. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements include, without limitation, statements preceded by, followed by or including words such as “believe,” “anticipate,” “expect,” “intend,” “plan,” “view,” “target” or “estimate,” “may,” “will,” “should,” “predict,” “possible,” “potential,” “continue,” “strategy,” and similar expressions. For example, our forward-looking statements include statements regarding our future financial and operational performance and consequences of the management and organizational changes. For a discussion of the risks, uncertainties and assumptions that could affect our future events, developments or results, you should carefully review the \"Risk Factors,\" \"Business\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections in our Annual Report on Form 10-K filed March 27, 2019, and other filings with the Securities and Exchange Commission. We are not obligated to release publicly any revisions to any forward-looking statements contained in this press release to reflect events or circumstances occurring after the date of this release and you should not expect us to do so.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005247/en/\nDollar Tree, Inc.\nRandy Guiler, 757-321-5284\nVice President, Investor Relations www.DollarTree.com\nDLTR - G\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Dollar Tree, Inc. Reports Results for the Third Quarter Fiscal 2019",
        "subtitle": "",
        "date": "Nov 26, 2019 7:30AM EST",
        "content": "\n~ Consolidated Net Sales Increased 3.7% to $5.75 Billion ~\n~ Earnings per Diluted Share of $1.08 vs. Guidance Range of $1.07 to $1.16 ~\n~ Enterprise Same-Store Sales Increased 2.5% ~\n~ Same-Store Sales by Segment: Dollar Tree +2.8%, Family Dollar +2.3% ~\n~ Planning for 1,000+ Fiscal 2020 Family Dollar H2 Renovation Projects ~\n    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America's leading operator of discount variety stores, today reported financial results for the quarter ended November 2, 2019.\n\n“The third quarter represented another period of solid sales performance for both brands, Dollar Tree and Family Dollar. Our store optimization efforts and sales driving initiatives are working. The teams have completed more than 1,150 Family Dollar H2 renovations, nearly 200 Dollar Tree re-banners, more than 1,000 Dollar Tree Snack Zones and launched our Dollar Tree Plus! test already this year,” stated Gary Philbin, President and Chief Executive Officer. “Fiscal 2019 has been a unique year as the result of several factors: the material acceleration in our Family Dollar store optimization initiatives, the consolidation of our two store support centers into southeast Virginia, the global helium shortage, and the continued uncertainty regarding trade and the related tariffs. I am proud of our team’s efforts and the sales execution through this environment.”\n\nThird Quarter Results\n\nConsolidated net sales increased 3.7% to $5.75 billion from $5.54 billion in the prior year’s third quarter. Enterprise same-store sales increased 2.5%. Same-store sales for the Dollar Tree segment increased 2.8%. Same-store sales for the Family Dollar segment increased 2.3%. The comparable store sales results at both segments were driven by increases in both average ticket and transaction count.\n\nGross profit increased by $32.6 million to $1.70 billion in the quarter compared to the prior year’s third quarter. As a percentage of net sales, gross margin was 29.7% compared to 30.2% in the prior year. The decrease in gross profit margin was driven by higher freight and distribution costs, higher sales of lower margin consumable merchandise primarily in the Family Dollar segment, and shrink.\n\nSelling, general and administrative expenses were 23.5% of net sales compared to 23.2% of net sales in the prior year's third quarter. The increase was driven primarily by operating and corporate expenses related to the consolidation of the Company’s store support centers, costs related to asset disposals for closed stores, and slightly higher depreciation expense, partially offset by lower payroll and benefits expenses.\n\nOperating income for the quarter was $358.4 million compared with $387.8 million in the same period last year and operating income margin was 6.2% of net sales in the third quarter compared to 7.0% of net sales in last year’s quarter.\n\nNet income was $255.8 million in the third quarter and diluted earnings per share for the quarter were $1.08 compared to $1.18 in the prior year’s quarter.\n\nThe Company repurchased 125,048 shares during the quarter for $11.6 million. The Company has $800 million remaining on its share repurchase authorization.\n\nDuring the quarter, the Company opened 165 new stores, expanded or relocated 15 stores, and closed 42 stores. Additionally, the Company opened 39 Dollar Tree stores that were re-bannered from Family Dollar and completed 247 renovations to the Family Dollar H2 format. Retail selling square footage at quarter end was approximately 121.0 million square feet.\n\nFirst Nine Months Results\n\nConsolidated net sales increased 4.1% to $17.30 billion from $16.62 billion in the same period last year. Enterprise same-store sales increased 2.4% on a constant currency basis (or 2.3% when adjusted to include the impact of Canadian currency fluctuations). Same-store sales for the Dollar Tree segment increased 2.6% (or 2.5% when adjusted to include the impact of Canadian currency fluctuations). Same-store sales for Family Dollar increased 2.1%.\n\nGross profit for the first nine months increased $44.8 million to $5.08 billion. As a percentage of net sales, gross margin was 29.4%, compared to 30.3% in the prior year period.\n\nSelling, general and administrative expenses were 23.5% of net sales compared to 23.0% of net sales for the first nine months of 2018.\n\nOperating income for the period was $1.01 billion. As a percentage of net sales, operating income margin decreased to 5.9% in the current year period from 7.3% in the prior year.\n\nNet income compared to the prior year's period decreased 1.7% to $704.0 million and diluted earnings per share decreased 1.7% to $2.95 compared to $3.00 in the prior year’s period.\n\nCompany Outlook\n\nJust prior to the Company’s previous quarterly earnings announcement on August 29, 2019, the United States Trade Representative (USTR) announced that tariffs on List 1, 2, and 3 products would increase from 25% to 30% on October 1, 2019, tariffs on List 4A products would increase from 10% to 15% on September 1, 2019, and tariffs on List 4B products would increase from 10% to 15% on December 15, 2019. As noted in its August 29, 2019 earnings announcement, the outlook provided at that time did not include any impact related to these changes.\n\nThe Company now estimates that Section 301 tariffs will increase its cost of goods sold by approximately $19 million, or $0.06 per diluted share, in the fourth quarter of 2019 if tariffs are fully implemented.\n\nThe Company estimates consolidated net sales for the fourth quarter of 2019 will range from $6.33 billion to $6.44 billion, based on a low single-digit increase in same-store sales for the enterprise. Diluted earnings per share for the quarter, including tariff costs, are estimated to be in the range of $1.70 to $1.80.\n\nThe decrease from prior implied fourth quarter guidance represents the expected effects of: Section 301 tariffs; additional pressure on merchandise margin based on lower-margin consumables growing faster than originally forecasted; payroll cost pressure in distribution centers; and increased run rates for repairs and maintenance, utilities and depreciation.\n\nConsolidated net sales for full-year fiscal 2019 are now expected to range from $23.62 billion to $23.74 billion compared to the Company’s previously expected range of $23.57 billion to $23.79 billion. This estimate is based on a low single-digit increase in same-store sales and 1.1% selling square footage growth. The Company now anticipates diluted earnings per share for full-year fiscal 2019 will range between $4.66 and $4.76. This includes discrete costs of approximately $85 million, or $0.28 per diluted share, approximately $15 million, or $0.05 per diluted share, in store closure related costs, and approximately $19 million, or $0.06 per diluted share, from tariffs.\n\n“The value and convenience offered by Dollar Tree and Family Dollar continue to resonate with our shoppers, as demonstrated by the Company’s sales performance in the first three quarters of fiscal 2019,” Philbin added. “With several critical initiatives now behind us, including the acceleration in store optimization initiatives and the consolidation of our store support centers, we are planning for more than 1,000 Family Dollar H2 renovations for fiscal 2020 and are increasing our focus on operating margin performance. Our teams are well prepared for the holiday season and closing out an important year for our Company. We believe we have built a strong foundation to enhance our ability to grow and improve our business to deliver long-term value to our shareholders.”\n\nConference Call Information\n\nOn Tuesday, November 26, 2019, the Company will host a conference call to discuss its earnings results at 9:00 a.m. Eastern Time. The telephone number for the call is 866-575-6539. A recorded version of the call will be available until midnight Monday, December 2, 2019, and may be accessed by dialing 888-203-1112. The access code is 8107336. A webcast of the call is accessible through Dollar Tree's website and will remain online through Monday, December 2, 2019.\n\nDollar Tree, a Fortune 200 Company, operated 15,262 stores across 48 states and five Canadian provinces as of November 2, 2019. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\n\nA WARNING ABOUT FORWARD-LOOKING STATEMENTS: Our press release contains \"forward-looking statements\" as that term is used in the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they address future events, developments or results and do not relate strictly to historical facts. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements include, without limitation, statements preceded by, followed by or including words such as “believe,” “anticipate,” “expect,” “intend,” “plan,” “view,” “target” or “estimate,” “may,” “will,” “should,” “predict,” “possible,” “potential,” “continue,” “strategy,” and similar expressions. For example, our forward-looking statements include statements regarding fourth quarter 2019 and full-year fiscal 2019 results of operations, including consolidated net sales, same-store sales and diluted earnings per share; our expected square footage growth in fiscal 2019; our expectations regarding operating and merchandise margin performance; the continued uncertainty and impact relating to trade and related tariffs and the global helium shortage; distribution costs; the increased run rates for certain costs; our preparations for the holiday season and fourth quarter 2019; expectations concerning fiscal 2020 Family Dollar H2 renovations; and our other plans, objectives, expectations (financial and otherwise) and intentions. These statements are subject to risks and uncertainties. For a discussion of the risks, uncertainties and assumptions that could affect our future events, developments or results, you should carefully review the \"Risk Factors,\" \"Business\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections in our Annual Report on Form 10-K filed March 27, 2019, and other filings with the Securities and Exchange Commission. We are not obligated to release publicly any revisions to any forward-looking statements contained in this press release to reflect events or circumstances occurring after the date of this report and you should not expect us to do so.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005248/en/\nDollar Tree, Inc.\nRandy Guiler, 757-321-5284\nVice President, Investor Relations\nwww.DollarTree.com\nDLTR-E\nSource: Dollar Tree, Inc."
    },
    {
        "title": "SHAREHOLDER NOTICE: Scott+Scott Attorneys at Law LLP Investigating Dollar Tree, Inc.'s Directors and Officers for Breach of Fiduciary Duties - DLTR",
        "subtitle": "",
        "date": "Nov 25, 2019 3:30PM EST",
        "content": "NEW YORK, Nov. 25, 2019 /PRNewswire/ -- Scott+Scott Attorneys at Law LLP (\"Scott+Scott\"), an international securities and consumer rights litigation firm, is investigating certain directors and officers of Dollar Tree, Inc. (\"Dollar Tree\") (NASDAQ: DLTR) for breaching their fiduciary duties to Dollar Tree and its shareholders.  If you are a Dollar Tree shareholder, you may contact attorney Joe Pettigrew for additional information toll-free at 844-818-6982 or jpettigrew@scott-scott.com.Scott+Scott is investigating whether members of Dollar Tree's board of directors caused or allowed Dollar Tree to operate in an unlawful or otherwise improper fashion, causing damage to Dollar Tree and its shareholders.On August 26, 2019, the New York Attorney General announced that Dollar Tree subsidiaries would pay $100,000 in fines and damages for selling expired over-the-counter (\"OTC\") drugs and for failure to comply with New York's bottle deposit law.On November 14, 2019, the U.S. Food and Drug Administration (\"FDA\") announced that it had issued a warning letter to Greenbrier International, Inc., doing business as Dollar Tree, for receiving OTC drugs produced by foreign manufacturers found to have serious violations of federal law.  The warning letter details Dollar Tree's receipt of adulterated drugs from manufacturers that received FDA warning letters in 2018.  The warning letters also detail Dollar Tree's use of contract manufacturers that also received warning letters for similar issues between 2016 and 2019.  The FDA notified Dollar Tree of warning letters sent to these manufacturers at the time the warning letters were sent.  According to the FDA, the warning letters sent to the contract manufacturers used by Dollar Tree \"show a pattern of serious violations of the law.\"What You Can DoIf you are a Dollar Tree shareholder, you may have legal claims against Dollar Tree's directors and officers.  If you wish to discuss this investigation, or have questions about this notice or your legal rights, please contact attorney Joe Pettigrew toll-free at 844-818-6982 or jpettigrew@scott-scott.com.  About Scott+ScottScott+Scott has significant experience in prosecuting major securities, antitrust, and consumer rights actions throughout the United States.  The firm represents pension funds, foundations, individuals, and other entities worldwide with offices in New York, London, Amsterdam, Connecticut, California, and Ohio.Attorney AdvertisingCONTACT:Joe PettigrewScott+Scott Attorneys at Law LLP230 Park Avenue, 17th Floor, New York, NY 10169844-818-6982jpettigrew@scott-scott.com View original content:http://www.prnewswire.com/news-releases/shareholder-notice-scottscott-attorneys-at-law-llp-investigating-dollar-tree-incs-directors-and-officers-for-breach-of-fiduciary-duties--dltr-300964809.htmlSOURCE  Scott+Scott Attorneys at Law LLP"
    },
    {
        "title": "Dollar Tree Director Conrad M. Hall to Retire at 2020 Annual Meeting",
        "subtitle": "",
        "date": "Nov 19, 2019 7:30AM EST",
        "content": "    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America’s leading operator of discount variety stores, today announced that long-time director Conrad M. Hall intends to retire at the 2020 Annual Meeting of Shareholders. Serving as an independent director since January 2010, Mr. Hall’s experience as a former Chief Executive Officer and his demonstrated success in new business development have been integral to Dollar Tree’s board. During Mr. Hall’s tenure, the Company’s retail store base has more than tripled in size, from 4,100 to nearly 15,300 stores; annual revenues have grown nearly fourfold from $5.9 billion to a projected $23 billion-plus in fiscal 2019; and the Company’s share price has increased more than 550%.\n\n“Conrad Hall’s contributions have been instrumental to Dollar Tree’s success over the past decade. On behalf of the entire board, I want to thank Conrad for his valued service and tireless efforts to best serve the interests of all Dollar Tree shareholders. We wish Conrad all of the best in his retirement,” stated Bob Sasser, Dollar Tree’s Executive Chairman. “As we move forward, we will continue to identify director candidates who can add fresh, diverse perspectives and bring relevant experience and skillsets that will increase our effectiveness and enhance alignment with our shareholders and other stakeholders.”\n\nNoting that Dollar Tree has added five new highly qualified independent directors to its 13-member board since 2016, Sasser added, “Regular refreshment of our board, strengthened diversity and adherence to best governance practices continue to be priorities for us.”\n\nAs outlined in the most recent proxy, the Company seeks to balance the benefits of gaining fresh perspectives, adding relevant skillsets and optimizing average director tenure with the importance of leveraging institutional and industry knowledge of the Company’s seasoned directors. To balance the substantial number of new directors recently added with risks of losing too many experienced directors in a compressed timeframe, the Board has adopted a waterfall strategy: a steady, measured approach to director retirements. Beginning in 2020, as newer board members continue to gain needed experience, the Company expects to engage thoughtfully in additional Board refreshment and director departures. The goal is to reach and maintain a relatively balanced mix of short, medium and long-term tenured directors. Today’s announcement of Mr. Hall’s planned retirement from the Board and anticipated addition of a new director further demonstrates the Company’s governance strategies.\n\nAbout Dollar Tree, Inc.\n\nDollar Tree, a Fortune 200 Company, operates more than 15,000 stores across 48 states and five Canadian provinces. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\n\nA WARNING ABOUT FORWARD-LOOKING STATEMENTS: Our press release contains \"forward-looking statements\" as that term is used in the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they address future events, developments or results and do not relate strictly to historical facts. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements include, without limitation, statements preceded by, followed by or including words such as “believe,” “anticipate,” “expect,” “intend,” “plan,” “view,” “target” or “estimate,” “may,” “will,” “should,” “predict,” “possible,” “potential,” “continue,” “strategy,” and similar expressions. For example, our forward-looking statements include statements regarding our board refreshment policies and process, the timing and criteria for selection of new directors, board diversity and director tenure. These statements are subject to risks and uncertainties. For a discussion of the risks, uncertainties and assumptions that could affect our future events, developments or results, you should carefully review the \"Risk Factors,\" \"Business\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections in our Annual Report on Form 10-K filed March 27, 2019, and other filings with the Securities and Exchange Commission. We are not obligated to release publicly any revisions to any forward-looking statements contained in this press release to reflect events or circumstances occurring after the date of this release and you should not expect us to do so.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191119005141/en/\nDollar Tree, Inc.\nRandy Guiler, 757-321-5284\nVice President, Investor Relations\nwww.DollarTree.com\nDLTR - G\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Dollar Tree, Inc. to Host Third Quarter Earnings Conference Call",
        "subtitle": "",
        "date": "Nov 12, 2019 7:30AM EST",
        "content": "    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America's leading operator of discount variety stores, will host its conference call for investors and analysts to discuss financial results for the third quarter ended November 2, 2019.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191112005184/en/\nDollar Tree, Inc., Chesapeake\nRandy Guiler\n757-321-5284\nwww.DollarTree.com\nDLTR-E\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Operation Homefront and Dollar Tree to Make the Holiday Season Brighter for Military Children",
        "subtitle": "",
        "date": "Nov 1, 2019 7:30AM EDT",
        "content": "\nDollar Tree and its customers will help bring holiday joy to thousands of military kids through Operation Homefront’s Holiday Toy Drive\n    SAN ANTONIO, Texas--(BUSINESS WIRE)--\nOperation Homefront, the national nonprofit that serves America’s military families, and Dollar Tree Inc. will once again join forces to make the holidays brighter for our military families with the nonprofit’s annual Holiday Toy Drive. For the 13th consecutive year, Dollar Tree customers can purchase toys for military children, easing the financial burdens that often accompany the holiday season for junior- and mid-grade (E1-E6) service members and their families.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191101005006/en/\nDollar Tree stores will have collection boxes available at checkout in which shoppers can place their purchased toys through December 5. The toys will be collected by Operation Homefront volunteers and distributed at the nonprofit’s holiday events across the country and through on-base Family Readiness Groups. Making the season brighter for military families is what this partnership is all about, and Dollar Tree and its generous customers have made that joy possible since 2006.\n\n“Dollar Tree is very proud to partner with Operation Homefront to help serve military families through their annual Holiday Toy Drive program,” said Chelle Davis, Dollar Tree spokesperson. “Supporting our nation’s military families is a high priority for Dollar Tree and we would like to thank our generous customers who help us make the holidays a little brighter for military families across the country.\"\n\n“We are absolutely thrilled to have the continued support of Dollar Tree and their caring customers for our Holiday Toy Drive program again this year,” said Brig. Gen. (ret.) John I. Pray Jr., president & CEO of Operation Homefront. “Our work together over the past 13 years clearly demonstrates our collective appreciation for all our military families do for all of us, and how we can help give this very special and deserving group of our fellow Americans an opportunity to thrive in the communities they have worked so hard to protect.”\n\nOperationHomefront.org/HolidayToys has information about how to volunteer, sponsor, and donate toys or to register to receive toys at a distribution event.\n\nAbout Dollar Tree: Dollar Tree, a Fortune 200 Company, operates more than 15,000 stores across 48 states and five Canadian provinces. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\n\nAbout Operation Homefront: Founded in 2002, Operation Homefront is a national nonprofit organization whose mission is to build strong, stable, and secure military families so that they can thrive – not simply struggle to get by – in the communities they have worked so hard to protect. Recognized for superior performance by leading independent charity oversight groups, 92 percent of Operation Homefront expenditures go directly to programs that support tens of thousands of military families each year. Operation Homefront provides critical financial assistance, transitional and permanent housing and family support services to prevent short-term needs from turning into chronic, long-term struggles. Thanks to the generosity of our donors and the support from thousands of volunteers, Operation Homefront proudly serves America’s military families. For more information, visit OperationHomefront.org.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191101005006/en/\nMedia Inquiries:\nDollar Tree, Inc.\nChelle Davis\ncdavis@dollartree.com\nDLTR-G\n\nOperation Homefront\nMike Lahrman, Public Relations Manager\nMichael.Lahrman@operationhomefront.org\n(210) 202-1243\nSource: Operation Homefront and Dollar Tree, Inc."
    },
    {
        "title": "Summit Pointe Realty, LLC Announces Topping Out Ceremony for Phase Two Development at Summit Pointe",
        "subtitle": "",
        "date": "Oct 23, 2019 3:30PM EDT",
        "content": "CHESAPEAKE, Va., Oct. 23, 2019 /PRNewswire/ -- Summit Pointe Realty, LLC hosted a ceremonial topping out event on Wednesday, October 23, 2019, to celebrate the completion of the steel erection for the new Block Two office tower, 555 Belaire, located on Belaire Avenue at Summit Pointe.In attendance were Executive Chairman of Dollar Tree, Inc. (NASDAQ: DLTR) Bob Sasser, Senior Vice President of Portfolio Management of Dollar Tree Chris Williams, Corporate Counsel - Real Estate of Dollar Tree Christian Chiles, Vice President of Facilities & Special Projects of Dollar Tree Bob Gantt, SCA Architects Partner Burrell Saunders, Chesapeake Mayor Rick West, Chesapeake City Manager James Baker, Chesapeake EDA Assistant Director Ben White, Senior Project Manager of Clancy & Theys Construction Company Chad Cowger, Vice President & CEO, Virginia Division of Clancy & Theys Construction Company Bill Goggins, SCA Architects Project Manager Andy Raffin, and dignitaries from Colliers International.The topping out ceremony began with project leaders signing a steel beam used in the construction of Summit Pointe's newest office tower, 555 Belaire. This new office tower will contain ground-level retail and restaurant space, with five floors of Class A+ office space available for lease above.Bob Sasser opened the event with remarks about the construction progress, stating, \"The completion of the second office building will bring new opportunities to the Greenbrier Community as leading employers have an opportunity to locate their businesses in Summit Pointe.\"Mayor Rick West thanked the development team, saying \"The opportunities that Summit Pointe is bringing to Chesapeake will benefit our citizens not only with a new destination for upscale shopping and lifestyle amenities but also with additional tax revenue and infrastructure to support our growing community.\"Construction on the 555 Belaire office building, as well as on Helix, the first of three apartment communities to be constructed at Summit Pointe, is scheduled to be completed in mid-2020. The construction of a second living community, Mosaic, will be completed in 2021, and construction on more retail locations and office spaces will begin following the completion of Phase Two. Both 555 Belaire and Helix will feature access to unparalleled amenities and stunning views along Belaire Avenue.Located in the dynamic Greenbrier area of Chesapeake, VA, Summit Pointe is the newest large-scale, mixed-use community centrally located within Coastal Virginia. Summit Pointe has already become a premier office location with the 2018 completion of the 510,000-square-foot, high-rise office tower for Dollar Tree in Phase One.Phase Two of development represents an investment of roughly $150 million to $175 million of this $300 million mixed-use development. Summit Pointe is presently zoned to develop one million square feet of office space, more than 1,400 residences, up to 500,000 square feet of retail space, and approximately 250,000 square feet of hospitality and conference space.Contact:Summit Pointe Realty, LLCinfo@SummitPointeVA.comAbout Summit Pointe Realty, LLCSummit Pointe Realty, LLC oversees the planning, development and leasing operations atSummit Pointe in Chesapeake, Virginia.VISIT SUMMIT POINTE WEBSITE:SummitPointeVA.comClick here for a photo gallery. View original content:http://www.prnewswire.com/news-releases/summit-pointe-realty-llc-announces-topping-out-ceremony-for-phase-two-development-at-summit-pointe-300943936.htmlSOURCE  Summit Pointe Realty, LLC"
    },
    {
        "title": "Dollar Tree & Family Dollar to Hire More Than 25,000 Associates in Nationwide Hiring Event on October 16",
        "subtitle": "",
        "date": "Oct 9, 2019 7:30AM EDT",
        "content": "    CHESAPEAKE, Va.--(BUSINESS WIRE)--\nDollar Tree, Inc. (NASDAQ: DLTR), North America’s leading operator of discount variety stores, plans to hire more than 25,000 associates in its fourth annual Nationwide Hiring Event hosted at Dollar Tree and Family Dollar stores across the country on Wednesday, October 16.\n\n“As we prepare for the busy holiday season, we are excited to bring aboard more associates to provide exceptional service to help customers find great values in our more than 15,000 convenient store locations,” stated Betty Click, Chief Human Resources Officer. “The continued growth of the Dollar Tree and Family Dollar brands is only possible through our talented and industry-leading teams. There are numerous opportunities for career growth in the organization with more than 35,000 associates promoted into new positions within the past year.”\n\nInterviews will be conducted at every U.S. store location from 9:00 AM to 6:00 PM local time. The Company is looking to fill permanent full-time and part-time openings in the roles of store managers, assistant store managers, cashiers and stocking associates, as well as seasonal holiday help.\n\nAs a growth company with more than 15,000 stores across North America, and plans to open hundreds of stores annually, now is an exciting time to join the Dollar Tree and Family Dollar team. Along with a total rewards package, the Company continues its commitment to ongoing training and talent development.\n\nInterested applicants are encouraged to visit a Dollar Tree or Family Dollar store during the one-day event or can apply online at www.DollarTree.com/careers and www.FamilyDollar.com/careers.\n\nAbout Dollar Tree, Inc.\n\nDollar Tree, a Fortune 200 Company, operated 15,115 stores across 48 states and five Canadian provinces as of August 3, 2019. Stores operate under the brands of Dollar Tree, Family Dollar, and Dollar Tree Canada. To learn more about the Company, visit www.DollarTree.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191009005353/en/\nDollar Tree, Inc.\nKayleigh M. Painter, 757-321-5114\nManager, Investor & Media Relations\nwww.DollarTree.com\nDLTR - G\nSource: Dollar Tree, Inc."
    },
    {
        "title": "Thinking about buying stock in Burlington Stores, Canopy Growth, Dollar Tree, Marvell Technology, or Safe-T Group?",
        "subtitle": "",
        "date": "Aug 29, 2019 9:31AM EDT",
        "content": "NEW YORK, Aug. 29, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BURL, CGC, DLTR, MRVL, and SFET.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-burlington-stores-canopy-growth-dollar-tree-marvell-technology-or-safe-t-group-300909124.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Summit Pointe Realty, LLC Announces Groundbreaking Event For Phase Two Development At Summit Pointe",
        "subtitle": "",
        "date": "Jun 5, 2019 9:00AM EDT",
        "content": "CHESAPEAKE, Va., June 5, 2019 /PRNewswire/ -- Summit Pointe Realty, LLC hosted a ceremonial groundbreaking event yesterday for Phase Two construction of the Summit Pointe mixed-use community.In attendance were Executive Chairman of Dollar Tree, Inc. (NASDAQ: DLTR) Bob Sasser, Chesapeake Mayor Rick West, Chesapeake EDA Assistant Director Ben White, Chesapeake City Manager James Baker, Vice President of Portfolio Management of Dollar Tree, Inc. Chris Williams, Corporate Counsel - Real Estate of Dollar Tree, Inc. Christian Chiles, SCA Architects Partner Burrell Saunders, Director Facilities & Special Projects of Dollar Tree, Inc. Bob Gantt and Archway Advisor President Paul Kreckman.The groundbreaking event opened with remarks from Bob Sasser, who spoke about the progress made at Summit Pointe thus far, as well as his vision for the future of the community. Sasser spoke about the development at Summit Pointe, saying \"This is a tremendous opportunity and an exciting time to be part of the Greenbrier Community.\" Summit Pointe has already begun to grow with the completion and occupancy of the Dollar Tree tower and surrounding campus, completed in Phase One of the development.Mayor Rick West also spoke, giving his perspective on the benefits that Summit Pointe will bring to the region. Mayor West discussed the benefits of the community, saying \"the Summit Pointe project has the combined ability to attract new companies, providing new and higher paying jobs, and infusing additional tax revenue to keep pace with world-class cities and infrastructure.\"The event concluded with a groundbreaking on the site of the future Helix apartment community which will feature 133 living units over ground-level retail and restaurant spaces. Across Belaire Avenue work is also underway for the construction of the six-story class A+ office building: 555 Belaire. With the conclusion of this event, construction has officially begun on the first two blocks of Phase Two development at Summit Pointe.Construction on the Helix living community and 555 Belaire office building is scheduled to be completed in early 2020, with construction on other new living communities, retail locations, and office spaces to begin in late 2019. Both new buildings will feature access to unparalleled amenities and stunning views along Belaire Avenue.Summit Pointe is Coastal Virginia's newest urban lifestyle community. Phase Two of development represents an investment of roughly $150 million to $175 million of this $300 million mixed-use development. Summit Pointe is presently zoned to develop one million square feet of office space, more than 1,400 residences, up to 500,000 square feet of retail space, and approximately 250,000 square feet of hospitality and conference space.Contact:Summit Pointe Realty, LLCinfo@SummitPointeVA.comAbout Summit Pointe Realty, LLCSummit Pointe Realty, LLC oversees the planning, development and leasing operations atSummit Pointe in Chesapeake, Virginia.VISIT SUMMIT POINTE WEBSITE:SummitPointeVA.comClick here for a photo gallery View original content:http://www.prnewswire.com/news-releases/summit-pointe-realty-llc-announces-groundbreaking-event-for-phase-two-development-at-summit-pointe-300862262.htmlSOURCE  Summit Pointe Realty, LLC"
    },
    {
        "title": "FinancialBuzz.com: 'Earnings Recap' Week Ending March 8th, 2019",
        "subtitle": "",
        "date": "Mar 8, 2019 9:00AM EST",
        "content": "NEW YORK, March 8, 2019 /PRNewswire/ -- U.S. markets were swayed by the ongoing trade war negotiations this week once again. Markets began the week during Monday's pre-market hours stronger, however, stocks quickly began to plunge throughout the day followed by news regarding the U.S.-China trade wars. Equities were initially up following the news that the U.S. and China were nearing a deal. Despite the optimistic news, investor sentiment was focused elsewhere, causing markets to crash. The consensus regarding the news resulted in a major selloff, causing the Dow Jones Industrial Average to fall by 400 points intraday. Investors argued that the news had already been priced into indexes as the U.S. markets continued the bearish week with investors focused on the ongoing trade war negotiations on Wednesday. The Federal Reserve's Beige Book report also contributed to the weaker markets. The report noted that most central bank districts reported \"slight-to-moderate\" growth in late January and February. On Thursday, the Dow Jones plummeted by as much as 300 points after the European Central bank slashed its growth forecast and pledged monetary support for its economy. The ECB also announced new strategic measures to support the slowing economy, such as long-term loans as the U.S. markets were on track to close in the red for the fourth straight day on Thursday. The Dow Jones Industrial Average fell as much as 715 points or 2.7% this week while the S&P 500 fell by as much as 69 points or 2.5%, and the Nasdaq Composite edged lower by 216 points or 2.8%. NIO Inc. (NYSE:NIO), Dollar Tree, Inc. (NASDAQ:DLTR), Abercrombie & Fitch Co. (NYSE:ANF), The Kroger Co. (NYSE:KR), Costco Wholesale Corporation (NASDAQ:COST)\"It's not about what the ECB is doing,\" said Mike Loewengart, Chief Investment Officer for E*TRADE Capital Management in New York, \"it's what they said about their expectations for growth and, really, it's the about-face from what they said a couple of months ago when they discussed ending their version of quantitative easing. So that's what's really going on. People are resetting their growth expectations and investors are responding accordingly.\" Loewengart said the ECB had announced that it was ending its stimulus \"because they felt they were getting to a pretty good place from a growth perspective - That's not what we heard this morning,\" he continued \"We heard the opposite. And that's why markets are down.\"For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=h6U9xYvqYQ8NIO Inc. (NYSE:NIO) a Chinese electric vehicle manufacturer, reported its fourth quarter financial results after market close on Tuesday. The Company topped revenue estimates, but reported wider-than-expected earnings loss, sending shares 16% lower on Wednesday morning. For the quarter, Nio reported an earnings loss of RMB 3.37 per share or USD 0.49 per share on revenue of RMB 3.43 Billion or USD 499.7 Million. Analysts polled an earnings loss of USD 32 cents per share on revenue of USD 493 Million. In the fourth quarter, Nio produced 8,069 ES8 vehicles, which increased by 91.8% compared to 4,206 in the third quarter. The Company delivered 7,980 in the quarter, increasing by 144.2% from 3,268 in the third quarter.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=h6U9xYvqYQ8Dollar Tree, Inc. (NASDAQ:DLTR) reported its fourth quarter financial results before market open on Wednesday and surpassed estimates, sending shares higher by 5.7% throughout the day. The discount savings retailer reported earnings of USD 1.93 per share on revenue of USD 6.21 Billion. Analysts expected earnings of USD 1.89 per share on revenue of USD 6.2 Billion. Despite the beat, Dollar Tree saw declining sales in the quarter. The same quarter last year, the Company reported revenue of USD 6.36 Billion. However, same-store sales increased by 2.4% year-over-year and also beat estimates of 1.5%.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=h6U9xYvqYQ8Abercrombie & Fitch Co. (NYSE:ANF) reported its fourth quarter financial results on Wednesday morning and surpassed estimates in both earnings and revenue. The better-than-expected results sent Abercrombie's shares surging by 17.7% shortly after the opening bell. For the fourth quarter, Abercrombie reported earnings of USD 1.35 on net sales of USD 1.15 Billion. Analysts expected earnings of USD 1.15 per share on revenue of USD 1.13 Billion.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=h6U9xYvqYQ8The Kroger Co. (NYSE:KR) reported its fourth quarter financial results on Thursday during pre-market hours and missed estimates, which sent sharing plunging by as much as 12%. For the quarter, Kroger reported earnings of USD 48 cents per share on revenue of USD 28.09 Billion. Analysts projected earnings of USD 52 cents per share on revenue of USD 28.38 Billion. Despite the weaker-than-expected revenue, Kroger was more geared towards expanding its digital sales. Within the quarter, digital sales grew by 58% and also the Company expanded its pickup or delivery to reach 91%.For our latest \"Buzz on the Street\" Show featuring \"Earnings Recap\" please visit: https://www.youtube.com/watch?v=h6U9xYvqYQ8Costco Wholesale Corporation (NASDAQ:COST) reported its second quarter financial results after market close on Thursday. The wholesaler reported better-than-expected earnings but missed revenue estimates. Despite the revenue miss, shares gained 4% during aftermarket hours. For the quarter, Costco reported earnings of USD 2.01 per share on revenue of USD 35.4 Billion. Analysts expected earnings of USD 1.30 per share on revenue of USD 36.55 Billion. Costco's revenue rose by 7.3% year-over-year, primarily driven by the adjusted 7.2% increase in comparable sales from the U.S.Subscribe Now! Watch us report LIVE https://www.youtube.com/FinancialBuzzMediaFollow us on Twitter for real time Financial News Updates: https://twitter.com/financialbuzzFollow and talk to us on Instagram: https://www.instagram.com/financialbuzzFacebook Like Us to receive live feeds: https://www.facebook.com/Financialbuzz/About FinancialBuzz.comFinancialBuzz.com, a leading financial news informational web portal designed to provide the latest trends in Market News, Investing News, Personal Finance, Politics, Entertainment, in-depth broadcasts on Stock News, Market Analysis and Company Interviews. A pioneer in the financially driven digital space, video production and integration of social media, FinancialBuzz.com creates 100% unique original content. FinancialBuzz.com also provides financial news PR dissemination, branding, marketing and advertising for third parties for corporate news and original content through our unique media platform that includes Newswire Delivery, Digital Advertising, Social Media Relations, Video Production, Broadcasting, and Financial Publications.Please Note: FinancialBuzz.com is not a financial advisory or advisor, investment advisor or broker-dealer and do not undertake any activities that would require such registration. The information provided on http://www.FinancialBuzz.com (the \"site\") is either original financial news or paid advertisements provided [exclusively] by our affiliates (sponsored content), FinancialBuzz.com, a financial news media and marketing firm enters into media buys or service agreements with the companies which are the subject to the articles posted on the Site or other editorials for advertising such companies. FinancialBuzz.com has not been compensated directly by any of the companies mentioned here in this editorial. We are not an independent news media provider and therefore do not represent or warrant that the information posted on the Site is accurate, unbiased or complete. FinancialBuzz.com receives fees for producing and presenting high quality and sophisticated content on FinancialBuzz.com along with other financial news PR media services. FinancialBuzz.com does not offer any personal opinions or bias commentary as we purely incorporate public market information along with financial and corporate news. FinancialBuzz.com only aggregates or regurgitates financial or corporate news through our unique financial newswire and media platform. For this release, FinancialBuzz.com has not been compensated for financial news dissemination and PR services by any parties. Our fees may be either a flat cash sum or negotiated number of securities of the companies featured on this editorial or site, or a combination thereof. The securities are commonly paid in segments, of which a portion is received upon engagement and the balance is paid on or near the conclusion of the engagement. FinancialBuzz.com will always disclose any compensation in securities or cash payments for financial news PR advertising. FinancialBuzz.com does not undertake to update any of the information on the editorial or Site or continue to post information about any companies the information contained herein is not intended to be used as the basis for investment decisions and should not be considered as investment advice or a recommendation. The information contained herein is not an offer or solicitation to buy, hold or sell any security. FinancialBuzz.com, members and affiliates are not responsible for any gains or losses that result from the opinions expressed on this editorial or Site, company profiles, quotations or in other materials or presentations that it publishes electronically or in print. Investors accept full responsibility for any and all of their investment decisions based on their own independent research and evaluation of their own investment goals, risk tolerance, and financial condition. FinancialBuzz.com. By accessing this editorial and website and any pages thereof, you agree to be bound by the Terms of Use and Privacy Policy, as may be amended from time to time. None of the content issued by FinancialBuzz.com constitutes a recommendation for any investor to purchase, hold or sell any particular security, pursue a particular investment strategy or that any security is suitable for any investor. This publication is provided by FinancialBuzz.com. Each investor is solely responsible for determining whether a particular security or investment strategy is suitable based on their objectives, other securities holdings, financial situation needs, and tax status. You agree to consult with your investment advisor, tax and legal consultant before making any investment decisions. We make no representations as to the completeness, accuracy or timeless of the material provided. All materials are subject to change without notice. Information is obtained from sources believed to be reliable, but its accuracy and completeness are not guaranteed. For our full disclaimer, disclosure and Terms of Use, please visit: http://www.FinancialBuzz.com.For further information:Media Contact:info@financialbuzz.com+1-877-601-1879Url: http://www.FinancialBuzz.com View original content:http://www.prnewswire.com/news-releases/financialbuzzcom-earnings-recap-week-ending-march-8th-2019-300809069.htmlSOURCE FinancialBuzz.com"
    }
]