[
    {
        "title": "Kansas City Chiefs Win Super Bowl LIV Over the San Francisco 49ers in EA Sports Madden NFL 20 Prediction",
        "subtitle": "",
        "date": "Jan 30, 2020 9:00PM EST",
        "content": "\nPatrick Mahomes Gives Record-Breaking Performance to Clinch MVP and Raise the Vince Lombardi Championship Trophy \n\nCheck Out All the Action on the Official Prediction Video Here\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday, Electronic Arts Inc. (NASDAQ: EA) unveiled the official Madden NFL 20 Super Bowl LIV prediction in a whole new way, with Peyton and Eli Manning pushing the button and releasing the prediction details live from EA SPORTS BOWL in Miami. The prediction calls for a Kansas City Chiefs victory and their first Super Bowl title since 1969.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200130005875/en/Electronic Arts 2020 (Graphic: Business Wire)\nJust like the Super Bowl-winning Manning brothers, the scintillating quarterback, Patrick Mahomes, leads his team to defeat the San Francisco 49ers 35 – 31 with an incredible performance. Mahomes is projected to break the record for the most passing touchdowns in a single postseason and cementing his place as Super Bowl LIV MVP.\n\n“It was a great experience to unveil the prediction. We’ll see on Sunday, if the Chiefs will prove Madden right and take home that Super Bowl ring,” said Eli Manning.\n\nThe Madden NFL Super Bowl prediction has a solid track record correctly predicting Super Bowl winners and at times, as it happened with Super Bowl XLIX, the prediction has been scary accurate predicting the winning team, MVP, final score and even who would score the winning touchdown.\n\n“I’m really looking forward to seeing the 49ers and Chiefs play it out on Sunday. Two great teams with two great quarterbacks,” said Peyton Manning. “I’ll be watching to see if Madden’s prediction is right.”\n\nIn the first quarter, the 49ers come out strong, confident and ready to win, scoring the game’s opening touchdown on a 16-yard run from new running back sensation Raheem Mostert and then Robbie Gould hammers a 41-yard field goal. The Chiefs got off to their usual slow start in the first quarter, with no points on the board.\n\nIn the second quarter, the Chiefs come alive unleashing their most powerful weapon – the unstoppable Patrick Mahomes. Mahomes throws two touchdown passes to Tyreek Hill and Damien Williams to grab the lead for the Chiefs. However, the 49ers refuse to back down and score a late second quarter touchdown – with a 26-yard pass from Jimmy Garoppolo, to end the half with a 17-14 lead.\n\nMahomes and the Chiefs refuse to remain silent in the second half, with Damien Williams and Travis Kelce scoring another pair of touchdowns. George Kittle nabs a touchdown for the 49ers, keeping things close in the third quarter – proving no one is safe in this game. The Chiefs lead entering the final quarter, 28-24, but Garoppolo comes in hot throwing another touchdown pass to Raheem Mostert - bringing the score to 31-28.\n\nNot ready to accept defeat, Mahomes drives the Chiefs down the field late in the quarter, pushing the 49ers defense back. Finding Watkins open in the end-zone, Mahomes throws an 18-yard touchdown pass to take a 35-31 lead, seconds before time is up. The Kansas City Chiefs take home the title of Super Bowl LIV champions.\n\nTaking home his first championship ring, Mahomes is named Super Bowl MVP with 392 passing yards, four touchdowns and one interception – pushing him to break the record for the most passing touchdowns in a single postseason. Even in defeat, Jimmy Garoppolo still managed to throw for 254 yards and two touchdowns. Chiefs tight end Travis Kelce led all receivers with 102 yards on 10 receptions, with one touchdown.\n\nMadden NFL 20 is now available for Xbox One, PlayStation®4 and Origin for PC. Starting today, Madden NFL 20 is also now available in The Vault for all EA Access* and Origin Access* members, where players can play whenever they want, as much they want\n\nFor more information on EA SPORTS Madden NFL visit www.easports.com/Madden-NFL. Join the EA SPORTS Madden NFL conversation on Twitter and Facebook.\n\nFor more information about EA SPORTS games, including news, video, blogs, forums and game apps, please visit www.easports.com to connect, share and compete.\n\n*CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE ea.com/ea-access/terms AND origin.com/store/origin-access/terms FOR DETAILS.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall and Plants vs. Zombies are trademarks of Electronic Arts Inc. ©FIFA and FIFA’s Official Licensed Product Logo are copyrights and/or trademarks of FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. John Madden and NFL are property of their respective owners and used with permission.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005875/en/\nJino Talens\nSr. PR Manager\n650-628-9111\njtalens@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Electronic Arts Reports Q3 FY20 Financial Results",
        "subtitle": "",
        "date": "Jan 30, 2020 4:01PM EST",
        "content": "    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nElectronic Arts Inc. (NASDAQ: EA) today announced preliminary financial results for its third fiscal quarter ended December 31, 2019.\n\nNews and ongoing updates regarding EA and its games are available on EA’s blog at www.ea.com/news.\n\n“It was an excellent third quarter, with our new games and live services delighting more players around the world,” said CEO Andrew Wilson. “Our amazing creative teams at Electronic Arts continue to deliver some of the most high-quality, innovative and engaging experiences and content to a growing global audience.”\n\n“Over the last twelve months, we have delivered record live services revenue, live services net bookings and operating cash flow,” said COO and CFO Blake Jorgensen. “Our broad-based business model reduces our dependence on individual titles and enables us to deliver financial results for our shareholders by providing a constant stream of high-quality entertainment for our players. We expect live services to continue to drive growth in fiscal 2021 and for growth to accelerate in fiscal 2022, led by a new Battlefield.”\n\nSelected Operating Highlights and Metrics\n\n* Net bookings is defined as the net amount of products and services sold digitally or sold-in physically in the period. Net bookings is calculated by adding total net revenue to the change in deferred net revenue for online-enabled games and mobile platform fees. \n\nSelected Financial Highlights and Metrics\n\nAll financial measures are presented on a GAAP basis.\n\nQuarterly Financial Highlights\n\nThe following GAAP-based financial data and tax rate of 18% was used internally by company management to adjust its GAAP results in order to assess EA’s operating results:\n\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended September 30, 2019.\n\nTTM Financial Highlights\n\nThe following GAAP-based financial data and tax rate of 18% was used internally by company management to adjust its GAAP results in order to assess EA’s operating results:\n\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended September 30, 2019.\n\nOperating Metric\n\nThe following is a calculation of our total net bookings for the periods presented:\n\nBusiness Outlook as of January 30, 2020\n\nThe following forward-looking statements reflect expectations as of January 30, 2020. Electronic Arts assumes no obligation to update these statements. Results may be materially different and are affected by many factors detailed in this release and in EA’s annual and quarterly SEC filings.\n\nFiscal Year 2020 Expectations – Ending March 31, 2020\n\nFinancial metrics:\n\nOperational metric:\n\nIn addition, the following outlook for GAAP-based financial data and a long-term tax rate of 18% are used internally by EA to adjust our GAAP expectations to assess EA’s operating results and plan for future periods:\n\nFourth Quarter Fiscal Year 2020 Expectations – Ending March 31, 2020\n\nFinancial metrics:\n\nOperational metric:\n\nIn addition, the following outlook for GAAP-based financial data and a long-term tax rate of 18% are used internally by EA to adjust our GAAP expectations to assess EA’s operating results and plan for future periods:\n\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended September 30, 2019.\n\nConference Call and Supporting Documents\n\nElectronic Arts will host a conference call on Thursday, January 30, 2020 at 2:00 pm PT (5:00 pm ET) to review its results for the fiscal third quarter ended December 31, 2019 and its outlook for the future. During the course of the call, Electronic Arts may disclose material developments affecting its business and/or financial performance. Listeners may access the conference call live through the following dial-in number (866) 393-4306 (domestic) or (734) 385-2616 (international), using the Conference ID 4098898 or via webcast at EA’s IR Website at http://ir.ea.com.\n\nEA has posted a slide presentation, a financial model of EA’s historical results and guidance, and an Investor Accounting FAQ on EA’s IR Website. After the conference call, EA will also post the prepared remarks and a transcript from the conference call on EA’s IR Website.\n\nA dial-in replay of the conference call will be available until February 13, 2020 at (855) 859-2056 (domestic) or (404) 537-3406 (international) using pin code 4098898. An audio webcast replay of the conference call will be available for one year on EA’s IR Website.\n\nForward-Looking Statements\n\nSome statements set forth in this release, including the information relating to EA’s fiscal 2020 expectations under the heading “Business Outlook as of January 30, 2020,” and other information regarding EA's fiscal 2020, fiscal 2021 and fiscal 2022 expectations contain forward-looking statements that are subject to change. Statements including words such as “anticipate,” “believe,” “expect,” “intend,” “estimate,” “plan,” “predict,” “seek,” “goal,” “will,” “may,” “likely,” “should,” “could” (and the negative of any of these terms), “future” and similar expressions also identify forward-looking statements. These forward-looking statements are not guarantees of future performance and reflect management’s current expectations. Our actual results could differ materially from those discussed in the forward-looking statements.\n\nSome of the factors which could cause the Company’s results to differ materially from its expectations include the following: sales of the Company’s products and services; the Company’s ability to develop and support digital products and services, including managing online security and privacy; outages of our products, services and technological infrastructure; the Company’s ability to manage expenses; the competition in the interactive entertainment industry; governmental regulations; the effectiveness of the Company’s sales and marketing programs; timely development and release of the Company’s products and services; the Company’s ability to realize the anticipated benefits of acquisitions; the consumer demand for, and the availability of an adequate supply of console hardware units; the Company’s ability to predict consumer preferences among competing platforms; the Company’s ability to develop and implement new technology; foreign currency exchange rate fluctuations; general economic conditions; changes in our tax rates or tax laws; and other factors described in Part II, Item 1A of Electronic Arts’ latest Quarterly Report on Form 10-Q under the heading “Risk Factors”, as well as in other documents we have filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the fiscal year ended March 31, 2019.\n\nThese forward-looking statements are current as of January 30, 2020. Electronic Arts assumes no obligation to revise or update any forward-looking statement for any reason, except as required by law. In addition, the preliminary financial results set forth in this release are estimates based on information currently available to Electronic Arts.\n\nWhile Electronic Arts believes these estimates are meaningful, they could differ from the actual amounts that Electronic Arts ultimately reports in its Quarterly Report on Form 10-Q for the fiscal quarter ended December 31, 2019. Electronic Arts assumes no obligation and does not intend to update these estimates prior to filing its Form 10-Q for the fiscal quarter ended December 31, 2019.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Battlefield, The Sims, Need for Speed, Apex Legends, Ultimate Team, Plants vs. Zombies and Plants vs. Zombies: Battle for Neighborville are trademarks of Electronic Arts Inc. STAR WARS © & TM 2019 Lucasfilm Ltd. All rights reserved. John Madden, NFL and FIFA are the property of their respective owners and used with permission.\n\nResults (in $ millions, except per share data)\n\nThe following table reports the variance of the actuals versus our guidance provided on October 29, 2019 for the three months ended December 31, 2019 plus a comparison to the actuals for the three months ended December 31, 2018.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005792/en/\nChris Evenden\nVice President, Investor Relations\n650-628-0255\ncevenden@ea.com\n\nJohn Reseburg\nVice President, Corporate Communications\n650-628-3601\njreseburg@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "EA to Release Third Quarter Fiscal Year 2020 Results on January 30, 2020",
        "subtitle": "",
        "date": "Jan 9, 2020 4:01PM EST",
        "content": "    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nElectronic Arts Inc. (NASDAQ: EA) will release its financial results for the third fiscal quarter, which ended December 31, 2019, after the close of market on Thursday, January 30, 2020. In conjunction with this release, EA will host a conference call to review its financial results for the third fiscal quarter, discuss its outlook for the future and may disclose other material developments affecting its business and/or financial performance. Listeners may access the conference call live via a dial-in number or audio webcast.\n\nThursday, January 30, 2020\n2:00 pm Pacific Time (5:00 pm Eastern Time)\n\nDial-in numbers:\nDomestic: (866) 393-4306; International: (734) 385-2616\nConference ID: 4098898\n\nWebcast: http://ir.ea.com\n\nEA’s financial results release will be available after the close of market on January 30, 2020 on EA’s website at http://ir.ea.com. A dial-in replay of the conference call will be available until February 13, 2020 at (855) 859-2056 (domestic) or (404) 537-3406 (international) using pin code 4098898. An audio webcast replay of the conference call will be available for one year at http://ir.ea.com.\n\nUpdates regarding EA’s business are available on EA’s blog at www.ea.com/news.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nSafe Harbor for Forward-Looking Statements\n\nDuring the course of the presentation, Electronic Arts may make forward-looking statements regarding future events or the future financial performance of the company. Statements including words such as “anticipate,” “believe,” “expect,” “intend,” “estimate,” “plan,” “predict,” “seek,” “goal,” “will,” “may,” “likely,” “should,” “could” (and the negative of any of these terms), “future” and similar expressions also identify forward-looking statements. These forward-looking statements are not guarantees of future performance and reflect management’s current expectations. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that might cause or contribute to such differences include those discussed in Part II, Item 1A of Electronic Arts’ latest Quarterly Report on Form 10-Q under the heading “Risk Factors”, as well as in other documents we have filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the fiscal year ended March 31, 2019. We assume no obligation to revise or update any forward-looking statement for any reason, except as required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005014/en/\nChris Evenden\nVP, Investor Relations\n650.628.0255\ncevenden@ea.com \n\nJohn Reseburg\nVP, Corporate Communications\n650.628.3601\njreseburg@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Thinking about trading options or stock in Electronic Arts, Tesla, UnitedHealth Group, Vertex Pharmaceuticals, or Workday?",
        "subtitle": "",
        "date": "Jan 9, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 9, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for EA, TSLA, UNH, VRTX, and WDAY.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)   View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-electronic-arts-tesla-unitedhealth-group-vertex-pharmaceuticals-or-workday-300984334.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "EA and Respawn Launch the Apex Legends Global Series – The First International Multi-tournament Esports Program for the Franchise",
        "subtitle": "",
        "date": "Dec 17, 2019 1:00PM EST",
        "content": "\nPC Players from Over 60 Countries Eligible to Compete in The Game Awards Best Multiplayer Game of 2019\n\nWatch the Apex Legends Global Series Trailer HERE. Competition Begins January 25, 2020\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday, Electronic Arts Inc., (NASDAQ: EA) and Respawn Entertainment announced the Apex Legends Global Series. The series is comprised of online and live events for PC players who will compete for a prize purse of more than $3 million. The Apex Legends Global Series will initially feature 12 global live events, either operated by EA and Respawn or produced by notable esports tournament organizers PGL and GLL. Online competition will be powered by Battlefy with registration for the first event opening in early January.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191217005718/en/\n“Competition is at the heart of Apex Legends,” said Vince Zampella, Head of Respawn Entertainment. “We expect that esports will play a big role in the future of Apex Legends and it all starts here, with the Apex Legends Global Series. We look forward to seeing who, out of our millions of players, will become true legends of the arena.”\n\nThe Apex Legends Global Series is an inclusive, open ecosystem created to make stars of all players. Residents of one of the more than 60 eligible countries who meet minimum age, PC system requirements, and other eligibility requirements can compete.* The competitive journey for many will start with online competition, with competitors potentially advancing to live, regional Challenger Events and global Premier Events. Players will earn Apex Legends Global Series Points for their performances in online, and certain live events, and those atop the standings will be invited to the four Apex Legends Global Series Majors, the highest competitive live event tier.\n\n“Apex Legends is one of the most impactful launches in videogame history and it possesses immense esports potential,” said John Nelson, Apex Legends Competitive Gaming Commissioner. “Through close communication with our community, we’ve built an accessible Apex Legends ecosystem where any player can become a potential star while the world watches our unique, entertaining take on Battle Royale esports.”\n\nThe first three Majors will each feature 100 three-player squads from around the world. The fourth Major, the Apex Legends Global Series Championship, is the grand finale. Only the top 60 Apex Legends Global Series teams in the world will be invited to battle for $1 million in prizes and the title of Apex Legends Global Series World Champion.\n\nAll four Majors will feature the Apex Legends exclusive Match Point format, which debuted at the Apex Legends Preseason Invitational in September to positive reception. Match Point requires teams in the Finals to reach a points threshold through a combination of match placement and accumulated kills. Apex Legends is the only Battle Royale esport to feature this uniquely exciting end game mechanic.\n\nThe first Apex Legends Global Series competition is an Online Tournament taking place on January 25, 2020. Registration will open for the event in early January. Players can earn Apex Legends Global Series Points and an invitation to the first Major on March 13-15, 2020 held at Esports Stadium Arlington in Arlington, Texas based on their Online Tournament performance. Many of the Apex Legends Global Series Online Tournaments will be produced from the newly built EA Broadcast Center at company headquarters. Subsequent Apex Legends Global Series details will be announced soon.\n\n*For more Apex Legends Global Series information and the Official Rules, please visit www.playapex.com/algs.\n\nDeveloped by Respawn Entertainment, Apex Legends delivers a squad-based Battle Royale experience where players select from one of 11 Legends – each with their own unique abilities and playstyles – and the last team standing wins. Combatants can choose from unique characters like Bloodhound, the tracker who can see recent enemy activity on the map, or Lifeline, a battlefield medic who can shield teammates and bring them back from the brink of death. Balanced squads and teamwork are critical, as each Legend is easy to pick up and learn but challenging to master.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall and Plants vs. Zombies are trademarks of Electronic Arts Inc. ©FIFA and FIFA’s Official Licensed Product Logo are copyrights and/or trademarks of FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. John Madden and NFL are property of their respective owners and used with permission.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191217005718/en/\nTravis Varner\nManager II, Communications\n650-628-2717\ntvarner@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "The Force Is Strong With Star Wars Jedi: Fallen Order™",
        "subtitle": "",
        "date": "Nov 26, 2019 9:00AM EST",
        "content": "\nIn the First Two Weeks, EA Achieves Fastest-Selling Digital Launch for a Star Wars Game Ever, Becomes EA’s Top-Selling Star Wars Title on PC in its Initial Launch Window\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday Electronic Arts Inc. (NASDAQ: EA), Respawn Entertainment and Lucasfilm announced that the critically acclaimed Star Wars Jedi: Fallen Order™ is the fastest-selling digital launch for a Star Wars game in its first two weeks. The game is also now EA’s top-selling Star Wars title on PC in its initial launch window.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191126005302/en/Electronic Arts 2019 (Graphic: Business Wire)\nStar Wars Jedi: Fallen Order is a critical success as well as being the highest rated Star Wars game of this console generation. Business Insider exclaims that Star Wars Jedi: Fallen Order is “the best Star Wars game ever made,” while GameSpot calls it “one of the most compelling game additions to the Star Wars franchise in years.” GQ notes that the game “lives up to the hype,” while IGN says it is, “an all-around amazing game” in their 9.0 out of 10 review.\n\n“On behalf of Respawn and EA, we thank everyone for their support of the studio and the team throughout the development and launch of Star Wars Jedi: Fallen Order. Telling a story in the Star Wars galaxy is a dream come true and the reception from the fans has been incredible,” said Vince Zampella, Head of Respawn. “With the launch of the game, the debut of The Mandalorian and the upcoming release of Star Wars: The Rise of Skywalker, it’s a great time to be a Star Wars fan!”\n\n\"Star Wars Jedi: Fallen Order demonstrates the amazing potential for original storytelling in Star Wars games,” said Sean Shoptaw, SVP, Games and Interactive Experiences, Disney Parks, Experiences and Products. \"The close collaboration between Respawn and Lucasfilm is a perfect example of how we can deliver an experience for fans that is authentic to the stories and worlds they love, while also being an incredibly fun and innovative game. With the fantastic reception and launch so far, Star Wars Jedi: Fallen Order has proven to be the must-play game this Holiday.”\n\nIn Star Wars Jedi: Fallen Order, players take on the role of Cal Kestis, a former Padawan hiding in plain sight after the Jedi were all but wiped out after Order 66 was executed by The Emperor. When he’s forced on the run, Cal is quickly met by his companions Cere Junda, a former Jedi Knight played by Debra Wilson and Greez, the larger-than-life Latero pilot voiced by Daniel Roebuck, who flies the crew’s ship known as the Stinger Mantis. BD-1, Cal’s faithful droid that’s as charming as he is useful, will help players navigate and explore diverse planets including the Wookiee homeworld, Kashyyyk, and the never-before-seen planet Zeffo. Cal and his companions are trying to stay one step ahead of the Empire and his new enemy, the Inquisition’s Second Sister, while they unravel a mystery tied to an ancient alien civilization that could help rebuild the Jedi Order.\n\nStar Wars Jedi: Fallen Order is now available both digitally and in stores on the Xbox One, PlayStation®4 and PC via Origin™, Steam and the Epic Games Store. Origin Access Premier subscribers will get full access to Star Wars Jedi: Fallen Order Deluxe Edition on PC for as long as they are subscribed. For more information on Star Wars Jedi: Fallen Order, please visit: https://www.ea.com/games/starwars/jedi-fallen-order.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Origin, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall and Plants vs. Zombies are trademarks of Electronic Arts Inc. John Madden, NFL, and FIFA are the property of their respective owners and used with permission. “PlayStation” is a registered trademark of Sony Computer Entertainment Inc.\n\nLucasfilm, the Lucasfilm logo, STAR WARS and related properties are trademarks and/or copyrights, in the United States and other countries, of Lucasfilm Ltd. and/or its affiliates. © & TM Lucasfilm Ltd. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005302/en/\nJino Talens\nSr. PR Manager\njtalens@ea.com\n650-628-9111\nSource: Electronic Arts Inc."
    },
    {
        "title": "Formula 1® Comes to Real Racing 3 on November 26",
        "subtitle": "",
        "date": "Nov 25, 2019 9:00AM EST",
        "content": "\nThe Pinnacle of Motorsport Meets the Most Popular Racing Simulation Game on Mobile\n\nView the Trailer Here\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nElectronic Arts (NASDAQ: EA) and Firemonkeys Studio today announced their new and first-time licensing partnership with Formula 1®. On November 26, Real Racing 3 will launch its newest update, bringing players an experience unlike anything that has been in-game ever before. Representing the first F1 content integration of its kind in the mobile gaming space, the update will include the following:\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191125005152/en/Electronic Arts 2019 (Graphic: Business Wire)\n“The partnership between EA Firemonkeys and Formula 1 is an incredibly exciting opportunity for our players to experience the next evolution of the game in a new and innovative way,” said Joe Donoghue, General Manager at EA Firemonkeys. “This collaboration means that fans of Formula 1 can for the first time ever access and play as their favorite Formula 1 teams and drivers in Real Racing 3.”\n\nLaunched in 2013 and boasting over 250 cars and 20 real-world locations, Real Racing 3 is the award-winning franchise that set a new standard for mobile racing games. With the inclusion of Formula 1 on November 26 – available on iOS and Android platforms – the EA Firemonkeys team will deliver the single most requested piece of content by Real Racing players, kickstarting the next phase of Real Racing: Motorsports.\n\nTimed to coincide with the FORMULA 1 ETIHAD AIRWAYS ABU DHABI GRAND PRIX 2019 at the Yas Marina Circuit on December 1, the in-game integration of Formula 1 content will bring players not only fresh events and challenges, but also an upgraded gameplay experience. These changes include a Formula 1 hub, daily race, champion series, Grand Prix career special events and invitationals, in addition to a Formula 1 Academy designed to give new players an introduction to Real Racing 3 and the Formula 1 motorsport career.\n\nAlongside the new F1 events, challenges and gameplay experiences coming to Real Racing 3, there will be a wide variety of additional content for players to enjoy, including a new original soundtrack by Australian producer Ryan Kurt.\n\nReal Racing 3 is available for download* on the App Store and Google Play.\n\nFollow Real Racing on Facebook and Twitter for the latest news and updates.\n\n*Network fees may apply. Includes in-app purchases.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at https://www.ea.com/news.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191125005152/en/\nJino Talens\nSr. PR Manager\njtalens@ea.com\n650-628-9111\nSource: Electronic Arts"
    },
    {
        "title": "EA Announces CONMEBOL Libertadores Coming to EA SPORTS™ FIFA 20 in March 2020",
        "subtitle": "",
        "date": "Nov 20, 2019 11:00AM EST",
        "content": "\nSouth America’s Most Prestigious Club Tournament Available Exclusively in FIFA 20, View the Trailer Here\n\neLibertadores Tournament Added to EA SPORTS FIFA 20 Global Series on the Road to the 2020 FIFA eWorld Cup Next Summer\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nElectronic Arts Inc. today announced that it’s bringing South America’s biggest club tournament, CONMEBOL Libertadores*, exclusively to EA SPORTS™ FIFA 20 as a free* content update in March 2020 for PlayStation®4, Xbox One, and PC.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191120005659/en/South America’s Most Prestigious Club Tournament, CONMEBOL Libertadores, Available Exclusively in FIFA 20 in March 2020 (Graphic: Business Wire)\nPlayers can compete with historic clubs from Uruguay, Perú, Paraguay, Ecuador and beyond in FIFA Ultimate Team™, Career Mode, Kick-Off, and a new CONMEBOL Libertadores Tournament Mode. Follow in the footsteps of some of the top players to lead teams like River Plate, Boca Juniors, Flamengo, Corinthians, and Colo-Colo through the heated competition of South American club football while playing the CONMEBOL Libertadores, CONMEBOL Sudamericana and CONMEBOL Recopa competitions.\n\n“This alliance with EA, one of the largest video game companies, is a major step forward for the worldwide dissemination and image of South American football. Thanks to this agreement, our tournaments, clubs and players will have greater reach and recognition among the football fans who will have a whole new way to follow their heroes,” said CONMEBOL Commercial Director, Juan Emilio Roa.\n\nThe inclusion of CONMEBOL Libertadores continues to cement FIFA 20 as the most authentic sports video game, with more than 30 official leagues, 700 teams, 17,000 authentic players, and 90 licensed stadiums from all over the world already in the game.\n\n“Bringing two of the most prestigious continental football tournaments, CONMEBOL Libertadores and CONMEBOL Sudamericana, into FIFA 20 is an exciting step forward,” said Nick Wlodyka, GM, EA SPORTS FIFA. “This new partnership with CONMEBOL bolsters our position as the deepest football experience available as we continue to build the most authentic sports video game for our fans.”\n\nIn addition, eLibertadores, a new tournament that will continue to expand the EA SPORTS FIFA 20 Global Series, offers South American-based players a whole new way to connect to the CONMEBOL Libertadores through the competition.\n\n“The addition of the prestigious CONMEBOL Libertadores to our FIFA 20 Global Series ecosystem strengthens our connection to the global fandom of football and will accelerate the growth of esports in new parts of the world,” said Brent Koning, FIFA Competitive Gaming Commissioner. “We aim to offer the most inclusive esports competition in the world and are eager to welcome South American-based players and aspiring superstars to join the tens of millions already competing in FIFA.”\n\nThe Grand Final of the eLibertadores tournament will see the top eight competitors from both PlayStation®4 and Xbox One compete from March 7-8, 2020 for the chance to earn FIFA Global Series Points along with a $100,000 USD prize pool. More details on the tournament and how to register will be available in December.\n\nFor more information about the CONMEBOL Libertadores in FIFA 20, check out https://www.ea.com/games/fifa/fifa-20/conmebol-libertadores and stay tuned to @EASPORTSFIFA on Instagram, Twitter, and Facebook for more details.\n\nAvailable in stores now, EA SPORTS FIFA 20 lets players experience the prestige levels of professional football or jump into VOLTA FOOTBALL, the all-new authentic small-sided football mode. Join EA Access** on PlayStation 4 and Xbox One and Origin™ Access** on PC to get 10% off digital purchases.\n\n*CONMEBOL LIBERTADORES CONTENT AVAILABLE FOR DOWNLOAD MARCH 2020. REQUIRES FIFA 20 FOR THE PS4, XBOX ONE OR PC (SOLD SEPARATELY), ALL GAME UPDATES AND INTERNET CONNECTION.\n\n** CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE ea.com/ea-access/terms AND ea.com/ea-access FOR DETAILS.\n\nAbout CONMEBOL\n\nFounded in 1916, the South American Football Confederation - CONMEBOL - is the governing body of South American football and the oldest continental soccer confederation in the world. CONMEBOL, made up of ten member associations, including Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay and Venezuela, is responsible for the organisation and governance of the main international South American football tournaments, including CONMEBOL Copa America, CONMEBOL Libertadores, CONMEBOL Sudamericana and CONMEBOL Recopa, among others.\n\nSince 2016, CONMEBOL has undergone a series of structural reforms to modernise its governance and operations, increase the global competitiveness of its exclusive tournaments and strengthen its promotion of football development by increasing revenues and investment.\n\nAs part of that strategy, in the last two years, CONMEBOL club competitions have been greatly improved through a new format design and the adoption of standards, designed to increase the quality of the tournaments from competitive, sporting and commercial points of view. Thanks to the recently adopted improvements, CONMEBOL tournaments last year achieved record numbers in digital participation, stadium attendance and sales.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Ultimate Team, Origin, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall, Plants vs. Zombies are trademarks of Electronic Arts Inc. ©FIFA and FIFA’s Official Licensed Product Logo are copyrights and/or trademarks of FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. John Madden and NFL are property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Computer Entertainment Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005659/en/\nJino Talens\nSr. PR Manager\n650-628-9111\njtalens@ea.com \n\nCait Doherty\nGlobal PR Manager\n+41 7544-22264\ncadoherty@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Become a Jedi in Star Wars Jedi: Fallen Order™ Today",
        "subtitle": "",
        "date": "Nov 15, 2019 9:00AM EST",
        "content": "\nThe Single-Player Action Adventure Game Features a Memorable Cast, Thrilling Lightsaber Battles and Cinematic Moments Only Found in an Authentic Star Wars™ Story\n\nExperience a Jedi’s Journey on Xbox One, PlayStation 4 and PC via Origin, Steam and the Epic Games Store\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday Electronic Arts Inc. (NASDAQ: EA), Respawn Entertainment and Lucasfilm released the highly anticipated story-driven action adventure game, Star Wars Jedi: Fallen Order™. Star Wars Jedi: Fallen Order follows Cal Kestis, played by Cameron Monaghan (Gotham, Shameless), on an incredible journey packed with memorable companions, nefarious villains, diverse planets, thrilling lightsaber combat, impressive Force abilities and cinematic moments, all within the much beloved Star Wars™ galaxy.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191115005140/en/(Graphic: Business Wire)\nStar Wars Jedi: Fallen Order is now available worldwide on Xbox One, PlayStation 4 and PC via Origin and Steam. Also, as announced earlier, Star Wars Jedi: Fallen Order is now available on the Epic Games Store, expanding the number of options that players have to jump into this new Star Wars adventure.\n\n“Working on Star Wars Jedi: Fallen Order has been a dream come true for me and many people on the team,” said Stig Asmussen, Game Director at Respawn Entertainment. “We couldn’t be more excited to get the game into the hands of fans worldwide so they can live out the ultimate fantasy of becoming a Jedi. We created a new team that’s made up of action adventure veterans to create this experience and we’ve worked hand-in-hand with Lucasfilm throughout development to create a highly authentic story, cast of characters, and unique gameplay experience that will live on as part of the Star Wars galaxy.”\n\nIn Star Wars Jedi: Fallen Order, players take on the role of Cal Kestis, a former Padawan hiding in plain sight after the Jedi were all but wiped out after Order 66 was executed by The Emperor. When he’s forced on the run, Cal is quickly met by his companions Cere Junda, a former Jedi Knight played by Debra Wilson and Greez, the larger-than-life Latero pilot voiced by Daniel Roebuck, who flies the crew’s ship known as the Stinger Mantis. BD-1, Cal’s faithful droid that’s as charming as he is useful, will help players navigate and explore diverse planets including the Wookiee homeworld, Kashyyyk, and the never-before-seen planet Zeffo. Cal and his companions are trying to stay one step ahead of the Empire and his new enemy, the Inquisition’s Second Sister, while they unravel a mystery tied to an ancient alien civilization that could help rebuild the Jedi Order.\n\nIn a time where it’s increasingly dangerous for Jedi, players will experience Cal’s journey from a young Padawan to a Jedi Knight. Cal’s lightsaber and Force abilities take center stage in Star Wars Jedi: Fallen Order’s dynamic combat. Every battle is unique as players engage an array of enemies, from creatures and droids to stormtroopers and elite Purge Troopers to showdowns with AT-STs and powerful bosses. Throughout his quest, Cal will strengthen his connection with the Force, learning powerful new skills which will be crucial in combat as well as for traversing and opening up new paths across these beautiful yet dangerous locales.\n\nStar Wars Jedi: Fallen Order is now available both digitally and in stores on Xbox One, PlayStation 4 and PC via Origin, Steam and the Epic Games Store. Origin Access Premier subscribers will get full access to Star Wars Jedi: Fallen Order Deluxe Edition on PC for as long as they are subscribed. For more information on Star Wars Jedi: Fallen Order, please visit: https://www.ea.com/games/starwars/jedi-fallen-order\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA, EA SPORTS, Origin, The Sims, Dragon Age, Plants vs. Zombies, and Battlefield are trademarks of Electronic Arts Inc. John Madden, NFL, NHL, NBA, PGA TOUR, UFC and FIFA are the property of their respective owners and used with permission. “PlayStation” is a registered trademark of Sony Computer Entertainment Inc.\n\nLucasfilm, the Lucasfilm logo, STAR WARS and related properties are trademarks and/or copyrights, in the United States and other countries, of Lucasfilm Ltd. and/or its affiliates. © & TM Lucasfilm Ltd. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191115005140/en/\nJino Talens\nSr. PR Manager\n650-628-9111\njtalens@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Race Into the Night in Need for Speed Heat, Available Worldwide Today",
        "subtitle": "",
        "date": "Nov 8, 2019 9:00AM EST",
        "content": "\nOne of the Best-Selling Video Game Franchises of All Time Returns with Underground Races, Police Chases, Customized Rides and More Authentic Car Culture\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday, Ghost Games™, a studio of Electronic Arts Inc. (NASDAQ: EA) have announced Need for Speed™ Heat is available worldwide on the PlayStation®4, Xbox One and Origin™ for PC. Need for Speed Heat sends players to Palm City, a brand-new open world where street racers choose their way to play; earn Bank in sanctioned events by day, or risk it all to build Rep in underground races by night. Big risks could mean big rewards, it’s up to the player to make the call.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191108005310/en/One of the Best-Selling Video Game Franchises of All Time Returns with Underground Races, Police Chases, Customized Rides and More Authentic Car Culture (Graphic: Business Wire)\n“At its core Need for Speed is about custom rides, adrenaline-filled races with cops and without them and showcasing the latest in car customization. With Need for Speed Heat we’ve dialed those core tenants up and dropped them into a vibrant new world,” said Riley Cooper, Creative Director at Ghost Games. “Heat offers two firsts for the series including a unique day and night cycle that offers players two ways to play, and customizable avatars so they can express themselves beyond just their wheels.”\n\nIn Need for Speed Heat, players can drive the hybrid-electric performance, Polestar 1, for the first time ever, as well as some of the most iconic car brands in the world. See the full list here. The game also offers the deepest customization the series has ever seen, including a range of options for both performance and style, which gives players the tools they need to create their perfect high-octane, anything-goes, dream car. Additionally, as another first for the franchise, Need for Speed Heat features character customization, giving players 12 preset avatars to choose from to further adapt their own style. Clothing and accessories from PUMA, Life’s a Beach, End Clothing and other well-known brands, ensure that players will be going full throttle with the latest fashion when they hit the streets of Palm City.\n\nNeed for Speed Heat also introduces players to a bright, new urban environment that becomes a dangerous neon playground once the sun sets. Taking inspiration from Miami – a vibrant city with a multicultural blend of music, cool street art and stunning night lights – Palm City is a street-racer’s paradise. Day and night are at the core of progression in Need for Speed Heat. During the day, players race in a series of sanctioned events to build Bank. At night, they must engage in illicit racing to establish themselves and reap extra Rep. When the sun goes down things heat up, but the rewards are there for the fearless.\n\nEA Access* and Origin Access* Basic subscribers can enjoy up to 10 hours of play time, along with 10% off the purchase of the full game. Origin Access Premier subscribers get all the benefits of Basic on top of full access to the game on PC for as long as they are subscribed.\n\nNeed for Speed Heat is rated T for Teen and is available worldwide for the PlayStation®4, Xbox One, and PC for $59.99 USD. To join the conversation, players can like the Need for Speed page on Facebook, or follow the Need for Speed channels on Twitter®, Instagram and YouTube. For more information, visit the website at https://www.ea.com/games/need-for-speed/.\n\nPress assets are available at http://press.ea.com\n\n*CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE ea.com/ea-access/terms AND origin.com/store/origin-access/terms FOR DETAILS.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nNeed for Speed, Origin, EA SPORTS, Battlefield, Apex Legends, The Sims, Titanfall and Plants vs. Zombies are trademarks of Electronic Arts Inc. FIFA, John Madden and NFL are the property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Interactive Entertainment.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191108005310/en/\nJino Talens\nSr. PR Manager\n650-628-9111\njtalens@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Thinking about buying stock in Advanced Micro Devices, Bank of America, Electronic Arts, Johnson & Johnson, or Verizon?",
        "subtitle": "",
        "date": "Oct 31, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 31, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMD, BAC, EA, JNJ, and VZ.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-advanced-micro-devices-bank-of-america-electronic-arts-johnson--johnson-or-verizon-300949119.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Electronic Arts Reports Q2 FY20 Financial Results",
        "subtitle": "",
        "date": "Oct 29, 2019 4:01PM EDT",
        "content": "    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nElectronic Arts Inc. (NASDAQ: EA) today announced preliminary financial results for its second fiscal quarter ended September 30, 2019.\n\n“It was an excellent second quarter for Electronic Arts. Our new EA SPORTS titles are thrilling core fans and bringing in new players, and our ongoing live services are growing with deeply-engaged communities,” said CEO Andrew Wilson. “With new games like Star Wars Jedi: Fallen Order, Need for Speed, Plants vs. Zombies and more great content across our top franchises, we’re set to deliver a lot of fun and excitement to players this holiday season, and continue our momentum in this fiscal year.”\n\n“The strong results this quarter illustrate the power of our live services and our core franchises. Strength in Ultimate Team, The Sims 4 and FIFA Online drove live services performance above our expectations,” said COO and CFO Blake Jorgensen. “Looking ahead, we are doubling down on live services combined with our core franchises. We’re investing in games that people play for longer and engage with much more deeply. This focus will continue to drive growth and profitability for the company through the remainder of this year and beyond.”\n\nNews and ongoing updates regarding EA and its games are available on EA’s blog at www.ea.com/news.\n\nSelected Operating Highlights and Metrics\n\n* Net bookings is defined as the net amount of products and services sold digitally or sold-in physically in the period. Net bookings is calculated by adding total net revenue to the change in deferred net revenue for online-enabled games and mobile platform fees. \n\nSelected Financial Highlights and Metrics\n\nImpact of Certain Tax Matters\n\nDuring the six months ended September 30, 2019, three separate tax events occurred:\n\nAs a result of these events, EA has recognized an income tax benefit of $1.705 billion, or $5.74 of earnings per share, during the fiscal year ending March 31, 2020. EA recognized $1.080 billion, or $3.61 of earnings per share, of this income tax benefit during the three months ended June 30, 2019 and $625 million, or $2.11 of earnings per share, during the three months ended September 30, 2019.\n\nQuarterly Financial Highlights\n\nThe following GAAP-based financial data and tax rate of 18% was used internally by company management to adjust its fiscal GAAP results in order to assess EA’s operating results:\n\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended June 30, 2019.\n\nTTM Financial Highlights\n\nThe following GAAP-based financial data and tax rate of 18% was used internally by company management to adjust its GAAP results in order to assess EA’s operating results:\n\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended June 30, 2019.\n\nOperating Metric\n\nThe following is a calculation of our total net bookings for the periods presented:\n\nBusiness Outlook as of October 29, 2019\n\nThe following forward-looking statements reflect expectations as of October 29, 2019. Electronic Arts assumes no obligation to update these statements. Results may be materially different and are affected by many factors detailed in this release and in EA’s annual and quarterly SEC filings.\n\nFiscal Year 2020 Expectations – Ending March 31, 2020\n\nFinancial metrics:\n\nOperational metric:\n\nIn addition, the following outlook for GAAP-based financial data and a long-term tax rate of 18% are used internally by EA to adjust our GAAP expectations to assess EA’s operating results and plan for future periods:\n\nThird Quarter Fiscal Year 2020 Expectations – Ending December 31, 2019\n\nFinancial metrics:\n\nOperational metric:\n\nIn addition, the following outlook for GAAP-based financial data and a long-term tax rate of 18% are used internally by EA to adjust our GAAP expectations to assess EA’s operating results and plan for future periods:\n\nFor more information about the nature of the GAAP-based financial data, please refer to EA’s Form 10-Q for the fiscal quarter ended June 30, 2019.\n\nConference Call and Supporting Documents\n\nElectronic Arts will host a conference call on October 29, 2019 at 2:00 pm PT (5:00 pm ET) to review its results for the second quarter ended September 30, 2019 and its outlook for the future. During the course of the call, Electronic Arts may disclose material developments affecting its business and/or financial performance. Listeners may access the conference call live through the following dial-in number (866) 393-4306 (domestic) or (734) 385-2616 (international), using conference code 9877505 or via webcast at EA’s IR Website at http://ir.ea.com.\n\nEA has posted a slide presentation with a financial model of EA’s historical results and guidance and Investor Accounting FAQ on EA’s IR Website. EA will also post the prepared remarks and a transcript from the conference call on EA’s IR Website.\n\nA dial-in replay of the conference call will be available until November 13, 2019 at 855-859-2056 (domestic) or 404-537-3406 (international) using pin code 9877505. An audio webcast replay of the conference call will be available for one year on EA’s IR Website.\n\nForward-Looking Statements\n\nSome statements set forth in this release, including the information relating to EA’s fiscal 2020 expectations under the heading “Business Outlook as of October 29, 2019,” and other information regarding EA's fiscal 2020 expectations contain forward-looking statements that are subject to change. Statements including words such as “anticipate,” “believe,” “expect,” “intend,” “estimate,” “plan,” “predict,” “seek,” “goal,” “will,” “may,” “likely,” “should,” “could” (and the negative of any of these terms), “future” and similar expressions also identify forward-looking statements. These forward-looking statements are not guarantees of future performance and reflect management’s current expectations. Our actual results could differ materially from those discussed in the forward-looking statements.\n\nSome of the factors which could cause the Company’s results to differ materially from its expectations include the following: sales of the Company’s products and services; the Company’s ability to develop and support digital products and services, including managing online security and privacy; outages of our products, services and technological infrastructure; the Company’s ability to manage expenses; the competition in the interactive entertainment industry; governmental regulations; the effectiveness of the Company’s sales and marketing programs; timely development and release of the Company’s products and services; the Company’s ability to realize the anticipated benefits of acquisitions; the consumer demand for, and the availability of an adequate supply of console hardware units; the Company’s ability to predict consumer preferences among competing platforms; the Company’s ability to develop and implement new technology; foreign currency exchange rate fluctuations; general economic conditions; changes in our tax rates or tax laws; and other factors described in Part II, Item 1A of Electronic Arts’ latest Quarterly Report on Form 10-Q under the heading “Risk Factors”, as well as in other documents we have filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the fiscal year ended March 31, 2019.\n\nThese forward-looking statements are current as of October 29, 2019. Electronic Arts assumes no obligation to revise or update any forward-looking statement for any reason, except as required by law. In addition, the preliminary financial results set forth in this release are estimates based on information currently available to Electronic Arts.\n\nWhile Electronic Arts believes these estimates are meaningful, they could differ from the actual amounts that Electronic Arts ultimately reports in its Quarterly Report on Form 10-Q for the fiscal quarter ended September 30, 2019. Electronic Arts assumes no obligation and does not intend to update these estimates prior to filing its Form 10-Q for the fiscal quarter ended September 30, 2019, except as required by law.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Ultimate Team, Apex Legends, Battlefield, Need for Speed, Titanfall, The Sims and Plants vs. Zombies are trademarks of Electronic Arts Inc. John Madden, NFL and FIFA are the property of their respective owners and used with permission.\n\nResults (in $ millions, except per share data)\n\nThe following table reports the variance of the actuals versus our guidance provided on July 30, 2019 for the three months ended September 30, 2019 plus a comparison to the actuals for the three months ended September 30, 2018.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005972/en/\nFor additional information, please contact:\n\nChris Evenden\nVice President, Investor Relations\n650-628-0255\ncevenden@ea.com\n\nJohn Reseburg\nVice President, Corporate Communications\n650-628-3601\njreseburg@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Electronic Arts and Valve Announce Partnership to Bring EA Access Subscription and EA Games to Steam",
        "subtitle": "",
        "date": "Oct 29, 2019 10:00AM EDT",
        "content": "\nSubscription Arrives for Steam Players this Spring,\nStar Wars Jedi: Fallen Order Will Be the First Game Available at Launch\n    REDWOOD CITY, Calif. & BELLEVUE, Wash.--(BUSINESS WIRE)--\nToday, Electronic Arts Inc. (NASDAQ: EA) and Valve announced a partnership to put EA games into the hands of players on Steam. EA Access will launch on Steam next spring, giving players another place to subscribe to a great collection of EA games and member benefits on PC. The first new EA game launching on Steam will arrive on November 15, when the eagerly anticipated title, Star Wars Jedi: Fallen Order™, debuts worldwide. Star Wars Jedi: Fallen Order is available to pre-order on Steam beginning today.\n\n“This is the start of an exciting partnership with Valve that will see us innovating for PC players around the world,” said Andrew Wilson, CEO of Electronic Arts. “Through our subscription, great games and more, we’re excited to bring players in the Steam and Origin communities together with access to the best games, whenever and wherever they want to play.”\n\n“This is a good day for gamers,” said Valve’s Gabe Newell. “We’re excited to partner with EA to not only bring their great games and subscription service to Steam, but also to open up our communities to each other in an unprecedented way that will benefit players and developers around the world.”\n\nEA Access will give subscribers access to a broad portfolio of EA games, valuable member benefits and discounts on full game purchases, expansions, in-game items and more. EA has been offering subscription services since 2014, and currently reaches players on the Xbox One, PlayStation®4 and Origin™ platforms.\n\nStar Wars Jedi: Fallen Order™ - the new single player, third-person action adventure Star Wars™ game from Respawn and EA - launches to players worldwide on November 15, 2019. For more information on the game, visit https://www.ea.com/games/starwars/jedi-fallen-order. To pre-order the game on Steam, visit https://store.steampowered.com/app/1172380.\n\nIn the coming months, players on Steam will be able to play other games such as The Sims™ 4 and Unravel™ 2. Multiplayer games like Apex Legends™, FIFA 20 and Battlefield™ V will become available next year, and players on Origin and Steam will have the ability to play together.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at http://www.ea.com/news.\n\nEA SPORTS, Origin, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall, Plants vs. Zombies are trademarks of Electronic Arts Inc. STAR WARS and related properties are trademarks and/or copyrights, in the United States and other countries, of Lucasfilm Ltd. and/or its affiliates. © & TM Lucasfilm Ltd. John Madden, FIFA and NFL are property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Computer Entertainment Inc.\n\nAbout Valve\n\nFounded in 1996 and headquartered in Bellevue, WA, Valve is the creator of multiple game franchises (including Half-Life, Counter-Strike, Dota 2) and Steam, a leading platform for PC, Mac, and Linux games. For more information, please visit www.valvesoftware.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005685/en/\nJen Riley\nCommunications Director\n604.456.1917\njriley@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "The Sims 4 Goes Back to School With Discover University, Available November 15 On PC and Mac",
        "subtitle": "",
        "date": "Oct 22, 2019 1:06PM EDT",
        "content": "\nShow School Spirit and Hit the Books in The Sims’ Highly Anticipated Expansion Pack\n\nWatch the Official Reveal Trailer HERE\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nClass is in session! Electronic Arts Inc. (NASDAQ: EA) and Maxis™ today announced that The Sims™ 4 Discover University Expansion Pack* is coming to PC and Mac on November 15, 2019 and on PlayStation®4 and Xbox One on December 17, 2019. The highly anticipated expansion pack introduces a new chapter for Sims where they can enroll in their dream school and take classes in engineering, education or law, decorate their dorm room to feel like home, dabble in extracurricular activities and make everlasting memories with new friends.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191022005974/en/The Sims 4 Discover University expansion pack (Graphic: Business Wire)\n“Easily the most requested piece of content by our players, we’re excited to reveal The Sims 4 Discover University and can’t wait for everyone to make the world of Britechester their classroom. Players can have their Sims live out whatever college experience they choose and create unique memories during an opportunistic chapter of their lives,” said Michael Duke, Senior Producer of The Sims 4. “They can enroll in classes that pique their interest, whether that is biology, computer science, art history or even villainy! Players could set up their Sims for success and join a study group with friends or hit the snooze button and miss their morning lecture. They can also enjoy extracurricular activities such as joining college organizations and attending school spirit events.”\n\nThe Sims 4 Discover University introduces the brand-new world of Britechester and two unique schools for Sims to pursue their higher education: the historical University of Britechester for arts and humanities majors, and the modern Foxbury Institute for careers in science and technology fields. Both campuses offer a variety of new experiences that ultimately prepare Sims for the real world with new career tracks in teaching, law and engineering, and help them excel in existing career paths. Players can choose how Sims embrace college life, how often they attend class and study hard to keep their grades up or choose to skip class to hang out with friends instead.\n\nThe expansion also introduces a slew of new activities and items to help Sims settle into life as a student. Sims can have study sessions at the library or take a break and mingle with new friends in the student commons, play juice pong, explore the campus on a bicycle or pull pranks against the rival school. Sims can also join school organizations like robotics, debate, art, or a mysterious secret society, and show off their school spirit at special events. Players can customize their Sims’ new digs, whether they’re living in a dorm or off-campus, with new décor like posters or a mini fridge and transform the space into their own personal haven. Sims can also develop their personal style with new clothing items inspired by the latest trends, including late-for-class attire, professional ensembles, or new pieces featuring their school’s colors.\n\nAs Sims start this new chapter in their lives in The Sims 4 Discover University, they’ll have plenty to learn both inside and outside of the classroom. Whether they’re studying hard or playing hard, Sims will become their best selves and discover experiences that will shape them into what they want to become.\n\nThe Sims 4 Discover University Expansion Pack is rated T for Teen. For more information and to pre-order The Sims 4 Discover University, please visit www.TheSims.com.\n\nDOWNLOAD LAUNCH ASSETS at PRESS.EA.COM\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at http://www.ea.com/news.\n\nThe Sims, EA SPORTS, Battlefield, Apex Legends, Need for Speed, Titanfall and Plants vs. Zombies are trademarks of Electronic Arts Inc. FIFA, John Madden and NFL are property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Computer Entertainment Inc.\n\n*REQUIRES THE SIMS 4 ON APPLICABLE PLATFORM (SOLD SEPARATELY) AND ALL GAME UPDATES TO PLAY. FOR PC AND MAC, SEE MINIMUM SYSTEM REQUIREMENTS FOR THIS PACK.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005974/en/\nJino Talens\nSr. PR Manager\njtalens@ea.com\n650-628-9111\n\nRay Almeda\nSenior Communications Specialist\nralmeda@ea.com\n650-628-7015\nSource: Electronic Arts"
    },
    {
        "title": "It’s Grow Time! Plants Vs. Zombies: Battle for Neighborville Available Worldwide Today",
        "subtitle": "",
        "date": "Oct 18, 2019 9:00AM EDT",
        "content": "\nPrepare to Kick Some Grass with the Wackiest Shooter Experience;\nStandard and Deluxe Editions Now Available on PS4, Xbox One and PC\n\nWatch the Cinematic Launch Trailer Here\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nPopCap™, creator of one of the world’s most beloved video game franchises and a studio of Electronic Arts Inc. (NASDAQ: EA), today announced that Plants vs. Zombies: Battle for Neighborville™ is now available in stores and for digital download on PlayStation®4, Xbox One®, and PC via Origin™.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191018005196/en/Plants vs. Zombies: Battle for Neighborville (Graphic: Business Wire)\nThe newest entry in the world’s wackiest shooter franchise features the expansive suburban region of Neighborville where another coniferous conflict between the brain-less and botanicals is brewing. The battle continues to bloom with three free-roam regions that will have players kicking grass beyond the town. With 20 fully customizable character classes, six glorious online multiplayer modes and the new Giddy Park social region, Plants vs. Zombies: Battle for Neighborville is blooming with freshly picked content for players of all walks of life.\n\n“We’re thrilled for adventure-seeking neighbors around the world to fully experience our biggest and most accessible shooter ever with Plants vs Zombies: Battle for Neighborville,” said Rob Davidson, Game Director at PopCap in Vancouver. “We set out to release an early edition of our game that was available for six weeks before today so we could polish performance, listen to feedback and establish a more stable launch. We thank our fans for joining us on this journey.”\n\nLike the previous Plants vs. Zombies™ shooter titles, over-the-top multiplayer gameplay continues to plant itself at the core of Plants vs. Zombies: Battle for Neighborville with six online multiplayer modes including the new and frenetic 4v4 Battle Arena in the Funderdome. Alongside returning character favorites such as Peashooter, Sunflower, Imp and Mech and Soldier, players will bring even more strategic depth to the all-out botanical battle with six newly-sprouted faces such as the flame-blowing Snapdragon, and a new zombie of few words and fewer thoughts, 80s Action Hero. Also, new to the lineup is the Team Play character class where you and up to three others play together as Oak and Acorn for the plants and Space Cadet for the Zombie faction. All characters can get decked out with the wildest customizations yet.\n\nRidiculous quests, vibrant cosmetics and a familiar cast of zany characters are scattered across the game’s three free-roam regions, including the familiar central location of Neighborville Town Center, as well as adventuring through the outer edges of Neighborville in the hot and dusty Mount Steep, and the lush and strange Weirding Woods. Players can join forces in split screen couch co-op* and online co-op across every mode, whether it is battling through the flourishing free-roam regions or jumping into online multiplayer battles.\n\nAdditionally, players can jump down into the new Giddy Park social region in-between the action to engage in light multiplayer battles, while on different amusement park rides, or use the social board to interact with other players and group up. Giddy Park also includes a target range to test each character’s wildly different abilities and also a giant piano to play a catchy tune. Transformative monthly events such as October’s spooky Lawn of Doom Festival will also allow players to unlock seasonal cosmetic rewards and challenges.\n\nPlants vs. Zombies: Battle for Neighborville Standard Edition includes the full base game for $39.99**. The Deluxe Edition includes 2 legendary costumes for Peashooter and 80s Action Hero, an exclusive Battle for Neighborville digital comic and 5 emojis for $49.99**. Passionate fans who purchased the Founder’s Edition, an early edition of the game with exclusive cosmetic rewards, won’t miss a beat as their game progression transferred today to the full Standard Edition. Those who purchased the Founder’s Edition or Standard Edition can also upgrade to the digital Deluxe Edition for $9.99** USD today.\n\nEA Access*** and Origin™ Access*** Basic subscribers can enjoy up to 10 hours of play time, along with 10% off the purchase of the full game. Origin Access Premier subscribers get all the benefits of Basic on top of full access to the game on PC for as long as they are subscribed.\n\nAll Plants vs. Zombies: Battle for Neighborville players can build roots on forums and social networks via Facebook, Twitter, Instagram, and YouTube for more details on updates and upcoming events. For more information, visit the official website and sign up to receive the latest news.\n\nDOWNLOAD LAUNCH ASSETS at PRESS.EA.COM\n\n*SPLIT SCREEN COUCH-OP ONLY AVAILABLE ON PS4/XBOX ONE.\n\n**References to the Deluxe Edition and Standard Edition pricing are based on EA’s MSRP.\n\n*** CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE ea.com/ea-access/terms AND origin.com/store/origin-access/terms FOR DETAILS.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at http://www.ea.com/news.\n\nEA SPORTS, PopCap, Origin, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall, Plants vs. Zombies and Plants vs. Zombies: Battle for Neighborville are trademarks of Electronic Arts Inc. ©FIFA and FIFA's Official Licensed Product Logo are copyrights and/or trademarks of FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. John Madden and NFL are property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Computer Entertainment Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191018005196/en/\nJino Talens\nSr. PR Manager\njtalens@ea.com\n650-628-9111\n\nRay Almeda\nSr. Communications Specialist\nralmeda@ea.com\n650-628-7015\nSource: Electronic Arts"
    },
    {
        "title": "EA SPORTS FIFA 20 Celebrates 10 Million Players",
        "subtitle": "",
        "date": "Oct 10, 2019 1:00PM EDT",
        "content": "\nEveryone In The Game by October 17 Will Receive VOLTA COINS and New Squad Building Challenges\n\n1.2 Billion Goals Scored Across More Than 450 Million Matches in FIFA 20 Since EA Access and Origin Access Launch\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nSince EA SPORTS™ FIFA 20 launched on EA Access* and Origin Access*, more players than ever are getting into the game early with over 10 million players already competing on professional pitches and futsal cages around the world. To celebrate, players who get into the game by October 17 will be rewarded with 8,000 VOLTA COINS** to customize their avatar and express their style with newly available items in the latest VOLTA Drop. In addition, players can also participate in a new VOLTA FOOTBALL Squad Building Challenge puzzle to earn in-game rewards.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191010005721/en/EA SPORTS FIFA 20 celebrates 10 million players in the game since EA Access and Origin Access launch (Graphic: Business Wire)\nAcross the globe, EA SPORTS™ FIFA continues to be the world's most played sports game:\n\nTo learn more about how players are experiencing The World’s Game, check out the infographic: https://www.ea.com/games/fifa/fifa-20/news/fifa-20-10-million-players-infographic\n\nFIFA 20 is developed by EA Vancouver and EA Romania and is available worldwide on PlayStation® 4, Xbox One, and PC. Join the EA SPORTS FIFA community at Facebook and on Instagram, or follow us on Twitter @easportsfifa.\n\n*CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE ea.com/ea-access/terms AND origin.com/store/origin-access/terms FOR DETAILS.\n\n**THIS OFFER IS BEING ISSUED TO YOU FOR PROMOTIONAL PURPOSES ONLY AND DOES NOT HAVE A CASH VALUE. LOG INTO FIFA 20 BY 10:00AM PST OCTOBER 17, 2019 FOR AUTOMATIC ENTITLEMENT TO VOLTA COINS. OFFER EXPIRES OCTOBER 17, 2019 at 10:00AM PST. VALID WHEREVER FIFA 20 IS SOLD. MAY NOT BE COMBINED WITH ANY OTHER PROMOTIONAL OR DISCOUNT OFFER, UNLESS EXPRESSLY AUTHORIZED BY EA; MAY NOT BE COMBINED WITH ANY PREPAID CARD REDEEMABLE FOR THE APPLICABLE CONTENT. LIMIT ENTITLEMENT PER PERSON. OFFER MAY NOT BE SUBSTITUTED, EXCHANGED, SOLD OR REDEEMED FOR CASH OR OTHER GOODS OR SERVICES. VOID WHERE PROHIBITED, TAXED OR RESTRICTED BY LAW.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Origin, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall, Plants vs. Zombies are trademarks of Electronic Arts Inc. ©FIFA and FIFA’s Official Licensed Product Logo are copyrights and/or trademarks of FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. John Madden and NFL are property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Computer Entertainment Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005721/en/\nJino Talens\nSr. PR Manager\n650-628-9111\njtalens@ea.com\n\nCait Doherty\nGlobal PR Manager\n+41 7544-22264\ncadoherty@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "EA to Release Second Quarter Fiscal Year 2020 Results on October 29, 2019",
        "subtitle": "",
        "date": "Oct 8, 2019 4:05PM EDT",
        "content": "    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nElectronic Arts Inc. (NASDAQ: EA) will release its financial results for the second fiscal quarter, which ended September 30, 2019, after the close of market on Tuesday, October 29, 2019. In conjunction with this release, EA will host a conference call to review its financial results for the second fiscal quarter, discuss its outlook for the future and may disclose other material developments affecting its business and/or financial performance. Listeners may access the conference call live via a dial-in number or audio webcast.\n\nTuesday, October 29, 2019\n2:00 pm Pacific Time (5:00 pm Eastern Time)\n\nDial-in numbers:\nDomestic: (866) 393-4306; International: (734) 385-2616\nConference ID: 9877505\n\nWebcast: http://ir.ea.com\n\nEA’s financial results release will be available after the close of market on October 29, 2019 on EA’s website at http://ir.ea.com. A dial-in replay of the conference call will be available until November 13, 2019 at (855) 859-2056 (domestic) or (404) 537-3406 (international) using pin code 9877505. An audio webcast replay of the conference call will be available for one year at http://ir.ea.com.\n\nUpdates regarding EA’s business are available on EA’s blog at www.ea.com/news.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nSafe Harbor for Forward-Looking Statements\n\nDuring the course of the presentation, Electronic Arts may make forward-looking statements regarding future events or the future financial performance of the company. Statements including words such as “anticipate,” “believe,” “expect,” “intend,” “estimate,” “plan,” “predict,” “seek,” “goal,” “will,” “may,” “likely,” “should,” “could” (and the negative of any of these terms), “future” and similar expressions also identify forward-looking statements. These forward-looking statements are not guarantees of future performance and reflect management’s current expectations. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that might cause or contribute to such differences include those discussed in Part II, Item 1A of Electronic Arts’ latest Quarterly Report on Form 10-Q under the heading “Risk Factors”, as well as in other documents we have filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the fiscal year ended March 31, 2019. We assume no obligation to revise or update any forward-looking statement for any reason, except as required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191008005813/en/\nChris Evenden\nVP, Investor Relations\n650.628.0255\ncevenden@ea.com\n\nJohn Reseburg\nVP, Corporate Communications\n650.628.3601\njreseburg@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Electronic Arts and FIFA Announce the Return of the esport for the World’s Game – The EA SPORTS FIFA 20 Global Series on The Road to the FIFA eWorld Cup",
        "subtitle": "",
        "date": "Oct 7, 2019 8:00AM EDT",
        "content": "\nMillions of Players from More than 60 Nations Expected to Compete; More than a Projected 20 Official League Partners to Host Tournaments; Watch Today’s EA SPORTS FIFA 20 Global Series Twitch Kickoff Show to Learn More\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday, Electronic Arts Inc. (NASDAQ: EA) and Fédération Internationale de Football Association (FIFA) announced the launch of the EA SPORTS™ FIFA 20 Global Series on The Road to the FIFA eWorld CupTM. Millions will compete in this robust and accessible nine-month competition with a prize pool now exceeding $3 million up for grabs.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191007005356/en/(Graphic: Business Wire)\nThe EA SPORTS FIFA 20 Global Series continues to expand as more than 20 of the world’s most notable football leagues will run local events. Residents within each respective nation can sign-up and compete. League partners include the Premier League, Australian A-League, Austrian Bundesliga, Bundesliga, Danish Superliga, LaLiga, LFP, Maltese Premier League, Norwegian Elite Serien, Polish Ekstraklasa, Saudi Professional League, Ukrainian Premier League and more. The UEFA eChampions League also returns as EA SPORTS FIFA 20 Global Series stars will represent the top clubs in the world.\n\n“The EA SPORTS FIFA 20 Global Series is the most inclusive esports competition on the planet,” said FIFA Competitive Gaming Commissioner Brent Koning. “Anyone can become a superstar and the opportunity to do so has accelerated with the more than 20 official league partners now in the mix. This connection to global sport drives viewer intrigue, and that positions us well for surpassing last year’s 800 million minutes of EA SPORTS FIFA 19 Global Series content watched.”\n\nCatch former U.S. Men’s National Team player Jimmy Conrad, current EA SPORTS FIFA competitor and content creator Mike Labelle, and notable esports commentator and host Dan Gaskin provide a comprehensive overview of the EA SPORTS FIFA 20 Global Series. They’ll cover everything you need to know about the new season, plus discuss early EA SPORTS FIFA 20 tips and tricks today, October 7 at 7 pm UK local time on the EA SPORTS FIFA Twitch channel.\n\nThe EA SPORTS FIFA 20 Global Series schedule can be found at http://www.futchampions.com and below are additional ways to compete and watch.\n\nAll eligible players interested in joining the EA SPORTS FIFA 20 Global Series* need to register at http://www.futchampions.com between now and October 31, 2019 or from January 16, 2020 and January 31, 2020. As a registered player, you can become FUT Champions Verified by achieving a ranking of Elite 1 in Weekend League after which you may receive invitations to play in online qualifier tournaments and earn EA SPORTS FIFA 20 Global Series Ranking Points. Rankings throughout the season will be available on FIFA.gg. For more EA SPORTS FIFA 20 competitive details, please CLICK HERE.\n\n*Eligibility restrictions apply. See Official Rules for details. Final terms and structure subject to change.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191007005356/en/\nElectronic Arts Inc.\nTravis Varner, 650-628-2717\nManager, Strategic Communications\ntvarner@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "EA SPORTS FIFA 20 Returns to the Streets With All-New VOLTA FOOTBALL Mode Available Worldwide Today",
        "subtitle": "",
        "date": "Sep 27, 2019 1:09PM EDT",
        "content": "\nPlay the Prestige Levels of Professional Football or Jump into the All-New Authentic Small-Sided Football Experience in FIFA 20\n\nWatch the Launch of The Groundbreakers, an Original Series Featuring Raheem Sterling, Jadon Sancho and Megan Rapinoe, Who Move the Game Forward Breaking New Ground Here\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday, Electronic Arts Inc. (NASDAQ: EA) launched EA SPORTS™ FIFA 20 across PlayStation®4, Xbox One, and PC. Fans can experience the brand-new VOLTA FOOTBALL* mode, inspired by the small-sided form of football played in the streets, cages and futsal courts across the world. Players can also jump into FIFA Ultimate Team™ to play new social experiences such as FUT Friendlies or check out Season Objectives where they can unlock new club customization content. Learn more about all the newest additions to FIFA 20, including the all-new approach to gameplay with Football Intelligence here.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190927005419/en/Play the Prestige Levels of Professional Football or Jump into the All-New Authentic Small-Sided Football Experience in FIFA 20 (Photo: Business Wire)\nSince EA Access** and Origin Access** launch last week, millions of players around the world have already started to build their dream squads and gone head-to-head on the pitch, with more than 57 million total matches played, 3.2 million squads created, and over 52 million goals scored in the game.\n\n“Each year we look to add more ways for our players to engage, from mode innovations to gameplay mechanics to delivering the most authentic experience to date,” said Aaron McHardy, Executive Producer for EA SPORTS FIFA. “This year, we’ve also introduced VOLTA FOOTBALL that adds a completely new dimension to the game and brings FIFA 20 back to the streets and futsal courts where a lot of football players from all over the world started out. It’s an experience our players have asked us to bring back, which we’re excited to deliver as we continue to build the world’s game.”\n\nIn VOLTA FOOTBALL, players build their own character, express their individual style, and immerse themselves in a realistic small sided experience. A brand-new style of gameplay grounded in football realism immerses players in the flow of the street with new tools including simplified flicks and skill moves, new flair animations, or using the wall as a teammate.\n\nIn addition, more than 30 official leagues, 700 teams, 17,000 authentic players, and 90 licensed stadiums from all over the world bring one of the most authentic sports video games to life. Check out all the available licenses, including exclusive access to the world’s biggest competitions, from the pinnacle of club football with the UEFA Champions League to the unrivalled fandom of the Bundesliga, Premier League, LaLiga Santander and so much more here.\n\nFans of EA SPORTS FIFA can also jump into the newly released season of FIFA Mobile on iOS and Android to challenge friends in real-time 11v11 matches, play over 650 new events against real-world clubs in World Tour, and earn rewards to climb to the top of tiered leaderboards. To see all the latest ways to play in FIFA Mobile, check out www.ea.com/games/fifa/fifa-mobile.\n\nEA Access** and Origin™ Access** Basic subscribers can enjoy up to 10 hours of play time, along with 10% off the purchase of the full game. Origin Access Premier subscribers get all the benefits of Basic on top of full access to the game on PC for as long as they are subscribed. Additionally, EA Access and Origin Access subscribers can unlock a new custom kit each month in EA SPORTS FIFA Ultimate Team™ as an exclusive reward for the first 5 months***.\n\nFIFA 20 is developed by EA Vancouver and EA Romania and is available worldwide today on PlayStation® 4, Xbox One, and PC. Join the EA SPORTS FIFA community at Facebook and on Instagram, or follow us on Twitter @easportsfifa.\n\n* VOLTA FOOTBALL MODE IS AVAILABLE ON XBOX ONE, PLAYSTATION 4 AND PC PLATFORM VERSIONS ONLY. FOR MORE DETAILS VISIT https://www.ea.com/games/fifa/fifa-20/volta.\n\n** CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE ea.com/ea-access/terms AND origin.com/store/origin-access/terms FOR DETAILS.\n\n*** THIS OFFER IS BEING ISSUED TO YOU FOR PROMOTIONAL PURPOSES ONLY AND DOES NOT HAVE A CASH VALUE. OFFER EXPIRES 11:59 PM PST 29 FEB. GOOD ONLY FOR EA ACCESS AND ORIGIN ACCESS MEMBERS WITH FIFA 20 DOWNLOADED. LOG IN EACH MONTH TO CLAIM THE CUSTOM KIT REWARD FOR THAT MONTH [12:00 AM PST 1 Oct - 11:59 PM PST 31 Oct; 12:00 AM PST 1 Nov – 11:59 PM PST 1 Dec; 12:00 AM PST 2 Dec – 11:59 PM PST 1 Jan; 12:00 AM PST 2 Jan – 11:59 PM PST 2 Feb; 12:00 AM PST 3 Feb – 11:59 PM PST 29 Feb]. EACH KIT WILL BE ENTITLED TO THE EA ACCOUNT ASSOCIATED WITH THE EA ACCESS/ORIGIN ACCESS SUBSCRIPTION. OFFER MAY NOT BE SUBSTITUTED, EXCHANGED, SOLD OR REDEEMED FOR CASH OR OTHER GOODS OR SERVICES. MAY NOT BE COMBINED WITH ANY OTHER PROMOTIONAL OR DISCOUNT OFFER, UNLESS EXPRESSLY AUTHORIZED BY EA; MAY NOT BE COMBINED WITH ANY PREPAID CARD REDEEMABLE FOR THE APPLICABLE CONTENT. VOID WHERE PROHIBITED, TAXED OR RESTRICTED BY LAW.\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nEA SPORTS, Origin, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall, Plants vs. Zombies are trademarks of Electronic Arts Inc. ©FIFA and FIFA’s Official Licensed Product Logo are copyrights and/or trademarks of FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. John Madden and NFL are property of their respective owners and used with permission. PlayStation is a registered trademark of Sony Computer Entertainment Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190927005419/en/\nJino Talens\nSr. PR Manager\n650-628-9111\njtalens@ea.com \n\nCait Doherty\nGlobal PR Manager\n+41 7544-222\ncadoherty@ea.com\nSource: Electronic Arts Inc."
    },
    {
        "title": "Experience WWII With Medal of Honor: Above and Beyond, Coming Exclusively for Virtual Reality, on Oculus Rift",
        "subtitle": "",
        "date": "Sep 25, 2019 2:30PM EDT",
        "content": "\nStep into the Shoes of an Agent in the Office of Strategic Services in the Full-Length Campaign\n\nSee Powerful, First-Hand Stories from Veterans Told through Interviews and 3600 Footage\n    REDWOOD CITY, Calif.--(BUSINESS WIRE)--\nToday at Oculus Connect 6, Respawn™ Entertainment, a studio of Electronic Arts Inc. (NASDAQ:EA) and Oculus from Facebook revealed Medal of Honor™: Above and Beyond, coming next year exclusively to VR, on the Oculus Rift platform. Medal of Honor: Above and Beyond will deliver its most authentic and immersive World War II experience from the series to date.\n\nThe game, which is being built for Oculus Rift from the ground up by a team comprised of veteran developers of the series, will put players in the role of an agent in the Office of Strategic Services (OSS). Players will go behind enemy lines to sabotage Nazi facilities, subvert enemy plans, and aid the French Resistance. Players will also experience a rich, exciting single-player campaign that takes them through historic events on land, air, and sea, all in virtual reality. Watch the first gameplay footage in the developer diary here.\n\nAdditionally, Medal of Honor: Above and Beyond will include unique multiplayer modes and features when it releases in Summer 2020. The game will lean into the franchise’s history of education through entertainment, bringing the stories of WWII veterans to life for players in emotionally powerful ways.\n\n“It’s a great feeling to introduce Medal of Honor to a whole new generation of gamers on a new platform for the franchise,” said Peter Hirschmann, Game Director. “I’ve been fortunate to be a part of this franchise since the beginning, and putting this game on the Oculus Rift allows us to be more immersive than we’ve ever been before. If the game we’re making ignites people’s imaginations and illuminates the world, then we’ve accomplished what we’ve set out to do.”\n\nAbout Electronic Arts\n\nElectronic Arts (NASDAQ: EA) is a global leader in digital interactive entertainment. The Company develops and delivers games, content and online services for Internet-connected consoles, mobile devices and personal computers.\n\nIn fiscal year 2019, EA posted GAAP net revenue of $4.95 billion. Headquartered in Redwood City, California, EA is recognized for a portfolio of critically acclaimed, high-quality brands such as EA SPORTS™ FIFA, Battlefield™, Apex Legends™, The Sims™, Madden NFL, Need for Speed™, Titanfall™ and Plants vs. Zombies™. More information about EA is available at www.ea.com/news.\n\nMedal of Honor, Respawn, EA, EA SPORTS, Battlefield, Apex Legends, The Sims, Need for Speed, Titanfall and Plants vs. Zombies are trademarks of Electronic Arts Inc. FIFA, John Madden and NFL are the property of their respective owners and used with permission.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190925005305/en/\nJino Talens\nSr. PR Manager\njtalens@ea.com\n650-628-9111\nSource: Electronic Arts"
    }
]