[
    {
        "title": "eBay Inc. Prices $1 Billion Senior Unsecured Notes Offering",
        "subtitle": "",
        "date": "Mar 4, 2020 6:30PM EST",
        "content": "SAN JOSE, Calif., March 4, 2020 /PRNewswire/ -- eBay Inc. (Nasdaq: EBAY) today announced the pricing of a $1 billion underwritten public offering of its senior unsecured notes, consisting of $500 million of 1.900% Notes due 2025 (the \"2025 Notes\") and $500 million of 2.700% Notes due 2030 (the \"2030 Notes\"). The public offering price of the 2025 Notes is 99.782% of the principal amount and the public offering price of the 2030 Notes is 99.843% of the principal amount, in each case plus accrued interest, if any. The offering is expected to close on March 11, 2020, subject to customary closing conditions.\n                        \n                    \n                eBay intends to use all or a substantial portion of the net proceeds from the offering to repay all of its outstanding 2.150% Notes due 2020 and 3.250% Notes due 2020, with any remaining net proceeds to be used for general corporate purposes, which may include capital expenditures, share repurchases, repayment of other indebtedness and possible acquisitions. The offering is being made through an underwriting syndicate led by BofA Securities, Inc., Credit Suisse Securities (USA) LLC, Wells Fargo Securities, LLC, Deutsche Bank Securities Inc. and J.P. Morgan Securities LLC, as joint book-running managers, and BNP Paribas Securities Corp., Citigroup Global Markets Inc., Goldman Sachs & Co. LLC, HSBC Securities (USA) Inc., Morgan Stanley & Co. LLC, MUFG Securities Americas Inc., RBC Capital Markets, LLC and Standard Chartered Bank, as co-managers.  Copies of the prospectus supplement and prospectus related to the offering may be obtained by contacting BofA Securities, Inc.,  200 North College Street, NC1-004-03-43, Charlotte, NC 28255-0001, Attention: Prospectus Department, by telephone at 1-800-294-1322 or by emailing dg.prospectus_requests@bofa.com; Credit Suisse Securities (USA) LLC, Eleven Madison Avenue, 3rd floor, New York, NY 10010, Attention: Prospectus Department, by telephone at 1-800-221-1037 or by emailing usa.prospectus@credit-suisse.com or Wells Fargo Securities, LLC, 608 2nd Avenue South, Suite 1000, Minneapolis, MN 55402, Attention: WFS Customer Service,  by telephone at 1-800-645-3751 or by emailing wfscustomerservice@wellsfargo.com.The offering is being made pursuant to an effective shelf registration statement under the Securities Act of 1933, as amended, and these securities are only being offered by means of the prospectus supplement and prospectus related to the offering, which have been or will be filed with the Securities and Exchange Commission. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any offer or sale of these securities, in any state or other jurisdiction where, or to any person to whom, the offer, solicitation or sale of these securities would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.Forward-Looking StatementsThis press release contains forward-looking statements relating to, among other things, the future performance of eBay Inc. and its consolidated subsidiaries (collectively, the \"company\") that are based on the company's current expectations, forecasts and assumptions and involve risks and uncertainties. These statements include, but are not limited to, statements regarding the planned closing of and expected use of proceeds from the Company's senior unsecured notes offering as described above. Actual results could differ materially from those predicted or implied and reported results should not be considered as an indication of future performance. Factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade; the company's ability to realize growth opportunities in payments intermediation and advertising; the outcome of the strategic portfolio reviews; fluctuations in foreign currency exchange rates; the company's need to successfully react to the increasing importance of mobile commerce and the increasing social aspect of commerce; an increasingly competitive environment for its business; changes to the company's capital allocation, including the timing, declaration, amount and payment of any future dividends or levels of the company's share repurchases, or management of operating cash; the company's ability to increase operating efficiency to drive margin improvements and enable reinvestments; the company's ability to manage its indebtedness, including managing exposure to interest rates and maintaining its credit ratings; the company's need to manage an increasingly large enterprise with a broad range of businesses of varying degrees of maturity and in many different geographies; the ability to successfully intermediate payments on the company's marketplace platform; the company's need and ability to manage regulatory, tax, data security and litigation risks; the company's ability to timely upgrade and develop its technology systems, infrastructure and customer service capabilities at reasonable cost while maintaining site stability and performance and adding new products and features; and the company's ability to integrate, manage and grow businesses that have been acquired or may be acquired in the future. More information about factors that could adversely affect the company's operating results and the market value of the notes referenced above is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K, a copy of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov, and under the caption \"Risk Factors\" in the prospectus supplement and prospectus related to the offering. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements. The information contained in, or that can be accessed through, the company's websites (including, without limitation, the Investor Relations website mentioned in this paragraph) is not part of or incorporated by reference into this press release. Any references to the company's websites are intended to be inactive textual references only. View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-inc-prices-1-billion-senior-unsecured-notes-offering-301016840.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Will Begin Managing Payments in the United Kingdom",
        "subtitle": "",
        "date": "Feb 25, 2020 7:01PM EST",
        "content": "LONDON, Feb. 25, 2020 /PRNewswire/ -- As part of modernizing its marketplace and creating a more streamlined experience for customers, eBay is expanding its management of payments to the United Kingdom. As part of the rollout this summer, the company will offer buyers flexibility and choice in payment methods, and give sellers an easier way to manage their businesses.The U.K. is the third market to offer eBay's new payments experience, after the U.S. and Germany.\"We're creating a modern managed marketplace. Taking control of the payments process on our platform is a key component of our strategy to enhance the eBay experience by breaking down barriers and removing complexities for our customers,\" said VP of Global Payments Alyssa Cutright. \"We've seen great success in the U.S. and Germany and we're thrilled to expand to the U.K.\"\"By starting to manage payments in the U.K. this year, we're taking another step to deliver improvements for our customers,\" said VP of eBay U.K. Rob Hattrell. \"We know that sellers and buyers expect smooth and seamless transactions, and this new payments experience is designed to offer exactly that. In the coming months, we will make the transition as smooth as possible for sellers so they can take advantage of this important update quickly.\"eBay plans to offer buyers in the U.K. a variety of payment options, including credit card, Google Pay and PayPal. Apple Pay will also be available as a payment option on iPhone and iPad. eBay started managing payments on its platform in the U.S. with a select group of sellers in September 2018, and expanded the experience to Germany in September 2019. The rollout has been paced by the terms of the Operating Agreement with PayPal, which expires in the second half of this year. The company continues to make tremendous progress with its managed payments, having processed more than $2 billion in GMV for almost 25,000 sellers, and saving sellers almost $10 million as of the end of Q4 2019. Later this year, the company will continue its global expansion and expects to have transitioned a majority of its U.K. business sellers by the end of 2020 and a majority of its marketplace customers in 2021. About eBayeBay Inc. (Nasdaq: EBAY) is a global commerce leader including the Marketplace and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, California, eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection.Forward Looking StatementsThis announcement contains forward-looking statements relating to, among other things, the future events and future performance of the company and reflect, among other things, eBay's expectation regarding the anticipated benefits of the company's initiative to intermediate payments on its Marketplace platform.Forward-looking statements involve risks and uncertainties which may cause actual results to differ materially from the statements made. Factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade; the timing and possible outcome of this initiative; the possibility that the initiative may be delayed or abandoned; and the possibility that it may take the company longer than expected to fully realize any anticipated benefits of the initiative, and those benefits may ultimately be smaller than anticipated or may not be realized at all.More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov. All information in this release is as of February 25, 2020. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-will-begin-managing-payments-in-the-united-kingdom-301011093.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Issues Statement on Strategic Review Process for eBay Classifieds Group",
        "subtitle": "",
        "date": "Feb 21, 2020 6:34PM EST",
        "content": "SAN JOSE, Calif., Feb. 21, 2020 /PRNewswire/ -- eBay Inc. (Nasdaq: EBAY), a global commerce leader that connects millions of buyers and sellers around the world, today issued the following statement regarding the previously announced strategic review of eBay's Classifieds Group (\"Classifieds\").eBay has been exploring potential value-creating alternatives for Classifieds and continues to be in active discussions with multiple parties regarding a potential transaction. As previously noted, eBay expects to provide an update regarding this process by the middle of the year. eBay remains committed to maximizing the value of Classifieds for eBay shareholders.The strategic review of Classifieds is part of eBay's broader portfolio review, which resulted in the successful sale of StubHub for $4.05 billion in cash.  \"eBay's Board and management are committed to driving significant returns to shareholders by maximizing the value of Classifieds and positioning our Marketplace business for long-term success,\" said Scott Schenkel, interim CEO of eBay Inc. \"The Classifieds review process, together with the StubHub sale and our initiatives to increase volume, revenues, margins, and cash flow while continuing to invest in long-term profitable growth, demonstrate this commitment. We are acting with urgency while focusing on the ultimate objective of maximizing the value of Classifieds.\"In addition to eBay's portfolio review, the Company's management team has executed numerous value creating actions since the beginning of 2019 that are transforming eBay's business and strengthening its foundation for growth. Among others, these actions include:eBay's Board and management team are confident that the above actions will help achieve the previously stated priorities for 2020 and position eBay for sustainable, profitable long-term growth.Goldman Sachs & Co. LLC and LionTree Advisors LLC are acting as financial advisors to eBay on the strategic review of Classifieds, and Wachtell, Lipton, Rosen & Katz is acting as legal counsel.About eBay        eBay Inc. (Nasdaq: EBAY) is a global commerce leader including the Marketplace and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, California, eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.Forward Looking StatementsThis press release contains forward-looking statements that are based on the company's current expectations, forecasts and assumptions and involve risks and uncertainties. These statements include, but are not limited to, statements regarding the future performance of eBay Inc. and its consolidated subsidiaries, including the future growth in its business, operating efficiency and margins, reinvestments, dividends, share repurchases, and the expected timing of the announcements regarding the company's strategic portfolio review, including the timing and other expectations regarding the Classifieds review process. Actual results could differ materially from those predicted or implied and reported results should not be considered as an indication of future performance. Other factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade; the company's ability to realize expected growth opportunities in payments intermediation and advertising; the outcome of the strategic portfolio review; fluctuations in foreign currency exchange rates; the company's need to successfully react to the increasing importance of mobile commerce and the increasing social aspect of commerce; an increasingly competitive environment for its business; changes to the company's capital allocation, including the timing, declaration, amount and payment of any future dividends or levels of the company's share repurchases, or management of operating cash; the company's ability to increase operating efficiency to drive margin improvements and enable reinvestments; the company's ability to manage its indebtedness, including managing exposure to interest rates and maintaining its credit ratings; the company's need to manage an increasingly large enterprise with a broad range of businesses of varying degrees of maturity and in many different geographies; the ability to successfully intermediate payments on our marketplace platform; the company's need and ability to manage regulatory, tax, data security and litigation risks; whether the operational, marketing and strategic benefits of the separation of the eBay and PayPal businesses can be achieved; the company's ability to timely upgrade and develop its technology systems, infrastructure and customer service capabilities at reasonable cost while maintaining site stability and performance and adding new products and features; and the company's ability to integrate, manage and grow businesses that have been acquired or may be acquired in the future.More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-issues-statement-on-strategic-review-process-for-ebay-classifieds-group-301009415.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Completes Sale of StubHub",
        "subtitle": "",
        "date": "Feb 13, 2020 4:15PM EST",
        "content": "SAN JOSE, Calif., Feb. 13, 2020 /PRNewswire/ -- eBay Inc. (Nasdaq: EBAY), a global commerce leader that connects millions of buyers and sellers around the world, today announced that it has completed the sale of StubHub to viagogo for $4.05 billion in cash.\"The completed sale of StubHub to viagogo is a great outcome both in terms of the $4.05 billion sale price and the potential StubHub has with its new owner,\" said Scott Schenkel, interim CEO of eBay Inc. \"The StubHub transaction reinforces our commitment to creating shareholder value and is consistent with other steps we have taken such as margin improvement, share buybacks and issuing dividends. We are operating with discipline and focus, improving financial performance and delivering improved customer experiences. On behalf of the eBay team, we're excited to see how StubHub evolves in its next phase and benefits fans, partners and employees.\"The completion of this transaction results in net proceeds of $3.1 billion. With the divestiture of StubHub complete, the Company is updating its capital allocation plans as well as first quarter and full year guidance figures. Capital allocation – eBay is expanding its share buyback plans for 2020 from $1.5 billion to $4.5 billion.  First quarter 2020 – The Company now expects net revenue between $2.31 billion and $2.36 billion, reflecting the impact of removing StubHub. The Company now expects GAAP earnings per diluted share from continuing operations in the range of $0.54 - $0.57 and non-GAAP earnings per diluted share from continuing operations in the range of $0.72 - $0.75. The increase versus previous guidance reflects the benefit of share buybacks and investment timing, partially offset by the impact of removing StubHub.Full year 2020 – The Company now expects net revenue between $9.56 billion and $9.76 billion, reflecting the impact of removing StubHub. The Company now expects GAAP earnings per diluted share from continuing operations in the range of $2.20 - $2.30 and non-GAAP earnings per diluted share from continuing operations in the range of $3.00 - $3.10. The increase versus previous guidance reflects the benefit of share buybacks, partially offset by the impact of removing StubHub.Please reference the 8-Ks eBay filed today for further information.About eBayeBay Inc. (Nasdaq: EBAY) is a global commerce leader including the Marketplace and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, California, eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.Non-GAAP Financial MeasuresThis press release includes the financial measures defined as \"non-GAAP financial measures\" by the Securities and Exchange Commission (SEC), including non-GAAP earnings per diluted share. These non-GAAP financial measures are presented on a continuing operations basis. These measures may be different from non-GAAP financial measures used by other companies. The presentation of this financial information, which is not prepared under any comprehensive set of accounting rules or principles, is not intended to be considered in isolation of, or as a substitute for, the financial information prepared and presented in accordance with generally accepted accounting principles (GAAP). For a reconciliation of non-GAAP earnings per diluted share to the nearest comparable GAAP measure, see \"Business Outlook\" included in this press release. Forward Looking StatementsThis press release contains forward-looking statements that are based on our current expectations, forecasts and assumptions and involve risks and uncertainties. These include statements regarding the future performance of eBay Inc. and its consolidated subsidiaries, including expected financial results for the first quarter and full year 2020 and eBay's expectations and plans regarding future share repurchases. Actual results could differ materially from those predicted or implied and reported results should not be considered as an indication of future performance. Other factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade, including any public health crisis; the company's ability to realize expected growth opportunities in payments intermediation and advertising; the outcome of the strategic portfolio review; fluctuations in foreign currency exchange rates; the company's need to successfully react to the increasing importance of mobile commerce and the increasing social aspect of commerce; an increasingly competitive environment for its business; changes to the company's capital allocation, including the timing, declaration, amount and payment of any future dividends or levels of the company's share repurchases, or management of operating cash; the company's ability to increase operating efficiency to drive margin improvements and enable reinvestments; the company's ability to manage its indebtedness, including managing exposure to interest rates and maintaining its credit ratings; the company's need to manage an increasingly large enterprise with a broad range of businesses of varying degrees of maturity and in many different geographies; the ability to successfully intermediate payments on the company's marketplace platform; the company's need and ability to manage regulatory, tax, data security and litigation risks; whether the operational, marketing and strategic benefits of the separation of the eBay and PayPal businesses can be achieved; the company's ability to timely upgrade and develop its technology systems, infrastructure and customer service capabilities at reasonable cost while maintaining site stability and performance and adding new products and features; and the company's ability to integrate, manage and grow businesses that have been acquired or may be acquired in the future.  The forward-looking statements in this release do not include the potential impact of any acquisitions or divestitures that may be announced and/or completed after the date hereof.More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements.eBay Inc.Business OutlookThe guidance figures provided below and elsewhere in this press release are forward-looking statements, reflect a number of estimates, assumptions and other uncertainties, and are approximate in nature because the company's future performance is difficult to predict. Such guidance is based on information available on the date of this press release, and the company assumes no obligation to update it.The company's future performance involves risks and uncertainties, and the company's actual results could differ materially from the information below and elsewhere in this press release. Some of the factors that could affect the company's operating results are set forth under the caption \"Forward-Looking Statements\" above in this press release. More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its most recent annual report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting eBay's investor relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov.    View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-completes-sale-of-stubhub-301004896.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Study Finds That Selling Through Online Marketplaces Enables Small Business Owners and Entrepreneurs Worldwide to Reinvest in Their Local Communities",
        "subtitle": "",
        "date": "Feb 11, 2020 9:00AM EST",
        "content": "SAN JOSE, Calif., Feb. 11, 2020 /PRNewswire/ -- eBay Inc. (Nasdaq: EBAY), a global commerce leader, today announced the launch of its Global Marketplace Index (GMI) measuring the impact of online marketplaces like eBay in creating economic opportunities that empower small business owners and entrepreneurs.The platform-agnostic study revealed that, for small business owners around the world, selling through online marketplaces has enabled them to contribute to keeping \"Main Streets\" in their local communities booming while also allowing them to feel financially secure in their venture. The results were particularly interesting in the U.S.:\"It's fantastic to see that small business owners – particularly in the U.S. – are able to leverage online marketplaces, like eBay, to support their day-to-day financial and familial needs,\" said Marni Levine, Vice President Seller Operations and Engagement at eBay. \"Since the company's earliest days, eBay has viewed ecommerce as a gateway to economic empowerment for entrepreneurs and small businesses by providing a pathway to reach new buyers online with little barrier to entry, regardless of size, background or geographic location.\"The survey additionally found that the majority of U.S. small business owners (69%) claim their income has improved compared to before selling through marketplaces and over 50% say that selling through eBay or other online marketplaces expands their reach so that a majority of their sales come from outside their local community.The GMI identifies five (5) universal dimensions as drivers of empowerment – Lifestyle Impact, Financial Security, Financial Growth, Marketplace Tools and Business Environment. To quantify performance within these dimensions, 2,500 small online business owners were surveyed across five countries (United States, United Kingdom, Germany, Australia and South Korea). Each dimension is equally weighed at 20 points, resulting in a maximum index score of 100 points.Each country scored above 80 in the GMI, demonstrating that small businesses are greatly empowered by selling through marketplaces. According to the survey, 85% of small business owners around the world feel their online business gives them freedom or flexibility and more than 77% say their online business gives them confidence or control. GMI scores for each country are as follows:\"Marketplaces like eBay have proven that ecommerce plays an important role in empowering entrepreneurs,\" said Scott Schenkel, interim-CEO of eBay. \"Given the critical role that small businesses play in fostering economic development and a more inclusive global society, it's essential that we continue to strengthen these businesses and their local communities, as we've done for nearly 25 years.\"To create the GMI, eBay commissioned leading market research firm Euromonitor International. To read the full GMI report, please visit ebayinc.com/GMI.Global Marketplace Index MethodologyThrough 75 in-depth interviews with small business marketplace sellers, Euromonitor found that small business owners universally responded that their drivers of empowerment are the positive impacts on their lifestyles and their wallets. Furthermore, marketplaces must provide the tools and support to enable these positive impacts. Lastly, small business owners emphasized that they could only feel empowered when economic and regulatory conditions in their countries were favorable to their online business success. Based on these interviews, five universal dimensions of empowerment were identified – Lifestyle Impact, Financial Security, Financial Growth, Marketplace Tools and Business Environment.To quantify performance within the dimensions, 2,500 small online business owners were surveyed across these countries and sharp external data points were leveraged. The Global Marketplace Index is scored on a 100-point scale resulting from an aggregation of the total points achieved in the various dimensions. Each dimension accounts for 20 points and has one or more indicators, which quantify the country's performance in the area.About eBayeBay Inc. (Nasdaq: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, California, eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2019, eBay enabled $90 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.Media Contact: Ashley Settle, assettle@ebay.com View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-study-finds-that-selling-through-online-marketplaces-enables-small-business-owners-and-entrepreneurs-worldwide-to-reinvest-in-their-local-communities-301002352.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Comments on Letter from Starboard Value",
        "subtitle": "",
        "date": "Feb 4, 2020 1:15PM EST",
        "content": "SAN JOSE, Calif., Feb. 4, 2020 /PRNewswire/ -- eBay Inc. (Nasdaq: EBAY), a global commerce leader that connects millions of buyers and sellers around the world, today issued the following statement regarding the letter to eBay released by Starboard Value LP (\"Starboard\") this morning:The eBay Board of Directors includes a director jointly nominated and agreed upon with Starboard, a representative of one of our largest shareholders, Elliott Management, and other strong, experienced and independent directors. The Board and eBay's management team are aligned in their commitment to taking all appropriate steps to drive the value of the Company. Our Board and management team have implemented changes based on investor input and have taken significant actions to deliver long-term shareholder value and strengthen the business. Through that lens, we will review Starboard's letter and perspectives as we continue to rigorously review our business and opportunities for growth and value creation.In 2019, we made a number of decisions to enhance value that led to positive results and positioned the Company for future growth, including:While eBay's Board and leadership team are confident that the above actions will help us achieve our previously-stated priorities for 2020 and position eBay for sustainable, profitable long-term growth, we remain open to all value-enhancing opportunities.About eBayeBay Inc. (Nasdaq: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, California, eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2019, eBay enabled $90 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.Forward-Looking StatementsThis press release contains forward-looking statements relating to, among other things, the future performance of eBay Inc. and its consolidated subsidiaries that are based on the company's current expectations, forecasts and assumptions and involve risks and uncertainties. These statements include, but are not limited to, statements regarding the future performance of eBay Inc. and its consolidated subsidiaries, including expected financial results for the first quarter and full year 2020 and the future growth in its business, operating efficiency and margins, reinvestments, dividends, share repurchases, and the expected timing of the announcements regarding the company's strategic portfolio review, including the timing and other expectations regarding the sale of StubHub to viagogo. Actual results could differ materially from those predicted or implied and reported results should not be considered as an indication of future performance. Other factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade; the company's ability to realize expected growth opportunities in payments intermediation and advertising; the outcome of the strategic portfolio review; fluctuations in foreign currency exchange rates; the company's need to successfully react to the increasing importance of mobile commerce and the increasing social aspect of commerce; an increasingly competitive environment for its business; changes to the company's capital allocation, including the timing, declaration, amount and payment of any future dividends or levels of the company's share repurchases, or management of operating cash; the company's ability to increase operating efficiency to drive margin improvements and enable reinvestments; the company's ability to manage its indebtedness, including managing exposure to interest rates and maintaining its credit ratings; the company's need to manage an increasingly large enterprise with a broad range of businesses of varying degrees of maturity and in many different geographies; the ability to successfully intermediate payments on our marketplace platform; the company's need and ability to manage regulatory, tax, data security and litigation risks; whether the operational, marketing and strategic benefits of the separation of the eBay and PayPal businesses can be achieved; the company's ability to timely upgrade and develop its technology systems, infrastructure and customer service capabilities at reasonable cost while maintaining site stability and performance and adding new products and features; and the company's ability to integrate, manage and grow businesses that have been acquired or may be acquired in the future.The forward-looking statements in this release do not include the potential impact of any acquisitions or divestitures that may be announced and/or completed after the date hereof.More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-comments-on-letter-from-starboard-value-300998812.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Inc. Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Jan 28, 2020 4:15PM EST",
        "content": "SAN JOSE, Calif., Jan. 28, 2020 /PRNewswire/ -- eBay Inc. (Nasdaq: EBAY), a global commerce leader that connects millions of buyers and sellers around the world, today reported financial results for its fourth quarter and full year ended December 31, 2019.\"I am proud of how well our teams have executed over the past year and the innovative solutions we have provided for our buyers and sellers,\" said Scott Schenkel, interim Chief Executive Officer of eBay Inc.  \"As we enter 2020, our priorities are clear - we will continue to drive revenue through our growth initiatives, deliver more seller tools, improve the buyer experience by leveraging our structured data foundation, all while driving more margin expansion. We believe these efforts will position us for sustainable, profitable long-term growth and I am excited by the opportunities ahead.\"Fourth Quarter Financial HighlightsFull Year Financial HighlightsBusiness HighlightsOther Selected Financial and Operational ResultsBusiness OutlookDividend DeclarationQuarterly Conference Call and WebcasteBay Inc. will host a conference call to discuss fourth quarter and full year 2019 results at 2:00 p.m. Pacific Time today. Investors and participants can access the call by dialing (866) 211-3115 in the U.S. and (647) 689-6602 internationally. The passcode for the conference line is 9155767. A live webcast of the conference call, together with a slide presentation that includes supplemental financial information and reconciliations of certain non-GAAP measures to their nearest comparable GAAP measures, can be accessed through the company's Investor Relations website at https://investors.ebayinc.com. In addition, an archive of the webcast will be accessible for at least three months through the same link.eBay Inc. uses its Investor Relations website at https://investors.ebayinc.com as a means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD. Accordingly, investors should monitor this website, in addition to following our press releases, SEC filings, public conference calls and webcasts.About eBayeBay Inc. (Nasdaq: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, California, eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2019, eBay enabled $90 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com. PresentationAll growth rates represent year-over-year comparisons, except as otherwise noted. All amounts in tables are presented in U.S. dollars, rounded to the nearest million, except as otherwise noted. As a result, certain amounts may not sum or recalculate using the rounded dollar amounts provided.Non-GAAP Financial MeasuresThis press release includes the following financial measures defined as \"non-GAAP financial measures\" by the Securities and Exchange Commission (SEC): non-GAAP net income, non-GAAP earnings per diluted share, non-GAAP operating margin, non-GAAP effective tax rate, free cash flow and FX-Neutral basis. These non-GAAP financial measures are presented on a continuing operations basis. These measures may be different from non-GAAP financial measures used by other companies. The presentation of this financial information, which is not prepared under any comprehensive set of accounting rules or principles, is not intended to be considered in isolation of, or as a substitute for, the financial information prepared and presented in accordance with generally accepted accounting principles (GAAP). For a reconciliation of these non-GAAP financial measures, except for figures in this press release presented on a \"FX-Neutral basis\", to the nearest comparable GAAP measures, see \"Business Outlook,\" \"Non-GAAP Measures of Financial Performance,\" \"Reconciliation of GAAP Operating Margin to Non-GAAP Operating Margin,\" \"Reconciliation of GAAP Net Income to Non-GAAP Net Income and Reconciliation of GAAP Effective Tax Rate to Non-GAAP Effective Tax Rate\" and \"Reconciliation of Operating Cash Flow to Free Cash Flow\" included in this press release. For figures in this press release reported \"on a FX-Neutral basis\", we calculate the year-over-year impact of foreign currency movements using prior period foreign currency rates applied to current year transactional currency amounts. We define organic FX-Neutral revenue growth as reported revenue growth, excluding incremental revenue from acquisitions or dispositions for the twelve-month period following such acquisitions or dispositions and foreign exchange rate effects.Forward-Looking StatementsThis press release contains forward-looking statements relating to, among other things, the future performance of eBay Inc. and its consolidated subsidiaries that are based on the company's current expectations, forecasts and assumptions and involve risks and uncertainties. These statements include, but are not limited to, statements regarding the future performance of eBay Inc. and its consolidated subsidiaries, including expected financial results for the first quarter and full year 2020 and the future growth in its business, operating efficiency and margins, reinvestments, dividends, share repurchases, and the expected timing of the announcements regarding the company's strategic portfolio review, including the timing and other expectations regarding the sale of StubHub to viagogo. Actual results could differ materially from those predicted or implied and reported results should not be considered as an indication of future performance. Other factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade; the company's ability to realize expected growth opportunities in payments intermediation and advertising; the outcome of the strategic portfolio review; fluctuations in foreign currency exchange rates; the company's need to successfully react to the increasing importance of mobile commerce and the increasing social aspect of commerce; an increasingly competitive environment for its business; changes to the company's capital allocation, including the timing, declaration, amount and payment of any future dividends or levels of the company's share repurchases, or management of operating cash; the company's ability to increase operating efficiency to drive margin improvements and enable reinvestments; the company's ability to manage its indebtedness, including managing exposure to interest rates and maintaining its credit ratings; the company's need to manage an increasingly large enterprise with a broad range of businesses of varying degrees of maturity and in many different geographies; the ability to successfully intermediate payments on our marketplace platform; the company's need and ability to manage regulatory, tax, data security and litigation risks; whether the operational, marketing and strategic benefits of the separation of the eBay and PayPal businesses can be achieved; the company's ability to timely upgrade and develop its technology systems, infrastructure and customer service capabilities at reasonable cost while maintaining site stability and performance and adding new products and features; and the company's ability to integrate, manage and grow businesses that have been acquired or may be acquired in the future.The forward-looking statements in this release do not include the potential impact of any acquisitions or divestitures that may be announced and/or completed after the date hereof.More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements.eBay Inc.Business OutlookThe guidance figures provided below and elsewhere in this press release are forward-looking statements, reflect a number of estimates, assumptions and other uncertainties, and are approximate in nature because the company's future performance is difficult to predict. Such guidance is based on information available on the date of this press release, and the company assumes no obligation to update it.The company's future performance involves risks and uncertainties, and the company's actual results could differ materially from the information below and elsewhere in this press release. Some of the factors that could affect the company's operating results are set forth under the caption \"Forward-Looking Statements\" above in this press release. More information about factors that could affect the company's operating results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its most recent annual report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting eBay's investor relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov.eBay Inc.Non-GAAP Measures of Financial PerformanceTo supplement the company's condensed consolidated financial statements presented in accordance with generally accepted accounting principles, or GAAP, the company uses non-GAAP measures of certain components of financial performance. These non-GAAP measures include non-GAAP net income, non-GAAP earnings per diluted share, non-GAAP operating margin, non-GAAP effective tax rate, free cash flow and figures in this press release presented on a \"FX-Neutral basis\". These non-GAAP financial measures are presented on a continuing operations basis.These non-GAAP measures are not in accordance with, or an alternative to, measures prepared in accordance with GAAP and may be different from non-GAAP measures used by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. Non-GAAP measures have limitations in that they do not reflect all of the amounts associated with the company's results of operations as determined in accordance with GAAP. These measures should only be used to evaluate the company's results of operations in conjunction with the corresponding GAAP measures.Reconciliation to the nearest GAAP measure of all non-GAAP measures included in this press release, except for figures in this press release presented on a \"FX-Neutral basis\", can be found in the tables included in this press release. For figures in this press release reported \"on a FX-Neutral basis\", the company calculates the year-over-year impact of foreign currency movements using prior period foreign currency rates applied to current year transactional currency amounts. The company defines organic FX-Neutral revenue growth as reported revenue growth, excluding incremental revenue from acquisitions or dispositions for the twelve-month period following such acquisitions or dispositions and foreign exchange rate effects.These non-GAAP measures are provided to enhance investors' overall understanding of the company's current financial performance and its prospects for the future. Specifically, the company believes the non-GAAP measures provide useful information to both management and investors by excluding certain expenses, gains and losses, or net purchases of property and equipment, as the case may be, that may not be indicative of its core operating results and business outlook. In addition, because the company has historically reported certain non-GAAP results to investors, the company believes that the inclusion of non-GAAP measures provides consistency in the company's financial reporting.For its internal budgeting process, and as discussed further below, the company's management uses financial measures that do not include stock-based compensation expense, employer payroll taxes on stock-based compensation, amortization or impairment of acquired intangible assets, impairment of goodwill, amortization of deferred tax assets associated with the realignment of its legal structure and related foreign exchange effects, significant gains or losses from the disposal/acquisition of a business, certain gains and losses on investments, gains or losses associated with a warrant agreement that the company entered into with Adyen, restructuring-related charges and the income taxes associated with the foregoing. In addition to the corresponding GAAP measures, the company's management also uses the foregoing non-GAAP measures in reviewing the financial results of the company.The company excludes the following items from non-GAAP net income, non-GAAP earnings per diluted share, non-GAAP operating margin and non-GAAP effective tax rate:Stock-based compensation expense and related employer payroll taxes. This expense consists of expenses for stock options, restricted stock and employee stock purchases. The company excludes stock-based compensation expense from its non-GAAP measures primarily because they are non-cash expenses that management does not believe are reflective of ongoing operating results. The related employer payroll taxes are dependent on the company's stock price and the timing and size of exercises by employees of their stock options and the vesting of their restricted stock, over which management has limited to no control, and as such management does not believe it correlates to the company's operation of the business.Amortization or impairment of acquired intangible assets, impairment of goodwill, certain amortization of deferred tax assets and related foreign exchange effects, significant gains or losses and transaction expenses from the acquisition or disposal of a business and certain gains or losses on investments. The company incurs amortization or impairment of acquired intangible assets and goodwill in connection with acquisitions and may incur significant gains or losses from the acquisition or disposal of a business and therefore excludes these amounts from its non-GAAP measures. The company also excludes certain gains and losses on investments. The company excludes the non-cash amortization of deferred tax assets associated with the realignment of its legal structure, which is not reduced by the effects of the Tax Cuts and Jobs Act, and related foreign exchange effects. The company excludes these items because management does not believe they correlate to the ongoing operating results of the company's business.Restructuring. These charges consist of expenses for employee severance and other exit and disposal costs. The company excludes significant restructuring charges primarily because management does not believe they are reflective of ongoing operating results.Other certain significant gains, losses, or charges that are not indicative of the company's core operating results. These are significant gains, losses, or charges during a period that are the result of isolated events or transactions which have not occurred frequently in the past and are not expected to occur regularly or be repeated in the future. The company excludes these amounts from its results primarily because management does not believe they are indicative of its current or ongoing operating results.Change in fair market value of warrant. These are gains or losses associated with a warrant agreement that the company entered into with Adyen, which are attributable to changes in fair value during the period.Tax effect of non-GAAP adjustments. This amount is used to present stock-based compensation and the other amounts described above on an after-tax basis consistent with the presentation of non-GAAP net income.In addition to the non-GAAP measures discussed above, the company also uses free cash flow. Free cash flow represents operating cash flows less purchases of property and equipment. The company considers free cash flow to be a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business after the purchases of property, buildings, and equipment, which can then be used to, among other things, invest in the company's business, make strategic acquisitions, repurchase stock and pay dividends. A limitation of the utility of free cash flow as a measure of financial performance is that it does not represent the total increase or decrease in the company's cash balance for the period.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-inc-reports-fourth-quarter-and-full-year-2019-results-300994779.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Eliminates Sneaker Seller Fees for the First Time and Unveils New December Drop Series",
        "subtitle": "The marketplace launches zero selling fees for its North America seller community on any sneakers sold at $100 or more",
        "date": "Dec 17, 2019 12:00PM EST",
        "content": "SAN JOSE, Calif., Dec. 17, 2019 /PRNewswire/ -- Today, eBay, the online marketplace offering the widest and most unique inventory of sneakers, launches zero selling fees for the first time for North America customers on any sneakers sold at $1001 or more. Buyers win too; the marketplace announces a month of drops, celebrating the biggest designer collaborations, top brands, and rare grails of the year. The drops signify the continued dominance of eBay in the sneaker resale game, with nearly six million total sneakers sold on eBay in 2019.2 With almost 1.5 million live sneaker listings3 right now, the move is only expected to grow eBay's amazing selection of new, rare, and emerging styles across every price and time zone. \"As the originator of the sneaker resale game, eBay continues to be a top source for emerging and collectible styles, and with high demand, we want our sellers and buyers to get in on the action,\" said Jeff Chan, Head of Men's Footwear and Apparel, eBay. \"For our community of diehard sneakerheads, eliminating selling fees allows them to turn their kicks into more cash to fund future purchases, and results in a more robust sneaker inventory for shoppers everywhere.\"Cop the DropsBeginning today at 9am PT / 12pm ET, eBay kicks off their 'December Drop' series4 to celebrate the most hyped sneakers and the biggest moments in sneaker culture this year. Teaming up with top seller, Stadium Goods, shoppers can cop the Yeezy 700 in four-different colorways, Nike X Sacai LD Waffle collection, Air Jordan X Travis Scott and more. Check out what's dropping this December below. Release Calendar: Tuesday, Dec. 17: Yeezy Boost 700 'Analog'Wednesday, Dec. 18: Yeezy Boost 700 'Inertia'Thursday, Dec. 19: Yeezy Boost 700 'Geode'Friday, Dec. 20: Yeezy Boost 700 'Salt' Meet eBay's 2019 Best of the Best:Air Jordan 1 x Off-White NRG \"Off-White UNC\": Since its shock drop by Nike, the final colorway of the Jordan 1 Off-White continues to garner fanfare. It's the easiest of the J1 colorways to cop, but prices have climbed faster than the previous two colors.Available sizes | 9, 9.5, 10, 10.5Air Jordan x Travis Scott: The biggest brand coupled with arguably the hottest artist in the game has yielded one of the best collabs of the year, maybe of the decade. Available sizes |  8, 8.5, 9, 9.5, 10Air Force 1 MCA: Dropped exclusively at Virgil's Pop-Up experience in Chicago, this sneaker was only available by geo-reservation. One of the most limited stocks from the entire Off-White Nike Jordan collection.Available sizes | 9, 10, 11Yeezy Boost 350 v2 Black Static Reflective: The most coveted colorway of any 350;  reflective material and Yeezy Supply exclusivity make it unbeatable. Available sizes | 8, 9, 10, 11, 12Yeezy 700 Magnet: Released exclusively on Yeezy Supply, this colorway has a similar feel to the highly coveted Wave Runners. Great consolation for those who missed out on the OG colorway.Available sizes | 8,8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 13         Nike Off-White Dunk Low University Gold: Dunks are back in a big way in 2019, so it's fitting that Virgil took this iconic silhouette and made it his own. One of three colorways to drop from this collection with hype continuing to build as the December drop day is around the corner.Available sizes | 9Nike x Sacai LD Waffle Collection: Arguably one of the most desirable drops of the year after a surprise launch in Paris. Nike x Sacai LD Waffle Green GustoAvailable sizes | 5.5 ,6, 7, 8, 9, 10, 11Nike x Sacai LD Waffle Varsity BlueAvailable sizes | 6.5, 7.5, 8.5, 9.5, 10.5Zero Selling Fees The heart and soul of eBay is the tens of millions of people that sell on the platform. The unveil of the 'December Drop' series follows eBay's sold out pre-release of the Air Jordan 11 \"Bred\" made possible by seller Chris Holbrook, also known as Sneaker Jesus. In partnership with Chris, eBay shoppers copped the coveted release without the wait. The drop sold out in less than four minutes5. A self-professed sneakerhead since he was little, Chris has built a thriving online sneaker store. In the past year, he has grown his business from $100K to $1.5M in sales6 on the marketplace. Chris is one of millions of small businesses who partner with eBay to turn their passions into global sales.Eliminating seller fees on sneakers sold at $100 or more7, every collector - from the occasional seller to the full-time entrepreneur - is encouraged to take advantage of the hype and list what millions of buyers on eBay are searching for now. How It WorksNew \"2019 Sneaker Resale Report\" | Five Biggest Trends in 2019 To celebrate 2019, eBay tracked what's on every sneakerhead's wish list with its \"2019 Sneaker Resale Report,\" detailing the year's top trends according to sales data8. The top five trends and styles include:To shop the drops and millions of sneakers, visit  www.eBay.com/Sneakers. Don't forget to check out eBay's Instagram (@eBay) for the marketplace's Week of 'Sneaks.' And to get started selling, visit here. eBay Sneakers By the Numbers eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.              1 Applies to sneakers sold in Men's and Women's Athletic Shoes; qualifying price does not include shipping, handling, taxes, or fees. Additional information: https://pages.ebay.com/sell/sneakers-faq.html2 Numbers based on eBay North America (U.S. and Canada) 2019 sales data. 3 Numbers based on eBay North America (U.S. and Canada) 2019 sales data.4 Drops available while supplies last. All drops offer global shipping from eBay's Global Shipping Program.  5 Numbers based on U.S. sales data on December 13, 2019. 6 Data based on 2019 North America (U.S. and Canada) sales data. 7 Applies to sneakers sold in Men's and Women's Athletic Shoes; price does not include shipping, handling, taxes, or fees. Additional information: https://pages.ebay.com/sell/sneakers-faq.html8 Numbers based on eBay North America (U.S. and Canada) 2019 sales data.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-eliminates-sneaker-seller-fees-for-the-first-time-and-unveils-new-december-drop-series-300976150.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Partners with HyperX and Gamers Outreach for Charity Stream to Benefit Children in Hospitals",
        "subtitle": "'Tis the season for gaming and giving; shop for good this Saturday with 30 percent off select HyperX items and VIP, autographed bundles on eBay",
        "date": "Dec 12, 2019 10:01AM EST",
        "content": "SAN JOSE, Calif., Dec. 12, 2019 /PRNewswire/ -- HyperX, the gaming division of Kingston Technology Company, Inc., today introduced HyperX Charity Stream (twitch.com/hyperx) in collaboration with and Gamers Outreach. The charity stream includes popular streamers competing in head-to-head matchups to raise money to benefit children in hospitals. The five-hour stream will begin on Saturday, Dec. 14 at 2 p.m. with participating streamers pairing up and competing in a variety of games and challenges including Minecraft, League of Legends and Overcooked 2. \"We are excited to partner with eBay and Gamers Outreach to bring together talented streamers for a charitable afternoon of gaming,\" said Stephanie Winkler, strategic marketing manager, HyperX. \"It is our goal to help raise funds to support gaming kiosks in hospitals for children, bringing them happiness as they cope with long-term medical treatments.\"Held in Los Angeles and broadcast globally on twitch.com/hyperx, the event will include eBay for Charity auctions of exclusive gaming bundles, discounted HyperX products and chat donations with proceeds funding Gamers Outreach gaming carts and supporting the charity's additional programs and operations. Streamers currently scheduled to participate include Pokimane, Valkyrae, Fedmyster and Disguised Toast, with Sonii hosting the HyperX Charity Stream. \"eBay has long had a close relationship with the gaming community as a destination for everything from PC to console, and it's only natural that we come together and turn our enthusiasm into support for a worthy cause,\" said Sam Bright, VP and General Manager of Merchandising at eBay. \"Alongside HyperX, Gamers Outreach and these leading streamers, we'll harness the power of gamers everywhere to bring joy to children that need it most.\"From Dec. 13 at 4:00pm PT through Dec. 18, shoppers can head to www.eBay.com/HyperX to browse charity auctions featuring incredible gaming inventory, such as autographed HyperX products and bundles like the Ultimate PC Gaming Bundle, which includes the HyperX Quadcast, Pulsfire Surge and Cloud Alpha S. Those looking to upgrade their battle stations can also enjoy 30 percent off for one day only on select HyperX products including the Cloud II, Cloud Stinger Core for PS4 and ChargePlay Duo. Proceeds from the charity auction and HyperX sales on eBay will go to Gamers Outreach to support gaming kiosks for children in hospitals. The power of video games for recreation and coping helps children during long-term medical treatments.More information about the influencers, streamers:Pokimane: Imane \"Pokimane\" Anys, Shorty's 2018 Twitch Streamer of the Year, is the #1 female on Twitch with the largest followers and highest average concurrent viewership. Originally known for being the top female League of Legends streamer on Twitch, she has spanned into Fortnite, becoming the top female streamer of both titles. Twitter: 1.4M, Instagram: 4.1M, Twitch: 3.5M, YouTube: 4.1MValkyrae: A full time content creator who pushes positivity to her community. She aspires to help people by providing content that can help her community smile. Twitter: 473.1K, Instagram: 1.7M, Twitch: 914K, YouTube: 807KFedmyster: A full time variety content creator that provides comedy to all of his fanbase. Through being organic he has built a dedicated foundation for his audience.Twitter: 154.4K, Instagram: 181K, Twitch: 349K, YouTube: 340KDisguised Toast: A full time content creator who demonstrates high strategic gameplay while promoting his community to support the smaller creators around him.Twitter: 244.2K, Instagram: 161K, Twitch: 1.3M, YouTube: 955KSonii: A full-time streamer on Twitch with goals to make gaming a healthier space. He inspires his community through not only top tier game-play, but also through his commitment to a healthy lifestyle. Twitter: 47.8K, Instagram: 70K, Twitch: 158K, YouTube: 32.3KStreamers and hosts listed are subject to change.About eBayeBay Inc. (NASDAQ: EBAY) [markets.financialcontent.com] is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit ebayinc.com.   About eBay for CharityeBay for Charity enables members of the eBay community to connect with and support their favorite charities in the U.S. and abroad. Every time a user buys or sells on eBay, it's an opportunity to support causes that matter the most and to help with their fundraising goals. With more than 183 million active buyers globally and more than 83,500 charities enrolled on the site, eBay is home to one of the world's largest and most active giving communities. Since 2003, the eBay community has raised more than $1 billion for charity. For more information visit ebayforcharity.org. About Gamers OutreachGamers Outreach is a 501(c)(3) charity organization that provides recreation to children in hospitals through the power of video games and the gaming community. Hospitalization can often be a lonely, isolating, and scary experience for young people. We ease those burdens by providing equipment, technology, and software that helps kids cope with long-term treatment. We are known for our medical grade gaming kiosk called the Gamers Outreach Kart, \"GO Kart\" for short.About HyperXHyperX is the gaming division of Kingston Technology Company, Inc., the world's largest independent memory manufacturer, with the goal of providing gamers, PC builders, PC, console and mobile power users with high-performance components. For 16 years, the HyperX mission has been to develop gaming products for all types of gamers – high-speed memory, solid state drives, headsets, keyboards, mice, charging accessories for console players, USB flash drives, and mousepads – to the gaming community and beyond. The award-winning HyperX brand is known for consistently delivering products that deliver superior comfort, aesthetics, performance, and reliability. HyperX gear is the choice of celebrity ambassadors, pro gamers, tech enthusiasts, and over-clockers worldwide because it meets the most stringent product specifications and is built with best-in-class components. HyperX has shipped over 65 million memory modules and 10 million gaming headsets worldwide.Join the global #HyperXFamily at facebook.com/hyperxcommunity, learn how HyperX products can enhance your console experience and boost performance for both you and your PC, console or mobile device at hyperxgaming.com. Whatever your skill level, whatever genres you play, we embrace all gaming enthusiasts everywhere with our core belief — We're All Gamers.Website: http://www.hyperxgaming.com/ Twitter: https://twitter.com/HyperX Instagram: https://www.instagram.com/hyperx/ Facebook: http://www.facebook.com/hyperxcommunity Youtube:  https://www.youtube.com/user/kingstonhyperx   View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-partners-with-hyperx-and-gamers-outreach-for-charity-stream-to-benefit-children-in-hospitals-300973751.htmlSOURCE  eBay for Charity"
    },
    {
        "title": "Buy or Sell a Car via Mobile with the New eBay Motors App",
        "subtitle": "eBay launches enhanced vehicles app powered by cutting edge technology, including Artificial Intelligence and Machine Learning",
        "date": "Dec 12, 2019 8:01AM EST",
        "content": " SAN JOSE, Calif., Dec. 12, 2019 /PRNewswire/ -- eBay Motors, one of the world's largest marketplaces for all things automotive, is launching an all-new, automotive-focused app for Apple iPhone and Android. Powered by advanced technology, the app is a powerful tool for buying and selling vehicles directly from consumers' mobile devices in an entirely new way. Starting now, customers in the U.S. can use the app to easily list, search and shop for vehicles with a reimagined experience that makes for a smooth user ride that cannot be found anywhere else. Download the free app (Apple App Store or Google Play Store) and check out the optimized shopping and selling journey. New innovations include a personalized homepage, streamlined listing capabilities and improved search filters. Shoppers can instantly access eBay Motors' huge selection of vehicle inventory, from new or pre-owned to classic, rare and collectible vehicles, and sellers can conveniently list their vehicle to eBay's millions of buyers.\"eBay Motors is the premier destination for auto enthusiasts and general car buyers looking for great value and selection, and it was our mission to distill those offerings into a functionality-packed app made by car-lovers for car-lovers,\" said Ron Jaiven, General Manager of eBay Vehicles. \"With the new launch, we're serving an elevated experience that is unrivaled in the market for buyers and sellers alike, and is a game changer in the way users buy and sell cars.\"Meet the eBay Motors AppeBay Motors' new tailored mobile shopping platform allows consumers to bid on or buy any vehicle, virtually anytime, anywhere. New AI-driven vehicle pages and thoughtful functionality empower the user to populate and showcase a vehicle for purchase, and refine the broad inventory of cars and trucks served to them based on preference. Here's more on what's new:For a more in-depth look at the technology under the hood of the eBay Motors app, check out this behind-the-scenes break down from the marketplace's tech team. Buy a Car on eBay MotorsSearching thousands of vehicles for that perfect car or truck can be daunting, but not with eBay Motors' refreshed buyer experience. Users will be greeted by a highly-customizable home page where they can browse vehicle listings that are populated based on specific criteria and preferences. Robust filters then enable the shopper to drill down and find the exact vehicle they are looking for. Listings can be refined by available images, year, price and mileage, and the user can even preview the number of results matching each filter before they are applied. After finding the perfect ride, buyers can rest assured in their purchase with eBay Motors' Vehicle Purchase Protection (VPP) plan, which covers up to $100,000 for vehicle non-delivery, missing title, or major undisclosed defects. Sell a Car on eBay Motors A thorough, informative listing is critical to completing a sale and the eBay Motors app is uniquely developed to help sellers showcase their vehicle for potential buyers. When listing a vehicle, the eBay Motors App will prompt the user to take a photo of the license plate. Then, the app automatically populates key details such as make and model, year and VIN of the car or truck being sold. To further enhance their listing, a seller can upload images and video of the vehicle - including interior, exterior and powertrain - to showcase the car or truck entice the right buyer. The fully-rebuilt mobile app is the latest offering from eBay that enables users to take full advantage of the marketplace, whether it is finding the exact car or truck they have been looking for or selling a vehicle to earn more cash. Download the eBay Motors app today via the Apple App Store or Google Play Store.  About eBay Motors eBay Motors (www.ebay.com/motors), a part of eBay (Nasdaq: EBAY), one of the world's largest marketplaces for buying and selling all things automotive. The site offers everyday cars for everyday drivers, as well as collector cars, motorcycles, auto parts and accessories.  About eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/buy-or-sell-a-car-via-mobile-with-the-new-ebay-motors-app-300973706.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Unveils Green Monday Sale, Launching the Biggest December Deals Day of the Year",
        "subtitle": "Created by eBay in 2007, \"Green Monday\" is the busiest last-minute shopping holiday of the season",
        "date": "Dec 9, 2019 8:01AM EST",
        "content": "SAN JOSE, Calif., Dec. 9, 2019 /PRNewswire/ -- On Monday, December 9, eBay will celebrate the 12th anniversary of Green Monday, historically one of the company's busiest holiday shopping days. With thousands of amazing offers and new deals dropping every hour, the marketplace is launching the biggest December deals day of the year.  Beginning at 5am PT / 8am ET (12/9), shoppers can score major savings on exactly that they want this holiday season, with a wide selection of gifts from fashion, home, toys, tech and more, all with free shipping at eBay.com. \"The countdown to Christmas is on and customers are looking for great savings without the stress of the season,\" said Sam Bright, VP and GM of Merchandising at eBay. \"On eBay, we're making holiday shopping easier than ever for our customers – from offering amazing December deals shoppers won't want to miss, to an incredible selection of gifts and guaranteeing the best value with our Best Price Guarantee program, to fulfilling last-minute orders with Guaranteed Delivery.\"Top Green Monday Deals Tech Home, Kitchen, Lifestyle Fashion Apparel, Accessories and FragrancesToys & GamesLifestyle & Sporting GoodsTo see all of eBay's deals, check out the Green Monday Ad Scan or visit eBay.com/deals. 12 Years of Green MondayOver a decade ago, 'Green Monday' was created by eBay in 2007, when the marketplace experienced one of its biggest sales days on the second Monday of December. In honor of the milestone, eBay named the day 'Green Monday,' a term that has since been widely adopted across the retail industry. Whether shoppers are logging on after the weekend, waiting for great last-minute deals or simply procrastinating, 'Green Monday' continues to be a big online shopping day and has consistently ranked as one of eBay's top five sales days of the year. Six Days of GiftsAdditionally, all week long (Dec. 10 – 15), eBay's offering their Six Days of Gifts events, which includes some of the biggest brands and must-have gifts, across footwear, toys, beauty and more. Top events include:Best Price GuaranteeAll season long, holiday shoppers are guaranteed the best prices with eBay's Best Price Guarantee, where they can receive 110 percent of the price difference on eligible deals and top products if they find an item for less on a competitor's website. Whether shoppers are checking items off their holiday wish lists or on the hunt for the best holiday deals, eBay's Green Monday deals have got you covered. To shop all Green Monday deals, check out the Green Monday Ad Scan, or visit eBay.com, and follow @eBay on Twitter, Facebook and Instagram.1eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.               1Eligible items for Best Price Guarantee must be available from an approved competitor, including Amazon.com, BestBuy.com, HomeDepot.com, Jet.com, Sears.com, Target.com, Walmart.com, and Wayfair.com.2 All deals available while supplies last.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-unveils-green-monday-sale-launching-the-biggest-december-deals-day-of-the-year-300971060.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Unveils 2019 Digital Toy Book Filled with Trending Rare, Retro and Right Now Favorites",
        "subtitle": "Check out eBay's Toytopia Toy Book for nostalgic toys like Star Wars retro action figures, Nineties throwbacks like Bop It, collectible cards including Magic: The Gathering, and the newest interactive toys like L.O.L. Surprise! Ooh La La Baby Surprise",
        "date": "Nov 27, 2019 11:58AM EST",
        "content": "SAN JOSE, Calif., Nov. 27, 2019 /PRNewswire/ -- To give holiday shoppers more gifting inspiration just in time for the peak cyber shopping week, eBay is releasing a digital Toy Book bursting with a broad selection of rare, retro and right now toys for kids of all ages. Shoppers will find everything from collectible Star Wars retro action figures to an exclusive Star Wars #75 comic, the Nintendo Game Boy of yesterday to the latest Nintendo Switch Lite of today, tons of family fun games, Barbies, plushies, S.T.E.M. toys, unique stocking stuffers and so much more. Explore the eBay's 2019 Toytopia Toy Book here and discover more coveted holiday toys and gifts at www.eBay.com/Toytopia all season long.\"eBay has the unique ability to fulfill everyone's wish lists, from the hottest toys of the season to the ones that can't be found anywhere else,\" said Sam Bright, VP and GM of Merchandising, eBay. \"Whether you're looking for the classic games and dolls of decades past to the sold-out or hard-to-find toys of today, you can find exactly what you want at eBay's Toytopia.\"Additionally, eBay recently released their 'Toys of the Season' guide - a definitive list of the hottest toys and trends for 2019. The expert-picked list includes collectible Star Wars action figures, the new Kindi Kids dolls, and Monopoly Game: Disney Frozen 2.From everything to the very thing, with a selection that only eBay can deliver, shop holiday toys and gifts at eBay.com/toytopia all season long.  Downloadable Toy Book: Click here. About eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.              View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-unveils-2019-digital-toy-book-filled-with-trending-rare-retro-and-right-now-favorites-300966249.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Unveils Black Friday and Cyber Monday Deals, Launches Back-to-Back Days of Discounts",
        "subtitle": "Savings start today, with thousands of 'Cyber Week' deals and doorbusters, including adidas, Apple, LG, Xbox, Ninja, RayBan and more",
        "date": "Nov 26, 2019 8:00AM EST",
        "content": " SAN JOSE, Calif., Nov. 26, 2019 /PRNewswire/ -- The biggest holiday shopping days are here, and the best deals and gifts are happening on eBay. Beginning today through Cyber Monday, shoppers can score thousands of deals on top items, including more than 50 percent off some of the hottest electronics, beauty, fashion, toys, sporting goods and more this Cyber Week, all with free shipping. And it doesn't stop there; the marketplace is dropping new deals every hour on Black Friday and Cyber Monday.Each day through December 2, eBay is introducing amazing new deals and doorbusters, launching at 5am PT / 8am ET on eBay.com, featuring top brands including Google, Ninja and adidas. From electronics, kitchenware and sneakers to toys, jewelry and more, shoppers can find what they really want this year, all at a great value.\"With the shortened holiday season, this is the busiest time of year for shoppers, and eBay has massive deals on in-demand items across every category,\" said Sam Bright, VP and GM of Merchandising at eBay. \"Whether holiday shoppers are looking for gifting inspiration, stocking stuffers or simply the best deal, we're helping our customers win the holidays this season through our wide selection and incredible value.\"eBay's Cyber Savings include:    Thanksgiving Starts Now (Today through Nov. 28):   Black Friday (Friday, Nov. 29):   Cyber Weekend (Saturday, Nov. 30 and Sunday, Dec. 1)   Cyber Monday (Monday, December 2) eBay Black Friday Escape Room Hits NYCIn addition to eight days of Cyber Week savings, shoppers are invited to eBay's Black Friday Escape Room experience in NYC. Open one day only on Black Friday (Nov. 29) from 8am - 3pm ET, the activation is located at 163 Mercer Street (between W. Houston & Prince St.). The multi-installation gamified Black Friday experience invites shoppers to beat the IRL madness through a series of challenges to win the holidays, then escape with eBay's zen pop-up offering relaxing experiences and #HolidayChill shopping.Best Price Guarantee Through Cyber Monday, No Blackout DatesHoliday shoppers are guaranteed the best prices with no blackout dates on deals, including Black Friday and Cyber Monday. eBay's Best Price Guarantee gives shoppers 110 percent of the price difference on eligible deals and top products if an item is found for less on a competitor's website.1Shop Small This Season on eBayeBay celebrates small businesses every day. eBay is powered by the small businesses on the marketplace who bring unique merchandise – from the rare and one-of-a-kind gifts to locally sourced products – to buyers across the globe. Through Retail Revival, eBay is supporting entrepreneurs and small business communities to stay local and sell global. Shop to empower small businesses at www.eBay.com/ShopSmall.Shop with a PurposeIn addition to supporting small businesses, eBay for Charity is also celebrating Giving Tuesday on Dec. 3 on eBay.com/GivingTuesday. Holiday shoppers can make a difference this season by:To shop all 'Cyber 5' deals, visit eBay.com/deals, and follow @eBay on Twitter, Facebook and Instagram.eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.1Eligible items for Best Price Guarantee must be available from an approved competitor, including Amazon.com, BestBuy.com, HomeDepot.com, Jet.com, Sears.com, Target.com, Walmart.com, and Wayfair.com.2Deals available while supplies last.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-unveils-black-friday-and-cyber-monday-deals-launches-back-to-back-days-of-discounts-300965177.htmlSOURCE  eBay Inc."
    },
    {
        "title": "viagogo Acquires StubHub from eBay for $4.05 Billion",
        "subtitle": "viagogo to Provide Additional Flexibility and Resources to StubHub to Further Drive Scale, Global Reach and Innovation",
        "date": "Nov 25, 2019 9:00AM EST",
        "content": "SAN JOSE, Calif. and GENEVA, Nov. 25, 2019 /PRNewswire/ -- eBay Inc. (NASDAQ: EBAY) and viagogo today announced they have entered into a definitive agreement for eBay to sell StubHub to viagogo for a purchase price of $4.05 billion in cash.\"We believe this transaction is a great outcome and maximizes long-term value for eBay shareholders,\" said Scott Schenkel, interim chief executive officer of eBay Inc. \"Over the past several months, eBay's leadership team and Board of Directors have been engaged in a thorough review of our current strategies and portfolio, and we concluded that this was the best path forward for both eBay and StubHub. We firmly believe in the StubHub business and we are excited about its future growth potential with viagogo as its owner.\"viagogo is a leading worldwide ticket marketplace for live sport, music and entertainment events, and StubHub is a trusted ticket marketplace in the United States. Both viagogo and StubHub provide fans with transparency, choice and competitive prices for tickets and do so in a trusted and secure environment with fan-protect guarantees. Combined, these complementary marketplaces will sell hundreds of thousands of tickets daily across more than 70 countries, giving fans seamless access to a wider selection of inventory around the world, while sellers, teams and artists will have the ability to more effectively reach a broader global audience. Eric Baker, viagogo's founder and CEO, also co-founded StubHub while in business school, but left before the business was sold to eBay for $310 million in 2007. \"It has long been my wish to unite the two companies. I am so proud of how StubHub has grown over the years and excited about the possibilities for our shared future,\" Baker said. \"Buyers will have a wider choice of tickets, and sellers will have a wider network of buyers. Bringing these two companies together creates a win-win for fans - more choice and better pricing.\"\"Bringing StubHub and viagogo together will allow us to drive further expansion and innovation, and create a more competitive offering for live event fans globally,\" said Sukhinder Singh Cassidy, president of StubHub. \"This provides a great opportunity to expand our business, pursue new partnerships and execute our strategy. We expect a seamless transition for all our employees, partners and customers, and we are excited for what the future holds.\"The sale is expected to close by the end of the first quarter of 2020, subject to regulatory approval and customary closing conditions.eBay regularly reviews its portfolio to ensure that its investments and assets support the company's strategic direction while adhering to a disciplined approach to value creation. Goldman Sachs & Co. LLC is acting as financial advisor to eBay. Wachtell, Lipton, Rosen & Katz and Quinn Emanuel are acting as legal advisors to eBay. J.P. Morgan is acting as sole financial advisor and sole underwriter of the committed debt and preferred equity financings for viagogo. Skadden, Arps, Slate, Meagher & Flom LLP and Kirkland & Ellis LLP are acting as legal advisors for viagogo.About eBay: eBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, Calif., eBay is one of the world's most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.About StubHub: At StubHub, our mission is to bring the joy of live to fans globally. As the world's most trusted ticket marketplace spanning 44 countries, we enable fans to buy and sell tickets to tens of thousands of events, whenever and wherever fans want to be. Backed by award-winning customer care, StubHub's FanProtect™ Guarantee means every ticket is guaranteed valid or you'll receive a replacement ticket of equal or better value, or your money back. Our business partners include more than 130 properties globally across the NFL, MLB,  NBA, NHL, MLS, WWE, NCAA, Matchroom Boxing, plus Paciolan, Tessitura and Roundabout Theatre Company. StubHub provides the total end-to-end event going experience throughout the world. For more information on StubHub, visit StubHub.com or follow @StubHub on Twitter, Facebook, Instagram or LinkedIn.About viagogo: viagogo was built with the aim of providing ticket buyers with the widest possible choice of tickets to events across the world and to help ticket sellers reach a global audience.  Since its inception in 2006, viagogo has grown to be an important option for fans in Europe, Asia, Australia and Latin America, and has partnered with many of the world's leading brands in sports and entertainment. viagogo now serves customers in over 70 countries and processes millions of transactions annually.Forward-Looking StatementsCertain statements herein are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements are often identified by words such as \"anticipate,\" \"approximate,\" \"believe,\" \"commit,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"hope,\" \"intend,\" \"may,\" \"outlook,\" \"plan,\" \"project,\" \"potential,\" \"should,\" \"would,\" \"will\" and other similar words or expressions. Such forward-looking statements reflect eBay's current expectations or beliefs concerning future events and actual events may differ materially from historical results or current expectations. The reader is cautioned not to place undue reliance on these forward-looking statements, which are not a guarantee of future performance and are subject to a number of uncertainties, risks, assumptions and other factors, many of which are outside the control of eBay. The forward-looking statements in this document address a variety of subjects including, for example, the closing of the proposed transaction and the potential benefits of the proposed transaction. The following factors, among others, could cause actual results to differ materially from those described in these forward-looking statements: the possibility that regulatory and other approvals and conditions to the proposed transaction are not received or satisfied on a timely basis or at all; the possibility that eBay may not fully realize the projected benefits of the proposed transaction; changes in the anticipated timing for closing the proposed transaction; business disruption during the pendency of or following the proposed transaction; diversion of management time on transaction-related issues; the reaction of customers and other persons to the proposed transaction; and other events that could adversely impact the completion of the proposed transaction, including industry or economic conditions outside of our control. In addition, actual results are subject to other risks and uncertainties that relate more broadly to eBay's overall business, including those more fully described in eBay's filings with the Securities and Exchange Commission, including its annual report on Form 10-K for the fiscal year ended December 31, 2018 and subsequent quarterly reports on Form 10-Q. The forward-looking statements in this document speak only as of this date. We undertake no obligation to revise or update publicly any forward-looking statement, except as required by law.  View original content to download multimedia:http://www.prnewswire.com/news-releases/viagogo-acquires-stubhub-from-ebay-for-4-05-billion-300964581.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Releases Top Retro and Right Now Toys Trends for the Holidays; Will Unveil Digital Toy Book",
        "subtitle": "From L.O.L Surprise Dolls to LEGO Star Wars and nostalgic Pokémon cards, eBay's Toytopia offers a unique selection for kids of all ages",
        "date": "Nov 21, 2019 8:01AM EST",
        "content": "SAN JOSE, Calif., Nov. 21, 2019 /PRNewswire/ -- Make your lists and check them twice! Today, eBay, the world's most dynamic marketplace, reveals their second annual definitive list of the top toys and trends for the 2019 holiday season. New to this year's lineup are the most in-demand nostalgic and retro toys in addition to the season's hottest new picks, all based on the marketplace's team of experts and global and US toy data.To help shoppers with a little inspiration timed to the peak cyber shopping period, eBay will also release a digital toy book next week bursting with a broad selection of rare, retro and right now toys for kids of all ages, from collectible Star Wars action figures to new Kindi Kids dolls, and the My Size Barbie of yesterday to the Astronaut Barbie of today. Shoppers everywhere will be able to explore the toy book online, and can discover more coveted holiday toys and gifts at eBay's ultimate Toytopia destination (eBay.com/toytopia) all season long.\"There's a revival of all things retro right now and we're seeing classic toys gaining popularity alongside the most coveted new offerings; the thing is, it isn't always easy for shoppers to cross the vintage and hard-to-find gifts off their lists,\" said Sam Bright, VP and GM of Merchandising, eBay. \"On eBay, we have a selection of hundreds of thousands of toys spanning the decades, so whether it's the latest toys or childhood gadgets that are steeped in nostalgia, shoppers can find the very thing on our marketplace.\" eBay's Top 'Retro & Right Now' Holiday Toy Insights:The Top 30 New Toys of the Season1The Top 30 Retro Toys of the Season2With hundreds of thousands of toys to choose from, shoppers can find an unrivaled selection of new and classic options for kids of all ages across action figures, dolls, STEM toys, family games, trains and more at eBay.com/Toytopia. 1Based on US toy sales on eBay from March through September, 20192Based on global toy sales on eBay from January through October 20, 2019eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.            View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-releases-top-retro-and-right-now-toys-trends-for-the-holidays-will-unveil-digital-toy-book-300962716.htmlSOURCE  eBay Inc."
    },
    {
        "title": "Verizon Media doubles down on commerce and launches holiday campaign with eBay",
        "subtitle": "",
        "date": "Nov 20, 2019 10:56AM EST",
        "content": "SAN JOSE, Calif., Nov. 20, 2019 /PRNewswire/ -- E-commerce giant eBay and Verizon Media today announced \"The Guy's Guide to Nailing the Holidays\" - a new campaign aimed to help men tackle the holiday season with ease and confidence. eBay will also be the first advertising partner to sponsor Verizon Media's new Shoppable video format, integrating the online marketplace's wide selection of one-of-a-kind items and trending products from top brands into shoppable carousels beneath gift guide videos. This initiative is part of Verizon Media's commitment to commerce through newly announced tech, products and shoppable content that build the consumer journey from discovery to transactions.\"At Verizon Media, we're closing the loop between content and commerce to drive deeper value for our consumers and brand partners,\" said Iván Markman, Chief Business Officer at Verizon Media. \"Consumers increasingly want more engagement with content to learn and discover new things that could improve their lives. We're excited to partner with eBay this holiday season to continue creating a more engaging experience that connects discovery to purchase.\"Together, Yahoo and eBay created a multifaceted content and commerce campaign that gives guys ideas for what to wish for, when to shop, and what to get their loved ones. The elements include a \"Holiday Guide for Guys\" hub, a unique destination on Yahoo Lifestyle which aggregates holiday shopping content, as well as expert-driven original articles that share everything from eBay's latest tech and sporting gadgets to collectibles and apparel for guys and from guys for 2019.Additionally, eBay will be the first brand partner to leverage Verizon Media's new shoppable video formats. Beginning today, Verizon Media will roll out a series of videos featuring influencers like tech and gaming expert Brian Tong and reality TV star Tanner Tolbert to highlight eBay products across lifestyle, tech and sports. This format is a unique solution from Verizon Media that combines a native video player and a shopping carousel optimized to help consumers discover and purchase things they love while watching videos.\"Together with Verizon Media's shoppable content capabilities and the gifting expertise of influencers like Brian and Tanner, we're offering eBay's amazing selection of inventory to help guys everywhere find the best gifts to give and ask for,\" said Suzy Deering, Chief Marketing Offer for eBay Americas. \"From rare collectibles to trending fashion and retro inspired gadgets to the latest tech, eBay provides the value and selection that shoppers are looking for as they seek out gifting inspiration this holiday season.\"The partnership builds on Verizon Media's strategy to create a seamless, unified commerce experience across its brands. This fall, the company announced its commitment to commerce, including a suite of new capabilities like shoppable content, interactive videos and images, editorially curated product guides, and a Yahoo Shopping hub which curates, discovers, and price track deals for consumers. About Verizon MediaVerizon Media, a division of Verizon Communications, Inc., houses a trusted media ecosystem of premium brands like Yahoo, TechCrunch and HuffPost to help people stay informed and entertained, communicate and transact, while creating new ways for advertisers and media partners to connect. From XR experiences to advertising and content technology, Verizon Media is an incubator of innovation and is revolutionizing the next generation of content creation in a 5G world.About eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.           View original content to download multimedia:http://www.prnewswire.com/news-releases/verizon-media-doubles-down-on-commerce-and-launches-holiday-campaign-with-ebay-300962196.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Launches 'Black Friday Preview' Sale, Offering Early Access to Incredible Savings on Must-Have Brands Ahead of Thanksgiving",
        "subtitle": "Shoppers can score incredible holiday savings on electronics, fashion, home, toys and more",
        "date": "Nov 19, 2019 8:04AM EST",
        "content": "SAN JOSE, Calif., Nov. 19, 2019 /PRNewswire/ -- eBay, one of the world's largest and most vibrant marketplaces, is revealing some of the biggest holiday discounts ahead of Black Friday and Cyber Monday. Beginning today, eBay is launching its ''Black Friday Preview' sale, featuring hot holiday gifts at amazing prices from adidas to Apple, across a variety of categories including electronics, kitchenware, sneakers, toys, jewelry, apparel and more; all with free shipping. Now through November 28 at 5am PT/8am ET, shoppers can score early access to Black Friday savings at eBay.com/BlackFridayPreview. \"This is the busiest time of year for consumers; and with the shortest possible holiday shopping season this year, every day counts, so we're releasing amazing deals on the largest selection of gifts before Thanksgiving weekend even begins,\" said Sam Bright, VP and GM of Merchandising. \"We're offering our customers deep discounts on what they really want this year, all at a great value from tech, fashion, home decor, toys, sporting goods and more.\" Early Access: Black Friday Preview Sale With hundreds of amazing deals, highlights include: Travel Gear and Gadgets Tech and Electronics Gifts eBay's Friday DropApple iPhone 11 ❘ 128GB All Colors ❘ Over $40 off            Available Nov. 22 at 9am PT/ 12pm ET Gifts for the Foodie Clean Home Apparel and Fashion Gifts Jewelry Gifts that Sparkle Fitness and Fashion Watches, Lifestyle Toys & Sporting Goods Stocking Stuffer Sunglasses  Check Back for Cyber 5 Deals Starting Thanksgiving week, eBay will reveal Cyber 5 savings including Black Friday (Nov. 29), and Cyber Monday (Dec. 2) deals. Customers will find thousands of deep discounts daily at 5am PT / 8am PT on the items they want and love all week. Stay tuned for more details on eBay's Cyber 5 savings soon. eBay Invites Shoppers to its Black Friday Escape RoomOn top of amazing pre-black Friday and Cyber 5 sale events, eBay invites shoppers to #HolidayChill this year. With shoppers looking to save valuable time, skip the lines and escape the Black Friday madness this year with eBay's Black Friday Escape Room. The multi-room installation is located in NYC at 163 Mercer Street (between W. Houston & Prince St.) on November 29 from 8am ET - 3pm ET. Compete in fun holiday challenges and puzzles to escape the IRL Black Friday frenzy; escape to eBay's Zen Room, where you can sip on hot, holiday-themed drinks and shop eBay's unparalleled holiday selection and deals without the madness. Best Price Guarantee Through Cyber Monday, No Blackout DatesAdditionally, holiday shoppers are guaranteed the best prices with no blackout dates on deals. With eBay's Best Price Guarantee, shoppers receive 110 percent of the price difference on eligible deals and top products if you find an item for less on a competitor's website.1To shop early cyber deals, visit eBay.com/BlackFridayPreview, and follow @eBay on social. eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.               1Eligible items for Best Price Guarantee must be available from an approved competitor, including Amazon.com, BestBuy.com, HomeDepot.com, Jet.com, Sears.com, Target.com, Walmart.com, and Wayfair.com.2 All deals available while supplies last.   View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-launches-black-friday-preview-sale-offering-early-access-to-incredible-savings-on-must-have-brands-ahead-of-thanksgiving-300960953.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Releases Its \"Most Wanted\" Holiday Guide Revealing the Trending Gifts Topping Shoppers' Wish Lists This Season",
        "subtitle": "From the Dyson Airwrap to Air Jordan 1s, new data shows the top selling items across fashion, home, electronics, entertainment and more",
        "date": "Nov 13, 2019 12:01PM EST",
        "content": "SAN JOSE, Calif., Nov. 13, 2019 /PRNewswire/ -- Today, eBay releases its 'Most Wanted' Guide – a holiday shopping report highlighting the season's top trending retro and right now gifts across fashion accessories, electronics, pop culture favorites, gaming, sports, and more. Based on the marketplace's sales data and team of gifting experts, the guide reveals the top five most popular items across category that eBay's millions of customers are on the hunt for. With millions of brands, products and gadgets to choose from, find inspiration on everything from headphones to hair tools, luxury handbags to lucite necklaces, and retro game consoles to collectible comics, and shop the guide at eBay.com. Below is a peek at some of the top trending gifts and insights from eBay's latest holiday guide.eBay's \"Most Wanted\" Holiday Guide1 \"As one of the world's largest and most vibrant marketplaces, we're able to look at shopping behaviors to surface up the most wanted rare, retro and right now gifts for the holidays,\" said Sam Bright, VP & General Manager of Merchandising, eBay. \"For 2019, we're seeing increased interest in nostalgic Nintendo devices and games following their 130th birthday this year, trending mini crossbody bags seen on celebrities and influencers alike, and all-in-one kitchen appliances like the Ninja Foodi as the new Instant Pot of the season.\"For even more inspiration, eBay has curated a series of additional lists featuring something for everyone, including hard-to-find sneakers, retro toys and gadgets, handcrafted items from small businesses, gifts that benefit charities, and more. This holiday season, eBay has the gift you've been wanting the most – from everything to the very thing. Shop eBay's \"Most Wanted\" Holiday Guide and other gift guides to inspire your wish lists at www.eBay.com. For more, visit eBay.com and follow @eBay on Twitter, Instagram and Facebook.eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.1Based on searches and sales on eBay US from October 2018 to October 2019      View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-releases-its-most-wanted-holiday-guide-revealing-the-trending-gifts-topping-shoppers-wish-lists-this-season-300957448.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Launches Early Black Friday \"Drops\" and Unveils Holiday Brand Outlet",
        "subtitle": "Start the season with exclusive weekly sales events, featuring big discounts on Apple, Breville, Nintendo and more, starting today",
        "date": "Nov 1, 2019 5:01AM EDT",
        "content": " SAN JOSE, Calif., Nov. 1, 2019 /PRNewswire/ -- Beginning today, eBay is showing shoppers where to score the best deals and great value on exactly what they want this holiday season, without the stress. Every Friday, shoppers can find Black Friday-worthy prices on the season's hottest gifts at eBay.com, from an Apple Watch Series 5 to a Nintendo Switch Lite and more, all with free shipping. eBay will also unveil a Holiday Brand Outlet on November 4, with major savings on the season's most coveted names all season. To celebrate, shoppers can get an extra 20% off (promo code JUMBO20) from November 4 -11 on over 30 top brands in every category, including Ray Ban, adidas, Samsonite, and Dyson. Black Friday Drops Every FridayStarting today, eBay is launching limited Black Friday drops every Friday1. The series of \"Friday Drops\" offer can't-miss savings on new and trending items every week through December 13. Shoppers can check eBay.com every Friday at 12pm ET / 9am PT to snag the hot drop of the day, beginning with a discount on the new Apple Watch Series 5. Final prices will be unveiled on the day of each drop, available while supplies last, and all with free shipping.November 1: November 8: November 15:November 22:November 29 (Black Friday):December 6: December 13:The Holiday Brand OutleteBay's latest holiday shopping destination at eBay.com/brandoutlet offers incredible prices from some of the biggest name brands, including adidas, Bose, Cuisinart, Dyson, and Samsung. With major savings up to 60% off, from direct brands and trusted sellers, shoppers can treat themselves and everyone on their list with activewear, kitchenware, electronic, handbags, and watches. From November 4 - 11, shoppers can take an extra 20% off the Holiday Brand Outlet's top brands2.Tech UpgradesHome FindsFashion FindsSneaker StealsBeauty and Travel PicksKids' Corner\"With a late Cyber Weekend this year, we're offering new ways to make the most of holiday shopping by helping our customers find exactly what they want,\" said Sam Bright, VP and GM of Merchandising, eBay. \"From weekly drops to every day savings, eBay will be delivering the best value for our customers on the largest selection of gifts.\"Best Price GuaranteeAdditionally, holiday shoppers are guaranteed the best prices with no blackout dates on deals, even during Black Friday and Cyber Monday. With eBay's Best Price Guarantee, shoppers receive 110 percent of the price difference on eligible deals and top products if you find an item for less on a competitor's website3. Stay tuned for more ways to score amazing deals all season long. In the meantime, set your alerts for Fridays at 12 pm ET / 9am PT to check out the drop of the day, only on eBay. eBay By the NumbersAbout eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.1 Friday Drops begin at 9am PT / 12pm ET on their respective date, available while supplies last. 2 Terms & Conditions:What is the Promotion? This Coupon is a 20% discount valid from 5:00 AM Pacific Time on November 4, 2019 until 11:59 PM Pacific Time on November 11, 2019. $50 minimum purchase required from eligible items sold by the sellers listed below. The Coupon discount is capped at a maximum value of $100.  Warranties and protection plans are excluded.Eligible Sellers: 511-official-store, adidas_official, ankerdirect, asicsamerica, Bissell_homecare_inc, case-mate_inc, championofficial, charbroil-direct, Chrono_store, crocsoutlet, Cuisinart, danbydirect, designwithinreachoutlet, dirtdevil, Dysonoutlet, filaofficial, Glassesworlds, Hanesofficial, hoover-outlet-store, huffycorporation, ilovedooneyoutlet, incipio_store, jabra-company-store, jockeystore, luxyvip, monoprice.com, officialpumastore, online_shoes, Purewatches, reebok_official, samsonite, shelterlogicdirect, simplemodernshop, Snowjoe_factory_outlet, sunframes, Thewatchoutlet, Watch_chest, Watchbox_GovbergJewelers, Watchgooroo, World-of-optics, worxgt, Zwilling_j.a._henckels.How to redeem your Coupon: Additional Coupon Terms & Conditions:  Limit one use per transaction (or cart) while supplies last. Max one redemption per user. Coupon is subject to U.S laws, void where prohibited, not redeemable for cash, has no face value, and cannot be combined with any other Coupon, or when paying with PayPal Credit Easy Payments or Gift Cards. eBay may cancel, amend, or revoke the Coupon at any time. Coupon does not apply to auction-style listings or purchases made through the Best Offer feature. If you are attempting to use this Coupon to buy items from both managed payments seller(s) and non-managed payments seller(s), your cart may be divided into two separate transactions. If that happens, this Coupon will be applied to the first transaction if it meets the minimum purchase requirement.  If the first transaction does not meet the purchase requirement, this Coupon will not be applied. If your second transaction meets the purchase requirement, you must apply this Coupon during the second transaction.3 Eligible items for Best Price Guarantee must be available from an approved competitor, including Amazon.com, BestBuy.com, HomeDepot.com, Jet.com, Sears.com, Target.com, Walmart.com, and Wayfair.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-launches-early-black-friday-drops-and-unveils-holiday-brand-outlet-300949720.htmlSOURCE  eBay Inc."
    },
    {
        "title": "eBay Inc. Announces Leadership Transition",
        "subtitle": "Scott Schenkel Appointed Interim Chief Executive Officer",
        "date": "Sep 25, 2019 9:00AM EDT",
        "content": "SAN JOSE, Calif., Sept. 25, 2019 /PRNewswire/ -- eBay Inc. (NASDAQ: EBAY) today announced that the Company's Board of Directors has appointed Scott Schenkel, most recently eBay's Senior Vice President, Chief Financial Officer, as interim Chief Executive Officer. This appointment follows Devin Wenig stepping down as President and CEO, and a director of the Company. The eBay Board will undertake a search to identify the Company's next CEO, and will consider internal and external candidates.Thomas Tierney, Chairman of the eBay Inc. Board, said, \"During his 12 years at eBay, Scott has demonstrated that he is a strong and dynamic leader who knows our business inside and out. He has worked closely with our teams across the Company to execute our strategy. We are confident that Scott's experience at eBay positions him well to lead the Company during this time.\"Mr. Schenkel said, \"eBay is an exciting and successful global marketplace that is powered by our amazing team, iconic brand and premier platform. In addition to our people who want to make a difference, our leadership has experience and fresh perspectives to build on our success. As the Board conducts a search, we will continue to focus on our strategic plan and product initiatives, while also ensuring a great customer experience and a smooth transition. eBay is well positioned to deliver enhanced value for our customers and shareholders alike.\" Mr. Tierney added, \"Devin has been a tireless advocate for driving improvement in the business, particularly in leading the Company forward after the PayPal spinoff. Indeed, eBay is stronger today than it was four years ago. Notwithstanding this progress, given a number of considerations, both Devin and the Board believe that a new CEO is best for the Company at this time.\" The Company also announced that Andy Cring, eBay's Vice President, Global Financial Planning and Analysis, has been appointed to serve as interim Chief Financial Officer. eBay reaffirmed its full year guidance for 2019 of organic FX-neutral revenue growth of 2% to 3%, non-GAAP EPS growth of $2.70 to $2.75 per share and GAAP EPS growth of $1.97 to $2.07 per share.eBay noted that its previously announced operating review is ongoing, and the Company expects to provide an update this fall. In addition, eBay's strategic review of its asset portfolio, including StubHub and eBay Classifieds Group, is continuing to move forward with the assistance of Goldman Sachs & Co. LLC. About Scott SchenkelMr. Schenkel has served as Senior Vice President and Chief Financial Officer of eBay Inc. since 2015, leading finance, analytics and information technology, as well as eBay's Classifieds business unit. Previously, he spent six years as Senior Vice President and Chief Financial Officer of eBay Marketplace, where he was responsible for overseeing finance, analytics, strategy and innovation across the business. Mr. Schenkel joined eBay in 2007 as Vice President of Global Financial Planning and Analysis. Prior to eBay, Mr. Schenkel spent nearly 17 years at General Electric in a variety of finance roles, including Chief Financial Officer of GE Healthcare Clinical Systems, a global healthcare equipment and clinical information technology solutions provider, Chief Financial Officer for GE Plastics Europe and Chief Financial Officer of GE Lighting Europe. Mr. Schenkel began his career as part of GE's Financial Management Program with its Power Distribution division in North Carolina.Mr. Schenkel currently serves on the board of NetApp as Chair of its Audit Committee. He received his B.S. from Virginia Polytechnic Institute and State University's Pamplin College of Business.About Andy CringMr. Cring has served as Vice President of Global Financial Planning and Analysis at eBay Inc. since joining the Company in 2013. Mr. Cring has been responsible on a global basis for financial oversight of all functions at eBay, including technology, marketing and operations. Prior to eBay, Mr. Cring served as Senior Vice President of FP&A at Yahoo! from 2009 to 2012. Before joining Yahoo!, Mr. Cring spent 17 years at General Electric in a variety of finance roles, including Chief Financial Officer of Sensing and Inspection Technologies as well as Financial Planning and Analysis leader at both GE Lighting and GE Plastics. Mr. Cring began his career as part of GE's Financial Management Program with its Lighting division in Cleveland, Ohio. Mr. Cring received his M.B.A from Clarkson University and his B.A. in Economics from St. Lawrence University. About eBayeBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity for all. Founded in 1995 in San Jose, Calif., eBay is one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2018, eBay enabled $95 billion of gross merchandise volume. For more information about the company and its global portfolio of online brands, visit www.ebayinc.com.Forward-Looking Statements This press release contains forward-looking statements that are based on the company's current expectations, forecasts and assumptions and involve risks and uncertainties. These statements include, but are not limited to, statements regarding the future performance of eBay Inc. and its consolidated subsidiaries, including full year guidance for 2019, leadership changes and the company's operating and strategic reviews. Actual results could differ materially from those predicted or implied, and reported results should not be considered as an indication of future performance. Other factors that could cause or contribute to such differences include, but are not limited to: changes in political, business and economic conditions, any regional or general economic downturn or crisis and any conditions that affect ecommerce growth or cross-border trade; the company's ability to realize expected growth opportunities in payments intermediation and advertising; the outcome of the operating and strategic portfolio reviews; fluctuations in foreign currency exchange rates; the company's need to successfully react to the increasing importance of mobile commerce and the increasing social aspect of commerce; an increasingly competitive environment for its business; changes to the company's capital allocation, including the timing, declaration, amount and payment of any future dividends or levels of the company's share repurchases, or management of operating cash; the company's ability to manage its indebtedness, including managing exposure to interest rates and maintaining its credit ratings; the company's need to manage an increasingly large enterprise with a broad range of businesses of varying degrees of maturity and in many different geographies; the company's need and ability to manage regulatory, tax, data security and litigation risks; whether the operational, marketing and strategic benefits of the separation of the eBay and PayPal businesses can be achieved; the company's ability to timely upgrade and develop its technology systems, infrastructure and customer service capabilities at reasonable cost while maintaining site stability and performance and adding new products and features; and the company's ability to integrate, manage and grow businesses that have been acquired or may be acquired in the future.The forward-looking statements in this press release do not include the potential impact of any acquisitions or divestitures that may be announced and/or completed after the date hereof.More information about factors that could affect the company's results is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting the company's Investor Relations website at https://investors.ebayinc.com or the SEC's website at www.sec.gov. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the company on the date hereof. The company assumes no obligation to update such statements.  View original content to download multimedia:http://www.prnewswire.com/news-releases/ebay-inc-announces-leadership-transition-300925194.htmlSOURCE  eBay Inc."
    }
]