[
    {
        "title": "Exelon Reports Fourth Quarter and Full Year 2019 Results and Initiates 2020 Financial Outlook",
        "subtitle": "",
        "date": "Feb 11, 2020 6:50AM EST",
        "content": "    CHICAGO--(BUSINESS WIRE)--\nExelon Corporation (Nasdaq: EXC) today reported its financial results for the fourth quarter and full year 2019.\n\n“Each of our utilities achieved record-high customer satisfaction in 2019 as we continued to invest in infrastructure to increase reliability and prepare the grid to accommodate more renewable energy, electric vehicles and other technology necessary to meet the challenge of climate change,” said Christopher M. Crane, president and CEO of Exelon. “Our nuclear fleet achieved its highest capacity factor in company history, and our total generation output accounted for about 12 percent of all the carbon-free energy produced in the U.S., avoiding nearly 81 million metric tons of greenhouse gas emissions. We continued to support the communities we serve last year by volunteering a record-breaking 251,000 hours and donating nearly $52 million to nonprofits.”\n\n“We reported another strong year, with full-year adjusted (non-GAAP) earnings of $3.22 per share coming in above our revised guidance of $3.05 to $3.20 per share,” said Joseph Nigro, senior executive vice president and CFO, Exelon. “Last year we invested $5.5 billion in capital at the utilities - or about $150 million more than originally planned - to modernize the electric grid, and we are on track to invest an additional $6.5 billion in the year ahead as we work to provide our customers with more reliable service and help our states meet their environmental goals. With these investments and our continuing focus on reducing costs, we are providing 2020 adjusted (non-GAAP) earnings guidance of $3.00 to $3.30 per share.”\n\nFourth Quarter 2019\n\nExelon's GAAP Net Income for the fourth quarter of 2019 increased to $0.79 per share from $0.16 per share in the fourth quarter of 2018. Adjusted (non-GAAP) Operating Earnings increased to $0.83 per share in the fourth quarter of 2019 from $0.58 per share in the fourth quarter of 2018. For the reconciliations of GAAP Net Income to Adjusted (non-GAAP) Operating Earnings, refer to the tables beginning on page 6.\n\nAdjusted (non-GAAP) Operating Earnings in the fourth quarter of 2019 primarily reflect:\n\nFull Year 2019\n\nExelon's GAAP Net Income increased to $3.01 per share from $2.07 per share in 2018. Exelon's Adjusted (non-GAAP) Operating Earnings for 2019 increased to $3.22 per share from $3.12 per share in 2018.\n\nAdjusted (non-GAAP) Operating Earnings for the full year 2019 primarily reflect:\n\nOperating Company Results1\n\nComEd\n\nComEd's fourth quarter of 2019 GAAP Net Income and Adjusted (non-GAAP) Operating Earnings remained relatively consistent with the fourth quarter of 2018. Due to revenue decoupling, ComEd's distribution earnings are not affected by actual weather or customer usage patterns.\n\nPECO\n\nPECO’s fourth quarter of 2019 GAAP Net Income and Adjusted (non-GAAP) Operating Earnings remained relatively consistent with the fourth quarter of 2018. The favorable impacts of regulatory rate increases were offset by unfavorable weather conditions and volume and higher storm costs.\n\nBGE\n\nBGE’s fourth quarter of 2019 GAAP Net Income increased to $99 million from $71 million in the fourth quarter of 2018. BGE’s Adjusted (non-GAAP) Operating Earnings for the fourth quarter of 2019 increased to $101 million from $72 million in the fourth quarter of 2018, primarily due to regulatory rate increases. Due to revenue decoupling, BGE's distribution earnings are not affected by actual weather or customer usage patterns.\n\n____________________\n\n1Exelon’s five business units include ComEd, which consists of electricity transmission and distribution operations in northern Illinois; PECO, which consists of electricity transmission and distribution operations and retail natural gas distribution operations in southeastern Pennsylvania; BGE, which consists of electricity transmission and distribution operations and retail natural gas distribution operations in central Maryland; PHI, which consists of electricity transmission and distribution operations in the District of Columbia and portions of Maryland, Delaware, and New Jersey and retail natural gas distribution operations in northern Delaware; and Generation, which consists of owned and contracted electric generating facilities and wholesale and retail customer supply of electric and natural gas products and services, including renewable energy products and risk management services.\n\nPHI\n\nPHI’s fourth quarter of 2019 GAAP Net Income and Adjusted (non-GAAP) Operating Earnings remained relatively consistent with the fourth quarter of 2018. The favorable impacts of regulatory rate increases were offset by an increase in various expenses. Due to revenue decoupling, PHI's distribution earnings related to Pepco Maryland, DPL Maryland and Pepco District of Columbia are not affected by actual weather or customer usage patterns.\n\nGeneration\n\nGeneration had GAAP Net Income of $397 million in the fourth quarter of 2019 compared with a GAAP Net Loss of $178 million in the fourth quarter of 2018. Generation’s Adjusted (non-GAAP) Operating Earnings for the fourth quarter of 2019 increased to $427 million from $221 million in the fourth quarter of 2018, primarily reflecting higher realized energy prices, decreased nuclear outage days, lower operating and maintenance expense and research and development income tax benefits, partially offset by lower capacity prices.\n\nThe proportion of expected generation hedged for the Mid-Atlantic, Midwest, New York and ERCOT reportable segments as of Dec. 31, 2019, was 91.0% to 94.0% for 2020 and 61.0% to 64.0% for 2021.\n\nInitiates Annual Guidance for 2020\n\nExelon introduced a guidance range for 2020 Adjusted (non-GAAP) Operating Earnings of $3.00-$3.30 per share. The outlook for 2020 Adjusted (non-GAAP) Operating Earnings for Exelon and its subsidiaries excludes the following items:\n\nRecent Developments and Fourth Quarter Highlights\n\nEnergy Capture for the wind and solar fleet was 96.2% in the fourth quarter of 2019, compared with 97.0% in the fourth quarter of 2018.\n\nGAAP/Adjusted (non-GAAP) Operating Earnings Reconciliations\n\nAdjusted (non-GAAP) Operating Earnings for the fourth quarter of 2019 do not include the following items (after tax) that were included in reported GAAP Net Income:\n\nAdjusted (non-GAAP) Operating Earnings for the fourth quarter of 2018 do not include the following items (after tax) that were included in reported GAAP Net Income:\n\nAdjusted (non-GAAP) Operating Earnings for the full year 2019 do not include the following items (after tax) that were included in reported GAAP Net Income:\n\nAdjusted (non-GAAP) Operating Earnings for the full year 2018 do not include the following items (after tax) that were included in reported GAAP Net Income:\n\n____________\n\n(a) Exelon’s and PHI’s amounts have been revised to reflect the correction of an error.\n\nNote:\nUnless otherwise noted, the income tax impact of each reconciling item between GAAP Net Income and Adjusted (non-GAAP) Operating Earnings is based on the marginal statutory federal and state income tax rates for each Registrant, taking into account whether the income or expense item is taxable or deductible, respectively, in whole or in part. For all items except the unrealized gains and losses related to NDT funds, the marginal statutory income tax rates for 2019 and 2018 ranged from 26.0% to 29.0%. Under IRS regulations, NDT fund returns are taxed at different rates for investments if they are in qualified or non-qualified funds. The effective tax rates for the unrealized gains and losses related to NDT funds were 46.1% and 41.4% for the three months ended Dec. 31, 2019 and 2018, respectively; and were 47.3% and 46.2% for the twelve months ended Dec. 31, 2019 and 2018, respectively.\n\nWebcast Information\n\nExelon will discuss fourth quarter 2019 earnings in a one-hour conference call scheduled for today at 9 a.m. Central Time (10 a.m. Ea​stern Time).​ The webcast and associated materials can be accessed at www.exeloncorp.com/investor-relations.\n\nAbout Exelon\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2019 revenue of $34 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 31,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including three fourths of the Fortune 100. Follow Exelon on Twitter @Exelon.\n\nNon-GAAP Financial Measures\n\nIn addition to net income as determined under generally accepted accounting principles in the United States (GAAP), Exelon evaluates its operating performance using the measure of Adjusted (non-GAAP) Operating Earnings because management believes it represents earnings directly related to the ongoing operations of the business. Adjusted (non-GAAP) Operating Earnings exclude certain costs, expenses, gains and losses and other specified items. This measure is intended to enhance an investor’s overall understanding of period over period operating results and provide an indication of Exelon’s baseline operating performance excluding items that are considered by management to be not directly related to the ongoing operations of the business. In addition, this measure is among the primary indicators management uses as a basis for evaluating performance, allocating resources, setting incentive compensation targets and planning and forecasting of future periods. Adjusted (non-GAAP) Operating Earnings is not a presentation defined under GAAP and may not be comparable to other companies’ presentation. The Company has provided the non-GAAP financial measure as supplemental information and in addition to the financial measures that are calculated and presented in accordance with GAAP. Adjusted (non-GAAP) Operating Earnings should not be deemed more useful than, a substitute for, or an alternative to the most comparable GAAP Net Income measures provided in this earnings release and attachments. This press release and earnings release attachments provide reconciliations of adjusted (non-GAAP) Operating Earnings to the most directly comparable financial measures calculated and presented in accordance with GAAP, are posted on Exelon’s website: www.exeloncorp.com, and have been furnished to the Securities and Exchange Commission on Form 8-K on Feb. 11, 2020.\n\nCautionary Statements Regarding Forward-Looking Information\n\nThis press release contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks and uncertainties. The factors that could cause actual results to differ materially from the forward-looking statements made by the Registrants include those factors discussed herein, as well as the items discussed in (1) the Registrants' 2018 Annual Report on Form 10-K in (a) Part I, ITEM 1A. Risk Factors, (b) Part II, ITEM 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and (c) Part II, ITEM 8. Financial Statements and Supplementary Data: Note 22, Commitments and Contingencies; (2) the Registrant’s Third Quarter 2019 Quarterly Report on Form 10-Q in (a) Part II, ITEM 1A. Risk Factors, (b) Part I, ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations and (c) Part I, ITEM 1. Financial Statements: Note 16, Commitments and Contingencies; and (3) other factors discussed in filings with the SEC by the Registrants. Readers are cautioned not to place undue reliance on these forward-looking statements, which apply only as of the date of this press release. None of the Registrants undertakes any obligation to publicly release any revision to its forward-looking statements to reflect events or circumstances after the date of this press release.\n\n \n\n__________\n\n \n\n__________\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005411/en/\nPaul Adams\nCorporate Communications\n202-637-0317\n\nEmily Duncan\nInvestor Relations\n312-394-2345\nSource: Exelon Corporation"
    },
    {
        "title": "Exelon Corporation Declares Dividend",
        "subtitle": "",
        "date": "Jan 28, 2020 11:15AM EST",
        "content": "    PHILADELPHIA--(BUSINESS WIRE)--\nThe Board of Directors of Exelon Corporation declared a regular quarterly dividend of $0.3825 per share on Exelon’s common stock. The dividend is payable on Tuesday, March 10, 2020, to shareholders of record of Exelon as of 5 p.m. Eastern time on Thursday, Feb. 20, 2020.\n\nAbout Exelon Corporation\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with 31,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including three fourths of the Fortune 100. Follow Exelon on Twitter @Exelon.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005617/en/\nExelon Investor Relations Hotline\n312-394-2345\n\nPaul Adams\nExelon Corporate Communications\n410-470-4167\npaul.adams2@exeloncorp.com\nSource: Exelon Corporation"
    },
    {
        "title": "HOF Village, LLC Secures Multimillion Dollar Funding through Constellation's Efficiency Made Easy Program",
        "subtitle": "Creative financing agreement will further advance funding for Phase II development of the Johnson Controls Hall of Fame Village",
        "date": "Jan 13, 2020 8:00AM EST",
        "content": "CANTON, Ohio, Jan. 13, 2020 /PRNewswire/ -- HOF Village, LLC (HOFV), the owner of the premier sports, entertainment and media enterprise surrounding the Pro Football Hall of Fame in Canton, Ohio, today announced that it has secured multimillion dollar funding from Constellation to implement energy efficiency measures and finance construction of the Constellation Center for Excellence, further advancing Phase II of the development of the Johnson Controls Hall of Fame Village. Constellation, a subsidiary of Exelon Corporation (Nasdaq: EXC) and a leading competitive energy company, is providing the funding through its Efficiency Made Easy (EME) program, which will enable the HOFV to install energy efficient technology and systems without any upfront capital expense.  As part of a multi-year naming rights agreement announced in January 2019, Constellation is the official energy provider of HOFV and the Pro Football Hall of Fame, and has employed its EME program to help the Johnson Controls Hall of Fame Village implement infrastructure designed to reduce energy consumption and advance the project into the next phase of its development.\"Our relationship with Constellation has provided tremendous, sustained value for our Company and for our project in Canton, and we are thrilled to expand our partnership, advancing Phase II development of the Johnson Controls Hall of Fame Village,\" said Mike Crawford, CEO of HOFV. \"We look forward to applying the EME flexible financing solution to energy conservation opportunities that will decrease our energy costs while positively impacting our environmental footprint. Additionally, this financing enables us to finalize the design and commence construction of the Constellation Center for Excellence, which will create a best-in-class office, medical and retail asset that offers wellness, discovery and sport-focused programming to the community.\"\"Efficiency Made Easy will enable the Hall of Fame Village to install energy efficient technology such as LED lighting displays, electric vehicle charging stations, and a state-of-the-art operations center and pay for those projects over the course of their energy contract,\" said Mark Huston, President of Constellation's National Retail Business. \"As this dynamic initiative continues to take shape, we're proud to help the Hall of Fame Village manage costs and realize sustainability goals.\" A key element of Phase II of the development of the Johnson Controls Hall of Fame Village, the Constellation Center for Excellence will include a variety of sport-centered research and programming. HOFV will identify tenants who exemplify excellence in what they do, striving to create an environment of collaboration that inspires people through design and programming to perform at their personal best. Potential programming in the 75,000 square-foot office and retail space may include sports research and will focus on player wellness and the development of the mind and the body. Constellation plans to utilize the Constellation Center for excellence to host regional energy conferences and other customer-focused events.On September 16, 2019, HOFV entered into a definitive business combination agreement with Gordon Pointe Acquisition Corp. (NASDAQ: GPAQ, GPAQU, GPAQW) that is expected to be completed in the first quarter of 2020. Upon the closing of the transaction, the combined company will change its name to Hall of Fame Resort & Entertainment Company and trade on the NASDAQ stock exchange under the ticker symbol \"HOFV.\" About HOF Village, LLCJohnson Controls Hall of Fame Village, a development of HOF Village, LLC is a multi-use sports, entertainment and media destination centered around the Pro Football Hall of Fame's campus in Canton, Ohio. It provides a themed sports, entertainment and media venue to capitalize on the popularity and fandom associated with professional football and its legendary players. HOF Village, LLC was founded by the Pro Football Hall of Fame through its wholly owned, for profit subsidiary Hall of Fame Village, Inc. and Industrial Realty Group, LLC.About Gordon Pointe Acquisition Corp.GPAQ is a special purpose acquisition company formed by Mr. James Dolan. GPAQ raised $125 million in its initial public offering in January of 2018. Additional information can be found at www.gordonpointe.com. About ConstellationConstellation is a leading competitive retail supplier of power, natural gas and energy products and services for homes and businesses across the continental United States. Constellation's family of retail businesses serves approximately 2 million residential, public sector and business customers, including three-fourths of the Fortune 100. Baltimore-based Constellation is a subsidiary of Exelon Corporation (Nasdaq: EXC), the nation's leading competitive energy provider, with 2018 revenues of approximately $36 billion, and more than 31,000 megawatts of owned capacity comprising one of the nation's cleanest and lowest-cost power generation fleets. Learn more at www.constellation.com or on Twitter at @ConstellationEG.CONTACT:Anne GrafficeHOF Village, LLC Media Inquiries330-458-9176Anne.Graffice@hofvillage.comJacques CornetHOF Village, LLC or Gordon Pointe Investor Inquiries646-277-1285Jacques.Cornet@icrinc.comWill SwettHOF Village LLC, or Gordon Pointe Investor Inquiries646-677-1818Will.Swett@icrinc.comDave SnyderConstellation Media Inquiries410-470-9700David.Snyder@constellation.com    View original content:http://www.prnewswire.com/news-releases/hof-village-llc-secures-multimillion-dollar-funding-through-constellations-efficiency-made-easy-program-300985500.htmlSOURCE  Gordon Pointe Acquisition Corp."
    },
    {
        "title": "LEAD PLAINTIFF DEADLINE: Johnson Fistel, LLP Encourages Investors to Contact the Firm",
        "subtitle": "",
        "date": "Jan 9, 2020 1:05AM EST",
        "content": " SAN DIEGO, Jan. 9, 2020 /PRNewswire/ -- Johnson Fistel, LLP announces that class action lawsuits have been commenced on behalf of shareholders of the publicly-traded companies listed below. The Private Securities Litigation Reform Act of 1995 permits any investor who purchased common stock during the Class Period to seek appointment as lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation.  The lead plaintiff can select a law firm of its choice.  An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.  If you wish to serve as lead plaintiff, you must move the Court no later than the dates listed below. If you wish to discuss this action or have any questions concerning this notice or your rights or interests, please contact lead analyst Jim Baker (jimb@johnsonfistel.com) at 619-814-4471. If emailing, please include a phone number.Additionally, you can Click Here  or any of the links below, there is no cost or obligation to you.About Johnson Fistel, LLP:Johnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York, and Georgia. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits. For more information about the firm and its attorneys, please visit https://www.johnsonfistel.com. Attorney advertising. Past results do not guarantee future outcomes.Contact:Johnson Fistel, LLPJim Baker, 619-814-4471jimb@johnsonfistel.com View original content:http://www.prnewswire.com/news-releases/lead-plaintiff-deadline-johnson-fistel-llp-encourages-investors-to-contact-the-firm-300984040.htmlSOURCE  Johnson Fistel, LLP"
    },
    {
        "title": "HAGENS BERMAN, NATIONAL TRIAL ATTORNEYS, Encourages Exelon Corporation (EXC) Investors with Significant Losses to Contact Its Attorneys, Securities Fraud Lawsuit Filed",
        "subtitle": "",
        "date": "Dec 17, 2019 8:05PM EST",
        "content": "SAN FRANCISCO, Dec. 17, 2019 /PRNewswire/ -- Hagens Berman urges Exelon Corporation (NASDAQ: EXC) investors who have suffered losses in excess of $50,000 to submit their losses now to learn if they qualify to recover their investment losses.  A securities fraud class action has been filed against the Company and senior executives.Exelon Corporation (EXC) Securities Class Action: The Complaint alleges that throughout the Class Period, Defendants concealed that Exelon and its executives were engaged in unlawful lobbying activities and that revenues generated by Exelon's subsidiary, ComEd, were in part the product of unlawful conduct.The Complaint alleges that market the learned the truth through a series of disclosures, beginning on July 15, 2019, when Defendants disclosed that both Exelon and ComEd had received a grand jury subpoena from the DOJ requiring information concerning their lobbying activities in Illinois. Then, on Oct. 9, 2019, Defendants disclosed that both Exelon and ComEd had received a second grand jury subpoena from the DOJ, now seeking communications with certain individuals and entities, including Illinois State Senator Martin Sandoval. On Oct. 15, 2019, Exelon announced the abrupt departure of Anne Pramaggiore, Chief Executive Officer of Exelon Utilities, and former President/CEO of ComEd. Then, on Oct. 31, 2019, Defendants disclosed that the SEC had also opened an investigation into Exelon's lobbying activities. Finally, on Nov. 1, 2019, the Chicago Tribune reported that according to a source with knowledge, Ms. Pramaggiore was one focus of the ongoing federal investigation. According to the same article, ComEd's lobbying investigation dated back to at least mid-May 2019, when the FBI executed search warrants at the homes of former lobbyist Mike McClain of Quincy, a longtime confidant of House Speaker Michael Madigan, and of former 23rd Ward Ald. Michael Zalewski. Additionally, the FBI sought communications among Madigan, McClain and Zalewski about attempts to obtain ComEd lobbying work for Zalewski. If you invested in Exelon between Feb. 9, 2019 and Nov. 1, 2019 (the \"Class Period\") and suffered significant losses, you may qualify to be a lead plaintiff – one who selects and oversees the attorneys prosecuting the case.  Contact Hagens Berman immediately for more information about the case and being a lead plaintiff.\"We're focused on recovering investors' substantial losses and proving Exelon concealed its illicit lobbying activities from investors,\" said Hagens Berman partner Reed Kathrein.If you purchased shares of Exelon and suffered significant losses, click here to discuss your legal rights with Hagens Berman.Whistleblowers: Persons with non-public information regarding Exelon should consider their options to help in the investigation or take advantage of the SEC Whistleblower program.  Under the new program, whistleblowers who provide original information may receive rewards totaling up to 30 percent of any successful recovery made by the SEC.  For more information, call Reed Kathrein at 844-916-0895 or email EXC@hbsslaw.com. About Hagens BermanHagens Berman is a national law firm with nine offices in eight cities around the country and eighty attorneys.  The firm represents investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.Contact: Reed Kathrein, 844-916-0895  View original content to download multimedia:http://www.prnewswire.com/news-releases/hagens-berman-national-trial-attorneys-encourages-exelon-corporation-exc-investors-with-significant-losses-to-contact-its-attorneys-securities-fraud-lawsuit-filed-300976549.htmlSOURCE  Hagens Berman Sobol Shapiro LLP"
    },
    {
        "title": "BGE Announces Updates to Its State Affairs Team in Annapolis",
        "subtitle": "",
        "date": "Dec 12, 2019 12:08PM EST",
        "content": "    BALTIMORE--(BUSINESS WIRE)--\nIn an ongoing effort to strengthen its leadership team and build on its history of delivering distinctive customer service, BGE announces that Sandy I-ru Grace has been named vice president of Governmental and External Affairs. Sandy will be responsible for shaping, leading and directing the company’s positions on legislation affecting BGE’s central Maryland customers. Sandy succeeds Valencia McClure, who retires this month.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191212005632/en/Sandy I-ru Grace (Photo: Business Wire)\n“Sandy brings to BGE a wealth of knowledge and experience that will be invaluable as we work with legislators in the Maryland General Assembly to provide innovative solutions to our customers’ energy needs,” said Rodney Oddoye, incoming senior vice president of Governmental and External Affairs. “I look forward to working with Sandy on behalf of BGE’s customers.” Grace will report to Oddoye whose appointment was announced in September. Both assume their new roles on January 1, 2020.\n\nCurrently, Sandy serves as vice president of Policy Development at Exelon Utilities, where she is responsible for developing and aligning policy positions across Exelon’s fleet of utilities, including BGE. She has also previously served as director and assistant general counsel at Exelon. Sandy joined Exelon in 2010.\n\nSandy is a member of the Maryland Bar, District of Columbia Bar, Court of Appeals for the Ninth Circuit, Court of Appeals for D.C. Circuit, Energy Bar Association. She previously served as Chair of the D.C. Mayor’s Commission on Violence Against Women and on the Board of Directors for the Asian Pacific Islander Domestic Violence Resource Project.\n\nBGE, founded in 1816 as the nation’s first gas utility and headquartered in Baltimore, is Maryland’s largest natural gas and electric utility. The company’s approximately 3,200 employees are committed to safe and reliable energy delivery to more than 1.3 million electric customers and more than 680,000 natural gas customers in central Maryland. In the J.D. Power 2017, 2018, and 2019 Electric Utility Business Customer Satisfaction Studies SM BGE was ranked Highest in Customer Satisfaction with Business Electric Service in the East among Large Utilities. In the J.D. Power 2018 and 2019 Gas Utility Business Customer Satisfaction Studies SM BGE was ranked Highest in Customer Satisfaction with Business Natural Gas Service among utilities in the East Region. BGE is a subsidiary of Exelon Corporation (Nasdaq: EXC), the nation’s leading competitive energy provider. Connect with BGE on Facebook, Twitter, Instagram, and YouTube, and engage with the latest BGE stories on bgenow.com. \n\nBaltimore Gas and Electric Company (or \"BGE\") received the highest score in the East Region of the 2019 Gas Utility Business Customer Satisfaction Study and the East Large Segment of the 2019 Electric Utility Business Customer Satisfaction Study of gas and electric utility customer satisfaction among business customers. Visit jdpower.com/awards.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191212005632/en/\nLinda Foy, linda.foy@bge.com\nBaltimore Gas and Electric Company (BGE)\nBGE Media Hotline: 410.470.7433\nSource: Baltimore Gas and Electric Company (BGE)"
    },
    {
        "title": "Exelon Chief Corporate Affairs Officer Maggie FitzPatrick Named to 2019 C-Suite Award Class by Washington Business Journal",
        "subtitle": "",
        "date": "Dec 6, 2019 8:00AM EST",
        "content": "    CHICAGO--(BUSINESS WIRE)--\nMaggie FitzPatrick, senior vice president of Corporate Affairs, Philanthropy and Customer Engagement, has been selected as a member of the 2019 Washington Business Journal’s C-Suite Award class. Each year, WBJ recognizes a small number of executive leaders who have demonstrated vital leadership and business savvy to guide their businesses to success during the year.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191206005061/en/Exelon Chief Corporate Affairs Officer Maggie FitzPatrick named to 2019 C-Suite Award Class by Washington Business Journal (Photo: Business Wire)\n“At Exelon, our success depends not only on meeting our customers’ expectations, but on our commitment to investing in the communities we serve,” FitzPatrick said. “I am incredibly proud of our workforce, who not only work tirelessly to deliver clean and reliable power to our communities, but who are dedicated to giving back through our many volunteer and philanthropic programs.”\n\nSince FitzPatrick joined Exelon nearly four years ago, the company has been named to the Fortune 100 and Fortune Most Admired Companies lists and the Exelon leadership team became the first in the energy sector to advance enhanced paid family leave and pay equity programs. Exelon also is shaping the future clean energy workforce, investing heavily in STEM education and committing $3 million to STEM programs aimed at young women as part of the United Nations Women’s HeForShe gender equity initiative. During her tenure, FitzPatrick has overseen more than $50 million in annual philanthropic giving, which has reached record levels during her time with the company.\n\nIn addition to this WBJ recognition, FitzPatrick also was recently nominated to PRNEWS’ 2019 Top Women in PR honoree list, a prestigious group which represents the women trailblazers who are making a tremendous impact in the communications field through their innovation and leadership. Earlier this year, FitzPatrick was inducted into the PR Week Hall of Femme, an annual award honoring stand-out women leaders in the communications industry.\n\nThe 2019 Washington Business Journal’s C-Suite class was formally honored at the CEO of the Year and C-Suite Awards celebration on December 5 in Washington D.C., and in the December 6 issue of the Washington Business Journal.\n\nAbout Exelon Corporation\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 31,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Follow Exelon on Twitter @Exelon.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191206005061/en/\nElizabeth Keating\nCorporate Communications\n312-394-4111\nelizabeth.keating@exeloncorp.com\nSource: Exelon Corporation"
    },
    {
        "title": "Exelon Appoints Calvin G. Butler Jr. as Senior Executive Vice President of Exelon and CEO of Exelon Utilities; Carim Khouzami Named CEO of Baltimore Gas and Electric",
        "subtitle": "",
        "date": "Dec 4, 2019 4:15PM EST",
        "content": "    CHICAGO--(BUSINESS WIRE)--\nExelon Corporation (Nasdaq: EXC) today announced that it has appointed Calvin G. Butler Jr., CEO of Baltimore Gas and Electric Company (“BGE”), as senior executive vice president of Exelon and CEO of Exelon Utilities, a role he has held on an interim basis since October 15. Carim Khouzami, currently senior vice president and chief operating officer of Exelon Utilities, will replace Butler as CEO of BGE. Both appointments are effective immediately.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191204005797/en/Calvin G. Butler Jr., CEO of Exelon Utilities (Photo: Business Wire)\n“With this strong leadership team in place, Exelon Utilities will continue to drive innovation and deliver the best possible results for our customers and the communities we serve,” said Christopher M. Crane, president and CEO of Exelon. “Calvin and Carim are part of a deep bench of talented industry leaders who are building Exelon’s next-generation energy grid with a focus on sustainability, resiliency and reliability.”\n\nIn his new role, Butler will oversee Exelon’s six local electric and gas companies -- Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco. Together, they form the nation’s largest utility company by customer count, serving approximately 10 million electric and gas customers in New Jersey, Maryland, Illinois, Delaware, Pennsylvania and the District of Columbia, respectively. He will remain a resident of Baltimore and work out of Exelon’s D.C. offices. \n\nButler is an 11-year veteran of Exelon and has more than 25 years of leadership experience in the utilities industry and in regulatory, legislative and public affairs. As CEO of BGE, he was responsible for implementing the utility’s strategic priorities, including its initiatives related to safety, reliability, customer service, innovation and diversity and inclusion. Butler serves on BGE’s board of directors and on Exelon’s Executive Committee. In addition, he is board chair of the Gridwise Alliance, an advocacy organization promoting modernization and innovation for the nation’s electrical grid, and serves on the board of directors for RLI Corp., where he is a member of the Audit and Nominations/Governance Committees. He is an Independent Trustee of the PNC Funds Board, and previously served on the board of directors for the Federal Reserve Bank of Richmond.\n\n“Under Calvin’s leadership, BGE has made significant advancements in customer service and electric reliability, resulting in record customer satisfaction and solid financial results,” Crane said. “His strong track record will be invaluable as we further our commitment to provide clean, affordable and reliable energy in the communities we serve.”\n\nAs senior vice president and chief operating officer of Exelon Utilities since 2018, Khouzami has overseen daily administrative and operational functions for Exelon’s six regulated utilities, including BGE. He previously served as chief financial officer for Exelon Utilities. His 14 years in the energy sector started with Constellation and BGE, which were acquired by Exelon in 2012. Khouzami served as chief integration officer for Exelon’s merger with Pepco Holdings, Inc. (PHI). Prior to leading the PHI merger integration, Khouzami was BGE’s chief financial officer during the company’s merger and integration with Exelon. While serving as Constellation’s executive director of investor relations, Khouzami was ranked as the top investor relations professional in electric utilities by Institutional Investor in 2010. He previously held investment banking and financial analyst positions with Bear Stearns and Bank of America. A resident of the Baltimore area, Khouzami is active within the community, serving on the boards of the Port Discovery Children’s Museum and the Roland Park Baseball League.\n\n“Carim’s deep understanding of our business from his previous roles at BGE and across each of Exelon’s utilities is an asset not only to Exelon but to the communities that BGE serves,” said Calvin G. Butler Jr. “He has led safety, operational, financial and customer-focused initiatives that are contributing to Exelon’s utilities setting new industry standards for exceptional performance. We are excited to continue building on this momentum for our customers, employees and shareholders.”\n\nFor more information on Exelon’s senior leaders, visit: http://www.exeloncorp.com/leadership-and-governance/executive-profiles\n\nAbout Exelon Corporation\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 31,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Follow Exelon on Twitter @Exelon.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204005797/en/\nPaul Adams\nCorporate Communications\n410-470-4167\npaul.adams2@exeloncorp.com\nSource: Exelon Corporation"
    },
    {
        "title": "Exelon Generation to Begin Negotiations to Acquire Full Ownership of R.E. Ginna, Nine Mile Point and Calvert Cliffs",
        "subtitle": "",
        "date": "Nov 20, 2019 7:45AM EST",
        "content": "\nEDF, which owns a 49.99 percent interest in the three plants, has provided notice that it will exercise its put option to sell its ownership interest to Exelon Generation \n    KENNETT SQUARE, Pa.--(BUSINESS WIRE)--\nExelon Generation announced today that EDF is exercising the put option to sell its 49.99 percent interest in the R.E. Ginna, Nine Mile Point and Calvert Cliffs nuclear energy facilities.\n\nAs Exelon has reported in its financial filings, the put option was established in connection with the joint operating services agreement signed by the two companies in April 2014 to enable Exelon Generation to take over operations at the three nuclear plants. Exelon Generation already is the majority owner and operator of the plants, which are located in New York and Maryland. Exelon Generation’s purchase of EDF’s ownership interest will have no impact on plant operations or employees.\n\n\"Since Exelon Generation took over operations, we have created value for both Exelon and EDF by integrating the three plants into the nation’s largest and best-run nuclear fleet. Leveraging the Exelon management model, we’ve improved overall fleet performance and efficiency while reducing costs in a challenging market environment,” said Chris Crane, Exelon President and CEO. “We have worked collaboratively with EDF leadership as co-owners of these three nuclear plants and look forward to partnering with them in a productive process to purchase their ownership stake.”\n\nAs part of the acquisition process, EDF and Exelon Generation will seek a negotiated agreement on the sale price. If an agreement cannot be reached, the price will be set through a third-party arbitration process to determine fair market value. The transaction will require approval by the New York Public Service Commission, the Federal Energy Regulatory Commission and the Nuclear Regulatory Commission. The process and regulatory approvals could take one to two years or more to complete.\n\nExelon Generation would become the full 100 percent owner of the three zero-carbon nuclear energy facilities, which consist of the single-unit R.E. Ginna Nuclear Power Plant (576 megawatts) and the dual-unit Nine Mile Point Nuclear Station (1,907 megawatts), both in upstate New York; and the dual-unit Calvert Cliffs Nuclear Power Plant (1,756 megawatts) in Maryland.\n\nExelon Generation, a subsidiary of Exelon Corporation (Nasdaq: EXC), is the nation’s largest producer of carbon-free energy, powering more than 20 million homes and businesses through a diverse generation fleet with more than 31,000 megawatts of capacity. Exelon Generation operates the largest U.S. fleet of zero-carbon nuclear plants with more than 18,700 megawatts from 21 reactors at 12 facilities in Illinois, Maryland, New York and Pennsylvania. It also operates a diverse mix of wind, solar, landfill gas, hydroelectric, natural gas and oil facilities in 19 states with more than 12,300 megawatts. Exelon Generation sets the standard for world-class power plant operations that produce clean, safe, reliable electricity, and is an active partner and economic engine in the communities it serves by providing jobs, charitable contributions and tax payments that help towns and regions grow. Follow Exelon Generation on Twitter @ExelonGen, view the Exelon Generation YouTube channel or visit exeloncorp.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005457/en/\nLacey Dean\nExelon Generation Communications\n610-765-5535\nLacey.dean@exeloncorp.com\nSource: Exelon Generation"
    },
    {
        "title": "Illinois’ Six Nuclear Energy Facilities at Full Power During Record Cold Snap",
        "subtitle": "",
        "date": "Nov 13, 2019 4:15PM EST",
        "content": "\nExelon Generation Illinois nuclear plants operated at full power throughout record cold snap, producing around-the-clock, carbon-free electricity for 11 million homes and businesses\n    WARRENVILLE, Ill.--(BUSINESS WIRE)--\nWhile temperatures plunged to record-breaking lows during an unusual November cold snap early this week, Exelon Generation's six Illinois nuclear plants operated at full power, producing enough power to keep 11 million homes and businesses safe and warm. Ten of the fleet’s 11 reactors ran at nearly 100 percent output levels throughout the week, providing schools, hospitals, businesses and residences the reliable, carbon-free electricity needed to keep heaters running. Dresden Station Unit 2 is currently shut down for a refueling outage.\n\n\"Even during this unseasonably cold weather, our Illinois fleet’s performance further demonstrates the reliability and resiliency of nuclear power in any kind of weather,” said Exelon’s Chief Nuclear Officer Bryan Hanson. “We are dedicated to being online when customers need us most, no matter what Mother Nature throws at us at any time of year.”\n\nExelon Generation’s Illinois nuclear fleet has proven its mettle time and again during Midwest deep freezes. Throughout record deep freezes earlier this year, the Illinois nuclear fleet operated at 100 percent around the clock. A year prior, the fleet recorded a near-perfect reliability rate, operating 97.6 percent of the time. And during the 2014 Polar Vortex, the plants were critical to meeting electricity demand, as coal piles froze and natural gas supplies were re-routed for home heating.\n\nWinter resiliency and reliability requires year-long planning, preparation and maintenance. Exelon Generation workers spend months ensuring that backup generators and spare equipment is ready for inclement weather. This fall, operators and maintenance personnel inspected freeze protection systems, tested electrical equipment, and properly aligned plant systems to prepare all Exelon Generation facilities for sub-zero temperatures, icy conditions and heavy snowfall. These efforts are in addition to the many equipment upgrades and \"winter readiness\" maintenance activities performed during refueling outages.\n\nExelon Generation, a subsidiary of Exelon Corporation (Nasdaq: EXC), is the nation’s largest producer of carbon-free energy, powering more than 20 million homes and businesses through a diverse generation fleet with more than 31,000 megawatts of capacity. Exelon Generation operates the largest U.S. fleet of zero-carbon nuclear plants with more than 18,700 megawatts from 21 reactors at 12 facilities in Illinois, Maryland, New York and Pennsylvania. It also operates a diverse mix of wind, solar, landfill gas, hydroelectric, natural gas and oil facilities in 19 states with more than 12,300 megawatts. Exelon Generation sets the standard for world-class power plant operations that produce clean, safe, reliable electricity, and is an active partner and economic engine in the communities it serves by providing jobs, charitable contributions and tax payments that help towns and regions grow. Follow Exelon Generation on Twitter @ExelonGen, view the Exelon Generation YouTube channel or visit exeloncorp.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191113005902/en/\nLinsey Wisniewski\nSr. Manager, Exelon Nuclear Communications\n630-657-4209\nlinsey.wisniewski@exeloncorp.com\nSource: Exelon Generation"
    },
    {
        "title": "HAGENS BERMAN, NATIONAL TRIAL ATTORNEYS, Encourages Exelon Corporation (EXC) Investors with $50K Plus Losses to Contact Its Attorneys Now, Firm Investigating Possible Securities Fraud",
        "subtitle": "",
        "date": "Nov 1, 2019 10:17PM EDT",
        "content": "SAN FRANCISCO, Nov. 1, 2019 /PRNewswire/ -- Hagens Berman urges Exelon Corporation (NASDAQ: EXC) investors who have suffered losses in excess of $50,000 to submit their losses now or contact the firm immediately to learn if they qualify to recover compensable damages.  The firm has opened an investigation into Exelon and investors may have valuable claims against the company and its senior management for violations of federal securities laws.Exelon Corporation (EXC) Investigation:The investigation centers on whether Exelon adequately disclosed the legality and financial impact of its lobbying activities.Exelon is an energy company that owns utilities in Philadelphia, Baltimore and Washington, D.C., as well as Commonwealth Edison (\"ComEd\") in Chicago.On July 15, 2019, Exelon announced that the company and ComEd had received a grand jury subpoena from the U.S. Attorney concerning Exelon's lobbying activities in Illinois.On Oct. 9, 2019, Exelon disclosed that it and ComEd had received a second grand jury subpoena concerning its communications with Illinois State Senator Martin Sandoval.Less than a week later, on Oct. 15, 2019, Exelon announced the sudden exit of Anne Pramaggiore, Sr. EVP and CEO of Exelon Utilities.  Analysts immediately identified the criminal subpoenas and Pramaggiore's abrupt resignation as \"being directly related to each other.\" Finally, on Oct. 31, 2019, the Company announced the SEC had now opened an investigation into the Company's lobbying activities.  Significantly, when asked by analysts, Exelon's CEO Chris Crane declined to respond whether the investigations into Exelon and ComEd's practices went beyond Illinois. In response to these disclosures, the price of Exelon shares has dropped precipitously.Whistleblowers: Persons with non-public information regarding Exelon should consider their options to help in the investigation or take advantage of the SEC Whistleblower program.  Under the new program, whistleblowers who provide original information may receive rewards totaling up to 30 percent of any successful recovery made by the SEC.  For more information, call Reed Kathrein at 510-725-3000 or email EXC@hbsslaw.com.About Hagens BermanHagens Berman is a national law firm with nine offices in eight cities around the country and eighty attorneys.  The firm represents investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.Contact: Reed Kathrein, 510-725-3000 View original content to download multimedia:http://www.prnewswire.com/news-releases/hagens-berman-national-trial-attorneys-encourages-exelon-corporation-exc-investors-with-50k-plus-losses-to-contact-its-attorneys-now-firm-investigating-possible-securities-fraud-300950239.htmlSOURCE  Hagens Berman Sobol Shapiro LLP"
    },
    {
        "title": "Exelon Corporation Declares Dividend",
        "subtitle": "",
        "date": "Nov 1, 2019 9:28AM EDT",
        "content": "    CHICAGO--(BUSINESS WIRE)--\nThe Board of Directors of Exelon Corporation declared a regular quarterly dividend of $0.3625 per share on Exelon’s common stock. The dividend is payable on Tuesday, Dec. 10, 2019, to shareholders of record of Exelon as of 5 p.m. Eastern time on Friday, Nov. 15, 2019.\n\nAbout Exelon Corporation\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 31,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Follow Exelon on Twitter @Exelon.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191101005348/en/\nExelon Investor Relations Hotline\n312-394-2345\n\nPaul Adams\nExelon Corporate Communications\n410-470-4167\npaul.adams2@exeloncorp.com\nSource: Exelon Corporation"
    },
    {
        "title": "Investor Alert: Kaplan Fox Investigates Exelon Corp.",
        "subtitle": "",
        "date": "Oct 31, 2019 5:39PM EDT",
        "content": "NEW YORK, Oct. 31, 2019 /PRNewswire/ -- Kaplan Fox & Kilsheimer LLP (www.kaplanfox.com) is investigating claims on behalf of investors who purchased shares of Exelon Corporation (\"Exelon\" or the \"Company\") (NASDAQ: EXC).On October 15, 2019, after the market closed, Exelon announced the immediate retirement of Anne Pramaggiore, the Company's Senior Executive Vice President and CEO.  According to the Chicago Sun-Times, the abrupt departure of Pramaggiore occurred amid federal investigations and subpoenas concerning lobbying activities and an expanding investigation of Senator Martin Sandoval.  According to the Chicago Sun-Times, Pramaggiore previously ran Commonwealth Edison (\"ComEd\"), Exelon's Chicago-based utility, which is \"among the most prominent lobbyists in Springfield because it has a legal monopoly on power delivery in northern Illinois and must follow rates and rules set by the state.\"On October 16, 2019, Exelon's shares fell $2.15 per share, about 4.6%, to close at $44.91 per share.Then, on October 31, 2019, the Company filed its quarterly report on Form 10-K with the SEC in which it disclosed that \"[o]n October 22, 2019, the SEC notified Exelon and ComEd that it has also opened an investigation into their lobbying activities.\"On October 31, 2019, Exelon's shares fell by about $1.50 per share, more than 3%, in midday trading. If you purchased Exelon shares and would like to discuss our investigation, please contact us by emailing pmayer@kaplanfox.com or by calling 800-290-1952.  This press release may be considered Attorney Advertising in some jurisdictions under the applicable law and ethical rules.Kaplan Fox & Kilsheimer LLP, with offices in New York, San Francisco, Los Angeles, Chicago and New Jersey, has many years of experience in prosecuting investor class actions. For more information about Kaplan Fox & Kilsheimer LLP, you may visit our website at www.kaplanfox.com.  If you have any questions about your rights or interests, please contact: Frederic S. FoxKAPLAN FOX & KILSHEIMER LLP850 Third Avenue, 14th FloorNew York, New York 10022(800) 290-1952(212) 687-1980Fax: (212) 687-7714E-mail: ffox@kaplanfox.comLaurence D. KingKAPLAN FOX & KILSHEIMER LLP350 Sansome Street, Suite 400 San Francisco, California  94104(415) 772-4700Fax:  (415) 772-4707E-mail: lking@kaplanfox.com  View original content:http://www.prnewswire.com/news-releases/investor-alert-kaplan-fox-investigates-exelon-corp-300949459.htmlSOURCE  Kaplan Fox & Kilsheimer LLP"
    },
    {
        "title": "Exelon Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 31, 2019 6:51AM EDT",
        "content": "\nEarnings Release Highlights\n\n \n    CHICAGO--(BUSINESS WIRE)--\nExelon Corporation (Nasdaq: EXC) today reported its financial results for the third quarter of 2019.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191031005232/en/Exelon Third-quarter Earnings Highlights (Graphic: Business Wire)\n“Ongoing infrastructure investment at our electric and gas companies is delivering solid financial and customer satisfaction results, while our clean generation fleet continues to achieve best-in-class reliability and operational efficiency,” said Christopher M. Crane, Exelon president and CEO. “Exelon was named to the Dow Jones Sustainability Index for the 14th consecutive year, ranking in the top 20 percent of North American companies in all industries. We continue to look for ways to meet customer expectations for a cleaner and more resilient energy grid, teaming with the Exelon Foundation to launch a new Climate Change Investment Initiative to fund startups focused on technologies to reduce emissions and advocating for state policies that will properly value nuclear and other clean energy resources.”\n\n\"Our third-quarter performance remained strong, with adjusted (non-GAAP) earnings of $0.92 cents per share exceeding our guidance range of $0.80 to $0.90 per share,” said Joseph Nigro, Exelon’s senior vice president and CFO. “We are on track to invest more than $5.4 billion at our electric and gas companies by year end to enhance reliability and resiliency. We are also announcing an additional $100 million in annual cost savings at Exelon Generation beginning in 2022, adding to the more than $900 million in companywide cost savings already announced between 2015 and 2018. We are narrowing our guidance range for full-year 2019 adjusted (non-GAAP) operating earnings from $3.00-$3.30 per share to $3.05-$3.20 per share.”\n\nThird Quarter 2019\n\nExelon's GAAP Net Income for the third quarter of 2019 increased to $0.79 per share from $0.76 per share in the third quarter of 2018. Adjusted (non-GAAP) Operating Earnings increased to $0.92 per share in the third quarter of 2019 from $0.88 per share in the third quarter of 2018. For the reconciliations of GAAP Net Income to Adjusted (non-GAAP) Operating Earnings, refer to the tables beginning on page 4.\n\nThe Adjusted (non-GAAP) Operating Earnings in the third quarter of 2019 primarily reflect higher utility earnings due to regulatory rate increases at PECO, BGE and PHI; and, at Generation, decreased nuclear outage days, increased revenue from ZECs in New York and New Jersey, and lower operating and maintenance expense, partially offset by decreased capacity prices and lower realized energy prices.\n\nOperating Company Results1\n\nComEd\n\nComEd's third quarter of 2019 GAAP Net Income and Adjusted (non-GAAP) Operating Earnings remained relatively consistent with the third quarter of 2018. Due to revenue decoupling, ComEd's distribution earnings are not affected by actual weather or customer usage patterns.\n\nPECO\n\nPECO’s third quarter of 2019 GAAP Net Income increased to $140 million from $126 million in the third quarter of 2018. PECO’s Adjusted (non-GAAP) Operating Earnings for the third quarter of 2019 increased to $141 million from $127 million in the third quarter of 2018, primarily due to regulatory rate increases partially offset by unfavorable weather conditions and volume.\n\nBGE\n\nBGE’s third quarter of 2019 GAAP Net Income decreased to $55 million from $63 million in the third quarter of 2018. BGE’s Adjusted (non-GAAP) Operating Earnings for the third quarter of 2019 decreased to $56 million from $64 million compared with the third quarter of 2018, primarily due to an increase in various expenses, partially offset by regulatory rate increases. Due to revenue decoupling, BGE's distribution earnings are not affected by actual weather or customer usage patterns.\n\nPHI\n\nPHI’s third quarter of 2019 GAAP Net Income increased to $189 million from $187 million in the third quarter of 2018. PHI’s Adjusted (non-GAAP) Operating Earnings for the third quarter of 2019 increased to $209 million from $195 million in the third quarter of 2018, primarily due to regulatory rate increases (not reflecting the impact of TCJA). Due to revenue decoupling, PHI's distribution earnings related to Pepco Maryland, DPL Maryland and Pepco District of Columbia are not affected by actual weather or customer usage patterns.\n\nGeneration\n\nGeneration's third quarter of 2019 GAAP Net Income increased to $257 million from $234 million in the third quarter of 2018. Generation’s Adjusted (non-GAAP) Operating Earnings for the third quarter of 2019 increased to $352 million from $318 million in the third quarter of 2018, primarily due to increased revenue from ZECs in New York and New Jersey, decreased nuclear outage days, and lower operating and maintenance expense, partially offset by decreased capacity prices and lower realized energy prices.\n\nAs of Sept. 30, 2019, the percentage of expected generation hedged is 96%-99%, 84%-87% and 54%-57% for 2019, 2020 and 2021, respectively.\n\n___________\n\n1Exelon’s five business units include ComEd, which consists of electricity transmission and distribution operations in northern Illinois; PECO, which consists of electricity transmission and distribution operations and retail natural gas distribution operations in southeastern Pennsylvania; BGE, which consists of electricity transmission and distribution operations and retail natural gas distribution operations in central Maryland; PHI, which consists of electricity transmission and distribution operations in the District of Columbia and portions of Maryland, Delaware, and New Jersey and retail natural gas distribution operations in northern Delaware; and Generation, which consists of owned and contracted electric generating facilities and wholesale and retail customer supply of electric and natural gas products and services, including renewable energy products and risk management services.\n\nRecent Developments and Third Quarter Highlights\n\nGAAP/Adjusted (non-GAAP) Operating Earnings Reconciliation\n\nAdjusted (non-GAAP) Operating Earnings for the third quarter of 2019 do not include the following items (after tax) that were included in reported GAAP Net Income:\n\nAdjusted (non-GAAP) Operating Earnings for the third quarter of 2018 do not include the following items (after tax) that were included in reported GAAP Net Income:\n\nNote:\nAmounts may not sum due to rounding.\nUnless otherwise noted, the income tax impact of each reconciling item between GAAP Net Income and Adjusted (non-GAAP) Operating Earnings is based on the marginal statutory federal and state income tax rates for each Registrant, taking into account whether the income or expense item is taxable or deductible, respectively, in whole or in part. For all items except the unrealized gains and losses related to NDT fund investments, the marginal statutory income tax rates for 2019 and 2018 ranged from 26.0% to 29.0%. Under IRS regulations, NDT fund investment returns are taxed at different rates for investments if they are in qualified or non-qualified funds. The effective tax rates for the unrealized gains and losses related to NDT fund investments were 47.1% and 7.7% for the three months ended Sept. 30, 2019 and 2018, respectively.\n\nWebcast Information\n\nExelon will discuss third quarter 2019 earnings in a one-hour conference call scheduled for today at 9 a.m. Central Time (10 a.m. Eastern Time). The webcast and associated materials can be accessed at www.exeloncorp.com/investor-relations.\n\nAbout Exelon\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 31,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Follow Exelon on Twitter @Exelon.\n\nNon-GAAP Financial Measures\n\nIn addition to net income as determined under generally accepted accounting principles in the United States (GAAP), Exelon evaluates its operating performance using the measure of Adjusted (non-GAAP) Operating Earnings because management believes it represents earnings directly related to the ongoing operations of the business. Adjusted (non-GAAP) Operating Earnings exclude certain costs, expenses, gains and losses and other specified items. This measure is intended to enhance an investor’s overall understanding of period over period operating results and provide an indication of Exelon’s baseline operating performance excluding items that are considered by management to be not directly related to the ongoing operations of the business. In addition, this measure is among the primary indicators management uses as a basis for evaluating performance, allocating resources, setting incentive compensation targets and planning and forecasting of future periods. Adjusted (non-GAAP) Operating Earnings is not a presentation defined under GAAP and may not be comparable to other companies’ presentation. The Company has provided the non-GAAP financial measure as supplemental information and in addition to the financial measures that are calculated and presented in accordance with GAAP. Adjusted (non-GAAP) Operating Earnings should not be deemed more useful than, a substitute for, or an alternative to the most comparable GAAP Net Income measures provided in this earnings release and attachments. This press release and earnings release attachments provide reconciliations of Adjusted (non-GAAP) Operating Earnings to the most directly comparable financial measures calculated and presented in accordance with GAAP, are posted on Exelon’s website: www.exeloncorp.com, and have been furnished to the Securities and Exchange Commission on Form 8-K on Oct. 31, 2019.\n\nCautionary Statements Regarding Forward-Looking Information\n\nThis press release contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks and uncertainties. The factors that could cause actual results to differ materially from the forward-looking statements made by the Registrants include those factors discussed herein, as well as the items discussed in (1) the Registrants' 2018 Annual Report on Form 10-K in (a) Part I, ITEM 1A. Risk Factors, (b) Part II, ITEM 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and (c) Part II, ITEM 8. Financial Statements and Supplementary Data: Note 22, Commitments and Contingencies; (2) the Registrants' Third Quarter 2019 Quarterly Report on Form 10-Q (to be filed on Oct. 31, 2019) in (a) Part II, ITEM 1A. Risk Factors; (b) Part I, ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations and (c) Part I, ITEM 1. Financial Statements: Note 16, Commitments and Contingencies; and (3) other factors discussed in filings with the SEC by the Registrants. Readers are cautioned not to place undue reliance on these forward-looking statements, which apply only as of the date of this press release. None of the Registrants undertakes any obligation to publicly release any revision to its forward-looking statements to reflect events or circumstances after the date of this press release.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191031005232/en/\nContact:\nPaul Adams\nCorporate Communications\n202-637-0317\n\n\nEmily Duncan\nInvestor Relations\n312-394-2345\nSource: Exelon Corporation"
    },
    {
        "title": "Exelon Generation and State of Maryland Reach Agreement to Restore and Sustain the Chesapeake Bay",
        "subtitle": "",
        "date": "Oct 29, 2019 11:30AM EDT",
        "content": "\nHistoric agreement on the Conowingo Dam is a win for the environment, the economy, the State of Maryland and the entire Chesapeake Bay region\n    DARLINGTON, Md.--(BUSINESS WIRE)--\nToday, Exelon Generation announced that it has reached an historic settlement agreement with the State of Maryland that will protect the long-term health of the Chesapeake Bay and preserve Maryland’s largest source of renewable energy, the Conowingo Dam. The benefits to Maryland and the Chesapeake Bay are valued at more than $200 million over the anticipated 50-year life of the license, which will be funded from the dam’s earnings over that time period.\n\nThe agreement, which must be approved by the Federal Energy Regulatory Commission, is a critical step for Chesapeake Bay restoration efforts and provides for significant contributions to protect and enhance the health of the bay, including improving water quality, fish and eel passage, marine habitats, and debris removal. The comprehensive agreement will also provide for the continued production of carbon-free energy from the dam, which is vital to support Governor Larry Hogan’s Clean and Renewable Energy Standard of 100 percent clean electricity by 2040, as well as deliver economic, recreational, tourism and community benefits. The agreement resolves all outstanding issues arising from the Maryland Department of the Environment water quality certificate.\n\n“Exelon Generation and the State of Maryland share a commitment to restoring and sustaining the health of the Chesapeake Bay, which has been strengthened by this agreement,” said Chris Crane, president and CEO of Exelon. “This is a victory for clean energy and the long-term preservation of the Chesapeake Bay. The agreement is designed to substantially improve water quality while ensuring Maryland’s largest source of renewable energy continues to deliver environmental and economic benefits for the next generation.”\n\nThe dam powers approximately 165,000 homes in the region. Its operation does not produce any pollution and is a significant contributor to combatting climate change. It also provides tremendous economic benefits to the region, generating $273 million in economic activity and supporting 265 full-time equivalent jobs. The recreational resources associated with the dam receive 365,000 visits per year, contributing to Cecil and Harford Counties’ 2018 tourism tax revenue of $21.7 million.\n\nHighlights of the comprehensive agreement follow.\n\nRestoration and Protection of the Chesapeake Bay \n\nEnhanced Debris Management\n\nEnhanced Habitat and Fish Passage Improvements\n\nAbout Exelon Generation\n\nExelon Generation, a subsidiary of Exelon Corporation (Nasdaq: EXC), is the nation’s largest producer of carbon-free energy, powering more than 20 million homes and businesses through a diverse generation fleet with more than 31,000 megawatts of capacity. Exelon Generation operates the largest U.S. fleet of zero-carbon nuclear plants with more than 18,700 megawatts from 21 reactors at 12 facilities in Illinois, Maryland, New York and Pennsylvania. It also operates a diverse mix of wind, solar, landfill gas, hydroelectric, natural gas and oil facilities in 19 states with more than 12,300 megawatts. Exelon Generation sets the standard for world-class power plant operations that produce clean, safe, reliable electricity, and is an active partner and economic engine in the communities it serves by providing jobs, charitable contributions and tax payments that help towns and regions grow. Follow Exelon Generation on Twitter @ExelonGen, view the Exelon Generation YouTube channel or visit exeloncorp.com. \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005787/en/\nDeena O’Brien\nManager, Exelon Generation Communications\n484-680-2225\ndeena.o'brien@exeloncorp.com\nSource: Exelon Generation"
    },
    {
        "title": "Exelon Appoints Calvin G. Butler Jr. as Interim CEO of Exelon Utilities",
        "subtitle": "",
        "date": "Oct 15, 2019 4:15PM EDT",
        "content": "\nAnne Pramaggiore to Retire \n    CHICAGO--(BUSINESS WIRE)--\nExelon Corporation (Nasdaq: EXC) today announced that it has appointed Calvin G. Butler Jr., CEO of Baltimore Gas and Electric Company (“BGE”), as Interim CEO of Exelon Utilities, effective immediately. This appointment follows the retirement of Anne Pramaggiore, Senior Executive Vice President and CEO of Exelon Utilities, which is also effective immediately. Mr. Butler will continue to serve as CEO of BGE. The CEOs of Exelon’s other utilities – Joseph Dominguez, CEO of ComEd, Michael A. Innocenzo, CEO of PECO, and David M. Velazquez, CEO of Pepco Holdings – will report to Mr. Butler. In addition, Exelon Utility CEO staff heads Val Jensen, Carim Khouzami and Mike Kormos will also report to Mr. Butler moving forward.\n\nMr. Butler is an 11-year veteran of Exelon and has more than 25 years of leadership experience in the utilities industry and in regulatory, legislative and public affairs. As CEO of BGE, he is responsible for implementing the utility’s strategic priorities, including its initiatives related to safety, reliability, customer service, innovation and technology, and diversity and inclusion. Mr. Butler serves on BGE’s Board of Directors and on Exelon’s Executive Committee. In addition, he is Board Chair of the Gridwise Alliance, an advocacy organization promoting modernization and innovation for the nation’s electrical grid, and serves on the Board of Directors for RLI Corp., where he is a member of the Audit and Nominations/Governance Committees. He also previously served on the Board of Directors for the Federal Reserve Bank of Richmond.\n\n“We are pleased Calvin is assuming this role on an interim basis to work closely with our strong utility leadership team,” said Christopher M. Crane, Exelon’s President and Chief Executive Officer. “Calvin has established an excellent track record of successfully executing on BGE’s strategic initiatives, including driving meaningful improvements in customer service, safety and reliability, and delivering solid financial results. Importantly, Exelon benefits from a deep bench of talent and industry expertise. Our leadership team remains well-positioned to continue executing on our strategic priorities, including our customer-first approach, safety, reliability and sustainability initiatives and regulatory strategy.”\n\nMr. Crane concluded, “We thank Anne for her valuable service to Exelon and ComEd and the important contributions she made to enhance our utility operations throughout her tenure. Over the past several years, including under her leadership, Exelon’s utilities have continued to achieve high levels of reliability and record levels of customer satisfaction, while implementing industry-leading strategies for the future of our utility business. We remain steadfast in our commitment to providing our millions of customers with clean, affordable and reliable energy and outstanding service. We are confident this will be a smooth transition for all Exelon stakeholders, including our customers, employees, communities and shareholders.”\n\nAbout Calvin G. Butler Jr. \n\nCalvin G. Butler Jr. is the CEO of BGE, the nation’s first gas utility. He is a member of BGE’s Board of Directors and the Executive Committee of Exelon. Additionally, Mr. Butler is Board Chair of the Gridwise Alliance, an advocacy organization promoting modernization and innovation for the nation’s electrical grid. He serves on the Board of Directors of RLI Corp., where he is a member of the Audit and Nominations/Governance Committees. He is an Independent Trustee of the PNC Funds Board, and previously served on the Board of Directors of the Federal Reserve Bank of Richmond.\n\nPrior to becoming CEO of BGE in March 2014, Mr. Butler served as BGE’s Senior Vice President for Regulatory and External affairs. In addition, he has held various leadership positions at ComEd, including as Senior Vice President of Corporate Affairs and Vice President of Governmental and Legislative Affairs. Before joining Exelon in 2008, he held senior leadership roles in external affairs as well as in manufacturing with the print, digital and supply chain solutions company RR Donnelley. Butler spent his early career with CILCORP (Central Illinois Light Co.), where he worked in government affairs, legal and strategy.\n\nHe has been recognized by several organizations for his leadership and community commitment. In 2017, he was named among Black Enterprise Magazine’s “300 Most Powerful Executives in Corporate America,” and “Industrialist of the Year” by the Baltimore Museum of Industry. The Daily Record named Butler one of Maryland’s “Most Admired CEOs” and one of its top 35 Influential Marylanders, while Baltimore Magazine named him as one of its “Top Ten Baltimoreans.”\n\nMr. Butler also serves on the Boards of several prominent Baltimore-based organizations, including the Baltimore Community Foundation, University of Maryland Medical Center, Greater Baltimore Committee, Cal Ripken, Sr. Foundation, the Center Club, and Caves Valley Golf Club, and on the Board of his alma mater, Bradley University. He earned a bachelor's degree from Bradley University; a Juris Doctor degree from Washington University School of Law; and an honorary doctorate of Humane Letters from Morgan State University.\n\nAbout Exelon\n\nExelon Corporation (Nasdaq: EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 32,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Follow Exelon on Twitter @Exelon.\n\nCautionary Statements Regarding Forward-Looking Information\n\nThis report contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks and uncertainties. The factors that could cause actual results to differ materially from the forward-looking statements made by the Companies include those factors discussed herein, as well as the items discussed in (1) the Companies’ 2018 Annual Report on Form 10-K in (a) ITEM 1A. Risk Factors, (b) ITEM 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and (c) ITEM 8. Financial Statements and Supplementary Data: Note 22, Commitments and Contingencies; (2) the Companies’ Second Quarter 2019 Quarterly Report on Form 10-Q in (a) Part II, Other Information, ITEM 1A. Risk Factors; (b) Part 1, Financial Information, ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations and (c) Part I, Financial Information, ITEM 1. Financial Statements: Note 16, Commitments and Contingencies; and (3) other factors discussed in filings with the SEC by the Companies. Readers are cautioned not to place undue reliance on these forward-looking statements, which apply only as of the date of this report. Neither of the Companies undertakes any obligation to publicly release any revision to its forward-looking statements to reflect events or circumstances after the date of this report.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191015006091/en/\nPaul Adams\nCorporate Communications\n410-470-4167\npaul.adams2@exeloncorp.com\n\nEmily Duncan\nInvestor Relations\n312-394-2345\nEmily.Duncan@exeloncorp.com\nSource: Exelon Corporation"
    },
    {
        "title": "ComEd Diverse Supplier Investment Reaches All-Time High",
        "subtitle": "",
        "date": "Apr 18, 2019 1:34PM EDT",
        "content": "Capital investments empower minority, woman and veteran-owned BusinessesCHICAGO--(BUSINESS WIRE)-- ComEd's 2018 investment of $718 million with diverse suppliers represented 39 percent of its total supply chain spend - an all-time high - as the company continued to modernize the grid and enhance service for more than 4 million customers.A report filed this week with the Illinois Commerce Commission (ICC) shows that since 2011 ComEd has injected almost $14 billion of supply chain spend into the Illinois economy, including $4 billion in Illinois diverse supply chain investments. Major investments have included those authorized by the Energy Infrastructure Modernization Act (EIMA), or smart grid program, which has modernized and improved the performance of the grid serving 4 million customers. Since 2012, overall reliability has improved more than 60 percent and customers have experienced 45 percent fewer outages on average.EIMA also established a broad range of performance metrics for utilities, including increased spending with diverse suppliers by at least 15 percent over 10 years, which ComEd has far exceeded. ComEd's diverse supplier spend in 2018 was four times the amount spent in 2011.\"Creating opportunities for diverse suppliers to grow and excel is one of the most important roles we play as we continue building a supply chain that reflects the communities we serve,\" said Joe Dominguez, CEO, ComEd.Last year, ComEd added 135 companies to its roster of diverse firms and now works with more than 500 Tier I and Tier II diversity-certified suppliers. The 2018 supplier diversity report highlights three companies, including woman- and Hispanic-owned Dynamic Utility Solutions, LLC, which supports ComEd with overhead construction and storm restoration; African-American-owned Milhouse Engineering & Construction, Inc., which plays a key role in the Voltage Optimization (VO) program, a high-tech energy efficiency solution; and woman-owned Resource Innovations, a specialist in energy efficiency, particularly in support of income-eligible customers.ComEd is a unit of Chicago-based Exelon Corporation (NYSE:EXC), a Fortune 100 energy company with approximately 10 million electricity and natural gas customers - the largest number of customers in the U.S. ComEd powers the lives of more than 4 million customers across northern Illinois, or 70 percent of the state's population. For more information visit ComEd.com and connect with the company on Facebook, Twitter and YouTube.View source version on businesswire.com: https://www.businesswire.com/news/home/20190418005652/en/Source: ComEd"
    },
    {
        "title": "ComEd Bronzeville Community Microgrid Demonstrates Ability to Keep Power Flowing in Event of an Emergency",
        "subtitle": "",
        "date": "Apr 17, 2019 11:18AM EDT",
        "content": "CHICAGO--(BUSINESS WIRE)-- ComEd announced today that it successfully conducted a test proving that the Bronzeville Community Microgrid can keep power flowing in the event of an emergency. The \"simulated islanding\" test checked the resiliency of the microgrid by mimicking events that have the potential to affect power delivery, including major weather events or cyber security or acts of terrorism.As the realities of climate change become more apparent, projects like the Bronzeville Community Microgrid support efforts to integrate additional renewable generation, including wind and solar while enhancing resiliency for communities.Essentially a small power grid with defined boundaries, a microgrid can operate in conjunction with the main grid or disconnect from it and operate in island mode when there's an interruption on the main grid. The set of tests ComEd conducted demonstrated the microgrid's ability to provide power in island mode while drawing upon distributed energy resources (DERs), including battery energy storage and solar photovoltaic PV, to serve customers within the microgrid footprint.\"The Bronzeville microgrid not only demonstrated the value it offers the community when the grid is impacted by a disruptive event, but also in supporting integration of renewable energy,\" said Terence R. Donnelly, president, ComEd. \"This test is an important milestone for ComEd and the Bronzeville community, and numerous supporters in government, academia and industry. We're grateful for the support of an exceptional group of partners, including Illinois Tech, University of Denver, Argonne National Laboratory, National Renewable Energy Laboratory, Quanta Technology, SIEMENS, and the U.S. Department of Energy (DOE).\"During the test, a portion of ComEd's electric grid operated from distributed energy resources to demonstrate the capability of the microgrid to serve the customers in its footprint. The residences, businesses and public institutions served by this circuit in Bronzeville received power from a locally sited battery energy storage system, solar energy and mobile generation. Customers experienced no difference in the level of service during the test and were not separated from the system at any time.The microgrid will ultimately connect with an existing microgrid on the campus of Illinois Tech, resulting in one of the most advanced urban microgrid clusters in the nation. Donnelly said, \"The microgrid cluster creates a unique opportunity to study how to maximize the value of the interaction between two microgrids in the ongoing effort to enhance grid resiliency and security.\"ComEd is a unit of Chicago-based Exelon Corporation (NYSE:EXC), a Fortune 100 energy company with approximately 10 million electricity and natural gas customers - the largest number of customers in the U.S. ComEd powers the lives of more than 4 million customers across northern Illinois, or 70 percent of the state's population. For more information visit ComEd.com and connect with the company on Facebook, Twitter and YouTube.View source version on businesswire.com: https://www.businesswire.com/news/home/20190417005598/en/Source: ComEd"
    },
    {
        "title": "Exelon Statement on U.S. Supreme Court Decision Upholding State Programs Designed to Preserve Nuclear Energy",
        "subtitle": "",
        "date": "Apr 15, 2019 2:56PM EDT",
        "content": "CHICAGO--(BUSINESS WIRE)-- Exelon Corporation issued the following statement in response to the U.S. Supreme Court's decision to reject appeals challenging Zero Emissions Credit programs in Illinois and New York:\"Today our nation's highest court let stand two appellate court decisions affirming that states have a right to protect their citizens by favoring clean energy -- including nuclear -- over pollution-emitting energy from coal, oil and natural gas power plants. This decision is a win for consumers, policymakers and regulators in states that choose to support the continued operation of nuclear plants as part of efforts to reduce carbon emissions and address the effects of climate change.\"About Exelon CorporationExelon Corporation (NYSE:EXC) is a Fortune 100 energy company with the largest number of electricity and natural gas customers in the U.S. Exelon does business in 48 states, the District of Columbia and Canada and had 2018 revenue of $36 billion. Exelon serves approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania through its Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO and Pepco subsidiaries. Exelon is one of the largest competitive U.S. power generators, with more than 32,000 megawatts of nuclear, gas, wind, solar and hydroelectric generating capacity comprising one of the nation's cleanest and lowest-cost power generation fleets. The company's Constellation business unit provides energy products and services to approximately 2 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Follow Exelon on Twitter @Exelon.View source version on businesswire.com: https://www.businesswire.com/news/home/20190415005791/en/Source: Exelon Corporation"
    },
    {
        "title": "ComEd® Energy Efficiency Program Recognized by EPA for 10th Consecutive Year",
        "subtitle": "",
        "date": "Apr 9, 2019 10:05AM EDT",
        "content": "Since 2008, program has helped customers save more than $3.7 billion on energy billsCHICAGO--(BUSINESS WIRE)-- In 2018, more than 324,000 ComEd residential and business customers saved approximately $200 million on their electric bills by taking advantage of energy-saving offerings. Today, the U.S. Environmental Protection Agency and U.S. Department of Energy recognized the energy company for those achievements.For the tenth year in a row, ComEd was recognized ComEd with an ENERGY STAR® Award. It is also the seventh straight year ComEd has received the ENERGY STAR Partner of the Year—Sustained Excellence Award, the highest level of recognition.\"We believe everyone has an equal right to safe, reliable and affordable energy, which is why we offer programs to help customers save energy and money,\" said Jane Park, senior vice president of customer operations for ComEd. \"We are honored that the EPA again recognizes our efforts to help customers make smarter energy decision and use energy more wisely.\"The ComEd® Energy Efficiency Program, which is funded in compliance with state law, offers assessments, rebates, discounts and recycling programs to help customers save money and teach them to use energy more wisely. Since 2008, the program has saved customers more than $3.7 billion, which is equal to customers being able to put about $15 toward groceries every week for a year. The program has saved customers more than 33 million megawatt-hours of electricity, which is equivalent to eliminating approximately 42 billion pounds of carbon emissions from the atmosphere, removing more than 4 million cars from the road for a year or planting more than 22 million acres of trees.As a result of the Future Energy Jobs Act, ComEd also provides energy-saving offerings to income-eligible and local governmental customers. In 2018, more than 44,400 income-eligible customers participated in offerings, which included retrofitting more than 1,900 homes and more than 5,100 multi-family tenant units with energy-efficiency products. Governmental customers completed over 870 projects.The EPA presents the Sustained Excellence Award to partners that already received ENERGY STAR Partner of the Year recognition for a minimum of two consecutive years and have gone above and beyond the criteria needed to qualify for recognition.\"I applaud the 2019 ENERGY STAR Award winners,\" said Bill Wehrum, EPA assistant administrator for air and radiation. \"Their innovation and leadership enhance America's economic competitiveness. Reducing costly energy waste improves air quality and public health while protecting the environment.\"For more information on how ComEd helps customers save money and energy, visit ComEd.com/HomeSavings for residential customers and ComEd.com/BizSavings for business customers.About ComEdComEd is a unit of Chicago-based Exelon Corporation (NYSE:EXC), a Fortune 100 energy company with approximately 10 million electricity and natural gas customers - the largest number of customers in the U.S. ComEd powers the lives of more than 4 million customers across northern Illinois, or 70 percent of the state's population. For more information visit ComEd.com and connect with the company on Facebook, Twitter, Instagram and YouTube.About ENERGY STARENERGY STAR® is the government-backed symbol for energy efficiency, providing simple, credible, and unbiased information that consumers and businesses rely on to make well-informed decisions. Thousands of industrial, commercial, utility, state, and local organizations—including more than 40 percent of the Fortune 500®—rely on their partnership with the U.S. Environmental Protection Agency (EPA) to deliver cost-saving energy efficiency solutions. Since 1992, ENERGY STAR and its partners helped save American families and businesses nearly 4 trillion kilowatt-hours of electricity and associated reductions of over 3 billion metric tons of greenhouse gases. In 2017 alone, ENERGY STAR and its partners helped Americans save $30 billion in energy costs. More background information about ENERGY STAR can be found at: energystar.gov/about and energystar.gov/numbers.View source version on businesswire.com: https://www.businesswire.com/news/home/20190409005635/en/Source: ComEd"
    }
]