[
    {
        "title": "How to Save on Spring Break Travel",
        "subtitle": "",
        "date": "Feb 20, 2020 10:07AM EST",
        "content": "SEATTLE, Feb. 20, 2020 /PRNewswire/ -- Nothing puts a spring in our step like a great deal on travel! The Expedia.com® Spring Savings event, running February 24 through March 1, offers sitewide savings on hotels, flights, packages and activities just in time for travelers to book a spring getaway.Spring can be a busy time to travel, especially to the warm-weather and family-friendly destinations popular with the spring break crowd. Luckily, there are still a few ways to ensure your ideal spring break trip meets your ideal budget, and a lot of it comes down to timing.Need a little travel inspiration? According to Expedia flight data, these are a few of the top warm-weather destinations trending for spring 2020:For travelers on a budget, these are among the cheapest places for a spring getaway – with average ticket prices under $350:To find a great deal on your spring getaway, visit http://www.expedia.com/lp/spring-travel-deals beginning 12:01am February 24, 2020 through 11:59pm March 1, 2020.About Expedia.com Expedia.com® is one of the world's largest full-service travel sites, helping millions of travelers per month easily plan and book travel. Expedia.com (https://www.expedia.com/, 1-800-EXPEDIA) aims to provide the latest technology and the widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps.© 2020 Expedia, Inc.  All rights reserved.  Expedia and the Airplane logo are trademarks of Expedia, Inc. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. CST# 2029030-50.Visit our web site https://www.expedia.com/ or use our mobile app to book cheap flights and hotels.Trending and cheapest destinations based on Expedia.com flight demand for travel between March 1 – April 30, 2020, compared to the same timeframe in 2019.  View original content to download multimedia:http://www.prnewswire.com/news-releases/how-to-save-on-spring-break-travel-301008295.htmlSOURCE  Expedia.com"
    },
    {
        "title": "Expedia Group Q4 2019 Earnings Release Available on Company's IR Site",
        "subtitle": "",
        "date": "Feb 13, 2020 4:01PM EST",
        "content": "SEATTLE, Feb. 13, 2020 /PRNewswire/ -- Expedia Group, Inc. (NASDAQ: EXPE) posted its fourth quarter 2019 earnings release in the Investor Relations section of its corporate website at http://ir.expediagroup.com. The earnings release is also available on the Securities and Exchange Commission's website at http://www.sec.gov. As announced previously, the company will host a conference call today to discuss financial results at 1:30 PM Pacific Time / 4:30 PM Eastern Time.  In addition to the earnings release, a live webcast of the conference call will be available to the public at http://ir.expediagroup.com. A replay of the call is expected to be available for at least three months.About Expedia GroupExpedia Group (NASDAQ: EXPE) is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. © 2020 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50  View original content:http://www.prnewswire.com/news-releases/expedia-group-q4-2019-earnings-release-available-on-companys-ir-site-301004731.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Expedia Group to Webcast Fourth Quarter 2019 Results on February 13, 2019",
        "subtitle": "",
        "date": "Jan 21, 2020 4:01PM EST",
        "content": "SEATTLE, Jan. 21, 2020 /PRNewswire/ -- Expedia Group (NASDAQ: EXPE) will report its fourth quarter 2019 results for the period ended December 31, 2019 on Thursday, February 13, 2020 via an earnings release and accompanying webcast. These items will be available in the Investor Relations section of the company's corporate website at http://ir.expediagroup.com. The earnings release will post after market close and the webcast will begin at 1:30 PM Pacific Time / 4:30 PM Eastern Time. A replay of the call is expected to be available for at least three months.About Expedia GroupExpedia Group (NASDAQ: EXPE) is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. © 2020 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50 View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-group-to-webcast-fourth-quarter-2019-results-on-february-13-2019-300990642.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Hotels.com Bakes Up a Carb-Lover's Paradise With the \"Bread & Breakfast\" Suite",
        "subtitle": "Check-ins at Refinery Hotel begin just in time for National Ditch Your Resolution Day",
        "date": "Jan 14, 2020 8:00AM EST",
        "content": " DALLAS, Jan. 14, 2020 /PRNewswire/ -- Have you ever dreamt of having a sleepover inside a bakery, nibbling your way through the fresh baguettes, buttery biscuits and melty cinnamon rolls? Well, pack your elastic stretchy pants, because Hotels.com is breaking its New Year's resolutions and rewarding travelers with the best thing since sliced bread: the Hotels.com®  Bread & Breakfast. Located in New York City's beloved Refinery Hotel, this limited-time hotel room experience will satisfy all your cravings when it opens on Friday, January 17 — which just so happens to be National Ditch Your Resolution Day.Guests who stay at the Bread & Breakfast should come hungry and be prepared to leave their keto commitments at the door!After you've eaten your way through the room, you'll want to kick back and enjoy all the perks that #HotelLife has to offer. Retreat to the bed where you can snuggle among a pile of croissant pillows and rest your head on the toast-shaped headboard (we mean, breadboard). And no need to steal the robe! Each guest is invited to take home the custom \"Carbivore\" embroidered robe and matching baguette slippers. Ready for your next meal? The room service menu has been carefully curated with scrumptious starches you knead to order. With a $100 credit included with your reservation, the pasta-bilities are endless!\"Hotels.com Bread & Breakfast is the latest addition to our list of irreverent, bookable room experiences available exclusively on Hotels.com,\" said Adam Jay, President of the Hotels.com brand. \"There's no better time than 'National Ditch Your Resolution Day' to reward our customers with an overnight stay in a room designed floor to ceiling with carbs!\"Everyone knows vacation calories don't count, so book your stay and dig in! The Hotels.com Bread & Breakfast is $225 per night and available beginning at 9 a.m. ET on Friday, January 17 through Friday, January 31. To reserve your stay exclusively through Hotels.com, visit www.hotels.com/BreadandBreakfast. This unbelievable starch-filled hotel room is just one of the many ways Hotels.com is rewarding customers across the globe with one-of-a-kind accommodations. For more information on the Hotels.com Bread & Breakfast, follow along on social media with Hotels.com Instagram and Twitter as well as Refinery Hotel Instagram and Twitter. For further information, imagery or interview requests, please contact:Merideth Hagerty Phone: 312.995.7414Email: Merideth.Hagerty@icfnext.com The Refinery Hotel is located at 63 W. 38th Street New York, NY 10018About Hotels.com® (or Hotels.com™) Hotels.com is the most rewarding way to book a place to stay. We really love travel and we know you do too. That's why we make it really easy to book with us. With hundreds of thousands of places to stay around the world and 90 local websites in 41 languages, Hotels.com has it all. So, whether you're looking for value in Vegas, treehouses in Thailand or villas with views, it's all just a click away.  And with our \"Reward-winning\" loyalty program you earn free* nights while you sleep…what could be better? Booking just got smarter too. With over 25 million real guest reviews and an app so easy to use that it's been downloaded 70 million times, you can be sure to find the perfect place for you.*Exclusions apply. Reward night worth average price of previous 10. Taxes/fees payable on each Reward Night redeemed. A $5 fee is charged on each Reward Night redeemed, unless redeemed on the app. See T&Cs https://www.hotels.com/customer_care/terms_conditions.html?pos=HCOM_US&locale=en_US © 2020Hotels.com, LP.  All rights reserved.  Hotels.com and the Hotels.com logo are trademarks of Hotels.com, LP.  All other trademarks are property of their respective owners. CST #2083949-50About Refinery Hotel: Refinery Hotel is the leader in the revitalization of New York City's Fashion District, located at its heart at 38th Street between 5th and 6th Avenues. Originally built as a high-end millinery factory and tea salon in 1912, Refinery's design draws on the building's past combining raw elegance in the guestrooms with refined public spaces. The 197-room hotel includes fashion-forward loft-like guestrooms featuring custom furniture, original artwork, industrial-chic design, 12-foot high ceilings, Frette linens, Le Labo bathroom amenities and a 24-hour fitness center. The property also hosts Parker & Quinn, an American bistro, Winnie's Jazz Bar, the prohibition era inspired bar and a stunning 3,500-square-foot indoor/outdoor rooftop lounge with views of the Empire State Building. The hotel has earned rave reviews and is consistently listed on some of the industry's most coveted lists including Travel + Leisure's It List. www.refineryhotelnewyork.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/hotelscom-bakes-up-a-carb-lovers-paradise-with-the-bread--breakfast-suite-300986140.htmlSOURCE  Hotels.com"
    },
    {
        "title": "Hotels.com Bakes Up a Carb-Lover's Paradise With the \"Bread & Breakfast\" Suite",
        "subtitle": "",
        "date": "Jan 14, 2020 8:00AM EST",
        "content": "DALLAS, Jan. 14, 2020 /PRNewswire/ -- Have you ever dreamt of having a sleepover inside a bakery, nibbling your way through the fresh baguettes, buttery biscuits and melty cinnamon rolls? Well, pack your elastic stretchy pants, because Hotels.com is breaking its New Year's resolutions and rewarding travelers with the best thing since sliced bread: the Hotels.com®  Bread & Breakfast. Located in New York City's beloved Refinery Hotel, this limited-time hotel room experience will satisfy all your cravings when it opens on Friday, January 17 — which just so happens to be National Ditch Your Resolution Day.Guests who stay at the Bread & Breakfast should come hungry and be prepared to leave their keto commitments at the door!After you've eaten your way through the room, you'll want to kick back and enjoy all the perks that #HotelLife has to offer. Retreat to the bed where you can snuggle among a pile of croissant pillows and rest your head on the toast-shaped headboard (we mean, breadboard). And no need to steal the robe! Each guest is invited to take home the custom \"Carbivore\" embroidered robe and matching baguette slippers. Ready for your next meal? The room service menu has been carefully curated with scrumptious starches you knead to order. With a $100 credit included with your reservation, the pasta-bilities are endless!\"Hotels.com Bread & Breakfast is the latest addition to our list of irreverent, bookable room experiences available exclusively on Hotels.com,\" said Adam Jay, President of the Hotels.com brand. \"There's no better time than 'National Ditch Your Resolution Day' to reward our customers with an overnight stay in a room designed floor to ceiling with carbs!\"Everyone knows vacation calories don't count, so book your stay and dig in! The Hotels.com Bread & Breakfast is $225 per night and available beginning at 9 a.m. ET on Friday, January 17 through Friday, January 31. To reserve your stay exclusively through Hotels.com, visit www.hotels.com/BreadandBreakfast. This unbelievable starch-filled hotel room is just one of the many ways Hotels.com is rewarding customers across the globe with one-of-a-kind accommodations. For more information on the Hotels.com Bread & Breakfast, follow along on social media with Hotels.com Instagram and Twitter as well as Refinery Hotel Instagram and Twitter. For further information, imagery or interview requests, please contact:Merideth Hagerty Phone: 312.995.7414Email: Merideth.Hagerty@icfnext.com The Refinery Hotel is located at 63 W. 38th Street New York, NY 10018About Hotels.com® (or Hotels.com™) Hotels.com is the most rewarding way to book a place to stay. We really love travel and we know you do too. That's why we make it really easy to book with us. With hundreds of thousands of places to stay around the world and 90 local websites in 41 languages, Hotels.com has it all. So, whether you're looking for value in Vegas, treehouses in Thailand or villas with views, it's all just a click away.  And with our \"Reward-winning\" loyalty program you earn free* nights while you sleep…what could be better? Booking just got smarter too. With over 25 million real guest reviews and an app so easy to use that it's been downloaded 70 million times, you can be sure to find the perfect place for you.*Exclusions apply. Reward night worth average price of previous 10. Taxes/fees payable on each Reward Night redeemed. A $5 fee is charged on each Reward Night redeemed, unless redeemed on the app. See T&Cs https://www.hotels.com/customer_care/terms_conditions.html?pos=HCOM_US&locale=en_US © 2020Hotels.com, LP.  All rights reserved.  Hotels.com and the Hotels.com logo are trademarks of Hotels.com, LP.  All other trademarks are property of their respective owners. CST #2083949-50About Refinery Hotel: Refinery Hotel is the leader in the revitalization of New York City's Fashion District, located at its heart at 38th Street between 5th and 6th Avenues. Originally built as a high-end millinery factory and tea salon in 1912, Refinery's design draws on the building's past combining raw elegance in the guestrooms with refined public spaces. The 197-room hotel includes fashion-forward loft-like guestrooms featuring custom furniture, original artwork, industrial-chic design, 12-foot high ceilings, Frette linens, Le Labo bathroom amenities and a 24-hour fitness center. The property also hosts Parker & Quinn, an American bistro, Winnie's Jazz Bar, the prohibition era inspired bar and a stunning 3,500-square-foot indoor/outdoor rooftop lounge with views of the Empire State Building. The hotel has earned rave reviews and is consistently listed on some of the industry's most coveted lists including Travel + Leisure's It List. www.refineryhotelnewyork.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/hotelscom-bakes-up-a-carb-lovers-paradise-with-the-bread--breakfast-suite-300986140.htmlSOURCE  Hotels.com"
    },
    {
        "title": "Expedia presents: Top-rated Cozy Accommodations for New Year's Eve",
        "subtitle": "New Year's Eve, but make it cozy",
        "date": "Dec 23, 2019 10:33AM EST",
        "content": " SEATTLE, Dec. 23, 2019 /PRNewswire/ -- Another year is coming to a close, and while some might be counting down to a New Year's Eve celebration befitting of ushering in a new decade, others might just be feeling worn out. For those looking for a bit of R&R this year-end, Expedia® found the best inns and hotels rated by guests for their \"coziness\" factor. \"Most people want to do something to commemorate New Year's Eve but might not be in the mood for fireworks and crowds,\" says Aaron Price, senior vice president of marketing for Brand Expedia. \"Here at Expedia we think you can have the best of both worlds. At these top-rated hotels you won't feel like you're missing out just because you're staying in. And of course, if you're looking for something livelier, our Last-Minute Deals have you covered.\" Read on for Expedia's list of stays inspired by creatures of comfort everywhere:1.  An Art Deco Oasis in North HollywoodThe Garland Hotel is at the top of our list, with the highest volume of reviews mentioning the word \"cozy.\" It's also iconic and sprawling and the perfect New Year's Eve hideaway for any indecisive traveler. Option 1: Stay secluded within the seven-acre property for the evening and snag a fireside table on the patio. Option 2: Make a last-minute decision to catch the fireworks at Universal Studios, just a 5-minute cab ride away. This property also has perks for traveling tribes – its Family Suites feature a separate nook with bunk beds so everyone can remain cozy, not cramped.2.  Greenwhich Village ComfortHotel guests and locals alike would attest The Marlton Hotel's lobby is one of the coziest places in the city to meet a friend for tea, enjoy breakfast, read or work. On a cold NYC day, the dark wood, gold-hued lighting and roaring fireplace welcomes visitors like a warm hug. Guests also love the plush bedding and bath robes in every room, making The Marlton the perfect cozy NYE retreat.3.  NYE Northern LightsAchieving coziness while on a glacier is a special feat, so Fosshotel Glacier Lagoon in Iceland definitely deserves a place of honor on our list. We admit it might seem counterintuitive to head to a northern island with mere hours of sunlight in search of the warm fuzzies, but when you're out enjoying things like dog sledding and crampon hiking by day, your home base will feel even cozier. This hotel located in Southern Iceland offers up otherworldly views and serves as a toasty respite when the day's work is done. Plus, a chance of glimpsing the Northern Lights – best during the winter months – beats a NYE fireworks show any day. 4.  Roaring Fireplaces in SeattleCut through the fog of the Pacific Northwest to score a room at The Edgewater Hotel. Rated highly by Expedia guests for overall quality and coziness, The Edgewater Hotel boasts views of snow-kissed Olympic Mountain peaks, shimmering waters of Elliott Bay and homey fireplaces in every room. You'll be in the heart of Seattle -- close enough to hop aboard the Argosy Cruises Christmas Ship, watch the Space Needle erupt in fireworks on NYE, and treat yourself to the local food and drink scene, before returning to your room. Remember, if it was good enough for the Beatles' shenanigans, it's good enough for you!5.  Sight Seeing in NYCGuest reviews named two Manhattan hotels \"most cozy,\" and in this instance they might be referring to square-footage versus superfluous warm and fuzzy amenities. But even so, The Arthouse and Roosevelt Hotels are perfect options for a NYE getaway, done your way. Located in Midtown, The Roosevelt will give visitors easy access to shopping, shows and attractions like the Empire State Building, while the Upper West Side's Arthouse is a 7-minute walk to Central Park. The options are endless, whether a big night out is on the agenda, or simply a matinee and room service in bed.6.  A World Away in Sonoma ValleyGaige House + Ryokan is a tranquil, boutique retreat that has its guests feeling zen in no time. Tucked away in the midst of natural beauty alongside Calabazas Creek, this inn boasts \"traditional Japanese hospitality,\" meditation areas, calming fountains, a yoga enclave, private zen gardens, a spa and more. This calming, head-clearing environment seems like the perfect alternative to a wild New Year's Eve, and the perfect way to kick off a new decade!7.  Modern Midwestern HospitalityExposed timber, brick and other elements original to the historic building make Hewing Hotel an authentic and inviting home base for any visitor to the North Loop neighborhood of Minneapolis. Billed as \"your local living room,\" guests will enjoy homey touches including high-end woolen throws, down duvets and even amenities for your pet. Unwind in the sauna or spa pool, and then enjoy watching the new year roll in from the rooftop lounge. 8.  Boutique Digs in Old MontrealWith just 10 well-appointed rooms, Hotel Epik Montreal is perfect for anyone looking for a quiet, intimate setting to ring in the new year. Located in Old Montreal, guests can bundle up and walk the charming cobblestone streets to the theater, museum or myriad shops and cafes. There's plenty to do in Montreal on NYE, including fireworks at the Old Port, trying your luck at a casino, or even a guided snowshoe trek through Mount Royal Park. Bonne année!For more information, please reach out to press@expedia.com. NOTE TO EDITORS*Top 8 list compiled from measuring sentiment and volume of reviews from travelers on Expedia.com that mention 'cozy' or 'coziness'About Expedia.com Expedia.com® is one of the world's largest full-service travel sites, helping millions of travelers per month easily plan and book travel. Expedia.com (https://www.expedia.com/, 1-800-EXPEDIA) aims to provide the latest technology and the widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. © 2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either registered trademarks or trademarks of Expedia, Inc. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. CST# 2029030-50. Visit our web site https://www.expedia.com/ or use our mobile app to book cheap flights and hotels.  View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-presents-top-rated-cozy-accommodations-for-new-years-eve-300978536.htmlSOURCE  Expedia.com"
    },
    {
        "title": "Expedia Group Announces Executive Leadership Changes",
        "subtitle": "CEO Mark Okerstrom and CFO Alan Pickerill to Resign",
        "date": "Dec 4, 2019 8:59AM EST",
        "content": "SEATTLE, Dec. 4, 2019 /PRNewswire/ -- Expedia Group, Inc. (NASDAQ: EXPE) today announced the resignation of Mark Okerstrom as CEO and a member of the Board of Directors and CFO Alan Pickerill, effective immediately.Barry Diller, Chairman of the Board, and Vice Chairman Peter Kern, Director of Expedia, will oversee the company's executive leadership team, managing day-to-day operations, while the Board determines the long-term leadership of the Company.Eric Hart, the Company's Chief Strategy Officer, will serve as acting CFO. Ariane Gorin, who most recently served as President of Expedia Partner Solutions, is being promoted and will have an expanded role as President, Expedia Business Services.The Company also announced today a new share repurchase authorization for up to an additional 20 million shares of the Company's common stock, which is in addition to the 9 million shares available under the Company's existing authorization. Accordingly, the Company now has approximately 29 million shares available under its repurchase program.Chairman Barry Diller said \"Ultimately, senior management and the Board disagreed on strategy. Earlier this year, Expedia embarked on an ambitious reorganization plan with the goal of bringing our brands and technology together in a more efficient way. This reorganization, while sound in concept, resulted in a material loss of focus on our current operations, leading to disappointing third quarter results and a lackluster near-term outlook. The Board disagreed with that outlook, as well as the departing leadership's vision for growth, strongly believing the Company can accelerate growth in 2020. That divergence necessitated a change in management. Mark Okerstrom is a talented executive and his 13 years of service to Expedia has greatly benefited the enterprise. The Board and I wish him the best for the future, as we do for Alan Pickerill.\" \"I will be purchasing additional shares in the Company as a tangible sign of my faith in and commitment to Expedia's long-term future,\" added Diller. Vice Chairman Peter Kern said, \"While we share and understand the investment community's unhappiness with our third quarter results and how 2019 has shaped up overall, we are keenly focused on the future and all of the opportunities ahead of us. We believe there is significant opportunity for Expedia to grow revenue and margins in what is a still a very dynamic online travel industry. The Company has an exceptionally strong and deep executive leadership team in place. Barry and I, as well as the entire Board, look forward to working closely with them in the period ahead, as well as over the long-term. Additionally, we intend to use our strong balance sheet to continue and amplify our stock repurchase program, given our belief that the market currently undervalues our company.\"Mr. Diller has been Chairman of the Board of Expedia Group since February 4, 2002 when IAC/InterActiveCorp (\"IAC\") acquired a controlling interest in Expedia and has been Senior Executive of Expedia since the completion of the Company's spin-off from IAC on August 9, 2005.Mr. Kern has been a director of Expedia Group since 2005 and has served as Vice Chairman of Expedia Group since June 2018. Mr. Kern was most recently CEO and board member of Tribune Media Company and is Managing Partner of InterMedia Partners VII, LP, a private equity firm. Mr. Kern also serves as Chairman of Hemisphere Media Group, Inc., and is on the board of Trivago N.V.About Expedia GroupExpedia Group (NASDAQ: EXPE) is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™.© 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50  View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-group-announces-executive-leadership-changes-300969138.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Expedia kicks off Black Friday sale early this year: Deals include 60% off select hotels and up to 75% off in-app coupons",
        "subtitle": "",
        "date": "Nov 22, 2019 10:36AM EST",
        "content": "Sale starts November 25th and runs through Cyber MondayTORONTO, Nov. 22, 2019 /PRNewswire/ -- Black Friday and Cyber Monday are right around the corner, and this year the epic travel deals on Expedia.ca® are starting even earlier. Beginning Monday, November 25, travellers can find select hotels up to 60 percent off, plus special discounts on flights, packages, activities and cruises. Then, the savings continue Black Friday and Cyber Monday with coupons that can be used to score even deeper discounts on the mobile app.Holiday travel on the cheapHoliday travel can be expensive, which explains why the most popular departure dates booked during Expedia's sale last year fell between December 21-23, just a few days before Christmas. Travellers looking to spend the holidays elsewhere were able to make the dream a reality and save a bit on their trips.\"Looking at the booking behaviours of travellers shopping during our sale allows us to source the right deals and cater to what people want,\" says Gourav Pani, Vice President of Customer Marketing. \"Our data tells us that people are leveraging the sale to book near-term travel, so this year we're starting the sale even earlier to allow people more time to get those December and early January trips on the books. And while we'll have incredible deals available for everyone, our best offerings are reserved just for Expedia.ca members – so be sure to sign up for free in advance and get the most out of the sale.\"Early bird (November 25 – 28) deals include: Black Friday deals include:Cyber Monday deals include:Coupons go live at 9am ET on Black Friday, and two times on Cyber Monday (9am ET and 12pm ET). The App-exclusive coupons are very limited, and all coupons are only available while supplies last. But the good news is even without a coupon, travellers can find thousands of deeply discounted travel deals all weekend long. Visit https://www.expedia.ca/blackfriday or visit our blog here to learn more.Get prepared to save:There are a few things you can do while you wait for the year's biggest shopping weekend to arrive. After all, vacations take some planning! Need some travel inspiration? These were the most popular destinations1 booked on Expedia.ca during Black Friday weekend last year: Orlando, Las Vegas, Los Angeles, Toronto, Tokyo, Fort Lauderdale, Phoenix, London, and Cancun. More information: visit https://www.expedia.ca/blackfriday or contact Mary Zajac at mzajac@expedia.com.About Expedia Expedia is one of the world's largest full-service travel sites, helping millions of travellers per month easily plan and book travel. Expedia aims to provide the latest technology and widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. ©2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either trademarks or registered trademarks of Expedia, Inc. in the U.S. and other countries. Other product and company names mentioned herein may be the property of their respective owners. Visit our web site https://www.expedia.ca or use our mobile app to book cheap flights, hotels, and packages.  Source: Brand Expedia. 1Data based on traveller flight data with a November 23-26, 2018 booking window and November 23, 2018-October 31, 2019 travel period.  SOURCE  Brand Expedia"
    },
    {
        "title": "Expedia 2020 Trends in Travel Report: Where Canadian travellers should go in the new year",
        "subtitle": "",
        "date": "Nov 21, 2019 12:58PM EST",
        "content": "New report shares growing trends with destinations across Europe, Canada, and the CaribbeanTORONTO, Nov. 21, 2019 /PRNewswire/ -- When it comes to analyzing travel trends, Expedia has a leg up. Being one of the world's largest online travel brands means being able to uncover themes across air travel, hotel stays, searches and bookings, even experiences – all in the pursuit of arming Canadian travellers with everything they need to travel smarter in 2020. And today the results are in – from European cities dominating the new destinations to watch, to inspiration on where to explore at home, as well as options for relocating to a beach this winter, the full 2020 Trends in Travel Report unpacks the fastest-growing destinations around the world, all based on real traveller data. European cities dominate the new top ten It's time to start planning and updating bucket lists. The below countries each had three or more cities that appeared on the list of fastest-growing destinations, based on flight demand for Canadian travellers. Data shows Canadians are racking up the international miles to Europe, with 6 out of the 10 countries on the list located in that part of the world: The prairies, west and north are trending across Canada  Canadian cities in the prairies, western provinces and the northern territories are all trending, so expect to see more of them in the new year. Interestingly, all of the top ten destinations listed have close proximity to the outdoors, making them great jumping off points for those looking for an adventure focused trip. Beach escapes to soak in that vitamin D The 2020 Trends in Travel report proves the Caribbean and Mexico remain as go-to destinations for Canadians in search of a warm beach vacation closer to home. Often the hardest part about planning a beach escape is narrowing down where to go. Whether it's authentic island culture or quiet uncrowded beaches, the below ten spots are up-and-coming destinations, based on hotel demand.  Things to do: Theme Parks, Shows and High-Up Views Activities and attractions are more than just an add-on to a trip. Often, they're one of the top considerations when travellers are choosing their destination and accommodations, and purchasing the tickets ahead of time makes trip planning easier. So, plan those experiences in 2020 and try something different. For some inspiration, here are some of the top activities for Canadians booked on Expedia: About Expedia Expedia is one of the world's largest full-service travel sites, helping millions of travellers per month easily plan and book travel. Expedia aims to provide the latest technology and widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. ©2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either trademarks or registered trademarks of Expedia, Inc. in the U.S. and other countries. Other product and company names mentioned herein may be the property of their respective owners. Visit our web site https://www.expedia.ca or use our mobile app to book cheap flights, hotels, and packages. All trends based on Expedia.ca hotel or flight demand from Canada between January 1, 2019 – September 15, 2019, compared to the same time frame in 2018.  SOURCE  Brand Expedia"
    },
    {
        "title": "Expedia Group to Participate in the 2019 Phocuswright Conference",
        "subtitle": "",
        "date": "Nov 20, 2019 7:00PM EST",
        "content": "SEATTLE, Nov. 20, 2019 /PRNewswire/ -- Expedia Group (NASDAQ: EXPE) will participate in the Phocuswright Conference in Fort Lauderdale, FL on Thursday, November 21st, 2019. Mark Okerstrom, President and Chief Executive Officer, will participate in a Center Stage Executive Interview beginning at 6:30am PT / 9:30am ET. To access the presentations, register for a complimentary online conference ticket by visiting https://www.phocuswrightconference.com/Live-Stream. Presentations can be viewed real-time or accessed on-demand through March 31, 2020. About Expedia GroupExpedia Group (NASDAQ: EXPE) is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. © 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50 View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-group-to-participate-in-the-2019-phocuswright-conference-300962585.htmlSOURCE  Expedia Group"
    },
    {
        "title": "2020 Travel Trends: Expedia.com Predicts Top Destinations and Experiences for the New Year",
        "subtitle": "",
        "date": "Nov 20, 2019 11:50AM EST",
        "content": "SEATTLE, Nov. 20, 2019 /PRNewswire/ -- When it comes to analyzing travel trends, Expedia® has a leg up. Being one of the world's largest online travel brands means being able to uncover themes across flights, hotel stays, searches and bookings, and even experiences – all in the pursuit of arming explorers with everything they need to know to navigate the year ahead. Based on a robust analyses of US traveler data, Expedia's 2020 Trends in Travel highlights: Read on for a selection of predictions and trends below and view the full 2020 Trends in Travel report here. The New Top 10 Expedia's analysts scoured the list of fastest-growing destinations to identify the countries that had the most cities trending based on flight demand. The result: A brand-new bucket list worthy of a new decade.  \"When we looked at where travelers went in 2019, we saw that the biggest growth in demand was happening for destinations that aren't the usual tourist hotspots,\" said Christie Hudson, Head of PR for Brand Expedia North America. \"For example, instead of Venice or Rome, the top trending Italian destinations were in Sardinia and the Italian Riviera. We hope this report shines a light on new places to explore and inspires people to start planning their travel for 2020.\"  Popular Experiences: Robots, Ruins and Rollercoasters  Activities and attractions are more than just an add-on to a trip. Often, they're one of the top considerations when travelers are choosing where to go and where to stay. Not to mention purchasing the tickets ahead of time makes the trip planning easier. So, don't just go somewhere in 2020 – have an experience. Here are some of the top-selling activities on Expedia for inspiration: Chasing Waterfalls  Take a cue from Americans who strayed from the rivers and lakes they were used to this year: Expedia data reveals many travelers were literally chasing waterfalls in 2019.  Curious about hidden gem beach destinations and which U.S. college towns are trending? Check out the full 2020 Trends Report here and start planning your next vacation. About Expedia.com Expedia.com® is one of the world's largest full-service travel sites, helping millions of travelers per month easily plan and book travel. Expedia.com (https://www.expedia.com/, 1-800-EXPEDIA) aims to provide the latest technology and the widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. © 2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either registered trademarks or trademarks of Expedia, Inc. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. CST# 2029030-50. Visit our web site https://www.expedia.com/ or use our mobile app to book cheap flights and hotels. Source: Brand Expedia.  All trends based on Expedia.com hotel or flight demand from the U.S. between January 1, 2019 and September 15, 2019, compared to the same time frame in 2018.   View original content to download multimedia:http://www.prnewswire.com/news-releases/2020-travel-trends-expediacom-predicts-top-destinations-and-experiences-for-the-new-year-300962248.htmlSOURCE  Expedia.com"
    },
    {
        "title": "Expedia kicks off Black Friday sale early this year: Deals include 60% off select hotels and up to 95% off in-app coupons",
        "subtitle": "Sale starts November 25th and runs through Cyber Monday",
        "date": "Nov 15, 2019 9:52AM EST",
        "content": " SEATTLE, Nov. 15, 2019 /PRNewswire/ -- Black Friday and Cyber Monday are right around the corner, and this year the epic travel deals on Expedia.com® are starting even earlier. Beginning Monday, November 25, travelers can find select hotels up to 60 percent off, plus special discounts on flights, packages, activities and cruises. Then, the savings continue Black Friday and Cyber Monday with coupons that can be used to score even deeper discounts on the mobile app.Holiday travel on the cheapHoliday travel can be expensive, which explains why the most popular departure dates booked during Expedia's sale last year fell between December 21-23, just a few days before Christmas. Travelers looking to spend the holidays elsewhere were able to make the dream a reality and save a bit on their trips.\"Looking at the booking behaviors of travelers shopping during our sale allows us to source the right deals and cater to what people want,\" says Gourav Pani, Vice President of Customer Marketing. \"Our data tells us that people are leveraging the sale to book near-term travel, so this year we're starting the sale even earlier to allow people more time to get those December and early January trips on the books. And while we'll have incredible deals available for everyone, our best offerings are reserved just for Expedia.com members – so be sure to sign up for free in advance and get the most out of the sale.\"Early bird (November 25 – 28) deals include: Black Friday deals include:Cyber Monday deals include:Coupons go live at 9am PT on Black Friday, and two times on Cyber Monday (9am PT and 12pm PT). The App-exclusive coupons are very limited, and all coupons are only available while supplies last. But the good news is even without a coupon, travelers can find thousands of deeply discounted travel deals all weekend long. Visit https://www.expedia.com/blackfriday to learn more.Get prepared to save:There are a few things you can do while you wait for the year's biggest shopping weekend to arrive. After all, vacations take some planning! Need some travel inspiration? These were the most popular destinations1 booked on Expedia.com during Black Friday weekend last year: Orlando, New York, Las Vegas, Los Angeles, Denver, Miami, Phoenix, Chicago, Fort Lauderdale, and Atlanta.More information: visit https://www.expedia.com/blackfriday or contact Christie Hudson at press@expedia.comAbout Expedia.com Expedia.com® is one of the world's largest full-service travel sites, helping millions of travelers per month easily plan and book travel. Expedia.com (https://www.expedia.com/, 1-800-EXPEDIA) aims to provide the latest technology and the widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps.© 2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either registered trademarks or trademarks of Expedia, Inc. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. CST# 2029030-50. Visit our web site https://www.expedia.com/ or use our mobile app to book cheap flights and hotels.1 Data based on traveler data with a November 23-26, 2018 booking window and November 23, 2018-October 31, 2019 travel period.  View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-kicks-off-black-friday-sale-early-this-year-deals-include-60-off-select-hotels-and-up-to-95-off-in-app-coupons-300959190.htmlSOURCE  Expedia.com"
    },
    {
        "title": "Research Shows Reducing Friction Matters; Expedia Group Prioritizes for Travelers and Partners",
        "subtitle": "Expedia Group on a quest to provide stress-free, frictionless travel powered by AI and ML",
        "date": "Nov 13, 2019 11:00AM EST",
        "content": "LAS VEGAS, Nov. 13, 2019 /PRNewswire/ -- Technology can improve travel experiences by reducing pain points and stressors along the journey. Today, Expedia Group and business strategy Firm Magid released the Online Travel Friction Index1, finding travelers want suppliers to offer a seamless travel experience, and to quickly and effectively handle any challenge during their travels. The research is aligned with Expedia Group's priority focus to unleash the power of its platform to build out traveler and partner solutions that can help knock down the barriers to travel, making it easier, more enjoyable, more attainable, more accessible and in doing so, ultimately bring the world within reach for billions of people around the globe. What is a Frictionless Travel Experience?Removing travel friction requires a deep understanding of customer pain points. Expedia Group's Innovation Lab tests new products continuously, leveraging advanced technologies including artificial intelligence and machine learning, eye tracking and face reader technology to understand travelers' focus on a web page and the emotions they experience while booking travel. These tests recently uncovered the attributes travelers value the most that provide an easy-to-use, or frictionless online booking experience. Friction reduction occurs through the creation of extensive end-to-end user experience research, highly efficient coordinated processes, iterative product development, and obsession with customer and partner centricity.The Online Travel Friction Index research identified key factors that reduce traveler friction through a 'friction reduction index;' a weighted average numerical score rating over 15 experience attributes that nearly 850 online travel users, ages 18-55, used to rate their experiences related to research, shopping and booking of travel products on various travel websites. Results from this research identified the top five most impactful friction reduction attributes as: Expedia Group brands consistently ranked higher in all five areas than other OTAs or branded chain sites that were included in the research. Expedia Group is also rated at least as well as, if not significantly higher, than hotel direct booking sites on every attribute in the 'friction reduction' index. Expedia Group's two-sided platform approach meets customer demands while simultaneously building innovative technology solutions, and infrastructure for its partners. These tools include examples such as white label packages that offer hotel partners better website monetization by integrating air and car bookings into their branded sites. In 2018, Expedia Group spent more than $1.6 billion in technology, with a focus on making its platform seamless for both partners and travelers. Expedia Group's massive efforts and investment in research and development over this decade have resulted in significant benefits for both travelers and partners, including reduction in distribution costs. \"Expedia Group is focused on connecting the world, by enabling discovery, search and booking of flights, hotels, transportation and activities - in a low stress, low friction manner,\" said Cyril Ranque, Group President of the Travel Partners Group, Expedia Group. \"Our technology-first platform is dedicated to providing a one-stop, easy and convenient experience for travelers to discover and book their trip with all the information they need to make the best and most informed selection. While we are obsessed with customer centricity, it also means a laser focus on partner success including helping our partners maximize productivity, visibility, conversion, revenue, and delivering to them the tools and experiences that they want and need.\" Removing Partner FrictionToday, Expedia Group's partners' and suppliers' expectations on speed of service, and efficiency of processes are higher than ever before. Expedia Group's platform solves partner pain points through different tools, such as the new Partner Central Chatbot, powered by the next generation of the company's AI Lab's Centralized Conversational Artificial Intelligence Platform (CCAIP) architecture. This chatbot is a virtual assistant experience providing contextual help and support to partners. Personalized opportunities for partners generated by a new recommendation engine driven by dozens of Machine Learning algorithms intertwined together. This central intelligence computes, organizes, and passes revenue opportunities to partners, constantly evaluating the state of each partner to identify potential actions they can take and the return reward in doing so. Currently, this engine is generating 2.5 million recommendations and will continue to evolve to be more precise. Removing Traveler FrictionThis week, Brand Expedia announced the launch of a trip assistance function on the app, that will alert the hotel a traveler will be checking in, if the traveler is experiencing a flight delay of 8+ hours, regardless of where the flight was booked. Brand Expedia is also piloting a shuttle tracking technology program built by Track My Shuttle into the Expedia App, allowing hotel guests to see exactly where to find shuttle pickup for their hotel, and follow along with a live route map. Egencia, Expedia Group's corporate travel brand is creating a frictionless booking experience for business travelers by tapping into powerful algorithms and applied machine learning. The business travel management company recently launched Smart Mix, a feature that intelligently analyzes data and complex scenarios, factoring in the personal preferences of each traveler and their company's travel policy to deliver smarter search results out of hundreds of hotel and flight options. This week, Egencia announced the number of flights selected in the top ten North American search results improved by 13 percent, since Smart Mix for air was launched this summer. Smart Mix for hotel has helped Egencia customers save hundreds of thousands of dollars by optimizing search and sort results, estimating that customers could save over a million dollars by mid 2020 through the service. The conversations platform is a perfect example of how Expedia Group is removing friction for both travelers and partners. One feature of the platform is the virtual agent (bot) which seamlessly offers self-service experiences, all dynamically supported and altered by artificial intelligence/machine learning through a configuration console, resulting in reduced effort and quicker process for making changes to bookings or completing queries. It is currently being used by Expedia Group agents and partner agents, reducing their cognitive load, delivering operational efficiencies and improving satisfaction. The overall travel experience is elevated.About Expedia GroupExpedia Group is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. For more information, visit www.expediagroup.com.© 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-501 Expedia Group and Magid established an online study of 847 travelers between the ages of 18-55 from the United States and United Kingdom. Respondents must have booked at least one hotel stay using any OTA (online travel agency) within the past year. An index ranging from 100 (most friction) to 1000 (least friction) was created from a comprehensive list of weighted attributes using a Partial Least Squares regression model.  View original content to download multimedia:http://www.prnewswire.com/news-releases/research-shows-reducing-friction-matters-expedia-group-prioritizes-for-travelers-and-partners-300957356.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Expedia Group Q3 2019 Earnings Release Available on Company's IR Site",
        "subtitle": "",
        "date": "Nov 6, 2019 4:01PM EST",
        "content": "BELLEVUE, Wash., Nov. 6, 2019 /PRNewswire/ -- Expedia Group, Inc. (NASDAQ: EXPE) posted its third quarter 2019 earnings release in the Investor Relations section of its corporate website at http://ir.expediagroup.com. The earnings release is also available on the Securities and Exchange Commission's website at http://www.sec.gov. As announced previously, the company will host a conference call today to discuss financial results at 1:30 PM Pacific Time / 4:30 PM Eastern Time.  In addition to the earnings release, a live webcast of the conference call will be available to the public at http://ir.expediagroup.com. A replay of the call is expected to be available for at least three months.About Expedia GroupExpedia Group (NASDAQ: EXPE) is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. © 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50 View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-group-q3-2019-earnings-release-available-on-companys-ir-site-300953179.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Expedia Group to Webcast Third Quarter 2019 Results on November 6, 2019",
        "subtitle": "",
        "date": "Oct 15, 2019 4:01PM EDT",
        "content": "BELLEVUE, Wash., Oct. 15, 2019 /PRNewswire/ -- Expedia Group (NASDAQ: EXPE) will report its third quarter 2019 results for the period ended September 30, 2019 on Wednesday, November 6, 2019 via an earnings release and accompanying webcast. These items will be available in the Investor Relations section of the company's corporate website at http://ir.expediagroup.com. The earnings release will post after market close and the webcast will begin at 1:30 PM Pacific Time / 4:30 PM Eastern Time. A replay of the call is expected to be available for at least three months.About Expedia GroupExpedia Group (NASDAQ: EXPE) is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. © 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50 View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-group-to-webcast-third-quarter-2019-results-on-november-6-2019-300939057.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Ever wanted to skip winter entirely? Expedia and VISIT FLORIDA team up to give away a 3-month escape to Florida",
        "subtitle": "",
        "date": "Oct 15, 2019 10:17AM EDT",
        "content": "SEATTLE, Oct. 15, 2019 /PRNewswire/ -- If you've ever dreamt about escaping the winter chill and immersing yourself in warmer climates, you're not alone. In many parts of the U.S. the winter months can be long, frigid or downright dreary, especially after the holiday cheer has worn off. That's why Expedia.com® and VISIT FLORIDA are teaming up to offer one lucky winner and a guest the chance to skip winter altogether and escape to sunny Florida, with the Skip Winter Sweepstakes.No need to settle for a quick trip to the beach this winter. The grand prize winner and guest will spend up to 12 weeks lounging at a vacation rental in a sunny Florida destination, with access to a rental car and $1,000 towards a brand-new warm-weather wardrobe. \"Florida is and has always been the go-to destination for a winter escape,\" said Dana Young, CEO VISIT FLORIDA. \"We're excited to collaborate with Expedia to share Florida's abundance of sunshine with this very lucky winner and all our visitors this winter season.\" \"We see travelers flocking to Florida year-round, but its beaches and perfect temperatures become especially enticing when the weather turns cold everywhere else in the country,\" added Jennifer Andre, senior director Expedia Media Solutions. \"We're thrilled to collaborate with VISIT FLORIDA to give away an amazing vacation that will allow the winner to get truly immersed in everything Florida has to offer.\"Skip Winter, Escape to Florida.No need to tough it out or dread the chilly commutes. Here's what you could win:Head to https://www.skipwinter.expedia.com/ between October 15, 2019 – November 15, 2019 and enter to win. View contest terms and conditions here. About Expedia.com Expedia.com® is one of the world's largest full-service travel sites, helping millions of travelers per month easily plan and book travel. Expedia.com (https://www.expedia.com/, 1-800-EXPEDIA) aims to provide the latest technology and the widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. © 2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either registered trademarks or trademarks of Expedia, Inc. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. CST# 2029030-50. Visit our web site https://www.expedia.com/ or use our mobile app to book cheap flights and hotels. View original content to download multimedia:http://www.prnewswire.com/news-releases/ever-wanted-to-skip-winter-entirely-expedia-and-visit-florida-team-up-to-give-away-a-3-month-escape-to-florida-300938598.htmlSOURCE  Expedia.com"
    },
    {
        "title": "New Study Reveals Technology Investment Priorities for Hotels",
        "subtitle": "Chain hotels 77% more likely to increase technology investments, while independent counterparts prioritize room renovation",
        "date": "Oct 1, 2019 9:00AM EDT",
        "content": "BELLEVUE, Wash., Oct. 1, 2019 /PRNewswire/ -- According to a new survey of more than 1,200 hoteliers by Expedia Group, the world's travel platform, chain hotels1 are nearly twice as likely as small independent properties2 to prioritize technology investment. Alternatively, small independent properties are 1.5 times as likely as chain hotels to prioritize room renovations – indicating a gap in technology investment strategies among different hotelier segments. Reliance on technology is becoming increasingly important in the lodging industry as hotels begin to recognize how they can gain key competitive advantage with strategic technology investments. According to the latest report by Hospitality Technology3, 54% of hotels plan to increase their technology budgets for 2019, while only 8% plan to decrease. However, cost continues to be the key barrier with technology adoption for many hoteliers, with nearly half of the small independent hotels surveyed indicating that technology investment decisions are based on affordability and value. In contrast, more than half of the chain hotels prioritize technology that seamlessly integrates with their existing systems. \"We're witnessing chain hotels place significant investments in technology, which opens the potential for a greater divide between properties that are not able to match those investments,\" said Ait Voncke, senior vice president, Expedia Group. \"Technology has the power to level the playing field for hoteliers of all sizes. We continue to listen to our partners' needs and invest in how best to serve all our partners so even the smallest of properties can compete effectively and find opportunities to succeed.\" Among the small independent hotels surveyed, 1 in 4 cited complexity as their biggest challenge when adopting technology, with 1 in 3 saying ease of use is a priority when evaluating solutions. To remove these barriers, Expedia Group is making enhancements to its platform so partners not only have the right resources whenever and wherever they need it, these solutions are delivered through intuitive and easy to use tools. Recently, the company released new user-friendly features on Expedia Group Partner Central platform to further streamline everyday tasks and provide suppliers instant access to relevant information so they can make real-time, informed decisions. New, enhanced features include: Lodging partners can learn more about Expedia Group Partner Central on Discover EPC and download the Partner Central Mobile App.Methodology The study polled 1,215 global hotelier participants in July 2019 for a choice based study to determine how hotel properties are prioritizing their technology investment spend. The study leveraged Expedia Group's global hotelier panel in order to compare technology spending between chain hotels and small independent properties. Chain hotels are classified as properties self-selected as part of a chain affiliation or group of properties with more than 100 rooms, while small independent properties are classified as properties with no chain affiliation and 100 rooms or less.Note to the editor: For more details about the research methodology, please visit our blog: discover.expediapartnercentral.com/power-of-tech.About Expedia GroupExpedia Group is the world's travel platform. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on both a local and global basis. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, Expedia® CruiseShipCenters®, Classic Vacations®, Traveldoo®, VacationRentals.com and SilverRail™. © 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-501 Chain properties: properties self-selected as part of a chain affiliation or group of properties with more than 100 rooms.2 Small independent properties: independent properties with no chain affiliation and 100 rooms or less.3 2019 Lodging Technology Study, Hospitality Technology  View original content to download multimedia:http://www.prnewswire.com/news-releases/new-study-reveals-technology-investment-priorities-for-hotels-300928398.htmlSOURCE  Expedia Group"
    },
    {
        "title": "Expedia celebrates Las Vegas' love for Canada with jackpot travel deals",
        "subtitle": "",
        "date": "Sep 26, 2019 9:09AM EDT",
        "content": "-- October is Canadian Appreciation Month in Las Vegas, and to help Canadians get the most out of their Sin City escape, Expedia.ca is spotlighting discounts and activities tailor-made for Canucks all month long.-- From celebrity Canadian chefs and sporting events, to Cirque and Shania Twain – Vegas serves up a variety of Canadian tricks and treats this fall.-- Visit Expedia.ca this month for special hotel offerings in Sin City, including 15% or more off select hotels and a special offer from The Venetian®Resort Las Vegas. Those who book The Venetian Resort on Expedia during October will receive a complimentary upgrade and breakfast credit1.TORONTO, Sept. 26, 2019 /PRNewswire/ -- Canadians are well-known for their love of hockey, the great outdoors and home-grown talent like Drake and Shania Twain. But another passion unites Canadian travellers: a love for the bright lights of Las Vegas. According to Expedia data, Sin City ranks as one of the top destinations for Canadian travellers year after year. Furthermore, one in five Canadians surveyed consider it a \"bucket list\" destination and a great place for an impulse trip.1The great news is Las Vegas loves Canadians back, which is why Expedia is kicking off a month-long celebration for all things Canadian in Sin City.\"We discovered that October has quietly and unofficially been dubbed Canadian Appreciation Month in Las Vegas, driven by a few hotels and tourism operators offering special deals just to Canadians,\" says Mary Zajac, PR Manager for Brand Expedia. \"Our data shows that Canadians absolutely love Las Vegas, as a place to unwind, be pampered, enjoy a show or try their luck at the casinos. We're excited to jump on the chance to provide Canadians some great deals for their next trip, as well as a few recommended things to see and do during the visit.\"From where to find the best poutine or watch a hockey game, to seeing Canadian-bred talent on the strip, read on for Expedia's roundup of Canadian-inspired Vegas activities. And head to Expedia.ca for special deals on hotels and packages all month long.Plus tune in to ET Canada weeknights on Global throughout the month of October, as they highlight all of the Canadian talent and entertainment options available in Vegas.Spellbinding ShowsBorn in Canada, Cirque du Soleil has cast a hypnotic spell on Vegas with magical live performances and mind-bending circus acts. They're also a source of national pride – according to a recent survey of 1,000 Canadians, 40% say shows with music and acrobatics are at the top of the list when it comes to Vegas attractions2.But which of the seven shows should you choose? The Quebec entertainment company's longest-running and most popular production is Mystère at the TI – Treasure Island Hotel and Casino. Or twist & shout to stunning acts at The Beatles LOVE at The Mirage.If that (somehow) don't impress you much, then Shania Twain's still the one for you. The Ontario-born and raised singer just announced her Las Vegas residency at Planet Hollywood's Zappos Theatre in Las Vegas beginning in December. On Team Drizzy? Here's a double whammy -- not only has the 6 God announced his residency at Wynn Las Vegas' nightclub XS, his wax likeness is on display at Madame Tussaud's. The fully-interactive set will have you creating Insta-worthy videos of Champagne Papi himself.Soak in the StripTake a cue from your fellow travellers and step onto the world's highest observation wheel ­­­-- The High Roller. It's Expedia.ca's top-selling activity and has glass capsules that give an unmatched view of the surrounding strip 3. For a more thrilling view, zipline over the strip at Fly LINQ Zipline.Plate it UpVegas has made a Canadian staple its own by giving poutine the high roller treatment. Duck into Fries n' Pies near the Hard Rock Hotel and Casino for regular or duck fat fries with a wide selection of toppings or venture off-strip to 595 Craft & Kitchen for traditional poutine or some 'loco' toppings like a fried egg and furikake. For a combination of poutine, beer and hockey, head into the official bar of the Vegas Golden Knights, Born And Raised, for an indulgent skirt steak poutine.If you're looking for more elevated cuisine, Sin City serves a banquet of gastronomical delights. Celebrity chef Emeril John Lagassé III may be American but taste sprinklings of his father's French-Canadian roots in the foie gras burger at Lagasse's Stadium or a side of duck fat fingerling potatoes at Delmonico Steakhouse. Another Canadian-born chef, Carlos Buscaglia, throws together a menu of elevated steakhouse classics at HEXX kitchen + bar washed down with hand-crafted cocktails and sweetened by a view of the dancing fountains of the Bellagio.Catch a Hockey GameSport your Canadian colours as one of the Canadian NHL teams take on the Vegas Golden Knights at Las Vegas' T-Mobile Arena throughout October. If you miss the Canadians in Vegas, deck yourself in black and gold and cheer for the Knights, who are coached by fellow-Canuck Gerard Gallant.Rather not go to a live game? Head to the MGM Grand that lays claim to the most energetic book on the strip.Outdoor AttractionsVegas understands that a few days indoors gives most Canadians cabin fever. Trade your poker chips for a camera and hiking boots to capture breath-taking views of the Grand Canyon – the #3 activity for Las Vegas on Expedia.ca3 - or hike through the red sandstone keyholes and corkscrew formations of Antelope Canyon, a quick day trip away. Thrill seekers can also explore the Mojave Desert on an ATV, or experience the rush of indoor skydiving.About ExpediaExpedia is one of the world's largest full-service travel sites, helping millions of travellers per month easily plan and book travel. Expedia aims to provide the latest technology and widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. ©2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either trademarks or registered trademarks of Expedia, Inc. in the U.S. and other countries. Other product and company names mentioned herein may be the property of their respective owners. Visit our web site https://www.expedia.ca or use our mobile app to book cheap flights, hotels, and packages. Source: Brand Expedia.For further information or to schedule an interview, contact: Mary Zajac, Expedia, mzajac@expedia.com, (416) 202-8736.1 Offer includes a complimentary upgrade to a Bella Suite in the Venezia tower. Travellers will also be able to take advantage of a breakfast credit for two guests daily. Book during Canadian Appreciation Month, October 1-31, 2019 and valid for stay dates through April 30, 2020.2 According to a Google Survey commissioned by Expedia of 1000 respondents in Canada from September 12-19, 20193 According to Expedia.ca data on Las Vegas activities sold from January 1 – August 31, 2019 SOURCE  Brand Expedia"
    },
    {
        "title": "Expedia Group Signs Industry-First Agreement to Become Optimized Distributor of Marriott International Wholesale Rates",
        "subtitle": "",
        "date": "Sep 17, 2019 7:30AM EDT",
        "content": "BELLEVUE, Wash. and BETHESDA, Md., Sept. 17, 2019 /PRNewswire/ -- Expedia Group (NASDAQ: EXPE) and Marriott International (NASDAQ: MAR) today announced that as part of a new agreement signed in April 2019, Expedia Group will become the exclusive global optimized distributor of Marriott's wholesale rates, availability, and content to a network of global travel providers, effective October 15, 2019. With the launch of the optimized distributor model, Marriott is introducing changes to how it approaches the redistribution of the company's wholesale rates and availability among third-party travel providers. Through this agreement, Marriott will leverage Expedia Group's industry-leading technology and enterprise-level service to create a single gateway for the redistribution of Marriott's wholesale inventory. The optimized distribution model, provided by Expedia Group's B2B arm, Expedia Partner Solutions, will eliminate the complexity and inefficiency of today's wholesale redistribution model for Marriott hotels. This single gateway solution will also provide a consistent and reliable shopping experience for travelers, ensuring accurate display of hotel descriptions, room rates and fees through known and trusted third party travel providers.The wholesale distribution landscape today is fragmented and complex; hotels need to navigate an intricate web of third-party redistributors and technology standards. This new solution unlocks the power and scale of Expedia Group's technology through one point of access and uniform technology for all Marriott hotels worldwide, which will enable Marriott to more efficiently manage its wholesale redistribution. Redistributors will no longer receive access to Marriott rates and inventory directly from Marriott but may contract with Expedia Partner Solutions to obtain access, provided such redistributors comply with Marriott's distribution standards. Tour operators who access wholesale rates from Marriott directly continue to have this option, in addition to leveraging Expedia Partner Solutions as the optimized distributor for Marriott International wholesale rates.   For Marriott hotels, the new optimized distribution model will reduce the cost, complexity, and consumer issues associated with the current redistribution marketplace. \"At Marriott, our highest priorities include enhancing service and transparency for consumers while driving profitability for owners and franchisees,\" said Brian King, Global Officer of Digital, Distribution, Revenue Strategy & Global Sales, Marriott International. \"With this truly innovative solution from Expedia Group, we can increase our reach to leisure travel providers while solving distribution challenges and improving profitability for our hotels around the world.\"\"We believe in unlocking the power of the Expedia Group platform for our partners so that they can benefit from our significant investments in technology, support services and industry expertise. This agreement with Marriott International is a great example of putting this ethos into practice\" said Christian Gerron, Senior Vice President.  Enterprise Solutions, Expedia Partner Solutions, Expedia Group.  About Expedia GroupExpedia Group (NASDAQ: EXPE) is one of world's largest travel platforms. We help knock down the barriers to travel, making it easier, more enjoyable, more attainable and more accessible. We are here to bring the world within reach for customers and partners around the globe. We leverage our platform and technology capabilities across an extensive portfolio of businesses and brands to orchestrate the movement of people and the delivery of travel experiences on a both local and global scale.  Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Egencia®, trivago®, HomeAway®, Orbitz®, Travelocity®, Wotif®, lastminute.com.au®, ebookers®, CheapTickets®, Hotwire®, Classic Vacations®, Expedia® Group Media Solutions, CarRentals.com™, Expedia Local Expert®, Expedia® CruiseShipCenters®, SilverRail Technologies, Inc., ALICE and Traveldoo®. For more information, visit www.expediagroup.com.© 2019 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,000 properties under 30 leading brands spanning 132 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world.  The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG).  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram. IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/expedia-group-signs-industry-first-agreement-to-become-optimized-distributor-of-marriott-international-wholesale-rates-300919254.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Listen Up! Expedia Launches New Podcast, \"Out Travel The System\" Now Available on Spotify, iTunes and More.",
        "subtitle": "",
        "date": "Sep 16, 2019 11:49AM EDT",
        "content": "BELLEVUE, Wash., Sept. 16, 2019 /PRNewswire/ -- Whether you're planning a once-in-a-lifetime vacation or a casual weekend getaway, navigating the travel world can be complex. That's why today, Expedia.com® has officially launched \"Out Travel The System,\" a podcast designed to give travelers a sneak peek behind the curtain to arm them with insider tips, tricks and hacks. Hosted by Global Director of Public Relations for Brand Expedia, Nisreene Atassi, the podcast gives listeners the inside scoop on all facets of travel. Subscribers will get a chance to hear directly from the pros like travel blogger and influencer, Courtney Scott, and astrology queens, The AstroTwins to make your next vacation a breeze. Each episode will dive into a unique topic affecting travel today – from the best time to book flights and navigating a solo trip to picking your best travel companion based on your zodiac sign.\"With more than 20,000 travel experts, partners and suppliers at our fingertips, who better to help you navigate the complex world of travel than us?\" said Nisreene Atassi, PR Director for Brand Expedia. \"Expedia's expansion into this space is part of our ongoing efforts to ensure travelers have everything they need to make informed decisions. Our goal is to enrich the podcast universe with travel-centric information so that listeners can learn, get inspired by ideas and share their experiences with others.\" Out Travel The System is now available on all major distribution platforms, including Spotify, Apple Podcasts, Google Podcasts, Google Play Music, TuneIn and Deezer. New episodes will be released every other week. You can also find all of our podcasts with a brief summary of their content on the Expedia Viewfinder Blog. Come find us on Facebook, Instagram and Twitter to share your stories and suggestions with the hashtag #outtravelthesystem!  About Expedia.com Expedia.com® is one of the world's largest full-service travel sites, helping millions of travelers per month easily plan and book travel. Expedia.com (https://www.expedia.com/, 1-800-EXPEDIA) aims to provide the latest technology and the widest selection of top vacation destinations, affordable airfare, hotel deals, car rentals, destination weddings, cruise deals and in-destination activities, attractions, services and travel apps. © 2019 Expedia, Inc. All rights reserved. Expedia and the Airplane logo are either registered trademarks or trademarks of Expedia, Inc. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. CST# 2029030-50. Visit our web site https://www.expedia.com/ or use our mobile app to book cheap flights and hotels. View original content to download multimedia:http://www.prnewswire.com/news-releases/listen-up-expedia-launches-new-podcast-out-travel-the-system-now-available-on-spotify-itunes-and-more-300918776.htmlSOURCE  Expedia.com"
    }
]