[
    {
        "title": "Fastenal Drives Toward the Future With an Electric Truck Pilot Program",
        "subtitle": "",
        "date": "Feb 26, 2020 5:05PM EST",
        "content": "\nPenske Truck Leasing is Fastenal’s Electric Vehicle Support Partner for the Pilot\n    WINONA, Minn.--(BUSINESS WIRE)--\nEach business day, Fastenal trucks fuel up before heading out to deliver industrial and construction supplies to surrounding branches and customer locations. For one recent addition to the Fastenal fleet, there’s a new twist to this daily ritual: Instead of fueling up for its delivery route, this particular truck is charging up.\n\nAs part of its sustainable distribution efforts, Fastenal is now running a battery electric Freightliner eM2 straight truck to service branches in the Los Angeles metro area. The venture stems from a collaboration between Penske Truck Leasing and Daimler Trucks North America to test commercial electric trucks in real-world situations and drive future improvements to the technology.\n\nThe eM2 began service in the Fastenal fleet in early January, making deliveries of wide-ranging products to 28 Fastenal branches and customer-specific Onsite locations – from Los Angeles to coastal Orange County to the Inland Empire.\n\n“We’re excited to help move this technology forward,” said Dan Florness, Fastenal’s president and CEO. “It adds a new dimension to our own sustainability efforts, and we believe it can offer some insights to help bring electric trucks into wider commercial use.”\n\nThe eM2 is ideally suited for local transportation of goods as well as for last-mile deliveries – a good fit for Fastenal’s customer-centric distribution model, providing a consistent flow of product from regional hubs, to local markets, and ultimately to customers’ points of use. The truck is part of Freightliner's Electric Innovation Fleet, a 30-vehicle test fleet of Class 6/7 and Class 8 trucks being used to test the integration of battery electric trucks in large commercial fleets.\n\n“We’re committed to helping customers like Fastenal accelerate innovation within their truck fleet operations,” said Art Vallely, president of Penske Truck Leasing. “Fastenal is an innovative industry leader, and they’re now using the latest, leading-edge electric vehicle technology available on the road today through Penske’s co-creation efforts with the Freightliner Electric Innovation Fleet.”\n\nAbout Penske Truck Leasing\n\nPenske Truck Leasing is a Penske Transportation Solutions company headquartered in Reading, Pennsylvania. A leading global transportation services provider, Penske Truck Leasing operates more than 326,000 vehicles and serves customers from more than 1,100 locations in North America, South America, Europe, Australia and Asia. Product lines include full-service truck leasing, contract maintenance, commercial and consumer truck rentals, used truck sales, transportation and warehousing management and supply chain management solutions. Visit www.pensketruckleasing.com to learn more.\n\nAbout Fastenal\n\nFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines – from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on over 3,200 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by fifteen regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel – all working toward Fastenal’s common goal of Growth Through Customer Service®.\n\nAdditional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.\n\nFAST-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005962/en/\nEllen Stolts\nAssistant Controller – Reporting and Reconciliation\n507.313.7282\nSource: Fastenal Company"
    },
    {
        "title": "Fastenal Company Reports 2019 Annual and Fourth Quarter Earnings",
        "subtitle": "",
        "date": "Jan 17, 2020 6:50AM EST",
        "content": "    WINONA, Minn.--(BUSINESS WIRE)--\nFastenal Company (Nasdaq:FAST), a leader in the wholesale distribution of industrial and construction supplies, today announced its financial results for the quarter and year ended December 31, 2019. Except for share and per share information, or as otherwise noted below, dollar amounts are stated in millions. Share and per share information in this release, and in the financial statements attached to this release, has been adjusted to reflect the two-for-one stock split effective at the close of business on May 22, 2019. Throughout this document, percentage and dollar calculations, which are based on non-rounded dollar values, may not be able to be recalculated using the dollar values included in this document due to the rounding of those dollar values.\n\nQuarterly Results of Operations\n\nNet sales increased $45.3, or 3.7%, in the fourth quarter of 2019 when compared to the fourth quarter of 2018. This increase was driven by higher unit sales related to our growth drivers, most notably contribution from industrial vending and Onsite locations, compared to the fourth quarter of 2018. The general slowing in economic activity that we experienced in the second and third quarters of 2019 continued in the fourth quarter of 2019. This general softness was exacerbated in December by holiday timing and longer than usual year-end plant shutdowns. A lesser contributor to our sales growth in the fourth quarter of 2019 was higher product pricing as a result of increases implemented in late 2018 and throughout 2019 to mitigate the impacts of general and tariff-related inflation in the marketplace. Sales of our fastener products grew 1.8% on a daily basis over the fourth quarter of 2018 and represented 33.6% of sales in the fourth quarter of 2019. Sales of our non-fastener products grew 5.1% on a daily basis over the fourth quarter of 2018 and represented 66.4% of sales in the fourth quarter of 2019.\n\nOur gross profit, as a percentage of net sales, declined 80 basis points to 46.9% in the fourth quarter of 2019 from 47.7% in the fourth quarter of 2018. The most significant factor behind the decline in our gross profit percentage in the period was the success we have had generating sales growth as a result of our growth drivers (industrial vending and Onsite locations). These two channels have a lower gross margin, due to customer and product mix, when compared to the company average. The gross margin percentage was also affected by net expenses related to freight. Weaker business conditions resulted in lower freight revenues, even as the overall cost of our fleet assets is relatively stable. As a result, the combination of seasonal and cyclical softness in the fourth quarter of 2019 resulted in lower freight revenue in the period, and reduced absorption of our fixed fleet costs.\n\nOur operating income, as a percentage of net sales, declined to 18.7% in the fourth quarter of 2019 from 19.0% in the fourth quarter of 2018, which was primarily due to the lower gross margin. While we leveraged our operating expenses in the period, we did not do so to the same degree as in preceding quarters in 2019 as a result of the slower top line growth. Our operating and administrative expenses (including the (gain) loss on sales of property and equipment), as a percentage of net sales, improved to 28.2% in the fourth quarter of 2019 compared to 28.8% in the fourth quarter of 2018. The primary reason for this improvement was our ability to leverage employee and general corporate expenses.\n\nEmployee-related expenses, which represent 65% to 70% of total operating and administrative expenses, increased 2.4% in the fourth quarter of 2019 when compared to the fourth quarter of 2018. The increase in employee-related expenses was mainly related to slightly higher year-over-year headcount through the period. Occupancy-related expenses, which represent 15% to 20% of total operating and administrative expenses, increased 3.4%. Facility costs were mostly flat in the period, which was more than offset by an increase in costs related to industrial vending equipment of 11.2% reflecting the increase in the number of vending machines deployed from December 2018 to December 2019, as discussed in more detail below. All other operating and administrative expenses, which represent 15% to 20% of total operating and administrative expenses, decreased 6.5%. Higher information technology spending to support our business was more than offset by a reduction in our net bad debt write-offs and other costs, such as the absence of certain legal and foreign costs that existed in the fourth quarter of 2018.\n\nOur net interest expense was $2.5 in the fourth quarter of 2019 compared to $3.6 in the fourth quarter of 2018. This decrease was caused by a lower average debt balance during the period and lower average interest rates.\n\nWe recorded income tax expense of $57.7 in the fourth quarter of 2019, or 24.4% of earnings before income taxes. Income tax expense was $61.0 in the fourth quarter of 2018, or 26.6% of earnings before income taxes, which included the impact of a discrete expense of approximately $3.2 related to the impact of the change in our tax rate on inter-entity transactions. This discrete expense increased our tax rate during the period by 1.4 percentage points. We believe our ongoing tax rate, absent any discrete tax items, will be in the 24.5% to 25.0% range.\n\nOur net earnings during the fourth quarter of 2019 were $178.7, an increase of 5.9% when compared to the fourth quarter of 2018. Our diluted net earnings per share were $0.31 during the fourth quarter of 2019 compared to $0.29 during the fourth quarter of 2018, an increase of 5.4%. Adjusting for the discrete tax item that adversely affected net earnings in the fourth quarter of 2018, our net earnings and diluted net earnings per share in the fourth quarter of 2019 would have grown by 4.0% and 3.4%, respectively.\n\nGrowth Driver Performance\n\nWe signed 21,857 industrial vending devices during 2019 and 5,144 devices during the fourth quarter of 2019. Our installed device count on December 31, 2019 was 89,937, an increase of 10.8% over December 31, 2018. Daily sales through our vending devices grew at a low double-digit pace in the fourth quarter of 2019 over the fourth quarter of 2018 due to the increase in the installed base. These device counts do not include slightly more than 15,000 vending devices deployed as part of a lease locker program. Our goal for vending device signings in 2020 is 22,000 to 24,000 units.\n\nWe signed 362 new Onsite locations (defined as dedicated sales and service provided from within, or in close proximity to, the customer's facility) during 2019 and 79 new Onsite locations during the fourth quarter of 2019. We had 1,114 active sites on December 31, 2019, which represented an increase of 24.6% from December 31, 2018. Daily sales through our Onsite locations, excluding sales transferred from branches to new Onsites, grew at a low double-digit rate in the fourth quarter of 2019 over the fourth quarter of 2018. New revenue from relatively new actives continues to offset the impact of weak demand on more mature sites. Our goal for Onsite signings in 2020 is 375 to 400.\n\nDaily sales to our national account customers (defined as customer accounts with a multi-site contract) grew 8.2% in the fourth quarter of 2019 over the fourth quarter of 2018. Revenues attributable to national account customers represented 54.8% of our total revenues in the period.\n\nBalance Sheet and Cash Flow\n\nWe produced operating cash flow of $842.7 in 2019, an increase of 25.0% from 2018, representing 106.5% of the period's net earnings versus 89.7% in 2018. The increase in our operating cash flow as a percentage of net earnings reflects a reduced drag from working capital investment than was experienced in 2018 and, to a lesser degree, higher net income. Our investment in property and equipment, net of proceeds from sales, was $239.8 in 2019 compared to $166.8 in 2018. The increase for the year was a result of greater spending to develop or expand certain of our distribution center assets, purchase vending equipment to support our growth, and add vehicles to our fleet. We expect our net capital expenditures in 2020 to be within a range of $180.0 to $205.0, a decrease from $195.0 to $225.0 in 2019. This decrease is primarily attributable to a reduction in projects that would develop and expand certain distribution center assets and, to a lesser degree, reduced fleet vehicle investment.\n\nWe returned $498.6 to our shareholders in 2019 (all in the form of dividends), compared to $544.9 in 2018 (in the form of dividends of $441.9 and common stock purchases of $103.0).\n\nTotal debt on our balance sheet was $345.0 at the end of the fourth quarter of 2019, or 11.5% of total capital (the sum of stockholders' equity and total debt). This compares to $500.0, or 17.8% of total capital, at the end of 2018.\n\nAccounts receivable were $741.8 at the end of 2019, an increase of $27.5 or 3.9%, over the end of 2018. This increase reflects not only our growth in sales but that our growth is being driven disproportionately by our national accounts program, where our customers tend to have longer payment terms than our business as a whole. Receivables growth slowed over the course of the year due to the effect on receivables of softer business activity. Inventories were $1,366.4 at the end of 2019, an increase of $87.7, or 6.9%, over the end of 2018. Our inventory has risen to support higher sales, largely reflecting large increases in the number of installed vending devices and active Onsite locations, to support high levels of service, and from inflation and tariffs. We intend to continue to invest in the inventory necessary to support our vending and Onsite initiatives. However, over the course of the year, we did reduce other spending, both reflecting proactive efforts to reduce inventory and in reaction to the effect of softer business activity, which allowed us to meaningfully decelerate inventory growth in the fourth quarter of 2019. Accounts payable were $192.8 at the end of 2019, a decrease of $0.7, or 0.4%, from the end of 2018, as a result of softer business activity.\n\nAdditional Information\n\nThe table below summarizes our total and FTE (based on 40 hours per week) employee headcount, our investments in in-market locations (defined as the sum of the total number of public branch locations and the total number of active Onsite locations), and industrial vending devices at the end of the periods presented and the percentage change compared to the end of the prior periods.\n\nDuring the last twelve months, we reduced our absolute employee headcount by 38 people in our in-market locations and increased by 304 people in total. The reduction in our absolute employee headcount in our in-market locations reflects actions taken by leadership in our public branches over the past couple of quarters to control expenses in response to weaker demand, which was only partly offset by increases to support growth in our Onsite locations. The increase in our total absolute employee count is mostly from additions we have made to support customer acquisition, implementation, and growth in the field, particularly as it relates to our growth drivers and to support general corporate and hub functions.\n\nWe opened four branches in the fourth quarter of 2019 and closed 36 branches, net of conversions. We activated 64 Onsite locations in the fourth quarter of 2019 and closed 26, net of conversions. For the full year of 2019, we opened twelve branches and closed 125 branches, net of conversions. For the full year of 2019, we activated 312 Onsite locations and closed 92, net of conversions. The number of closings reflects both normal churn in our business, whether due to exiting customer relationships, the shutting or relocation of a customer facility, or a customer decision, as well as a review of certain underperforming locations. Our in-market network forms the foundation of our business strategy, and we will continue to open or close locations as is deemed necessary to sustain and improve our network, support our growth drivers, and manage our operating expenses.\n\nCONFERENCE CALL TO DISCUSS QUARTERLY RESULTS\n\nAs we previously disclosed, we will host a conference call today to review the annual and quarterly results, as well as current operations. This conference call will be broadcast live over the Internet at 9:00 a.m., central time. To access the webcast, please go to the Fastenal Company Investor Relations Website at https://investor.fastenal.com/events.cfm.\n\nADDITIONAL MONTHLY AND QUARTERLY INFORMATION\n\nWe publish on the 'Investor Relations' page of our website at www.fastenal.com both our monthly consolidated net sales information and the presentation for our quarterly conference call (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter). We expect to publish the consolidated net sales information for each month, other than the third month of a quarter, at 6:00 a.m., central time, on the fourth business day of the following month. We expect to publish the consolidated net sales information for the third month of each quarter and the conference call presentation for each quarter at 6:00 a.m., central time, on the date our earnings announcement for such quarter is publicly released.\n\nFORWARD LOOKING STATEMENTS\n\nCertain statements contained in this document do not relate strictly to historical or current facts. As such, they are considered 'forward-looking statements' that provide current expectations or forecasts of future events. These forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements can be identified by the use of terminology such as anticipate, believe, should, estimate, expect, intend, may, will, plan, goal, project, hope, trend, target, opportunity, and similar words or expressions, or by references to typical outcomes. Any statement that is not a historical fact, including estimates, projections, future trends, and the outcome of events that have not yet occurred, is a forward-looking statement. Our forward-looking statements generally relate to our expectations regarding the business environment in which we operate, our projections of future performance, our perceived marketplace opportunities, our strategies, goals, mission, and vision, and our expectations about future capital expenditures, future tax rates, future inventory levels, and Onsite and industrial vending signings. You should understand that forward-looking statements involve a variety of risks and uncertainties, known and unknown, and may be affected by inaccurate assumptions. Consequently, no forward-looking statement can be guaranteed and actual results may vary materially. Factors that could cause our actual results to differ from those discussed in the forward-looking statements include, but are not limited to, those detailed in our most recent annual and quarterly reports. Each forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update any such statement to reflect events or circumstances arising after such date. FAST-E\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200117005053/en/\nEllen Stolts\nAssistant Controller – Reporting and Reconciliation\n507-313-7282\nSource: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Cash Dividend",
        "subtitle": "",
        "date": "Jan 16, 2020 5:15PM EST",
        "content": "    WINONA, Minn.--(BUSINESS WIRE)--\nFastenal Company (Nasdaq:FAST) reported its board of directors declared a dividend of $0.25 per share to be paid in cash on February 28, 2020 to shareholders of record at the close of business on January 31, 2020. Except for share and per share information, dollar amounts are stated in millions.\n\nFastenal began paying annual dividends in 1991, semi-annual dividends in 2003, and then expanded to quarterly dividends in 2011. Our board of directors intends to continue paying quarterly dividends, though all future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors, such as income tax rates related to dividends at that time.\n\nIn 2020, 2019, and 2018, we paid (or declared) dividends as follows:\n\nDividend and common stock purchase activity during the last ten years:\n\n(1) The total dividends paid amount includes the estimated impact from this announcement. The estimate is calculated using the 574.1 million shares outstanding at December 31, 2019.\n\n(2) There was a supplemental dividend paid in December 2012.\n\nAll share and per share information reflects the two-for-one stock splits in both 2019 and 2011.\n\nAbout Fastenal\n\nFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines – from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory or FMI®). Our distribution system centers on over 3,200 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by fifteen regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel – all working toward Fastenal’s common goal of Growth Through Customer Service®.\n\nAdditional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.\n\nThis press release contains statements that are not historical in nature and that are intended to be, and are hereby identified as, \"forward looking statements\" as defined in the Private Securities Litigation Reform Act of 1995, including a statement regarding expectations as to payment of a quarterly cash dividend in the foreseeable future. Any future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors. For example, a change in business needs including working capital and funding for acquisitions, or a change in income tax law relating to dividends, could cause the company to decide not to pay a dividend in the future. A discussion of other risks and uncertainties is included in the company's filings with the SEC, including our most recent annual and quarterly reports. FAST-D\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200116005856/en/\nEllen Stolts\nAssistant Controller – Reporting and Reconciliation\n507.313.7282\nSource: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Conference Call to Review 2019 Annual and Fourth Quarter Earnings",
        "subtitle": "",
        "date": "Jan 2, 2020 5:05PM EST",
        "content": "    WINONA, Minn.--(BUSINESS WIRE)--\nFastenal Company (Nasdaq:FAST) announced the date and time for its conference call to review 2019 annual and fourth quarter results, as well as current operations. The conference call will be broadcast live over the Internet on Friday, January 17, 2020 at 9:00 a.m. central time.\n\nTo access the call, please visit the following Web address:\n\nhttps://investor.fastenal.com/events.cfm\n\nOur conference call presentation (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter) will be available at 6:00 a.m., central time, on the day of the conference call. To access the presentation, please visit the following Web address: https://investor.fastenal.com/releases.cfm\n\nAn online archive of the broadcast will be available within one hour of the conclusion of the call and will remain available until March 1, 2020. Participants must have a soundcard and speakers to listen to the online broadcast.\n\nAbout Fastenal\n\nFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines – from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on over 3,200 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 15 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel – all working toward Fastenal’s common goal of Growth Through Customer Service®.\n\nAdditional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.\n\nFAST-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200102005532/en/\nEllen Stolts\nAssistant Controller – Reporting and Reconciliation\n507.313.7282\nSource: Fastenal Company"
    },
    {
        "title": "Thinking about buying stock in Aphria, NF Energy, Fastenal, Intel, or Exxon Mobil?",
        "subtitle": "",
        "date": "Oct 15, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 15, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for APHA, BIMI, FAST, INTC, and XOM.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aphria-nf-energy-fastenal-intel-or-exxon-mobil-300938650.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Fastenal, Roku, Synthesis Energy Systems, or Schlumberger?",
        "subtitle": "",
        "date": "Oct 14, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 14, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, FAST, ROKU, SES, and SLB.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-fastenal-roku-synthesis-energy-systems-or-schlumberger-300937746.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Fastenal Company Reports 2019 Third Quarter Earnings",
        "subtitle": "",
        "date": "Oct 11, 2019 6:50AM EDT",
        "content": "    WINONA, Minn.--(BUSINESS WIRE)--\nFastenal Company (Nasdaq:FAST), a leader in the wholesale distribution of industrial and construction supplies, today announced its financial results for the quarter ended September 30, 2019. Except for share and per share information, or as otherwise noted below, dollar amounts are stated in millions. Share and per share information in this release, and in the financial statements attached to this release, has been adjusted to reflect the two-for-one stock split effective at the close of business on May 22, 2019. Throughout this document, percentage and dollar calculations, which are based on non-rounded dollar values, may not be able to be recalculated using the dollar values included in this document due to the rounding of those dollar values.\n\nPERFORMANCE SUMMARY\n\nQuarterly Results of Operations\n\nNet sales increased $99.3, or 7.8%, in the third quarter of 2019 when compared to the third quarter of 2018. Adjusting for the one additional selling day in the current period, our daily sales increased 6.1% from the third quarter of 2019 when compared to the third quarter of 2018. This increase was driven by higher unit sales related primarily to our growth drivers, most notably contribution from industrial vending and Onsite locations, compared to the third quarter of 2018. The general slowing in economic activity that we experienced in the second quarter of 2019 continued in the third quarter of 2019. A lesser contributor to our sales growth in the third quarter of 2019 was higher product pricing as a result of increases implemented in late 2018 and throughout 2019 to mitigate the impacts of general and tariff-related inflation in the marketplace. Sales of our fastener products grew 3.0% on a daily basis over the third quarter of 2018 and represented 33.7% of sales in the third quarter of 2019. Sales of our non-fastener products grew 8.0% on a daily basis over the third quarter of 2018 and represented 66.3% of sales in the third quarter of 2019.\n\nOur gross profit, as a percentage of net sales, declined 90 basis points to 47.2% in the third quarter of 2019 from 48.1% in the third quarter of 2018. The most significant factor behind the decline in our gross profit percentage in the period was the success we have had generating sales growth as a result of our growth drivers (industrial vending and Onsite locations). These two channels have a lower gross margin, due to customer and product mix, when compared to the company average. The gross margin percentage was also affected by the net effect of inflation on our product margins as well as net expenses related to freight. In the cases of all three variables that influenced our gross margin percentage in the period, the negative impacts did moderate versus what was experienced in the second quarter of 2019.\n\nOur operating income, as a percentage of net sales, declined to 20.4% in the third quarter of 2019 from 20.5% in the third quarter of 2018. The nominal decline was due to the lower gross margin, which offset our ability to leverage our operating expenses. Our operating and administrative expenses (including the gain on sales of property and equipment), as a percentage of net sales, improved to 26.8% in the third quarter of 2019 compared to 27.6% in the third quarter of 2018. The primary reason for this improvement was our ability to leverage employee- and occupancy-related expenses.\n\nEmployee-related expenses, which represent 65% to 70% of total operating and administrative expenses, increased 4.2% in the third quarter of 2019 when compared to the third quarter of 2018. The increase in employee-related expenses was mainly related to an increase of 4.1% in our full-time equivalent ('FTE') headcount. Occupancy-related expenses, which represent 15% to 20% of total operating and administrative expenses, increased 2.8%. Costs related to facilities were mostly flat in the period, while costs related to industrial vending equipment increased 11.4% reflecting the increase in the number of vending machines deployed from September 2018 to September 2019, as discussed in more detail below. All other operating and administrative expenses, which represent 15% to 20% of total operating and administrative expenses, increased 8.6%. This was due to higher information technology spending to support our business and an increase in selling-related transportation expenses reflecting fewer truck sales in the third quarter of 2019 versus the third quarter of 2018.\n\nOur net interest expense was $3.5 in the third quarter of 2019 compared to $3.0 in the third quarter of 2018. This increase was caused by a higher average debt balance during the period and higher average interest rates.\n\nWe recorded income tax expense of $64.9 in the third quarter of 2019, or 23.3% of earnings before income taxes. Income tax expense was $61.8 in the third quarter of 2018, or 23.8% of earnings before income taxes. Our income tax expense was affected by discrete items in both periods. In the third quarter of 2019, our income tax expense was reduced by $3.6 as a result of benefits associated with changes made in certain international tax jurisdictions and additional adjustments related to tax reform. This reduced our tax rate in the period by 130 basis points. In the third quarter of 2018, our income tax was reduced by $1.9 as a result of a slight reduction in our estimated transition tax liability and accelerating depreciation for certain physical assets. This reduced our tax rate in the period by 80 basis points. We believe our ongoing tax rate, absent any discrete tax items, will be in the lower portion of a 24.5% to 25.0% range.\n\nOur net earnings during the third quarter of 2019 were $213.5, an increase of 8.0% when compared to the third quarter of 2018. Our diluted net earnings per share were $0.37 during the third quarter of 2019 compared to $0.34 during the third quarter of 2018, an increase of 8.0%. Adjusting for the discrete tax items that benefited net earnings in both the third quarter of 2019 and the third quarter of 2018, our net earnings and diluted net earnings per share in the third quarter of 2019 would have grown 7.2% and 7.3%, respectively, over the prior year period.\n\nGrowth Driver Performance\n\nWe signed 16,713 industrial vending devices during the first nine months of 2019 and 5,671 devices during the third quarter of 2019. Our installed device count on September 30, 2019 was 88,327, an increase of 12.2% over September 30, 2018. Daily sales through our vending devices grew at a mid-teens pace in the third quarter of 2019 over the third quarter of 2018 due to the increase in the installed base. These device counts do not include slightly more than 15,000 vending devices deployed as part of a lease locker program. We believe slower economic activity has lengthened the sales cycle for vending. As a result, we currently expect to sign approximately 22,000 vending devices in 2019, slightly below our previous goal of 23,000 to 25,000 units.\n\nWe signed 283 new Onsite locations (defined as dedicated sales and service provided from within, or in close proximity to, the customer's facility) during the first nine months of 2019 and 84 new Onsite locations during the third quarter of 2019. We had 1,076 active sites on September 30, 2019, which represented an increase of 30.0% from September 30, 2018. Daily sales through our Onsite locations, excluding sales transferred from branches to new Onsites, grew at a low-teens pace in the third quarter of 2019 over the third quarter of 2018, with weak demand impacting more mature sites. Our goal for Onsite signings in 2019 remains 375 to 400.\n\nWe signed 50 new national account contracts (defined as new customer accounts with a multi-site contract) in the third quarter of 2019, and revenues attributable to national account customers represented 53.5% of our total revenues in the period. Daily sales to our national account customers grew 10.2% in the third quarter of 2019 over the third quarter of 2018.\n\nBalance Sheet and Cash Flow\n\nWe produced operating cash flow of $590.3 in the first nine months of 2019, an increase of 19.0% from the first nine months of 2018, representing 96.4% of the period's net earnings versus 85.1% in the first nine months of 2018. The increase in our operating cash flow as a percentage of net earnings reflects a reduced drag from working capital investment than was experienced in the first nine months of 2018 and, to a lesser degree, higher net income. Our investment in property and equipment, net of proceeds from sales, was $179.3 in the first nine months of 2019 compared to $88.8 in the first nine months of 2018. This increase was a result of greater spending to develop or expand certain of our distribution center assets, to purchase vending equipment to support our growth, and to add vehicles to our fleet. We continue to expect our net capital expenditures in 2019 to be within a range of $195.0 to $225.0, an increase from $166.8 in 2018. This increase is a result of higher spending for property and equipment to expand our hub capacity, vending devices, and hub vehicles. The progress of our investments in hub capacity will likely be the primary determinant of where we fall within our range.\n\nWe returned $126.2 in dividends to our shareholders in the third quarter of 2019, compared to $114.8 in dividends in the third quarter of 2018. We did not repurchase any of our common stock in either period.\n\nTotal debt on our balance sheet was $445.0 at the end of the third quarter of 2019, or 14.7% of total capital (the sum of stockholders' equity and total debt). This compares to $390.0, or 14.4% of total capital, at the end of the third quarter of 2018, and $500.0, or 17.8% of total capital, at the end of the fourth quarter of 2018.\n\nAccounts receivable were $817.3 at the end of the third quarter of 2019, an increase of $44.8 or 5.8%, over the third quarter of 2018. This increase reflects not only our growth in sales but that our growth is being driven disproportionately by our national accounts program, where our customers tend to have longer payment terms than our business as a whole. Our accounts receivable balance in the third quarter of 2019 also benefited from the timing of the quarter end close. We continue to see customers delaying payments late in the quarter, a trend that began in the fourth quarter of 2017. Based on the aging, however, there has been no erosion in the quality of our receivables. Inventories were $1,354.7 at the end of the third quarter of 2019, an increase of $160.0, or 13.4%, over the third quarter of 2018. Our inventory has risen to support higher sales, largely reflecting large increases in the number of installed vending devices and active Onsite locations, to support high levels of service, and from inflation and tariffs. We intend to continue to invest in the inventory necessary to support our vending and Onsite initiatives. However, we have reduced other spending which is expected to moderate inventory growth through the balance of 2019. Accounts payable were $215.2 at the end of the third quarter of 2019, an increase of $29.2, or 15.7%, from the end of the third quarter of 2018, driven by an increase in inventory demand.\n\nAdditional Information\n\nThe table below summarizes our total and FTE (based on 40 hours per week) employee headcount, our investments in in-market locations (defined as the sum of the total number of public branch locations and the total number of active Onsite locations), and industrial vending devices at the end of the periods presented and the percentage change compared to the end of the prior periods.\n\nDuring the last twelve months, we increased our absolute employee headcount by 379 people in our in-market locations and 756 people in total. The increase is mostly a function of additions we have made to support customer growth in the field as well as investments in our growth drivers.\n\nWe opened two branches in the third quarter of 2019 and closed 22 branches. One branch was converted from a public branch to a non-public location, and two non-public locations were converted to public branches. We activated 87 Onsite locations in the third quarter of 2019 and closed 35. The number of closings reflects both normal churn in our business, whether due to exiting customer relationships, the shutting or relocation of a customer facility, or a customer decision, as well as a review of certain underperforming locations. Our in-market network forms the foundation of our business strategy, and we will continue to open or close locations as is deemed necessary to sustain and improve our network, support our growth drivers, and manage our operating expenses.\n\nCONFERENCE CALL TO DISCUSS QUARTERLY RESULTS\n\nAs we previously disclosed, we will host a conference call today to review the quarterly results, as well as current operations. This conference call will be broadcast live over the Internet at 9:00 a.m., central time. To access the webcast, please go to the Fastenal Company Investor Relations Website at https://investor.fastenal.com/events.cfm.\n\nADDITIONAL MONTHLY AND QUARTERLY INFORMATION\n\nWe publish on the 'Investor Relations' page of our website at www.fastenal.com both our monthly consolidated net sales information and the presentation for our quarterly conference call (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter). We expect to publish the consolidated net sales information for each month, other than the third month of a quarter, at 6:00 a.m., central time, on the fourth business day of the following month. We expect to publish the consolidated net sales information for the third month of each quarter and the conference call presentation for each quarter at 6:00 a.m., central time, on the date our earnings announcement for such quarter is publicly released.\n\nFORWARD LOOKING STATEMENTS\n\nCertain statements contained in this document do not relate strictly to historical or current facts. As such, they are considered 'forward-looking statements' that provide current expectations or forecasts of future events. These forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements can be identified by the use of terminology such as anticipate, believe, should, estimate, expect, intend, may, will, plan, goal, project, hope, trend, target, opportunity, and similar words or expressions, or by references to typical outcomes. Any statement that is not a historical fact, including estimates, projections, future trends, and the outcome of events that have not yet occurred, is a forward-looking statement. Our forward-looking statements generally relate to our expectations regarding the business environment in which we operate, our projections of future performance, our perceived marketplace opportunities, our strategies, goals, mission, and vision, and our expectations about future capital expenditures, future tax rates, future inventory levels, and Onsite and industrial vending signings. You should understand that forward-looking statements involve a variety of risks and uncertainties, known and unknown, and may be affected by inaccurate assumptions. Consequently, no forward-looking statement can be guaranteed and actual results may vary materially. Factors that could cause our actual results to differ from those discussed in the forward-looking statements include, but are not limited to, those detailed in our most recent annual and quarterly reports. Each forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update any such statement to reflect events or circumstances arising after such date. FAST-E\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191011005066/en/\nEllen Stolts\nFinancial Reporting & Regulatory Compliance Manager\n507-313-7282\nSource: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Cash Dividend",
        "subtitle": "",
        "date": "Oct 10, 2019 5:05PM EDT",
        "content": "    WINONA, Minn.--(BUSINESS WIRE)--\nFastenal Company (Nasdaq:FAST) reported its board of directors declared a dividend of $0.22 per share to be paid in cash on November 22, 2019 to shareholders of record at the close of business on October 25, 2019. Except for share and per share information, dollar amounts are stated in millions.\n\nFastenal began paying annual dividends in 1991, semi-annual dividends in 2003, and then expanded to quarterly dividends in 2011. Our board of directors intends to continue paying quarterly dividends, though all future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors, such as income tax rates related to dividends at that time.\n\nIn 2019, 2018, and 2017, we paid (or declared) dividends as follows:\n\nDividend and common stock purchase activity during the last ten years:\n\nAll share and per share information reflects the two-for-one stock splits in both 2011 and 2019.\n\nAbout Fastenal\n\nFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines – from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory or FMI®). Our distribution system centers on over 3,200 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel – all working toward Fastenal’s common goal of Growth Through Customer Service®.\n\nAdditional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.\n\nThis press release contains statements that are not historical in nature and that are intended to be, and are hereby identified as, \"forward looking statements\" as defined in the Private Securities Litigation Reform Act of 1995, including a statement regarding expectations as to payment of a quarterly cash dividend in the foreseeable future. Any future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors. For example, a change in business needs including working capital and funding for acquisitions, or a change in income tax law relating to dividends, could cause the company to decide not to pay a dividend in the future. A discussion of other risks and uncertainties is included in the company's filings with the SEC, including our most recent annual and quarterly reports. FAST-D\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005797/en/\nEllen Stolts\nFinancial Reporting & Regulatory Compliance Manager\n507.313.7282\nSource: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Conference Call to Review 2019 Third Quarter Earnings",
        "subtitle": "",
        "date": "Sep 26, 2019 5:05PM EDT",
        "content": "    WINONA, Minn.--(BUSINESS WIRE)--\nFastenal Company (Nasdaq:FAST) announced the date and time for its conference call to review 2019 third quarter results, as well as current operations. The conference call will be broadcast live over the Internet on Friday, October 11, 2019 at 9:00 a.m. central time.\n\nTo access the call, please visit the following Web address:\n\nhttps://investor.fastenal.com/events.cfm\n\nOur conference call presentation (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter) will be available at 6:00 a.m., central time, on the day of the conference call. To access the presentation, please visit the following Web address: https://investor.fastenal.com/releases.cfm\n\nAn online archive of the broadcast will be available within one hour of the conclusion of the call and will remain available until December 1, 2019. Participants must have a soundcard and speakers to listen to the online broadcast.\n\nAbout Fastenal\n\nFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines – from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on approximately 3,200 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel – all working toward Fastenal’s common goal of Growth Through Customer Service®.\n\nAdditional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.\n\nFAST-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190926005884/en/\nEllen Stolts\nFinancial Reporting & Regulatory Compliance Manager\n507.313.7282\nSource: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Two-For-One Stock Split",
        "subtitle": "",
        "date": "Apr 18, 2019 5:05PM EDT",
        "content": "WINONA, Minn., April 18, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST) announced today that its board of directors approved a two-for-one stock split of the Company's outstanding common stock.Holders of the Company's common stock of record at the close of business on May 2, 2019, will receive one additional share of common stock for every share of common stock they own. The stock split will take effect at the close of business on May 22, 2019.About FastenalFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines - from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on approximately 3,100 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel - all working toward Fastenal's common goal of Growth Through Customer Service®.Additional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.FAST-G\n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507.313.7282\n                  \n  \n  Source: Fastenal Company"
    },
    {
        "title": "Option-trading opportunities on Advanced Micro Devices, Fastenal Co., JPMorgan Chase, Tesla Inc., and Zayo Group",
        "subtitle": "",
        "date": "Apr 11, 2019 9:31AM EDT",
        "content": "NEW YORK, April 11, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMD, FAST, JPM, TSLA, and ZAYO.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/option-trading-opportunities-on-advanced-micro-devices-fastenal-co-jpmorgan-chase-tesla-inc-and-zayo-group-300830722.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Fastenal Company Reports 2019 First Quarter Earnings",
        "subtitle": "",
        "date": "Apr 11, 2019 6:50AM EDT",
        "content": "WINONA, Minn., April 11, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST), a leader in the wholesale distribution of industrial and construction supplies, today announced its financial results for the quarter ended March 31, 2019. Except for share and per share information, or as otherwise noted below, dollar amounts are stated in millions. Throughout this document, percentage and dollar calculations, which are based on non-rounded dollar values, may not be able to be recalculated using the dollar values included in this document due to the rounding of those dollar values.PERFORMANCE SUMMARY\n  \n\n  \n    \n      Three-month Period\n              \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                      Change\n                      \n                  Net sales\n                      $\n                      1,309.3\n                      \n                      \n                      1,185.8\n                      \n                      \n                      10.4\n                      %\n                  Business days\n                      63\n                      \n                      \n                      \n                      64\n                      \n                      \n                      \n                      \n                  Daily sales\n                      $\n                      20.8\n                      \n                      \n                      18.5\n                      \n                      \n                      12.2\n                      %\n                  Gross profit\n                      $\n                      624.7\n                      \n                      \n                      577.6\n                      \n                      \n                      8.2\n                      %\n                   % of sales\n                      47.7\n                      \n                      %\n                      \n                      48.7\n                      %\n                      \n                      \n                      \n                  Operating income\n                      $\n                      261.4\n                      \n                      \n                      234.5\n                      \n                      \n                      11.4\n                      %\n                   % of sales\n                      20.0\n                      \n                      %\n                      \n                      19.8\n                      %\n                      \n                      \n                      \n                  Earnings before income taxes\n                      $\n                      257.5\n                      \n                      \n                      231.9\n                      \n                      \n                      11.0\n                      %\n                   % of sales\n                      19.7\n                      \n                      %\n                      \n                      19.6\n                      %\n                      \n                      \n                      \n                  Net earnings\n                      $\n                      194.1\n                      \n                      \n                      174.3\n                      \n                      \n                      11.4\n                      %\n                  Diluted net earnings per share\n                      $\n                      0.68\n                      \n                      \n                      0.61\n                      \n                      \n                      11.9\n                      %\n                  \n  \n  Quarterly Results of OperationsNet sales increased $123.6, or 10.4%, in the first quarter of 2019 when compared to the first quarter of 2018. Due to the one fewer selling day in the current period, our daily sales increased 12.2% in the first quarter of 2019 when compared to the first quarter of 2018. This increase was driven by higher unit sales related primarily to continued strength in underlying market demand and contribution from our growth drivers, most notably industrial vending, Onsite locations, and construction. A lesser contributor to our sales growth in the first quarter of 2019 was higher product pricing as a result of increases implemented over the course of 2018 to mitigate the impacts of general and tariff-related inflation in the marketplace. These positive factors were slightly offset by adverse weather across many of our northern regions in both periods that created temporary disruptions in activity and reduced sales. Sales of our fastener products grew 11.8% on a daily basis over the first quarter of 2018 and represented 34.8% of sales in the first quarter of 2019. Sales of our non-fastener products grew 12.7% on a daily basis over the first quarter of 2018 and represented 65.2% of sales in the first quarter of 2019.Our gross profit, as a percentage of net sales, declined 100 basis points to 47.7% in the first quarter of 2019 from 48.7% in the first quarter of 2018. The most significant factors behind the decline in our gross profit percentage in the period were the impacts of customer and product mix and net inflation on product margins, higher freight costs, and lower net rebates reflecting our inventory control programs. Relative to the fourth quarter of 2018, our first quarter of 2019 gross profit percentage was flat with lower freight costs offset by lower net rebates.Our operating income, as a percentage of net sales, improved to 20.0% in the first quarter of 2019 from 19.8% in the first quarter of 2018. Our operating and administrative expenses (including the (gain) loss on sales of property and equipment), as a percentage of net sales, improved to 27.8% in the first quarter of 2019 compared to 28.9% in the first quarter of 2018. The primary reason for this improvement was our ability to leverage employee-related and occupancy-related expenses.Employee-related expenses, which represent 65% to 70% of total operating and administrative expenses, increased 7.1% in the first quarter of 2019 when compared to the first quarter of 2018. The increase in employee-related expenses was mainly related to: (1) an increase of 6.2% in our full-time equivalent ('FTE') headcount, (2) moderate increases in hourly base wages, (3) higher bonuses and commissions due to growth in net sales and net earnings, and (4) higher profit sharing expense. Occupancy-related expenses, which represent 15% to 20% of total operating and administrative expenses, increased 2.3%. This was primarily due to an increase of 10.9% in expenses related to industrial vending equipment, as facility costs were essentially flat, with an increase in non-branch occupancy expenses being mostly offset by a decline in branch occupancy expenses. All other operating and administrative expenses, which represent 15% to 20% of total operating and administrative expenses, increased 4.9%. This was primarily due to (1) higher spending on information technology and (2) higher expenses related to legal settlements and a bad debt write-off. Selling-related transportation costs were roughly flat year over year.Our net interest expense was $3.9 in the first quarter of 2019 compared to $2.7 in the first quarter of 2018. This increase was mainly caused by a higher average debt balance during the period and higher average interest rates.We recorded income tax expense of $63.4 in the first quarter of 2019, or 24.6% of earnings before income taxes. Income tax expense was $57.6 in the first quarter of 2018, or 24.8% of earnings before income taxes. We continue to believe our ongoing tax rate, absent any discrete tax items, will be in the 24.5% to 25.0% range.Our net earnings during the first quarter of 2019 were $194.1, an increase of 11.4% when compared to the first quarter of 2018. Our diluted net earnings per share were $0.68 during the first quarter of 2019 compared to $0.61 during the first quarter of 2018, an increase of 11.9%.Growth Driver PerformanceWe signed 5,603 industrial vending devices during the first quarter of 2019. Our installed device count on March 31, 2019 was 83,410, an increase of 13.4% over March 31, 2018. Sales through our vending devices grew at a high-teens pace in the first quarter of 2019 over the first quarter of 2018 due primarily to the increase in the installed base. These device counts do not include slightly more than 15,000 vending devices deployed as part of a lease locker program. Our goal for vending device signings in 2019 remains 23,000 to 25,000 units.We signed 105 new Onsite locations (defined as dedicated sales and service provided from within, or in close proximity to, the customer's facility) during the first quarter of 2019. We had 945 active sites on March 31, 2019, which represented an increase of 39.4% from March 31, 2018. Sales through our Onsite locations, excluding sales transferred from branches to new Onsites, grew at a better than 20% pace in the first quarter of 2019 over the first quarter of 2018. Our goal for Onsite signings in 2019 remains 375 to 400.We signed 59 new national account contracts (defined as new customer accounts with a multi-site contract) in the first quarter of 2019, and revenues attributable to national account customers represented 52.7% of our total revenues in the period. Daily sales to our national account customers grew 16.9% in the first quarter of 2019 over the first quarter of 2018.Balance Sheet and Cash FlowEffective January 1, 2019, we adopted the Financial Accounting Standards Board Accounting Standards Update 2016-02, Leases, which requires the recognition of lease assets and lease liabilities by lessees for those leases classified as operating leases under previous guidance. We have recorded operating lease right-of-use assets and operating lease liabilities and presented these values separately on our Condensed Consolidated Balance Sheet as of March 31, 2019. The adoption of this standard did not have a material impact on our Condensed Consolidated Statement of Earnings or Condensed Consolidated Statement of Cash Flows for the three-month period ended March 31, 2019.We produced operating cash flow of $204.9 in the first quarter of 2019, an increase of 28.3% from the first quarter of 2018, representing 105.6% of the period's net earnings versus 91.6% in the first quarter of 2018. The increase in our operating cash flow as a percentage of net earnings largely reflects higher net earnings and a reduced drag from working capital investment than was experienced in the first quarter of 2018. Our investment in property and equipment, net of proceeds from sales, was $52.8 in the first quarter of 2019 compared to $28.8 in the first quarter of 2018. This increase was a result of greater spending to develop or expand certain of our distribution center assets as well as to purchase vending equipment to support our growth. We continue to expect our net capital expenditures in 2019 to be within a range of $195.0 to $225.0, growth from 2018 of between $28.2 and $58.2, and 16.9% and 34.9%. This increase is a result of higher spending for property and equipment to expand our hub capacity, vending devices, and hub vehicles, with our investments in hub capacity likely to be the primary determinant of where we fall within our range.We returned $123.0 in dividends to our shareholders in the first quarter of 2019, compared to $106.4 in dividends in the first quarter of 2018. We did not repurchase any of our common stock in either period.Total debt on our balance sheet was $489.0 at the end of the first quarter of 2019, or 16.9% of total capital (the sum of stockholders' equity and total debt). This compares to $405.0, or 15.7% of total capital, at the end of the first quarter of 2018.Accounts receivable were $793.0 at the end of the first quarter of 2019, an increase of $104.4, or 15.2%, over the first quarter of 2018. This partly reflects strong sales growth, including relatively stronger growth in our national accounts and international businesses, each of which tend to have longer payment terms than our business as a whole. It also reflects the continued impact of the timing of customers' payments late in the quarter, a trend that began in the fourth quarter of 2017 and has intensified since that time period. Based on the aging of our receivables, there has been no erosion in the quality of our receivables. Inventories were $1,293.9 at the end of the first quarter of 2019, an increase of $159.0, or 14.0%, over the first quarter of 2018. We continue to see an increase in inventory related to healthy business activity, large increases in the number of installed vending devices and active Onsite locations, and inflation and tariffs. These factors were partly offset by lower purchasing as a result of our working through foreign-sourced inventory that had been accelerated into the United States in the fourth quarter of 2018 and programs intended to improve our inventory efficiency. Accounts payable were $183.9 at the end of the first quarter of 2019, an increase of $35.8, or 24.2%, from the end of the first quarter of 2018, driven by an increase in inventory demand due to sales growth.Additional InformationThe table below summarizes our total and FTE (based on 40 hours per week) employee headcount, our investments in in-market locations (defined as the sum of the total number of public branch locations and the total number of active Onsite locations), and industrial vending devices at the end of the periods presented and the percentage change compared to the end of the prior periods.\n  \n\n  \n    \n      Change Since:\n                  Change Since:\n              \n                      Q12019\n                      \n                      \n                      Q42018 (1)\n                      \n                      \n                      Q42018\n                      \n                      \n                      Q12018\n                      \n                      \n                      Q12018\n                      \n                  In-market locations - absolute employee headcount\n                      14,336\n                      \n                      \n                      14,015\n                      \n                      \n                      2.3\n                      %\n                      \n                      13,745\n                      \n                      \n                      4.3\n                      %\n                  In-market locations - FTE employee headcount\n                      12,482\n                      \n                      \n                      12,211\n                      \n                      \n                      2.2\n                      %\n                      \n                      11,878\n                      \n                      \n                      5.1\n                      %\n                  Total absolute employee headcount\n                      22,205\n                      \n                      \n                      21,644\n                      \n                      \n                      2.6\n                      %\n                      \n                      21,002\n                      \n                      \n                      5.7\n                      %\n                  Total FTE employee headcount\n                      19,125\n                      \n                      \n                      18,704\n                      \n                      \n                      2.3\n                      %\n                      \n                      18,004\n                      \n                      \n                      6.2\n                      %\n                  Number of public branch locations\n                      2,187\n                      \n                      \n                      2,227\n                      \n                      \n                      -1.8\n                      %\n                      \n                      2,329\n                      \n                      \n                      -6.1\n                      %\n                  Number of active Onsite locations\n                      945\n                      \n                      \n                      894\n                      \n                      \n                      5.7\n                      %\n                      \n                      678\n                      \n                      \n                      39.4\n                      %\n                  Number of in-market locations\n                      3,132\n                      \n                      \n                      3,121\n                      \n                      \n                      0.4\n                      %\n                      \n                      3,007\n                      \n                      \n                      4.2\n                      %\n                  Industrial vending devices (installed device count) (2)\n                      83,410\n                      \n                      \n                      81,137\n                      \n                      \n                      2.8\n                      %\n                      \n                      73,561\n                      \n                      \n                      13.4\n                      %\n                  Ratio of industrial vending devices to in-market locations\n                      27:1\n                      \n                      \n                      26:1\n                      \n                      \n                      \n                      \n                      \n                      24:1\n                      \n                      \n                      \n                      \n                  \n  \n  \n  \n\n  \n    \n       (1) \n                  In materials released on January 17, 2019 related to our fourth quarter and full year 2018 earnings results, we undercounted our total employees by 25. We corrected this in the table above.\n               (2) \n                      This number primarily represents devices which principally dispense product and produce product revenues, and excludes slightly more than 15,000 devices that are part of a locker lease program where the devices are principally used for the check-in/check-out of equipment.\n                  \n  \n  During the last twelve months, we increased our absolute employee headcount by 591 people in our in-market locations and 1,203 people in total. The increase is mostly a function of additions we have made to support customer growth in the field as well as investments in our growth drivers.We opened three branches in the first quarter of 2019 and closed 42 branches. One branch was converted from a public branch to a non-public location. We activated 66 Onsite locations in the first quarter of 2019 and closed 15. Our in-market network forms the foundation of our business strategy, and we will continue to open or close locations as is deemed necessary to sustain and improve our network, support our growth drivers, and manage our operating expenses.CONFERENCE CALL TO DISCUSS QUARTERLY RESULTSAs we previously disclosed, we will host a conference call today to review the quarterly results, as well as current operations. This conference call will be broadcast live over the Internet at 9:00 a.m., central time. To access the webcast, please go to the Fastenal Company Investor Relations Website at https://investor.fastenal.com/events.cfm.ADDITIONAL MONTHLY AND QUARTERLY INFORMATIONWe publish on the 'Investor Relations' page of our website at www.fastenal.com both our monthly consolidated net sales information and the presentation for our quarterly conference call (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter). We expect to publish the consolidated net sales information for each month, other than the third month of a quarter, at 6:00 a.m., central time, on the fourth business day of the following month. We expect to publish the consolidated net sales information for the third month of each quarter and the conference call presentation for each quarter at 6:00 a.m., central time, on the date our earnings announcement for such quarter is publicly released.ANNUAL MEETING OF SHAREHOLDERS WEBCASTOn Tuesday, April 23, 2019, we will be holding our annual meeting of shareholders at 1858 Service Drive, Winona, Minnesota. The meeting will be webcast from 10:00 a.m., central time, until the conclusion of the meeting. To access the webcast, please go to the Fastenal Company Investor Relations Website at https://investor.fastenal.com/events.cfm.FORWARD LOOKING STATEMENTSCertain statements contained in this document do not relate strictly to historical or current facts. As such, they are considered 'forward-looking statements' that provide current expectations or forecasts of future events. These forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements can be identified by the use of terminology such as anticipate, believe, should, estimate, expect, intend, may, will, plan, goal, project, hope, trend, target, opportunity, and similar words or expressions, or by references to typical outcomes. Any statement that is not a historical fact, including estimates, projections, future trends, and the outcome of events that have not yet occurred, is a forward-looking statement. Our forward-looking statements generally relate to our expectations regarding the business environment in which we operate, our projections of future performance, our perceived marketplace opportunities, our strategies, goals, mission, and vision, and our expectations about future capital expenditures, and Onsite and industrial vending signings. You should understand that forward-looking statements involve a variety of risks and uncertainties, known and unknown, and may be affected by inaccurate assumptions. Consequently, no forward-looking statement can be guaranteed and actual results may vary materially. Factors that could cause our actual results to differ from those discussed in the forward-looking statements include, but are not limited to, those detailed in our most recent annual and quarterly reports. Each forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update any such statement to reflect events or circumstances arising after such date. FAST-E\n  \n\n  \n    \n      FASTENAL COMPANY AND SUBSIDIARIES\n              Condensed Consolidated Balance Sheets\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (Amounts in millions except share information)\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                  Assets\n                      \n                      March 31,2019\n                      \n                      \n                      \n                      December 31,2018\n                      \n                  Current assets:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cash and cash equivalents\n                      \n                      $\n                      185.4\n                      \n                      \n                      167.2\n                      \n                  Trade accounts receivable, net of allowance for doubtful accounts of $11.8 and $12.8, respectively\n                      \n                      793.0\n                      \n                      \n                      \n                      714.3\n                      \n                  Inventories\n                      \n                      1,293.9\n                      \n                      \n                      \n                      1,278.7\n                      \n                  Prepaid income taxes\n                      \n                      —\n                      \n                      \n                      \n                      9.0\n                      \n                  Other current assets\n                      \n                      116.9\n                      \n                      \n                      \n                      147.0\n                      \n                  Total current assets\n                      \n                      2,389.2\n                      \n                      \n                      \n                      2,316.2\n                      \n                  Property and equipment, net\n                      \n                      943.3\n                      \n                      \n                      \n                      924.8\n                      \n                  Operating lease right-of-use assets\n                      \n                      220.9\n                      \n                      \n                      \n                      —\n                      \n                  Other assets\n                      \n                      98.4\n                      \n                      \n                      \n                      80.5\n                      \n                  Total assets\n                      \n                      $\n                      3,651.8\n                      \n                      \n                      3,321.5\n                      \n                  Liabilities and Stockholders' Equity\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Current liabilities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Current portion of debt\n                      \n                      $\n                      4.4\n                      \n                      \n                      3.0\n                      \n                  Accounts payable\n                      \n                      183.9\n                      \n                      \n                      \n                      193.6\n                      \n                  Accrued expenses\n                      \n                      232.8\n                      \n                      \n                      \n                      240.8\n                      \n                  Current portion of operating lease liabilities\n                      \n                      91.8\n                      \n                      \n                      \n                      —\n                      \n                  Income taxes payable\n                      \n                      41.7\n                      \n                      \n                      \n                      —\n                      \n                  Total current liabilities\n                      \n                      554.6\n                      \n                      \n                      \n                      437.4\n                      \n                  Long-term debt\n                      \n                      484.6\n                      \n                      \n                      \n                      497.0\n                      \n                  Operating lease liabilities\n                      \n                      130.4\n                      \n                      \n                      \n                      —\n                      \n                  Deferred income taxes\n                      \n                      85.0\n                      \n                      \n                      \n                      84.4\n                      \n                  Stockholders' equity:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Preferred stock: $0.01 par value, 5,000,000 shares authorized, no shares issued or outstanding\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                  Common stock: $0.01 par value, 400,000,000 shares authorized, 286,265,537 and 285,901,919 shares issued and outstanding, respectively\n                      \n                      2.9\n                      \n                      \n                      \n                      2.9\n                      \n                  Additional paid-in capital\n                      \n                      22.7\n                      \n                      \n                      \n                      3.0\n                      \n                  Retained earnings\n                      \n                      2,412.7\n                      \n                      \n                      \n                      2,341.6\n                      \n                  Accumulated other comprehensive loss\n                      \n                      (41.1\n                      \n                      )\n                      \n                      (44.8\n                      )\n                  Total stockholders' equity\n                      \n                      2,397.2\n                      \n                      \n                      \n                      2,302.7\n                      \n                  Total liabilities and stockholders' equity\n                      \n                      $\n                      3,651.8\n                      \n                      \n                      3,321.5\n                      \n                  \n  \n  \n  \n\n  \n    \n      FASTENAL COMPANY AND SUBSIDIARIES\n              Condensed Consolidated Statements of Earnings\n                      \n                      \n                      \n                      \n                      \n                      \n                  (Amounts in millions except earnings per share)\n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                  \n                      Three Months EndedMarch 31,\n                      \n                      \n                      \n                      \n                      \n                  \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                  Net sales\n                      $\n                      1,309.3\n                      \n                      \n                      1,185.8\n                      \n                  Cost of sales\n                      684.6\n                      \n                      \n                      \n                      608.2\n                      \n                  Gross profit\n                      624.7\n                      \n                      \n                      \n                      577.6\n                      \n                  Operating and administrative expenses\n                      363.6\n                      \n                      \n                      \n                      342.7\n                      \n                  (Gain) loss on sale of property and equipment\n                      (0.3\n                      \n                      )\n                      \n                      0.4\n                      \n                  Operating income\n                      261.4\n                      \n                      \n                      \n                      234.5\n                      \n                  Interest income\n                      0.1\n                      \n                      \n                      \n                      0.1\n                      \n                  Interest expense\n                      (4.0\n                      \n                      )\n                      \n                      (2.7\n                      )\n                  Earnings before income taxes\n                      257.5\n                      \n                      \n                      \n                      231.9\n                      \n                  Income tax expense\n                      63.4\n                      \n                      \n                      \n                      57.6\n                      \n                  Net earnings\n                      $\n                      194.1\n                      \n                      \n                      174.3\n                      \n                  Basic net earnings per share\n                      $\n                      0.68\n                      \n                      \n                      0.61\n                      \n                  Diluted net earnings per share\n                      $\n                      0.68\n                      \n                      \n                      0.61\n                      \n                  Basic weighted average shares outstanding\n                      286.1\n                      \n                      \n                      \n                      287.6\n                      \n                  Diluted weighted average shares outstanding\n                      286.5\n                      \n                      \n                      \n                      287.9\n                      \n                  \n  \n  \n  \n\n  \n    \n      FASTENAL COMPANY AND SUBSIDIARIES\n              Condensed Consolidated Statements of Cash Flows\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (Amounts in millions)\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      Three Months EndedMarch 31,\n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                  Cash flows from operating activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Net earnings\n                      \n                      $\n                      194.1\n                      \n                      \n                      174.3\n                      \n                  Adjustments to reconcile net earnings to net cash provided by operating activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Depreciation of property and equipment\n                      \n                      35.4\n                      \n                      \n                      \n                      32.4\n                      \n                  (Gain) loss on sale of property and equipment\n                      \n                      (0.3\n                      \n                      )\n                      \n                      0.4\n                      \n                  Bad debt expense\n                      \n                      2.0\n                      \n                      \n                      \n                      1.3\n                      \n                  Deferred income taxes\n                      \n                      0.6\n                      \n                      \n                      \n                      12.1\n                      \n                  Stock-based compensation\n                      \n                      1.6\n                      \n                      \n                      \n                      1.4\n                      \n                  Amortization of intangible assets\n                      \n                      1.0\n                      \n                      \n                      \n                      1.0\n                      \n                  Changes in operating assets and liabilities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Trade accounts receivable\n                      \n                      (79.5\n                      \n                      )\n                      \n                      (82.4\n                      )\n                  Inventories\n                      \n                      (13.5\n                      \n                      )\n                      \n                      (41.2\n                      )\n                  Other current assets\n                      \n                      30.1\n                      \n                      \n                      \n                      18.4\n                      \n                  Accounts payable\n                      \n                      (9.7\n                      \n                      )\n                      \n                      0.6\n                      \n                  Accrued expenses\n                      \n                      (8.0\n                      \n                      )\n                      \n                      5.7\n                      \n                  Income taxes\n                      \n                      50.7\n                      \n                      \n                      \n                      35.6\n                      \n                  Other\n                      \n                      0.4\n                      \n                      \n                      \n                      0.1\n                      \n                   Net cash provided by operating activities\n                      \n                      204.9\n                      \n                      \n                      \n                      159.7\n                      \n                  Cash flows from investing activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Purchases of property and equipment\n                      \n                      (54.4\n                      \n                      )\n                      \n                      (31.5\n                      )\n                  Proceeds from sale of property and equipment\n                      \n                      1.6\n                      \n                      \n                      \n                      2.7\n                      \n                  Other\n                      \n                      0.1\n                      \n                      \n                      \n                      (0.1\n                      )\n                   Net cash used in investing activities\n                      \n                      (52.7\n                      \n                      )\n                      \n                      (28.9\n                      )\n                  Cash flows from financing activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Proceeds from debt obligations\n                      \n                      210.0\n                      \n                      \n                      \n                      180.0\n                      \n                  Payments against debt obligations\n                      \n                      (240.0\n                      \n                      )\n                      \n                      (190.0\n                      )\n                  Proceeds from exercise of stock options\n                      \n                      18.1\n                      \n                      \n                      \n                      3.8\n                      \n                  Payments of dividends\n                      \n                      (123.0\n                      \n                      )\n                      \n                      (106.4\n                      )\n                   Net cash used in financing activities\n                      \n                      (134.9\n                      \n                      )\n                      \n                      (112.6\n                      )\n                  Effect of exchange rate changes on cash and cash equivalents\n                      \n                      0.9\n                      \n                      \n                      \n                      2.0\n                      \n                   Net increase in cash and cash equivalents\n                      \n                      18.2\n                      \n                      \n                      \n                      20.2\n                      \n                  Cash and cash equivalents at beginning of period\n                      \n                      167.2\n                      \n                      \n                      \n                      116.9\n                      \n                  Cash and cash equivalents at end of period\n                      \n                      $\n                      185.4\n                      \n                      \n                      137.1\n                      \n                  Supplemental disclosure of cash flow information:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cash paid for interest\n                      \n                      $\n                      4.0\n                      \n                      \n                      2.7\n                      \n                  Net cash paid for income taxes\n                      \n                      $\n                      11.7\n                      \n                      \n                      9.6\n                      \n                  \n  \n  \n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507-313-7282\n                  \n  \n  Source: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Cash Dividend",
        "subtitle": "",
        "date": "Apr 10, 2019 5:05PM EDT",
        "content": "WINONA, Minn., April 10, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST) reported its board of directors declared a dividend of $0.43 per share to be paid in cash on May 22, 2019 to shareholders of record at the close of business on April 24, 2019. Except for share and per share information, dollar amounts are stated in millions.Fastenal began paying annual dividends in 1991, semi-annual dividends in 2003, and then expanded to quarterly dividends in 2011. Our board of directors intends to continue paying quarterly dividends, provided that any future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors, such as income tax rates related to dividends.In 2019, 2018, and 2017, we paid (or declared) dividends as follows:\n  \n\n  \n    \n      Year\n                  FirstQuarter\n                  SecondQuarter\n                  ThirdQuarter\n                  FourthQuarter\n              2019\n                      $\n                      0.43\n                      $\n                      0.43\n                      \n                      \n                      \n                      \n                  2018\n                      $\n                      0.37\n                      $\n                      0.37\n                      $\n                      0.40\n                      $\n                      0.40\n                  2017\n                      $\n                      0.32\n                      $\n                      0.32\n                      $\n                      0.32\n                      $\n                      0.32\n                  \n  \n  Dividend and common stock purchase activity during the last ten years:\n  \n\n  \n    \n       Average Per\n              \n                      \n                      \n                      Total\n                      \n                      \n                      Dividends per Share \n                      \n                      \n                      \n                      \n                      \n                      Total Value of\n                      Total Number\n                      \n                      \n                      Share Price of\n                  \n                      Dividend\n                      \n                      Dividends\n                      \n                      \n                      Regular\n                      \n                      \n                       Total\n                      \n                      \n                      Common Stock\n                      of Shares\n                      \n                      \n                      Common Stock\n                  Year\n                      Payments\n                      \n                      Paid\n                      \n                      \n                      Dividend\n                      \n                      \n                      Dividend\n                      \n                      \n                      Purchased\n                      Purchased\n                      \n                      \n                      Purchased\n                  2019\n                      Two (1)\n                      $\n                      246.1\n                      \n                      $\n                      0.86\n                      \n                      $\n                      0.86\n                      \n                      $\n                      —\n                      —\n                      \n                      $\n                      —\n                  2018\n                      Four\n                      $\n                      441.9\n                      \n                      $\n                      1.54\n                      \n                      $\n                      1.54\n                      \n                      $\n                      103.0\n                      2,000,000\n                      \n                      $\n                      51.50\n                  2017\n                      Four\n                      $\n                      369.1\n                      \n                      $\n                      1.28\n                      \n                      $\n                      1.28\n                      \n                      $\n                      82.6\n                      1,900,000\n                      \n                      $\n                      43.43\n                  2016\n                      Four\n                      $\n                      346.6\n                      \n                      $\n                      1.20\n                      \n                      $\n                      1.20\n                      \n                      $\n                      59.5\n                      1,600,000\n                      \n                      $\n                      37.15\n                  2015\n                      Four\n                      $\n                      327.1\n                      \n                      $\n                      1.12\n                      \n                      $\n                      1.12\n                      \n                      $\n                      293.0\n                      7,100,000\n                      \n                      $\n                      41.26\n                  2014\n                      Four\n                      $\n                      296.6\n                      \n                      $\n                      1.00\n                      \n                      $\n                      1.00\n                      \n                      $\n                      52.9\n                      1,200,000\n                      \n                      $\n                      44.12\n                  2013\n                      Four\n                      $\n                      237.5\n                      \n                      $\n                      0.80\n                      \n                      $\n                      0.80\n                      \n                      $\n                      9.1\n                      200,000\n                      \n                      $\n                      45.40\n                  2012\n                      Five(2)\n                      $\n                      367.3\n                      \n                      $\n                      0.74\n                      \n                      $\n                      1.24\n                      \n                      $\n                      —\n                      —\n                      \n                      $\n                      —\n                  2011\n                      Four\n                      $\n                      191.7\n                      \n                      $\n                      0.65\n                      \n                      $\n                      0.65\n                      \n                      $\n                      —\n                      —\n                      \n                      $\n                      —\n                  2010\n                      Three(2)\n                      $\n                      182.8\n                      \n                      $\n                      0.41\n                      \n                      $\n                      0.62\n                      \n                      $\n                      —\n                      —\n                      \n                      $\n                      —\n                  Ten Year Total\n                      \n                      $\n                      3,006.7\n                      \n                      $\n                      9.60\n                      \n                      $\n                      10.31\n                      \n                      $\n                      600.1\n                      14,000,000\n                      \n                      $\n                      42.86\n                  \n  \n  (1) The total dividends paid amount includes the estimated impact from this announcement. The estimate is calculated using the 286.3 million shares outstanding at March 31, 2019.(2) There was a supplemental dividend paid in December 2012 and 2010.All share and per share information reflects the two-for-one stock split in 2011.About FastenalFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines - from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on approximately 3,100 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel - all working toward Fastenal's common goal of Growth Through Customer Service®.Additional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.This press release contains statements that are not historical in nature and that are intended to be, and are hereby identified as, \"forward looking statements\" as defined in the Private Securities Litigation Reform Act of 1995, including a statement regarding expectations as to payment of a quarterly cash dividend in the foreseeable future. Any future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors. For example, a change in business needs including working capital and funding for acquisitions, or a change in income tax law relating to dividends, could cause the company to decide not to pay a dividend in the future. A discussion of other risks and uncertainties is included in the company's filings with the SEC, including our most recent annual and quarterly reports. FAST-D\n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507.313.7282\n                  \n  \n  Source: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Conference Call to Review 2019 First Quarter Earnings",
        "subtitle": "",
        "date": "Mar 26, 2019 5:05PM EDT",
        "content": "WINONA, Minn., March 26, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST) announced the date and time for its conference call to review 2019 first quarter results, as well as current operations. The conference call will be broadcast live over the Internet on Thursday, April 11, 2019 at 9:00 a.m. central time.To access the call, please visit the following Web address:https://investor.fastenal.com/events.cfmOur conference call presentation (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter) will be available at 6:00 a.m., central time, on the day of the conference call. To access the presentation, please visit the following Web address: https://investor.fastenal.com/releases.cfmAn online archive of the broadcast will be available within one hour of the conclusion of the call and will remain available until June 1, 2019. Participants must have a soundcard and speakers to listen to the online broadcast.About FastenalFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product lines - from fasteners and tools to safety and janitorial supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on approximately 3,100 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel - all working toward Fastenal's common goal of Growth Through Customer Service®.Additional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.FAST-G\n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507.313.7282\n                  \n  \n  Source: Fastenal Company"
    },
    {
        "title": "Fastenal Company Reports 2018 Annual and Fourth Quarter Earnings",
        "subtitle": "",
        "date": "Jan 17, 2019 6:50AM EST",
        "content": "WINONA, Minn., Jan. 17, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST), a leader in the wholesale distribution of industrial and construction supplies, today announced its financial results for the quarter and year ended December 31, 2018. Except for share and per share information, or as otherwise noted below, dollar amounts are stated in millions. Throughout this document, percentage and dollar calculations, which are based on non-rounded dollar values, may not be able to be recalculated using the dollar values included in this document due to the rounding of those dollar values.PERFORMANCE SUMMARY\n  \n\n  \n    \n      Twelve-month Period\n                  Three-month Period\n              \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                      \n                      Change\n                      \n                      \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                      \n                      Change\n                      \n                  Net sales\n                      $\n                      4,965.1\n                      \n                      \n                      4,390.5\n                      \n                      \n                      13.1\n                      %\n                      \n                      $\n                      1,231.6\n                      \n                      \n                      1,088.5\n                      \n                      \n                      13.2\n                      %\n                  Business days\n                      254\n                      \n                      \n                      \n                      254\n                      \n                      \n                      \n                      \n                      \n                      63\n                      \n                      \n                      \n                      63\n                      \n                      \n                      \n                      \n                  Daily sales\n                      $\n                      19.5\n                      \n                      \n                      17.3\n                      \n                      \n                      13.1\n                      %\n                      \n                      $\n                      19.6\n                      \n                      \n                      17.3\n                      \n                      \n                      13.2\n                      %\n                  Gross profit\n                      $\n                      2,398.9\n                      \n                      \n                      2,163.6\n                      \n                      \n                      10.9\n                      %\n                      \n                      $\n                      587.8\n                      \n                      \n                      531.2\n                      \n                      \n                      10.6\n                      %\n                   % of sales\n                      48.3\n                      \n                      %\n                      \n                      49.3\n                      %\n                      \n                      \n                      \n                      \n                      47.7\n                      \n                      %\n                      \n                      48.8\n                      %\n                      \n                      \n                      \n                  Operating income\n                      $\n                      999.2\n                      \n                      \n                      881.8\n                      \n                      \n                      13.3\n                      %\n                      \n                      $\n                      233.4\n                      \n                      \n                      203.3\n                      \n                      \n                      14.8\n                      %\n                   % of sales\n                      20.1\n                      \n                      %\n                      \n                      20.1\n                      %\n                      \n                      \n                      \n                      \n                      19.0\n                      \n                      %\n                      \n                      18.7\n                      %\n                      \n                      \n                      \n                  Earnings before income taxes\n                      $\n                      987.0\n                      \n                      \n                      873.1\n                      \n                      \n                      13.0\n                      %\n                      \n                      $\n                      229.8\n                      \n                      \n                      200.8\n                      \n                      \n                      14.4\n                      %\n                   % of sales\n                      19.9\n                      \n                      %\n                      \n                      19.9\n                      %\n                      \n                      \n                      \n                      \n                      18.7\n                      \n                      %\n                      \n                      18.5\n                      %\n                      \n                      \n                      \n                  Net earnings\n                      $\n                      751.9\n                      \n                      \n                      578.6\n                      \n                      \n                      29.9\n                      %\n                      \n                      $\n                      168.8\n                      \n                      \n                      152.4\n                      \n                      \n                      10.7\n                      %\n                  Diluted net earnings per share\n                      $\n                      2.62\n                      \n                      \n                      2.01\n                      \n                      \n                      30.5\n                      %\n                      \n                      $\n                      0.59\n                      \n                      \n                      0.53\n                      \n                      \n                      11.2\n                      %\n                  \n  \n  Quarterly Results of OperationsNet sales increased $143.2, or 13.2%, from the fourth quarter of 2017 to the fourth quarter of 2018. This increase was driven by higher unit sales related primarily to continued strength in underlying market demand and contribution from our growth drivers, most notably industrial vending and Onsite locations. A lesser contributor to our sales growth in the fourth quarter of 2018 was higher product pricing as a result of increases over the course of 2018 to mitigate inflation in the marketplace. Sales of our fastener products grew 11.3% on a daily basis and represented 34.4% of sales in the fourth quarter of 2018. Sales of our non-fastener products grew 14.6% on a daily basis and represented 65.6% of sales in the fourth quarter of 2018.Our gross profit, as a percentage of net sales, declined 110 basis points to 47.7% in the fourth quarter of 2018 from 48.8% in the fourth quarter of 2017. The most significant factors behind the decline in our gross profit percentage in the period were the net impact of inflation and the impact of customer and product mix on product margins, and higher freight costs, with these unfavorable factors only partly offset by favorable net rebates. Relative to the third quarter of 2018, our fourth quarter of 2018 gross profit percentage declined 40 basis points from 48.1%. The same factors that produced the decline in gross margin in the fourth quarter of 2018 from the fourth quarter of 2017 drove the decrease in gross margin in the fourth quarter of 2018 from the third quarter of 2018.Our operating income, as a percentage of net sales, improved to 19.0% in the fourth quarter of 2018 from 18.7% in the fourth quarter of 2017. Our operating and administrative expenses (including the loss on sales of property and equipment), as a percentage of net sales, improved to 28.8% in the fourth quarter of 2018 compared to 30.1% in the fourth quarter of 2017. The primary reason for this improvement was our ability to leverage employee-related, occupancy-related, and other operating and administrative expenses.Employee-related expenses, which represent 65% to 70% of total operating and administrative expenses, increased 10.0% in the fourth quarter of 2018 when compared to the fourth quarter of 2017. The increase in employee-related expenses was mainly related to: (1) higher bonuses and commissions due to growth in net sales and net earnings, (2) an increase of 6.6% in our full-time equivalent ('FTE') headcount, (3) moderate increases in hourly base wages, and (4) higher profit sharing expense. Occupancy-related expenses, which represent 15% to 20% of total operating and administrative expenses, increased 7.2%. This was primarily due to an increase of 24.0% in expenses related to industrial vending equipment, as facility costs rose just slightly, with a decline in branch expenses only partly offsetting an increase in non-branch expenses. All other operating and administrative expenses, which represent 15% to 20% of total operating and administrative expenses, increased 0.5%. This was primarily due to (1) higher spending on information technology and (2) higher selling-related transportation costs resulting from higher vehicle expenses and fuel prices, though the impact of the latter has moderated versus previous quarters. These factors were partly offset by a modest decline in general corporate expenses.Our net interest expense was $3.6 in the fourth quarter of 2018 compared to $2.5 in the fourth quarter of 2017. This increase was mainly caused by a higher average debt balance during the period and higher average interest rates.We recorded income tax expense of $61.0 in the fourth quarter of 2018, or 26.6% of earnings before income taxes. This reflects primarily two items: (1) the impacts of the tax legislation commonly referred to as the Tax Cuts and Jobs Act (the 'Tax Act') resulted in a lower tax rate beginning in the first quarter of 2018, and (2) the impact of a discrete expense of approximately $3.2 related to the impact of the change in our tax rate on inter-entity transactions. Excluding this discrete expense, our fourth quarter of 2018 tax rate would have been 25.2%. Income tax expense was $48.4 in the fourth quarter of 2017, or 24.1% of earnings before income taxes, which reflected a net discrete gain of approximately $24.4 related to certain provisions of the Tax Act. Excluding this discrete benefit, our tax rate for the fourth quarter of 2017 would have been 36.2%. The accounting for the income tax effects of the Tax Act was completed as of December 31, 2018. We continue to believe our ongoing tax rate, absent any discrete tax items, will be in the 24.5% to 25.0% range.Our net earnings during the fourth quarter of 2018 were $168.8, an increase of 10.7% when compared to the fourth quarter of 2017. Our diluted net earnings per share were $0.59 during the fourth quarter of 2018 compared to $0.53 during the fourth quarter of 2017, an increase of 11.2%. Both periods were affected by discrete tax items, as described in the preceding paragraph. Excluding these items, our diluted net earnings per share would have been $0.60 during the fourth quarter of 2018 compared to $0.45 in the fourth quarter of 2017, an increase of 34.9%.Growth Driver PerformanceWe signed 4,980 industrial vending devices during the fourth quarter of 2018, an increase of 16.7% compared to the fourth quarter of 2017, and signed 22,073 industrial vending devices in 2018, an increase of 14.0% compared to 2017. Our installed device count on December 31, 2018 was 81,137, an increase of 13.6% over December 31, 2017. Sales through our vending devices continued to grow at a pace of over 20% in the fourth quarter of 2018 due to the increase in the installed base, and to a lesser degree, an increase in revenue per device. These device counts do not include approximately 15,000 vending devices deployed as part of a lease locker program. Our goal for vending device signings in 2019 is 23,000 to 25,000 units.We signed 67 new Onsite locations (defined as dedicated sales and service provided from within, or in close proximity to, the customer's facility) during the fourth quarter of 2018 compared to 57 signings in the fourth quarter of 2017, an increase of 17.5%. We signed 336 new Onsite locations in 2018 compared to 270 signings in 2017, an increase of 24.4%. We had 894 active sites on December 31, 2018, which represented an increase of 47.8% from December 31, 2017. Our goal for Onsite signings in 2019 is 375 to 400.We signed 32 new national account contracts (defined as new customer accounts with a multi-site contract) in the fourth quarter of 2018, and revenues attributable to national account customers represented 52.4% of our total revenues in the period. Daily sales to our national account customers grew 18.1% in the fourth quarter of 2018 over the fourth quarter of 2017.Balance Sheet and Cash FlowWe produced operating cash flow of $674.2 in 2018, an increase of 15.2% from 2017, and representing 89.7% of the period's net earnings versus 101.1% in 2017. The decline in our operating cash flow as a percentage of net earnings largely reflects working capital trends as further described below. Operating cash flow as a percentage of net earnings was 105.5% in the fourth quarter of 2018 versus 84.8% in the fourth quarter of 2017. We invested $166.8 for property and equipment, net of proceeds from sales, in 2018 compared to $112.5 in 2017 and compared to the $152.0 we anticipated spending at the end of the third quarter of 2018. The increase for the year was primarily driven by higher spending to expand or upgrade our current distribution centers, on property for future hub development, and on vending equipment, while the increase from the third quarter of 2018 reflected an opportunistic purchase of property for future hub development. We expect our net capital expenditures in 2019 to be within a range of $195.0 to $225.0, growth from 2018 of between $28.2 and $58.2, and 16.9% and 34.9%. This increase is a result of higher spending for property and equipment to expand our hub capacity, vending devices, and hub vehicles, with our investments in hub capacity likely to be the primary determinant of where we fall within our range.We returned $544.9 to our shareholders in 2018 (in the form of dividends of $441.9 and common stock purchases of $103.0), compared to $451.7 in 2017 (in the form of dividends of $369.1 and common stock purchases of $82.6).Total debt on our balance sheet was $500.0 at the end of 2018, or 17.8% of total capital (the sum of stockholders' equity and total debt). This compares to $415.0, or 16.5% of total capital, at the end of 2017.Accounts receivable were $714.3 at the end of 2018, an increase of $106.4, or 17.5%, over the end of 2017. This partly reflects strong sales growth, including relatively stronger growth in our national accounts and our international businesses, each of which tend to have longer payment terms than our business as a whole. It also partly reflects the continued impact of the timing of customers' payments late in the quarter, a trend that began in the fourth quarter of 2017 and has intensified throughout the full year and fourth quarter of 2018. Based on the ratio of past due receivables as a percentage of the total, there has been no erosion in the quality of our receivables. Inventories were $1,278.7 at the end of 2018, an increase of $185.8, or 17.0%, over the end of 2017. Our internal expectations were to grow inventory at a high single digit rate in 2018 to support our sales growth deriving both from healthy business activity and the large increase in the number of installed vending devices and active Onsite locations. Conditions in the last six months of 2018, and particularly in the fourth quarter of 2018, caused us not to achieve this goal. Those conditions included the impact of inflation and tariffs as well as an accelerated receipt of certain overseas shipments ahead of an anticipated increase in tariff rates on Chinese-sourced products. Accounts payable were $193.6 at the end of 2018, an increase of $46.0, or 31.2%, from the end of 2017, driven by an increase in inventory demand due to sales growth.Additional InformationThe table below summarizes our total and FTE (based on 40 hours per week) employee headcount, our investments in in-market locations (defined as the sum of the total number of public branch locations and the total number of active Onsite locations), and industrial vending devices at the end of the periods presented and the percentage change compared to the end of the prior periods.\n  \n\n  \n    \n      Q42018\n                  Q42017\n                  % Change\n              In-market locations - absolute employee headcount\n                      14,015\n                      \n                      \n                      13,424\n                      \n                      \n                      4.4\n                      %\n                      \n                  In-market locations - FTE employee headcount\n                      12,211\n                      \n                      \n                      11,549\n                      \n                      \n                      5.7\n                      %\n                      \n                  Total absolute employee headcount\n                      21,619\n                      \n                      \n                      20,565\n                      \n                      \n                      5.1\n                      %\n                      \n                  Total FTE employee headcount\n                      18,678\n                      \n                      \n                      17,519\n                      \n                      \n                      6.6\n                      %\n                      \n                  Number of public branch locations\n                      2,227\n                      \n                      \n                      2,383\n                      \n                      \n                      -6.5\n                      %\n                      \n                  Number of active Onsite locations\n                      894\n                      \n                      \n                      605\n                      \n                      \n                      47.8\n                      %\n                      \n                  Number of in-market locations\n                      3,121\n                      \n                      \n                      2,988\n                      \n                      \n                      4.5\n                      %\n                      \n                  Industrial vending devices (installed device count) (1)\n                      81,137\n                      \n                      \n                      71,421\n                      \n                      \n                      13.6\n                      %\n                      \n                  Ratio of industrial vending devices to in-market locations\n                      26:1\n                      \n                      \n                      24:1\n                      \n                      \n                      \n                      \n                      \n                  \n  \n  (1) This number primarily represents devices which principally dispense product and produce product revenues, and excludes approximately 15,000 devices that are part of a locker lease program where the devices are principally used for the check-in/check-out of equipment.During the last twelve months, we increased our absolute employee headcount by 591 people in our in-market locations and 1,054 people in total. The increase is mostly a function of additions we have made to support customer growth in the field as well as investments in our growth drivers.We opened three branches in the fourth quarter of 2018 and closed 35 branches. Additionally, two branches were converted from a public branch to a non-public location. For the full year of 2018, we opened 11 branches and closed 157 branches, with 10 branches being converted from a public branch to a non-public location. Our in-market network forms the foundation of our business strategy, and we will continue to open or close locations as is deemed necessary to sustain and improve our network, support our growth drivers, and manage our operating expenses.CONFERENCE CALL TO DISCUSS QUARTERLY RESULTSAs we previously disclosed, we will host a conference call today to review the annual and quarterly results, as well as current operations. This conference call will be broadcast live over the Internet at 9:00 a.m., central time. To access the webcast, please go to the Fastenal Company Investor Relations Website at https://investor.fastenal.com/events.cfm.ADDITIONAL MONTHLY AND QUARTERLY INFORMATIONWe publish on the 'Investor Relations' page of our website at www.fastenal.com both our monthly consolidated net sales information and the presentation for our quarterly conference call (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter). We expect to publish the consolidated net sales information for each month, other than the third month of a quarter, at 6:00 a.m., central time, on the fourth business day of the following month. We expect to publish the consolidated net sales information for the third month of each quarter and the conference call presentation for each quarter at 6:00 a.m., central time, on the date our earnings announcement for such quarter is publicly released.FORWARD LOOKING STATEMENTSCertain statements contained in this document do not relate strictly to historical or current facts. As such, they are considered 'forward-looking statements' that provide current expectations or forecasts of future events. These forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements can be identified by the use of terminology such as anticipate, believe, should, estimate, expect, intend, may, will, plan, goal, project, hope, trend, target, opportunity, and similar words or expressions, or by references to typical outcomes. Any statement that is not a historical fact, including estimates, projections, future trends, and the outcome of events that have not yet occurred, is a forward-looking statement. Our forward-looking statements generally relate to our expectations regarding the business environment in which we operate, our projections of future performance, our perceived marketplace opportunities, our strategies, goals, mission, and vision, and our expectations about future capital expenditures, and Onsite and industrial vending signings. You should understand that forward-looking statements involve a variety of risks and uncertainties, known and unknown, and may be affected by inaccurate assumptions. Consequently, no forward-looking statement can be guaranteed and actual results may vary materially. Factors that could cause our actual results to differ from those discussed in the forward-looking statements include, but are not limited to, those detailed in our most recent annual and quarterly reports. Each forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update any such statement to reflect events or circumstances arising after such date. FAST-E\n  \n\n  \n    \n      FASTENAL COMPANY AND SUBSIDIARIES\n              Condensed Consolidated Balance Sheets\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (Amounts in millions except share information)\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      December 31,2018\n                      \n                      \n                      \n                      December 31,2017\n                      \n                  Assets\n                      \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                  Current assets:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cash and cash equivalents\n                      \n                      $\n                      167.2\n                      \n                      \n                      116.9\n                      \n                  Trade accounts receivable, net of allowance for doubtful accounts of $12.8 and $11.9, respectively\n                      \n                      714.3\n                      \n                      \n                      \n                      607.8\n                      \n                  Inventories\n                      \n                      1,278.7\n                      \n                      \n                      \n                      1,092.9\n                      \n                  Prepaid income taxes\n                      \n                      9.0\n                      \n                      \n                      \n                      —\n                      \n                  Other current assets\n                      \n                      147.0\n                      \n                      \n                      \n                      118.1\n                      \n                  Total current assets\n                      \n                      2,316.2\n                      \n                      \n                      \n                      1,935.7\n                      \n                  Property and equipment, net\n                      \n                      924.8\n                      \n                      \n                      \n                      893.6\n                      \n                  Other assets\n                      \n                      80.5\n                      \n                      \n                      \n                      81.2\n                      \n                  Total assets\n                      \n                      $\n                      3,321.5\n                      \n                      \n                      2,910.5\n                      \n                  Liabilities and Stockholders' Equity\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Current liabilities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Current portion of debt\n                      \n                      $\n                      3.0\n                      \n                      \n                      3.0\n                      \n                  Accounts payable\n                      \n                      193.6\n                      \n                      \n                      \n                      147.5\n                      \n                  Accrued expenses\n                      \n                      240.8\n                      \n                      \n                      \n                      194.0\n                      \n                  Income taxes payable\n                      \n                      —\n                      \n                      \n                      \n                      6.5\n                      \n                  Total current liabilities\n                      \n                      437.4\n                      \n                      \n                      \n                      351.0\n                      \n                  Long-term debt\n                      \n                      497.0\n                      \n                      \n                      \n                      412.0\n                      \n                  Deferred income taxes\n                      \n                      84.4\n                      \n                      \n                      \n                      50.6\n                      \n                  Stockholders' equity:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Preferred stock: $0.01 par value, 5,000,000 shares authorized, no shares issued or outstanding\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                  Common stock: $0.01 par value, 400,000,000 shares authorized, 285,901,919 and 287,591,536 shares issued and outstanding, respectively\n                      \n                      2.9\n                      \n                      \n                      \n                      2.9\n                      \n                  Additional paid-in capital\n                      \n                      3.0\n                      \n                      \n                      \n                      8.5\n                      \n                  Retained earnings\n                      \n                      2,341.6\n                      \n                      \n                      \n                      2,110.6\n                      \n                  Accumulated other comprehensive loss\n                      \n                      (44.8\n                      \n                      )\n                      \n                      (25.1\n                      )\n                  Total stockholders' equity\n                      \n                      2,302.7\n                      \n                      \n                      \n                      2,096.9\n                      \n                  Total liabilities and stockholders' equity\n                      \n                      $\n                      3,321.5\n                      \n                      \n                      2,910.5\n                      \n                  \n  \n  \n  \n\n  \n    \n      FASTENAL COMPANY AND SUBSIDIARIES\n              Condensed Consolidated Statements of Earnings\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (Amounts in millions except earnings per share)\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      Year EndedDecember 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                      Three Months EndedDecember 31,\n                      \n                      \n                      \n                      \n                      \n                  \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                      \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                  \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                      \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                  Net sales\n                      $\n                      4,965.1\n                      \n                      \n                      4,390.5\n                      \n                      \n                      $\n                      1,231.6\n                      \n                      \n                      1,088.5\n                      \n                  Cost of sales\n                      2,566.2\n                      \n                      \n                      \n                      2,226.9\n                      \n                      \n                      643.8\n                      \n                      \n                      \n                      557.3\n                      \n                  Gross profit\n                      2,398.9\n                      \n                      \n                      \n                      2,163.6\n                      \n                      \n                      587.8\n                      \n                      \n                      \n                      531.2\n                      \n                  Operating and administrative expenses\n                      1,400.2\n                      \n                      \n                      \n                      1,282.8\n                      \n                      \n                      354.4\n                      \n                      \n                      \n                      327.8\n                      \n                  (Gain) loss on sale of property and equipment\n                      (0.5\n                      \n                      )\n                      \n                      (1.0\n                      )\n                      \n                      0.0\n                      \n                      \n                      \n                      0.1\n                      \n                  Operating income\n                      999.2\n                      \n                      \n                      \n                      881.8\n                      \n                      \n                      233.4\n                      \n                      \n                      \n                      203.3\n                      \n                  Interest income\n                      0.4\n                      \n                      \n                      \n                      0.4\n                      \n                      \n                      0.1\n                      \n                      \n                      \n                      0.1\n                      \n                  Interest expense\n                      (12.6\n                      \n                      )\n                      \n                      (9.1\n                      )\n                      \n                      (3.7\n                      \n                      )\n                      \n                      (2.6\n                      )\n                  Earnings before income taxes\n                      987.0\n                      \n                      \n                      \n                      873.1\n                      \n                      \n                      229.8\n                      \n                      \n                      \n                      200.8\n                      \n                  Income tax expense\n                      235.1\n                      \n                      \n                      \n                      294.5\n                      \n                      \n                      61.0\n                      \n                      \n                      \n                      48.4\n                      \n                  Net earnings\n                      $\n                      751.9\n                      \n                      \n                      578.6\n                      \n                      \n                      $\n                      168.8\n                      \n                      \n                      152.4\n                      \n                  Basic net earnings per share\n                      $\n                      2.62\n                      \n                      \n                      2.01\n                      \n                      \n                      $\n                      0.59\n                      \n                      \n                      0.53\n                      \n                  Diluted net earnings per share\n                      $\n                      2.62\n                      \n                      \n                      2.01\n                      \n                      \n                      $\n                      0.59\n                      \n                      \n                      0.53\n                      \n                  Basic weighted average shares outstanding\n                      287.0\n                      \n                      \n                      \n                      288.2\n                      \n                      \n                      286.1\n                      \n                      \n                      \n                      287.5\n                      \n                  Diluted weighted average shares outstanding\n                      287.2\n                      \n                      \n                      \n                      288.3\n                      \n                      \n                      286.3\n                      \n                      \n                      \n                      287.6\n                      \n                  \n  \n  \n  \n\n  \n    \n      FASTENAL COMPANY AND SUBSIDIARIES\n              Condensed Consolidated Statements of Cash Flows\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (Amounts in millions)\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      Year Ended December 31,\n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                  \n                      \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                  Cash flows from operating activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Net earnings\n                      \n                      $\n                      751.9\n                      \n                      \n                      578.6\n                      \n                  Adjustments to reconcile net earnings to net cash provided by operating activities, net of acquisitions:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Depreciation of property and equipment\n                      \n                      134.1\n                      \n                      \n                      \n                      123.6\n                      \n                  Gain on sale of property and equipment\n                      \n                      (0.5\n                      \n                      )\n                      \n                      (1.0\n                      )\n                  Bad debt expense\n                      \n                      8.1\n                      \n                      \n                      \n                      8.2\n                      \n                  Deferred income taxes\n                      \n                      33.8\n                      \n                      \n                      \n                      (30.0\n                      )\n                  Stock-based compensation\n                      \n                      5.1\n                      \n                      \n                      \n                      5.2\n                      \n                  Amortization of intangible assets\n                      \n                      4.1\n                      \n                      \n                      \n                      3.8\n                      \n                  Changes in operating assets and liabilities, net of acquisitions:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Trade accounts receivable\n                      \n                      (120.3\n                      \n                      )\n                      \n                      (103.7\n                      )\n                  Inventories\n                      \n                      (193.3\n                      \n                      )\n                      \n                      (76.3\n                      )\n                  Other current assets\n                      \n                      (28.9\n                      \n                      )\n                      \n                      (15.6\n                      )\n                  Accounts payable\n                      \n                      46.1\n                      \n                      \n                      \n                      36.3\n                      \n                  Accrued expenses\n                      \n                      46.8\n                      \n                      \n                      \n                      37.6\n                      \n                  Income taxes\n                      \n                      (15.5\n                      \n                      )\n                      \n                      19.4\n                      \n                  Other\n                      \n                      2.7\n                      \n                      \n                      \n                      (0.9\n                      )\n                  Net cash provided by operating activities\n                      \n                      674.2\n                      \n                      \n                      \n                      585.2\n                      \n                  Cash flows from investing activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Purchases of property and equipment\n                      \n                      (176.3\n                      \n                      )\n                      \n                      (119.9\n                      )\n                  Proceeds from sale of property and equipment\n                      \n                      9.5\n                      \n                      \n                      \n                      7.4\n                      \n                  Cash paid for acquisitions\n                      \n                      (3.7\n                      \n                      )\n                      \n                      (58.7\n                      )\n                  Other\n                      \n                      (3.4\n                      \n                      )\n                      \n                      (8.1\n                      )\n                  Net cash used in investing activities\n                      \n                      (173.9\n                      \n                      )\n                      \n                      (179.3\n                      )\n                  Cash flows from financing activities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Proceeds from debt obligations\n                      \n                      980.0\n                      \n                      \n                      \n                      1,015.0\n                      \n                  Payments against debt obligations\n                      \n                      (895.0\n                      \n                      )\n                      \n                      (980.0\n                      )\n                  Proceeds from exercise of stock options\n                      \n                      13.4\n                      \n                      \n                      \n                      9.5\n                      \n                  Purchases of common stock\n                      \n                      (103.0\n                      \n                      )\n                      \n                      (82.6\n                      )\n                  Payments of dividends\n                      \n                      (441.9\n                      \n                      )\n                      \n                      (369.1\n                      )\n                  Net cash used in financing activities\n                      \n                      (446.5\n                      \n                      )\n                      \n                      (407.2\n                      )\n                  Effect of exchange rate changes on cash and cash equivalents\n                      \n                      (3.5\n                      \n                      )\n                      \n                      5.5\n                      \n                  Net increase in cash and cash equivalents\n                      \n                      50.3\n                      \n                      \n                      \n                      4.2\n                      \n                  Cash and cash equivalents at beginning of year\n                      \n                      116.9\n                      \n                      \n                      \n                      112.7\n                      \n                  Cash and cash equivalents at end of year\n                      \n                      $\n                      167.2\n                      \n                      \n                      116.9\n                      \n                  Supplemental disclosure of cash flow information:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cash paid for interest\n                      \n                      $\n                      12.6\n                      \n                      \n                      8.7\n                      \n                  Net cash paid for income taxes\n                      \n                      $\n                      215.3\n                      \n                      \n                      304.1\n                      \n                  \n  \n  \n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507-313-7282\n                  \n  \n  Source: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Cash Dividend",
        "subtitle": "",
        "date": "Jan 16, 2019 5:05PM EST",
        "content": "WINONA, Minn., Jan. 16, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST) reported its board of directors declared a dividend of $0.43 per share to be paid in cash on February 27, 2019 to shareholders of record at the close of business on January 31, 2019. Except for share and per share information, dollar amounts are stated in millions.Fastenal began paying annual dividends in 1991, semi-annual dividends in 2003, and then expanded to quarterly dividends in 2011. Our board of directors intends to continue paying quarterly dividends, provided that any future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors, such as income tax rates related to dividends.In 2019, 2018, and 2017, we paid (or declared) dividends as follows:\n  \n\n  \n    \n      Year\n                  FirstQuarter\n                  SecondQuarter\n                  ThirdQuarter\n                  FourthQuarter\n              2019\n                      \n                      $\n                      0.43\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  2018\n                      \n                      $\n                      0.37\n                      \n                      \n                      $\n                      0.37\n                      \n                      \n                      $\n                      0.40\n                      \n                      \n                      $\n                      0.40\n                      \n                  2017\n                      \n                      $\n                      0.32\n                      \n                      \n                      $\n                      0.32\n                      \n                      \n                      $\n                      0.32\n                      \n                      \n                      $\n                      0.32\n                      \n                  \n  \n  Dividend and common stock purchase activity during the last ten years:\n  \n\n  \n    \n       Average Per\n              \n                      \n                      Total\n                      \n                      \n                      \n                      \n                      Dividends per Share\n                      Total Value of\n                      \n                      \n                      \n                      \n                      Total Number\n                      \n                      \n                      \n                      Share Price of\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      Dividend\n                      Dividends\n                      \n                      \n                      \n                      \n                      Regular\n                      \n                      \n                      \n                      \n                       Total\n                      \n                      \n                      \n                      \n                      Common Stock\n                      \n                      \n                      \n                      \n                      of Shares\n                      \n                      \n                      \n                      Common Stock\n                      \n                      \n                      \n                  Year\n                      Payments\n                      Paid\n                      \n                      \n                      \n                      \n                      Dividend\n                      \n                      \n                      \n                      \n                      Dividend\n                      \n                      \n                      \n                      \n                      Purchased\n                      \n                      \n                      \n                      \n                      Purchased\n                      \n                      \n                      \n                      Purchased\n                      \n                      \n                      \n                  2019\n                      One (1)\n                      \n                      $\n                      122.9\n                      \n                      \n                      \n                      $\n                      0.43\n                      \n                      \n                      \n                      $\n                      0.43\n                      \n                      \n                      \n                      $\n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      $\n                      —\n                      \n                  2018\n                      Four\n                      \n                      $\n                      441.9\n                      \n                      \n                      \n                      $\n                      1.54\n                      \n                      \n                      \n                      $\n                      1.54\n                      \n                      \n                      \n                      $\n                      103.0\n                      \n                      \n                      \n                      2,000,000\n                      \n                      \n                      \n                      $\n                      51.50\n                      \n                  2017\n                      Four\n                      \n                      $\n                      369.1\n                      \n                      \n                      \n                      $\n                      1.28\n                      \n                      \n                      \n                      $\n                      1.28\n                      \n                      \n                      \n                      $\n                      82.6\n                      \n                      \n                      \n                      1,900,000\n                      \n                      \n                      \n                      $\n                      43.43\n                      \n                  2016\n                      Four\n                      \n                      $\n                      346.6\n                      \n                      \n                      \n                      $\n                      1.20\n                      \n                      \n                      \n                      $\n                      1.20\n                      \n                      \n                      \n                      $\n                      59.5\n                      \n                      \n                      \n                      1,600,000\n                      \n                      \n                      \n                      $\n                      37.15\n                      \n                  2015\n                      Four\n                      \n                      $\n                      327.1\n                      \n                      \n                      \n                      $\n                      1.12\n                      \n                      \n                      \n                      $\n                      1.12\n                      \n                      \n                      \n                      $\n                      293.0\n                      \n                      \n                      \n                      7,100,000\n                      \n                      \n                      \n                      $\n                      41.26\n                      \n                  2014\n                      Four\n                      \n                      $\n                      296.6\n                      \n                      \n                      \n                      $\n                      1.00\n                      \n                      \n                      \n                      $\n                      1.00\n                      \n                      \n                      \n                      $\n                      52.9\n                      \n                      \n                      \n                      1,200,000\n                      \n                      \n                      \n                      $\n                      44.12\n                      \n                  2013\n                      Four\n                      \n                      $\n                      237.5\n                      \n                      \n                      \n                      $\n                      0.80\n                      \n                      \n                      \n                      $\n                      0.80\n                      \n                      \n                      \n                      $\n                      9.1\n                      \n                      \n                      \n                      200,000\n                      \n                      \n                      \n                      $\n                      45.40\n                      \n                  2012\n                      Five(2)\n                      \n                      $\n                      367.3\n                      \n                      \n                      \n                      $\n                      0.74\n                      \n                      \n                      \n                      $\n                      1.24\n                      \n                      \n                      \n                      $\n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      $\n                      —\n                      \n                  2011\n                      Four\n                      \n                      $\n                      191.7\n                      \n                      \n                      \n                      $\n                      0.65\n                      \n                      \n                      \n                      $\n                      0.65\n                      \n                      \n                      \n                      $\n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      $\n                      —\n                      \n                  2010\n                      Three(2)\n                      \n                      $\n                      182.8\n                      \n                      \n                      \n                      $\n                      0.41\n                      \n                      \n                      \n                      $\n                      0.62\n                      \n                      \n                      \n                      $\n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      $\n                      —\n                      \n                  Ten Year Total\n                      \n                      \n                      $\n                      2,883.5\n                      \n                      \n                      \n                      $\n                      9.17\n                      \n                      \n                      \n                      $\n                      9.88\n                      \n                      \n                      \n                      $\n                      600.1\n                      \n                      \n                      \n                      14,000,000\n                      \n                      \n                      \n                      $\n                      42.86\n                      \n                  \n  \n  (1) The total dividends paid amount includes the estimated impact from this announcement. The estimate is calculated using the 285.9 million shares outstanding at December 31, 2018.(2) There was a supplemental dividend paid in December 2012 and 2010.All share and per share information reflects the two-for-one stock split in 2011.About FastenalFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product categories, including fasteners, safety equipment and services, tools, and general maintenance supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on approximately 3,100 in-market locations (a combination of public branches and customer-specific Onsite locations), primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel - all working toward Fastenal's common goal of Growth Through Customer Service®.Additional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.This press release contains statements that are not historical in nature and that are intended to be, and are hereby identified as, \"forward looking statements\" as defined in the Private Securities Litigation Reform Act of 1995, including a statement regarding expectations as to payment of a quarterly cash dividend in the foreseeable future. Any future determination as to payment of dividends will depend upon the financial condition and results of operations of the company and such other factors as are deemed relevant by the board of directors. For example, a change in business needs including working capital and funding for acquisitions, or a change in income tax law relating to dividends, could cause the company to decide not to pay a dividend in the future. A discussion of other risks and uncertainties is included in the company's filings with the SEC, including our most recent annual and quarterly reports. FAST-D\n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507.313.7282\n                  \n  \n  Source: Fastenal Company"
    },
    {
        "title": "Fastenal Company Announces Conference Call to Review 2018 Annual and Fourth Quarter Earnings",
        "subtitle": "",
        "date": "Jan 2, 2019 5:05PM EST",
        "content": "WINONA, Minn., Jan. 02, 2019 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST) announced the date and time for its conference call to review 2018 annual and fourth quarter results, as well as current operations. The conference call will be broadcast live over the Internet on Thursday, January 17, 2019 at 9:00 a.m. central time.To access the call, please visit the following Web address:https://investor.fastenal.com/events.cfmOur conference call presentation (which includes information, supplemental to that contained in our earnings announcement, regarding results for the quarter) will be available at 6:00 a.m., central time, on the day of the conference call. To access the presentation, please visit the following Web address: https://investor.fastenal.com/releases.cfmAn online archive of the broadcast will be available within one hour of the conclusion of the call and will remain available until March 1, 2019. Participants must have a soundcard and speakers to listen to the online broadcast.About FastenalFastenal helps customers simplify and realize product and process savings across their supply chain. We sell a broad offering of products spanning more than nine major product categories, including fasteners, safety equipment and services, tools, and general maintenance supplies. These products are efficiently distributed to manufacturing facilities, job sites, and other customer locations through local service teams and point-of-use inventory solutions, including industrial vending technology and bin stock programs (Fastenal Managed Inventory, or FMI®). Our distribution system centers on approximately 3,100 public branches and customer-specific Onsite locations, primarily in North America but also in Asia, Europe, and Central and South America, each providing tailored inventory, flexible service, and custom solutions to drive the unique goals of local customers. These in-market servicing locations are supported by 14 regional distribution centers, a captive logistics fleet, robust sourcing, quality and manufacturing resources, and multiple teams of industry specialists and support personnel - all working toward Fastenal's common goal of Growth Through Customer Service®.Additional information regarding Fastenal is available on the Fastenal Company website at www.fastenal.com.FAST-G\n  \n\n  \n    \n      CONTACT:\n                  Ellen Stolts\n              \n                      Financial Reporting & Regulatory Compliance Manager\n                  \n                      507.313.7282\n                  \n  \n  Source: Fastenal Company"
    }
]