[
    {
        "title": "Thinking about buying stock in Advanced Micro Devices, Chesapeake Energy, Delta Air Lines, Facebook, or Rite Aid?",
        "subtitle": "",
        "date": "Jan 14, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 14, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMD, CHK, DAL, FB, and RAD.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-advanced-micro-devices-chesapeake-energy-delta-air-lines-facebook-or-rite-aid-300986593.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Facebook to Announce Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Jan 2, 2020 4:48PM EST",
        "content": "MENLO PARK, Calif., Jan. 2, 2020 /PRNewswire/ -- Facebook, Inc. (NASDAQ: FB) announced today that the company's fourth quarter and full year 2019 financial results will be released after market close on Wednesday, January 29, 2020.Facebook will host a conference call to discuss its results at 2 p.m. PT / 5 p.m. ET the same day. The live webcast of the call can be accessed at the Facebook Investor Relations website at investor.fb.com, along with the company's earnings press release, financial tables, and slide presentation. Following the call, a replay will be available at the same website. A telephonic replay will be available for one week following the conference call at 404.537.3406 or 855.859.2056, Conference ID: 1262637.Transcripts of conference calls with publishing equity research analysts held on January 29, 2020 will also be posted to the investor.fb.com website.Disclosure InformationFacebook uses the investor.fb.com and newsroom.fb.com websites as well as Mark Zuckerberg's Facebook Page (facebook.com/zuck) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD. About FacebookFounded in 2004, Facebook's mission is to give people the power to build community and bring the world closer together. People use Facebook's apps and technologies to connect with friends and family, find communities and grow businesses. Facebook is a trademark of Facebook, Inc. ContactsInvestors:Deborah Crawfordinvestor@fb.com / investor.fb.comPress:Bertie Thomsonpress@fb.com / newsroom.fb.com View original content to download multimedia:http://www.prnewswire.com/news-releases/facebook-to-announce-fourth-quarter-and-full-year-2019-results-300980697.htmlSOURCE  Facebook"
    },
    {
        "title": "Thinking about buying stock in Boeing, Nike, Microbot Medical, Facebook, or Canopy Growth Corp?",
        "subtitle": "",
        "date": "Dec 24, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 24, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, NKE, MBOT, FB, and CGC.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-boeing-nike-microbot-medical-facebook-or-canopy-growth-corp-300979110.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "BetterInvesting Magazine Releases February Stock To Study And Undervalued Stock Choices For Investors' Informational And Educational Use",
        "subtitle": "",
        "date": "Dec 6, 2019 4:15PM EST",
        "content": "MADISON HEIGHTS, Mich., Dec. 6, 2019 /PRNewswire/ -- The Editorial Advisory and Securities Review Committee of BetterInvesting Magazine today announced Facebook (NASDAQ: FB) as its February 2020 \"Stock to Study\" and Schlumberger Limited (NYSE: SLB) as its February 2020 \"Undervalued Stock\" for investors' informational and educational use.\"The committee selected Facebook for its attractive growth in average revenue per user, even in the face of the currently challenging regulatory environment,\" said Sam Levine, CFA, CMT, acting executive editor of BetterInvesting Magazine. \"For the Undervalued selection, the committee remains optimistic about energy prices over the next 12-18 months and sees opportunity for Schlumberger to win new business in countries that are building out their infrastructure.\" Check BetterInvesting's March issue for more details about these selections. Go to the trial version of BetterInvesting's online tools to study the investment potential of Facebook and Schlumberger by viewing their fundamental data and applying judgments.Committee members are Robert M. Bilkie, Jr., CFA; Daniel J. Boyle, CFA; Marisa Bradbury, CFA; Philip S. Dano, CFA; and Walter J. Kirchberger, CFA.As stated, the BetterInvesting committee's Stock to Study and Undervalued Stock choices are for the informational and educational uses of investors and are not intended as investment recommendations. BetterInvesting urges investors to educate themselves about the stock market so they can make informed decisions about stock purchases. About BetterInvestingBetterInvesting is a national nonprofit organization that has been empowering individual investors since 1951. Founded in Detroit, the association (formerly known as National Association of Investors Corporation) was borne of the conviction that anyone can become a successful long-term investor by following common-sense investing practices. BetterInvesting has helped more than 5 million people become better, more informed investors by providing webinars, in-person events, easy-to-use online tools for analyzing stocks, a monthly magazine and a community of volunteers and like-minded investors. For more information about BetterInvesting, visit its website at www.betterinvesting.org or call toll free (877) 275-6242.Follow us on Twitter and Facebook.  View original content:http://www.prnewswire.com/news-releases/betterinvesting-magazine-releases-february-stock-to-study-and-undervalued-stock-choices-for-investors-informational-and-educational-use-300970804.htmlSOURCE  BetterInvesting"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Advanced Micro Devices, Clovis Oncology, Facebook, or AT&T?",
        "subtitle": "",
        "date": "Dec 2, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 2, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, AMD, CLVS, FB, and T.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-advanced-micro-devices-clovis-oncology-facebook-or-att-300967350.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Facebook, Home Depot, QUALCOMM, Starbucks, or Square?",
        "subtitle": "",
        "date": "Nov 22, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 22, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FB, HD, QCOM, SBUX, and SQ.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-facebook-home-depot-qualcomm-starbucks-or-square-300963753.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Facebook, Microsoft, Roku, Square, or UnitedHealth Group?",
        "subtitle": "",
        "date": "Nov 20, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 20, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FB, MSFT, ROKU, SQ, and UNH.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-facebook-microsoft-roku-square-or-unitedhealth-group-300962035.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Alibaba, Walt Disney Co, Facebook, or Tesla?",
        "subtitle": "",
        "date": "Nov 14, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 14, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BABA, DIS, FB, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-alibaba-walt-disney-co-facebook-or-tesla-300958429.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Boeing, Citigroup, Facebook, NVIDIA, or Walmart?",
        "subtitle": "",
        "date": "Nov 12, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 12, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, C, FB, NVDA, and WMT.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-boeing-citigroup-facebook-nvidia-or-walmart-300956383.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Facebook Helps to Protect the 2020 US Elections",
        "subtitle": "",
        "date": "Nov 7, 2019 5:54PM EST",
        "content": " MENLO PARK, Calif., Nov. 7, 2019 /PRNewswire/ -- The following is written by Guy Rosen, VP of Integrity; Katie Harbath, Public Policy Director, Global Elections; Nathaniel Gleicher, Head of Cybersecurity Policy and Rob Leathern, Director of Product Management.Experience the interactive Multichannel News Release here: https://www.multivu.com/players/English/8323454-facebook-2020-us-elections/We have a responsibility to stop abuse and election interference on our platform. That's why we've made significant investments since 2016 to better identify new threats, close vulnerabilities and reduce the spread of viral misinformation and fake accounts. Today, almost a year out from the 2020 elections in the US, we're announcing several new measures to help protect the democratic process and providing an update on initiatives already underway:Fighting foreign interferenceIncreasing transparencyReducing misinformationFighting Foreign InterferenceCombating Inauthentic BehaviorOver the last three years, we've worked to identify new and emerging threats and remove coordinated inauthentic behavior across our apps. In the past year alone, we've taken down over 50 networks worldwide, many ahead of major democratic elections. As part of our effort to counter foreign influence campaigns, this morning we removed four separate networks of accounts, Pages and Groups on Facebook and Instagram for engaging in coordinated inauthentic behavior. Three of them originated in Iran and one in Russia. They targeted the US, North Africa and Latin America. We have identified these manipulation campaigns as part of our internal investigations into suspected Iran-linked inauthentic behavior, as well as ongoing proactive work ahead of the US elections.We took down these networks based on their behavior, not the content they posted. In each case, the people behind this activity coordinated with one another and used fake accounts to misrepresent themselves, and that was the basis for our action. We have shared our findings with law enforcement and industry partners. More details can be found here.As we've improved our ability to disrupt these operations, we've also built a deeper understanding of different threats and how best to counter them. We investigate and enforce against any type of inauthentic behavior. However, the most appropriate way to respond to someone boosting the popularity of their posts in their own country may not be the best way to counter foreign interference. That's why we're updating our inauthentic behavior policy to clarify how we deal with the range of deceptive practices we see on our platforms, whether foreign or domestic, state or non-state.Protecting the Accounts of Candidates, Elected Officials and Their TeamsToday, we're launching Facebook Protect to further secure the accounts of elected officials, candidates, their staff and others who may be particularly vulnerable to targeting by hackers and foreign adversaries. As we've seen in past elections, they can be targets of malicious activity. However, because campaigns are generally run for a short period of time, we don't always know who these campaign-affiliated people are, making it harder to help protect them.Beginning today, Page admins can enroll their organization's Facebook and Instagram accounts in Facebook Protect and invite members of their organization to participate in the program as well. Participants will be required to turn on two-factor authentication, and their accounts will be monitored for hacking, such as login attempts from unusual locations or unverified devices. And, if we discover an attack against one account, we can review and protect other accounts affiliated with that same organization that are enrolled in our program. Read more about Facebook Protect and enroll here.Increasing TransparencyMaking Pages More TransparentWe want to make sure people are using Facebook authentically, and that they understand who is speaking to them. Over the past year, we've taken steps to ensure Pages are authentic and more transparent by showing people the Page's primary country location and whether the Page has merged with other Pages. This gives people more context on the Page and makes it easier to understand who's behind it. Increasingly, we've seen people failing to disclose the organization behind their Page as a way to make people think that a Page is run independently. To address this, we're adding more information about who is behind a Page, including a new \"Organizations That Manage This Page\" tab that will feature the Page's \"Confirmed Page Owner,\" including the organization's legal name and verified city, phone number or website. Initially, this information will only appear on Pages with large US audiences that have gone through Facebook's business verification. In addition, Pages that have gone through the new authorization process to run ads about social issues, elections or politics in the US will also have this tab. And starting in January, these advertisers will be required to show their Confirmed Page Owner. If we find a Page is concealing its ownership in order to mislead people, we will require it to successfully complete the verification process and show more information in order for the Page to stay up. Labeling State-Controlled MediaWe want to help people better understand the sources of news content they see on Facebook so they can make informed decisions about what they're reading. Next month, we'll begin labeling media outlets that are wholly or partially under the editorial control of their government as state-controlled media. This label will be on both their Page and in our Ad Library. We will hold these Pages to a higher standard of transparency because they combine the opinion-making influence of a media organization with the strategic backing of a state. We developed our own definition and standards for state-controlled media organizations with input from more than 40 experts around the world specializing in media, governance, human rights and development. Those consulted represent leading academic institutions, nonprofits and international organizations in this field, including Reporters Without Borders, Center for International Media Assistance, European Journalism Center, Oxford Internet Institute's Project on Computational Propaganda, Center for Media, Data and Society (CMDS) at the Central European University, the Council of Europe, UNESCO and others. It's important to note that our policy draws an intentional distinction between state-controlled media and public media, which we define as any entity that is publicly financed, retains a public service mission and can demonstrate its independent editorial control. At this time, we're focusing our labeling efforts only on state-controlled media. We will update the list of state-controlled media on a rolling basis beginning in November. And, in early 2020, we plan to expand our labeling to specific posts and apply these labels on Instagram as well. For any organization that believes we have applied the label in error, there will be an appeals process. Making it Easier to Understand Political AdsIn addition to making Pages more transparent, we're updating the Ad Library, Ad Library Report and Ad Library API to help journalists, lawmakers, researchers and others learn more about the ads they see. This includes:In addition to updates to the Ad Library API, in November, we will begin testing a new database with researchers that will enable them to quickly download the entire Ad Library, pull daily snapshots and track day-to-day changes.Visit our Help Center to learn more about the changes to Pages and the Ad Library. Reducing MisinformationPreventing the Spread of Viral MisinformationOn Facebook and Instagram, we work to keep confirmed misinformation from spreading. For example, we reduce its distribution so fewer people see it — on Instagram, we remove it from Explore and hashtags, and on Facebook, we reduce its distribution in News Feed. On Instagram, we also make content from accounts that repeatedly post misinformation harder to find by filtering content from that account from Explore and hashtag pages for example. And on Facebook, if Pages, domains or Groups repeatedly share misinformation, we'll continue to reduce their overall distribution and we'll place restrictions on the Page's ability to advertise and monetize.Over the next month, content across Facebook and Instagram that has been rated false or partly false by a third-party fact-checker will start to be more prominently labeled so that people can better decide for themselves what to read, trust and share. The labels below will be shown on top of false and partly false photos and videos, including on top of Stories content on Instagram, and will link out to the assessment from the fact-checker. Much like we do on Facebook when people try to share known misinformation, we're also introducing a new pop-up that will appear when people attempt to share posts on Instagram that include content that has been debunked by third-party fact-checkers.In addition to clearer labels, we're also working to take faster action to prevent misinformation from going viral, especially given that quality reporting and fact-checking takes time. In many countries, including in the US, if we have signals that a piece of content is false, we temporarily reduce its distribution pending review by a third-party fact-checker.Fighting Voter Suppression and IntimidationAttempts to interfere with or suppress voting undermine our core values as a company, and we work proactively to remove this type of harmful content. Ahead of the 2018 midterm elections, we extended our voter suppression and intimidation policies to prohibit:We remove this type of content regardless of who it's coming from, and ahead of the midterm elections, our Elections Operations Center removed more than 45,000 pieces of content that violated these policies — more than 90% of which our systems detected before anyone reported the content to us. We also recognize that there are certain types of content, such as hate speech, that are equally likely to suppress voting. That's why our hate speech policies ban efforts to exclude people from political participation on the basis of things like race, ethnicity or religion (e.g., telling people not to vote for a candidate because of the candidate's race, or indicating that people of a certain religion should not be allowed to hold office).In advance of the US 2020 elections, we're implementing additional policies and expanding our technical capabilities on Facebook and Instagram to protect the integrity of the election. Following up on a commitment we made in the civil rights audit report released in June, we have now implemented our policy banning paid advertising that suggests voting is useless or meaningless, or advises people not to vote. In addition, our systems are now more effective at proactively detecting and removing this harmful content. We use machine learning to help us quickly identify potentially incorrect voting information and remove it. We are also continuing to expand and develop our partnerships to provide expertise on trends in voter suppression and intimidation, as well as early detection of violating content. This includes working directly with secretaries of state and election directors to address localized voter suppression that may only be occurring in a single state or district. This work will be supported by our Elections Operations Center during both the primary and general elections. Helping People Better Understand What They See OnlinePart of our work to stop the spread of misinformation is helping people spot it for themselves. That's why we partner with organizations and experts in media literacy. Today, we're announcing an initial investment of $2 million to support projects that empower people to determine what to read and share — both on Facebook and elsewhere. These projects range from training programs to help ensure the largest Instagram accounts have the resources they need to reduce the spread of misinformation, to expanding a pilot program that brings together senior citizens and high school students to learn about online safety and media literacy, to public events in local venues like bookstores, community centers and libraries in cities across the country. We're also supporting a series of training events focused on critical thinking among first-time voters. In addition, we're including a new series of media literacy lessons in our Digital Literacy Library. These lessons are drawn from the Youth and Media team at the Berkman Klein Center for Internet & Society at Harvard University, which has made them available for free worldwide under a Creative Commons license. The lessons, created for middle and high school educators, are designed to be interactive and cover topics ranging from assessing the quality of the information online to more technical skills like reverse image search.We'll continue to develop our media literacy efforts in the US and we'll have more to share soon. Media Contact:  Jamil Walker jamilw@fb.com       View original content:http://www.prnewswire.com/news-releases/facebook-helps-to-protect-the-2020-us-elections-300954437.htmlSOURCE  Facebook"
    },
    {
        "title": "Thinking about trading options or stock in Beyond Meat, Facebook, JPMorgan Chase, Roku, or Tesla?",
        "subtitle": "",
        "date": "Nov 1, 2019 9:31AM EDT",
        "content": "NEW YORK, Nov. 1, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BYND, FB, JPM, ROKU, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-beyond-meat-facebook-jpmorgan-chase-roku-or-tesla-300949640.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Facebook Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 30, 2019 4:05PM EDT",
        "content": "MENLO PARK, Calif., Oct. 30, 2019 /PRNewswire/ -- Facebook, Inc. (Nasdaq: FB) today reported financial results for the quarter ended September 30, 2019.\"We had a good quarter and our community and business continue to grow,\" said Mark Zuckerberg, Facebook founder and CEO. \"We are focused on making progress on major social issues and building new experiences that improve people's lives around the world.\"Third Quarter 2019 Financial HighlightsThird Quarter 2019 Operational and Other Financial HighlightsIn addition, we estimate that around 2.2 billion people now use Facebook, Instagram, WhatsApp, or Messenger (our \"Family\" of services) every day on average, and around 2.8 billion people use at least one of our Family of services each month.Webcast and Conference Call InformationFacebook will host a conference call to discuss the results at 2 p.m. PT / 5 p.m. ET today. The live webcast of Facebook's earnings conference call can be accessed at investor.fb.com, along with the earnings press release, financial tables, and slide presentation. Facebook uses the investor.fb.com and newsroom.fb.com websites as well as Mark Zuckerberg's Facebook Page (https://www.facebook.com/zuck) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD.Following the call, a replay will be available at the same website. A telephonic replay will be available for one week following the conference call at +1 (404) 537-3406 or +1 (855) 859-2056, conference ID 9647087.Transcripts of conference calls with publishing equity research analysts held today will also be posted to the investor.fb.com website.About FacebookFounded in 2004, Facebook's mission is to give people the power to build community and bring the world closer together. People use Facebook to stay connected with friends and family, to discover what's going on in the world, and to share and express what matters to them.ContactsInvestors:Deborah Crawfordinvestor@fb.com / investor.fb.comPress:Bertie Thomsonpress@fb.com / newsroom.fb.comForward-Looking StatementsThis press release contains forward-looking statements regarding our future business expectations. These forward-looking statements are only predictions and may differ materially from actual results due to a variety of factors including: our ability to retain or increase users and engagement levels; our reliance on advertising revenue; our dependency on mobile operating systems, networks, and standards that we do not control; risks associated with new products and changes to existing products as well as other new business initiatives; our emphasis on user growth and engagement and the user experience over short-term financial results; maintaining and enhancing our brand and reputation; our ongoing safety, security, and content review efforts; competition; risks associated with government actions that could restrict access to our products or impair our ability to sell advertising in certain countries; litigation and government inquiries; privacy and regulatory concerns; risks associated with acquisitions; security breaches; and our ability to manage growth and geographically-dispersed operations. These and other potential risks and uncertainties that could cause actual results to differ from the results predicted are more fully detailed under the caption \"Risk Factors\" in our Quarterly Report on Form 10-Q filed with the SEC on July 25, 2019, which is available on our Investor Relations website at investor.fb.com and on the SEC website at www.sec.gov. Additional information will also be set forth in our Quarterly Report on Form 10-Q for the quarter ended September 30, 2019. In addition, please note that the date of this press release is October 30, 2019, and any forward-looking statements contained herein are based on assumptions that we believe to be reasonable as of this date. We undertake no obligation to update these statements as a result of new information or future events.Non-GAAP Financial MeasuresTo supplement our condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (GAAP), we use the following non-GAAP financial measures: revenue excluding foreign exchange effect, advertising revenue excluding foreign exchange effect and free cash flow. The presentation of these financial measures is not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. Investors are cautioned that there are material limitations associated with the use of non-GAAP financial measures as an analytical tool. In addition, these measures may be different from non-GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. We compensate for these limitations by providing specific information regarding the GAAP amounts excluded from these non-GAAP financial measures.We believe these non-GAAP financial measures provide investors with useful supplemental information about the financial performance of our business, enable comparison of financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business.We exclude the following items from our non-GAAP financial measures:Foreign exchange effect on revenue. We translated revenue for the three and nine months ended September 30, 2019 using the prior year's monthly exchange rates for our settlement or billing currencies other than the U.S. dollar, which we believe is a useful metric that facilitates comparison to our historical performance.Purchases of property and equipment, net; Principal payments on finance leases. We subtract both net purchases of property and equipment and principal payments on finance leases in our calculation of free cash flow because we believe that these two items collectively represent the amount of property and equipment we need to procure to support our business, regardless of whether we procure such property or equipment with a finance lease. We believe that this methodology can provide useful supplemental information to help investors better understand underlying trends in our business. Free cash flow is not intended to represent our residual cash flow available for discretionary expenditures.For more information on our non-GAAP financial measures and a reconciliation of GAAP to non-GAAP measures, please see the \"Reconciliation of GAAP to Non-GAAP Results\" table in this press release.       View original content:http://www.prnewswire.com/news-releases/facebook-reports-third-quarter-2019-results-300948563.htmlSOURCE  Facebook"
    },
    {
        "title": "Thinking about trading options or stock in ConocoPhillips, Facebook, Goldman Sachs, Coca-Cola, or Roku?",
        "subtitle": "",
        "date": "Oct 30, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 30, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for COP, FB, GS, KO, and ROKU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-conocophillips-facebook-goldman-sachs-coca-cola-or-roku-300948136.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Amazon, Salesforce, Facebook, NVIDIA, or Visa?",
        "subtitle": "",
        "date": "Oct 25, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 25, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMZN, CRM, FB, NVDA, and V.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amazon-salesforce-facebook-nvidia-or-visa-300945543.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Apple, Aurora Cannabis, Bank of America, Walt Disney Co, or Facebook?",
        "subtitle": "",
        "date": "Oct 21, 2019 9:34AM EDT",
        "content": "NEW YORK, Oct. 21, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, ACB, BAC, DIS, and FB.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-aurora-cannabis-bank-of-america-walt-disney-co-or-facebook-300941998.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Facebook, IBM, JPMorgan Chase, Roku, or UnitedHealth Group?",
        "subtitle": "",
        "date": "Oct 16, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 16, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FB, IBM, JPM, ROKU, and UNH.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-facebook-ibm-jpmorgan-chase-roku-or-unitedhealth-group-300939628.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Facebook, Micron Technology, Histogenics, or Qualcomm?",
        "subtitle": "",
        "date": "Oct 9, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 9, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, FB, MU, OCGN, and QCOM.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-facebook-micron-technology-histogenics-or-qualcomm-300934702.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Facebook, Johnson & Johnson, Visa, or Walmart?",
        "subtitle": "",
        "date": "Oct 3, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 3, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, FB, JNJ, V, and WMT.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast. (Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-facebook-johnson--johnson-visa-or-walmart-300930574.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Facebook to Announce Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 1, 2019 4:05PM EDT",
        "content": "MENLO PARK, Calif., Oct. 1, 2019 /PRNewswire/ -- Facebook, Inc. (NASDAQ: FB) announced today that the company's third quarter 2019 financial results will be released after market close on Wednesday, October 30, 2019.Facebook will host a conference call to discuss its results at 2 p.m. PT / 5 p.m. ET the same day. The live webcast of the call can be accessed at the Facebook Investor Relations website at investor.fb.com, along with the company's earnings press release, financial tables, and slide presentation. Following the call, a replay will be available at the same website. A telephonic replay will be available for one week following the conference call at 404.537.3406 or 855.859.2056, Conference ID: 9647087.Transcripts of conference calls with publishing equity research analysts held on October 30, 2019 will also be posted to the investor.fb.com website.Disclosure InformationFacebook uses the investor.fb.com and newsroom.fb.com websites as well as Mark Zuckerberg's Facebook Page (facebook.com/zuck) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD. About FacebookFounded in 2004, Facebook's mission is to give people the power to build community and bring the world closer together. People use Facebook to stay connected with friends and family, to discover what's going on in the world, and to share and express what matters to them.Facebook is a trademark of Facebook, Inc. ContactsInvestors:Deborah Crawfordinvestor@fb.com / investor.fb.comPress:Bertie Thomsonpress@fb.com / newsroom.fb.com View original content to download multimedia:http://www.prnewswire.com/news-releases/facebook-to-announce-third-quarter-2019-results-300928849.htmlSOURCE  Facebook"
    }
]