[
    {
        "title": "Fiserv to Deepen and Expand Merchant Services Business with Acquisition of MerchantPro Express",
        "subtitle": "",
        "date": "Mar 3, 2020 8:30AM EST",
        "content": "    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of payments and financial services technology solutions, today announced that it has acquired MerchantPro Express as part of a broader strategy to expand the Fiserv merchant services business and grow the company’s partner-based distribution.\n\nThe combination will bring together market-leading payment solutions from Fiserv, including CoPilot, CardPointe® and Clover®, with the proven and sophisticated onboarding and service of MerchantPro Express.\n\n“MerchantPro Express has been a key Fiserv distribution partner since 2009,” said Devin McGranahan, senior group president, Global Business Solutions at Fiserv. “By combining our solutions and expertise under one roof we will be able to expand and speed the delivery of new and innovative solutions.”\n\n“By completing this transaction, we have confirmed our commitment to provide a high-quality and sustainable platform to our agents, employees and customers,” said Chris Briller, Chief Executive Officer at MerchantPro Express. “The highly regarded Fiserv brand and focus on growth will enable us to distribute premier products and services to our clients.”\n\nHeadquartered in Melville, New York, MerchantPro Express is an Independent Sales Organization (ISO) that provides state-of-the-art processing services, advanced point-of-sale equipment and merchant cash advances to businesses across the United States. By leveraging technology, analytics and a consultative approach, MerchantPro Express works with its clients and partners to grow their businesses by driving down processing costs, providing a wide variety of value-added services, and offering transparent, personalized service.\n\n“We could not be more thrilled to join the Fiserv family. Their cutting-edge suite of payments technology products and services will help transform the way our sales agents and their merchant clients are able to serve customers,” said Sean O’Neil, Chief Operating Officer at MerchantPro Express.\n\n“We welcome Chris, Sean and the MerchantPro Express team to Fiserv, and look forward to continuing to provide the best-in-class solutions and service that agents, merchants and their customers expect,” said McGranahan.\n\nThe financial terms of the transaction were not disclosed.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200303005429/en/\nMedia Relations:\nBritt Zarling\nVice President\nCorporate Communications\nFiserv, Inc.\n414-378-4040\nbritt.zarling@fiserv.com\n\nInvestor Relations:\nPeter Poillon\nSenior Vice President\nInvestor Relations\nFiserv, Inc.\n212-266-3565\npeter.poillon@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv to Present at Evercore ISI’s 2020 Payments and FinTech Innovators Forum",
        "subtitle": "",
        "date": "Mar 2, 2020 4:01PM EST",
        "content": "    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, announced today that Jeffery Yabuki, Chairman and Chief Executive Officer, will present at the Evercore ISI Payments and FinTech Innovators Forum in New York City on March 5, 2020 at 9:20 a.m. ET.\n\nA live webcast and archived replay of the presentation will be available on the investor relations section of the Fiserv website at investors.fiserv.com.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among the FORTUNE World's Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005952/en/\nMedia Relations:\nBritt Zarling\nCorporate Communications\nFiserv, Inc.\n414-378-4040\nbritt.zarling@fiserv.com \n\nInvestor Relations:\nPeter Poillon\nInvestor Relations\nFiserv, Inc.\n212-266-3565\npeter.poillon@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "First State Bank Initiates Technology Transformation with Fiserv to Accelerate Deposit and Loan Growth",
        "subtitle": "",
        "date": "Mar 2, 2020 8:30AM EST",
        "content": "\nIllinois bank chooses technology to strengthen digital capabilities and gain efficiencies that translate into a more compelling customer experience\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFirst State Bank, a full-service bank with $1.2 billion in assets and 18 branches throughout Illinois, has chosen Fiserv, Inc. (NASDAQ:FISV), a leading global provider of financial services technology solutions, to help enable a complete technology transformation that will equip the bank to better serve retail and commercial customers in today’s highly competitive deposit and lending environment.\n\n“We were looking for a true strategic partner that is interested in our success as a bank, and are confident that the well-orchestrated relationship model from Fiserv will provide the support we need,” said Tim McConville, President and CEO at First State Bank. “The capabilities we have selected are far ahead of our current service offering and will support our goals of establishing a stronger market position and increasing loan volume.”\n\nFirst State Bank has grown through acquisitions and wants to maintain the personalized feel of a community bank while introducing leading-edge digital tools to attract the growing population of mobile-first consumers. Leaders at the bank also plan to address inefficiencies and needed access to a broad selection of solutions to sharpen the bank’s competitive edge and simplify operations.\n\nAfter a thorough review, First State Bank selected the Premier® account processing platform from Fiserv along with a full range of solutions focused on enhancing digital capabilities, streamlining document management, accounting and general ledger activities, and supporting cross-sales in the branch. For business customers, including a strong agricultural line of business, the bank chose solutions to enhance mobile banking, online account opening and payment options.\n\n“A growing number of people prefer online and mobile banking options, and financial institutions are putting a stronger focus on the experience of customers who rarely set foot in the branch,” said Todd Horvath, group president of Account Processing at Fiserv. “The breadth of functionality First State Bank is implementing will give customers more options for managing their financial lives wherever they are, including real-time notifications that keep them informed and connected to their banking activity.”\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources:\n\nAbout First State Bank\n\nFirst State Bank is owned and operated by Tri-County Financial Group, Inc. providing commercial and retail banking services to individuals, associations, partnerships, and corporations. The company accepts deposits and generates loans. It offers tax-deferred retirement programs, brokerage services, insurance services, safe deposit boxes, traveler's checks, night depositories, automated clearinghouse transactions, wire transfers, automated teller machine, and telephone and internet banking services. The company, founded in 1940 and headquartered in Mendota, Illinois, holds $1.2bn in assets, operates 21 branches and employs 307 associates.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ:FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005373/en/\nMedia Relations:\nAnn S. Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nAdditional Contact:\nMarcus Hardy\nManager, Public Relations\nFiserv, Inc.\n801-823-5534\nmarcus.hardy@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Small Businesses can Deliver Big at Checkout with Clover Station Pro",
        "subtitle": "",
        "date": "Feb 26, 2020 9:07AM EST",
        "content": "\nDevice designed to increase engagement and speed at the point of sale debuts with new vertical-specific software plans for quick-service and full-service restaurants\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nSmall and mid-size businesses can enhance efficiency and improve customer experience at the checkout with the new Clover® Station Pro, the latest addition to the robust set of Clover cloud-based point-of-sale (POS) devices from Fiserv, Inc. (NASDAQ: FISV), a leading global provider of payments and financial technology solutions.\n\nClover Station Pro combines purpose-built hardware, including a customizable customer-facing countertop display, with vertical-specific software, fast payment acceptance and best-in-class security features. Its intuitive smart terminal experience is designed to increase checkout speeds, prevent order errors, and support loyalty programs.\n\n“Business owners are always looking for ways to streamline their operations and build stronger customer relationships,” said John Beatty, co-founder of Clover. “Designed with these needs in mind, Clover Station Pro addresses common pain points in the checkout process. When people can see their order it can improve accuracy, and faster payment processing can speed lines. These little things add up to make a significant difference in the overall customer experience.”\n\nClover Station Pro supports all swipe, dip, and tap capabilities for credit, EBT, EMV and PIN debit cards, as well as NFC payment options including Apple Pay®, Google PayTM, Samsung Pay®, AlipayTM, and WeChat PayTM, among others, giving the customer choice and flexibility. The new customer-facing screen enables customers to manage their payment process by granting them control over their counter experience – whether it is entering a tip amount, keying in their PIN, updating their phone number, or earning or redeeming rewards and promotions. Clover Station Pro is PCI PTS 5.0 certified and provides multi-layered protection for all payments with end-to-end encryption and data tokenization.\n\nIn tandem with the launch of Clover Station Pro, new vertical-specific software plans are available for quick-service restaurants (QSR) and full-service restaurants (FSR) on the Clover platform, including:\n\n“Properly serving the restaurant vertical is crucial for payment providers as restaurants typically experience higher payment transaction volume, require specific business and management tools to run their operations, and represent a growing sector of the economy,” said Raymond Pucci, director of merchant services at Mercator Advisory Group. “Both quick and full-service restaurants would like to manage all aspects of their business at the point of sale. For restaurants to grow their revenues, payment solutions providers must provide them with the technology and specific tools they need to simplify their operations, more quickly serve their guests, and create more in-store opportunities to engage customers.”\n\nClover is a market-leading point-of-sale platform with more than one million merchant devices distributed globally, processing more than $100 billion in annualized payment volume. Clover functions as a complete business-management platform enabling merchants to maximize their operating efficiencies and grow, while allowing customers to pay using a debit or credit card or via mobile payment options such as Apple Pay, Google Pay and Samsung Pay.\n\nFor more information on Clover, visit Clover.com and blog.clover.com/. Learn why small businesses love Clover by following #SharetheLove #CloverStory.\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005534/en/\nMedia Relations:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nAdditional Contact:\nBart Mackey\nManager, Corporate Communications\nFiserv, Inc.\n212-515-0231\nbarton.mackey@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Air Academy Federal Credit Union Moves to Fiserv to Expand Commercial Business and Enable Digital Transformation",
        "subtitle": "",
        "date": "Feb 25, 2020 8:30AM EST",
        "content": "\nColorado Springs-based credit union selects modern core platform to enhance member experience and enable automation\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, announced today that Air Academy Federal Credit Union, headquartered in Colorado Springs, Colorado, has selected a new core account processing platform and suite of integrated solutions from Fiserv to modernize its operations, gain efficiencies and increase overall agility.\n\nAir Academy Federal Credit Union has been serving the U.S. Air Force Academy and its surrounding communities since 1955. Due to increased competition and limitations of its existing core platform, the credit union chose to move to the DNA® platform from Fiserv to improve loan serving capabilities for commercial and mortgage businesses and to facilitate the integration of third-party solutions through the platform’s open architecture and APIs.\n\n“The competition in our market, including from fintechs, is constantly evolving. To remain competitive, we needed to have the right technology and create more member-centric offerings,” said Jeremy Taylor, chief information officer, Air Academy Federal Credit Union. “With Fiserv, we found a partner with strategic vision and a commitment to investing in core technology for the long term.”\n\nWith DNA, Air Academy Federal Credit Union can now extend and adapt its core platform to meet evolving member and commercial needs. The credit union will also add a variety of integrated solutions from Fiserv for accounting, item processing, multi-channel marketing, general ledger, financial risk management and managed services.\n\n“Air Academy Federal Credit Union is leveraging modern technology to transform the member experience,” said Theo Curey, president, Credit Union Solutions, Fiserv. “With Fiserv they now have the tools they need to customize solutions and increase speed to market with new capabilities that are tailored to their member base.”\n\nIn a world that is moving faster than ever before, Fiserv helps clients deliver solutions that are in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources:\n\nAbout Air Academy Federal Credit Union \n\nFounded in 1955 to serve the cadets, officers and civilians of the newly established U.S. Air Force Academy at Lowry Air Force Base, Air Academy Federal Credit Union has expanded its reach to include the employees and students of the surrounding 10 school districts and select employee groups. The credit union serves 47,000 members through 8 branches and has over $600 million in assets. Visit aafcu.com for more information.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225005343/en/\nMedia Relations:\nMarcus Hardy\nManager, Communications\nFiserv, Inc.\n801-823-5534\nmarcus.hardy@fiserv.com\n\nAdditional Contact:\nAnn S. Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Nearly 600 Banks and Credit Unions Join Zelle Network via Fiserv",
        "subtitle": "",
        "date": "Feb 24, 2020 8:30AM EST",
        "content": "\nPatelco Credit Union and SunWest Federal Credit Union among financial institutions that have selected Turnkey Service for Zelle® from Fiserv\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ:FISV), a leading global provider of financial services technology solutions, announced today that a growing number of financial institutions are joining the Zelle Network® via Fiserv to enable person-to-person (P2P) payment capabilities. To date, nearly 600 financial institutions have selected Turnkey Service for Zelle® from Fiserv, with more than 360 making their selection in 2019.\n\nThe number of financial institutions that are live on Turnkey Service for Zelle has increased tenfold compared to a year ago, and there has been expansive growth in both the number of people transacting and the number of transactions processed through the service. In 2019, the number of people using Zelle via Fiserv to send money increased 116%, while the number of people using Zelle via Fiserv to receive money increased 145%. The number of transactions increased 207% year-over-year.\n\nZelle allows consumers to send and receive money directly from one U.S. bank account to another, typically within minutes when both parties are already enrolled. Turnkey Service for Zelle streamlines the onboarding process for financial institutions connecting to Zelle, helping to reduce costs and accelerate time to market.\n\nPatelco Credit Union and SunWest Federal Credit Union are among the financial institutions that have selected Zelle.\n\n“With Zelle, our members will have the ability to send and receive funds fast, and maintain control of their money by timing payments deliberately, even down to the hour,” said Kevin Landel, senior vice president of Innovation and Payments Strategy at the $7.3 billion Patelco Credit Union of California. “This provides our members maximum flexibility to help them achieve financial health and wellbeing, our core mission at Patelco.”\n\n“We initially took a ‘wait and see’ approach when it came to Zelle,” said Katie Defeo, marketing director at SunWest Federal Credit Union, which serves members in Maricopa County and the city of Tucson, Arizona. “Then we saw that the number one word being searched on our website was ‘Zelle’, and we changed our minds. We realized this was something our members were seeking, and Turnkey Service for Zelle offered a practical way for us to get started.”\n\n“Keeping up with continually changing consumer expectations is an ongoing challenge for retail financial institutions,” said Tom Allanson, president, Electronic Payments, Fiserv. “Technology can level the playing field, and Turnkey Service for Zelle enables financial institutions of all sizes to offer P2P payments and grow customer interactions.”\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ:FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nZelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200224005535/en/\nMedia Relations:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nAdditional Contact:\nMarcus Hardy\nManager, Communications\nFiserv, Inc.\n801-823-5534\nmarcus.hardy@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv Completes Sale of Majority Interest in Investment Services Business to Motive Partners",
        "subtitle": "",
        "date": "Feb 19, 2020 8:53AM EST",
        "content": "    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a global provider of payments and financial services technology solutions, today announced the completion of its previously announced transaction with Motive Partners, under which Motive Partners-led investors have acquired a 60% stake in the Investment Services Business of Fiserv. Fiserv received approximately $510 million in net after-tax proceeds and retained a 40% equity interest in the business.\n\nAbout Motive Partners\n\nMotive Partners is a specialist private equity firm with offices in New York City and London, focusing on technology-enabled business and financial services companies serving four core customer segments: banking & payments, capital markets, asset management and insurance. Motive Partners brings differentiated expertise, connectivity and capabilities to create long-term value in financial technology companies. More information on Motive Partners can be found at www.motivepartners.com.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500 and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005546/en/\nMedia Relations:\nBritt Zarling\nVice President,\nCorporate Communications\nFiserv, Inc.\n+1 414-378-4040\nbritt.zarling@fiserv.com\n\nSam Tidswell-Norrish\nCommunications\nMotive Partners\n+1 212-651-0200\nsam@motivepartners.com\n\nInvestor Relations:\nPeter Poillon\nInvestor Relations\nFiserv, Inc.\n+1 212-266-3565\npeter.poillon@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv Completes First-of-its-Kind Pin on Mobile Transaction with Visa",
        "subtitle": "",
        "date": "Feb 18, 2020 2:00AM EST",
        "content": "\nNew app-based solution simplifies payment acceptance for merchants of any size\n    WARSAW, Poland & BROOKFIELD, Wis.--(BUSINESS WIRE)--\nIn a move that is expected to boost the worldwide use of smartphones and tablets as point-of-sale terminals, First Data, now part of Fiserv (NASDAQ: FISV), is enabling merchants to use their own devices to accept payments of any amount without any additional hardware.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200217005508/en/Fiserv, together with Visa, Samsung and PayCore, has completed a first-of-its-kind PIN on Mobile Transaction. (Photo: Business Wire)\nThis is ground-breaking for small businesses and service providers that operate remotely due to its first-of-its-kind PIN on mobile capability, which facilitates secure PIN entry on a consumer-grade mobile device. This simplifies payment acceptance by allowing merchants to accept PIN-based contactless transactions without the need for a separate card reader or PIN-entry device, opening new market opportunities for merchants and allowing even micro-businesses to accept non-cash payments.\n\nFiserv, a leading global provider of payments and financial services technology solutions, recently completed the first PIN on mobile payment via the app-based solution. Following security testing, the solution, developed jointly with Visa, Samsung, and PayCore, is being piloted in Poland, with plans to expand in the EMEA and APAC regions.\n\n“The way people want to pay is changing,” said John Gibbons, executive vice president and head of EMEA at Fiserv. “Contactless CHIP and PIN payments are common, yet over 23 million* micro merchants in Europe alone may lack terminals to accept them. We’re making sure no merchant is left out and helping them do business in the cashless economy by turning the smartphone into a card acceptance device.”\n\nThe flexible, cost-effective solution, which is currently available on select Samsung devices, utilizes embedded near-field communication (NFC) functionality. A payment can be made with contactless cards, NFC-enabled mobile phones, or other NFC-enabled devices such as wearables.\n\n“This innovative service is a milestone for modern entrepreneurs. It will allow Samsung mobile users to do more than just pay with their phones; it will let them accept payments in places and situations where it might have been impossible otherwise,” said Marcin Garbarczyk, Marketing and Strategy Director at Samsung Electronics Polska.\n\nVisa approved the solution to authorize contactless payments with PIN capture through its Visa tap to phone program.\n\n“With Visa tap to phone technology with PIN capture capability merchants of any size, especially those operating outside of their premises – like plumbers, landscapers or couriers – will now be able to accept digital payments on their phones in a fast, safe and convenient way,” said Katarzyna Zubrzycka, Head of Merchant Sales & Acquirer, Central Eastern Europe, Visa.\n\nPayCore provides EMV software to facilitate transactions that are enabled by the Fiserv solution.\n\n“At PayCore, we are delighted to be a technology provider for this innovative solution,” said Turgut Güney, CEO of PayCore. “We are sure that this disruptive technology will boost the use of smartphones and tablets as POS terminals in the market, enabling card-present transactions of any amount to be carried out in a secure environment.”\n\nSource * https://www.statista.com/statistics/878412/number-of-smes-in-europe-by-size/\n\nAbout Fiserv\n\nFirst Data is now Fiserv.\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500 and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nAbout Samsung Electronics Co., Ltd.\n\nSamsung inspires the world and shapes the future with transformative ideas and technologies. The company is redefining the worlds of TVs, smartphones, wearable devices, tablets, digital appliances, network systems, and memory, system LSI, foundry and LED solutions. For the latest news, please visit the Samsung Newsroom at http://news.samsung.com.\n\nAbout Visa Inc.\n\nVisa Inc. (NYSE: V) is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network - enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of digital commerce on any device for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, visa.com/blog and @VisaNews.\n\nAbout PayCore\n\nPayCore, founded in 2001 to meet the software demand in payment technologies, provides innovative, end-to-end solutions in the field of financial payment technologies to the banking, telecom, payment service provision, card personalization, public, transportation, and retail sectors. Having won more than 30 awards locally and internationally for card management software, digital payment solutions, smart city applications, EMV solutions, processing services and secure hardware products, PayCore is a company which has exported technology to more than 35 countries as the solution partner of more than 150 institutions. For detailed information please visit www.paycore.com.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200217005508/en/\nMedia Relations:\nAnn Cave\nDirector, Public Relations\nFiserv, Inc.\n+1 678-325-9435\nann.cave@fiserv.com\n\nAdditional Contact:\nOlga Małecka\nMarketing and Communications Manager\nFiserv, Inc.\n+48 22 515 31 00\nolga.malecka@fiserv.com\nSource: Fiserv"
    },
    {
        "title": "‘Dine and Dash’ Redefined with New Clover Scan to Pay Feature",
        "subtitle": "",
        "date": "Feb 12, 2020 8:30AM EST",
        "content": "\nClover point-of-sale technology enhances efficiency at restaurants like Makers & Finders\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nRestaurants can offer guests a more efficient, flexible, and secure payment experience with Scan to Pay, a first of its kind feature available with the Clover® platform from Fiserv, Inc., (NASDAQ: FISV), a leading provider of financial services technology. Developed to expedite the payments experience in response to consumers’ increasing expectations for speed and convenience, Scan to Pay helps eliminate inefficiencies within the traditional full-service restaurant payment process by allowing a guest to pay a bill and tip within seconds using their iPhone and Apple Pay. Scan to Pay is a pioneering innovation and does not require the download of an additional app.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200212005468/en/\n“As a high-volume restaurant, we wanted a more efficient way for our guests to pay,” said Josh Molina, owner of Makers & Finders in Las Vegas. “Since we began using Scan to Pay with Clover Dining, we have been able to offer a more seamless payment experience to our guests, turning more tables while giving guests a ‘wow’ experience as they pay for their meal.”\n\nWith Scan to Pay, guests use their iPhone camera to scan a Clover-generated QR code at the bottom of their receipt to pay their restaurant bill with Apple Pay. This saves time for both the guest and the server by eliminating the need for the guest to give their credit card to the server and for the server to take the card to the point of sale, process the transaction, and return for a signature. Not only is Apple Pay quick and convenient for both the guest and restaurant, it is also secure as a customer must authorize every transaction with Face ID or Touch ID on their iPhone.\n\nServers know the guest has paid because the bill shows as paid instantly on all the restaurant’s devices. Additionally, guests have access to their restaurant bill on their phone, and if the restaurant is using Clover Feedback, guests can share their comments with the restaurant owner through direct message.\n\nScan to Pay is particularly beneficial in high-volume, full-service restaurants and in locations where guests may have time constraints, such as airport restaurants or venues that serve pre-theater guests, because it facilitates a quick and secure payment experience while enhancing efficiency. The use of Scan to Pay can reduce the time needed to turn a table, which can allow staff to serve more guests per shift and create opportunities to increase revenue and tips.\n\n“As restaurants look for new ways to adapt to consumer trends and offer quality dining experiences, Scan to Pay puts the power of when to pay and leave into the hands of the restaurant guest, creating a better dining experience and reducing extra tasks for servers,” said John Beatty, co-founder of Clover. “Scan to Pay represents another step forward for Clover as we continue to build out our core technology capabilities and provide additional solutions that can help merchants grow their businesses and delight their guests.”\n\nClover is a market-leading point-of-sale (POS) platform with more than one million merchant devices distributed globally, processing more than $100 billion in annualized payment volume. Clover functions as a complete business-management platform enabling merchants to maximize their operating efficiencies and grow, while allowing customers to pay using a debit or credit card or via mobile payment options such as Apple Pay, Google Pay and Samsung Pay.\n\nFor more information on Clover, visit Clover.com.\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources:\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200212005468/en/\nMedia Relations:\nBart Mackey\nManager, Corporate Communications\nFiserv, Inc.\n212-515-0231\nbarton.mackey@fiserv.com\n\nAdditional Contact:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nSource: Fiserv, Inc."
    },
    {
        "title": "Integration of Fiserv and SAP Solutions Helps Businesses Improve Working Capital and Accelerate Digital Transformation",
        "subtitle": "",
        "date": "Feb 10, 2020 8:30AM EST",
        "content": "    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nBusiness-to-business companies around the world have the opportunity to improve working capital, increase operating efficiency, and continue their digital transformation through an integration of technology from Fiserv, Inc. (NASDAQ: FISV) and SAP® SE (NYSE: SAP).\n\nThis combination makes it simple for B2B firms to offer digital payment methods to their customers by bringing together two cloud-based solutions: SnapPay®, an enterprise payments application from First Data, now Fiserv, and SAP digital payments add-on.\n\nMany Fiserv clients are already reaping the benefits from this integration. Brewster Home Fashions, one of the largest global producers and distributors of home decor, uses SnapPay and has successfully migrated to SAP S/4HANA® and SAP ERP with SAP digital payments add-on.\n\n“The real-time integration of SnapPay with the SAP solution is enhancing our process efficiency, reducing our overall cost of doing business, and simplifying payment card industry compliance,” said Daoud Ali, Executive Director of IT at Brewster Home Fashions. “The solution is flexible, efficient and has given our customer service team a new sense of empowerment.”\n\nSAP digital payments add-on helps enable credit card and other digital payment methods subject to the Payment Card Industry Data Security Standard (PCI DSS). Companies running any variant of SAP order or sale-to-cash processes (B2B, B2C, point-of-sale, web) can integrate to certified payment service solutions, including SnapPay, with flexible access to multiple digital payment methods.\n\n“The SnapPay integration with SAP digital payments add-on helps meet the unique needs of B2B and B2C customers,” said Dr. Oliver Kroneisen, vice president and head of Financial Operations Development at SAP. “Brewster Home Fashions exemplifies how our continued commitment benefits customers.”\n\nA flagship Fiserv enterprise payments solution, SnapPay is built to serve the accounts receivable and accounts payable needs of large and mid-sized companies. Through integration with SAP ERP Central Component and SAP S/4HANA, SnapPay facilitates card, Automated Clearing House (ACH), and new digital payment methods. The solution also digitizes labor-intensive corporate treasury operations into a real-time, automated, and secure experience.\n\n“Improving working capital is a top priority for most businesses,” said Suhas Gosavi, senior vice president, B2B Payments and eCommerce at Fiserv. “To meet that need we innovated on our existing SnapPay integration with SAP solutions to make it even easier for clients to access payment services, reduce days sales outstanding, and automate back-office processes.”\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources\n\nAbout Fiserv\n\nFirst Data is now Fiserv.\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE®500 and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nSAP Forward-looking Statement \n\nAny statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as “anticipate,” “believe,” “estimate,” “expect,” “forecast,” “intend,” “may,” “plan,” “project,” “predict,” “should” and “will” and similar expressions as they relate to SAP are intended to identify such forward-looking statements. SAP undertakes no obligation to publicly update or revise any forward-looking statements.\n\nAll forward-looking statements are subject to various risks and uncertainties that could cause actual results to differ materially from expectations. The factors that could affect SAP's future financial results are discussed more fully in SAP's filings with the U.S. Securities and Exchange Commission (\"SEC\"), including SAP's most recent Annual Report on Form 20-F filed with the SEC. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates.\n\nSAP, SAP S/4HANA, and other SAP products and services mentioned herein as well as their respective logos are trademarks or registered trademarks of SAP SE in Germany and other countries. Please see https://www.sap.com/copyright for additional trademark information and notices. All other product and service names mentioned are the trademarks of their respective companies.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200210005258/en/\nMedia Relations:\nChase Wallace\nDirector, Communications\nFiserv, Inc.\n404-890-2132\nchase.wallace@fiserv.com \n\nAdditional Contact:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Open Banking is Accelerating Financial Services Transformation Says Fiserv Whitepaper",
        "subtitle": "",
        "date": "Feb 7, 2020 8:48AM EST",
        "content": "\nOpen technology facilitates partnerships, customer engagement and growth\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, has published a whitepaper outlining how financial institutions that take a strategic approach to open banking can enable competitive differentiation, better customer experiences and accelerated growth.\n\nThe Open Banking: Start Now and Move Fast paper can be downloaded at fisv.co/openbanking-start-now-move-fast.\n\n“Financial institutions need new ways to keep up with the demand for competitive offerings that attract new customers,” said Sunil Sachdev, senior vice president and general manager, Community Segment, Bank Solutions at Fiserv. “Open banking has empowered financial institutions of all sizes, including local community banks, to work independently with Fintechs to create unique value propositions.”\n\nIn the whitepaper, Fiserv details three key ways financial institutions can use an open banking approach to enhance their market competitiveness: moving faster to develop and deliver high-value experiences, partnering with complementary Fintechs to expand their services, and becoming “the bank behind the Fintech” by offering Banking as a Service (BaaS) to fuel a tech company’s banking functionality.\n\nThe whitepaper explores the current state of open banking and provides insights into areas such as:\n\nAccording to a recent Celent Model Bank case study, Synchrony Financial, a consumer financial services company, successfully completed its own open banking initiative in partnership with Fiserv. Synchrony’s enhanced Business Services Layer technology now provides cloud-based architecture, allowing easy integration for new solutions.\n\n“A clear strategy and the right technology resources and support are all that is needed for a financial institution to move forward with open banking,” said Todd Horvath, group president of Account Processing at Fiserv. “Wherever financial institutions choose to start, they should focus on creating differentiation in the market, making a positive impact on the consumer experience, and aligning themselves with a technology partner that can offer strategic and tactical support.”\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources:\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200207005293/en/\nMedia Relations:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nAdditional Contact:\nMarcus Hardy\nManager, Public Relations\nFiserv, Inc.\n801-823-5534\nmarcus.hardy@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "ZA Bank Readies for Transformation of Hong Kong Banking with Selection of Fiserv Payment Technology",
        "subtitle": "",
        "date": "Feb 6, 2020 3:00AM EST",
        "content": "\nDigital-ready, API-enabled issuer processing platform accelerates service launch\n    BROOKFIELD, Wis. & HONG KONG--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, and ZA Bank, the first virtual bank to launch a pilot trial in Hong Kong, today announced that the bank is leveraging technology from Fiserv to enable a transformative banking experience for its customers.\n\nWith its “Community-Driven” approach, ZA Bank has prioritized the rapid launch of innovative capabilities that align with customers’ changing lifestyles. To help ZA Bank fulfill this goal, Fiserv is equipping the bank with VisionPLUS® global payment software, which supports the entire card payment lifecycle, including origination, card issuance, authorization, settlement and customer service. Its service-oriented core architecture and open APIs enable quicker application development and integration, which in turn allows financial institutions like ZA Bank to develop and launch innovative products faster and at a lower cost.\n\n“We are pleased to partner with Fiserv as we embark on a journey to shift the lifestyle of future banking users,” said Rockson Hsu, CEO of ZA Bank. “With our companies’ combined knowledge and expertise in banking and technology, we are well-placed to respond fast to the ever-changing market with an agile product development approach. By doing so, we can better cater to customers’ needs with cutting-edge offerings.”\n\nThe flexibility and scalability of the VisionPLUS platform, along with the extensive experience of the Fiserv team, will complement ZA Bank’s existing capabilities in product innovation.\n\n“Ultimately, we want to offer superb user experiences via a robust and secure platform. I am confident that with the support of Fiserv, ZA Bank will be well-positioned to deliver relevant, convenient and excellent services to our users,” Rockson said.\n\n“The launch of ZA Bank is an important milestone in the financial services sector in Hong Kong and across Asia Pacific, as it is a modern banking option aligned to the changing way people want to move and manage money,” said Ivo Distelbrink, EVP and head of Asia Pacific, Fiserv. “Fiserv is enabling the digital transformation of many institutions in the region and will continue to help banks that are focused on digital experiences to innovate, differentiate and operate more efficiently.”\n\nFiserv is a leading global provider of financial services technology solutions, serving thousands of financial institutions and millions of businesses in more than 100 countries. The company works with corporates, banks and non-bank financial institutions in 15 markets across Asia Pacific, providing technology and expertise to enable institutions to successfully execute their banking and payments strategies.\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAbout ZA Bank\n\nZA Bank Limited (“ZA Bank”), licensed by the Hong Kong Monetary Authority (“HKMA”) on 27 March 2019, is one of the first batch of virtual banks in Hong Kong, offering a wide range of online financial services to Hong Kong users. ZA Bank was established by ZhongAn Technologies International Group Limited (“ZA International”). With its “Community-Driven” approach, ZA Bank encourages users to directly contribute to its product development and design process together, guiding the bank to design and develop innovative products and services that will better serve the needs of Hong Kong customers.\n\nZA International was established in Hong Kong in December 2017, by ZhongAn Online P&C Insurance Co., Ltd. (HKEX stock code: 6060), an online-only insurtech company in China, to explore international business development, collaboration and investment opportunities in the area of fintech and Insurtech in overseas market.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005293/en/\nMedia Relations:\nDorothy Wu\nDirector\nMarketing & Communications\nFiserv, Inc.\n852 3746 6847\ndorothy.wu@fiserv.com\n\nDorothy Xu\nSenior Manager\nPublic Relations\nZA Bank\n852 6737 2153\ndorothy.xu@za.group\nSource: Fiserv, Inc."
    },
    {
        "title": "Financial Institutions Add Capabilities for Small Business Clients with Merchant Solutions from Fiserv",
        "subtitle": "",
        "date": "Feb 5, 2020 8:30AM EST",
        "content": "\nFirst Foundation Bank and Central Missouri Community Credit Union are among the financial institutions adding a merchant solutions offering to their portfolio\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, today announced that more than 50 financial institutions that utilize a Fiserv core processing platform added merchant solutions to their portfolio between the late July combination of Fiserv and First Data and the end of 2019.\n\nPairing a merchant offering alongside core technology from Fiserv allows banks and credit unions to better identify business banking opportunities, enable digital enrollment for merchant solutions, and deliver differentiated value to small and mid-sized businesses through the could-based Clover® platform from First Data, now Fiserv.\n\nFirst Foundation Bank, which has 20 locations across California, Nevada and Hawaii, launched its merchant services program with Fiserv in October of 2019.\n\n“Our new offering is helping us attract small business merchant customers, enabling them to create a merchant account in minutes, and giving us the opportunity to digitally market additional services to them,” said Tracy Miller, Senior Vice President, Director of Depository Services at First Foundation Bank. “The customer service Fiserv is providing our branch managers and merchant customers has been excellent. They have gone above and beyond.”\n\nCentral Missouri Community Credit Union, a Fiserv core processing client for more than 30 years, has also added merchant solutions.\n\n“Adding merchant solutions from Fiserv will enable us to offer significant new value to our members who own and operate small businesses in our community,” said Carol White, Chief Executive Officer, Central Missouri Community Credit Union. “Payment acceptance is the lifeblood of small businesses, and we look forward to partnering with those small business owners in their future success.”\n\nFiserv completed its acquisition of First Data on July 29, 2019. The combination of the two companies built an offering of end-to-end solutions spanning the value chain of payments, including four benefits for financial institutions that are unique in the industry:\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAbout Fiserv\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200205005381/en/\nMedia Relations:\nChase Wallace\nDirector, Communications\nFiserv, Inc.\n404-890-2132\nchase.wallace@fiserv.com\n\nAdditional Contact:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Feb 4, 2020 4:01PM EST",
        "content": "\nGAAP revenue growth of 161% in the quarter and 75% for the year;\nGAAP EPS decrease of 49% in the quarter and 40% for the year;\nInternal revenue growth of 5% in the quarter and 6% for the year;\nAdjusted EPS increase of 18% in the quarter and 16% for the year;\nCompany expects 2020 internal revenue growth of 6% to 8%\nand adjusted EPS growth of 23% to 27%\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of payments and financial services technology solutions, today reported financial results for the fourth quarter and full year 2019.\n\nFourth Quarter and Full Year 2019 GAAP Results\n\nOn a GAAP basis, the financial results of First Data Corporation (\"First Data\") are included in the consolidated results of Fiserv, Inc. from July 29, 2019, the date of acquisition. GAAP revenue for the company increased 161% to $4.05 billion in the fourth quarter of 2019 compared to the prior year period, with $2.46 billion from the First Data segment, 5% growth in the Payments segment and 1% decline in the Financial segment. Full year 2019 GAAP revenue for the company increased 75% to $10.19 billion compared to the prior year, with $4.08 billion from the First Data segment, 8% growth in the Payments segment and 1% growth in the Financial segment.\n\nGAAP earnings per share was $0.36 in the fourth quarter of 2019 and $1.71 for the full year, decreasing 49% and 40%, respectively, compared to the prior year periods. GAAP earnings per share in 2019 included transaction and related integration costs and acquired intangible asset amortization from the application of purchase accounting associated with the First Data acquisition. GAAP earnings per share in 2018 included a gain on the sale of a 55% interest of the company's Lending Solutions business (the \"Lending Transaction\").\n\nGAAP operating margin was 11.8% and 15.8% in the fourth quarter and full year 2019, respectively, compared to 27.8% and 30.1% in the fourth quarter and full year 2018, respectively. GAAP operating margin in 2019 included the operating margin impacts from transaction and related integration costs and acquired intangible asset amortization associated with the acquisition of First Data. GAAP operating margin in 2018 included a $227 million gain resulting from the Lending Transaction.\n\nNet cash provided by operating activities was $2.80 billion in 2019 compared to $1.55 billion in 2018.\n\n“2019 was a year of leadership and growth in which we took steps to transform an industry to better enable long-term, differentiated value for clients, associates and shareholders,” said Jeffery Yabuki, Chairman and Chief Executive Officer of Fiserv. “We delivered strong financial results including our 34th consecutive year of double digit adjusted earnings per share growth.”\n\nFourth Quarter and Full Year 2019 Non-GAAP Results and Additional Information\n\nOn an adjusted non-GAAP basis, the company's financial performance measures in this release, including adjusted revenue, internal revenue, adjusted operating margin, adjusted net income, adjusted earnings per share and free cash flow, have been recalculated to provide current and historical results on a combined company basis to enhance investors' ability to evaluate the company's operating performance on a combined basis with First Data.\n\nOutlook for 2020\n\nFiserv expects internal revenue growth of 6% to 8% for 2020. The company also expects adjusted earnings per share to grow in a range of 23% to 27% ($4.86 to $5.02) over the adjusted earnings per share for 2019 as revised for the net impact of divestitures including the Investment Services transaction announced in December.\n\n\"We expect to deliver exceptional financial results in 2020 including accelerated internal revenue growth resulting from a combination of our strong underlying business and meaningful synergy opportunities,” said Yabuki.\n\nEarnings Conference Call\n\nThe company will discuss its results on a conference call and webcast at 4 p.m. CT on Tuesday, February 4, 2020. To register for the event, go to fiserv.com and click on the Q4 Earnings webcast link. Supplemental materials will be available in the \"Investor Relations\" section of the website.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among FORTUNE World's Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nUse of Non-GAAP Financial Measures\n\nDue to the financial impact of the First Data acquisition, the company's non-GAAP financial performance measures have been recalculated in this news release on a combined company basis for the fourth quarter of 2018 and the full years 2019 and 2018. The combined financial information has been prepared by making certain adjustments to the sum of historical First Data financial information determined in accordance with generally accepted accounting principles (\"GAAP\") and historical Fiserv financial information determined in accordance with GAAP. The historical combined financial information includes various estimates and is not necessarily indicative of the operating results of the combined companies had the transaction been completed at the assumed dates or of the combined companies in the future. The historical combined financial information does not reflect any cost savings or other synergies anticipated as a result of the acquisition. In addition, the historical combined financial information does not reflect the impact of any purchase accounting adjustments that may arise from the acquisition as those impacts would be excluded in the preparation of the combined financial information. The combined financial information is not pro forma information prepared in accordance with Article 11 of Regulation S-X of the Securities and Exchange Commission, and the preparation of information in accordance with Article 11 would result in a significantly different presentation.\n\nThe company supplements its and First Data's historical reporting of information determined in accordance with GAAP, such as revenue, operating income, operating margin, net income, earnings per share and net cash provided by operating activities, with \"combined revenue,\" \"adjusted revenue,\" \"internal revenue,\" \"internal revenue growth,\" \"combined operating income,\" \"adjusted operating income,\" \"adjusted operating margin,\" \"combined net income attributable to Fiserv,\" \"adjusted net income,\" \"combined earnings per share,\" \"adjusted earnings per share,\" \"combined net cash provided by operating activities,\" and \"free cash flow.\" Management believes that providing combined historical financial information, making adjustments for certain non-cash or other items and excluding certain pass-through revenue and expenses with respect to such combined information should enhance shareholders' ability to evaluate the combined company's performance, including providing a reasonable basis of comparison with its results for post-acquisition periods and providing additional insights into the factors and trends affecting the combined company's business. Therefore, the company excludes these items from its and First Data's historical combined revenue, combined operating income, combined net income attributable to Fiserv, combined earnings per share and combined net cash provided by operating activities to calculate these non-GAAP measures. The corresponding reconciliations of adjusted financial measures to the most comparable GAAP measures are included in this news release, except for forward-looking measures where a reconciliation to the corresponding GAAP measures is not available due to the variability, complexity and limited visibility of the non-cash and other items that are excluded from the non-GAAP outlook measures. See page 18 for additional information regarding the company's forward-looking non-GAAP financial measures.\n\nExamples of non-cash or other items may include, but are not limited to, non-cash deferred revenue adjustments arising from acquisitions; non-cash intangible asset amortization expense associated with acquisitions; non-cash impairment charges; severance and restructuring costs; net charges associated with debt financing activities including foreign currency transaction gains, early debt extinguishment and bridge financing costs; merger and integration costs; gains or losses from the sale of businesses; and certain discrete tax benefits and expenses. The company excludes these items to more clearly focus on the factors management believes are pertinent to the company's operations, and management uses this information to make operating decisions, including the allocation of resources to the company's various businesses.\n\nThe company adjusts its non-GAAP results to exclude amortization of acquisition-related intangible assets as such amounts are inconsistent in amount and frequency and are significantly impacted by the timing and/or size of acquisitions. Management believes that the adjustment of acquisition-related intangible asset amortization supplements GAAP information with a measure that can be used to assess the comparability of operating performance. Although the company excludes amortization from acquisition-related intangible assets from its non-GAAP expenses, management believes that it is important for investors to understand that such intangible assets were recorded as part of purchase accounting and contribute to revenue generation.\n\nManagement believes internal revenue growth is useful because it presents combined adjusted revenue growth including deferred revenue purchase accounting adjustments and excluding the impact of foreign currency fluctuations, acquisitions, dispositions and the company's Output Solutions postage reimbursements. Management believes free cash flow is useful to measure the funds generated in a given period that are available for debt service requirements and strategic capital decisions. Management believes this supplemental information enhances shareholders' ability to evaluate and understand the company's core business performance.\n\nThese non-GAAP measures may not be comparable to similarly titled measures reported by other companies and should be considered in addition to, and not as a substitute for, revenue, operating income, operating margin, net income, earnings per share and net cash provided by operating activities or any other amount determined in accordance with GAAP.\n\nForward-Looking Statements\n\nThis news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding anticipated internal revenue growth, adjusted earnings per share and adjusted earnings per share growth. Statements can generally be identified as forward-looking because they include words such as “believes,” “anticipates,” “expects,” “could,” “should,” or words of similar meaning. Statements that describe the company’s future plans, objectives or goals are also forward-looking statements.\n\nForward-looking statements are subject to assumptions, risks and uncertainties that may cause actual results to differ materially from those contemplated by such forward-looking statements. The factors that could cause the company’s actual results to differ materially include, among others: the possibility that the company may be unable to achieve expected synergies and operating efficiencies from the acquisition of First Data within the expected time frames or at all or to successfully integrate the operations of First Data into the company's operations; such integration may be more difficult, time-consuming or costly than expected; profitability following the transaction may be lower than expected, including due to unexpected costs, charges or expenses resulting from the transaction; operating costs, customer loss and business disruption (including, without limitation, difficulties in maintaining relationships with employees, customers, clients or suppliers) may be greater than expected following the transaction; unforeseen risks relating to the company's liabilities or those of First Data may exist; the company's ability to meet expectations regarding the accounting and tax treatments of the transaction; the company's ability to compete effectively against new and existing competitors and to continue to introduce competitive new products and services on a timely, cost-effective basis; changes in customer demand for the company's products and services; rapid technological developments and changes, and the ability of the company's technology to keep pace with a rapidly evolving marketplace; the successful management of the company's merchant alliance program which involves several alliances not under its sole control; the impact of a security breach or operational failure on the company's business including disruptions at other participants in the global financial system; the failure of the company's third party vendors and merchants to satisfy their obligations; the successful management of credit and fraud risks in the company's business units and merchant alliances; changes in local, regional, national and international economic or political conditions and the impact they may have on the company and its customers; the effect of proposed and enacted legislative and regulatory actions affecting the financial services industry as a whole and/or the company; the company's ability to comply with government regulations and applicable card association and network rules; the protection and validity of intellectual property rights; the outcome of pending and future litigation and governmental proceedings; the company's ability to successfully identify, complete and integrate acquisitions, and to realize the anticipated benefits associated with the same; the impact of the company's strategic initiatives; the company's ability to attract and retain key personnel; changes in the interest rate environment that increase interest on the company's borrowings or the interest rate at which the company can refinance its borrowings; adverse impacts from currency exchange rates or currency controls imposed by any government or otherwise; and other factors included in “Risk Factors” in the company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and in other documents that the company files with the SEC, which are available at http://www.sec.gov. You should consider these factors carefully in evaluating forward-looking statements and are cautioned not to place undue reliance on such statements. The company assumes no obligation to update any forward-looking statements, which speak only as of the date of this news release.\n\nFiserv, Inc.\nFull Year Forward-Looking Non-GAAP Financial Measures\n\nInternal Revenue Growth - The company's internal revenue growth outlook for 2020 excludes the impact of foreign currency fluctuations, acquisitions, dispositions and the impact of the company's Output Solutions postage reimbursements and merchant services adjustments, and includes deferred revenue purchase accounting adjustments. Additionally, the internal revenue growth outlook is calculated based on the combined results of Fiserv and First Data. On a GAAP basis, the financial results of First Data are included in the consolidated results of Fiserv from the date of acquisition. Therefore, the company expects GAAP revenue growth to be significantly higher than internal revenue growth.\n\nAdjusted Earnings Per Share - The company's adjusted earnings per share outlook for 2020 excludes certain non-cash or other items which should enhance shareholders' ability to evaluate the company's performance, as such measures provide additional insights into the factors and trends affecting its business. Non-cash or other items may be significant and include, but are not limited to, non-cash deferred revenue adjustments arising from acquisitions; non-cash intangible asset amortization expense associated with acquisitions; non-cash impairment charges; severance and restructuring costs; net charges associated with debt financing activities including foreign currency transaction gains, early debt extinguishment and bridge financing costs; merger and integration costs; gains or losses from the sale of businesses; and certain discrete tax benefits and expenses. Adjustments to earnings per share that have been incurred in 2019 are presented on page 8 but are not necessarily indicative of adjustments that may be incurred in 2020. Estimates of these adjustments on a forward-looking basis are not available due to the variability, complexity and limited visibility of these items.\n\nThe company's adjusted earnings per share growth outlook for 2020 is based on 2019 adjusted earnings per share performance, including the historical results of First Data on an adjusted combined company basis, as adjusted for the Investment Services Transaction and other divestitures.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005962/en/\nMedia Relations:\nBritt Zarling\nCorporate Communications\nFiserv, Inc.\n414-378-4040\nbritt.zarling@fiserv.com\n\nInvestor Relations:\nPeter Poillon\nInvestor Relations\nFiserv, Inc.\n212-266-3565\npeter.poillon@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv Named a World’s Most Admired Company for Seventh Consecutive Year",
        "subtitle": "",
        "date": "Jan 21, 2020 9:23AM EST",
        "content": "    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, has been named to the annual ranking of FORTUNE “World’s Most Admired Companies®” for the seventh consecutive year. Considered the definitive scorecard on corporate reputation, the designation punctuates a transformative year in which the company announced and completed its combination with payments industry leader First Data Corporation.\n\nFiserv ranked second among companies in the Financial Data Services category, scoring highly for its people management, use of corporate assets, quality of management and long-term investment value. Fiserv was also noted for its quality of products/services and financial soundness.\n\n“This recognition underscores our focus and commitment to excellence in everything we do,” said Jeffery Yabuki, Chairman and Chief Executive Officer of Fiserv. “I thank our more than 40,000 associates who work tirelessly to serve our clients and customers in a rapidly changing world.”\n\nThe FORTUNE World’s Most Admired Companies ranking surveys leading executives from eligible companies, along with directors and analysts, to identify the best-regarded companies within their industries and across industries. FORTUNE collaborated with Korn Ferry on the survey.\n\nThe survey evaluates nine attributes of corporate reputation to determine the industry rankings: innovation; people management; use of corporate assets; social responsibility; quality of management; financial soundness; long-term investment value; quality of products and services; and global competitiveness. A company’s overall score is determined through an average of the individual attribute scores.\n\nIn a world moving faster than ever before, Fiserv helps clients deliver solutions in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional resources\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among the FORTUNE World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121005660/en/\nMedia Relations:\nMark Jelfs\nManager, Public Relations\nFiserv, Inc.\n414-218-4019\nmark.jelfs@fiserv.com\n\nAdditional Contact:\nAnn Cave\nDirector, External Communications\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "DolEx Streamlines Processes with Cloud-Based Deployment of Fiserv Anti-Money Laundering Technology",
        "subtitle": "",
        "date": "Jan 16, 2020 8:30AM EST",
        "content": "\nDeployment will enhance efficiency and enable seamless customer interactions\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, announced today that DolEx Dollar Express, Inc. and its affiliate, Europhil, will enhance their anti-money laundering (AML) processes with technology from Fiserv. DolEx, a provider of retail financial services in the U.S. and Spain, offers wire transfers, consumer loan origination, walk-up bill payment, check cashing, prepaid cards and other services through more than 500 proprietary retail stores and over 2,500 agent locations, facilitating more than $4.5 billion in volume each year.\n\nDolEx will implement cloud-based versions of AML Risk Manager and Payment Fraud Manager from Fiserv, deploying the solutions via Amazon Web Services (AWS) as part of its overall technology strategy.\n\n“DolEx provides essential financial services to underserved consumers, and we are focused on delivering excellent service and value,” said Mario Trujillo, Chief Executive Officer, DolEx Dollar Express, Inc. “By using Fiserv technology we will further strengthen our already robust AML processes. We will gain additional efficiency, scale and flexibility, which will enable better interactions and improved frictionless customer experiences. Think of DolEx as Fintech for the Underbanked.”\n\nAML Risk Manager provides advanced customer risk profiling, risk scoring, transaction monitoring and know your customer (KYC) capabilities, and Payment Fraud Manager is a comprehensive cross-channel monitoring and interdiction solution for electronic payments. The solutions utilize sophisticated techniques such as machine learning to detect suspicious transactions, leading to more accurate fraud detection and fewer false positives. This helps to eliminate the inconvenience and delay caused when legitimate transactions are flagged for investigation, benefitting both customers and staff by facilitating a better experience and more efficient operations.\n\nBoth solutions are designed to scale to handle high volumes of transactions, which is particularly important for DolEx during peak processing periods such as Mother’s Day week and other holiday seasons, when large volumes of money are transferred.\n\n“We enable clients to deploy technology in the way that works best for them,” said Pat Korb, president of Financial & Risk Management Solutions at Fiserv. “AML Risk Manager will enable DolEx to enhance their financial crime prevention capabilities while taking advantage of the scalability and flexibility of cloud-based hosting.”\n\nFiserv offers a wide range of technology deployment and operations choices that enable clients to optimize performance, efficiency, and flexibility in support of their business strategies. From on-premises, hosted, application service provider (ASP), and expanding private or public cloud options, to application programming interface (API) integrations, Fiserv is continually innovating delivery capabilities to drive high-value results for clients.\n\nIn a world that is moving faster than ever before, Fiserv helps clients deliver solutions that are in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources\n\nAbout DolEx Dollar Express, Inc.\n\nDolEx is a multinational company with over 20 years of experience in the Financial Services Industry. They offer a comprehensive selection of must-have products and services, including, among others Domestic and International Remittances, Payments, Check Cashing, and Installment Loans.\n\nAs one of the US leaders in the Retail Financial Services Industry, they take great pride in their unique network of more than 500 proprietary retail stores and over 2,500 independent retail agents that, in partnership with DolEx, serve and meet their customer’s financial service’s needs.\n\nIn the US, DolEx serves the Hispanic community through its two industry-leading brands, DolEx & Quisqueyana. Their retail network has a presence in over 30 US states, Puerto Rico and the US Virgin Islands.\n\nIn Spain, their brand Europhil has been a leader for many years in the Money Transfers Industry. With over 50 proprietary retail stores and close to 500 independent retail agents, they have been fulfilling their customer’s needs sending money to friends & family in Latin America and several other countries and regions around the world, including the Philippines and Africa. To learn more visit DolEx.com or call 1800.892.0210.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover™ cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among the FORTUNE Magazine World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200116005163/en/\nMedia Relations:\nAnn Cave\nDirector, Public Relations\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nAdditional Contact:\nSharada Alvakonda\nMarketing Communications Manager\nFinancial & Risk Management Solutions\nFiserv, Inc.\n+44-7548-705-375\nsharada.alvakonda@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv to Release Fourth Quarter and Full Year Earnings Results on February 4, 2020",
        "subtitle": "",
        "date": "Jan 14, 2020 9:01AM EST",
        "content": "    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of payments and financial services technology solutions, will announce its fourth quarter and full year financial results after the close of regular market trading on Tuesday, February 4, 2020.\n\nThe company will discuss the results in a live webcast at 4 p.m. CT. The webcast, along with supplemental financial information, can be accessed on the investor relations section of the Fiserv website at investors.fiserv.com. A replay will be available approximately one hour after the conclusion of the live webcast.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among the FORTUNE Magazine World's Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005203/en/\nMedia Relations:\nBritt Zarling\nVice President, Corporate Communications\nFiserv, Inc.\n414-378-4040\nbritt.zarling@fiserv.com\n\nInvestor Relations:\nPeter Poillon\nSenior Vice President, Investor Relations\nFiserv, Inc.\n212-266-3565\npeter.poillon@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Landmark Credit Union Extends Fiserv Relationship to Support Growth",
        "subtitle": "",
        "date": "Jan 8, 2020 8:30AM EST",
        "content": "\nHalf of all Wisconsin credit unions over $1 billion in assets rely on Fiserv for core account processing\n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, today announced that Landmark Credit Union, based in New Berlin, Wisconsin, has expanded its relationship with Fiserv to accelerate innovation and enhance efficiency in order to continue to offer excellent experiences for both members and associates.\n\nFounded in 1933, Landmark Credit Union has experienced tremendous growth and is the largest credit union in Wisconsin with more than $4.3 billion in assets. The organization has more than 720 employees, who serve over 350,000 members at 32 locations throughout Southern Wisconsin.\n\nThe credit union’s growth prompted an evaluation of their core account processing capabilities. Based on a positive and long-standing relationship with Fiserv, Landmark Credit Union has selected DNA® from Fiserv as its new core account processing platform. The credit union appreciated the open architecture and APIs of DNA, and the ability to combine member, business and mortgage loan servicing on one platform. The move to DNA will provide the credit union with a global view of member relationships and enable its associates to better understand and anticipate member needs.\n\n“As we have grown in size and scale, what we want to do and provide our members has become more complex,” said Steve Hannan, chief information officer, Landmark Credit Union. “With Fiserv and DNA, we’ll have a flexible, scalable and extensible core system that will help us meet the current and future needs of our members and associates.”\n\nDNA is a modern core account processing platform with an open architecture that makes it easier for financial institutions to integrate other solutions, bring products and services online quickly, and add new capabilities using downloadable DNAapps™. DNA has been recognized by industry-leading analysts for its technology, user experience and breadth of functionality.\n\n“Fiserv provides credit unions with innovative solutions at every stage of their lifecycle,” said Byron Vielehr, executive vice president and senior group president, Fiserv. “Landmark has grown with Fiserv, and we look forward to working with them in the years to come to drive long-term value and help support their commitment to offering varied, meaningful experiences and financial solutions for their members.”\n\nIn a world that is moving faster than ever before, Fiserv helps clients deliver solutions that are in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources:\n\nAbout Landmark Credit Union\nLandmark Credit Union lives by the words “You’re worth more here.” As a not-for-profit financial cooperative, the credit union returns profits to its members, who enjoy better rates and lower fees on a full range of straightforward financial options. By choosing Landmark, members save money, and have more for the things that really matter. Today, Landmark has grown to 32 branches serving those who live and work in Southern Wisconsin with over $4.3 billion in assets and more than 350,000 members. To learn more, visit www.landmarkcu.com.\n\nAbout Fiserv\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among the FORTUNE Magazine World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005232/en/\nMedia Relations:\nMarcus Hardy\nManager, Public Relations\nFiserv, Inc.\n801-823-5534\nmarcus.hardy@fiserv.com\n\nAdditional Contact:\nAnn S. Cave\nDirector, Public Relations\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\nSource: Fiserv, Inc."
    },
    {
        "title": "Verve, a Credit Union, Streamlines Growth Processes and Expands Commercial Offerings with Move to Fiserv",
        "subtitle": "",
        "date": "Jan 8, 2020 8:30AM EST",
        "content": "\nWith addition of Verve, half of all $1 billion-plus credit unions in Wisconsin now rely on Fiserv for core account processing \n    BROOKFIELD, Wis.--(BUSINESS WIRE)--\nFiserv, Inc. (NASDAQ: FISV), a leading global provider of financial services technology solutions, announced today that Verve, a Credit Union, based in Oshkosh, Wisconsin, will enable its ongoing innovation and growth by moving to Fiserv for core account processing.\n\nVerve has been growing rapidly since 2014 through organic expansion and a series of credit union mergers. Recently, the credit union announced its intent to acquire a bank in downtown Chicago, its first bank acquisition, and has plans to continue its growth trajectory.\n\nThe credit union selected DNA® from Fiserv, citing the platform’s open architecture and APIs that facilitate integration with additional solutions from Fiserv and third parties, as well as the platform’s ability to support servicing of all loan types from a single system. These functions will help Verve continue to deliver the capabilities and experiences members and employees expect as it grows and brings acquired financial institutions into the fold.\n\n“We want to be in a position to offer our members services before they realize they need them,” said Karrie Drobnick, chief marketing and strategy officer at Verve. “Fiserv and DNA will expedite our ability to do that, whether it’s through Fiserv or a third-party solution. This is just one of the areas where we have valuable strategic alignment with the Fiserv team. We both put member experience at the center of what we do.”\n\nDNA is a modern, unified core account processing platform that provides a global view of member relationships, enabling financial institutions to deliver personalized service and more relevant product offerings. The open architecture of DNA makes it easy for financial institutions to integrate other solutions, bring products and services online quickly, and extend the capabilities of DNA with downloadable DNAapps™.\n\nAs part of their technology transformation, the credit union also added several integrated solutions from Fiserv including enterprise content management, item processing, wire transfer and financial accounting.\n\n“Our aim is to make every experience at every credit union we work with matter – and that aligns directly with Verve’s strategic vision,” said Byron Vielehr, executive vice president and senior group president, Fiserv. “The strong retail and commercial functionality of DNA helps growth-minded credit unions meet member needs for new services and allows their employees to interact and deliver meaningful experiences in a frictionless way.”\n\nIn addition to Verve, Superior Choice Credit Union recently selected Fiserv, choosing DNA for account processing.\n\nSuperior Choice Credit Union, based in Superior, Wisconsin, wanted a platform that would help improve operational efficiencies, including streamlining processes, and expanding commercial capabilities. Open since 1932, Superior Choice Credit Union serves more than 29,000 members.\n\nIn a world that is moving faster than ever before, Fiserv helps clients deliver solutions that are in step with the way people live and work today – financial services at the speed of life. Learn more at fiserv.com.\n\nAdditional Resources:\n\nAbout Verve\n\nOriginally founded in 1937 as Wisconsin Axle Credit Union in Oshkosh, Wisconsin, Verve later merged with two other credit unions in 2014 and rebranded to Verve, a Credit Union. The name was chosen to represent the qualities that define the organization: enthusiasm, energy, strength and drive. The name is also reflective of how we serve our members and community. Today, Verve is one of the largest credit unions in the state of Wisconsin, and will have over $1.2 billion in assets, more than 66,000 members and 21 locations once recently announced acquisitions are complete. Visit verveacu.com to learn more.\n\nAbout Fiserv\n\nFiserv, Inc. (NASDAQ: FISV) aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover® cloud-based point-of-sale solution. Fiserv is a member of the S&P 500® Index and the FORTUNE® 500, and is among the FORTUNE Magazine World’s Most Admired Companies®. Visit fiserv.com and follow on social media for more information and the latest company news.\n\nFISV-G\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005231/en/\nMedia Relations:\nMarcus Hardy\nManager, Public Relations\nFiserv, Inc.\n801-823-5534\nmarcus.hardy@fiserv.com\n\nAdditional Contact:\nAnn Cave\nDirector, Public Relations\nFiserv, Inc.\n678-325-9435\nann.cave@fiserv.com\n\nSource: Fiserv, Inc."
    },
    {
        "title": "Fiserv and ExxonMobil will Enable Consumers to Fill Up by Asking Alexa to Pay at the Pump",
        "subtitle": "",
        "date": "Jan 6, 2020 9:12AM EST",
        "content": "\n      Later this year, consumers will be able to use voice to pay for fuel\n      at over 11,500 Exxon and Mobil stations\n        BROOKFIELD, Wis. & LAS VEGAS--(BUSINESS WIRE)--\n      Ahead of CES 2020, ExxonMobil and Fiserv announced that they are\n      transforming the way people pay for gasoline using Amazon Alexa. Coming\n      later this year, consumers with Alexa-enabled vehicles, Echo Auto, and\n      other Alexa-enabled mobility devices will be able to say, “Alexa, pay\n      for gas” when they pull up to the pump. This new experience will\n      initially be available at over 11,500 Exxon and Mobil stations in the\n      U.S., and is being demonstrated for the first time at CES 2020 in the\n      Amazon Automotive booth (Las Vegas Convention Center, North Hall #5616).\n    \n      Transactions will be processed using Amazon Pay, allowing consumers to\n      securely use the payment information stored in their Amazon account, and\n      powered by digital commerce technology from Fiserv, Inc. (NASDAQ:FISV),\n      a leading global provider of payments and financial services technology\n      solutions.\n    \n      “We’re excited to bring new technology and better experiences to the gas\n      station,” said Eric Carmichael, Americas fuels marketing manager at\n      ExxonMobil. “We build and seek out technology that will wow our\n      consumers, providing both ease of use and security.”\n    \n      “As consumer expectations change, there is growing demand for\n      frictionless interactions that span the digital and physical worlds,”\n      said Devin McGranahan, senior group president, Global Business Solutions\n      at Fiserv. “The age of connected commerce is here, and voice-activated\n      smart devices will play a pivotal role in the future of payments by\n      streamlining the way consumers make purchases every day.”\n    \n      Alexa, Pay for Gas\n    \n      Paying for gas with Alexa is a seamless process for the consumer. When a\n      consumer is in an Alexa-enabled vehicle, or using Echo Auto or another\n      Alexa-enabled mobility device at an Exxon or Mobil station, they simply\n      say, “Alexa, pay for gas.” Alexa confirms the station location and the\n      pump number. Digital commerce technology from Fiserv will activate the\n      pump and facilitate token generation to help ensure a secure payment\n      experience. Payments will be processed through Amazon Pay; no additional\n      sign-up or separate account is required.\n    \n      View the “Alexa, pay for gas” experience at https://bit.ly/2t9D5dI.\n    \n      ExxonMobil has a strong history of innovation at the pump, debuting the\n      first pay-at-the-pump service in the 1980s and launching radio frequency\n      identification (RFID)-enabled touchless payment in the 1990s. And, as\n      the first fuel provider to offer voice-activated purchase through this\n      new Alexa experience, ExxonMobil is proud to announce another simple and\n      secure way to pay, expanding its payment solutions beyond the current Exxon\n      Mobil Rewards+TM app.\n    \n      Fiserv is bringing merchants and technology providers together to\n      deliver a connected\n      commerce experience that provides frictionless commerce securely and\n      at scale. By enabling connections between otherwise disparate merchants\n      – such as automakers and gas stations, or restaurants and sports venues\n      – Fiserv effectively bridges the gap between digital and\n      brick-and-mortar commerce, powering a seamless consumer experience while\n      allowing businesses to maximize their footprint in the digital world.\n    \n      With millions of business clients, including the world’s largest brands,\n      payment networks and mobile wallets, Fiserv can support an unmatched\n      connected ecosystem that enables commerce to follow consumers across\n      omni-channel devices, including mobile phones, connected cars, and\n      internet of things (IoT) devices.\n    \n      In a world moving faster than ever before, Fiserv helps clients deliver\n      solutions in step with the way people live and work today – financial\n      services at the speed of life. Learn more at fiserv.com.\n    \n      About ExxonMobil\n    \n      ExxonMobil, the largest publicly traded international oil and gas\n      company, uses technology and innovation to help meet the world’s growing\n      energy needs. ExxonMobil holds an industry-leading inventory of\n      resources, is one of the largest refiners and marketers of petroleum\n      products, and its chemical company is one of the largest in the world.\n      For more information, visit www.exxonmobil.com\n      or follow us on Twitter at www.twitter.com/exxonmobil.\n    \n      About Fiserv\n    \n      Fiserv, Inc. (NASDAQ:FISV) aspires to move money and information in a\n      way that moves the world. As a global leader in payments and financial\n      technology, the company helps clients achieve best-in-class results\n      through a commitment to innovation and excellence in areas including\n      account processing and digital banking solutions; card issuer processing\n      and network services; payments; e-commerce; merchant acquiring and\n      processing; and the Clover ® cloud-based point-of-sale solution. Fiserv\n      is a member of the S&P 500 ® Index and the FORTUNE ® 500, and is among\n      the FORTUNE Magazine World’s Most Admired Companies ®. Visit fiserv.com\n      and follow\n      on social media for more information and the latest company news.\n    \n      FISV-G\n    View source version on businesswire.com: https://www.businesswire.com/news/home/20200106005579/en/\n      Fiserv Media Relations:Chase WallaceDirector, CommunicationsFiserv,\n      Inc.404-890-2132chase.wallace@fiserv.com\n    \n      ExxonMobil Media Relations:832-625-4000\n    Source: Fiserv, Inc. and ExxonMobil"
    }
]