[
    {
        "title": "Fox Corporation No Longer Participating in Morgan Stanley Technology, Media & Telecom Conference",
        "subtitle": "",
        "date": "Mar 3, 2020 4:05PM EST",
        "content": "NEW YORK and LOS ANGELES, March 3, 2020 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (\"FOX\") today announced that FOX will no longer be participating in the Morgan Stanley Technology, Media & Telecom Conference on March 4. The decision was made out of an abundance of caution due to evolving public health concerns regarding COVID-19. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-no-longer-participating-in-morgan-stanley-technology-media--telecom-conference-301015758.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Completes Acquisition of Seattle Duopoly and Milwaukee Stations",
        "subtitle": "",
        "date": "Mar 2, 2020 4:05PM EST",
        "content": "NEW YORK and LOS ANGELES, March 2, 2020 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (\"FOX\") today announced it has completed the previously announced purchase of Seattle stations KCPQ-TV FOX 13 and KZJO-TV MyNetworkTV 22 as well as Milwaukee station WITI  FOX 6 from Nexstar Media Group (Nasdaq: NXST). With this transaction, FOX Television Stations expands its market presence to 14 of the top 15 DMAs and adds two markets that overlap with FOX's National Football League, Major League Baseball and college football broadcast packages. \n                        \n                    \n                As part of the same transaction, FOX sold its duopoly in Charlotte, NC, WJZY-TV FOX 46 and WMYT-TV MyNetwork 55 to Nexstar. WJZY will remain a FOX affiliate. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com. \n                        \n                    \n                 View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-completes-acquisition-of-seattle-duopoly-and-milwaukee-stations-301014695.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Executive Chairman and Chief Executive Officer Lachlan Murdoch to Participate at Upcoming Morgan Stanley Technology, Media & Telecom Conference",
        "subtitle": "",
        "date": "Feb 20, 2020 12:00PM EST",
        "content": "NEW YORK and LOS ANGELES, Feb. 20, 2020 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) today announced that Executive Chairman and Chief Executive Officer Lachlan Murdoch will participate in a keynote session at the Morgan Stanley Technology, Media & Telecom Conference on Wednesday, March 4 in San Francisco, CA at approximately 10:30am (Pacific), 1:30pm (Eastern).A live audio webcast of the presentation, and the archived webcast, will be available at investor.foxcorporation.com.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-executive-chairman-and-chief-executive-officer-lachlan-murdoch-to-participate-at-upcoming-morgan-stanley-technology-media--telecom-conference-301008531.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Reports Second Quarter Fiscal 2020 Revenues Of $3.78 Billion, An Increase Of 5%",
        "subtitle": "",
        "date": "Feb 5, 2020 4:05PM EST",
        "content": "NEW YORK, Feb. 5, 2020 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (\"FOX\" or the \"Company\") today reported financial results for the three months ended December 31, 2019.The Company reported total quarterly revenues of $3.78 billion, a 5% increase from the $3.58 billion of revenues in the prior year quarter. This increase includes affiliate revenue growth of 7%, reflecting growth at both the Television and Cable Network Programming segments, and advertising revenue growth of 1%, which was achieved despite the comparative effect of record political advertising revenues from the mid-term elections at the Company's owned and operated television stations in the prior year quarter. The Company also reported a 32% increase in other revenues, led by growth at the Cable Network Programming segment and higher revenues at the Other, Corporate and Eliminations segment attributable to the operation of the FOX Studios Lot for third parties and the consolidation of Credible Labs Inc.Quarterly net income increased to $314 million from the $24 million in the prior year quarter, primarily due to unrealized gains recognized in other, net related to changes in the fair values of the Company's investments in Roku, Inc. and The Stars Group Inc., partially offset by higher operating, selling, general and administrative and net interest expenses. The increases in selling, general and administrative and net interest expenses primarily reflect higher costs related to FOX operating as a standalone public company following the Distribution1. Quarterly net income attributable to Fox Corporation stockholders increased to $300 million ($0.48 per share) compared to $8 million ($0.01 per share) in the prior year quarter. Quarterly Adjusted EBITDA2 of $261 million was lower than the prior year quarter, primarily due to lower contributions at the Television segment. Adjusted net income attributable to Fox Corporation stockholders3 was $64 million ($0.10 per share), lower than the $268 million ($0.43 per share) adjusted result in the prior year quarter. Commenting on the results, Executive Chairman and Chief Executive Officer Lachlan Murdoch said: \"Our results reaffirm that Fox Corporation is delivering on the operational and financial objectives that we established less than twelve months ago. Our brands are exhibiting strength in a competitive marketplace and delivering healthy top-line growth as we continue to invest strategically to expand the reach of our portfolio and further diversify our revenue streams. Meanwhile, we are taking a balanced approach to capital allocation, including the return of $500 million to shareholders in the form of share repurchases since our last earnings release. Coming off an incredibly successful Super Bowl LIV and with the buildup to the November Presidential Election ahead of us, we look forward to continuing our momentum through calendar 2020.\"  Cable Network Programming reported quarterly segment revenues of $1.47 billion, an increase of $35 million or 2% from the amount reported in the prior year quarter, due to increases in affiliate and other revenues, partially offset by lower advertising revenues. Affiliate revenues increased $19 million or 2% as contractual price increases were partially offset by net subscriber declines. Other revenues increased $32 million or 22%, driven by higher sports sublicensing revenues and revenues generated from pay-per-view boxing. The decrease in advertising revenues of $16 million or 5% included the impact of higher preemptions associated with breaking news coverage at FOX News Media and the absence of Ultimate Fighting Championship content at FS1 in the current year quarter.Cable Network Programming reported quarterly segment EBITDA of $556 million, an increase of $37 million or 7% from the amount reported in the prior year quarter, primarily due to the revenue increases noted above. Expenses were essentially flat as higher costs at FOX News Media were offset by lower sports programming rights amortization at FOX Sports, led by the absence of Ultimate Fighting Championship content in the current year quarter.Television reported quarterly segment revenues of $2.27 billion, an increase of $117 million or 5% from the amount reported in the prior year quarter, reflecting increases in affiliate, advertising and other revenues. Affiliate revenues increased $72 million or 18% as increases in programming fees from third-party FOX affiliates and higher average rates per subscriber at the Company's owned and operated television stations were partially offset by net subscriber declines at the stations. Advertising revenues increased $39 million or 2% as higher sports and entertainment advertising revenues at the FOX Network more than offset the comparative impact of record political advertising revenues from the mid-term elections at the owned and operated television stations in the prior year quarter. Other revenues increased $6 million or 6%, primarily due to the consolidation of Bento Box, partially offset by lower digital content licensing revenues.Television reported a quarterly segment EBITDA loss of $214 million, higher than the loss of $14 million reported in the prior year quarter, as the revenue increases noted above were more than offset by higher expenses. The increase in expenses was primarily due to higher programming rights amortization and production costs at FOX Sports, led by the annual increases for NFL content and inclusive of the costs related to the launch of WWE Friday Night SmackDown, as well as higher programming rights amortization at FOX Entertainment, including the impact of investments in original scripted programming and co-production arrangements with third party studios.SHARE REPURCHASE PROGRAMOn November 6, 2019, the Company announced the authorization of a $2 billion stock repurchase program. The Company simultaneously announced its intention to complete approximately $500 million of aggregate stock repurchases under the program in the near term, comprised of a $350 million accelerated stock repurchase of the Company's Class A common stock and approximately $150 million of open market repurchases of the Company's Class B common stock. As of February 4, 2020, the Company has repurchased $350 million of its Class A common stock and $150 million of its Class B common stock.DIVIDENDThe Company has declared a dividend of $0.23 per Class A and Class B share. This dividend is payable on April 1, 2020 with a record date for determining dividend entitlements of March 4, 2020.DISTRIBUTIONOn March 19, 2019, the Company became a standalone publicly traded company through the pro rata distribution by Twenty-First Century Fox, Inc. (now known as TFCF Corporation) (\"21CF\") of all of the issued and outstanding common stock of FOX to 21CF stockholders (other than holders that were subsidiaries of 21CF) (the \"Distribution\") in accordance with the Amended and Restated Distribution Agreement and Plan of Merger, dated as of June 20, 2018, by and between 21CF and 21CF Distribution Merger Sub, Inc. Following the Distribution, approximately 354 million and approximately 266 million shares of the Company's class A common stock and class B common stock, respectively, began trading independently on The Nasdaq Global Select Market. In connection with the Distribution, the Company entered into the Separation and Distribution Agreement, dated as of March 19, 2019 with 21CF, which effected the internal restructuring (the \"Separation\") whereby 21CF transferred to FOX a portfolio of 21CF's news, sports and broadcast businesses, including FOX News Media (consisting of FOX News and FOX Business), FOX Entertainment, FOX Sports, FOX Television Stations, and sports cable networks FS1, FS2, FOX Deportes and Big Ten Network, and certain other assets, and FOX assumed from 21CF the liabilities associated with such businesses and certain other liabilities. The Separation and the Distribution were effected as part of a series of transactions contemplated by the Amended and Restated Merger Agreement and Plan of Merger, dated as of June 20, 2018, by and among 21CF, The Walt Disney Company (\"Disney\") and certain subsidiaries of Disney, pursuant to which, among other things, 21CF became a wholly-owned subsidiary of Disney.BASIS OF PRESENTATIONThe Unaudited Consolidated and Combined Financial Statements of the Company have been prepared in accordance with United States generally accepted accounting principles (\"GAAP\").The Company became a separate consolidated group as a result of the Distribution, and the Company's financial statements for the three and six months ended December 31, 2019 and as of December 31, 2019 and June 30, 2019 are presented on a consolidated basis. Prior to the Distribution, the Company's financial statements were derived from the unaudited consolidated financial statements and accounting records of 21CF. The Company's financial statements for the three and six months ended December 31, 2018 (the \"Unaudited Combined Financial Statements\") are presented on a combined basis as the Company was not a separate consolidated group prior to the Distribution. These financial statements reflect the combined historical results of operations and cash flows of 21CF's domestic news, national sports and broadcast businesses and certain other assets and liabilities associated with such businesses.The Unaudited Combined Statements of Operations for the three and six months ended December 31, 2018 includes allocations for certain support functions that were provided on a centralized basis within 21CF prior to the Distribution and not recorded at the business unit level, such as certain expenses related to finance, legal, insurance, information technology, compliance and human resources management activities, among others. 21CF did not routinely allocate these costs to any of its business units. These expenses were allocated to FOX on the basis of direct usage when identifiable, with the remainder allocated on a pro rata basis of combined revenues, headcount or other relevant measures. Management believes the assumptions underlying the Unaudited Combined Financial Statements, including the assumptions regarding allocating general corporate expenses from 21CF, are reasonable. Nevertheless, the Unaudited Combined Financial Statements may not include all of the actual expenses that would have been incurred by FOX and may not reflect FOX's consolidated results of operations and cash flows had it been a standalone company during the entirety of the periods presented. Actual costs that would have been incurred if FOX had been a standalone company would depend on multiple factors, including organizational structure and strategic decisions made in various areas, including information technology and infrastructure. The Unaudited Combined Statements of Operations includes corporate allocations of approximately $95 million and $170 million for the three and six months ended December 31, 2018, respectively, in Selling, general and administrative expenses.CAUTIONARY STATEMENT CONCERNING FORWARD-LOOKING STATEMENTSThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as \"may,\" \"will,\" \"should,\" \"likely,\" \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"estimates,\" \"outlook\" and similar expressions are used to identify these forward-looking statements. These statements are based on management's current expectations and beliefs and are subject to uncertainty and changes in circumstances. Actual results may vary materially from those expressed or implied by the statements in this press release due to changes in economic, business, competitive, technological, strategic and/or regulatory factors and other factors affecting the operation of the Company's businesses. More detailed information about these factors is contained in the documents the Company has filed with or furnished to the Securities and Exchange Commission (the \"SEC\"), including the Company's Annual Report on Form 10-K for the fiscal year ended June 30, 2019.Statements in this press release speak only as of the date they were made, and the Company undertakes no duty to update or release any revisions to any forward-looking statement made in this press release or to report any events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events or to conform such statements to actual results or changes in the Company's expectations, except as required by law.To access a copy of this press release through the Internet, access Fox Corporation's corporate website located at http://www.foxcorporation.com.  NOTE 1 – ADJUSTED EBITDA Beginning with the announcement of the Company's financial results for the first quarter of fiscal 2020, the Company has renamed as \"Adjusted EBITDA\" the measure that it had previously referred to as \"Total Segment EBITDA\" and, prior to the announcement of the Company's financial results for the third quarter of fiscal 2019, as \"Total Segment OIBDA.\" The definition of this measure has not changed: Adjusted EBITDA is defined as Revenues less Operating expenses and Selling, general and administrative expenses. Adjusted EBITDA does not include: Amortization of cable distribution investments, Depreciation and amortization, Impairment and restructuring charges, Interest expense, Interest income, Other, net and Income tax expense.Management believes that information about Adjusted EBITDA assists all users of the Company's Unaudited Consolidated and Combined Financial Statements by allowing them to evaluate changes in the operating results of the Company's portfolio of businesses separate from non-operational factors that affect net income, thus providing insight into both operations and the other factors that affect reported results. Adjusted EBITDA provides management, investors and equity analysts a measure to analyze the operating performance of the Company's business and its enterprise value against historical data and competitors' data, although historical results, including Adjusted EBITDA, may not be indicative of future results (as operating performance is highly contingent on many factors, including customer tastes and preferences). Adjusted EBITDA is considered a non-GAAP financial measure and should be considered in addition to, not as a substitute for, net income, cash flow and other measures of financial performance reported in accordance with GAAP. In addition, this measure does not reflect cash available to fund requirements and excludes items, such as depreciation and amortization and impairment charges, which are significant components in assessing the Company's financial performance. Adjusted EBITDA may not be comparable to similarly titled measures reported by other companies.The following table reconciles net income to Adjusted EBITDA for the three and six months ended December 31, 2019 and 2018:NOTE 2 – ADJUSTED NET INCOME AND ADJUSTED EPSThe Company uses net income and earnings per share (\"EPS\") attributable to Fox Corporation stockholders excluding net income effects of Impairment and restructuring charges, adjustments to Equity (losses) earnings of affiliates, Other, net, and tax provision adjustments (\"Adjusted Net Income\" and \"Adjusted EPS\" respectively) to evaluate the performance of the Company's operations exclusive of certain items that impact the comparability of results from period to period.Adjusted Net Income and Adjusted EPS may not be comparable to similarly titled measures reported by other companies. Adjusted Net Income and Adjusted EPS are not measures of performance under GAAP and should be considered in addition to, and not as substitutes for, net income attributable to Fox Corporation stockholders and EPS as reported in accordance with GAAP. However, management uses these measures in comparing the Company's historical performance and believes that they provide meaningful and comparable information to management, investors and equity analysts to assist in their analysis of the Company's performance relative to prior periods and the Company's competitors.The following table reconciles net income and EPS attributable to Fox Corporation stockholders to Adjusted Net Income and Adjusted EPS for the three months ended December 31, 2019 and 2018:    View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-reports-second-quarter-fiscal-2020-revenues-of-3-78-billion-an-increase-of-5-300999750.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Executives to Discuss Second Quarter Fiscal 2020 Financial Results Via Webcast",
        "subtitle": "",
        "date": "Jan 14, 2020 1:02PM EST",
        "content": "NEW YORK and LOS ANGELES, Jan. 14, 2020 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) will discuss second quarter fiscal 2020 financial results via a live audio webcast beginning at 4:30 p.m. EST / 1:30 p.m. PST on Wednesday, February 5, 2020.Results will be released after the close of regular trading on February 5, 2020.A live audio webcast of the presentation, and the archived webcast, will be available at investor.foxcorporation.com. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.   View original content:http://www.prnewswire.com/news-releases/fox-corporation-executives-to-discuss-second-quarter-fiscal-2020-financial-results-via-webcast-300986809.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Executives to Discuss Second Quarter Fiscal 2020 Financial Results Via Webcast",
        "subtitle": "",
        "date": "Jan 14, 2020 1:02PM EST",
        "content": "NEW YORK and LOS ANGELES, Jan. 14, 2020 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) will discuss second quarter fiscal 2020 financial results via a live audio webcast beginning at 4:30 p.m. EST / 1:30 p.m. PST on Wednesday, February 5, 2020.Results will be released after the close of regular trading on February 5, 2020.A live audio webcast of the presentation, and the archived webcast, will be available at investor.foxcorporation.com. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.   View original content:http://www.prnewswire.com/news-releases/fox-corporation-executives-to-discuss-second-quarter-fiscal-2020-financial-results-via-webcast-300986809.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Announces Launch of FOX News Channel and FOX Business Network on Sling TV",
        "subtitle": "",
        "date": "Dec 23, 2019 8:45AM EST",
        "content": " NEW YORK and LOS ANGELES, Dec. 23, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) today announces the launch of FOX News Channel and FOX Business Network on Sling TV. FOX News Channel, which has been the most watched television news channel for more than 17 consecutive years, and FOX Business Network, one of the leading business networks on television, join the FOX broadcast network in select markets as well as FOX Sports' FS1 and FS2 on Sling Blue. Michael Biard, President of Operations and Distribution commented: \"We are pleased that our leading news and business networks are now available to Sling subscribers. FOX News and FOX Business, which are now distributed across all major television providers, meaningfully complement Sling Blue's lineup.\"FOX News' loyal viewers have propelled FOX News Channel to ratings dominance. The third quarter of calendar 2019 marked FOX News Channel's 71st consecutive quarter as the most-watched national cable news channel in Monday-Sunday total day and primetime viewing. FOX Business Network will finish 2019 with the top two programs on business television for the third straight year, according to early Nielsen Media Research. In addition, the network is projected to deliver eight of the 15 top rated programs of the year in all of business television.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com. Press Contact:                                                                                                                   Megan Klein310-369-1363megan.klein@fox.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-announces-launch-of-fox-news-channel-and-fox-business-network-on-sling-tv-300978814.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Announces Executive Promotions in Advertising Sales Organization",
        "subtitle": "Sports Ad Sales Team Expands with Addition of Brian Nyemchek",
        "date": "Dec 17, 2019 1:23PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (\"FOX\" or \"the Company\") today announced the promotion of several executives in its advertising sales organization as well as the expansion of the leadership of its sports sales team.Michael Falco was promoted to Executive Vice President of Revenue Management and Strategy. He most recently served as Senior Vice President of Sports Sales. Since joining FOX in 2006 as an Account Executive, Falco has helped to grow FOX Sports' revenue.David Borstein will now serve as Senior Vice President of Digital and Social Sales. In this newly created role, Borstein will oversee the digital strategy for both the Sports and Entertainment teams. David joined FOX in 2016 as Vice President of Digital Entertainment Sales.Dan Callahan has been elevated to Senior Vice President of Data Strategy and Sales Innovation. He will continue to lead FOX's Audience Innovation Management (AIM) strategy and will now also manage the Company's digital relationships, video initiatives, and business development for the Sports and Entertainment Sales teams. Dan started his career with FOX in June 2011 as Manager of Network Sales and Development for FOX News Media and most recently served as Vice President of Audience and Automated Sales.   President of Advertising Sales Marianne Gambelli commented: \"I couldn't be prouder of the talent we develop and cultivate at FOX and our legacy of promoting from within. Michael, David and Dan are incredible strategists, contributors and team members who will continue to grow and impact our advertising sales organizations in their new roles.\"   FOX's advertising sales team is also expanding with addition of Brian Nyemchek, who joined the Company as Senior Vice President of Advertising Sales. He previously spent 12 years at NBCUniversal Media, most recently serving as Senior Vice President, NBC Sports Media Sales. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com. View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-announces-executive-promotions-in-advertising-sales-organization-300976337.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Announces Correction by FTSE Russell and Removal from Gambling Business Activity Exclusion List",
        "subtitle": "",
        "date": "Dec 5, 2019 8:26AM EST",
        "content": "NEW YORK and LOS ANGELES, Dec. 5, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (\"FOX\" or \"the Company\") today announced that FTSE Russell removed the Company's common stock from its Gambling Business Activity Exclusion List. FTSE Russell's correction followed a challenge by the Company and a review that determined FOX's level of involvement in the betting industry falls below the equity ownership threshold for classification on the Gambling Business Activity Exclusion List. FOX challenged the classification earlier this year when it caused the Company's stock to be removed from Vanguard ESG funds (ESGV, VSGX) created to invest in companies with strong environmental, social and governance records.Additional information about FTSE Russell's corrective action can be found here. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-announces-correction-by-ftse-russell-and-removal-from-gambling-business-activity-exclusion-list-300970004.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Chief Financial Officer Steve Tomsic to Participate at Upcoming UBS Global TMT Conference",
        "subtitle": "",
        "date": "Dec 3, 2019 3:28PM EST",
        "content": "NEW YORK and LOS ANGELES, Dec. 3, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) today announced that Chief Financial Officer Steve Tomsic will be speaking at the UBS Global TMT Conference on Tuesday, December 10 in New York, NY at approximately 2:00pm (Eastern).A live audio webcast of the presentation, and the archived webcast, will be available at investor.foxcorporation.com.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-chief-financial-officer-steve-tomsic-to-participate-at-upcoming-ubs-global-tmt-conference-300968603.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "FOX Bet Becomes an Official Partner of the Philadelphia 76ers",
        "subtitle": "",
        "date": "Nov 25, 2019 9:48AM EST",
        "content": "Mobile Sportsbook Is First Online Sports Betting Brand to Strike a Deal With an NBA FranchiseFans in PA and NJ Can Receive $20 Towards First BetPHILADELPHIA, Nov. 25, 2019 /PRNewswire/ -- FOX Bet today announced that it has joined forces with one of the most innovative and forward-thinking franchises in the NBA, the Philadelphia 76ers, the first deal of its kind with an NBA franchise. FOX Bet, the sports betting brand between FOX Sports and The Stars Group, is already an Authorized Gaming Operator of the NBA. The new agreement will build awareness of its brand and app via the 76ers traditional, digital and social media assets, custom home game promotions, exposure on courtside and LED signage, and more. Under the agreement, FOX Bet will also present near-live game replays on 76ers Twitter, and will become the Presenting Partner of the 76ers radio game broadcast on 97.5 The Fanatic (WPEN) and for the team's 'hype video' played on the scoreboard leading into the fourth quarter of its home games.\"To have the opportunity to tie the FOX Bet brand to one of the most iconic sports franchises in NBA history is absolutely thrilling,\" said Robin Chhabra, Chief Executive Officer, FOX Bet. \"This agreement connects us with an extremely passionate local fanbase in a unique way. We are proud to be associated with the 76ers franchise as they kick off what I'm sure will be a successful 2019-20 season.\"Capitalizing on a successful brand launch in September, this multiplatform deal allows FOX Bet to develop a deeper connection to 76ers fans in the Philadelphia area, furthering its mission to bring its customers closer to the sports and teams they love. \"FOX Bet has masterfully honed its unique brand positioning in the US; an experienced, longstanding European sportsbook, a savvy media company, and now an affiliation with the 76ers that further endears its brand and product to the Philadelphia, Pennsylvania and New Jersey market and sports community,\" said Adam Davis, Harris Blitzer Sports & Entertainment Chief Commercial Officer. \"Recognizing the passionate 76ers fan base, FOX Bet and our team look forward to amplifying a multi-tiered activation approach by creating dynamic, digital content and continuing to drive engagement with our brand, team and league.\"In celebration of the agreement, FOX Bet customers in Pennsylvania and New Jersey will see special offers and promotions in the early part of this NBA season. In particular, fans in Pennsylvania and New Jersey who download and register for the FOX Bet sportsbook app will receive $20 toward their first wager. Fans may download the FOX Bet sportsbook app by CLICKING HERE. Media may CLICK HERE to download still images of FOX Bet in-game brand exposure on signage at 76ers home games, and examples of FOX Bet-branded posts made on 76ers social media platforms.About FOX BetFOX Bet is an online and mobile sportsbook developed through a first-of-its kind national media and sports wagering partnership in the United States between The Stars Group Inc. (Nasdaq: TSG)(TSX: TSGI) and FOX Sports, a unit of Fox Corporation (Nasdaq: FOXA, FOX). The FOX Bet online and mobile sportsbook brings sports fans closer to the games they love by integrating regulated real-money sports wagering with interactive and content rich programming, including expert commentary and insights from some of the nation's most celebrated sports commentators and analysts.About the Philadelphia 76ersThe Philadelphia 76ers are one of the most storied franchises in the National Basketball Association, having won three World Championships, earning nine trips to The Finals and making 49 playoff appearances over 70 seasons. The Philadelphia 76ers organization is a Harris Blitzer Sports & Entertainment property.About The Stars GroupThe Stars Group is a provider of technology-based product offerings in the global gaming and interactive entertainment industries. Its brands have millions of registered customers globally and collectively are leaders in online and mobile betting, poker, casino and other gaming-related offerings. The Stars Group owns or licenses gaming and related consumer businesses and brands, including PokerStars, PokerStars Casino, BetStars, Full Tilt, FOX Bet, BetEasy, Sky Bet, Sky Vegas, Sky Casino, Sky Bingo, and Sky Poker, as well as live poker tour and event brands, including the PokerStars Players No Limit Hold'em Championship, European Poker Tour, PokerStars Caribbean Adventure, Latin American Poker Tour, Asia Pacific Poker Tour, PokerStars Festival and PokerStars MEGASTACK. The Stars Group is one of the world's most licensed online gaming operators with its subsidiaries collectively holding licenses or approvals in 22 jurisdictions throughout the world, including in Europe, Australia, and the Americas. The Stars Group's vision is to become the world's favorite iGaming destination and its mission is to provide its customers with winning moments. Cautionary Note Regarding Forward Looking Statements and Other InformationThis news release may contain forward-looking statements and information within the meaning of applicable securities laws. Forward-looking statements can, but may not always, be identified by the use of words such as \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"intend\", \"could\", \"might\", \"would\", \"should\", \"believe\", and similar references to future periods or the negatives of these words and expressions. These statements are based on management's current expectations and are subject to a number of risks, uncertainties, and assumptions. Examples of these statements include, but are not limited to, statements regarding the partnership referenced in this news release. There can be no assurance that actual results will not differ materially from those expressed or implied in forward-looking statements. Undue reliance should not be placed on forward-looking statements. Please refer to The Stars Group's most recent annual information form and annual and interim financial statements and management's discussion and analysis for more information about the factors, assumptions and risks that may apply to The Stars Group's forward-looking statements. Each forward-looking statement speaks only as of the date hereof, and The Stars Group undertakes no obligation to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by applicable law.Photo: https://mma.prnewswire.com/media/1035149/Fox_Bet_Philadelphia_76ers.jpgContact:Eddie Motl, FOX BetEddie@fox.betLara Toscani, HB Sports & EntertainmentLaratoscani@hbse.comSOURCE  FOX Bet"
    },
    {
        "title": "FOX Bet Becomes an Official Partner of the Philadelphia 76ers",
        "subtitle": "Mobile Sportsbook Is First Online Sports Betting Brand to Strike a Deal With an NBA Franchise",
        "date": "Nov 25, 2019 9:05AM EST",
        "content": "\n     \n  PHILADELPHIA, Nov. 25, 2019 /PRNewswire/ -- FOX Bet today announced that it has joined forces with one of the most innovative and forward-thinking franchises in the NBA, the Philadelphia 76ers, the first deal of its kind with an NBA franchise. FOX Bet, the sports betting brand between FOX Sports and The Stars Group, is already an Authorized Gaming Operator of the NBA. The new agreement will build awareness of its brand and app via the 76ers traditional, digital and social media assets, custom home game promotions, exposure on courtside and LED signage, and more. Under the agreement, FOX Bet will also present near-live game replays on 76ers Twitter, and will become the Presenting Partner of the 76ers radio game broadcast on 97.5 The Fanatic (WPEN) and for the team's 'hype video' played on the scoreboard leading into the fourth quarter of its home games.\"To have the opportunity to tie the FOX Bet brand to one of the most iconic sports franchises in NBA history is absolutely thrilling,\" said Robin Chhabra, Chief Executive Officer, FOX Bet. \"This agreement connects us with an extremely passionate local fanbase in a unique way. We are proud to be associated with the 76ers franchise as they kick off what I'm sure will be a successful 2019-20 season.\"Capitalizing on a successful brand launch in September, this multiplatform deal allows FOX Bet to develop a deeper connection to 76ers fans in the Philadelphia area, furthering its mission to bring its customers closer to the sports and teams they love. \"FOX Bet has masterfully honed its unique brand positioning in the US; an experienced, longstanding European sportsbook, a savvy media company, and now an affiliation with the 76ers that further endears its brand and product to the Philadelphia, Pennsylvania and New Jersey market and sports community,\" said Adam Davis, Harris Blitzer Sports & Entertainment Chief Commercial Officer. \"Recognizing the passionate 76ers fan base, FOX Bet and our team look forward to amplifying a multi-tiered activation approach by creating dynamic, digital content and continuing to drive engagement with our brand, team and league.\"In celebration of the agreement, FOX Bet customers in Pennsylvania and New Jersey will see special offers and promotions in the early part of this NBA season. In particular, fans in Pennsylvania and New Jersey who download and register for the FOX Bet sportsbook app will receive $20 toward their first wager. Fans may download the FOX Bet sportsbook app by CLICKING HERE. Media may CLICK HERE to download still images of FOX Bet in-game brand exposure on signage at 76ers home games, and examples of FOX Bet-branded posts made on 76ers social media platforms.About FOX BetFOX Bet is an online and mobile sportsbook developed through a first-of-its kind national media and sports wagering partnership in the United States between The Stars Group Inc. (Nasdaq: TSG)(TSX: TSGI) and FOX Sports, a unit of Fox Corporation (Nasdaq: FOXA, FOX). The FOX Bet online and mobile sportsbook brings sports fans closer to the games they love by integrating regulated real-money sports wagering with interactive and content rich programming, including expert commentary and insights from some of the nation's most celebrated sports commentators and analysts.About the Philadelphia 76ersThe Philadelphia 76ers are one of the most storied franchises in the National Basketball Association, having won three World Championships, earning nine trips to The Finals and making 49 playoff appearances over 70 seasons. The Philadelphia 76ers organization is a Harris Blitzer Sports & Entertainment property.About The Stars GroupThe Stars Group is a provider of technology-based product offerings in the global gaming and interactive entertainment industries. Its brands have millions of registered customers globally and collectively are leaders in online and mobile betting, poker, casino and other gaming-related offerings. The Stars Group owns or licenses gaming and related consumer businesses and brands, including PokerStars, PokerStars Casino, BetStars, Full Tilt, FOX Bet, BetEasy, Sky Bet, Sky Vegas, Sky Casino, Sky Bingo, and Sky Poker, as well as live poker tour and event brands, including the PokerStars Players No Limit Hold'em Championship, European Poker Tour, PokerStars Caribbean Adventure, Latin American Poker Tour, Asia Pacific Poker Tour, PokerStars Festival and PokerStars MEGASTACK. The Stars Group is one of the world's most licensed online gaming operators with its subsidiaries collectively holding licenses or approvals in 22 jurisdictions throughout the world, including in Europe, Australia, and the Americas. The Stars Group's vision is to become the world's favorite iGaming destination and its mission is to provide its customers with winning moments. Cautionary Note Regarding Forward Looking Statements and Other InformationThis news release may contain forward-looking statements and information within the meaning of applicable securities laws. Forward-looking statements can, but may not always, be identified by the use of words such as \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"intend\", \"could\", \"might\", \"would\", \"should\", \"believe\", and similar references to future periods or the negatives of these words and expressions. These statements are based on management's current expectations and are subject to a number of risks, uncertainties, and assumptions. Examples of these statements include, but are not limited to, statements regarding the partnership referenced in this news release. There can be no assurance that actual results will not differ materially from those expressed or implied in forward-looking statements. Undue reliance should not be placed on forward-looking statements. Please refer to The Stars Group's most recent annual information form and annual and interim financial statements and management's discussion and analysis for more information about the factors, assumptions and risks that may apply to The Stars Group's forward-looking statements. Each forward-looking statement speaks only as of the date hereof, and The Stars Group undertakes no obligation to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by applicable law.Photo: https://mma.prnewswire.com/media/1035149/Fox_Bet_Philadelphia_76ers.jpgContact:Eddie Motl, FOX BetEddie@fox.betLara Toscani, HB Sports & EntertainmentLaratoscani@hbse.com View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-bet-becomes-an-official-partner-of-the-philadelphia-76ers-300964586.htmlSOURCE  FOX Bet"
    },
    {
        "title": "Fox Corporation Announces $2 Billion Stock Repurchase Program and Execution of a Stockholders Agreement with the Murdoch Family Trust",
        "subtitle": "$500 Million Repurchase to Commence Immediately",
        "date": "Nov 6, 2019 4:05PM EST",
        "content": "NEW YORK and LOS ANGELES, Nov. 6, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (the \"Company\") today announced that its Board of Directors (the \"Board\") has authorized a $2 billion stock repurchase program. Subject to market conditions and other factors, the Company intends to repurchase, in the open market or otherwise, a combination of the Company's Class A common stock and Class B common stock. This stock repurchase program has no time limit and may be modified, suspended or discontinued at any time.The Company also announced that it has entered into an accelerated stock repurchase (\"ASR\") transaction to repurchase, in the aggregate, $350 million of the Company's Class A common stock pursuant to the stock repurchase program. The Company also intends to promptly repurchase approximately $150 million of Class B common stock. As a result, the Company expects to complete approximately $500 million of aggregate stock repurchases in the near term.Lachlan K. Murdoch, Executive Chairman and Chief Executive Officer, commented: \"We are committed to deploying capital to maximize long-term stockholder value through a balanced approach of appropriate organic investment, accretive M&A, and returns of capital to our stockholders. This stock buyback program reflects the confidence we have in the long-term investment case for the Company, which is underpinned by the strength of our core brands and the sustainability of our business, and which we believe is well positioned to continue to generate healthy free cash flow.\"The Board's decision follows the execution of a stockholders agreement by and between the Company and the Murdoch Family Trust (\"MFT\"), which was approved by the independent members of the Board, and which limits the potential accretion of voting power by the MFT and Murdoch family members through market purchases or as an indirect result of repurchases by the Company of shares of Class B common stock. The stockholders agreement provides that the MFT and the Company will not take actions that would result in the MFT and Murdoch family members together owning more than 44% of the outstanding voting power of the Class B common stock, or would increase the MFT's voting power by more than 1.75% in any rolling twelve-month period. The MFT would forfeit votes to the extent necessary to ensure that the MFT and the Murdoch family collectively do not exceed 44% of the outstanding voting power of the Class B Shares, except where a Murdoch family member votes their own shares differently from the MFT on any matter. The stockholders agreement will terminate upon the MFT's distribution of all or substantially all of its Class B common stock. The independent members of the Board were advised by Wachtell, Lipton, Rosen & Katz and Morris Nichols Arsht & Tunnell LLP as independent counsel and Citi as independent financial advisor.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.Cautionary Statement Regarding Forward-Looking StatementsThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as \"may,\" \"will,\" \"should,\" \"likely,\" \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"estimates,\" \"outlook\" and similar expressions are used to identify these forward-looking statements. These statements are based on management's current expectations and beliefs and are subject to uncertainty and changes in circumstances. Actual results may vary materially from those expressed or implied by the statements in this press release due to changes in economic, business, competitive, technological, strategic and/or regulatory factors and other factors affecting the operation of the Company's businesses. More detailed information about these factors is contained in the documents the Company has filed with or furnished to the Securities and Exchange Commission, including the Company's Annual Report on Form 10-K. Statements in this press release speak only as of the date they were made, and the Company undertakes no duty to update or release any revisions to any forward-looking statement made in this press release or to report any events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events or to conform such statements to actual results or changes in the Company's expectations, except as required by law. View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-announces-2-billion-stock-repurchase-program-and-execution-of-a-stockholders-agreement-with-the-murdoch-family-trust-300953150.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation to Acquire Stations in Seattle and Milwaukee from Nexstar Media Group",
        "subtitle": "Acquisition expands Fox Television Stations' reach to 14 of the top 15 markets",
        "date": "Nov 5, 2019 4:05PM EST",
        "content": "NEW YORK and LOS ANGELES, Nov. 5, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq FOXA, FOX) (\"FOX\") today announced a definitive agreement with Nexstar Media Group (NASDAQ: NXST) to acquire three television stations for a purchase price of approximately $350 million.  The stations FOX will be acquiring are located in Seattle, WA and Milwaukee, WI, two key markets that align with the company's sports rights.  The transaction will expand Fox Television Stations' market presence to 14 of the top 15 DMAs.  The stations being acquired by FOX are:Executive Chairman and Chief Executive Officer Lachlan Murdoch said, \"This acquisition expands the reach of one of FOX's core assets, our television stations portfolio, and further strengthens what is already a highly profitable and cash generative business. The Seattle and Milwaukee markets both overlap with key sports markets, creating significant opportunities for growth and collaboration.\"Jack Abernethy, CEO of Fox Television Stations, added, \"Acquiring stations in these high-performing NFC markets enhances our already strong nationwide footprint and further demonstrates Fox Television Stations' commitment to serving our viewers, advertisers and local communities.\" As part of this transaction, FOX has agreed to sell Nexstar two stations in Charlotte, NC, FOX-affiliate WJZY and MyNetworkTV-affiliate WMYT, for approximately $45 million.     Completion of the stations acquisition and divestiture by FOX is expected to occur during the first half of calendar year 2020, subject to regulatory approvals and the satisfaction or waiver of certain closing conditions.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment, and FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develop deeper consumer relationships and create more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.Cautionary Note Regarding Forward Looking StatementsThis news release contains forward-looking statements and information within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as \"may,\" \"will,\" \"should,\" \"likely,\" \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"estimates,\" \"outlook\" and similar expressions are used to identify these forward-looking statements. These statements are based on management's current expectations and beliefs and are subject to uncertainty and changes in circumstances. Actual results may vary materially from those expressed or implied by the statements in this news release due to changes in economic, business, competitive, technological, strategic and/or regulatory factors and other factors affecting the operation of the business of Fox Corporation. More detailed information about risk factors affecting FOX Corporation is contained in the documents FOX Corporation has filed with or furnished to the Securities and Exchange Commission, including its Annual Report on Form 10-K for the fiscal year ended June 30, 2019 and subsequent Quarterly Reports on Form 10-Q. View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-to-acquire-stations-in-seattle-and-milwaukee-from-nexstar-media-group-300952201.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "TEGNA and FOX Renew Affiliation Agreement",
        "subtitle": "",
        "date": "Oct 28, 2019 7:30AM EDT",
        "content": "    TYSONS, Va. & LOS ANGELES--(BUSINESS WIRE)--\nTEGNA Inc. (NYSE: TGNA) and Fox Corporation (Nasdaq: FOXA, FOX) (“FOX”) today announced a comprehensive, multi-year deal that renews station affiliation agreements for six TEGNA markets, including three stations acquired last month from Nexstar Media Group.\n\nThe new agreement includes full carriage of the FOX broadcast network, including the NFL on FOX, the MLB World Series, WWE Friday Night SmackDown, The Masked Singer, 9-1-1 and Prodigal Son. The deal also covers continued carriage of TEGNA’s Fox affiliates’ local station programming on all major streaming platforms.\n\n“TEGNA and FOX have a longstanding partnership in serving our communities with the highest caliber local and network programming,” said Dave Lougee, president and CEO, TEGNA. “This new multi-year agreement allows our viewers and advertisers continued access to premium content such as NFL football and award-winning local news, weather and sports.”\n\nMichael Biard, president of operations and distribution for FOX added, “We are pleased to expand our relationship with TEGNA across its growing FOX footprint. We look forward to providing our joint viewers with leading sports and entertainment programming from FOX, this season’s top broadcast network.”\n\nThe agreement includes renewals for these TEGNA-owned FOX affiliates: KXVA in Abilene, TX; WPMT in Harrisburg, PA.; WTIC in Hartford, CT; WZDX in Huntsville, AL; KIDY in San Angelo, TX; and KMSB in Tucson, AZ.\n\nAbout TEGNA\n\nTEGNA Inc. (NYSE: TGNA) is an innovative media company that serves the greater good of our communities. Across platforms, TEGNA tells empowering stories, conducts impactful investigations and delivers innovative marketing solutions. With 62 television stations and four radio stations in 51 markets, TEGNA is the largest owner of top 4 affiliates in the top 25 markets among independent station groups, reaching over 38 percent of all television households nationwide. TEGNA also owns leading multicast networks Justice Network and Quest. TEGNA Marketing Solutions (TMS) offers innovative solutions to help businesses reach consumers across television, email, social and over-the-top (OTT) platforms, including Premion, TEGNA’s OTT advertising service. For more information, visit www.TEGNA.com.\n\nAbout Fox Corporation\n\nFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191028005402/en/\nFor Fox media inquiries, contact:\nMegan Klein\nSenior Vice President, Corporate Communications\n310-369-1363\nMegan.klein@fox.com\n\nFor TEGNA media and investor inquiries, contact:\nAnne Bentley\nVice President, Corporate Communications\n703-873-6366\nabentley@TEGNA.com\n\nJohn Janedis, CFA\nSenior Vice President, Capital Markets & Investor Relations\n703-873-6222\njjanedis@TEGNA.com\nSource: TEGNA Inc. and Fox Corporation"
    },
    {
        "title": "Fox Corporation Names Yoel Flohr Executive Vice President of Technology & Digital",
        "subtitle": "",
        "date": "Oct 21, 2019 1:30PM EDT",
        "content": "LOS ANGELES, Oct. 21, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) today announced the appointment of Yoel Flohr as Executive Vice President of Technology & Digital. Flohr, who will report to Fox Corporation Chief Technology Officer and President of Digital Paul Cheesbrough, will lead the digital product portfolio for FOX Entertainment. In this role Flohr will oversee existing digital products and relationships, including FOX Now, and will work closely with the FOX Entertainment team to develop and grow new digital businesses, partnerships and revenues. Cheesbrough commented: \"Yoel is the ideal leader to propel FOX Entertainment's multi-platform and product management initiatives and partnerships. I am delighted to welcome him to the team and look forward to working together to build and grow our digital capabilities and revenue streams.\" Flohr previously served as Executive Vice President of Digital and Franchise Development for AMC Networks and Studios, where he oversaw its digital business. At AMC, Flohr promoted the development of global franchises like The Walking Dead, Fear the Walking Dead and The Terror and ran the TV Everywhere business for all of AMC's brands. Before joining AMC in 2016, Flohr co-founded Thirty Labs Inc., a start-up studio focused on the emerging digital video space, and earlier founded Ventuation, a strategic consulting and digital incubation firm. Prior to this, Flohr was the Vice President of Digital at Shine Group.Flohr earned his bachelor's degree from the European Business School and his master's degree in management from the London School of Economics and Political Science. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-names-yoel-flohr-executive-vice-president-of-technology--digital-300942175.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation and Charter Communications Announce Comprehensive Distribution Agreement",
        "subtitle": "",
        "date": "Oct 21, 2019 11:10AM EDT",
        "content": "NEW YORK and LOS ANGELES, Oct. 21, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) (\"FOX\") and Charter Communications, Inc. (Nasdaq: CHTR) (\"Charter\") today announced a long-term, comprehensive renewal of their distribution agreement for FOX's full portfolio of leading news, entertainment and sports networks. In addition, FOX and Charter will cooperate to mitigate piracy, implementing business rules to address unauthorized access to content.Michael Biard, President of Operations and Distribution for FOX commented: \"We are pleased that our renewed agreement provides Charter customers with continued access to our entire suite of networks and expands the ways in which they can access the FOX brands through additional video-on-demand and TV Everywhere platforms. We appreciate Charter's professional and collaborative approach throughout this process, and we look forward to expanding on our partnership in the days ahead.\" Added Tom Montemagno, Executive Vice President, Programming Acquisition for Charter: \"This agreement allows continued access to all of the FOX programming for our customers and FOX viewers, but it will also amplify our mutual efforts to address piracy and abusive password sharing issues. We appreciate FOX's desire to further collaborate as the video landscape continues to evolve.\"The renewal covers distribution of the FOX Television Stations, FOX News Channel, FOX Business Network, FS1, FS2, BTN, and FOX Deportes. Additionally, the agreement includes video-on-demand and TV Everywhere rights for those networks, enabling Charter subscribers to watch a wide array of FOX programming live and on-demand through the FOX NOW, FOX Sports and FOX News apps.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.About Charter CommunicationsCharter Communications, Inc. (NASDAQ:CHTR) is a leading broadband communications company and the second largest cable operator in the United States. Charter provides a full range of advanced residential broadband services, including Spectrum TV® programming, Spectrum Internet®, Spectrum Voice®, and Spectrum Mobile™. Under the Spectrum Business® brand, Charter provides scalable, and cost-effective broadband communications solutions to small and medium-sized business organizations, including Internet access, business telephone, and TV services. Through the Spectrum Enterprise brand, Charter is a national provider of scalable, fiber-based technology solutions serving many of America's largest businesses and communications service providers. Charter's advertising sales and production services are sold under the Spectrum Reach® brand. Charter's news and sports networks are operated under the Spectrum Networks brand. More information about Charter can be found at newsroom.charter.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-and-charter-communications-announce-comprehensive-distribution-agreement-300941651.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Completes Acquisition of 67% of Equity of Credible Labs",
        "subtitle": "",
        "date": "Oct 17, 2019 8:38AM EDT",
        "content": "NEW YORK and LOS ANGELES, Oct. 17, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) announced today that it has completed its acquisition of 67% of the equity of Credible Labs Inc. (ASX: CDR) effective October 17, 2019. Shares of Credible were suspended from trading on the Australian Stock Exchange (ASX) on October 16, 2019 (AEST) and Credible will be delisted from the ASX on October 18, 2019 (AEST). The completion of the transaction follows the satisfaction of all customary closing conditions, including approval of the merger by Credible stockholders. Each Credible CDI holder of record at closing is entitled to receive A$2.21 in cash per CDI, and each holder of common stock in Credible of record at closing is entitled to receive A$55.25 per share. Kirkland & Ellis LLP and Herbert Smith Freehills served as U.S. and Australian legal counsel, respectively, to Fox Corporation.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.About CredibleCredible (ARBN: 621 866 813) is a U.S. company based in San Francisco which operates a consumer finance marketplace that helps consumers save money and make better financial decisions. Credible has developed a proprietary technology platform that is integrated with credit bureaus and financial institutions. Credible has developed a differentiated, and personalized user experience that enables consumers to compare instant, accurate pre-qualified rates from multiple financial institutions for student loans, personal loans and mortgages. For more information, please visit: www.credible.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-completes-acquisition-of-67-of-equity-of-credible-labs-300940531.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Credible Stockholders Overwhelmingly Vote in Favour of Merger with Fox Corporation",
        "subtitle": "",
        "date": "Oct 14, 2019 10:41PM EDT",
        "content": "NEW YORK and LOS ANGELES, Oct. 14, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) today confirmed that Credible Labs Inc.'s (ASX: CRD) (\"Credible\") stockholders overwhelmingly voted in favour of Fox Corporation's proposed acquisition of 67% of the equity of Credible.Credible stockholders voted at a special meeting held today in Sydney, Australia.This vote comes after Credible's Board of Directors unanimously recommended stockholders to vote \"FOR\" the proposal. Commenting on the vote, Fox Corporation Executive Chairman and Chief Executive Officer, Lachlan Murdoch said: \"Today Credible's stockholders overwhelmingly supported Fox Corporation's proposed merger. This transaction advances Fox's innovative digital strategy focused on meaningful engagement with our large audiences. When combined with Credible's industry-leading user experience, the strength and breadth of the FOX brands offer a unique opportunity to deliver greater impact and scale in the fast-growing marketplace of digital consumer finance. We look forward to the partnership with Stephen Dash and his team.\"Details of merger: The transaction is expected to close promptly now that it has gained receipt of a majority vote of all Credible stockholders as well as a majority vote of all shareholders other than Mr. Dash and his affiliates. It is now only subject to the receipt of regulatory approvals and other customary closing conditions.Kirkland & Ellis LLP and Herbert Smith Freehills are serving as U.S. and Australian legal counsel, respectively, to Fox Corporation.About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.About CredibleCredible (ARBN: 621 866 813) is a U.S. company based in San Francisco which operates a consumer finance marketplace that helps consumers save money and make better financial decisions. Credible has developed a proprietary technology platform that is integrated with credit bureaus and financial institutions. Credible has developed a differentiated, and personalized user experience that enables consumers to compare instant, accurate pre-qualified rates from multiple financial institutions for student loans, personal loans and mortgages. For more information, please visit: www.credible.comCautionary Note Regarding Forward Looking StatementsThis news release contains forward-looking statements and information within the meaning of the Private Securities Litigation Reform Act of 1995, including statements and information relating to Fox Corporation's proposed acquisition of Credible equity. Words such as \"may,\" \"will,\" \"should,\" \"likely,\" \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"estimates,\" \"outlook\" and similar expressions are used to identify these forward-looking statements. These statements are based on management's current expectations and beliefs and are subject to uncertainty and changes in circumstances. Actual results may vary materially from those expressed or implied by the statements in this news release due to changes in economic, business, competitive, technological, strategic and/or regulatory factors and other factors affecting the operation of the business of Fox Corporation. More detailed information about risk factors affecting Fox Corporation is contained in the documents Fox Corporation has filed with or furnished to the Securities and Exchange Commission (the \"SEC\"), including its Annual Report on Form 10-K for the fiscal year ended June 30, 2019, and subsequent Quarterly Reports on Form 10-Q.Investors are cautioned not to put undue reliance on forward looking statements or information. Statements and information in this news release speak only as of the date they were made, and Fox Corporation does not undertake any duty to update or release any revisions to any forward looking statement made in this news release or to report any events or circumstances after the date of this news release or to reflect the occurrence of unanticipated events or to conform such statements and information to actual results or changes in expectations, except as required by law. View original content to download multimedia:http://www.prnewswire.com/news-releases/credible-stockholders-overwhelmingly-vote-in-favour-of-merger-with-fox-corporation-300938239.htmlSOURCE  Fox Corporation"
    },
    {
        "title": "Fox Corporation Executives to Discuss First Quarter Fiscal 2020 Financial Results Via Webcast",
        "subtitle": "",
        "date": "Oct 11, 2019 10:17AM EDT",
        "content": "NEW YORK and LOS ANGELES, Oct. 11, 2019 /PRNewswire/ -- Fox Corporation (Nasdaq: FOXA, FOX) will discuss first quarter fiscal 2020 financial results via a live audio webcast beginning at 4:30 p.m. EDT / 1:30 p.m. PDT on Wednesday, November 6, 2019.Results will be released after the close of regular trading on November 6, 2019.A live audio webcast of the presentation, and the archived webcast, will be available at investor.foxcorporation.com. About Fox CorporationFox Corporation produces and distributes compelling news, sports and entertainment content through its iconic domestic brands including: FOX News Media, FOX Sports, FOX Entertainment and the FOX Television Stations. These brands hold cultural significance with consumers and commercial importance for distributors and advertisers. The breadth and depth of our footprint allows us to deliver content that engages and informs audiences, develops deeper consumer relationships and creates more compelling product offerings. FOX maintains an impressive track record of news, sports, and entertainment industry success that will shape our strategy to capitalize on current strengths and invest in new initiatives. For more information about Fox Corporation, please visit www.FoxCorporation.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/fox-corporation-executives-to-discuss-first-quarter-fiscal-2020-financial-results-via-webcast-300937175.htmlSOURCE  Fox Corporation"
    }
]