[
    {
        "title": "Gilead to Acquire Forty Seven for $4.9 Billion",
        "subtitle": "",
        "date": "Mar 2, 2020 6:55AM EST",
        "content": "\n– Gilead Gains Forty Seven’s Investigational Immuno-Oncology Therapy in Multiple Clinical Studies for Diseases Including Myelodysplastic Syndrome, Acute Myeloid Leukemia and Diffuse Large B-Cell Lymphoma –\n\n– Transaction Supports Gilead’s Strategic Focus in Oncology and Gives Access to Potential New First-in-Class Program and Innovative Pipeline –\n    FOSTER CITY, Calif. & MENLO PARK, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) and Forty Seven, Inc. (Nasdaq: FTSV) announced today that the companies have entered into a definitive agreement pursuant to which Gilead will acquire Forty Seven for $95.50 per share in cash. The transaction, which values Forty Seven at approximately $4.9 billion, was unanimously approved by both the Gilead and Forty Seven Boards of Directors and is anticipated to close during the second quarter of 2020, subject to regulatory approvals and other customary closing conditions.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200302005443/en/\nThrough the addition of Forty Seven’s investigational lead product candidate, magrolimab, the acquisition will strengthen Gilead’s immuno-oncology research and development portfolio. Magrolimab is a monoclonal antibody in clinical development for the treatment of several cancers for which new, transformative medicines are urgently needed, including myelodysplastic syndrome (MDS), acute myeloid leukemia (AML) and diffuse large B-cell lymphoma (DLBCL). The investigational therapy targets CD47, a “do not eat me” signal that allows cancer cells to avoid destruction thereby permitting the patient’s own innate immune system to engulf and eradicate those cancer cells. Forty Seven presented promising results of a Phase 1b study of magrolimab in patients with MDS and AML at the American Society of Hematology meeting in December 2019. Magrolimab has the potential to be a first-in-class therapy.\n\n“This agreement builds on Gilead’s presence in immuno-oncology and adds significant potential to our clinical pipeline,” said Daniel O’Day, Chairman and Chief Executive Officer of Gilead Sciences. “Magrolimab complements our existing work in hematology, adding a non-cell therapy program that complements Kite’s pipeline of cell therapies for hematological cancers. With a profile that lends itself to combination therapies, magrolimab could potentially have transformative benefits for a range of tumor types. We are looking forward to working with the highly experienced team at Forty Seven to help patients with some of the most challenging forms of cancer.”\n\n“This is an exciting day for patients who may one day benefit from future anti-CD47 therapies and other immuno-oncology treatments based on our research and an exciting time for Forty Seven as this allows us to achieve our vision of helping patients defeat their cancer,” commented Mark McCamish, MD, PhD, President and Chief Executive Officer of Forty Seven. “We are pleased to join Gilead and believe that by combining our scientific expertise with Gilead’s strength in developing treatments that modify the immune system, we will be able to more rapidly advance our therapies.”\n\nMagrolimab\n\nForty Seven is initially studying magrolimab in patients with MDS and AML. Additional studies are ongoing in non-Hodgkin lymphoma (NHL) and solid tumors. Magrolimab has been granted Fast Track designation by the U.S. Food and Drug Administration (FDA) for the treatment of MDS and AML, and for the treatment of relapsed or refractory DLBCL and follicular lymphoma, two forms of B-cell NHL. Magrolimab has also been granted Orphan Drug designation by the FDA for the treatment of MDS and AML and by the European Medicines Agency for the treatment of AML.\n\nMore than 400 patients have received the compound to date through clinical trials.\n\nOngoing Phase 1b Clinical Trial\n\nIn December 2019, Forty Seven presented promising results of a Phase 1b trial evaluating magrolimab in combination with azacitidine in untreated patients with higher risk MDS and untreated patients with AML, who are ineligible for induction chemotherapy. This has led to the initiation of a potential registrational cohort in MDS. All patients received a 1 mg/kg priming dose of magrolimab, coupled with intrapatient dose escalation to mitigate on-target anemia. Patients were then treated with full doses of azacitidine and magrolimab maintenance doses of 30 mg/kg weekly.\n\nAs of the data cutoff of November 18, 2019, 62 patients had been treated with the combination in the Phase 1b portion of the trial, including 35 patients with MDS and 27 patients with AML.\n\nClinical Activity Data\n\nAs of the data cutoff, 46 patients were evaluable for response assessment, including 24 patients with untreated higher-risk MDS and 22 patients with untreated AML, who were ineligible for induction chemotherapy.\n\nSafety Data \n\nAs of the data cutoff, the combination of magrolimab and azacitidine was well-tolerated, with no evidence of increased toxicities compared to azacitidine alone. Adverse events (AEs) were consistent with prior clinical experience. No deaths were observed in the first 60 days on combination treatment and only one patient out of 62 (1.6 percent) discontinued treatment due to a treatment-related AE.\n\nAdditional Programs\n\nBeyond magrolimab, Forty Seven is preparing to advance two additional investigational compounds into clinical testing. FSI-174, an anti-cKIT antibody, is being developed in combination with magrolimab as a novel, all-antibody conditioning regimen to address the limitations of current stem cell transplantation conditioning regimens. FSI-189, an anti-SIRPα antibody, is being developed for the treatment of cancer, as well as certain non-oncology settings, including transplantation conditioning.\n\nTerms of the Transaction\n\nUnder the terms of the merger agreement, a wholly-owned subsidiary of Gilead will promptly commence a tender offer to acquire all of the outstanding shares of Forty Seven’s common stock at a price of $95.50 per share in cash. Following successful completion of the tender offer, Gilead will acquire all remaining shares not tendered in the offer through a second step merger at the same price as in the tender offer.\n\nConsummation of the tender offer is subject to a minimum tender of at least a majority of outstanding Forty Seven shares plus Forty Seven shares underlying vested options, the expiration or termination of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act and other customary conditions.\n\nGilead plans to pay all cash consideration for the transaction. The tender offer is not subject to a financing condition.\n\nCiti and J.P. Morgan are acting as joint financial advisors to Gilead. Centerview Partners LLC is acting as the exclusive financial advisor to Forty Seven. Skadden, Arps, Slate, Meagher & Flom LLP is serving as legal counsel to Gilead and Cooley LLP is serving as legal counsel to Forty Seven.\n\nConference Call\n\nAt 8:00 a.m. Eastern Time today, Gilead's management will host a conference call and a simultaneous webcast to discuss the transaction. A live webcast of the call can be accessed at Gilead’s Investors page at http://investors.gilead.com. Please connect to the website at least 15 minutes prior to the start of the call to allow adequate time for any software download that may be required. Alternatively, please call 877-359-9508 (U.S.) or 224-357-2393 (international) and dial the conference ID 8479332 to access the call.\n\nTelephone replay will be available approximately two hours after the call through 8:30 a.m. Eastern Time, March 4, 2020. To access the replay, please call 855-859-2056 (U.S.) or 404-537-3406 (international) and dial the conference ID 8479332. The webcast will be archived on www.gilead.com for one year.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California. For more information on Gilead Sciences, please visit the company’s website at www.gilead.com.\n\nAbout Forty Seven\n\nForty Seven, Inc. is a clinical-stage immuno-oncology company that is developing therapies targeting cancer immune evasion pathways and specific cell targeting approaches based on technology licensed from Stanford University. Forty Seven’s lead program, magrolimab, is a monoclonal antibody against the CD47 receptor, a “don’t eat me” signal that cancer cells commandeer to avoid being ingested by macrophages. This antibody is currently being evaluated in multiple clinical studies in patients with myelodysplastic syndrome, acute myeloid leukemia, non-Hodgkin lymphoma, and solid tumors. For more information on Forty Seven, please visit the company’s website at www.fortyseveninc.com.\n\nForward-Looking Statements \n\nThis communication contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, related to Gilead, Forty Seven and the acquisition of Forty Seven by Gilead that are subject to risks, uncertainties and other factors. All statements other than statements of historical fact are statements that could be deemed forward-looking statements, including all statements regarding the intent, belief or current expectation of the companies’ and members of their senior management team. Forward-looking statements include, without limitation, statements regarding the business combination and related matters, prospective performance and opportunities, post-closing operations and the outlook for the companies’ businesses, including, without limitation, the ability of Gilead to advance Forty Seven’s product pipeline, including magrolimab, FSI-174 and FSI-189; regulatory approval of magrolimab, FSI-174 and FSI-189 on a timely basis; the anticipated timing of clinical data; the possibility of unfavorable results from clinical trials; filings and approvals relating to the transaction; the expected timing of the completion of the transaction; the ability to complete the transaction considering the various closing conditions; difficulties or unanticipated expenses in connection with integrating the companies; and any assumptions underlying any of the foregoing. Investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties and are cautioned not to place undue reliance on these forward-looking statements. Actual results may differ materially from those currently anticipated due to a number of risks and uncertainties. Risks and uncertainties that could cause the actual results to differ from expectations contemplated by forward-looking statements include: uncertainties as to the timing of the tender offer and merger; uncertainties as to how many of Forty Seven’s stockholders will tender their stock in the offer; the possibility that competing offers will be made; the possibility that various closing conditions for the transaction may not be satisfied or waived, including that a governmental entity may prohibit, delay or refuse to grant approval for the consummation of the transaction; the effects of the transaction on relationships with employees, other business partners or governmental entities; the difficulty of predicting the timing or outcome of FDA approvals or actions, if any; the impact of competitive products and pricing; other business effects, including the effects of industry, economic or political conditions outside of the companies’ control; transaction costs; actual or contingent liabilities; and other risks and uncertainties detailed from time to time in the companies’ periodic reports filed with the U.S. Securities and Exchange Commission (the “SEC”), including current reports on Form 8-K, quarterly reports on Form 10-Q and annual reports on Form 10-K, as well as the Schedule 14D-9 to be filed by Forty Seven and the Schedule TO and related tender offer documents to be filed by Gilead and Toro Merger Sub, Inc., a wholly owned subsidiary of Gilead. All forward-looking statements are based on information currently available to Gilead and Forty Seven, and Gilead and Forty Seven assume no obligation and disclaim any intent to update any such forward-looking statements.\n\nAdditional Information and Where to Find It\n\nThe tender offer described in this communication has not yet commenced. This communication is for informational purposes only and is neither an offer to purchase nor a solicitation of an offer to sell shares of Forty Seven, nor is it a substitute for any tender offer materials that Gilead, its acquisition company or Forty Seven will file with the SEC. A solicitation and an offer to buy shares of Forty Seven will be made only pursuant to an offer to purchase and related materials that Gilead intends to file with the SEC. At the time the tender offer is commenced, Gilead will file a Tender Offer Statement on Schedule TO with the SEC, and Forty Seven will file a Solicitation/Recommendation Statement on Schedule 14D-9 with the SEC with respect to the tender offer. FORTY SEVEN’S STOCKHOLDERS AND OTHER INVESTORS ARE URGED TO READ THE TENDER OFFER MATERIALS (INCLUDING AN OFFER TO PURCHASE, A RELATED LETTER OF TRANSMITTAL AND CERTAIN OTHER TENDER OFFER DOCUMENTS) AND THE SOLICITATION/RECOMMENDATION STATEMENT BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION WHICH SHOULD BE READ CAREFULLY BEFORE ANY DECISION IS MADE WITH RESPECT TO THE TENDER OFFER. The Offer to Purchase, the related Letter of Transmittal and certain other tender offer documents, as well as the Solicitation/Recommendation Statement, will be sent to all stockholders of Forty Seven at no expense to them. The Tender Offer Statement and the Solicitation/Recommendation Statement will be made available for free at the SEC's web site at www.sec.gov. Additional copies may be obtained for free by contacting Gilead or Forty Seven. Free copies of these materials and certain other offering documents will be made available by Gilead by mail to Gilead Sciences, Inc., 333 Lakeside Drive, Foster City, CA 94404, attention: Investor Relations, by phone at 1-800-GILEAD-5 or 1-650-574-3000, or by directing requests for such materials to the information agent for the offer, which will be named in the Tender Offer Statement. Copies of the documents filed with the SEC by Forty Seven will be available free of charge under the “Investors” section of Forty Seven’s internet website at ir.fortyseveninc.com.\n\nIn addition to the Offer to Purchase, the related Letter of Transmittal and certain other tender offer documents, as well as the Solicitation/Recommendation Statement, Gilead and Forty Seven file annual, quarterly and current reports, proxy statements and other information with the SEC. Gilead’s and Forty Seven’s filings with the SEC are also available for free to the public from commercial document-retrieval services and at the website maintained by the SEC at www.sec.gov.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005443/en/\nGilead Sciences, Inc.\nDouglas Maffei, PhD, Investors\n(650) 522-2739\n\nAmy Flood, Media\n(650) 522-5643\n\nForty Seven, Inc.\nHannah Deresiewicz, Investors\n(212) 362-1200\n\nAnn Rhoads, Investors\n(650) 352-4853\n\nSarah Plumridge, Media\n(312) 506-5200\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Sciences Initiates Two Phase 3 Studies of Investigational Antiviral Remdesivir for the Treatment of COVID-19",
        "subtitle": "",
        "date": "Feb 26, 2020 5:00PM EST",
        "content": "\n-- U.S. FDA Grants Investigational New Drug Authorization to Study Remdesivir for the Treatment of COVID-19 --\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced the initiation of two Phase 3 clinical studies to evaluate the safety and efficacy of remdesivir in adults diagnosed with COVID-19 (novel coronavirus). These randomized, open-label, multicenter studies will enroll approximately 1,000 patients at medical centers primarily across Asian countries, as well as other countries globally with high numbers of diagnosed cases, beginning in March. The studies will assess two dosing durations of remdesivir, administered intravenously. The initiation of these studies follows the U.S. Food and Drug Administration’s (FDA) rapid review and acceptance of Gilead’s investigational new drug (IND) filing for remdesivir for the treatment of COVID-19.\n\nThe new clinical studies expand the ongoing research into remdesivir, which includes two clinical trials in China’s Hubei province led by the China-Japan Friendship Hospital as well as the recently initiated clinical trial in the United States led by the National Institute of Allergy and Infectious Diseases (NIAID). Gilead has donated drug and provided scientific input for these studies, with results from those in China expected in April.\n\n“Gilead’s primary focus is on rapidly determining the safety and efficacy of remdesivir as a potential treatment for COVID-19, and this complementary array of studies helps to give us a more expansive breadth of data globally on the drug’s profile in a short amount of time. The speed with which remdesivir has moved into clinical development for this coronavirus reflects the pressing need for treatment options and the shared commitment of industry, governments, global health organizations and healthcare providers to respond to this public health threat with the highest urgency,” said Merdad Parsey, MD, PhD, Chief Medical Officer, Gilead Sciences.\n\nThe Gilead studies will evaluate two dosing durations of remdesivir. One study will randomize approximately 400 patients with severe clinical manifestations of COVID-19 to receive either five or 10 days of remdesivir. The second study will randomize approximately 600 patients with moderate clinical manifestations of disease to receive five or 10 days of remdesivir or standard of care alone. The primary endpoint of both studies is clinical improvement, as described below.\n\nRemdesivir is not yet licensed or approved anywhere globally and has not been demonstrated to be safe or effective for any use. Working with government agencies, non-governmental organizations and local regulatory authorities, Gilead is providing remdesivir to qualified patients with COVID-19 on a compassionate use basis for emergency treatment outside of ongoing clinical studies.\n\nFor more information on Gilead’s response to the coronavirus outbreak please visit the company’s dedicated page: https://www.gilead.com/purpose/advancing-global-health/covid-19\n\nAbout Remdesivir\n\nRemdesivir is an investigational nucleotide analog with broad-spectrum antiviral activity both in vitro and in vivo in animal models against multiple emerging viral pathogens including Ebola, Marburg, MERS and SARS. Remdesivir has been studied in healthy volunteers and in people with Ebola virus infection. Individual compassionate use cases are not sufficient to determine the safety and efficacy of remdesivir in treating COVID-19, which can only be determined through prospective clinical trials.\n\nAbout Gilead-Sponsored New Remdesivir Clinical Trials\n\nThe first of two studies will evaluate the safety and efficacy of both a 5-day and a 10-day dosing regimen of remdesivir administered intravenously in patients with severe manifestations of COVID-19. Approximately 400 participants will be randomized in a 1:1 ratio to receive remdesivir 200 mg on day one, followed by remdesivir 100 mg each day until day 5 or 10, in addition to standard of care. The primary objective of this study is to evaluate the effect of remdesivir, as measured by the normalization of fever and oxygen saturation [T  94%, sustained for at least 24 hours through Day 14].\n\nThe second study will evaluate the safety and efficacy of a 5-day and a 10-day dosing regimen of remdesivir administered intravenously in patients with moderate manifestations of COVID-19, compared with standard of care. Approximately 600 participants will be randomized in a 1:1:1 ratio to receive remdesivir 200 mg on day one, followed by remdesivir 100 mg in addition to standard of care each day until day 5 or 10, compared with standard of care alone. The primary objective of this study is to evaluate the effect of remdesivir, as measured by the proportion of participants in each group discharged by day 14.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California. For more information on Gilead Sciences, please visit the company’s website at www.gilead.com.\n\nForward Looking Statement\n\nThis press release includes forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks, uncertainties and other factors, including the possibility of unfavorable results from clinical trials involving remdesivir and the possibility that we may be unable to complete one or more of such trials in the currently anticipated timelines or at all. Further, it is possible that Gilead may make a strategic decision to discontinue development of remdesivir. As a result, remdesivir may never be successfully commercialized. All statements other than statements of historical fact are statements that could be deemed forward-looking statements. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. The reader is cautioned not to rely on these forward-looking statements. These and other risks are described in detail in Gilead’s Annual Report on Form 10-K for the year ended December 31, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005955/en/\nSonia Choi, Media\n(650) 425-5483\n\nDouglas Maffei, Ph.D., Investors\n(650) 522-2739 \nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Appoints Michael Quigley to Lead Research Biology Group and Names Linda Higgins as Head of Company’s External Innovation Center",
        "subtitle": "",
        "date": "Feb 19, 2020 8:30AM EST",
        "content": "    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) announced today that Michael Quigley, PhD has joined the company as Senior Vice President, Research Biology, bringing to the role deep experience in oncology and immuno-oncology biology.\n\nDr. Quigley joins Gilead from Bristol-Myers Squibb, where most recently he was Vice President and Head, Tumor Microenvironment Modulation Thematic Research Center and Site Head of the Redwood City, California location. In that role, Dr. Quigley was responsible for setting strategy for Bristol-Myers Squibb’s oncology discovery portfolio and business development activities, overseeing target identification, validation and preclinical development of large and small molecule therapies. He received a PhD in Immunology from Duke University and conducted his post-doctoral research at the Dana Farber Cancer Institute, Department of Pediatric Oncology. Dr. Quigley will report to William Lee, PhD, Executive Vice President of Research.\n\nThe company also announced that Linda Higgins, PhD, has recently taken on the role of Senior Vice President and Head of External Innovation. Dr. Higgins joined Gilead in 2010, leading a significant expansion of the company’s Biology organization that included the establishment of Biologics and Biomarker functions, as well as the addition of inflammation, oncology and immunology discovery groups. Under Dr. Higgins’ leadership, the Biology organization supported the discovery and development of eight marketed products and the advancement of more than 30 compounds into development. Dr. Higgins holds a PhD from the University of California, San Diego and conducted her post-doctoral research at the University of California, Berkeley. She will continue to report to Dr. Lee.\n\n“We are very pleased to welcome Mike to Gilead and Linda to her new role, as we seek to build and scale our access to scientific innovation, both internally and externally,” commented Dr. Lee. “These appointments strengthen our research discovery organization and will help position us to reach our ambitious goal of bringing 10 new transformative therapies to patients over the next 10 years.”\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005311/en/\nChris Ridley, Media\n(650) 235-2220\n\nDouglas Maffei, Investors\n(650) 522-2739\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Sciences to Present at the Cowen and Company 40th Annual Health Care Conference on Monday, March 2, 2020",
        "subtitle": "",
        "date": "Feb 18, 2020 8:00PM EST",
        "content": "\nWebcast Available Through Gilead Corporate Website\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced that Johanna Mercier, Chief Commercial Officer, and Merdad Parsey, MD, PhD, Chief Medical Officer, will participate in a fireside chat at the Cowen and Company 40th Annual Health Care Conference in Boston on Monday, March 2 at 12:00 p.m. Eastern Time.\n\nThe live webcast can be accessed at the company’s investors page at http://investors.gilead.com. Please connect to the company’s website at least 15 minutes prior to the start of the presentation to ensure adequate time for any software download that may be required to listen to the webcast. The replay will be available for 14 days following the presentation.\n\nAbout Gilead\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200218006166/en/\nDouglas Maffei\nInvestor Relations\n(650) 522-2739\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Sciences Announces 8 Percent Increase In First Quarter 2020 Dividend",
        "subtitle": "",
        "date": "Feb 4, 2020 4:02PM EST",
        "content": "    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced that the company’s Board of Directors has declared an increase of 8% in the company’s quarterly cash dividend, beginning in the first quarter of 2020. The increase will result in a quarterly dividend of $0.68 per share of common stock. The dividend is payable on March 30, 2020, to stockholders of record at the close of business on March 13, 2020. Future dividends will be subject to Board approval.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005923/en/\nInvestors\nAndrew Dickinson\n(650) 524-0862\n\nDouglas Maffei, Ph.D.\n(650) 522-2739\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Sciences Announces Fourth Quarter and Full Year 2019 Financial Results",
        "subtitle": "",
        "date": "Feb 4, 2020 4:01PM EST",
        "content": "\n- Fourth Quarter Product Sales of $5.8 billion -\n\n- Full Year 2019 Product Sales of $22.1 billion -\n\n- Full Year 2019 Diluted EPS of $4.22 per share -\n\n- Full Year 2019 Non-GAAP Diluted EPS of $6.63 per share -\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) announced today its results of operations for the fourth quarter and full year 2019. Total revenues for the fourth quarter of 2019 were $5.9 billion compared to $5.8 billion for the same period in 2018. Net income for the fourth quarter of 2019 was $2.7 billion, or $2.12 per diluted share, compared to net income of $3 million, or $0.00 per diluted share, for the same period in 2018. Non-GAAP net income for the fourth quarter of 2019 was $1.7 billion, or $1.30 per diluted share, compared to $1.9 billion, or $1.44 per diluted share, for the same period in 2018.\n\nFull year 2019 total revenues were $22.4 billion, compared to $22.1 billion for 2018. Net income for 2019 was $5.4 billion, or $4.22 per diluted share, compared to $5.5 billion, or $4.17 per diluted share, for 2018. Non-GAAP net income for 2019 was $8.5 billion, or $6.63 per diluted share, compared to $8.7 billion, or $6.67 per diluted share, for 2018.\n\nFor the fourth quarter of 2019, compared to the same period in 2018, net income attributable to Gilead increased primarily due to the net favorable tax effects of intra-entity intangible asset transfers to different tax jurisdictions and an increase in net gains from equity securities. In addition, during the fourth quarter of 2019 and 2018, Gilead recorded pre-tax impairment charges of $800 million and $820 million, respectively, related to in-process research and development (IPR&D) intangible assets acquired in connection with the acquisition of Kite Pharma, Inc. (Kite) and pre-tax write-downs of $500 million and $410 million, respectively, for slow moving and excess raw material and work in process inventory.\n\nIn addition to the factors noted above, the full year 2019, compared to the same period in 2018, was impacted by pre-tax up-front collaboration and licensing expenses of $3.92 billion related to Gilead’s global research and development collaboration agreement with Galapagos NV (Galapagos) in 2019.\n\nThe following tables summarize significant items that impacted the comparability of net income attributable to Gilead and diluted earnings per share in the periods presented:\n\nProduct Sales\n\nTotal product sales for the fourth quarter of 2019 were $5.8 billion, compared to $5.7 billion for the same period in 2018. Product sales for the fourth quarter of 2019 were $4.5 billion in the United States, $840 million in Europe and $440 million in other locations. Product sales for the fourth quarter of 2018 were $4.5 billion in the United States, $813 million in Europe and $398 million in other locations.\n\nTotal product sales in 2019 were $22.1 billion, compared to $21.7 billion in 2018. For 2019, product sales were $16.6 billion in the United States, $3.6 billion in Europe and $2.0 billion in other locations. For 2018, product sales were $16.2 billion in the United States, $3.7 billion in Europe and $1.8 billion in other locations.\n\nCost of Goods Sold and Product Gross Margin\n\nFor the fourth quarter of 2019, compared to the same period in 2018:\n\nFor the full year 2019, compared to the same period in 2018:\n\nOperating Expenses\n\nFor the fourth quarter of 2019, compared to the same period in 2018:\n\nFor the full year 2019, compared to the same period in 2018:\n\nCash, Cash Equivalents and Marketable Debt Securities\n\nAs of December 31, 2019, Gilead had $25.8 billion of cash, cash equivalents and marketable debt securities compared to $31.5 billion as of December 31, 2018. During 2019, Gilead generated $9.1 billion in operating cash flow, paid $5.6 billion in connection with the global research and development collaboration agreement with Galapagos and equity investments in Galapagos, repaid $2.8 billion of principal amount of debt, paid cash dividends of $3.2 billion and utilized $1.7 billion on stock repurchases.\n\nFull Year 2020 Guidance\n\nGilead provides its full year 2020 guidance below. Starting in 2020, Gilead will no longer regularly exclude stock-based compensation expense from its non-GAAP financial information. For comparability purposes, full year 2019 non-GAAP operating income and non-GAAP diluted earnings per share would have been $10.4 billion and $6.13, respectively, had stock-based compensation expense not been excluded.\n\nCorporate, Product and Pipeline Updates for the Fourth Quarter, Including the Announcement of:\n\nViral Diseases\n\nInflammatory Diseases\n\nOncology\n\nFibrotic Diseases\n\nNon-GAAP Financial Information\n\nThe information presented in this document has been prepared in accordance with U.S. generally accepted accounting principles (GAAP), unless otherwise noted as non-GAAP. Management believes non-GAAP information is useful for investors, when considered in conjunction with Gilead’s GAAP financial information, because management uses such information internally for its operating, budgeting and financial planning purposes. Non-GAAP information is not prepared under a comprehensive set of accounting rules and should only be used to supplement an understanding of Gilead’s operating results as reported under GAAP. Non-GAAP measures may be defined and calculated differently by other companies in the same industry. A reconciliation between GAAP and non-GAAP financial information is provided in the tables on pages 9 through 12.\n\nConference Call\n\nAt 4:30 p.m. Eastern Time today, Gilead’s management will host a conference call and a simultaneous webcast to discuss the company’s fourth quarter and full year 2019 financial results and provide a business update. The live webcast of the call can be accessed at Gilead’s Investors page at http://investors.gilead.com. Please connect to the website at least 15 minutes prior to the start of the call to allow adequate time for any software download that may be required to listen to the webcast. Alternatively, please call 877-359-9508 (U.S.) or 224-357-2393 (international) and dial the conference ID 9634129 to access the call. Telephone replay will be available approximately two hours after the call through 8:00 p.m. Eastern Time, February 6, 2020. To access the replay, please call 855-859-2056 (U.S.) or 404-537-3406 (international) and dial the conference ID 9634129. The webcast will be archived on www.gilead.com for one year.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nForward-looking Statements\n\nStatements included in this press release that are not historical in nature are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Gilead cautions readers that forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially. These risks and uncertainties include: Gilead’s ability to achieve its anticipated full year 2020 financial results; Gilead’s ability to accelerate or sustain revenues for its antiviral and other programs; Gilead’s ability to realize the potential benefits of collaborations or licensing arrangements, including those with The Rockefeller University, Kyverna Therapeutics, Inc., Eisai Co., Ltd., Kiniksa Pharmaceuticals, Ltd. and Glympse Bio, Inc.; Gilead’s ability to initiate clinical trials in its currently anticipated timeframes; the risk that safety and efficacy data from clinical studies may not warrant further development of Gilead’s product candidates, including Yescarta in combination with mavrilimumab, 3BNC117, 10-1074, GS-6207 and product candidates evaluated for bridging fibrosis and compensated cirrhosis due to NASH; Gilead’s ability to submit new drug applications for new product candidates in the timelines currently anticipated; Gilead’s ability to receive regulatory approvals in a timely manner or at all, for new and current products, including FDA and MHLW approvals for filgotinib for the treatment of RA and FDA and European Commission approvals of KTE-X19 for the treatment of mantle cell lymphoma; Gilead’s ability to successfully commercialize its products, including expansion in China; the risk that private and public payers may be reluctant to provide, or continue to provide, coverage or reimbursement for new products; a larger than anticipated shift in payer mix to more highly discounted payer segments; market share and price erosion caused by the introduction of generic versions of Gilead products; the risk that physicians and patients may not see advantages of these products over other therapies and may therefore be reluctant to prescribe the products; other risks identified from time to time in Gilead’s reports filed with the U.S. Securities and Exchange Commission (the SEC). In addition, Gilead makes estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures. Gilead bases its estimates on historical experience and on various other market specific and other relevant assumptions that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. There may be other factors of which Gilead is not currently aware that may affect matters discussed in the forward-looking statements and may also cause actual results to differ significantly from these estimates. Further, results for the quarter and the year ended December 31, 2019 are not necessarily indicative of operating results for any future periods. Gilead directs readers to its press releases, Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 and other subsequent disclosure documents filed with the SEC. Gilead claims the protection of the Safe Harbor contained in the Private Securities Litigation Reform Act of 1995 for forward-looking statements. All forward-looking statements are based on information currently available to Gilead and Gilead assumes no obligation to update or supplement any such forward-looking statements other than as required by law. Any forward-looking statements speak only as of the date hereof or as of the dates indicated in the statements.\n\nGilead owns or has rights to various trademarks, copyrights and trade names used in its business, including the following: GILEAD®, GILEAD SCIENCES®, AMBISOME®, ATRIPLA®, BIKTARVY®, CAYSTON®, COMPLERA®, DESCOVY®, DESCOVY FOR PREP®, EMTRIVA®, EPCLUSA®, EVIPLERA®, GENVOYA®, HARVONI®, HEPSERA®, LETAIRIS®, ODEFSEY®, RANEXA®, SOVALDI®, STRIBILD®, TRUVADA®, TRUVADA FOR PREP®, TYBOST®, VEMLIDY®, VIREAD®, VOSEVI®, YESCARTA® and ZYDELIG®.\n\nLEXISCAN® is a registered trademark of Astellas U.S. LLC. MACUGEN® is a registered trademark of Bausch Health Ireland Limited. SYMTUZA® is a registered trademark of Janssen Sciences Ireland UC. TAMIFLU® is a registered trademark of Hoffmann-La Roche Inc. This report also refers to trademarks, service marks and trade names of other companies.\n\nFor more information on Gilead Sciences, Inc., please visit www.gilead.com or call the Gilead Public Affairs Department at 1-800-GILEAD-5 (1-800-445-3235).\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005925/en/\nInvestors\nAndrew Dickinson\n(650) 524-0862\n\nDouglas Maffei\n(650) 522-2739\n\nMedia\nAmy Flood\n(650) 522-5643\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Sandra Horning, MD, Joins Gilead Sciences’ Board of Directors",
        "subtitle": "",
        "date": "Jan 30, 2020 4:05PM EST",
        "content": "    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) announced today that Sandra Horning, MD, has been appointed to the company’s Board of Directors.\n\nDr. Horning retired in 2019 as Chief Medical Officer and Global Head of Product Development for Roche, after a 10-year career at Roche and Genentech during which she helped bring 15 new medicines to patients in disease areas including cancer, multiple sclerosis, influenza and blindness. Prior to her career at Roche, Dr. Horning spent 25 years as a practicing oncologist, investigator and tenured professor at Stanford University School of Medicine. From 2015 to 2018, Dr. Horning served on the Foundation Medicine Board of Directors and she currently serves as an advisor to EQRx.\n\n“We are very pleased to welcome Sandra Horning to our Board of Directors,” said Daniel O’Day, Chairman and Chief Executive Officer of Gilead Sciences. “Sandra has significant industry expertise and vast experience in drug development across multiple therapeutic areas. In addition, she brings the perspective of a leading physician who has spent more than two decades caring for patients with cancer. Sandra’s presence on our Board will be a tremendous asset as we enter the next chapter for Gilead with the goal of rapidly advancing new, transformative medicines.”\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005774/en/\nDouglas Maffei, Investors\n(650) 522-2739\n\nAmy Flood, Media\n(650) 522-5643\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Sciences to Release Fourth Quarter and Full Year 2019 Financial Results on Tuesday, February 4, 2020",
        "subtitle": "",
        "date": "Jan 21, 2020 5:30PM EST",
        "content": "\n-- Conference Call and Webcast to Follow --\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) announced today that its fourth quarter and full year 2019 financial results will be released on Tuesday, February 4, after the market closes. At 4:30 p.m. Eastern Time, Gilead’s management will host a conference call to discuss the company’s fourth quarter and full year 2019 financial results and will provide a business update.\n\nThe live webcast of the call can be accessed at the company’s Investors page at http://investors.gilead.com. Please connect to the company’s website at least 15 minutes prior to the start of the call to ensure adequate time for any software download that may be required to listen to the webcast. Alternatively, please call 877-359-9508 (U.S.) or 224-357-2393 (international) and dial the conference ID 9634129 to access the call. Telephone replay will be available approximately two hours after the call through 8:00 p.m. Eastern Time, February 6, 2020. To access the replay, please call 855-859-2056 (U.S.) or 404-537-3406 (international) and dial the conference ID 9634129. The webcast will be archived on www.gilead.com for one year.\n\nAbout Gilead\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121006118/en/\nDouglas Maffei, Ph.D.\nInvestor Relations\n(650) 522-2739\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Kyverna Therapeutics Secures $25 Million Series A Funding from Key Investors and Enters into Strategic Collaboration with Gilead Sciences",
        "subtitle": "Collaboration Brings Together Gilead's Commitment to Advancing Cell Therapy with Kyverna's Focus on Advanced T Cell Engineering Targeting Autoimmune Diseases",
        "date": "Jan 13, 2020 5:45AM EST",
        "content": "BERKELEY, Calif., Jan. 13, 2020 /PRNewswire/ -- Kyverna Therapeutics (\"Kyverna\"), a cell therapy company engineering a new class of therapies for serious autoimmune diseases, announced today that it has raised $25 million in a Series A investment from Vida Ventures and Westlake Village BioPartners, both of which were founding investors, as well as Gilead Sciences (NASDAQ: GILD). Proceeds from the financing will be used to advance Kyverna's therapeutic strategy which combines advanced T cell engineering and synthetic biology technologies to suppress and eliminate autoreactive immune cells at the root cause of inflammatory disease. Dominic Borie, M.D., Ph.D., has been appointed as Chief Executive Officer (CEO). Jeffrey Greve, Ph.D., will continue to serve as Kyverna's Chief Scientific Officer (CSO). Prior to Kyverna, Dr. Greve founded and served as CSO of Delinia, an autoimmune disease company acquired by Celgene in 2017. As part of this financing, Fred Cohen, M.D., D.Phil., Co-Founder and Senior Managing Director of Vida Ventures will serve as Chairman of the Board. Beth Seidenberg, M.D., Co-Founding Managing Director of Westlake Village BioPartners, Desmond Padhi, B.Sc., Pharm. D., Principal at Westlake Village BioPartners, Brian Kotzin, M.D., Senior Vice President of Nektar Therapeutics, Peter Emtage, Ph.D., Senior Vice President, Global Head of Research, Kite, a Gilead Company, one additional representative from Vida Ventures to be named, and Dominic Borie, M.D., Ph.D., will serve on the Company's the Board of Directors. \"We are just beginning to see the potential for cell therapy and the opportunity to change the course of disease. Dominic's skill as an immunologist and transplant surgeon, coupled with his proven leadership skill as an executive in the biopharmaceutical industry is what we require to embark on our bold vision for Kyverna,\" said Fred Cohen, M.D., D.Phil., Co-Founder and Senior Managing Director of Vida Ventures. \"At Vida, we have a long-standing commitment to advancing cell therapy. We believe the team at Kyverna, under Dominic's stewardship and in partnership with Dr. Greve, the architect of the Kyverna scientific platform, has the ability to develop a new class of therapies for serious autoimmune diseases.\"\"This may be one of the most exciting times is our industry where a new modality has the potential to become the backbone of treatment for a variety of severe immune-related diseases,\" said Dominic Borie, M.D., Ph.D., newly appointed CEO of Kyverna. \"This opportunity perfectly unites my experience as a surgeon, academic and drug developer with my passion for finding cures for autoimmune diseases. I am proud to serve as Kyverna's CEO and be a part of this team.\"Kyverna also announced that it has entered into a strategic collaboration and license agreement with Gilead to develop engineered T cell therapies for the treatment of autoimmune disease based on Kyverna's synthetic Treg platform and synNotch™ technology from Kite, a Gilead Company. Kyverna will be responsible for conducting research activities and initial clinical studies through proof-of-concept and Gilead will be granted an option, upon the exercise of which Gilead will be solely responsible for further clinical development and commercialization efforts for these programs. Gilead will make to Kyverna an upfront payment of $17.5 million and Kyverna may earn an additional $570 million in development and commercialization milestones. Kyverna will also continue to advance its platform and develop proprietary programs beyond the Gilead collaboration.\"Kyverna's approach combines advanced T cell engineering and synthetic biology technologies to develop significant new therapies for autoimmune and inflammatory diseases,\" said Beth Seidenberg, M.D., Co-Founding Managing Director of Los Angeles-based Westlake Village BioPartners. \"The strategic collaboration with Gilead Sciences in autoimmune diseases enables Kyverna to apply its therapeutic approach to this important unmet need.\"Dr. Borie is an accomplished immunologist and digestive tract and liver transplant surgeon with extensive experience in drug development. He joins Kyverna from Horizon Therapeutics where he served as Vice-President and Head, External Research and Development. Prior to Horizon, Dr. Borie served in numerous leadership functions within Genentech focused on global clinical development of immunology therapies including two anti-CD20 molecules (rituximab and obinutuzumab) in development for orphan immunology indications. Dr. Borie had joined Genentech from Amgen where he served as Medical Director and Global Development Leader for Inflammation. He started his career in industry at Roche as Director of Transplantation research before transitioning to Translational Medicine roles for inflammation. Prior to the transition to industry, Dr. Borie was in academia at Stanford University as the Director, Transplantation Immunology Laboratory where he became a key contributor in the validation of JAK inhibition as a new immunomodulatory approach to treating rheumatoid arthritis. Dr. Borie was previously a digestive surgery and liver transplantation attending surgeon at Pitie- Salpetriere Hospital, Assistance Publique in Paris, France. He received his Ph.D. in transplantation immunology from the University of Paris V - Descartes and his M.D., Master's degree in Immunology and Certificate of Immunology and Immunopathology from the University of Paris XII. About Vida VenturesVida Ventures is a next-generation life sciences investment firm founded by a group of scientists, physicians, entrepreneurs and investors passionate about building and funding breakthroughs in biomedicine. Together they form an independent, bold investment group bound together by a simple word – life. Its mission is to bring science to life and advance transformative biomedical innovations that have the potential to make a meaningful difference for patients. Vida has a bicoastal presence and currently has approximately $1 billion under management. For more information on Vida Ventures, please visit www.vidaventures.com, on LinkedIn or follow on Twitter @Vida_Ventures. About Westlake Village BioPartnersWestlake Village BioPartners is a Los Angeles area-based venture capital firm focused on incubating and building life sciences companies with entrepreneurs that have the potential to bring transformative therapies and technologies to patients. The Westlake model is built on the founding team's unique experience in successfully identifying and developing breakthrough therapies and building organizations. For more information, please visit http://westlakebio.com/.About Kyverna TherapeuticsKyverna Therapeutics, located in the San Francisco East Bay, is a cell therapy company engineering a new class of therapies for serious autoimmune diseases. The Kyverna therapeutic platform combines advanced T cell engineering and synthetic biology technologies to suppress and eliminate the autoreactive immune cells at the root cause of inflammatory diseases. For more information, please visit http://kyvernatx.com/.synNotch is a registered trademark of Kite Pharma, Inc. View original content to download multimedia:http://www.prnewswire.com/news-releases/kyverna-therapeutics-secures-25-million-series-a-funding-from-key-investors-and-enters-into-strategic-collaboration-with-gilead-sciences-300985379.htmlSOURCE  Kyverna Therapeutics"
    },
    {
        "title": "Gilead Sciences Licenses Portfolio of HIV Antibodies From The Rockefeller University",
        "subtitle": "",
        "date": "Jan 9, 2020 8:30AM EST",
        "content": "    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (NASDAQ: GILD) announced today that the company has licensed The Rockefeller University’s portfolio of broadly neutralizing antibodies (bNAbs) against HIV, including the two clinical-stage agents 3BNC117 and 10-1074. These investigational agents have potential for use in HIV long-acting therapies for treatment and prevention, as well as cure strategies.\n\nHIV bNAbs are a class of immunotherapy agents that were originally derived from HIV-infected individuals with a strong anti-HIV immunologic response and were designed to target HIV, particularly originating from the latent viral reservoir. Initial pre-clinical and clinical research has shown that HIV bNAbs can produce an enhanced, prolonged immune response to HIV, representing a promising new approach for HIV treatment or prevention in combination with other long-acting agents, or prolonged virologic remission in the absence of antiretroviral use. This licensing agreement provides an additional pathway for innovations in Gilead’s HIV pipeline in areas of evolving and unmet medical need.\n\n“The Rockefeller University’s broadly neutralizing HIV antibodies are well studied and have shown exceptional promise in early clinical trials,” said Diana Brainard, MD, Senior Vice President, HIV and Emerging Viruses, Gilead Sciences. “By harnessing the body’s own immune system against HIV, we seek to continue driving scientific innovation that will transform care and improve overall outcomes for all people living with HIV.”\n\n“Our scientists have amassed an extensive body of research showing that neutralizing antibodies have the potential to transform HIV therapy for many people living with the disease,” said Jeanne Farrell, PhD, Associate Vice President for Technology Advancement at The Rockefeller University. “We are committed to ensuring that this and other promising discoveries realize their promise to impact healthcare, by partnering with commercial stewards capable of advancing academic programs into potential future products that may benefit patients.”\n\nUnder the agreement, Gilead acquires exclusive global licenses to develop and commercialize Rockefeller’s full portfolio of HIV bNAbs. Rockefeller will receive an upfront payment and is eligible to receive cumulative milestone payments, as well as royalties on net sales. Additionally, Rockefeller will retain rights to perform non-clinical and early-stage clinical research on the portfolio of HIV antibodies.\n\nAntibodies 3BNC117 and 10-1074 are investigational therapies and are not approved by any regulatory body globally; their safety and efficacy have not been established. There is no cure for HIV or AIDS.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more than 30 years, Gilead has been a leading innovator in the field of HIV, driving advances in treatment, prevention, testing and linkage to care, and cure research. Today, it is estimated that more than 12 million people living with HIV globally receive antiretroviral therapy provided by Gilead or one of the company’s manufacturing partners.\n\nForward-Looking Statement\n\nThis press release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks, uncertainties and other factors, including the risk that the parties may not realize the potential benefits of this collaboration. It is possible that Gilead may make a strategic decision to discontinue development of 3BNC117, 10-1074 and other HIV bNAbs if, for example, Gilead believes commercialization will be difficult relative to other opportunities in its pipeline. As a result, these HIV bNAbs may never be successfully commercialized. All statements other than statements of historical fact are statements that could be deemed forward-looking statements. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. The reader is cautioned not to rely on these forward-looking statements. These and other risks are described in detail in Gilead’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nGilead and Gilead logo are trademarks of Gilead Sciences, Inc. or its related companies.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005277/en/\nDouglas Maffei, Ph.D., Investors\n(650) 522-2739\n\nRyan McKeel, Media\n(650) 377-3548\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead and Eisai Enter Into Agreement in Japan for the Co-Promotion of the Investigational Rheumatoid Arthritis Therapy Filgotinib, Pending Regulatory Approval",
        "subtitle": "",
        "date": "Dec 24, 2019 1:00AM EST",
        "content": "\n-- Agreement Extends to Additional Potential Indications for Filgotinib, Including Ulcerative Colitis, Crohn’s Disease and Psoriatic Arthritis --\n    FOSTER CITY, Calif. & TOKYO--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) and Eisai Co., Ltd. (Tokyo, Japan) announced today that Gilead Sciences K.K. (Tokyo, Japan) and Eisai have entered into an agreement for the distribution and co-promotion of filgotinib, an investigational, oral, selective JAK1 inhibitor, in Japan, pending regulatory approval for the treatment of rheumatoid arthritis (RA). Through this collaboration, Gilead Japan will retain responsibility for manufacturing and marketing approval of filgotinib, while Eisai will be responsible for product distribution in Japan in RA and other potential future indications. The companies will jointly commercialize the medicine if approved.\n\nApproximately 600,000 to 1 million people are living with RA across Japan, and despite available options, many still do not experience disease remission. In the global Phase 3 FINCH studies, filgotinib demonstrated durable efficacy and safety results across multiple RA patient populations, including in people with prior inadequate response to methotrexate treatment (MTX), those who were intolerant to one or more biologic treatments and those who were MTX treatment-naïve.\n\n“We are very pleased to announce this important new partnership with Eisai, which brings together our complementary expertise and commitment in inflammation, to deliver this important new option to patients living with inflammatory diseases in Japan,” said Luc Hermans, M.D., President and Representative Director, Gilead Japan.\n\n“We have extensive clinical development and commercialization experience spanning more than 20 years in RA and have established a solid RA franchise in Japan,” said Hidenori Yabune, President of Eisai Japan, Senior Vice President of Eisai. “With this agreement, we look forward to contributing more to patients living with RA by adding filgotinib to our product line-up.”\n\nGlobal studies investigating filgotinib in additional diseases are also underway, including the Phase 3 SELECTION trial in ulcerative colitis, the DIVERSITY Phase 3 trial in Crohn’s disease, the Phase 3 PENGUIN trials in psoriatic arthritis, as well as Phase 2 studies in uveitis and in small bowel and fistulizing Crohn’s disease.\n\nGilead and Galapagos NV (Mechelen, Belgium) have entered into a global collaboration for the development and commercialization of filgotinib in inflammatory indications. Filgotinib is an investigational drug whose efficacy and safety have not been established. Filgotinib is pending regulatory approval in Japan, Europe and the United States, based on global Phase 3 trials evaluating its efficacy and tolerability.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com.\n\nAbout Eisai Co., Ltd.\n\nEisai Co., Ltd. is a leading global research and development-based pharmaceutical company headquartered in Japan. We define our corporate mission as \"giving first thought to patients and their families and to increasing the benefits health care provides,\" which we call our human health care (hhc) philosophy. With approximately 10,000 employees working across our global network of R&D facilities, manufacturing sites and marketing subsidiaries, we strive to realize our hhc philosophy by delivering innovative products to address unmet medical needs, with a particular focus in our strategic areas of Neurology and Oncology. As a global pharmaceutical company, our mission extends to patients around the world through our investment and participation in partnership-based initiatives to improve access to medicines in developing and emerging countries.\n\nFor more information about Eisai Co., Ltd., please visit www.eisai.com/.\n\nGilead Forward-Looking Statement\n\nThis press release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks, uncertainties and other factors, including the risk that the Japanese Ministry of Health, Labour and Welfare and other regulatory agencies may not approve filgotinib for the treatment of RA or other potential indications, and any marketing approvals, if granted, may have significant limitations on its use. As a result, filgotinib may never be successfully commercialized. In addition, Gilead and Eisai may not realize the potential benefits of this partnership. Further, there is the possibility of unfavorable results from ongoing and additional clinical trials involving filgotinib. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. These and other risks are described in detail in Gilead’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191223005626/en/\nGilead Sciences, Japan\nSeiko Noma\n+81-3-6837-0790\n\nGilead Sciences, US\nSonia Choi\n+1 650-425-5483\n\nEisai Co., Ltd.\nPublic Relations Department\n+81-3-3817-5120\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Sciences to Present at the 38th Annual J.P. Morgan Healthcare Conference on Monday, January 13, 2020",
        "subtitle": "",
        "date": "Dec 23, 2019 8:01AM EST",
        "content": "\nWebcast Available Through Gilead Corporate Website\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced that Daniel O’Day, Gilead’s Chairman and Chief Executive Officer, will provide an overview of the company at the 38th Annual J.P. Morgan Healthcare Conference in San Francisco on Monday, January 13 at 9:30 a.m. Pacific Time.\n\nThe live webcast can be accessed at the company’s Investors page at http://investors.gilead.com. Please connect to the company’s website at least 15 minutes prior to the start of the presentation to ensure adequate time for any software download that may be required to listen to the webcast. The replay will be available for 14 days following the presentation.\n\nAbout Gilead\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191223005123/en/\nDouglas Maffei, Ph.D.\nInvestor Relations\n(650) 522-2739\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "China National Medical Products Administration Approves Vosevi® (Sofosbuvir, Velpatasvir and Voxilaprevir) for People With Chronic Hepatitis C Infection Who Require Re-Treatment",
        "subtitle": "",
        "date": "Dec 20, 2019 8:30AM EST",
        "content": "\n– Vosevi Provides a New Option for People with HCV Who Have Not Achieved Cure with Prior Direct-Acting Antiviral Treatment –\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (NASDAQ: GILD) announced today that the China National Medical Products Administration (NMPA) has approved Vosevi® (sofosbuvir 400mg/velpatasvir 100mg/voxilaprevir 100mg), a once-daily single-tablet regimen for the treatment of chronic hepatitis C virus (HCV) infection in adults without cirrhosis or with compensated cirrhosis who have failed prior treatment with a direct-acting antiviral (DAA) therapy.\n\nThe approval of Vosevi in China is supported by two global Phase 3 studies, POLARIS-1 and POLARIS-4, which evaluated 12 weeks of treatment with Vosevi among adults with HCV genotype 1-6 with or without compensated cirrhosis who had failed prior DAA treatment with or without an NS5A inhibitor. Across POLARIS-1 and POLARIS-4, 97 percent of patients treated with Vosevi (n=431/445) achieved SVR12, the primary endpoint to determine cure rate, defined as HCV RNA undetectable 12 weeks after completing therapy.\n\n“People who have not achieved HCV cure with direct acting antiviral medicines are often faced with limited choices for re-treatment,” said Professor Lai Wei, Director of Hepatology and Pancreatic Center, Tsinghua University-affiliated Beijing Tsinghua Changgung Hospital. “With high cure rates across all genotypes, Vosevi is a promising option for people who require a new regimen to potentially achieve an HCV cure.”\n\nThe most common adverse reactions (≥10 percent) experienced by patients treated with Vosevi in POLARIS-1 and POLARIS-4 were headache, fatigue, diarrhea and nausea. The proportion of patients who permanently discontinued treatment with Vosevi due to adverse events was 0.2 percent.\n\nIn China, approximately 10 million people are infected with HCV and it is the fourth most commonly reported infectious disease. HCV genotypes 1, 2, 3 and 6 account for more than 96 percent of all cases.\n\n“The approval of Vosevi in China means that many more patients with difficult-to-treat chronic HCV infection now have another chance at cure,” said Merdad Parsey, MD, PhD, Chief Medical Officer, Gilead Sciences. “It also represents another important step forward in achieving the public health goal of eliminating HCV in China and worldwide.”\n\nVosevi received marketing approval from the U.S. Food and Drug Administration (FDA) and the European Medicines Agency (EMA) in 2017. In the United States, Vosevi has a Boxed Warning in its product label regarding the risk of hepatitis B virus (HBV) reactivation in HCV/HBV coinfected patients. See below for U.S. Important Safety Information and Indication.\n\nU.S. Important Safety Information and Indications for Vosevi\n\nBOXED WARNING: RISK OF HEPATITIS B VIRUS REACTIVATION IN HCV/HBV COINFECTED PATIENTS\n\nTest all patients for evidence of current or prior hepatitis B virus (HBV) infection before initiating treatment with Vosevi. HBV reactivation has been reported in HCV/HBV coinfected patients who were undergoing or had completed treatment with HCV direct-acting antivirals (DAAs) and were not receiving HBV antiviral therapy. Some cases have resulted in fulminant hepatitis, hepatic failure, and death. Cases have been reported in patients who are HBsAg positive, in patients with serologic evidence of resolved HBV and also in patients receiving certain immunosuppressant or chemotherapeutic agents; the risk of HBV reactivation associated with treatment with HCV DAAs may be increased in patients taking these other agents. Monitor HCV/HBV coinfected patients for hepatitis flare or HBV reactivation during HCV treatment and post-treatment follow-up. Initiate appropriate patient management for HBV infection as clinically indicated.\n\nContraindications\n\nVosevi is contraindicated with rifampin.\n\nWarnings and Precautions\n\nRisk of Hepatic Decompensation/Failure in Patients with Evidence of Advanced Liver Disease: Post-marketing cases of hepatic decompensation/failure, some fatal, have been reported in patients treated with HCV NS3/4A protease inhibitor-containing regimens, including Vosevi. Reported cases occurred in patients with baseline cirrhosis with and without moderate or severe liver impairment (Child-Pugh B or C). In patients with compensated cirrhosis (Child-Pugh A) or evidence of advanced liver disease such as portal hypertension, perform hepatic laboratory testing as clinically indicated; and monitor for signs and symptoms of hepatic decompensation such as the presence of jaundice, ascites, hepatic encephalopathy, and variceal hemorrhage. Discontinue Vosevi in patients who develop evidence of hepatic decompensation/failure. Vosevi is not recommended in patients with moderate to severe hepatic impairment or those with any history of prior hepatic decompensation/failure.\n\nSerious Symptomatic Bradycardia When Coadministered with Amiodarone: Amiodarone is not recommended for use with Vosevi due to the risk of symptomatic bradycardia, particularly in patients also taking beta blockers or with underlying cardiac comorbidities and/or with advanced liver disease. A fatal cardiac arrest was reported in a patient taking amiodarone who was coadministered a sofosbuvir-containing regimen. In patients without alternative, viable treatment options, cardiac monitoring is recommended. Patients should seek immediate medical evaluation if they develop signs or symptoms of bradycardia.\n\nRisk of Reduced Therapeutic Effect Due to Concomitant Use of Vosevi with P-gp Inducers and/or Moderate to Potent Inducers of CYP2B6, CYP2C8 or CYP3A4: St. John’s wort and carbamazepine are not recommended for use with Vosevi as they may significantly decrease sofosbuvir, velpatasvir and/or voxilaprevir plasma concentrations.\n\nAdverse Reactions\n\nThe most common adverse reactions (≥10%, all grades) observed with treatment with VOSEVI for 12 weeks were headache, fatigue, diarrhea and nausea.\n\nDrug Interactions\n\nCoadministration of Vosevi is not recommended with phenytoin, phenobarbital, oxcarbazepine, rifabutin, rifapentine, atazanavir, lopinavir, tipranavir/ritonavir, efavirenz, rosuvastatin, pitavastatin and cyclosporine due to changes (decreased or increased) in concentrations of sofosbuvir, velpatasvir, voxilaprevir and/or the other agent.\n\nConsult the full Prescribing Information for Vosevi for more information on potentially significant drug interactions, including clinical comments.\n\nU.S. INDICATION \n\nVosevi is indicated for the treatment of chronic hepatitis C virus (HCV) infection in adults without cirrhosis or with compensated cirrhosis who have failed prior treatment with an HCV direct-acting antiviral (DAA) who have:\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nForward-Looking Statement\n\nThis press release includes forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, that are subject to risks, uncertainties and other factors, including the risk that physicians may not see the benefits of prescribing Vosevi for the treatment of adults with chronic HCV infection. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. The reader is cautioned not to rely on these forward-looking statements. These and other risks are described in detail in Gilead’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nU.S. full Prescribing Information for Vosevi, including BOXED WARNING, is available at www.gilead.com.\n\nVosevi is a registered trademark of Gilead Sciences, Inc., or its related companies.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191220005282/en/\nGreg Mann, Investors\n(424) 322-1795\n\nSonia Choi, Media\n(650) 425-5483\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Submits Filgotinib New Drug Application to U.S. Food and Drug Administration Under Priority Review for Rheumatoid Arthritis Treatment",
        "subtitle": "",
        "date": "Dec 19, 2019 4:30PM EST",
        "content": "    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (NASDAQ: GILD) announced today that it has submitted a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for filgotinib, an investigational, oral, selective JAK1 inhibitor for the treatment of adults who are living with moderate-to-severe rheumatoid arthritis (RA). A priority review voucher was submitted with the NDA, shortening the anticipated time for review.\n\nThe filing is supported by 52-week data from the global Phase 3 FINCH clinical program, which evaluated the efficacy and safety of filgotinib in 3,452 patients with moderate to severely active RA. In the FINCH studies, filgotinib met its primary endpoints and demonstrated durable efficacy and safety results across multiple RA patient populations, including in people with prior inadequate response to methotrexate treatment (MTX), those who were intolerant to one or more biologic treatments and those who were MTX treatment-naïve. Safety results were consistent across the trials and further reinforce the long-term safety and tolerability profile of filgotinib for a broad range of RA patients.\n\nDespite the availability of current therapies, people living with RA may face persistent disease symptoms and inadequate responses to currently available therapies. One in five patients do not achieve complete disease remission during their lifetimes and remain in need of treatment options.\n\n“The new drug application submission for filgotinib represents an important step forward in bringing a potential new treatment option to people living with RA,” said Merdad Parsey, MD, PhD, Chief Medical Officer, Gilead Sciences. “In clinical trials, filgotinib has demonstrated an efficacy and tolerability profile that may offer meaningful improvements in RA treatment response for patients with this chronic, debilitating disease.”\n\nThis filing is the third regulatory agency submission for filgotinib in the past five months following submissions to the European Medicines Agency and Japanese Ministry of Health, Labor and Welfare earlier this year.\n\nFilgotinib is an investigational agent and is not approved by any regulatory authority. Its efficacy and safety have not been established.\n\nAbout the Filgotinib Collaborationi\n\nGilead and Galapagos NV are collaborative partners in the global development and commercialization of filgotinib in RA, and other potential inflammatory indications. In the United States, Gilead is solely responsible for the commercialization of filgotinib, pending approval of filgotinib by the FDA.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California. For more information on Gilead Sciences, please visit the company’s website at www.gilead.com.\n\nGilead Forward-Looking Statement\n\nThis press release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks, uncertainties and other factors, including the possibility of unfavorable results from ongoing and additional clinical trials involving filgotinib and the possibility that we may be unable to complete one or more of such trials in the currently anticipated timelines or at all. Further, it is possible that the parties may make a strategic decision to discontinue development of filgotinib, and as a result, filgotinib may never be successfully commercialized. All statements other than statements of historical fact are statements that could be deemed forward-looking statements. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. The reader is cautioned not to rely on these forward-looking statements. These and other risks are described in detail in Gilead’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\n\n__________________\n\ni Gilead & Galapagos Filgotinib Clinical Program Trial Details: SELECTION (NCT02914522); DIVERSITY (NCT02914561); PENGUIN 1 (NCT04115748); PENGUIN 2 (NCT04115839)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191219005768/en/\nGreg Mann, Investors\n(424) 322-1795\n\nArran Attridge, Media\n(650) 425-8975\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Announces Topline Results From Phase 2 ATLAS Study in Patients With Bridging Fibrosis (F3) and Compensated Cirrhosis (F4) Due to Nonalcoholic Steatohepatitis (NASH)",
        "subtitle": "",
        "date": "Dec 16, 2019 8:00AM EST",
        "content": "\n -- Study Primary Endpoint Was Not Met; Improvement in Multiple Measures of Fibrosis and Liver Injury Was Observed with Investigational Firsocostat and Cilofexor --\n\n-- Regimens Were Well Tolerated and Safety Measures Were Consistent with Prior Studies –\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced topline results from the 48-week, Phase 2 ATLAS study of combination and monotherapy investigational treatments for advanced fibrosis (F3-F4) due to NASH. While no regimen led to a statistically significant increase in the proportion of patients who achieved the primary efficacy endpoint of a ≥1-stage improvement in fibrosis without worsening of NASH, statistically significant improvements in multiple response measures of fibrosis and liver function were observed in patients treated with a combination of the acetyl-CoA carboxylase (ACC) inhibitor firsocostat and the selective, nonsteroidal farnesoid X receptor (FXR) agonist cilofexor, compared with placebo in patients with advanced fibrosis.\n\nThe Phase 2 ATLAS study is a randomized, double-blind, placebo-controlled study that evaluated the safety and efficacy of monotherapy and dual combination regimens of cilofexor 30 mg, firsocostat 20 mg and selonsertib 18 mg in patients with advanced fibrosis (F3-F4) due to NASH. The selonsertib monotherapy treatment group was discontinued following termination of the previously reported STELLAR trials of selonsertib.\n\nIn the 392 enrolled and dosed patients, of whom 56 percent had compensated cirrhosis, a ≥1-stage improvement in fibrosis without worsening of NASH after 48 weeks of treatment was observed in the following:\n\nNASH resolution without worsening of fibrosis was uncommon in all treatment groups, including no placebo-treated patients and 4.5 percent of those treated with firsocostat and cilofexor (p=0.35).\n\nStatistically significant improvements in multiple secondary endpoints were observed in patients treated with firsocostat and cilofexor compared with placebo, including a ≥2-point reduction in the NAFLD Activity Score (NAS) and ≥1-point reductions in steatosis, hepatocellular ballooning and lobular inflammation. Statistically significant improvements in noninvasive tests of fibrosis, liver injury and function, including ALT, AST, bilirubin and ELF score, were also observed in patients treated with this regimen compared with placebo.\n\nFirsocostat, cilofexor and selonsertib, as monotherapies and dual combination regimens, were generally well tolerated. The most common adverse events in patients treated with the combination of firsocostat and cilofexor were mild to moderate pruritus (28.2 percent vs 15.4 percent with placebo; no discontinuations), headache, diarrhea and nausea. In patients treated with firsocostat and cilofexor, changes in lipid parameters were similar to those observed previously; 3.9 percent of patients experienced asymptomatic Grade 3 triglyceride elevations (>500 and "
    },
    {
        "title": "National AIDS Memorial Receives $2.4 Million Donation From Gilead Sciences to Support the AIDS Memorial Quilt as It Moves Home to San Francisco",
        "subtitle": "",
        "date": "Nov 27, 2019 2:16PM EST",
        "content": "\nGrant Will Support the Transfer of The Quilt, its Programs and a New Public Education Initiative to Reach Communities Adversely Impacted by HIV\n    SAN FRANCISCO--(BUSINESS WIRE)--\nToday, the National AIDS Memorial and Gilead Sciences, Inc. (Nasdaq: GILD) announced a $2.4 million donation from Gilead to support The AIDS Memorial Quilt (The Quilt), its public education programs and its relocation to San Francisco under the stewardship of the National AIDS Memorial.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191127005622/en/\nThe grant will provide important resources as the National AIDS Memorial works with The NAMES Project Foundation (NPF) to move more than 50,000 individual memorial panels of The Quilt from Atlanta to San Francisco, where it will permanently reside. The grant will also support The Quilt programs, which include displays, panel making and conservation, and a new educational initiative that will be launched in 2020 to help reach communities and populations adversely impacted by HIV through the symbolism of The Quilt.\n\n“Gilead has had a tremendous impact as a scientific leader in the development of therapeutic treatments for HIV/AIDS and, through its philanthropic efforts, has made a difference for causes and in communities impacted by the disease,” said John Cunningham, Executive Director of the National AIDS Memorial. “This grant will provide important resources to the National AIDS Memorial in support of The Quilt moving to San Francisco, its programs and new educational efforts to reach communities that are disproportionately impacted by HIV.”\n\nEarlier this month, NPF announced that The Quilt and its programs will relocate to the National AIDS Memorial in early 2020, becoming an integral part of its mission to provide, in perpetuity, a place of remembrance so that the lives of people who died from AIDS-related complications are not forgotten and that their stories are known and understood by future generations.\n\nEach year, thousands of The Quilt panels are displayed throughout the United States and the world, serving as a memorial, a storyteller and an educator. It has been a powerful symbol to fight prejudice, raise awareness, link hands with the global community in the fight against AIDS, promote healing and foster hope through education and prevention.\n\nGilead’s philanthropic efforts are focused on supporting communities that are disproportionately impacted by disease, enhancing access and advancing education efforts like that of The Quilt to continue to raise awareness of the epidemic.\n\n“Gilead is honored to support The Quilt, which is a national treasure and a poignant tribute to those who lost their lives to HIV/AIDS,” said Daniel O’Day, Chairman and Chief Executive Officer of Gilead Sciences. “We are proud to be a long-standing partner to the National AIDS Memorial, supporting its work to educate and inspire a new generation of advocates in the fight to end the epidemic.”\n\nThe Quilt is an extraordinary piece of history, art, activism and hope. Thirty-two years ago during the height of the AIDS epidemic, a group of strangers gathered at a San Francisco storefront to remember the names and lives of loved ones they feared history would forget – and with that seemingly simple act of love and defiance, the first panels of The Quilt were created. Three years later and just a few miles away in Golden Gate Park, another small group of San Franciscans, also representing a community devastated by the AIDS epidemic, gathered in a dilapidated grove in Golden Gate Park to restore it and create a serene place where people seeking healing could gather to express their collective grief through a living AIDS memorial, which is now known as the National AIDS Memorial.\n\nThe Quilt was conceived by long-time San Francisco gay rights activist Cleve Jones. Since the 1978 assassinations of gay San Francisco Supervisor Harvey Milk and Mayor George Moscone, Jones had helped organize an annual candlelight march honoring these men. While planning the 1985 march, he learned that more than 1,000 San Franciscans had been lost to AIDS. He asked each of his fellow marchers to write on placards the names of friends and loved ones who had died of AIDS-related complications. At the end of the march, Jones and others stood on ladders taping these placards to the walls of the San Francisco Federal Building. The wall of names looked like a patchwork quilt.\n\nInspired by this sight, Jones and friends made plans for a larger memorial. A little over a year later, he created the first panel for the AIDS Memorial Quilt in memory of his friend Marvin Feldman. In June of 1987, Jones teamed up with Mike Smith and several others to formally organize the NAMES Project Foundation. Generous donors rapidly supplied sewing machines, equipment and other materials, and many volunteered tirelessly. At the 1987 National March for Lesbian and Gay Rights in Washington, D.C., the Quilt contained more than 1,900 commemorative fabric panels. The Quilt, sewn together by friends, lovers and family members, now contains more than 50,000 panels, weighs more than 54 tons and commemorates more than 105,000 individual lives of people who have died of AIDS-related complications.\n\nToday, The Quilt is a visual reminder of the AIDS pandemic and continues as the largest ongoing community art project in the world. There are more than 1.1 million people currently living with HIV in the United States, with more than 15,000 people having died of AIDS-related complications in 2017 alone. In 2016, more than 38,000 people received an HIV diagnosis, with half of those living in the South, and Black/African American gay and bisexual men accounting for the largest number of HIV diagnoses.\n\nAbout the National AIDS Memorial\n\nThe National AIDS Memorial relies solely on funding from longtime personal donors and corporate partners to support its mission as a dedicated space in the national landscape where millions of Americans touched directly or indirectly by AIDS can gather to heal, hope, and remember. The National AIDS Memorial, known as “the Grove”, was created more than twenty-eight years ago in San Francisco’s Golden Gate Park at the height of the HIV/AIDS epidemic as a place where those impacted by AIDS could both grieve and begin the process of healing. In 1996, legislation sponsored by U.S. Representative Nancy Pelosi was signed into law by President Clinton that elevated “the Grove” as this nation's sole federally-designated National AIDS Memorial. More than 50,000 individuals from around the world have contributed 225,000 volunteer hours to support the National AIDS Memorial and its mission. For more information visit www.aidsmemorial.org.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California.\n\nFor more than 30 years, Gilead has been a leading innovator in the field of HIV, driving advances in treatment, prevention, testing and linkage to care, and cure research. Today, it is estimated that more than 12 million people living with HIV globally receive antiretroviral therapy provided by Gilead or one of the company’s manufacturing partners.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191127005622/en/\nChris Ridley,\nGilead Sciences\n(650) 235-2220\n\nKevin Herglotz,\nNational AIDS Memorial\n(415) 874-9650\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "New Data on Filgotinib in Rheumatoid Arthritis (RA) Demonstrate Durable Efficacy and Safety Profile",
        "subtitle": "",
        "date": "Nov 9, 2019 4:30PM EST",
        "content": "\n-- Pooled Analysis from the FINCH RA Clinical Program with Investigational Filgotinib Reinforces Favorable Safety and Tolerability Profile Alone and in Combination with Methotrexate (MTX) or Conventional Disease-Modifying Antirheumatic Drug(s) (csDMARDs) --\n\n-- Data Demonstrate Efficacy and Safety Across a Wide Range of Patient Populations, Including Those Intolerant or Unresponsive to Biologic Treatment --\n\n-- Data to be Presented at 2019 ACR/ARP Annual Meeting --\n    FOSTER CITY, Calif. & MECHELEN, Belgium--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) and Galapagos NV (Euronext & NASDAQ: GLPG) today announced detailed results from the companies’ clinical research program evaluating filgotinib, an investigational, oral, selective JAK1 inhibitor, in adults with moderately-to-severely active RA. The data demonstrate durable efficacy and safety results with filgotinib across multiple RA patient populations, from MTX-naïve patients to those who have had an inadequate response to two or more biologic disease-modifying antirheumatic drugs (bDMARDs). The analyses will be presented at the 2019 American College of Rheumatology/Association of Rheumatology Professionals (ACR/ARP) Annual Meeting in Atlanta.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191109005041/en/\n“These new analyses continue to demonstrate the consistent efficacy and safety profile of filgotinib for a broad range of patients, including those who have already tried other treatments and require other effective and tolerable options,” said John Sundy, MD, PhD, Senior Vice President, Inflammation and Respiratory Diseases, Gilead Sciences. “With the presentation of these results at ACR, we are one step closer in our journey to deliver upon the promise of filgotinib for patients in need.”\n\n“People living with RA often struggle with debilitating, long-term symptoms that can negatively impact their quality of life,” said Dr. Walid Abi-Saab, Chief Medical Officer, Galapagos. “These latest analyses continue to support the clinical potential of filgotinib in RA patients whose disease activity may not be adequately controlled by current treatments.”\n\nEfficacy Sustained in Difficult-to-Treat RA Populations\n\nAbstract #517\n\nA subgroup analysis from the Phase 3 FINCH 2 trial evaluating once-daily doses of filgotinib 200 mg and 100 mg with a stable dose of csDMARDs in 449 patients who previously had an inadequate response to biologic DMARD therapy (bDMARD-IR) showed that both doses of filgotinib improved clinical outcomes versus placebo, regardless of the number and mechanism of action (MOA) of prior bDMARDs. After 12-weeks of treatment, 70.3 percent of subjects treated with 200 mg of filgotinib and 58.2 percent of subjects treated with 100 mg of filgotinib achieved an ACR20 score compared with only 25.7 percent of placebo-treated subjects. Additionally, 68 percent of bDMARD-IR patients in the filgotinib 200 mg group and 51.2 percent of bDMARD-IR patients in the 100 mg group who had been treated with more than one biologic MOA achieved ACR20 response versus placebo (27.3 percent).\n\nAbstract #504\n\nA separate analysis of the FINCH 2 trial assessed the efficacy of once-daily filgotinib 200 mg or 100 mg versus placebo for 24 weeks across prespecified subgroup characteristics such as disease duration/activity, seropositivity and concurrent medication use. Filgotinib efficacy was measured by ACR20 and Disease Activity Scores 28 (DAS). Results demonstrate that, compared with placebo, filgotinib consistently improved clinical outcomes in bDMARD-IR patients and that treatment efficacy was not impacted by any of these demographic and clinical baseline characteristics.\n\nLatest Analyses Demonstrate Consistent Safety Profile\n\nAbstract #1329\n\nThe safety and tolerability of filgotinib as a monotherapy and in combination with MTX or csDMARDs were found to be favorable in a pooled safety analysis across the randomized, multicenter Phase 3 FINCH 1, 2 and 3 studies at both the 200 mg and 100 mg doses. The pooled analysis assessed a total of 3,452 patients with moderately to severely active RA who had an inadequate response to MTX (FINCH 1), who were receiving csDMARDs and had an inadequate response to bDMARDs (FINCH 2) or who were MTX-naïve (FINCH 3).\n\nPooled safety results across groups indicate that the frequency of adjudicated positive major adverse cardiac events (MACE), herpes zoster virus, deep vein thrombosis (DVT) and pulmonary embolism (PE) was similar across groups for patients treated with filgotinib as monotherapy, in combination with MTX or in combination with csDMARDs. The incidences of adjudicated positive MACE were 0.2 percent in both the filgotinib 200 and 100 mg treatment groups, 0.3 percent in the adalimumab-treated groups, and 0.5 percent in the placebo plus MTX or csDMARD-treated group. Additionally, the incidences of DVT/PE were less than 0.1 percent in the 200 mg monotherapy, filgotinib 100 mg and 200 mg plus MTX or csDMARD treatment groups, 0 percent in the adalimumab treatment group and 0.3 percent in the placebo plus MTX or csDMARD treatment group. The same rate of patient deaths (0.2 percent) was reported in the placebo plus MTX/csDMARD treatment group and across the filgotinib 200 mg and 100 mg plus MTX/csDMARD combination groups. The treatment-emergent adverse events (TEAEs) of interest were also similar across groups, and the most common TEAEs were infections.\n\nAbstract #2875\n\nA separate analysis from the FINCH 2 trial assessed shifts from baseline after 12- and 24-weeks of treatment in hemoglobin, platelets, neutrophils and lymphocytes which all remained consistent throughout the study. At baseline, 129 (28.8 percent), 4 (0.9 percent), 10 (2.2 percent) and 26 (5.8 percent) patients had mild-moderate low levels of hemoglobin, platelets, neutrophils and lymphocytes, respectively, and 5 (1.1 percent) had severely low levels of lymphocytes.\n\nOf the 129 patients with mild-moderate low hemoglobin at baseline, 27 of 82 patients in the filgotinib treatment groups shifted towards hemoglobin normalization at week 12, with similar patterns observed for platelet, lymphocyte and neutrophil counts. These results suggest that filgotinib, which selectively inhibits JAK1, may not increase the incidence of anemia, thrombocytopenia or leukopenia.\n\nLong-Term Safety and Efficacy of Filgotinib \n\nAbstract #550\n\nData comprising 2,203 patient-years of exposure (PYE) with filgotinib from the Phase 2b, open-label extension DARWIN 3 study assessed the long-term safety and efficacy of filgotinib (200 mg or 100 mg) monotherapy and filgotinib plus MTX in 739 patients. An observed-case analysis at week 156 found that 89.7, 63 and 40 percent of patients in the filgotinib monotherapy group achieved ACR20/50/70 responses, respectively. In the filgotinib plus MTX group, 87.2 percent, 72.4 percent and 45.5 percent of patients in the filgotinib plus MTX group achieved ACR20/50/70 responses, respectively. TEAEs occurred in 83.9 percent (n=203) of the filgotinib monotherapy group and in 84.3 percent (n=419) of the filgotinib plus MTX group. Serious TEAEs occurred in 13.6 percent (n=33) of the filgotinib monotherapy group and 9.1 percent (n=45) of the filgotinib plus MTX group. Rates of herpes zoster in the filgotinib monotherapy group and filgotinib plus MTX groups were 1.6 and 1.5 events per 100 PYE, respectively. Additionally, event rates of serious infection across these treatment groups were 0.9 and 2.0 per 100 PYE. These results indicate that filgotinib efficacy was sustained through 156 weeks of treatment for patients in both monotherapy and MTX combination use. No new safety signals were observed.\n\nFilgotinib is an investigational agent and is not approved by the U.S. Food and Drug Administration, European Medicines Agency, or any other regulatory authority. Its efficacy and safety have not been established. For information about the clinical trials with filgotinib: www.clinicaltrials.gov.\n\nAbout the FINCH Programi\n\nThe FINCH Phase 3 program investigated the efficacy and safety of 100 mg and 200 mg filgotinib administered once daily in RA patient populations ranging from methotrexate-naïve (MTX) to biologic-experienced patients. FINCH 1 was a 52‑week, randomized, placebo- and adalimumab-controlled trial in combination with MTX enrolling 1,759 adult patients with moderately to severely active RA who had inadequate response to MTX. The primary endpoint was ACR20 at week 12. The trial included radiographic assessment at weeks 12, 24 and 52. FINCH 2 was a 24-week, randomized, placebo-controlled trial in 449 patients who were receiving conventional disease-modifying antirheumatic drugs (cDMARD), and had a prior inadequate response to one or more biological therapies. The primary endpoint was ACR20 at week 12. FINCH 3 was a 52‑week, randomized trial in 1,252 MTX-naïve patients to evaluate filgotinib 200 mg alone and filgotinib 100 mg or 200 mg combined with MTX versus MTX alone in MTX-naïve patients. The primary endpoint was ACR20 at week 24. Radiographic progression was also assessed at week 24 and 52 in FINCH 3.\n\nAbout the DARWIN Programii\n\nDARWIN 3 is an ongoing multi-center, open-label, long-term extension study of the double-blind, placebo-controlled DARWIN 1 and DARWIN 2 Phase 2b trials in patients with moderate to severe RA who showed an inadequate response to methotrexate (MTX). DARWIN 1 (594 patients) evaluated filgotinib plus MTX, with either once- or twice-daily administration and at three daily dose levels. DARWIN 2 (283 patients) evaluated filgotinib as once-daily monotherapy at three dose levels. Both DARWIN 1 and DARWIN 2 achieved the primary endpoints (ACR20). The most common AEs noted in the studies were herpes zoster, infections and malignancy excluding non-melanoma skin cancer.\n\nAbout the Filgotinib Collaborationiii\n\nGalapagos and Gilead entered into a global collaboration for the development and commercialization of filgotinib in inflammatory indications.\n\nThe FINCH studies in rheumatoid arthritis are among several clinical trials of filgotinib in inflammatory diseases, which also include the EQUATOR Phase 2 program in psoriatic arthritis, the TORTUGA study in ankylosing spondylitis, the DIVERSITY Phase 3 trial in Crohn’s disease (also small bowel and fistulizing Crohn’s disease Phase 2 studies), the Phase 3 SELECTION trial in ulcerative colitis and the Phase 3 PENGUIN 1 and PENGUIN 2 trials in psoriatic arthritis.\n\nMore information about clinical trials with filgotinib can be accessed at: www.clinicaltrials.gov.\n\nAbout Galapagos\n\nGalapagos (Euronext & NASDAQ: GLPG) discovers and develops small molecule medicines with novel modes of action, three of which show promising patient results and are currently in late-stage development in multiple diseases. Galapagos’ pipeline comprises Phase 3 through to discovery programs in inflammation, fibrosis, osteoarthritis and other indications. The Company’s ambition is to become a leading global biopharmaceutical company focused on the discovery, development and commercialization of innovative medicines.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California. For more information on Gilead Sciences, please visit the company’s website at www.gilead.com.\n\nGalapagos Forward-Looking Statement\n\nThis release may contain forward-looking statements with respect to Galapagos, including statements regarding Galapagos’ strategic ambitions, the mechanism of action and potential safety and efficacy of filgotinib, the anticipated timing of clinical studies with filgotinib and the progression and results of such studies. Galapagos cautions the reader that forward-looking statements are not guarantees of future performance. Forward-looking statements involve known and unknown risks, uncertainties and other factors which might cause the actual results, financial condition and liquidity, performance or achievements of Galapagos, or industry results, to be materially different from any historic or future results, financial conditions and liquidity, performance or achievements expressed or implied by such forward-looking statements. In addition, even if Galapagos’ results, performance, financial condition and liquidity, and the development of the industry in which it operates are consistent with such forward-looking statements, they may not be predictive of results or developments in future periods. Among the factors that may result in differences are the inherent uncertainties associated with competitive developments, clinical trial and product development activities and regulatory approval requirements (including that data from the ongoing and planned clinical research programs may not support registration or further development of filgotinib due to safety, efficacy or other reasons), Galapagos’ reliance on collaborations with third parties (including its collaboration partner for filgotinib, Gilead), and estimating the commercial potential of Galapagos’ product candidates. A further list and description of these risks, uncertainties and other risks can be found in Galapagos’ Securities and Exchange Commission (SEC) filings and reports, including in Galapagos’ most recent annual report on form 20-F filed with the SEC and subsequent filings and reports filed by Galapagos with the SEC. Given these uncertainties, the reader is advised not to place any undue reliance on such forward-looking statements.\n\nThese forward-looking statements speak only as of the date of publication of this document. Galapagos expressly disclaims any obligation to update any such forward-looking statements in this document to reflect any change in its expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based or that may affect the likelihood that actual results will differ from those set forth in the forward-looking statements, unless specifically required by law or regulation.\n\nGilead Forward-Looking Statement\n\nThis press release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks, uncertainties and other factors, including the possibility of unfavorable results from ongoing and additional clinical trials involving filgotinib and the possibility that we may be unable to complete one or more of such trials in the currently anticipated timelines or at all. Further, it is possible that the parties may make a strategic decision to discontinue development of filgotinib, and as a result, filgotinib may never be successfully commercialized. All statements other than statements of historical fact are statements that could be deemed forward-looking statements. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. The reader is cautioned not to rely on these forward-looking statements. These and other risks are described in detail in Gilead’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\n\ni FINCH Clinical Program Trial Details: FINCH 1 (NCT02889796); FINCH 2 (NCT02873936); FINCH 3 (NCT02886728)\n\nii DARWIN Clinical Program Trial Details: DARWIN 3 (NCT02065700); DARWIN 2 (NCT01894516); DARWIN 1 (NCT01888874)\n\niii Gilead & Galapagos Filgotinib Clinical Program Trial Details: EQUATOR (NCT03320876); TORTUGA (NCT03117270); DIVERSITY (NCT02914561); SELECTION (NCT02914522); PENGUIN 1 (NCT04115748); PENGUIN 2 (NCT04115839)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191109005041/en/\nGilead\nGreg Mann, Investors\n(424) 322-1795\n\nArran Attridge, Media\n(650) 425-8975\n\nGalapagos\nElizabeth Goodwin, Investors\n(781) 460-1784\n\nCarmen Vroonen, Media\n+32 473 824 874\nSource: Gilead Sciences, Inc."
    },
    {
        "title": "Gilead Presents Data on Investigational HIV-1 Capsid Inhibitor GS-6207 as a Potential Component of Long-Acting HIV Therapy",
        "subtitle": "",
        "date": "Nov 8, 2019 8:00AM EST",
        "content": "\n─ Phase 1 Results Support Up to Six-month Dosing Interval and Advancement Into Later-Stage Clinical Trials ─\n    FOSTER CITY, Calif.--(BUSINESS WIRE)--\nGilead Sciences, Inc. (NASDAQ:GILD) today announced data on GS-6207, an investigational, novel, selective, first-in-class inhibitor of HIV-1 capsid function, that support its further development and potential role as a component in long-acting HIV combination therapy. New data from two Phase 1 studies demonstrate that GS-6207 has potent antiviral activity and a potential dosing interval of up to every six months. In both clinical studies, GS-6207 was generally well tolerated and no serious adverse events were reported. Additional in vitro virology study results suggest GS-6207 can potentially be used in a broad range of people living with HIV regardless of their treatment history. These data were presented at the 17th European AIDS Conference (EACS) in Basel, Switzerland.\n\n“These data reinforce the potential of HIV capsid inhibition as a new long-acting therapeutic pathway to achieving durable viral suppression and support further clinical development of GS-6207,” said Diana Brainard, MD, Senior Vice President, HIV and Emerging Viruses, Gilead Sciences. “Based on these promising results, we look forward to initiating additional studies to evaluate GS-6207 in people living with HIV later this year.”\n\nGilead will be initiating enrollment of two new clinical trials of GS-6207 in combination with other antiretroviral agents in people living with HIV – a Phase 2/3 study (NCT03739866) in heavily treatment-experienced people living with multidrug resistant HIV-1, as well as a Phase 2 study (NCT04143594) in treatment-naïve people living with HIV. GS-6207 will be administered via a two-week oral lead-in, followed by a subcutaneous injection every six months.\n\n“Long-acting HIV therapy is an exciting approach that could offer more convenience for people living with the disease who prefer not to take a daily pill,” said Eric Daar, MD, Chief of Division of HIV Medicine, Lundquist Institute at Harbor-UCLA Medical Center. “The potency and safety profiles of GS-6207, as demonstrated so far in research and early stage clinical trials, show its potential as a core component of a future long-acting HIV therapy.”\n\nData on GS-6207 presented at EACS 2019 include:\n\nIn this Phase 1 study, 40 healthy participants were randomized to receive either subcutaneous GS‑6207 at doses of 30, 100, 300 or 450 mg (n=8 for each cohort), or placebo (n=8). GS-6207 was generally safe and well tolerated. The most common AEs were injection site erythema (47 percent) and pain (38 percent), all of which were mild and resolved in a few days. The PK profile was characterized by prolonged exposure, with measurable concentrations for at least 32 weeks. These data suggest that GS-6207 may have a potential to be administered up to every six months.\n\nThis is an ongoing double-blind, placebo-controlled, proof-of-concept Phase 1b study in people living with HIV who are capsid inhibitor-naïve. Participants were randomized to receive either a single dose of GS-6207 (20, 50, 150 or 450 mg) administered subcutaneously (n=6 for each cohort) or placebo (n=2 for each cohort). The primary endpoint was maximum reduction of HIV-1 RNA through 10 days of treatment. Across 20 to 450 mg cohorts, mean maximum reduction in HIV-1 RNA by Day 10 ranged from 1.4 to 2.2 log10copies/mL; these reductions were all significantly greater than those observed in the placebo groups (all p"
    },
    {
        "title": "Gilead Announces New Data from Viral Hepatitis Research Programs at The Liver Meeting® 2019",
        "subtitle": "",
        "date": "Nov 8, 2019 8:00AM EST",
        "content": "\n-- Data Demonstrate Reductions in Hepatocellular Carcinoma in Hepatitis B (HBV) Patients Treated with Vemlidy --\n\n-- Improved Markers of Bone and Renal Safety Also Seen with Vemlidy in Separate Analysis of HBV Patients with Hepatic or Renal Impairment --\n\n-- Data on Investigational TLR8 Agonist GS-9688 Support Continued Advancement of the Company’s HBV Cure Research Program --\n    BOSTON--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced new data on Vemlidy® (tenofovir alafenamide 25 mg, TAF) that continue to support an improved safety profile compared with tenofovir disoproxil fumarate (TDF) in patients with chronic hepatitis B (HBV) infection. These results, along with new data from Gilead’s HBV cure and hepatitis C (HCV) research programs, are being presented at The Liver Meeting® 2019 in Boston this week.\n\nChronic HBV infection is a leading risk factor for the development of hepatocellular carcinoma (HCC) globally. The impact of HBV treatment on HCC incidence was evaluated in a long-term analysis of two Phase 3 studies of Vemlidy (Oral 0194), in which 1,632 HBV patients were randomized to receive either Vemlidy or TDF once daily in two cohorts. Through three or five years of follow-up, dependent on cohort, HCC was observed in 21 patients (1.0 percent in the TAF group; 1.9 percent in the TDF group), with a median time to onset of 104 weeks. The HCC incidence observed in this study was significantly lower than the predicted incidence using the REACH-B model, particularly for patients without cirrhosis. Additional follow-up is needed to further characterize the impact of longer-term treatment on HCC risk reduction.\n\nIn the United States, Vemlidy is indicated for the treatment of chronic HBV infection in adults with compensated liver disease. The U.S. product label for Vemlidy contains a BOXED WARNING for the risk of severe post-treatment acute exacerbation of HBV. See below for U.S. Important Safety Information.\n\n“Chronic infection with hepatitis B virus can lead to an increased risk of developing serious and life-threatening liver damage,” said Young-Suk Lim, M.D., Ph.D., lead study author and professor, Department of Gastroenterology, Liver Center, Asan Medical Center, University of Ulsan College of Medicine, Seoul, Korea. “This analysis suggests that sustained viral suppression from treatment with Vemlidy may reduce the risk of hepatocellular carcinoma in chronic hepatitis B patients, which is the most common type of liver cancer in adults.”\n\nMarkers of Bone and Renal Safety with Vemlidy\n\nData from multiple studies presented at AASLD demonstrate continued viral suppression (HBV DNA "
    },
    {
        "title": "Data Showing Potential for Machine Learning to Advance Understanding of Nonalcoholic Steatohepatitis (NASH) Presented at the Liver Meeting® 2019",
        "subtitle": "",
        "date": "Nov 8, 2019 8:00AM EST",
        "content": "\n-- AI-Based Tools for Liver Histology Assessment Contribute to Gilead’s Broader Efforts to Improve Understanding of NASH --\n\n-- Data Support Utility of Noninvasive Tests (NITs) for Risk Stratification and Monitoring of NASH Patients --\n\n-- New Results Show Fenofibrate Mitigates Increases in Serum Triglycerides in NASH Patients Treated With Investigational Firsocostat --\n    BOSTON--(BUSINESS WIRE)--\nGilead Sciences, Inc. (Nasdaq: GILD) today announced new data from the company’s nonalcoholic steatohepatitis (NASH) research and development program, including studies evaluating machine learning approaches to the interpretation of liver histology, noninvasive tests (NITs) for the characterization and monitoring of disease severity, and novel therapies for the treatment of this disease. The data are being presented at The Liver Meeting® 2019 in Boston this week.\n\n“By combining data from across our NASH clinical development program with artificial intelligence (AI)-based tools, we have the opportunity to better characterize this complex disease and understand how potential therapies can impact disease progression,” said Mani Subramanian, MD, Senior Vice President, Liver Diseases, Gilead Sciences. “Applying PathAI’s deep learning research platform for liver histology assessment will enable a more rigorous review of treatment response and has potential for the exploration of novel biology in patients with advanced fibrosis due to NASH.”\n\nMachine Learning in NASH\n\nIn a collaboration with PathAI, a leader in AI-powered research in pathology, Gilead is evaluating machine learning approaches to liver histology assessment for use in the diagnosis and staging of NASH and monitoring of treatment response in clinical trials. A study of images from liver biopsies from patients screened for the Phase 3 STELLAR program compared the staging and characterization of liver disease as assessed by experienced pathologists and by the PathAI research platform. The pathologists scored biopsies using the NASH Clinical Research Network (CRN) and Ishak fibrosis classifications, and the PathAI research platform, a convolutional neural network, evaluated these biopsies following training on more than 68,000 annotations from 75 board-certified pathologists.\n\nThe results showed that the machine learning models and the consensus of readings from the independent pathologists demonstrated high consistency for the key histologic features of NASH. Importantly, for the staging of fibrosis, the predictions of the machine learning model were highly correlated with those of the central pathologist for both the NASH CRN (rs=0.83) and Ishak (rs=0.86) staging systems.\n\n“The evaluation of new therapies for NASH can be advanced with quantitative and reproducible assessment of liver pathology,” said Andy Beck, MD, PhD, PathAI co-founder and Chief Executive Officer. “We are thrilled to apply the PathAI research platform to support development of new treatment approaches.”\n\nIn a separate analysis, machine learning models were developed to recognize patterns associated with each fibrosis stage, using slide-level pathologist Ishak fibrosis stages. Images of liver biopsies from 674 patients with compensated cirrhosis (F4) enrolled in the Phase 3 STELLAR-4 clinical trial demonstrated that machine learning models are predictive of disease progression, illustrate the heterogeneity of fibrosis in NASH cirrhosis, and correlate with noninvasive markers of fibrosis. These data highlight the potential of machine learning models to characterize patients with cirrhosis beyond conventional histological staging.\n\nNITs for Risk Stratification and Monitoring of NASH Patients\n\nAnalyses of the Phase 3 STELLAR clinical trials indicate that NITs can play an important role in the risk stratification and monitoring of NASH patients. Results from a poster presentation demonstrated that greater fibrosis burden at baseline, as assessed by NITs (e.g., Enhanced Liver Fibrosis (ELF) test and NAFLD Fibrosis Score (NFS)), and greater increases in these markers over time, are both associated with an increased risk of disease progression. An additional analysis showed that in patients with advanced fibrosis due to NASH, treatment response defined by improvements in ELF or liver stiffness by transient elastography (TE) are associated with consistent improvements in other clinical parameters, including liver biochemistry, liver stiffness, and glycemic indices, whereas only histologic parameters improved in responders defined by liver histology. These data support the potential utility of NITs for the monitoring of NASH patients and as endpoints in clinical trials.\n\nCombination Therapy with Fenofibrate Mitigates Triglyceride Elevations in NASH Patients Treated With Investigational Firsocostat\n\nGilead is investigating the potential role of acetyl-CoA carboxylase (ACC) inhibitors in the treatment of NASH. In a late-breaker session, Gilead will present results from a study evaluating the safety and efficacy of fenofibrate in mitigating increases in serum triglycerides (TGs) in patients with hypertriglyceridemia and advanced fibrosis due to NASH who were treated with the ACC inhibitor firsocostat. Patients were randomized to receive treatment with fenofibrate 48 mg or 145 mg orally once daily for two weeks, followed by the combination of fenofibrate and firsocostat 20 mg daily for 24 weeks. Results indicate that after 24 weeks of combination treatment, TGs were not significantly different from baseline in the 48 mg group (p=0.09) and 145 mg group (p=0.99). These results indicate that in patients with advanced fibrosis due to NASH, fenofibrate mitigates firsocostat-induced increases in serum triglycerides. The combination of firsocostat and fenofibrate also led to significant improvements in hepatic fat, liver biochemistry and markers of fibrosis. Fenofibrate alone and in combination with firsocostat was well-tolerated; no grade 3 or 4 adverse events, treatment-related discontinuations or hepatotoxicity were observed.\n\nFirsocostat is an investigational compound and is not approved by the U.S. Food & Drug Administration (FDA) or any other regulatory authority. Safety and efficacy have not been established.\n\nAbout Gilead’s Clinical Programs in NASH\n\nNASH is a chronic and progressive liver disease characterized by fat accumulation and inflammation in the liver, which can lead to scarring, or fibrosis, that impairs liver function. Individuals with advanced fibrosis, defined as bridging fibrosis (F3) or cirrhosis (F4), are at a significantly higher risk of liver-related and all-cause mortality.\n\nGilead is advancing multiple novel investigational compounds for the treatment of advanced fibrosis due to NASH, evaluating single-agent and combination therapy approaches against the core pathways associated with NASH – hepatocyte lipotoxicity, inflammation and fibrosis. Investigational compounds in development include the ACC inhibitor firsocostat, the selective, non-steroidal FXR agonist cilofexor, and the ASK1 inhibitor selonsertib, which are being studied in the Phase 2 ATLAS trial in advanced fibrosis due to NASH.\n\nThese investigational compounds are not approved by the U.S. Food & Drug Administration (FDA) or any other regulatory authority. Safety and efficacy have not been established for these agents.\n\nAbout Gilead Sciences\n\nGilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes innovative medicines in areas of unmet medical need. The company strives to transform and simplify care for people with life-threatening illnesses around the world. Gilead has operations in more than 35 countries worldwide, with headquarters in Foster City, California. For more information on Gilead Sciences, please visit the company’s website at www.gilead.com.\n\nForward-Looking Statement\n\nThis press release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks, uncertainties and other factors, including the risk that Gilead and PathAI may not realize the potential benefits of this collaboration. There is also the possibility of unfavorable results from ongoing and additional Gilead clinical programs in NASH, including clinical trials involving firsocostat, and the possibility that Gilead may be unable to complete these clinical studies in the currently anticipated timelines or at all. Further, it is possible that Gilead may make a strategic decision to discontinue development of firsocostat and other investigational compounds for the treatment of NASH if, for example, Gilead believes commercialization will be difficult relative to other opportunities in its pipeline. As a result, the compounds may never be successfully commercialized. These risks, uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. The reader is cautioned not to rely on these forward-looking statements. These and other risks are described in detail in Gilead’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as filed with the U.S. Securities and Exchange Commission. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nFor more information on Gilead Sciences, please visit the company’s website at www.gilead.com, follow Gilead on Twitter (@GileadSciences) or call Gilead Public Affairs at 1-800-GILEAD-5 or 1-650-574-3000.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191108005139/en/\nGreg Mann, Investors\n(424) 322-1795\n\nArran Attridge, Media\n(650) 425-8975\nSource: Gilead Sciences, Inc."
    }
]