[
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Beyond Meat, Alphabet, Pinterest, or AT&T?",
        "subtitle": "",
        "date": "Jan 14, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 14, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, BYND, GOOG, PINS, and T.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-beyond-meat-alphabet-pinterest-or-att-300986596.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "IEIC Welcomes New Founding Members Ford Motor Company, Henrico Virginia and DE-CIX",
        "subtitle": "New Founders establish IEIC as the leader in diversifying, securing and improving the Internet's Digital Economy. Leading automotive manufacturer, public sector county and leading global Internet Exchange (IX) operator join IEIC as founding members",
        "date": "Sep 9, 2019 9:00AM EDT",
        "content": "ASHBURN, Va., Sept. 9, 2019 /PRNewswire/ -- The Internet Ecosystem Innovation Committee (IEIC), an independent global committee that promotes internet diversity and resilience through the formation of new global internet nexus points, today announced that Ford Motor Company, Henrico Virginia and DE-CIX have joined IEIC as founding members.  Ford becomes the only automotive IEIC Founding Member based on its vision to collaborate with other innovators to create the next generation of connected, electrified and autonomous vehicles. Ford is also working with cities to help design smarter, more efficient transportation systems. Ford vehicles are wirelessly connected to the Internet today, and these connections require a dependable wired Internet backbone to close the data loop and unlock new services and experiences for customers. Dr. Ken Washington, Chief Technology Officer of Ford Motor Company, will be representing Ford for this initiative. Dr. Washington leads Ford's worldwide research organization, overseeing the development and implementation of the company's technology strategy and plans, and playing a key role in the company's expansion into emerging mobility opportunities.  Washington holds a Ph.D. in nuclear engineering, is a board member of McKesson Corporation, and is a Fellow of the MIT Seminar XXI program.\"The future is about connecting people in new ways. Having robust, resilient and diversified Internet infrastructure is essential to the success of Ford's technological innovations, and we are proud to be partnering with IEIC as the Founding Automotive Member and taking a leadership role globally,\" Dr. Washington said. Henrico, Virginia has developed White Oak Technology Park, a master-planned high-tech manufacturing center that is optimally designed to meet the scale and digital speed requirements of a range of tech industries. Home to mega-data center campus of Facebook and the QTS Richmond Network Access Point (NAP), Henrico is experiencing rapid growth in the data center and connectivity sectors with the new MAREA and BRUSA subsea cables which are accessible from the NAP in Henrico. Henrico County Manager, John A. Vithoulkas will be representing the county at IEIC. As the county's chief administrative officer, Mr. Vithoulkas is responsible for all general government operations and an approved annual fiscal plan of more than $1 billion in operating and capital budgets.  \"Henrico County is honored to be the founding government representative on the Internet Ecosystem Innovation Committee,\" Henrico County Manager John A. Vithoulkas said. \"For communities to thrive in the 21st century, government must be prepared to work alongside industries, academic institutions and other visionary partners to develop and support the critical technology infrastructure that allows instantaneous, global connectivity. This infrastructure is as essential to our development and prosperity today as ports, railroads and highways have been for hundreds of years. Henrico is thriving as the home of the QTS Richmond Network Access Point, which offers the world's fastest connectivity for data. I am excited to see where the next innovations in technology will take us.\"DE-CIX provides premium interconnection services and operates a range of carrier and data center-neutral Internet Exchanges (IX, or Internet Exchange Point, IXP) in Europe, the Middle East, North America, and India. Founded in 1995, DE-CIX's IX in Frankfurt is the world's leading interconnection platform, managing more close to 7 Terabits per second peak traffic. In addition to Frankfurt, DE-CIX offers interconnection services at four more Internet Exchanges in Germany: in Hamburg, Munich, Dusseldorf, and Berlin as BCIX powered by DE-CIX. In 2012, DE-CIX took abroad its specific know-how and experience in establishing and operating IXs across the planet and now operates interconnection platforms in the following metro markets: In New York and Dallas, Dubai, Madrid, Lisbon, Marseille, Istanbul, Palermo, Mumbai, Delhi, Kolkata, and Chennai. In addition, DE-CIX partners with MSK-IX in Moscow.\"DE-CIX's DNA is about offering easy interconnection to our customers, anywhere they need it on the planet. Neutrality is at the heart of what we do every day. Becoming a founding member of the IEIC – among other global digital leaders - and supporting the effort in promoting Internet diversity and resilience, just goes in line with how we understand digitization – now and in the future,\" says Ivo Ivanov, CEO of DE-CIX International.IEIC also announced today that InterGlobix Magazine will be its official media partner. In the upcoming issue of InterGlobix Magazine there will be a special editorial coverage on IEIC highlighting the benefits of Internet diversity and resiliency from each of the industries represented by the founding members. InterGlobix Magazine is industry's one-of-its-kind premier publication focused on Data Centers, Connectivity and Internet Infrastructure. \"With the addition of Ford, Henrico County and DE-CIX as IEIC founding members, we are pleased to welcome the global leaders of their respective industries to IEIC. Each founding member brings their unique strengths and strategic value to IEIC, that will propel further IEIC's vision of driving global Internet diversity and resiliency, resulting in economic growth in various regions around the globe,\" said Clint Heiden, Founder of IEIC. \"InterGlobix is honored to extend its partnership with IEIC. As a founding member of IEIC, we look forward to collaborating with the other founding members and executing the mission of the committee. Additionally, we are proud to announce that our premier publication, InterGlobix Magazine is the official media partner of IEIC,\" said Vinay Nagpal, Secretary and Executive Director of IEIC and President of InterGlobix.About Ford Motor CompanyFord Motor Company is a global company based in Dearborn, Michigan. The company designs, manufactures, markets and services a full line of Ford cars, trucks, SUVs, electrified vehicles and Lincoln luxury vehicles, provides financial services through Ford Motor Credit Company and is pursuing leadership positions in electrification, autonomous vehicles and mobility solutions. Ford employs approximately 194,000 people worldwide. For more information regarding Ford, its products and Ford Motor Credit Company, please visit corporate.ford.comAbout Henrico County, VirginiaIn partnership with its citizens, Henrico County Government is dedicated to enhancing the quality of life for all its residents. As a nationally acclaimed local government, the County accepts the challenges of its changing social, physical and economic environments by serving in an efficient manner, with pride and concern for the present and excitement for its future. Henrico County values diversity and strive to meet the needs of our ever-changing community. For more information about Henrico County, please visit www.henrico.us About DE-CIXDE-CIX - the world's leading Internet Exchange (IX) operator - provides premium interconnection services and runs a range of carrier and data center-neutral IXs globally. Founded in 1995, DE-CIX serves more than 1700 carriers, ISPs and content networks from 100+ countries, including all leading international players in various metro markets in Europe, the Middle East, India and North America. With 6.8+ Terabits per second of peak traffic, DE-CIX Frankfurt is the world's leading Internet Exchange. For more information, please visit www.de-cix.net About InterGlobixInterGlobix LLC is a global consulting company focused on the convergence of datacenters, terrestrial and subsea fiber. InterGlobix offers strategic business consulting and marketing solutions for datacenter and the connectivity industry worldwide. InterGlobix also owns InterGlobix Magazine, industry's first and only global magazine of its kind focused on Datacenters, Connectivity, Luxury and Lifestyle. For more information about InterGlobix, please visit www.interglobix.com or www.interglobixmagazine.com or follow on Twitter @InterGlobix @InterGlobixMagAbout the Internet Ecosystem Innovation Committee (IEIC)The IEIC is an independent committee that promotes Internet diversity forming new global Internet nexus points. The mission of IEIC is to partner with communities globally to create new Internet nexus points through public and private partnerships with local municipalities, academia and businesses. The Founding Members of IEIC are industry luminaries from many of the world's most respected companies and leaders including: Vint Cerf/Google (NASDAQ: GOOG), Clint Heiden/IEIC Founder, Rafael Arranz/Telxius, Staffan Göjeryd/Telia Carrier (VSE: TEL1L), Steve Alexander/Ciena (NYSE: CIEN), Howard Boville/Bank of America (NYSE: BAC), Mark Boxer/Cigna (NYSE: CI), Frank Nazzaro/Freddie Mac (NASDAQ: FMCC), Asher Kagan/Blade, Vinay Nagpal/InterGlobix, Michael Leidinger/Hilton (NYSE: HLT), Andrew Dugan/CenturyLink (NYSE: CTL), Jon Greaves/QTS (NYSE: QTS), Barbara Boyan/Virginia Commonwealth University (VCU), Ford Motor Company (NYSE: F), Henrico Virginia, DE-CIX Management GmbH. For additional information about IEIC, please visit: www.ieicco.com View original content to download multimedia:http://www.prnewswire.com/news-releases/ieic-welcomes-new-founding-members-ford-motor-company-henrico-virginia-and-de-cix-300913968.htmlSOURCE  Internet Ecosystem Innovation Committee (IEIC)"
    },
    {
        "title": "IEIC Welcomes New Founding Academic Member Virginia Commonwealth University (VCU)",
        "subtitle": "VCU to play key role in the development of innovative curricula and experiential programs to expand the digital economy workforce essential to fulfilling IEIC's core mission",
        "date": "Aug 5, 2019 8:00AM EDT",
        "content": "ASHBURN, Va. and RICHMOND, Va., Aug. 5, 2019 /PRNewswire/ -- The Internet Ecosystem Innovation Committee (IEIC), an independent committee that promotes internet diversity and resilience through the formation of new global internet nexus points, today announced that Virginia Commonwealth University (VCU) has joined as a founding member.  Barbara D. Boyan, Ph.D., the Alice T. and William H. Goodwin Jr. Dean of the VCU College of Engineering will be representing the university alongside the IEIC's other founding members. Dean Boyan is an acclaimed researcher and entrepreneur. She is recognized internationally by peers as an expert in her fields.  An industry leader and proponent of improving access to high-value education, she is a member of the National Academy of Engineering, a fellow of the National Academy of Inventors and is the co-founder of four companies. Previously, she was associate dean of research and innovation at the Georgia Institute of Technology's College of Engineering.The IEIC's mission is to collaborate with communities globally to create new internet nexus points through partnership with local municipalities, academia and businesses.  IEIC has identified Central Virginia as a region with the essential elements needed to demonstrate effective development and deployment of an advanced peering ecosystem.Proper functioning and proliferation of the global internet as a central part of economic development and business success requires a cross-functional group of business and academic leaders to drive initiatives and assist with strategic planning. The internet requires networks to exchange traffic (peering locations). Reliance on only a few global peering locations creates risk and limits opportunity for more communities to participate in the internet's growth and economic potential. Furthermore, the shortage of a qualified workforce has become a growing issue that must be addressed to fully realize the IEIC's mission.As a founding member of the IEIC, VCU's College of Engineering will assist in creating a curriculum to help grow a richer technology workforce.  VCU will make recommendations that effectively modify and evolve existing higher education curricula and programs to meet increasing demand for highly skilled technology workers. This curriculum will more closely align the rising workforce with needs of the expanding digital economy.\"VCU, along with its business partners, is highly engaged in community outreach, making sure that young people, veterans and untapped technology regions have the awareness and tools to capture opportunities in the new digital economy,\" Boyan said. \"We are proud to be a founding IEIC member and to further the creation of new curricula to support enterprises in their efforts to embrace the digital transformation with a workforce prepared for the future.\"\"We would like to welcome VCU as a Founding Academia Member of IEIC. As a premier research university, VCU is highly involved in economic development and the business community. Together, we will further enhance the student experiences and develop curricula gearing up the next generation of technology professionals, \" said Vinay Nagpal, Secretary and Executive Director of IEIC.The IEIC is an organization assisting the digital economy globally.  In each community the IEIC will assist in incubating local chapters to sustain initiatives with a member of the core IEIC acting as a sponsor.About VCU and VCU HealthVirginia Commonwealth University is a major, urban public research university with national and international rankings in sponsored research. Located in downtown Richmond, VCU enrolls more than 31,000 students in 217 degree and certificate programs in the arts, sciences and humanities. Thirty-eight of the programs are unique in Virginia, many of them crossing the disciplines of VCU's 11 schools and three colleges. The VCU Health brand represents the VCU health sciences academic programs, the VCU Massey Cancer Center and the VCU Health System, which comprises VCU Medical Center (the only academic medical center and Level I trauma center in the region), Community Memorial Hospital, Children's Hospital of Richmond at VCU, MCV Physicians and Virginia Premier Health Plan. For more, please visit www.vcu.edu and vcuhealth.org.About the Internet Ecosystem Innovation Committee The IEIC is an independent committee that promotes Internet diversity forming new global Internet nexus points. The mission of IEIC is to partner with communities globally to create new Internet nexus points through public and private partnerships with local municipalities, academia and businesses. The Founding Members of IEIC are industry luminaries from many of the world's most respected companies and leaders including: Vint Cerf/Google (NASDAQ: GOOG), Clint Heiden/QTS (NYSE: QTS), Rafael Arranz/Telxius, Staffan Göjeryd/Telia Carrier (VSE: TEL1L), Steve Alexander/Ciena (NYSE: CIEN), Howard Boville/Bank of America (NYSE: BAC), Mark Boxer/Cigna (NYSE: CI), Frank Nazzaro/Freddie Mac (NASDAQ: FMCC), Asher Kagan/Blade, Vinay Nagpal/InterGlobix, Michael Leidinger/Hilton (NYSE: HLT), Andrew Dugan/CenturyLink (NYSE: CTL), Jon Greaves/QTS (NYSE: QTS), Barbara Boyan/Virginia Commonwealth University (VCU). For additional information visit: www.ieicco.com    View original content to download multimedia:http://www.prnewswire.com/news-releases/ieic-welcomes-new-founding-academic-member-virginia-commonwealth-university-vcu-300896099.htmlSOURCE  Internet Ecosystem Innovation Committee (IEIC)"
    },
    {
        "title": "Thinking about trading options or stock in Facebook, Alphabet, Knight-Swift Transportation, 3M, or Micron Technology?",
        "subtitle": "",
        "date": "Jul 25, 2019 9:31AM EDT",
        "content": "NEW YORK, July 25, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FB, GOOG, KNX, MMM, and MU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-facebook-alphabet-knight-swift-transportation-3m-or-micron-technology-300891008.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "BetterInvesting Magazine Releases September Stock To Study And Undervalued Stock Choices For Investors' Informational And Educational Use",
        "subtitle": "",
        "date": "Jul 2, 2019 4:15PM EDT",
        "content": "MADISON HEIGHTS, Mich., July 2, 2019 /PRNewswire/ --The Editorial Advisory and Securities Review Committee of BetterInvesting Magazine today announced Maximus Inc. (NYSE: MMS) as its September 2019 \"Stock to Study\" and Alphabet Inc. (NDQ: GOOG) as its September 2019 \"Undervalued Stock\" for investors' informational and educational use.\"The committee selected Maximus for its history of growth, continued opportunities to provide cost-effective solutions for domestic and overseas government programs and reasonable current valuation,\" said Adam Ritt, editor of BetterInvesting Magazine. \"For the Undervalued selection, the committee cited Alphabet's expansion in cloud services as one growth driver in coming months.\" Check BetterInvesting's September issue for more details about these selections. Go to the trial version of BetterInvesting's online tools to study the investment potential of Maximus and Alphabet by viewing their fundamental data and applying judgments.Committee members are Robert M. Bilkie, Jr., CFA; Daniel J. Boyle, CFA; Marisa Bradbury, CFA; Philip S. Dano, CFA; Walter J. Kirchberger, CFA; and Adam Ritt.As stated, the BetterInvesting committee's Stock to Study and Undervalued Stock choices are for the informational and educational uses of investors and are not intended as investment recommendations. BetterInvesting urges investors to educate themselves about the stock market so they can make informed decisions about stock purchases. About BetterInvestingBetterInvesting is a national nonprofit organization that has been empowering individual investors since 1951. Founded in Detroit, the association (formerly known as National Association of Investors Corporation) was borne of the conviction that anyone can become a successful long-term investor by following common-sense investing practices. BetterInvesting has helped more than 5 million people become better, more informed investors by providing webinars, in-person events, easy-to-use online tools for analyzing stocks, a monthly magazine and a community of volunteers and like-minded investors. For more information about BetterInvesting, visit its website at www.betterinvesting.org or call toll free (877) 275-6242.Follow us on Twitter and Facebook.  View original content:http://www.prnewswire.com/news-releases/betterinvesting-magazine-releases-september-stock-to-study-and-undervalued-stock-choices-for-investors-informational-and-educational-use-300879555.htmlSOURCE  BetterInvesting"
    },
    {
        "title": "Welltower Expands Leadership Team in Investments",
        "subtitle": "",
        "date": "May 6, 2019 9:07AM EDT",
        "content": "TOLEDO, Ohio, May 6, 2019 /PRNewswire/ -- Welltower Inc. (NYSE: WELL) today announced that Ayesha Menon and Edward Cheung have joined the Company as Senior Vice Presidents of Investments. \"I am very pleased to welcome Ayesha and Edward to Welltower,\" said Tom DeRosa, Welltower's Chief Executive Officer. \"The expertise and talent that these individuals bring to their respective roles will support the evolution and growth of our portfolio and will enhance our ability to expand and transform settings of health care delivery.\"  Ms. Menon joins the Company from Sidewalk Labs, an Alphabet company (NASDAQ: GOOG), where she served as Director of Real Estate Investments. In this role, she oversaw real estate finance operations and worked closely with the firm's innovation leads to facilitate technology innovations in real estate and infrastructure used in the development of smart cities and buildings. Prior to her tenure at Sidewalk Labs, Ms. Menon built a strong track record of investing success in the real estate private equity sector. She was a Principal at Wheelock Street Capital where she held various responsibilities across all aspects of the investment cycle, particularly involving single and multi-family housing, affordable housing and other real estate asset classes. In her new role, Ms. Menon will direct strategic investments and platform alignments across the portfolio. She holds a Master of Business Administration from Stanford University and graduated from Princeton University with a Bachelor of Science and Engineering in Civil Engineering. She will report to Shankh Mitra, Executive Vice President and Chief Investment Officer.Mr. Cheung joins the Company from BFIN, a Brookfield company (NYSE: BAM), where he served as a Managing Partner. At BFIN, Mr. Cheung managed Structured Finance Advisory and M&A service lines in the U.S. and Canada, and led various transactions in the public and private real estate markets. In his new role, Mr. Cheung will oversee the Company's Canadian portfolio and will direct investments in seniors housing and medical office segments across North America. He holds a Master of Business Administration from INSEAD and graduated from the University of Waterloo with a degree in Systems Design Engineering. He will also report to Shankh Mitra.\"Ayesha's proven track record in real estate, technology and smart urban development will be a crucial asset as Welltower advances its data-driven investment strategy,\" said Mr. Mitra.  \"In addition, Edward's extensive background in complex and cross-border transactions up and down the capital structure will be essential for our strategy as we continue to strengthen and diversify our best in class platform.\"About WelltowerWelltower Inc. (NYSE: WELL), an S&P 500 company headquartered in Toledo, Ohio, is driving the transformation of health care infrastructure. The Company invests with leading seniors housing operators, post-acute providers and health systems to fund the real estate infrastructure needed to scale innovative care delivery models and improve people's wellness and overall health care experience. Welltower®, a real estate investment trust (\"REIT\"), owns interests in properties concentrated in major, high-growth markets in the United States, Canada and the United Kingdom, consisting of seniors housing, post-acute communities and outpatient medical properties. More information is available at www.welltower.com.Forward-Looking StatementsThis press release may contain \"forward-looking\" statements as defined in the Private Securities Litigation Reform Act of 1995.  When the Company uses words such as \"may,\" \"will,\" \"intend,\" \"should,\" \"believe,\" \"expect,\" \"anticipate,\" \"project,\" \"estimate\" or similar expressions that do not relate solely to historical matters, it is making forward-looking statements.  Forward-looking statements are not guarantees of future performance and involve risks and uncertainties that may cause the Company's actual results to differ materially from the Company's expectations discussed in the forward-looking statements.  This may be a result of various factors, including, but not limited to, those factors discussed in the Company's annual report on Form 10-K and in the Company's reports filed from time to time with the SEC.  The Company undertakes no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise, or to update the reasons why actual results could differ from those projected in any forward-looking statements.   View original content to download multimedia:http://www.prnewswire.com/news-releases/welltower-expands-leadership-team-in-investments-300844235.htmlSOURCE  Welltower Inc."
    },
    {
        "title": "Findit, Inc. Announces The Initial Submission Process to Google Play Store of the New Findit App",
        "subtitle": "",
        "date": "Apr 18, 2019 9:55AM EDT",
        "content": "ATLANTA, GA / ACCESSWIRE / April 18, 2019 / Findit, Inc., a Nevada Corporation that trades under the stock symbol (OTC PINK:FDIT), owner of Findit.com, a Social Networking Content Management Platform that empowers members to get more out of their current social networking accounts, announces the submission process of the Findit App to the Google Play Store.Findit has started the initial submission process into Google Play Store ( GOOG ) of the new Findit App.Findit will be submitting the App to Apple ( AAPL ) for IOS users in the near future as well. The App is currently available in beta through TestFlight in Apple and in APK form for Android devices. Findit has made the App available to members in both IOS and Android via invite for TestFlight and by sending the APK file to Android users on a per request basis.Clark St. Amant of Findit stated, \"The submission process to Google Play Store began this week. We are hopeful to have the App live for Android users this month, and that we begin the submission to Apple this month as well.\"The new Findit App enables members and non-members to view posts submitted to Findit as well as share posts from Findit to Facebook, Twitter (TWTR), Instagram, SMS Text messaging, Email and WhatsApp. To post content in Findit, like posts and leave comments on posts, people are required to create an account and sign in. People can download the App, not join and still be able to view content and share content to the above social sites and via text and email.The new Findit App will replace the existing app that is currently available to download on both IOS and Android Devices in the Apple App Store and Google Play Store. Findit will make the App available globally. People throughout the world will be able to utilize the convenience of the Findit App to create posts and take each post and share it immediately to Facebook, Twitter and Instagram (Image required). Each post from the App will also display on the Findit website www.findit.com. Posts from the website can be shared to additional social networking and bookmarking sites in addition to Facebook, Twitter and Instagram. This provides a wider net for members posting to Findit to reach a larger audience globally with their posts.https://www.youtube.com/watch?v=WIfJX6ZyMCkBelow are posts from Findit members that are live and able to be shared to other social sites. Click on the images below and see how easy it is to have posts on Findit shared.Thinking of hitting that reverse diet button soon! Cutting calories does affect your strength and I'm ready to lift more! My current calories are around 1600 calories and I'm getting HUNGRY y'all Gonna cut for another week or two and then gonna hop on that reverse diet train! Here are today's sumo deadlifts. This was my last set. 8 reps at 155 lbs. Can't wait to reverse and start getting strongerShop luxury carpet flooring for sale in Marietta at Select Floors and create a sophisticated and luxurious space in your home. We have an extensive collection of custom carpet flooring which means you can find the perfect style for your home. Schedule your free in home flooring estimate today, call 770-218-3462.Beautiful Shot of The Acropolis in Athens GreeceWhen the Alo Yoga @aloyoga summer line drops today... but ur not ready for summer yetAbout Findit, Inc.Findit, Inc., owns Findit.com a Social Media Content Management Platform that provides an interactive search engine for all content posted in Findit to appear in Findit search. The site is an open platform that provides access to Google, Yahoo, Bing, and other search engines crawl content posted in Findit so it can be indexed in these search engines as well. Findit provides Members the ability to post, share and manage their content. Once they have posted in Findit, we ensure the content gets indexed in Findit Search results. Findit provides an option for anyone to submit URLs that they want indexed in Findit search result, along with posting status updates through Findit Right Now. Status Updates posted in Findit can be crawled by outside search engines which can result in additional organic indexing. All posts on Findit can be shared to other social and bookmarking sites that include but are not limited to Facebook, Twitter, LinkedIN and Pinterest by members and non-members. Findit provides Real Estate Agents the ability to create their own Findit Site where they can pull in their listing and others through their IDX account and post listings manually. Findit, Inc., is focused on the development of monetized Internet-based web products that can provide an increased brand awareness of our members. Findit, Inc., trades under the stock symbol FDIT on the OTC Pinksheets.Safe Harbor:This press release contains forward-looking information within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the 'Exchange Act'), including statements regarding potential sales, the success of the company's business, as well as statements that include the word believe or similar expressions. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of Findit, Inc. to differ materially from those implied or expressed by such forward-looking statements. This press release speaks as of the date first set forth above, and Findit, Inc. assumes no responsibility to update the information included herein for events occurring after the date hereof. Actual results could differ materially from those anticipated due to factors such as the lack of capital, timely development of products, inability to deliver products when ordered, inability of potential customers to pay for ordered products, and political and economic risks inherent in international trade.CONTACT:Clark St. Amant404-443-3224SOURCE:Findit, Inc."
    },
    {
        "title": "Findit, Inc Completes Testing in Beta For Sharing Your Status Updates From Findit Posts to Facebook, Twitter, Instagram and Other Social Outlets",
        "subtitle": "",
        "date": "Apr 15, 2019 9:50AM EDT",
        "content": "ATLANTA, GA / ACCESSWIRE / April 15, 2019 / Findit, Inc. a Nevada Corporation that trades under the stock symbol (OTC PINK:FDIT) owner of Findit.com, a Social Networking Content Management Platform that empowers members to get more out of their current social networking accounts, announces that testing the sharing function in Beta through the New Findit App is complete for sharing to Facebook, Twitter, Instagram, SMS Text messaing, email and Whatsapp.In a previous press release issued on March 25, 2019Findit, Inc announced that the New Findit App would have functionality to share posts from Findit directly to Facebook, Twitter and other social networking sites right from the New App itself. This functionality can help members on Findit and visitors using the app to seamlessly share content that they want across a variety of social networking accounts.Today, Findit announces that testing has shown positive results and that the sharing functionality in the New Findit App is working successfully. The share feature enables members of Findit as well as visitors using the App to share Findit posts from the Findit App to Twitter, Instagram, Facebook, WhatsApp, send via Email Address or in a Text Message. Findit is looking into other social outlets to add this share feature in the future so members can reach a wider more diversified audience with their posts from Findit.Clark St. Amant of Findit stated, ''Findit has been setup to give those who want more engagement and visibility exactly what they want. Sharing from Findit to Facebook, Twitter, Instagram, and these other channels is not limited to only members who created the post, but also visitors who have downloaded the app to browse content can also share posts without having to login. Findit is not closed off to outside search engines, so every piece of content you create on Findit can be crawled and indexed by other search engines that include but are not limited to Google, Yahoo and Bing. This is one of the main reasons members that have been using Findit recognize the importance of posting to Findit first and then sharing those posts to your existing audiences on other social sites to maximize who sees your content. With Findit our members are seeing tangible indexing as well as sharing that they otherwise would not receive.''The new App is scheduled to be submitted to Apple for IOS devices and Google for Android devises in April of 2019.The below is a screen shot from the Findit App from an Iphone showing the Share function.https://www.youtube.com/watch?v=WIfJX6ZyMCkAbout Findit, Inc.Findit, Inc., owns Findit.com a Social Media Content Management Platform that provides an interactive search engine for all content posted in Findit to appear in Findit search. The site is an open platform that provides access to Google, Yahoo, Bing, and other search engines crawl content posted in Findit so it can be indexed in these search engines as well. Findit provides Members the ability to post, share and manage their content. Once they have posted in Findit, we ensure the content gets indexed in Findit Search results. Findit provides an option for anyone to submit URLs that they want indexed in Findit search result, along with posting status updates through Findit Right Now. Status Updates posted in Findit can be crawled by outside search engines which can result in additional organic indexing. All posts on Findit can be shared to other social and bookmarking sites that include but are not limited to Facebook, Twitter, LinkedIN and Pinterest by members and non-members. Findit provides Real Estate Agents the ability to create their own Findit Site where they can pull in their listing and others through their IDX account and post listings manually. Findit, Inc., is focused on the development of monetized Internet-based web products that can provide an increased brand awareness of our members. Findit, Inc., trades under the stock symbol FDIT on the OTC Pinksheets.Safe Harbor:This press release contains forward-looking information within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the 'Exchange Act'), including statements regarding potential sales, the success of the company's business, as well as statements that include the word believe or similar expressions. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of Findit, Inc. to differ materially from those implied or expressed by such forward-looking statements. This press release speaks as of the date first set forth above, and Findit, Inc. assumes no responsibility to update the information included herein for events occurring after the date hereof. Actual results could differ materially from those anticipated due to factors such as the lack of capital, timely development of products, inability to deliver products when ordered, inability of potential customers to pay for ordered products, and political and economic risks inherent in international trade.CONTACT:Clark St. Amant404-443-3224SOURCE: Findit, Inc."
    },
    {
        "title": "A New Era of Public Chain: Ultrain Launches its Mainnet",
        "subtitle": "",
        "date": "Apr 15, 2019 12:30AM EDT",
        "content": "NEW YORK, NY / ACCESSWIRE / April 15, 2019 / Today Ultrain announced the official launch of its mainnet, marking another step forward for the world's leading commercial public chain. This achievement makes Ultrain the first blockchain 3.0 project to launch an operational mainnet. A milestone of such magnitude represents a major breakthrough, not only for Ultrain as a project but for the blockchain industry as a whole.Ultrain Co-founder & CEO Ray Guo stated \"Trusted computing can reshape the boundaries of trust in the business world to promote a new business model, we hope Ultrain's trust computing service will help establish a programmable business society in the near future\"Ultrain's core product is providing reliable, secure, and cost-effective trust computing service to both enterprises and individual developers. Ultrain was founded at the end of 2017 by three top business and technology leaders: Ray Guo - the former technical director of Alibaba's security business group, Emma Liao - former managing director of Golden Brick Capital, head of IOT for Qihu360, also a seasoned long term M&A banker, and William Li- the former tech head of Ant Financial blockchain team.Other core members include Yufeng Shen - Ultrain's Chief Architect, former senior technical expert of Alibaba's operating system \"AliOS\" and core architect Google Canada ChromeOS, and Husen Wang - Ultrain's Chief Cryptographer and former lead cryptographer at Ant Financial Blockchain. Last but not least, Ultrain's newest member, Samuel Xiao, completes the team as VP of the ecosystem and business development. As a former partner and CTO of Green Pine Dream Capital, Samuel is responsible for investment and post-investment management.Such dream team brings together expertise in cutting-edge innovations, sophisticated engineering experience, and extremely powerful global business access naturally attracts the attention of the world's top investors. Subsequent to the initial seed round funding of 4 million CNY in October 2017, Ultrain successfully completed angel round financing in May 2018, with Morningside Capital as their lead investor, along with APlus capital and DraperDragon. Ultrain announced soon afterward that it subsequently raised $20 million in private funding from global venture capital firms and crypto funds, placing the company at a 200 million USD valuation. Participants in this round of financing include Danhua Capital (DHVC), Sky9 Capital, FBG Capital, Ceyuan Venture, 8 Decimal Capital, NGC Capital, ANMI, and other well-known investing entities both within China and overseas.Ultrain presents itself as a commercial chain that provides trusted computing services to businesses and commercial clients, leveraging Ultrain's high performance, low cost, and data protected public chain to help enterprise customers develop blockchain solutions. Ultrain currently is the highest performing blockchain 3.0 project in the world, as well as the only public chain capable of providing commercial service to enterprise clients. Ultrain has also launched on the Microsoft cloud service market and is connected to Microsoft Azure's joint sales system.Microsoft listing has helped Ultrain to expand its enterprise customer base and is now cooperating with international Top 500 companies, in addition to established partnerships, with companies such as streetwear and e-commerce giant YOHO!, blockchain game developers Unitopia Gaming, and energy company Great Resource Energy. Ultrain is eager to further explore blockchain adoption in the fields of e-commerce, gaming, energy, advertising, healthcare, and philanthropy to name a few.Ultrain's co-founder Emma Liao commented on the progress they made today: \"Ultrain will continue focusing on true value creation and try to act as an example for the industry. We will grow in our own way and keep being a global leader.\"Ultrain's Mainnet: Next-generation Blockchain SolutionsHighlights of Mainnet FunctionMulti-chain architecture for unlimited expansionThe creation of side chains is based on the business demand in the service layer and can be dynamically adjusted accordingly. Compute and storage resources are separated across each side chain, which allows the network's transaction capacity to continuously grow. This core technology allows Ultrain to maintain low cost without compromising performance.Secure dynamic sharding technologySharding technology is normally restricted by 1/n mining rigs within the network, where n repents the number of concurrent shards allowed. With fewer rigs, network security is reduced and becomes vulnerable for attack, making 1/n a critical constraint that limits the progress of sharding technology. Ultrain's innovative dynamic randomized node scheduling allows mining rigs to be dynamically assigned between chains or shards. The mining rigs are randomly shuffled and scheduled to different sharding segments at any given moment, which greatly improves the safety of the network.Secure and efficient PoS based cross-chain solutionUltrain's solution is a cross-chain protocol between the main and side chains, with light client support, which implements an inter-chain communication mechanism based on committee voting. This is the first time a secure PoS-built light client (eg capable of defending against long-range attacks against PoS consensus) has been achieved.Ultrain miner pre-sale approach to accelerate business ecosystem developmentUltrain's economic model guarantees that system resources are not oversold, while the network resources are centralized with individual parties. A dynamic and optimized balance of all parties' interests is maintained, with miners who contribute computing power to the chain receiving expected returns, while cost and quality of resource usage for developers can be predicted and cost accordingly.Efficient and accessible smart contract languageUltrain's smart contract coding language is based on TypeScript, while its full stack development framework - Robin and U3 - are based on NodeJs, and the virtual machines are based on WebAssebmly. These languages receive the best of both worlds since they allow easy contract development and deployment without compromising security.Highlight of Ultrain's Consensus MechanismHigh TPS performance with short confirmation timeAt the heart of Ultrain's innovative Random Proof of Stake consensus algorithm is a Verifiable Random Function and a Byzantine Fault Tolerant algorithm. This technical approach had achieved 1000 TPS on a single-chain within a decentralized environment with a 10 second confirmation time. Those two indicators are crucial in the field of public chains, and Ultrain has considerably outperformed other existing public chains.Dual layer random number generation architecture created by UltrainRandom number generation is the fundamental enabler of RPoS consensus. Ultrain's implementation is based on a VRF, which Ultrain uses to create an innovative dual-layer architecture that resolves the common issues with random number generation, such as complicated setup processes, refusal to submit or propose, and collusion or manipulation between participants. It also eliminates the concern of network storms. Ultrain's consensus mechanism has a significant enhancement in security, fairness, and performance compared to other projects.Consensus optimization based on multiple cryptographic methodsVoter messages and certificates are combined to form aggregated signatures, which greatly reduces the size of voter messages and facilitates rapid message exchange. In addition, it supports a lightweight client and cross-chain requirements, reducing the size required for a client's blockchain synchronization. Aggregate signatures also support faster broadcasting of blocks while maintaining the system's TPS performance and security.UltrainOne Function HighlightsUltrain's official App - UltrainOne - provides multiple users functions, such as an official multi-chain wallet with an elegant user interface and fast transaction completion. UltrainOne is currently allowing users to create a mainnet account for free as a limited time offer. It is the go-to App to experience fast transactions, monitor real-time mining revenue from Ultrain's chain, as well as receive the latest news and updates from Ultrain.The official launch of the Ultrain's mainnet symbolizes the start of a new era for public blockchain 3.0 technology. Ultrain is the world's first decentralized, high-performance public chain to implement a randomized dynamic sharding architecture, as well as the first to provide services to commercial clients. This mainnet launch marks a major milestone for Ultrain, and represents another leap towards its ultimate goal of creating the programmable business society of the future.Media Contact:blocktopian@ultrain.ioSOURCE: Ultrain"
    },
    {
        "title": "Meet The Hot Shots Disrupting Their Industries In 2019",
        "subtitle": "",
        "date": "Apr 11, 2019 12:30PM EDT",
        "content": "DALLAS, TX / ACCESSWIRE / April 11, 2019 / 2018 saw many changes in the start-up ecosystem. While many new start-ups emerged, a few became unicorns. Pulling the curtain off these start-ups which have the most unique, most distinct concept and of course, these start-ups are changing the face of the startup world.In the world of ever changing markets you have to be able to move fast and adapt in order to stay on top. There are many factors that play out when it comes to being successful in your specific niche. A few simple ways to stay ahead of the competition is by constantly brainstorming new ideas to grow, creating new strategies to become more efficient, and keeping track of your audience.Take Amazon (AMZN), a rapid expansion of Prime plus bold bets in the physical world are allowing the retailer to offer even more, even faster and smarter.Here are some exiting stories of entrepreneurs to look out for in 2019:Shazir Mucklai, CEO of Imperium GroupMucklai is an activist investor in startups helping them achieve commercializations of their products and ideas. Mucklai started has career writing for Forbes at the age of 18. Sine then, he has written over a thousand articles and now runs his own publication relations boutique having served thousands of clients. Prior to running his PR shop, Mucklai was an analyst at Goldman Sachs.Imperium Group focuses on honing in on quality rather than quantity. Mucklai says, \"Business mentors are key—that's why when it comes to client selection, we're choosy. We want to give each of you the time and guidance you deserve. We want to help you and your brand grow.\"Mucklai has been featured on Nasdaq, Yahoo Finance, Forbes, Entreprenuer Magazine, Inc Magazine, TheStreet and Benzinga.Chans Weber, 36 CEO of Leap Clixx Chans Weber is an up-and-coming entrepreneur known for his wide-ranging business experience and marketing expertise. As founder and CEO of Leap Clixx - a marketing agency based out of St. Louis, MO, Weber has established himself as one of the foremost voices in the digital marketing world.Leap Clixx works with a diverse group of clients across virtually every industry and helps businesses achieve greater online visibility and ROI focused results. From social-media promotion, to tactical SEO implementation, to forming dynamic content strategies, Leap Clixx lives on the cutting-edge of the digital-marketing landscape. What's more, Weber's philosophy of providing real-world value to his clients ensures they receive a meaningful advantage from their investment.\"Research and results color everything we do. If it doesn't make sense for our clients or our prospective clients for that matter - we won't do it - plain and simple. We're more interested in helping our partners succeed than anything else as the only way that we win is if they win and we are able to show a profitable ROI.\"Jason Stone, CEO of Mill MentorJason is a serial entrepreneur and a very successful affiliate marketer and Instagram Influencer, having over 4 million followers.In the past 18 months alone, Jason Stone aka Millionaire Mentor, who posts affiliate marketing offers that he thinks would appeal to his target audience netted a whopping $7 million in sales. That's without ever selling his own product or service. Simply put, it's an astounding and astonishing number that reveals the allure of becoming an influencer on a social media platform, as well as the fact he probably receives a lot of free flights, hotels, tech equipment etc. as an influencer.Jason is currently the CMO of Snowball Money. Snowball, is the first Smart Crypto Investment Automation (SCIA) company founded by CEO, Parul Gujral (Engineer.ai, Mogul News) and Michael Bucci (LVSEinc., DCEX.com, Lin Group). Gujral and Bucci saw the difficulties investors were facing and the untamed potential to create an easier and simplified method. Jason invested in Snowball because he saw how seemingness the platform was and it eliminated friction.Thomas Carter, CEO of DealBox.DealBox is a San Diego-based capital advisory and fintech services firm that is heavily invested and active in the blockchain and cryptocurrency markets.Featured in: Entrepreneur, Forbes, Business Insider, CNBC, Time, Money, Nasdaq, Success, Yahoo FinanceThomas is a FinTech leader, digital securities pioneer, and entrepreneur with more than 30 years of experience in venture capital advisory and funding. He is a founder and innovator in the action sports, marketing, financial services, multimedia/internet, and blockchain industries. Hundreds of companies have benefited from Thomas's keen understanding of capital markets and early-stage venture funding strategy.Elle Rustique, PhD, TipGenieElle is an educator and social scientist turned fintech startup founder on a mission to help tipped service workers from becoming casualties of a cashless society. Her company, TipGenie.io is revolutionizing the service industry by financially empowering tipped workers and enabling businesses to make emotionally intelligent, data-driven solutions. TipGenie is the first three-way integrated mobile payments system that combines digital, cashless tipping, real-time feedback, and data analytics on a single platform. Rustique explains, \"I hate not having cash to tip. TipGenie enables workers to recover the lost opportunity for a tip. A guest can leave a tip anytime, anywhere by using their mobile phone. No one has to download an app or exchange personal details. Every tip transaction, however small, is a piece of data for the business. And a tip, however small, is still money in a person's pocket.\" Elle is a second generation immigrant from the Philippines whose own mother's story and experience as a housekeeper influenced TipGenie's mission.Aarti Manwani -- Head of Product & Growth, Artist on Go and Good Luck VenturesAarti earned a spot on the list because of her leadership role with multiple companies, leading and building products with Fortune 500 companies such as E*TRADE Financial, Box, Inc as well as young technology startups such as Artist on Go, Landit, Inc and Pager. As the Head of Product, Aarti works on many innovative and ground-breaking high tech projects and is a mentor to entrepreneurs through Blue Print Health, Angel Hack, Civic Accelerator etc.One of the startups Aarti worked on is Pager,Inc founded by former co-founder of Uber, where she built an AI-driven complex B to B to C healthcare marketplace that provides care navigation, triage service, care coordination, and post-care follow-up service. Aarti is also leading product development focused on cryptocurrency and blockchain technologies.\"If you evaluate the most innovative companies, the ones that have fundamentally changed how we do things, you will notice, the true impact is realized by disrupting existing models and scaling those ideas. Whether its Google, Airbnb or Uber, they didn't focus on building a better version of an existing product, instead they fundamentally changed how things are done. With Artist on Go, we are building something that embraces the current \" future of work, convenience, latent salon space, bookings on demand marketplace. With the help of AI, we are developing predictive and prescriptive models that will disrupt the beauty industry and transform how business is done.\"CONTACT:Shazir@imperium-Pr.comSOURCE:SV Advisory Group"
    },
    {
        "title": "iBankEX Launches Vancouver’s First Bitcoin [BTC] and Tether [USDT] Margin Trading Function with Litecoin [LTC] Listing and Supported by Huobi Cloud Technology",
        "subtitle": "",
        "date": "Apr 10, 2019 7:40PM EDT",
        "content": "VANCOUVER, BC / ACCESSWIRE / April 10, 2019 / iBank Digital Asset L.P. (\"iBank Digital\", \"iBankEX\" or the \"Company\") announced that iBankEX, a no-fee over-the-counter (OTC) trading exchange, will list Litecoin (LTC) for OTC trading on its platform. In addition, iBankEX announced the addition of margin trading for Bitcoin [BTC] and Tether [USDT]. iBankEX launched its Margin Trading function so that users can learn, educate and maximize the value of their crypto assets.The Company commented that users can utilize leverage to trade up to 5x for the pairs of BTC/USDT, BCH/USDT, and LTC/USDT as of the launch date. ETH/USDT, XRP/BTC, BCH/BTC and additional pairs will be available for trading on its Margin Trading function in the near future.iBankEX also announced that it would launch trading in Litecoin (LTC), the fifth largest cryptocurrency, on their OTC platform as of April 12, 2019.iBankEX had previously released its cryptocurrency mobile applications for both Apple and Android users on March 15, 2019, featuring cryptocurrency trading, OTC trading, in-app identity verification, and with mobile 3DS security to all customers who verify their identities. Both Apple (NASDAQ:AAPL) and Google's (NASDAQ:GOOG) Android apps soared to the Top New Free and Top 100 Free Finance apps, respectively.About iBankEXiBankEX, one of Vancouver's very first peer-to-peer (P2P) over-the-counter (OTC) crypto and bitcoin exchanges supported by Huobi Cloud Technology, was officially launched on February 6, 2019. The iBankEX platform was launched to ensure the proper underwriting of crypto trading supported by the Huobi Cloud. And from this, iBank EX launched a lending system through the very first global lending network within the open decentralized platforms. iBankEX is one of the first companies to launch an efficient and intuitive new trading platform utilized by digital currency users spread across the globe.www.ibankex.ioAbout Huobi CloudHuobi Cloud is owned by Huobi Group, the world's leading blockchain company and one of world's largest digital asset trading platforms. Established in 2013, Huobi Group's accumulative turnover exceeds US $1 trillion. It proudly provides safe, secure, and convenient cryptocurrency trading and asset management services to millions of users in 130+ countries. \"Bring more efficiency to finance and more freedom to wealth\" is the mission of Huobi Group. It always follows the management theory of putting the customer first.Risk Warning: Digital assets are a higher-risk investment method. Investors should be cautious in purchasing and pay attention to investment risks.For further information, please contact:IBankEXEmail: Email: press@ibankex.ioFacebook: https://www.facebook.com/ibankdigitalasset/Instagram: https://www.instagram.com/ibankdigital/LinkedIn: https://www.linkedin.com/company/ibankdigitalasset/Medium: https://medium.com/@iBank_DigitalReddit: https://www.reddit.com/user/iBankDigitalTelegram: https://t.me/joinchat/AAAAAEX9MnpJwwyaOFf5_wTwitter: https://twitter.com/iBank_DigitalWeibo: https://weibo.com/ibankdigitalSOURCE: iBank Digital Asset L.P."
    },
    {
        "title": "Accenture and Google Cloud Expand Strategic Collaboration, Announce New Enterprise Solutions in Customer Experience Transformation",
        "subtitle": "",
        "date": "Apr 10, 2019 11:59AM EDT",
        "content": "Companies team to create solutions using Google Cloud artificial intelligence (AI) and machine learning (ML) technology for Fortune 2000 clients in the financial services, insurance, energy, utilities, travel, retail, communications, media and technology industriesSAN FRANCISCO--(BUSINESS WIRE)-- GOOGLE CLOUD NEXT -- Expanding the scope of the Accenture Google Cloud Business Group, Accenture (NYSE:ACN) and Google Cloud, part of Alphabet Inc. (NASDAQ: GOOG, GOOGL), today announced the companies are collaborating on solutions to help enterprises modernize and improve their customers' experiences in three main areas: enabling multi-channel customer interactions, improving data management, and creating services for hyper-personalization in marketing, sales and services.The first priority area of focus is to help clients enable multi-channel customer interactions and improve access to self-service and issue resolution capabilities, while decreasing the cost to service each customer. The effort will leverage Google Cloud's data and AI capabilities, specifically the Contact Center AI (CCAI) solution, which enables end-to-end customer interaction across voice and digital channels.In addition to improving the end-user experience, Accenture will leverage Google Cloud's AI and data management capabilities to build solutions that will help clients use data to better understand their customers. By breaking down data silos across customers, channels, and products, these solutions can provide clients with a real-time, 360-degree view of customers, generating new insights, powering new strategies for growth and improving customer satisfaction.Finally, the two companies are also teaming on the fast-emerging area of hyper-personalization to help customers transform their marketing, sales and services data into contextually relevant services. By leveraging Google Cloud's AI and ML capabilities and more secure, trusted high performance cloud infrastructure, organizations can turn data into business insights that can be applied to help increase customer response rates, lifetime value and loyalty.\"Leading organizations are actively working to gain a competitive advantage by providing differentiated experiences and omni-channel interactions with their customers,\" said Paul Daugherty, chief technology & innovation officer at Accenture. \"Expanding the scope of our collaboration is a great example of how Accenture and Google Cloud are fueling the next generation of digital innovation and business growth by harnessing the power of AI that can deliver real outcomes for our clients.\"Thomas Kurian, CEO at Google Cloud, added, \"There is a tremendous opportunity for Fortune 2000 customers to modernize their customer engagement models. Combining Google Cloud's leading AI and ML capabilities with Accenture's trusted enterprise transformation capability enables us to develop real, actionable solutions that enterprise customers can start building on today.\"The companies are collaborating through the Accenture Google Cloud Business Group, which focuses on developing industry-based solutions in high-growth areas to accelerate clients' adoption of Google Cloud.Accenture has delivered more than 21,000 cloud transformations in nearly every industry. Accenture was selected as the 2018 Google Cloud Global Social Impact Partner of the Year and as a finalist for the 2018 Google Cloud Services Partner of the Year.For more information on the Accenture Google Cloud Business Group, visit https://www.accenture.com/us-en/service-accenture-google-business-group.About AccentureAccenture is a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations. Combining unmatched experience and specialized skills across more than 40 industries and all business functions — underpinned by the world's largest delivery network — Accenture works at the intersection of business and technology to help clients improve their performance and create sustainable value for their stakeholders. With 477,000 people serving clients in more than 120 countries, Accenture drives innovation to improve the way the world works and lives. Visit us at www.accenture.com.About Google CloudGoogle Cloud is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google's private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today's digital world.View source version on businesswire.com: https://www.businesswire.com/news/home/20190410005141/en/Source: Accenture"
    },
    {
        "title": "Growing Skills, Going Nationwide: Goodwill Digital Career Accelerator® Blossoms",
        "subtitle": "",
        "date": "Apr 10, 2019 11:00AM EDT",
        "content": "ROCKVILLE, Md., April 10, 2019 /PRNewswire/ -- Goodwill Industries International and Google.org, Google's philanthropic arm, are expanding a successful program that provides digital skills training to U.S. workers. The Goodwill Digital Career Accelerator, is designed to meet a range of needs — from basic keyboarding to advanced computer programming — to sharpen the digital skills of today's workers and provide the necessary training that are specific to entry- and mid-level occupations. First announced in October 2017, the program is part of the Grow with Google initiative to create economic opportunities for all Americans. In the next year, the joint program will grow from 93 locations in 34 states to 126 locations nationwide.According to the U.S. Department of Labor, there are more than seven million job openings in the United States, and advanced skills such as computer support or programming are increasingly essential for well-paying, in-demand careers for diverse populations across the country.One year into a three-year, 10 million-dollar commitment from Google.org, the Goodwill Digital Career Accelerator has already helped more than a quarter million job seekers improve their digital skills awareness and connected nearly 30,000 job seekers and career advancers with employment. The program trains workers in a variety of skills relevant in today's digital workplace, from social media to programming and network support, so that workers can keep their skills current in today's rapidly shifting labor market.\"The Goodwill Digital Career Accelerator helps job seekers and mid-career professionals attain the skills they need to find work and enhance their earnings potential,\" said Steven C. Preston, president and CEO of Goodwill Industries International. \"Thanks to the early success of this program, Goodwill and Google.org are extending its reach to workers across the country as we aim to train more than 1.25 million workers with the digital skills needed to succeed in today's job market and prepare for the changing workforce.\"The Goodwill Digital Career Accelerator trains workers in five digital skill levels:\"This effort was made possible by the strong collaboration we've formed with Goodwill Industries International, building on the good work they do every day to help extend opportunity,\" said Sundar Pichai, CEO of Google. \"We are proud of the work we've done together through the Goodwill Digital Career Accelerator, and look forward to continuing our work with them to equip more Americans with the digital skills they need to succeed.\"Part of the success of the Goodwill Digital Career Accelerator is fueled by Google.org's commitment to provide 1,000 Google volunteers as trainers and mentors. To date, 200 volunteers have already helped to build workers' digital skills. Additionally, seven Google.org Fellows are embedded full-time at Goodwill locations across the country.ABOUT GOODWILLGoodwill Industries International (GII) is a network of 160 community-based, autonomous organizations in the United States and Canada with a presence in 13 other countries. GII is a 501(c)(3) nonprofit that is recognized by GuideStar with its Platinum Seal of Approval, the organization's highest rating for charities. For the past three years, Goodwill was ranked in the top five brands that inspired consumers the most with its mission in the World Value Index, commissioned by the creative agency, enso. Goodwill has been on Forbes' list of top 20 most inspiring companies for three consecutive years, the only nonprofit featured on that list.Local Goodwill organizations are innovative and sustainable social enterprises that offer job placement and training services, and other community-based programs by selling donated clothing and household items in more than 3,300 stores collectively and online at shopgoodwill.com®.Goodwill helps people facing challenges to finding employment, including people with disabilities, veterans and military families, youth and young adults, older workers, people reintegrating into society, and others working to advance their careers. Local Goodwill organizations build revenues and expand employment opportunities by contracting with commercial, state, government and non-government organizations to provide a wide range of business services, including janitorial and grounds maintenance, flexible staffing, food service, manufacturing and contracts packaging, reverse logistics, document imaging and shredding, and laundry services.Last year, local Goodwill organizations collectively placed more than 288,000 people in employment in the United States and Canada. In addition, more than 36 million people used computers and mobile devices to access Goodwill education, training, mentoring and online learning services to strengthen their skills, and more than two million people received in-person services.Goodwill is both an icon and accessible neighbor: more than 82 percent of the U.S. population resides within 10 miles of a Goodwill location.For more information or to find a Goodwill location near you, visit goodwill.org, or call (800) GOODWILL. Follow us on Twitter: @GoodwillIntl and @GoodwillCapHill, and find us on Facebook, Instagram and YouTube: GoodwillIntl.ABOUT GOOGLEGoogle's mission is to organize the world's information and make it universally accessible and useful. Through products and platforms like Search, Maps, Gmail, Android, Google Play, Chrome and YouTube, Google plays a meaningful role in the daily lives of billions of people and has become one of the most widely-known companies in the world. Google is a subsidiary of Alphabet Inc. View original content to download multimedia:http://www.prnewswire.com/news-releases/growing-skills-going-nationwide-goodwill-digital-career-accelerator-blossoms-300828356.htmlSOURCE Goodwill Industries International"
    },
    {
        "title": "Google Awarded the 2019 PracticePro Diversity Leadership Award",
        "subtitle": "",
        "date": "Apr 10, 2019 8:40AM EDT",
        "content": "SAN FRANCISCO, April 10, 2019 /PRNewswire/ -- PracticePro has announced Google as the recipient of its 2019 Diversity Leadership Award. Despite the growth in law school enrollment by students from underrepresented communities, the percentage of firm partners and general counsel from minority groups continues to remain low. Established in 2017, the PracticePro Diversity Leadership Award highlights corporate legal departments and law firms that are actively working toward a more inclusive and diverse legal profession.The award was presented last month at PracticePro's Sixth Annual San Francisco Career Conference and Diversity Reception, which was hosted by Latham & Watkins, and attended by attorneys, corporate executives, and law students from across the country.\"At Google, we recognize that diverse representation is important for all of our teams - especially our Legal department,\" said Iris Chen, a Google VP who accepted the award on behalf of Google. \"The Legal Summer Institute is one of the many ways we're trying to open doors for a talented and diverse body of legal scholars.\"Google'sLegal Summer Institute (LSI) provides underrepresented second-year law students the unique opportunity to complete a week of intensive learning and interaction with the in-house legal team at Google Headquarters, followed by a summer working for one of Google's partner law firms. The goals of LSI are to:\"It's been a privilege to watch the growth of LSI for the past two years,\" said Niki Khoshzamir, Founder & CEO of PracticePro. \"The resources and enthusiasm Google attorneys have put into the initiative are not just inspiring but have made a large impact on students who may not have these opportunities otherwise.\"\"An experience of a lifetime, both professionally and socially,\" is how Brandon Cofield, a current law student at Texas A&M School of Law and a 2018 LSI participant describes the program. \"Not only am I more prepared to begin my legal career because of the breadth of information and practical training that I received as a Google Scholar, but I also met amazing people from various backgrounds that I will remain in contact with for years to come.\"In addition to its internal diversity and inclusion efforts, Google champions diversity initiatives in the community through the businesses with which they partner. Google was the first corporation to partner with PracticePro, supporting the PracticePro Diversity Scholar Program, which is a training, coaching, and recruiting program that fosters practice-ready diverse talent.Other 2019-20 Diversity Partners are:PracticePro is a San Francisco-based legal education company. Through training, coaching, and technology, we strive to change the way new lawyers learn to practice law and make their transition to practice easier. For more information about the Diversity Scholar Program or how to become a diversity partner, visit www.practicepro.cc.Media Contact:Niki KhoshzamirFounder and CEO, PracticePro212071@email4pr.com415-237-3703www.practicepro.cc View original content to download multimedia:http://www.prnewswire.com/news-releases/google-awarded-the-2019-practicepro-diversity-leadership-award-300829600.htmlSOURCE PracticePro"
    },
    {
        "title": "Intel and Google Cloud Announce Strategic Partnership to Accelerate Hybrid Cloud",
        "subtitle": "",
        "date": "Apr 9, 2019 12:30PM EDT",
        "content": "Intel and Google Cloud to Develop Anthos Reference Design to Simplify Deployment Across On-Premise Data Centers and the CloudSAN FRANCISCO--(BUSINESS WIRE)-- GOOGLE CLOUD NEXT — Intel (NASDAQ:INTC) and Google Cloud (NASDAQ: GOOG, GOOGL) today announced a strategic partnership aimed at helping enterprise customers seamlessly deploy applications across on-premise and cloud environments. The two companies will collaborate on Anthos, a new reference design based on the 2nd-Generation Intel® Xeon® Scalable processor and an optimized Kubernetes software stack that will deliver increased workload portability to customers who want to take advantage of hybrid cloud environments. Intel will publish the production design as an Intel Select Solution, as well as a developer platform.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190409005821/en/Navin Shenoy, Intel executive vice president and general manager of the Data Center Group, displays a wafer containing Intel Xeon processors during a keynote on Tuesday, April 2, 2019. In San Francisco on April 2, Intel Corporation introduces a portfolio of data-centric tools to help its customers extract more value from their data. (Credit: Walden Kirsch/Intel Corporation)While organizations are embracing multi-cloud solutions to fuel their businesses, many companies remain challenged to find the right hybrid cloud solutions that enable seamless workload migration across clouds. The new Anthos reference design will address this challenge by delivering a stack optimized for workload portability, enabling deployment of applications across on-premise data centers and public cloud provider services.More:Data-Centric Innovation at Intel | We're Stepping on the Gas Pedal for Hybrid Cloud (Lisa Spelman Blog)\"Google and Intel enjoy a long-standing partnership focused on delivering infrastructure innovation to customers,\" said Urs Hölzle, senior vice president of Technical Infrastructure at Google Cloud. \"Data center environments today are complex, and hardware and software infrastructure is not ‘one size fits all.' Our ability to collaborate with Intel and take advantage of their technology and product innovation to deliver Anthos solutions ensures that our customers can run their applications in the way that best suits them.\"\"Our collaboration with Google in delivering the infrastructure and software optimizations required to advance their hybrid and multi-cloud solution is a natural fit with Intel's vision for data-centric computing,\" said Navin Shenoy, executive vice president and general manager of the Data Center Group at Intel Corporation. \"We're delivering an Intel technology foundation for customers to take advantage of their data, and that requires delivery of architectures that can span across various operating environments. This collaboration will give customers a choice of optimized solutions that can be utilized both in the on-prem as well as cloud environments.\"This collaboration is an extension of a technology alliance between the two companies that already spans many infrastructure optimizations, collaboration on high-growth workloads like artificial intelligence, and integration of new technologies into the Google Cloud Platform, such as the 2nd-Generation Intel Xeon Scalable processors and Intel® Optane™ DC Persistent Memory.The new reference design will be delivered by mid-year 2019 with expected solution delivery from OEMs and solutions integrators in market later this year.About IntelIntel (NASDAQ:INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world's innovations. The company's engineering expertise is helping address the world's greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world - from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.About Google CloudGoogle Cloud (NASDAQ: GOOG, GOOGL) is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google's private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today's digital world.Intel and the Intel logo are trademarks of Intel Corporation in the United States and other countries.*Other names and brands may be claimed as the property of others.View source version on businesswire.com: https://www.businesswire.com/news/home/20190409005821/en/Source: Intel Corporation"
    },
    {
        "title": "HPE and Google Cloud Partner to Simplify Hybrid Cloud",
        "subtitle": "",
        "date": "Apr 9, 2019 12:30PM EDT",
        "content": "Partnership will enable customers to seamlessly build, run and manage services on-premises and in the cloud with AnthosSAN FRANCISCO--(BUSINESS WIRE)-- Google Cloud Next - Hewlett Packard Enterprise ( HPE ) and Google Cloud today announced a global partnership to deliver hybrid cloud solutions that accelerate innovation and expand choice and agility for customers. Today's announcement is part of an ongoing collaboration between HPE and Google Cloud to provide customers with a consistent experience across public cloud and on-premises environments.As part of the initial strategic agreement, HPE will offer two HPE Validated Designs for Google Cloud's Anthos based on HPE SimpliVity hyperconverged infrastructure and HPE Nimble Storage and HPE ProLiant servers. HPE's validation of Anthos on its solutions provides HPE's and Google Cloud's mutual customers the flexibility to choose the right mix of on-premises infrastructure and public cloud to best meet their needs.Additionally, HPE will offer validated on-premises infrastructure-as-a-service through HPE GreenLake, HPE's fully managed pay-per-use consumption offering. Customers who choose this offering can run applications as a service in a Google Kubernetes Engine (GKE) environment on-premises and benefit from the same container-based design across their hybrid infrastructure.Customers can leverage Anthos to manage their public cloud as well as on-premises resources. With HPE GreenLake, they will benefit from a consistent consumption model for their on-premises environment.\"Customers tell us they value choice, simplicity, and consistency in building their hybrid cloud strategy,\" said Phil Davis, President of Hybrid IT and Chief Sales Officer, HPE. \"By partnering with Google Cloud and leveraging a container-based approach, HPE can offer a seamless hybrid cloud experience with the unique option to do it all as-a-service. This approach, powered by Anthos and HPE GreenLake, gives our customers the freedom to modernize at their own pace with the HPE infrastructure of their choice.\"\"We're working closely with HPE to make it easy for customers to incorporate Anthos into their cloud strategies,\" said Kevin Ichhpurani, Corporate Vice President, Global Ecosystem and Business Development at Google Cloud. \"We're delighted that HPE shares our ‘build once, run anywhere' approach and look forward to expanding our partnership for hybrid cloud solutions on behalf of customers.\"Accelerate Container Deployment with HPE and Google CloudToday, organizations are using container-based architectures to modernize applications and make developers more agile, applications more portable, and deployments more streamlined. Gartner estimates that by 2022, more than 75% of global organizations will be running containerized applications in production.1Anthos' use of virtual machines to run containers on-premises allows customers to securely and efficiently run production applications on software-defined infrastructure that is easily managed, monitored, scaled, and optimized. The new solutions from HPE and Google Cloud will make it easier for customers to leverage containers and drive a consistent cloud experience, so applications are built once to run anywhere, across clouds and on-premises.Together, these solutions are ideal for a range of use cases, including implementing DevOps through a CI/CD pipeline, developing applications in Google Cloud and running them in production on-premises, and deploying low-cost distributed edge containerized applications.How it WorksToday's partnership announcement consists of the following components:Please read more about this partnership on the HPE blog and Google blog.About HPEHPE is a global technology leader focused on developing intelligent solutions that allow customers to capture, analyze, and act upon data seamlessly from edge to cloud. Hartford enables customers to accelerate business outcomes by driving new business models, creating new customer and employee experiences, and increasing operational efficiency today and into the future.About Google CloudGoogle Cloud is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google's private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today's digital world.1 Gartner, Best Practices for Running Containers and Kubernetes in Production, February 2019.2Forrester Consulting, The Total Economic Impact of HPE GreenLake Flex Capacity, May 2018.View source version on businesswire.com: https://www.businesswire.com/news/home/20190409005487/en/Source: Hewlett Packard Enterprise"
    },
    {
        "title": "Genesys Expands Support for Google Cloud Contact Center AI Across All Three Customer Experience Platforms",
        "subtitle": "",
        "date": "Apr 9, 2019 8:00AM EDT",
        "content": "SAN FRANCISCO, April 9, 2019 /PRNewswire/ -- Genesys® (www.genesys.com), a global leader in omnichannel customer experience and contact center solutions, is extending its integration with Google Cloud Contact Center AI across all three of its platforms - Genesys PureEngage™, PureConnect™ and PureCloud® - this quarter. Differentiated by native telephony, omnichannel orchestration and agent desktop offerings, Genesys provides businesses the rare advantage to implement bots and automation using Google Cloud Contact Center AI without introducing the complexity of third-party integrations. The company is already working with existing customers running on each of its platforms to integrate Google Cloud Contact Center AI, including a leading global ridesharing company, one of the world's top five largest automobile manufacturers and a Fortune 500 U.S. department store.As showcased last year at Google Cloud Next '18, Genesys was one of the first partners to integrate with Google Cloud Contact Center AI. Genesys is now helping multiple enterprise-level organizations leverage this technology through its early adopter program. In fact, Genesys is one of the only vendors to support an integrated end-to-end Google Cloud Contact Center AI solution for small, medium and large enterprises across both cloud and on-premises deployments.\"The launch of Google Cloud Contact Center AI was a game-changer for the industry,\" said Paul Lasserre, vice president of product management for artificial intelligence (AI), Genesys. \"Businesses leveraging Genesys solutions have already identified hundreds of use cases for this powerful technology to provide holistic value across marketing, sales and services contexts.\"The Genesys integration with Google Cloud Contact Center AI enables AI-powered virtual assistants to intuitively handle routine calls and chats or escalate an interaction to an employee when needed. Lasserre added, \"Now any business using our customer experience platform can easily put their AI strategy in motion leveraging Google Cloud and Genesys. Our AI capabilities, including Predictive Routing, coupled with Google Cloud Contact Center AI enables businesses to better support employees and care for customers.\"\"Contact Center AI empowers enterprises to use AI to complement and enhance their contact centers,\" said Rajen Sheth, the director of Product Management for Google. \"Google Cloud's goal is to make it as easy as possible for our customers to use AI for contact centers through our relationships with key partners like Genesys.\"See Google Cloud Contact Center AI and Genesys in action during Google Cloud Next '19 in San Francisco from April 9 to 11. Visit Genesys booth S1723 to learn how to leverage natural language processing to rapidly help customers and employees in real-time.About GenesysGenesys® powers more than 25 billion of the world's best customer experiences each year. Our success comes from connecting employee and customer conversations on any channel. Every day, 11,000 companies in more than 100 countries trust our #1 customer experience platform to drive great business outcomes and create lasting relationships. Combining the best of technology and human ingenuity, we build solutions that mirror natural communication and work the way you think. Our industry-leading solutions foster true omnichannel engagement because they perform equally well across channels, on-premises and in the cloud. Experience communication as it should be: fluid, instinctive and profoundly empowering. Visit genesys.com on Twitter, Facebook, YouTube, LinkedIn and the Genesys blog.©2019 Genesys Telecommunications Laboratories, Inc. All rights reserved. Genesys, the Genesys logo, and Genesys PureCloud are trademarks and/or registered trademarks of Genesys. All other company names and logos may be registered trademarks or trademarks of their respective companies.Media inquiries:Rachel FaulknerPublic Relations DirectorGenesysrachel.faulkner@genesys.com+1 317-715-8109Adriana SaldañaSterling Communicationsgenesys@sterlingpr.com+1 408-395-5500 View original content to download multimedia:http://www.prnewswire.com/news-releases/genesys-expands-support-for-google-cloud-contact-center-ai-across-all-three-customer-experience-platforms-300827726.htmlSOURCE Genesys"
    },
    {
        "title": "Findit, Inc. Announces Findit App In Beta Now Available To iPhone Apple Users Via Invite Only Link",
        "subtitle": "",
        "date": "Apr 9, 2019 8:00AM EDT",
        "content": "ATLANTA, GA / ACCESSWIRE / April 9, 2019 / Findit, Inc. (OTC PINK:FDIT), owner and developer of Findit.com, announces the Findit in Beta is being released to the public via a special invite-only link that is being limited to the first 250 people for IOS Apple devices. The Findit App in Beta, once launched publicly will replace the existing Findit Right Now App that is currently available in the Apple App Store and Google Play Store.The Findit App in Beta is now available via IOS Developers link and those who receive the special invite only link which is being limited to the first 250 people. Only 250 people will be eligible to download the new Findit App in Beta at this time. Those who receive the invite only link can share the link with others, but once the number has been reached for those being granted access to the App through Apple until we open it to more users they will have to wait.Limited to 250 people currently, Download Invite Link here https://testflight.apple.com/join/6gfuxhFYThe Findit App, which is currently being tested and should be available in April 2019, includes the highly anticipated feature where members of Findit or visitors who are using the App to view content worldwide will be able to share any given posts that are visible to them and do not contain specific privacy settings directly from the Findit App to Facebook, Twitter, and Instagram. This feature will not be available to everyone downloading the App in Beta and will be reserved for those who request it. This is a feature that, in the Beta Phase, must be activated on an individual account basis. Users who have been able to successfully download the App in Beta who want access to the share feature can contact us at Findit with their Facebook Account Name and they will be placed on a list to receive access to the Share Function in Beta.Findit's website provides every member and visitor the option to improve their online presence with each and every status update done in Findit by sharing content created on Findit with your friends on Facebook, followers on Twitter and Instagram.https://www.youtube.com/watch?v=WIfJX6ZyMCkClark St. Amant of Findit stated, ''The Findit App in Beta is really coming together and should be live this month. We are excited to roll out the new Findit App which will make it even easier for people to post on the go in real time and include the content that they want seen, shared and indexed. The sharing feature is going to really be a game changer for people that want to seamlessly share content across Findit, Facebook, Twitter, and Instagram without having to spend the time creating multiple posts or rely on Hootsuite from a desktop.''Anyone visiting Findit, even non-members, can see and share status updates to their own social networking accounts. Posts can be done through the Findit website or on your mobile devices with the Findit App.All members on Findit have the ability to post status updates that can include a complete text description, pictures, video, audio file, and a link. A Right Now post is similar to a status update on Facebook or a Tweet on Twitter with the ability to include additional content verticals and not be limited by the number of characters in a post. Members have the option to post the Right Now status update instantly, back-date it to fill in their feed, or post-date it to become live in the future.Peter Tosto of Findit stated, ''This is a very exciting time for Findit. With the upcoming launch of the newly revised App in Apple and Google, we are incredibly anxious to share what we developed with all the people on social sites looking to reach more people and have the option of having all or some of their posts indexed in search engines. Findit makes that process not only easier but more efficient. The really cool part for me is being able to include a video and pictures in one post along with my message, and the fact that I will be able to share to my social accounts and more importantly so can you.''Below is a link from Peter Tosto's Right Now feed. Many of the most recent posts include both pictures and video. These posts have been done from the Findit App in beta a Samsung Galaxy S8 Active android device. These posts are live. You do not need to Join Findit or sign into Findit to see these posts. You can also share any or all of these posts to different social networking sites.https://www.findit.com/petertosto/RightNowAbout Findit, Inc.Findit, Inc., owns Findit.com a Social Media Content Management Platform that provides an interactive search engine for all content posted in Findit to appear in Findit search. The site is an open platform that provides access to Google, Yahoo, Bing, and other search engines crawl content posted in Findit so it can be indexed in these search engines as well. Findit provides Members the ability to post, share and manage their content. Once they have posted in Findit, we ensure the content gets indexed in Findit Search results. Findit provides an option for anyone to submit URLs that they want indexed in Findit search result, along with posting status updates through Findit Right Now. Status Updates posted in Findit can be crawled by outside search engines which can result in additional organic indexing. All posts on Findit can be shared to other social and bookmarking sites that include but are not limited to Facebook, Twitter, LinkedIN and Pinterest by members and non-members. Findit provides Real Estate Agents the ability to create their own Findit Site where they can pull in their listing and others through their IDX account and post listings manually. Findit, Inc., is focused on the development of monetized Internet-based web products that can provide an increased brand awareness of our members. Findit, Inc., trades under the stock symbol FDIT on the OTC Pinksheets.Safe Harbor:This press release contains forward-looking information within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the 'Exchange Act'), including statements regarding potential sales, the success of the company's business, as well as statements that include the word believe or similar expressions. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of Findit, Inc. to differ materially from those implied or expressed by such forward-looking statements. This press release speaks as of the date first set forth above, and Findit, Inc. assumes no responsibility to update the information included herein for events occurring after the date hereof. Actual results could differ materially from those anticipated due to factors such as the lack of capital, timely development of products, inability to deliver products when ordered, inability of potential customers to pay for ordered products, and political and economic risks inherent in international trade.CONTACT:Clark St. Amant404-443-3224SOURCE: Findit, Inc."
    },
    {
        "title": "Melbourne-based immersive tech studio create AR social experience to complement Netflix's new series, Our Planet, narrated by David Attenborough",
        "subtitle": "",
        "date": "Apr 4, 2019 11:00PM EDT",
        "content": "PHORIA create never before seen AR activation enabling users to fully immerse themselves in the conservation conversation and take affirmative action to rewild our planet.MELBOURNE, Australia, April 4, 2019 /PRNewswire/ -- Today Melbourne-based immersive technology studio, PHORIA, announced the launch of REWILD Our Planet, which uses persistent and social Augmented Reality (AR). In partnership with Netflix, WWF, ArtScience Museum at Marina Bay Sands, Arup and Google, this innovative installation blends location-based AR technology and IMAX-style content into an immersive and interactive experience. The exhibition complements Our Planet, an eight-part documentary series narrated by Sir David Attenborough. Our Planet showcases the Earth's most fragile ecosystems through cutting edge multimedia storytelling and is available to stream worldwide on Netflix from April 5. 2019.The Our Planet documentary series captures the impact of human life across Earth's diverse and interconnected biomes, including forest, grassland, ocean and frozen regional landscapes. REWILD Our Planet takes on a macro perspective of the same biomes to help users understand their role in restoring these ecosystems. The experience brings to life an unflinching account of how humanity has damaged the natural world and encourages humans to take back control and restore balance by rewilding these environments.REWILD Our Planetcombines 2D storytelling with AR gameplay, supported by sensory sights and sounds. The experience prompts users to physically collaborate with one another to restore damaged biomes, unlocking unique weather patterns and wild animal encounters. By rewilding realistic 3D landscapes together, users are able to realise their collective power to take action. Finally, users will leave their mark on the exhibition by placing ongoing AR pledges. These are a commitment to the environment and connect to WWF's Voice for the Planet campaign.This one-of-a-kind experience is achieved through PHORIA's software platform CAPTUR3D, whose unique digital twin system creates a virtual clone of each exhibition site. The digital twin system aligns digital information within the physical space, and as a result, it generates a new form of contextual storytelling. REWILD Our Planet is the first shared and ongoing AR experience to operate across three cities at the same time. This was achieved by leveraging Google's ARCore software - an Android SDK that brings AR to mobile devices and by partnering with Arup for the structural design of the physical elements of the exhibition that could be scaled internationally. To intensify the visitor experience, Arup's acoustics team also created an immersive, emotive soundscape: it adapted the series' master audio score (comprising original music by Steven Price - best known for his Academy Award-winning score for 'Gravity') and added sound effects from nature to enhance key moments in the video. Thanks to these partners, developers like PHORIA can bring these experiences to an even larger user base, helping launch REWILD Our Planet globally.Founded in 2014, PHORIA has grown to become a world leader in Extended Reality (XR), creating digital solutions for real human problems. WWF engaged PHORIA to work with Netflix, ArtScience Museum and Google to drive important conversations around climate change that promote positive action.\"REWILD Our Planet showcases how AR has the power to build bridges between people and the places they love,\" said Trent Clews-de Castella, CEO of PHORIA. \"This evocative experience emphasises the connection between human beings and our environment. It generates a sense of presence and interactivity for every individual user. Building this exhibition with Netflix and Google and combining it with compassion-driven narrative from WWF demonstrates how emerging XR technologies will transform the social impact sector for good.\"Launching at three renowned venues across the globe, ArtScience Museum at Marina Bay Sands in Singapore (6 April, 2019 - June 2, 2019) Dolby Studio in New York City (6 April, 2019 - 22 April, 2019) and We The Curious in Bristol (UK) (12 April, 2019 - 2 June, 2019), REWILD Our Planet aims to augment the emotional connection users feel to each other and the planet.\"Together, these world first features will generate a shared understanding of our responsibility to protect nature through time. The global activation has been designed to remind users that we are all on the same team and that the effort to rewild the world needs everyone involved,\" continued Mr. Clews-de Castella.For more information about REWILD Our Planet, visit: https://rewild.wwf.sg/About PHORIAPHORIA is a world leading immersive tech studio that specialises in cutting-edge Virtual, Augmented and Mixed Reality (VR/AR/MR/XR) technology. With a globally recognised team of developers, creatives and partners, PHORIA are on a mission to transform human experiences and augment intelligent environments. They create powerful user interactions and social experiences, all with the goal to generate a positive impact on the world.About the series:In the groundbreaking Netflix original documentary series Our Planet, viewers will witness stunning, never-before-seen footage of wildlife and their habitats - while also discovering why the natural world matters to us all and what steps must be taken to preserve it. All eight hour-long episodes of Our Planet will become available to Netflix members worldwide on April 5, 2019. The series is accompanied by Behind-the-Scenes content which will launch simultaneously on Netflix. Produced by Silverback Films, Ltd. and in partnership with WWF, the landmark series is narrated by renowned broadcaster and natural historian Sir David Attenborough. For additional information please visitmedia.netflix.com and follow us on social@OurPlanet #ShareOurPlanet.About ArupArup is the creative force at the heart of many of the world's most prominent projects in the built environment and across industry. Working in over 40 countries Arup has more than 14,000 planners, designers, engineers and consultants delivering innovative projects across the world with creativity and passion. www.arup.com View original content:http://www.prnewswire.com/news-releases/melbourne-based-immersive-tech-studio-create-ar-social-experience-to-complement-netflixs-new-series-our-planet-narrated-by-david-attenborough-300824443.htmlSOURCE PHORIA"
    },
    {
        "title": "Einstein Doubles Customer Base after Launching Mobile Apps",
        "subtitle": "",
        "date": "Apr 2, 2019 5:00AM EDT",
        "content": "Adds over 60,000 New Customers After Launching Innovative Mobile Apps Despite Crypto Bear MarketVANCOUVER, British Columbia--(BUSINESS WIRE)-- Einstein Exchange, one of the world's fastest growing cryptocurrency exchange announced extraordinary customer growth as a result of the launch of the Company's free mobile wallet & trading applications. Within 14 days of launch, the Einstein added over 60,000 new customers, representing over 100% growth in total customer count, and over 20,000 verifying their identity within the app's proprietary KYC engine.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190402005150/en/Einstein Exchange's new cryptocurrency mobile wallet, designed for simplicity and ease of use, available in 12 different languages. (Photo: Business Wire)Einstein released its cryptocurrency mobile applications on Apple's iOS Store & Google's Play Store in the first week of March 2019 featuring free cryptocurrency trading, in-app identity verification, unlimited Visa (NYSE:V) & Mastercard (NYSE:MA) funding with mobile 3DS security and unlimited $10 referral bonus to all customers who verify their identities.Both Apple (NASDAQ:APPL) & Google's (NASDAQ:GOOG) Android apps soared to the Top New Free and Top 100 Free Finance apps, respectively, attracting over 10,000 new downloads per day and driving over 19,000% increase in the exchange's trade volume.\"Einstein's mobile applications had a stunning & extraordinary debut. It took us 18 months to acquire our first 65,000 customers, whereas our mobile apps clearly showed tremendous value on a global scale for us to be fortunate to acquire over 60,000 new customers within 2 weeks,\" said Michael Gokturk, Einstein's CEO.\"We still have much to do to attract new customers and grow the overall market size, but this type of adoption gives us the optimism and market validation we need to continue innovating and pushing the industry forward.\"Einstein Convert, the Company's featured mobile crypto wallets, enable customers to Convert, Earn & Spend over 19 different types of cryptocurrency from the safety and security of their mobile phones. Customers can convert into any cryptocurrency commission-free, earn $10 for every friend they refer to the app, and spend all or part of their wallet balance by using their free Einstein electronic credit-card issued right to their mobile phone.\"The apps are simple and beautifully designed,\" added Gokturk, \"but the feature that exceeded our wildest expectations was our referral program. We didn't promote or market the app with traditional ads, our customers loved the app so much they became our biggest acquisition channel and we couldn't be happier.\"About Einstein ExchangeEinstein Exchange is a Canada-based crypto-currency exchange launched in 2017 which now enables over 125,000 customers to convert, earn and spend crypto-currencies such as Bitcoin, Ethereum, Litecoin and more, all for free. Einstein is registered with FINTRAC in Canada as a Virtual Currency Exchange. Einstein works with all major banks and is licensed to accept Visa, MasterCard, Interac, Flexepin, and SKRILL for customers seeking to invest in crypto-currency.View source version on businesswire.com: https://www.businesswire.com/news/home/20190402005150/en/Source: Einstein Exchange"
    }
]