[
    {
        "title": "Thinking about buying stock in Cronos Group, FuelCell Energy, Alphabet, QUALCOMM, or Sorrento Therapeutics?",
        "subtitle": "",
        "date": "Jan 10, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 10, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CRON, FCEL, GOOGL, QCOM, and SRNE.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-cronos-group-fuelcell-energy-alphabet-qualcomm-or-sorrento-therapeutics-300984892.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Alibaba, Beyond Meat, Walt Disney, Alphabet Inc, or JPMorgan Chase?",
        "subtitle": "",
        "date": "Jan 3, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 3, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, BYND, DIS, GOOGL, and JPM.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alibaba-beyond-meat-walt-disney-alphabet-inc-or-jpmorgan-chase-300980839.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "Thinking about trading options or stock in Alphabet, JPMorgan Chase, Netflix, NVIDIA, or Tesla?",
        "subtitle": "",
        "date": "Sep 20, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 20, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for GOOGL, JPM, NFLX, NVDA, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alphabet-jpmorgan-chase-netflix-nvidia-or-tesla-300922338.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "S&P 500 buybacks decline significantly in Q2 2019; expenditures still remain higher than the pre-2018 levels",
        "subtitle": "- Q2 2019 share repurchases were $164.5 billion - 20.1% lower than Q1 2019, 13.7% lower than Q2 2018, and 26.2% lower than the record Q4 2018.",
        "date": "Sep 16, 2019 11:30AM EDT",
        "content": "NEW YORK, Sept. 16, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q2 2019 S&P 500® stock buybacks, or share repurchases, were $164.5 billion. This was the second consecutive quarterly decline after four consecutive quarters of record buybacks. Q2 2019 buybacks were 20.1% lower than Q1 2019's $205.6 billion, 13.7% lower year-over-year from Q2 2018's $190.6 billion, and 26.2% lower than the Q4 2018 record expenditure of $223.0 billion.  Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"In what may have been a reaction to their tax-inspired record-setting buying spree of 2018, companies significantly pulled back on their Q2 2019 buybacks, said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the decline is significant compared to 2018, it remains higher than the pre-2018 levels. Estimates vary, but a base amount of $170 billion a quarter has been emerging as the consensus level of buybacks going forward.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 51.4% of the buybacks, up a tick from the Q1 2019 51.2%, as the 10-year average is 44.1%.  Q2 2019 GICS® Sector Analysis:Information Technology buybacks continued to dominate, even as they decreased 20.3% to $54.2 billion compared to $68.0 billion for Q1 2019. Twelve-month expenditures were up 33.8% to $265.8 billion from $198.7 billion spent for the same period in 2018. The sector represents 33.0% of the index's buybacks for the quarter, flat from last quarter.Materials buyback declined 49.3% to $2.4 billion compared to $4.8 billion for Q1 2018. Utilities declined 40.4%, to 0.9 billion from 1.5 billion in Q1 2019.Health Care buybacks continued to be volatile, as they decreased 44.5% to $17.1 billion, down from $30.7 billion for Q1 2019, as the 12-months ending in Q2 2019, buybacks were $93.6 billion, up 6.1% from the $88.2 billion spent in the corresponding 2018 period.  Issues:The five issues with the highest total buybacks for Q2 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.         ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-decline-significantly-in-q2-2019-expenditures-still-remain-higher-than-the-pre-2018-levels-300918745.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "Thinking about trading options or stock in Bank of America, Alphabet, NVIDIA, Roku, or Tesla?",
        "subtitle": "",
        "date": "Aug 14, 2019 9:31AM EDT",
        "content": "NEW YORK, Aug. 14, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BAC, GOOGL, NVDA, ROKU, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-bank-of-america-alphabet-nvidia-roku-or-tesla-300901601.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Boeing, Walt Disney, Alphabet, Starbucks, or Twitter?",
        "subtitle": "",
        "date": "Jul 26, 2019 9:31AM EDT",
        "content": "NEW YORK, July 26, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, DIS, GOOGL, SBUX, and TWTR.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-boeing-walt-disney-alphabet-starbucks-or-twitter-300891670.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Amazon and Google Announce Official YouTube Apps to Launch on Fire TV; Prime Video App Coming to Chromecast and Android TV",
        "subtitle": "",
        "date": "Apr 18, 2019 9:00AM EDT",
        "content": "The official YouTube apps will be available on Fire TV in the coming months, giving users seamless access to a world of entertainment - including music videos, their favorite creators, movies, shows, news, live sports and morePrime members streaming to Chromecast and on Android TV devices will have unlimited access, in the coming months, to thousands of titles and Amazon Originals including Golden Globe-winning The Marvelous Mrs. Maisel, Tom Clancy's Jack Ryan, Homecoming, Hanna and The WidowSEATTLE & MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)-- Today, Amazon (NASDAQ:AMZN) and Google (NASDAQ:GOOGL) announced that in the coming months, the two companies will launch the official YouTube app on Amazon Fire TV devices and Fire TV Edition smart TVs, as well as the Prime Video app for streaming to Chromecast and Chromecast built-in devices. In addition, Prime Video will be broadly available across Android TV device partners, and the YouTube TV and YouTube Kids apps will also come to Fire TV later this year.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190418005212/en/\"We are excited to work with Amazon to launch the official YouTube apps on Fire TV devices worldwide,\" said Heather Rivera, Global Head of Product Partnerships at YouTube. \"Bringing our flagship YouTube experience to Amazon Fire TV gives our users even more ways to watch the videos and creators they love.\"\"We're excited to bring the Prime Video app to Chromecast and Android TV devices, and to give our customers convenient access to the shows and movies they love,\" said Andrew Bennett, Head of Worldwide Business Development for Prime Video. \"Whether watching the latest season of The Marvelous Mrs. Maisel, catching teams go head-to-head on Thursday Night Football or renting a new-release movie, customers will have even more ways to stream what they want, whenever they want, no matter where they are.\"Official YouTube App on Fire TVThe flagship YouTube app will be the easiest way for users to watch all of their favorite YouTube content on Fire TV. Users will be able to sign in to their existing YouTube account, access their full library of content, and play videos in 4K HDR at 60 fps on supported devices. In addition, standalone YouTube TV and YouTube Kids apps will also launch later this year on Fire TV devices and Fire TV Edition smart TVs where available.Prime Video App on Chromecast and Android TVChromecast and Chromecast built-in users, along with Android TV users, will have easy access to the Prime Video catalog including the latest seasons of Amazon Originals like The Marvelous Mrs. Maisel, Hanna, Homecoming,Bosch, Catastrophe and The Grand Tour,along with Amazon Original movies like Donald Glover's Guava Island, and Academy Award-nominated films like The Big Sick and Cold War. Prime Video offers users exclusive features like X-Ray as well as access to 4K titles included with Prime at no additional cost. With Prime Video users can also rent or purchase titles or choose from more than 150 Prime Video Channels including Showtime, HBO, CBS All-Access, Cinemax and STARZ.Android TV is a trademark of Google LLC.About AmazonAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit www.amazon.com/about and follow @AmazonNews.About GoogleGoogle's mission is to organize the world's information and make it universally accessible and useful. Through products and platforms like Search, Maps, Gmail, Android, Google Play, Chrome and YouTube, Google plays a meaningful role in the daily lives of billions of people and has become one of the most widely-known companies in the world. Google is a subsidiary of Alphabet Inc.View source version on businesswire.com: https://www.businesswire.com/news/home/20190418005212/en/Source: Amazon.com, Inc."
    },
    {
        "title": "Accenture and Google Cloud Expand Strategic Collaboration, Announce New Enterprise Solutions in Customer Experience Transformation",
        "subtitle": "",
        "date": "Apr 10, 2019 11:59AM EDT",
        "content": "Companies team to create solutions using Google Cloud artificial intelligence (AI) and machine learning (ML) technology for Fortune 2000 clients in the financial services, insurance, energy, utilities, travel, retail, communications, media and technology industriesSAN FRANCISCO--(BUSINESS WIRE)-- GOOGLE CLOUD NEXT -- Expanding the scope of the Accenture Google Cloud Business Group, Accenture (NYSE:ACN) and Google Cloud, part of Alphabet Inc. (NASDAQ: GOOG, GOOGL), today announced the companies are collaborating on solutions to help enterprises modernize and improve their customers' experiences in three main areas: enabling multi-channel customer interactions, improving data management, and creating services for hyper-personalization in marketing, sales and services.The first priority area of focus is to help clients enable multi-channel customer interactions and improve access to self-service and issue resolution capabilities, while decreasing the cost to service each customer. The effort will leverage Google Cloud's data and AI capabilities, specifically the Contact Center AI (CCAI) solution, which enables end-to-end customer interaction across voice and digital channels.In addition to improving the end-user experience, Accenture will leverage Google Cloud's AI and data management capabilities to build solutions that will help clients use data to better understand their customers. By breaking down data silos across customers, channels, and products, these solutions can provide clients with a real-time, 360-degree view of customers, generating new insights, powering new strategies for growth and improving customer satisfaction.Finally, the two companies are also teaming on the fast-emerging area of hyper-personalization to help customers transform their marketing, sales and services data into contextually relevant services. By leveraging Google Cloud's AI and ML capabilities and more secure, trusted high performance cloud infrastructure, organizations can turn data into business insights that can be applied to help increase customer response rates, lifetime value and loyalty.\"Leading organizations are actively working to gain a competitive advantage by providing differentiated experiences and omni-channel interactions with their customers,\" said Paul Daugherty, chief technology & innovation officer at Accenture. \"Expanding the scope of our collaboration is a great example of how Accenture and Google Cloud are fueling the next generation of digital innovation and business growth by harnessing the power of AI that can deliver real outcomes for our clients.\"Thomas Kurian, CEO at Google Cloud, added, \"There is a tremendous opportunity for Fortune 2000 customers to modernize their customer engagement models. Combining Google Cloud's leading AI and ML capabilities with Accenture's trusted enterprise transformation capability enables us to develop real, actionable solutions that enterprise customers can start building on today.\"The companies are collaborating through the Accenture Google Cloud Business Group, which focuses on developing industry-based solutions in high-growth areas to accelerate clients' adoption of Google Cloud.Accenture has delivered more than 21,000 cloud transformations in nearly every industry. Accenture was selected as the 2018 Google Cloud Global Social Impact Partner of the Year and as a finalist for the 2018 Google Cloud Services Partner of the Year.For more information on the Accenture Google Cloud Business Group, visit https://www.accenture.com/us-en/service-accenture-google-business-group.About AccentureAccenture is a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations. Combining unmatched experience and specialized skills across more than 40 industries and all business functions — underpinned by the world's largest delivery network — Accenture works at the intersection of business and technology to help clients improve their performance and create sustainable value for their stakeholders. With 477,000 people serving clients in more than 120 countries, Accenture drives innovation to improve the way the world works and lives. Visit us at www.accenture.com.About Google CloudGoogle Cloud is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google's private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today's digital world.View source version on businesswire.com: https://www.businesswire.com/news/home/20190410005141/en/Source: Accenture"
    },
    {
        "title": "Intel and Google Cloud Announce Strategic Partnership to Accelerate Hybrid Cloud",
        "subtitle": "",
        "date": "Apr 9, 2019 12:30PM EDT",
        "content": "Intel and Google Cloud to Develop Anthos Reference Design to Simplify Deployment Across On-Premise Data Centers and the CloudSAN FRANCISCO--(BUSINESS WIRE)-- GOOGLE CLOUD NEXT — Intel (NASDAQ:INTC) and Google Cloud (NASDAQ: GOOG, GOOGL) today announced a strategic partnership aimed at helping enterprise customers seamlessly deploy applications across on-premise and cloud environments. The two companies will collaborate on Anthos, a new reference design based on the 2nd-Generation Intel® Xeon® Scalable processor and an optimized Kubernetes software stack that will deliver increased workload portability to customers who want to take advantage of hybrid cloud environments. Intel will publish the production design as an Intel Select Solution, as well as a developer platform.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190409005821/en/Navin Shenoy, Intel executive vice president and general manager of the Data Center Group, displays a wafer containing Intel Xeon processors during a keynote on Tuesday, April 2, 2019. In San Francisco on April 2, Intel Corporation introduces a portfolio of data-centric tools to help its customers extract more value from their data. (Credit: Walden Kirsch/Intel Corporation)While organizations are embracing multi-cloud solutions to fuel their businesses, many companies remain challenged to find the right hybrid cloud solutions that enable seamless workload migration across clouds. The new Anthos reference design will address this challenge by delivering a stack optimized for workload portability, enabling deployment of applications across on-premise data centers and public cloud provider services.More:Data-Centric Innovation at Intel | We're Stepping on the Gas Pedal for Hybrid Cloud (Lisa Spelman Blog)\"Google and Intel enjoy a long-standing partnership focused on delivering infrastructure innovation to customers,\" said Urs Hölzle, senior vice president of Technical Infrastructure at Google Cloud. \"Data center environments today are complex, and hardware and software infrastructure is not ‘one size fits all.' Our ability to collaborate with Intel and take advantage of their technology and product innovation to deliver Anthos solutions ensures that our customers can run their applications in the way that best suits them.\"\"Our collaboration with Google in delivering the infrastructure and software optimizations required to advance their hybrid and multi-cloud solution is a natural fit with Intel's vision for data-centric computing,\" said Navin Shenoy, executive vice president and general manager of the Data Center Group at Intel Corporation. \"We're delivering an Intel technology foundation for customers to take advantage of their data, and that requires delivery of architectures that can span across various operating environments. This collaboration will give customers a choice of optimized solutions that can be utilized both in the on-prem as well as cloud environments.\"This collaboration is an extension of a technology alliance between the two companies that already spans many infrastructure optimizations, collaboration on high-growth workloads like artificial intelligence, and integration of new technologies into the Google Cloud Platform, such as the 2nd-Generation Intel Xeon Scalable processors and Intel® Optane™ DC Persistent Memory.The new reference design will be delivered by mid-year 2019 with expected solution delivery from OEMs and solutions integrators in market later this year.About IntelIntel (NASDAQ:INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world's innovations. The company's engineering expertise is helping address the world's greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world - from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.About Google CloudGoogle Cloud (NASDAQ: GOOG, GOOGL) is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google's private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today's digital world.Intel and the Intel logo are trademarks of Intel Corporation in the United States and other countries.*Other names and brands may be claimed as the property of others.View source version on businesswire.com: https://www.businesswire.com/news/home/20190409005821/en/Source: Intel Corporation"
    },
    {
        "title": "HPE and Google Cloud Partner to Simplify Hybrid Cloud",
        "subtitle": "",
        "date": "Apr 9, 2019 12:30PM EDT",
        "content": "Partnership will enable customers to seamlessly build, run and manage services on-premises and in the cloud with AnthosSAN FRANCISCO--(BUSINESS WIRE)-- Google Cloud Next - Hewlett Packard Enterprise ( HPE ) and Google Cloud today announced a global partnership to deliver hybrid cloud solutions that accelerate innovation and expand choice and agility for customers. Today's announcement is part of an ongoing collaboration between HPE and Google Cloud to provide customers with a consistent experience across public cloud and on-premises environments.As part of the initial strategic agreement, HPE will offer two HPE Validated Designs for Google Cloud's Anthos based on HPE SimpliVity hyperconverged infrastructure and HPE Nimble Storage and HPE ProLiant servers. HPE's validation of Anthos on its solutions provides HPE's and Google Cloud's mutual customers the flexibility to choose the right mix of on-premises infrastructure and public cloud to best meet their needs.Additionally, HPE will offer validated on-premises infrastructure-as-a-service through HPE GreenLake, HPE's fully managed pay-per-use consumption offering. Customers who choose this offering can run applications as a service in a Google Kubernetes Engine (GKE) environment on-premises and benefit from the same container-based design across their hybrid infrastructure.Customers can leverage Anthos to manage their public cloud as well as on-premises resources. With HPE GreenLake, they will benefit from a consistent consumption model for their on-premises environment.\"Customers tell us they value choice, simplicity, and consistency in building their hybrid cloud strategy,\" said Phil Davis, President of Hybrid IT and Chief Sales Officer, HPE. \"By partnering with Google Cloud and leveraging a container-based approach, HPE can offer a seamless hybrid cloud experience with the unique option to do it all as-a-service. This approach, powered by Anthos and HPE GreenLake, gives our customers the freedom to modernize at their own pace with the HPE infrastructure of their choice.\"\"We're working closely with HPE to make it easy for customers to incorporate Anthos into their cloud strategies,\" said Kevin Ichhpurani, Corporate Vice President, Global Ecosystem and Business Development at Google Cloud. \"We're delighted that HPE shares our ‘build once, run anywhere' approach and look forward to expanding our partnership for hybrid cloud solutions on behalf of customers.\"Accelerate Container Deployment with HPE and Google CloudToday, organizations are using container-based architectures to modernize applications and make developers more agile, applications more portable, and deployments more streamlined. Gartner estimates that by 2022, more than 75% of global organizations will be running containerized applications in production.1Anthos' use of virtual machines to run containers on-premises allows customers to securely and efficiently run production applications on software-defined infrastructure that is easily managed, monitored, scaled, and optimized. The new solutions from HPE and Google Cloud will make it easier for customers to leverage containers and drive a consistent cloud experience, so applications are built once to run anywhere, across clouds and on-premises.Together, these solutions are ideal for a range of use cases, including implementing DevOps through a CI/CD pipeline, developing applications in Google Cloud and running them in production on-premises, and deploying low-cost distributed edge containerized applications.How it WorksToday's partnership announcement consists of the following components:Please read more about this partnership on the HPE blog and Google blog.About HPEHPE is a global technology leader focused on developing intelligent solutions that allow customers to capture, analyze, and act upon data seamlessly from edge to cloud. Hartford enables customers to accelerate business outcomes by driving new business models, creating new customer and employee experiences, and increasing operational efficiency today and into the future.About Google CloudGoogle Cloud is widely recognized as a global leader in delivering a secure, open and intelligent enterprise cloud platform. Our technology is built on Google's private network and is the product of nearly 20 years of innovation in security, network architecture, collaboration, artificial intelligence and open source software. We offer a simply engineered set of tools and unparalleled technology across Google Cloud Platform and G Suite that help bring people, insights and ideas together. Customers across more than 150 countries trust Google Cloud to modernize their computing environment for today's digital world.1 Gartner, Best Practices for Running Containers and Kubernetes in Production, February 2019.2Forrester Consulting, The Total Economic Impact of HPE GreenLake Flex Capacity, May 2018.View source version on businesswire.com: https://www.businesswire.com/news/home/20190409005487/en/Source: Hewlett Packard Enterprise"
    },
    {
        "title": "Snow Appoints New CEO and Expands Executive Leadership Team",
        "subtitle": "",
        "date": "Jan 30, 2019 11:00AM EST",
        "content": "Vishal Rao transitions to President & Chief Executive Officer, with Rachel Mooney and James Denena joining as Chief People & Culture Officer and Chief Financial Officer respectivelySTOCKHOLM & AUSTIN, Texas--(BUSINESS WIRE)-- Snow Software, the global leader in technology intelligence and automation solutions, today announced the appointment of Vishal Rao as Chief Executive Officer. He succeeds founder Axel Kling, who is stepping down as CEO after growing the company into a market leader with over 4,000 customers worldwide. Kling will remain on the Board of Directors. The company also named Rachel Mooney as Chief People & Culture Officer and James Denena as Chief Financial Officer. These appointments round out a globally diverse management team with the experience needed to support Snow's next era of growth and maturity. In 2018, the company added several other key executives, including Ken Schock as Chief Revenue Officer, Sanjay Castelino as Chief Marketing Officer, and Alastair Pooley as Chief Information Officer.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190130005477/en/Vishal Rao, Snow Software Chief Executive Officer. (Photo: Business Wire)\"This is an important growth stage for the company, and I am humbled to lead Snow at such an exciting time,\" said Rao. \"Our opportunity continues to expand with the mass adoption of enterprise cloud services, IaaS, IoT, and edge computing. We are uniquely positioned to empower businesses to gain complete visibility into their technology stack, then use those insights to optimize efficiency and effectiveness while ensuring regulatory compliance and data protection. I would like to thank the Board and Axel for this opportunity, and I am excited for us to build on Snow's successes and momentum as we move the company forward.\"Vishal Rao, Chief Executive OfficerRao previously served as the President & Chief Operating Officer at Snow. He joined Snow's Board of Directors in 2016, and in 2018 took on an operating role overseeing all functions of the business. During that period, Rao contributed to the company crossing the $100 million revenue mark and made several executive appointments to further accelerate growth. Prior to Snow, he held leadership positions at Splunk (NASDAQ:SPLK) and Cloudera (NYSE:CLDR), both of which realized material revenue milestones and successful IPOs during his tenure. Rao will remain on Snow's Board of Directors.\"I'm delighted to welcome Vishal as the next CEO of Snow,\" said Kling. \"Having invited Vishal to join our Board three years ago, I know he brings the drive and experience needed to take the company to the next level. The past fifteen years have been an incredible journey, and I very much look forward to working with Vishal and supporting Snow as a Board member.\"\"In 2018 we brought Vishal into an operating role to help Snow take the next step in its evolution, growing beyond $100 million in revenue and becoming one of the most admired companies in enterprise software,\" said Mike Risman, Chairman of the Board at Snow and Managing Partner at Vitruvian Partners. \"I'm thrilled to support Vishal in this final step of transitioning to CEO. I want to thank Axel for his leadership and passion as CEO, and I look forward to our continued collaboration on the Board of Directors as we partner to support the Snow team.\"\"We are excited by the momentum that Snow has shown under Vishal's operating leadership,\" said George Kadifa, board member and Managing Director at Sumeru Equity Partners. \"As he takes on the expanded role of CEO, we are confident that the team will realize the opportunity in front of them, helping customers around the world maximize the promise of digital transformation.\"In addition to Rao's appointment, two new executives joined Snow's leadership team.Rachel Mooney, Chief People & Culture OfficerMooney will be responsible for global HR strategy and operations, enhancing and aligning employee experience across the organization, and enabling Snow to attract, retain and develop top talent. She joins Snow from Vodafone (NASDAQ:VOD), where she led strategic and operational HR for group corporate functions and global shared services, driving enhanced productivity and effectiveness across Sales, Marketing, Finance and Technology. Previously, Mooney led organizational culture for Google (NASDAQ:GOOGL) across EMEA as well as the company's human resources function in Ireland, with a relentless focus on accelerated growth and innovation. Mooney will be based in the U.K.James Denena, Chief Financial OfficerDenena comes to Snow with extensive financial and business development experience and a proven record for driving growth within public global organizations. Most recently, Denena was Vice President of Global Finance & Corporate Development for PROS (NYSE:PRO), a cloud software company with customers in more than 40 industries and 55 countries. He also served more than a decade at Applied Materials (NASDAQ:AMAT) in various senior finance, business development, and M&A roles. During his career, Denena has led multiple equity capital raises and completed more than 20 M&A and capital formation transactions. Denena will be based in the U.S.\"We're assembling a highly capable and well-rounded executive team ready to take Snow to the next level and I'm pleased to welcome Rachel and James as the newest members of the team,\" said Rao.\"In Rachel, we gain an accomplished business executive who understands the critical link between developing great people and a company's ability to grow and transform,\" he continued. \"She brings both passion and expertise in the full breadth of people and organizational capabilities, operating within start-ups, scaling and established businesses - key to our growth journey.\"\"James is an equally critical hire for us at this juncture,\" said Rao. \"As CFO, he brings tremendous experience building out strong finance teams and leading strategic initiatives. James is equal parts financial disciplinarian and growth-minded leader, which makes him ideally suited for Snow as we expand and optimize the business.\"About Snow SoftwareSnow Software is the global leader in Technology Intelligence & Automation solutions, ensuring the trillions spent on all forms of technology is optimized to drive maximum value. More than 4,000 organizations around the world rely on Snow's platform to provide complete visibility, optimize usage and spend, and minimize regulatory risk. Headquartered in Stockholm, Snow has more local offices and regional support centers than any other software asset and cloud management provider, delivering unparalleled results to our customers and partners. To find out more about Snow, visit www.snowsoftware.com.View source version on businesswire.com: https://www.businesswire.com/news/home/20190130005477/en/Source: Snow Software"
    },
    {
        "title": "Analysis: Positioning to Benefit within Alphabet, Globalstar, Ingevity, Vocera Communications, Sarepta Therapeutics, and FLIR — Research Highlights Growth, Revenue, and Consolidated Results",
        "subtitle": "",
        "date": "Jan 14, 2019 7:25AM EST",
        "content": "NEW YORK, Jan. 14, 2019 (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of Alphabet Inc. (NASDAQ:GOOGL), Globalstar, Inc. (NYSE:GSAT), Ingevity Corporation (NYSE:NGVT), Vocera Communications, Inc. (NYSE:VCRA), Sarepta Therapeutics, Inc. (NASDAQ:SRPT), and FLIR Systems, Inc. (NASDAQ:FLIR), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.Complimentary Access: Research ReportsFull copies of recently published reports are available to readers at the links below.GOOGL DOWNLOAD: http://Fundamental-Markets.com/register/?so=GOOGLGSAT DOWNLOAD: http://Fundamental-Markets.com/register/?so=GSATNGVT DOWNLOAD: http://Fundamental-Markets.com/register/?so=NGVTVCRA DOWNLOAD: http://Fundamental-Markets.com/register/?so=VCRASRPT DOWNLOAD: http://Fundamental-Markets.com/register/?so=SRPTFLIR DOWNLOAD: http://Fundamental-Markets.com/register/?so=FLIR(You may have to copy and paste the link into your browser and hit the [ENTER] key)The new research reports from Fundamental Markets, available for free download at the links above, examine Alphabet Inc. (NASDAQ:GOOGL), Globalstar, Inc. (NYSE:GSAT), Ingevity Corporation (NYSE:NGVT), Vocera Communications, Inc. (NYSE:VCRA), Sarepta Therapeutics, Inc. (NASDAQ:SRPT), and FLIR Systems, Inc. (NASDAQ:FLIR) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.-----------------------------------------Important Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed January 10th, 2019. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.-----------------------------------------ALPHABET INC. ( GOOGL ) REPORT OVERVIEWAlphabet's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Alphabet reported revenue of $33,740.00MM vs $27,772.00MM (up 21.49%) and analysts estimated basic earnings per share $13.21 vs $9.71 (up 36.05%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Alphabet reported revenue of $110,855.00MM vs $90,272.00MM (up 22.80%) and analysts estimated basic earnings per share $18.27 vs $28.32 (down 35.49%). Analysts expect earnings to be released on February 4th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $9.70. The estimated EPS forecast for the next fiscal year is $47.45 and is expected to report on February 4th, 2019.To read the full Alphabet Inc. ( GOOGL ) report, download it here: http://Fundamental-Markets.com/register/?so=GOOGL-----------------------------------------GLOBALSTAR, INC. ( GSAT ) REPORT OVERVIEWGlobalstar's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Globalstar reported revenue of $35.69MM vs $30.46MM (up 17.18%) and analysts estimated basic earnings per share $0.01 vs $0.04 (down 75.00%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Globalstar reported revenue of $112.66MM vs $96.86MM (up 16.31%) and analysts estimated basic earnings per share -$0.08 vs -$0.12. Analysts expect earnings to be released on February 28th, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was -$0.02. The estimated EPS forecast for the next fiscal year is -$0.05 and is expected to report on February 28th, 2019.To read the full Globalstar, Inc. ( GSAT ) report, download it here: http://Fundamental-Markets.com/register/?so=GSAT-----------------------------------------INGEVITY CORPORATION ( NGVT ) REPORT OVERVIEWIngevity's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Ingevity reported revenue of $311.20MM vs $264.10MM (up 17.83%) and analysts estimated basic earnings per share $1.18 vs $0.80 (up 47.50%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Ingevity reported revenue of $972.40MM vs $908.30MM (up 7.06%) and analysts estimated basic earnings per share $3.00 vs $0.83 (up 261.45%). Analysts expect earnings to be released on February 19th, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $0.45. The estimated EPS forecast for the next fiscal year is $4.67 and is expected to report on February 19th, 2019.To read the full Ingevity Corporation ( NGVT ) report, download it here: http://Fundamental-Markets.com/register/?so=NGVT-----------------------------------------VOCERA COMMUNICATIONS, INC. (VCRA) REPORT OVERVIEWVocera Communications' Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Vocera Communications reported revenue of $47.82MM vs $45.59MM (up 4.91%) and basic earnings per share -$0.01 vs $0.05. For the twelve months ended December 31st, 2017 vs December 31st, 2016, Vocera Communications reported revenue of $162.55MM vs $127.70MM (up 27.29%) and analysts estimated basic earnings per share -$0.50 vs -$0.64. Analysts expect earnings to be released on February 14th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.14. The estimated EPS forecast for the next fiscal year is -$0.14 and is expected to report on February 14th, 2019.To read the full Vocera Communications, Inc. (VCRA) report, download it here: http://Fundamental-Markets.com/register/?so=VCRA-----------------------------------------SAREPTA THERAPEUTICS, INC. ( SRPT ) REPORT OVERVIEWSarepta Therapeutics' Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Sarepta Therapeutics reported revenue of $78.49MM vs $45.95MM (up 70.79%) and analysts estimated basic earnings per share -$1.15 vs -$0.78. For the twelve months ended December 31st, 2017 vs December 31st, 2016, Sarepta Therapeutics reported revenue of $154.58MM vs $5.42MM (up 2,751.58%) and analysts estimated basic earnings per share -$0.86 vs -$5.49. Analysts expect earnings to be released on March 7th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was -$0.37. The estimated EPS forecast for the next fiscal year is -$2.86 and is expected to report on March 7th, 2019.To read the full Sarepta Therapeutics, Inc. ( SRPT ) report, download it here: http://Fundamental-Markets.com/register/?so=SRPT-----------------------------------------FLIR SYSTEMS, INC. ( FLIR ) REPORT OVERVIEWFLIR's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, FLIR reported revenue of $434.90MM vs $464.71MM (down 6.42%) and analysts estimated basic earnings per share $0.53 vs $0.46 (up 15.22%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, FLIR reported revenue of $1,800.43MM vs $1,662.17MM (up 8.32%) and analysts estimated basic earnings per share $0.78 vs $1.22 (down 36.07%). Analysts expect earnings to be released on February 13th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.58. The estimated EPS forecast for the next fiscal year is $2.39 and is expected to report on February 13th, 2019.To read the full FLIR Systems, Inc. ( FLIR ) report, download it here: http://Fundamental-Markets.com/register/?so=FLIR-----------------------------------------ABOUT FUNDAMENTAL MARKETSFundamental Markets serves thousands of members and have provided research through some of the world's leading brokerages for over a decade-and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets' roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.REGISTERED MEMBER STATUSFundamental Markets' oversight and audit staff are registered analysts, brokers, and/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets' roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets' Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@Fundamental-Markets.com.LEGAL NOTICESInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.Media Contact:Andrew Duffie, Media DepartmentOffice: +1 667-401-0010E-mail: media@Fundamental-Markets.com© 2019 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@Fundamental-Markets.com.CFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.FINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.Source: Fundamental Markets"
    }
]