[
    {
        "title": "IDEXX Laboratories to Present at Two Upcoming Institutional Investor Conferences",
        "subtitle": "",
        "date": "Feb 14, 2020 11:30AM EST",
        "content": "WESTBROOK, Maine, Feb. 14, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, will participate in two upcoming conferences:Individuals can access the live audio webcasts of the presentations through links on the IDEXX website, http://idexx.com/investors. An archived edition of the presentations will be available via the same link.About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 9,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Contact: Investor Relations: John Ravis207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-to-present-at-two-upcoming-institutional-investor-conferences-301005298.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Announces Increase in Share Repurchase Program Authorization",
        "subtitle": "",
        "date": "Feb 12, 2020 4:15PM EST",
        "content": "WESTBROOK, Maine, Feb. 12, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX) today announced that the Company's Board of Directors has authorized the repurchase of an additional 5.0 million shares of the Company's common stock under its ongoing share repurchase program. Repurchases may be made at management's discretion from time to time in the open market (including through Rule 10b5-1 plans) or in negotiated transactions. These shares are in addition to the 1.8 million shares remaining under the share repurchase program as of February 7, 2020, pursuant to previous Board authorizations. The share repurchase program has no specified expiration date and may be suspended or discontinued at any time.About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 9,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of some of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov and via IDEXX's website at www.idexx.com).Contact: Investor Relations: John Ravis207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-announces-increase-in-share-repurchase-program-authorization-301003972.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Announces Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Jan 31, 2020 6:30AM EST",
        "content": "WESTBROOK, Maine, Jan. 31, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), reports revenues of $605 million for the fourth quarter of 2019, an increase of 10% compared to the prior year period on a reported and organic basis. Fourth quarter results were driven by continued high gains in Companion Animal Group (\"CAG\") Diagnostics recurring revenue globally, as well as strong growth in the Company's Water and Livestock, Poultry and Dairy (\"LPD\") businesses. Earnings per diluted share (\"EPS\") were $1.04 on a reported basis for the fourth quarter, representing EPS growth of 6% and comparable constant currency EPS growth of 17%, which excludes the impact of CEO transition charges of $0.14 per share. Comparable constant currency growth measures are non-GAAP financial measures and have been modified to exclude operating expense impact of $13 million or $0.14 per share of CEO transition charges as described in our footnotes. Fourth quarter EPS results included $0.05 per share from better than projected share-based compensation tax benefits, $0.04 from lower than projected after-tax CEO transition charges and $0.04 in combined upsides from better than expected effective tax rate and interest expense.Revenue for the full year of $2,407 million increased 9% on a reported and 10% on an organic basis, driven by 11% reported and 12% organic growth in CAG Diagnostics recurring revenue. For the full year 2019, EPS of $4.89 increased 15% on a reported basis and 21% on a comparable constant currency basis, supported by a reported 80 basis points of operating margin improvement, or 120 basis points on a comparable constant currency basis.The Company is maintaining its full year 2020 revenue growth outlook of 9% - 10.5% on a reported and organic basis.  The Company is increasing its EPS guidance range to $5.42 - $5.58, an increase of $0.12 per share, reflecting consistent expectations for 50 - 100 basis points of comparable constant currency operating margin improvement. The EPS guidance range improvement reflects approximately $0.05 in combined benefit from favorable updates to expectations for interest expense, shares outstanding and flow through of 2019 operating profit performance, approximately $0.05 per share in incremental benefits from projected share-based compensation tax benefits reflecting recent share prices, and $0.02 in benefit from updated projections for foreign exchange rates impacts.\"IDEXX fourth quarter results provided a strong finish to 2019, enabling us to deliver revenue and comparable constant currency EPS gains aligned with our long-term goals. Our full year results were driven by continued strong 12% organic growth in CAG Diagnostics recurring revenues, which now represent 76% of total IDEXX revenue. We are well positioned to build on this progress in 2020, leveraging our expanded global commercial capability and unique innovations which support continued strong diagnostics market growth driven by the adoption of higher standards of care for pets globally,\" said Jay Mazelsky, the Company's President and Chief Executive Officer.Fourth Quarter Performance HighlightsCompanion Animal GroupThe Companion Animal Group generated 11% reported and organic revenue growth for the quarter. CAG Diagnostics recurring revenue growth remained strong at 11% reported and organic, net of a modest headwind from fewer equivalent days.Veterinary software services and diagnostic imaging systems revenue growth increased 9% on a reported and organic basis, supported by double-digit growth in veterinary software and services.WaterWater achieved revenue growth of 9% on a reported basis and 10% on an organic basis, including a 1% growth benefit from greater equivalent days. Water growth was supported by solid gains in the U.S. and strong growth in international markets.Livestock, Poultry and Dairy (\"LPD\")LPD revenue increased 8% on a reported basis and 10% on an organic basis, reflecting favorable comparisons related to year-end government and distributor order timing, gains from African Swine Fever diagnostic testing programs in China and growth in diagnostic testing associated with alternate food sources, such as poultry.Gross Profit and Operating ProfitGross profits increased 10%, and gross margins were flat year-over-year at 54.7%. On a constant currency basis, gross margin was slightly lower than fourth quarter 2018, reflecting increased investment in our reference lab business related to day lab capacity, courier route expansion, technology investments and acquisition integration, partially offset by continued solid net price gains and strong growth in consumable revenues.Operating margin was 19.1% in the quarter, 190 basis points lower than the prior year period results on a reported basis and relatively flat on a comparable constant currency basis.  Operating expenses increased 16% on a reported basis, reflecting the impact of the CEO transition charges, and 10% on a comparable constant currency basis, driven by increases in our CAG segment's sales and marketing costs and research and development spending.2020 Financial OutlookThe following guidance for 2020 reflects the assumptions that for the remainder of 2020, the value of foreign currencies will remain at the following rates in U.S. dollars:and relative to the U.S. dollar:Outlook for 2020The Company is raising its 2020 revenue outlook to $2,620 million - $2,655 million, supported by consistent outlook for reported and organic revenue growth of 9% - 10.5%, reflecting expectations for CAG Diagnostics recurring reported and organic revenue growth of 11% - 12%. Updated foreign exchange rate assumptions increased revenue guidance by approximately $5 million. At the foreign exchange rate assumptions in 2020 noted above, we estimate that the effect of the stronger U.S. dollar will reduce full year 2020 reported revenue growth by approximately 0.5%, EPS growth by approximately 2%, and EPS by an estimated $0.09 per share, including the net impact of lower projected hedge gains of approximately $5 million in 2020.The Company is increasing its 2020 EPS outlook to $5.42 - $5.58 per share, an increase of $0.12 per share, or targeted growth of 11% - 14% on a reported basis and 13% - 16% on a comparable constant currency basis, which excludes a 3% growth rate benefit from comparisons to the 2019 CEO transition charges. The Company is projecting free cash flow at approximately 75% - 80% of net income in 2020, including approximately 7% impact related to $35 million of major facility capital spending for the completion of our Westbrook, Maine headquarters expansion, the relocation and expansion of our core laboratory in Germany, and the acquisition of real estate associated with a leased U.S. reference lab facility. Spending for major facility projects was $58 million in 2019, lower than earlier estimates driven by later timing of cash deployment. For 2020, the Company projects total capital spending, including major projects, of approximately $140 million - $155 million.The Company provides the following updated guidance for 2020:Amounts in millions except per share data and percentagesWe expect an effective tax rate of 20% - 21%, including expectations for share-based compensation tax benefits of $7.5 million - $9.5 million or approximately 150 basis points. We are now projecting a reduction in weighted average shares outstanding of approximately 1% - 1.5%, and interest expense, net of interest income, of approximately $35 million, reflecting current and projected borrowings.Conference Call and Webcast InformationIDEXX Laboratories, Inc. will host a conference call today at 8:30 a.m. (Eastern) to discuss its fourth quarter and full year 2019 results and management's outlook. To participate in the conference call, dial 1-844-767-5679 or 1-409-207-6967 and reference access code 176532. Replay of the conference call will be available through Friday, February 7, 2020 by dialing 1-866-207-1041 or 1-402-970-0847 and referencing replay code 8036553. Individuals can access a live webcast of the conference call through a link on the IDEXX website, www.idexx.com/investors. An archived edition of the webcast will be available after 1:00 p.m. (Eastern) on that day via the same link and will remain available for one year.About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 9,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com. Note Regarding Forward-Looking StatementsThis earnings release contains statements about the Company's business prospects and estimates of the Company's financial results for future periods that are forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Forward-looking statements are included above under \"2020 Financial Outlook\", \"Outlook for 2020\", and elsewhere and can be identified by the use of words such as \"expects\", \"may\", \"anticipates\", \"intends\", \"would\", \"will\", \"plans\", \"believes\", \"estimates\", \"projected\", \"should\", and similar words and expressions. Our forward-looking statements include statements relating to revenue growth and EPS outlooks; operating and free cash flow forecast; projected impact of foreign currency exchange rates; and projected operating margins and expenses, capital expenditures, gains from foreign currency hedging transactions, tax and EPS benefits from share-based compensation arrangements, effective tax rates, weighted average shares outstanding and interest expense. These statements are intended to provide management's expectation of future events as of the date of this earnings release; are based on management's estimates, projections, beliefs and assumptions as of the date of this earnings release; and are not guarantees of future performance. These forward-looking statements involve known and unknown risks and uncertainties that may cause the Company's actual results, levels of activity, performance or achievements to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, among other things, the matters described under the headings \"Business,\" \"Risk Factors,\" \"Legal Proceedings,\" \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Quantitative and Qualitative Disclosures About Market Risk\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2018 and in the corresponding sections of the Company's Quarterly Report on Form 10-Q for the quarters ended March 31, 2019, June 30, 2019 and September 30, 2019, as well as those described from time to time in the Company's other filings with the U.S. Securities and Exchange Commission available at www.sec.gov. The Company specifically disclaims any obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise.Statement Regarding Non-GAAP Financial MeasuresThe following defines terms and conventions and provides reconciliations regarding certain measures used in this earnings release and/or the accompanying earnings conference call that are not required by, or presented in accordance with, generally accepted accounting principles in the United States of America (\"GAAP\"), otherwise referred to as non-GAAP financial measures. To supplement the Company's consolidated results presented in accordance with GAAP, the Company has disclosed non-GAAP financial measures that exclude or adjust certain items. Management believes these non-GAAP financial measures provide useful supplemental information for its and investors' evaluation of the Company's business performance and liquidity and are useful for period-over-period comparisons of the performance of the Company's business and its liquidity and to the performance and liquidity of our peers. While management believes that these non-GAAP financial measures are useful in evaluating the Company's business, this information should be considered as supplemental in nature and should not be considered in isolation or as a substitute for the related financial information prepared in accordance with GAAP. In addition, these non-GAAP financial measures may not be the same as similarly titled measures reported by other companies.Constant currency - Constant currency references are non-GAAP financial measures which exclude the impact of changes in foreign currency exchange rates and are consistent with how management evaluates our performance and comparisons with prior and future periods. We estimated the net impacts of currency on our revenue, gross profit, operating profit, and EPS results by restating results to the average exchange rates or exchange rate assumptions for the comparative period, which includes adjusting for the estimated impacts of foreign currency hedging transactions. These estimated currency changes impacted fourth quarter 2019 results as follows:  decreased gross profit growth by approximately 1%, increased gross margin growth by 10 basis points, decreased operating expense growth by 1%, had an immaterial impact on operating profit, operating profit margin growth, and EPS growth. Estimated currency changes impacted full year 2019 results as follows: increased gross margin growth by 10 basis points, decreased operating profit growth by 1%, had an immaterial impact on operating leverage growth, increased operating profit margin growth by 15 basis points, and decreased EPS growth by 1%.  Estimated currency changes are also expected to decrease projected full year 2020 revenue growth by approximately 0.5%, decrease projected full year 2020 CAG Diagnostics recurring revenue growth by approximately 0.5%, decrease projected operating profit margin growth by approximately 20 basis points, and decrease projected 2020 EPS growth by approximately 2%, and decrease first quarter revenue growth by approximately 1%. Constant currency revenue growth represents the percentage change in revenue during the applicable period, as compared to the prior year period, excluding the impact of changes in foreign currency exchange rates. See the supplementary analysis of results below for revenue percentage change from currency for the three months and year ended December 31, 2019.Growth and organic revenue growth - All references to growth and organic growth refer to growth compared to the equivalent prior year period unless specifically noted. Organic revenue growth is a non-GAAP financial measure that excludes the impact of changes in foreign currency exchange rates and revenue from business acquisitions. Management believes that reporting organic revenue growth provides useful information to investors by facilitating easier comparisons of our revenue performance with prior and future periods and to the performance of our peers. See the supplementary analysis of results below for a reconciliation of reported revenue growth to organic revenue growth for the three and twelve months ended December 31, 2019.  See the constant currency note above for the impacts of estimated currency changes to fourth quarter and full year 2019, as well estimated full year 2020 organic revenue growth for the Company.  The percentage change in revenue resulting from acquisitions represents incremental revenues attributable to business acquisitions that have occurred since the beginning of the prior year period. Revenue from acquisitions is expected to increase projected full year 2020 revenue growth by approximately 0.5% and first quarter 2020 revenue by 0.5%, and projected full year 2020 CAG Diagnostics recurring organic revenue growth by approximately 0.5%.Comparable constant currency operating expense growth, operating profit growth, and operating margin growth - Comparable constant currency operating expense growth, operating profit growth, and operating profit margin gain (or growth) are non-GAAP financial measures and exclude CEO transition charges and changes in foreign currency exchange rates. Management believes that reporting comparable constant currency operating expense growth, operating profit growth, and operating margin gain provide useful information to investors because it enables better period-over-period comparisons of the fundamental financial results by excluding items that vary independent of performance and provides greater transparency to investors regarding key metrics used by management. Comparable constant currency operating expense growth, operating profit growth, and operating margin gain should be considered in addition to, and not as replacements of or superior measures to, operating expense growth, operating profit growth, and operating margin gain reported in accordance with GAAP. CEO transition charges increased operating expense growth by 7% in the fourth quarter of 2019 and 2% for the full year 2019, decreased operating profit growth by 12% in the fourth quarter of 2019 and 3% for the full year 2019, and decreased operating margin gain by 220 basis points in the fourth quarter of 2019 and 55 basis points for the full year 2019. CEO transition charges are projected to increase operating margin growth by approximately 50 basis points in 2020. These impacts and those described in the constant currency note above reconcile reported operating expense growth, operating profit growth, and operating margin gain to comparable constant currency operating expense growth, operating profit growth, and operating margin gain for the Company.Comparable constant currency EPS growth - Comparable constant currency EPS growth is a non-GAAP financial measure that excludes the tax effects of share-based compensation activity under ASU 2016-09, CEO transition charges, and changes in foreign currency exchange rates. Management believes comparable constant currency EPS growth is a more useful way to measure the Company's business performance than EPS growth because it enables better period-over-period comparisons of the fundamental financial results by excluding items that vary independent of performance and provides greater transparency to investors regarding a key metric used by management. Share-based compensation activity is expected to increase projected EPS by $0.09 to $0.11 for the full year 2020, increased fourth quarter 2019 EPS by $0.05 compared to $0.01 in the fourth quarter of 2018, increased EPS by $0.22 for the full year 2019, and increased EPS by $0.24 for full year 2018. CEO transition charges decreased EPS by $0.14 in the fourth quarter of 2019. These impacts and those described in the constant currency note above reconcile reported EPS growth to comparable constant currency EPS growth for the Company.Free cash flow - Free cash flow is a non-GAAP financial measure and means, with respect to a measurement period, the cash generated from operations during that period, reduced by the Company's investments in property and equipment.  Management believes free cash flow is a useful measure because it indicates the cash the operations of the business are generating after appropriate reinvestment for recurring investments in property and equipment that are required to operate the business. See the supplementary analysis of results below for our calculation of free cash flow for the years ended December 31, 2019 and 2018.  To estimate projected 2020 free cash flow, we have deducted projected purchases of property and equipment (also referred to as capital expenditures) of ~$140 million - $155 million.Debt to Adjusted EBITDA (Leverage Ratios) - Adjusted EBITDA, gross debt, and net debt are non-GAAP financial measures.  Adjusted EBITDA is a non-GAAP financial measure of earnings before interest, taxes, depreciation, amortization and share-based compensation.  Management believes that using Adjusted EBITDA, gross debt and net debt in the Adjusted EBITDA ratio is a useful and recognized measure for evaluating financial leverage.  For further information on how Adjusted EBITDA and the Debt to Adjusted EBITDA Ratio are calculated, see the Company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019.After-Tax Return on Invested Capital, Excluding Cash and Investments (\"ROIC\"): After-Tax Return on Invested Capital, Excluding Cash and Investments is a non-GAAP financial measure. After-tax return on invested capital, excluding cash and investments, represents our after-tax income from operations, divided by our average invested capital, excluding cash and investments, using beginning and ending balance sheet values. Management believes that reporting ROIC provides useful information to investors for evaluating the efficiency and effectiveness of our use of capital. See the supplementary table below for reconciliation of this non-GAAP financial measure.Notes and DefinitionsCEO transition charges - Effective November 1, 2019, Jonathan W. Ayers, our former Chairman of the Board, President and Chief Executive Officer, stepped down as Chairman of our Board, ceased to be an employee of the Company and transitioned to the role of external Senior Advisor to the Company.  Mr. Ayers continues to serve as a member of our Board. Pursuant to a mutual separation agreement between the Company and Mr. Ayers, we recognized a charge to operating income of approximately $13.4 million in the fourth quarter of 2019, representing the cost of severance payments and an acceleration of the cost of his equity awards, which was offset by a reduction to our provision for income taxes of approximately $1.2 million, resulting in a total charge to net income of approximately $12.2 million, net of tax impacts. This total charge to net income is less than our previously communicated expectation of approximately $15.5 million, as a result of finalizing our income tax provision.                       Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-announces-fourth-quarter-and-full-year-2019-results-300996655.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "Latest IDEXX Innovations Designed to Enhance Patient Care and Drive Veterinary Productivity",
        "subtitle": "",
        "date": "Jan 17, 2020 7:30AM EST",
        "content": "SediVue Dx® with Advanced Bacteria Detection, new Catalyst® Bile Acids Test, and IDEXX Web PACS™ diagnostic imaging software advancements empower veterinarians for faster, more confident diagnosesWESTBROOK, Maine, Jan. 17, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics and software, today announced the latest updates to its SediVue Dx® Urine Sediment Analyzer, Catalyst Dx® and Catalyst One® chemistry analyzers, and IDEXX Web PACS™ cloud-based diagnostic imaging software, expanding the capabilities of each platform. These updates are designed to provide diagnostic tools that enhance patient care and drive productivity for veterinary teams by removing key workflow constraints.\"IDEXX's innovation strategy is focused on advancing veterinary patient care and improving the customer experience,\" said Jay Mazelsky, President and Chief Executive Officer of IDEXX Laboratories. \"These updates target important medical conditions, were influenced by customer input, and are affirmations of our commitment to customers that when they invest in their relationship with IDEXX, we invest in their practice via important ongoing enhancements to their IDEXX technology.\"SediVue Dx Urine Sediment Analyzer now with Advanced Bacteria DetectionThis breakthrough innovation for the SediVue Dx Urine Sediment Analyzer now with Advanced Bacteria Detection will dramatically enhance veterinarians' ability to obtain definitive bacteria results in urine sediment analysis, a core component of a urinalysis. Powered by the world's largest veterinary database of 350 million veterinary patient-generated images, the latest artificial intelligence-based Neural Network software update will enhance the SediVue Dx analyzer's bacteria identification capabilities. And a new proprietary reagent leveraging patent-pending technology will modify a sample and remove clutter from crowded images, enabling veterinarians to obtain conclusive bacteria results with each SediVue Dx run, even in the most clinically challenging samples. Bacteria can hide behind cells and crystals, or debris in the sample can mimic their appearance, often making bacterial detection the most challenging aspect of urine sediment analysis. Bacteria are the most frequent cause of urinary tract infections, so detection is critical for diagnosing and appropriately treating these common occurrences. Delayed or inappropriate treatment—or worse, an untreated infection with clinical signs—can lead to complications that include the spread of infection, kidney dysfunction, or potentially death. Conclusive bacterial results help veterinarians confidently determine next steps for a patient, which may include a urine culture, a short course of antibiotics for an uncomplicated infection, or additional diagnostics if a more complex case presents. The SediVue Dx analyzer global install base of 8,200 instruments will benefit from these transformative enhancements, and customers will begin to receive the update in March. Catalyst Bile Acids Test for Catalyst Dx and Catalyst One chemistry analyzersIDEXX continues to expand the capabilities of its Catalyst platform, bringing the focus in 2020 beyond the kidney to the liver. The Catalyst Bile Acids Test is the eighth new diagnostic in a series of Catalyst chemistry analyzer menu expansions over the last eight years, including the Catalyst® SDMA Test, Catalyst® SDMA and Total T4 Kit, Catalyst® Progesterone Test, and Catalyst® CRP Test. The Catalyst Bile Acids Test provides veterinarians a convenient indicator of liver function with the accuracy and range of the reference laboratory and real-time results to help them plan appropriate next steps for their patients.Understanding liver function serves as an important guide before recommending monitoring or supportive treatment or possibly more costly or invasive diagnostics like ultrasound or biopsy. In cases where the findings on a minimum database suggest evidence of liver disease, or when there is concern for the presence of a portosystemic shunt, bile acids testing allows veterinarians to analyze whether a patient's liver is still functioning well and able to carry out its important tasks.There are 41,500 Catalyst analyzers in use globally. IDEXX will begin shipping the new bile acids test to customers in North America and select European countries in March as part of a phased global launch.IDEXX Web PACS diagnostic imaging software advanced viewer powered by artificial intelligenceIDEXX will release a cloud-based software update for its IDEXX Web PACS diagnostic imaging platform that is the first use of artificial intelligence in veterinary radiology and will provide enhanced performance for improved productivity, increased usability, and faster speed to diagnosis. Often referred to as \"hanging protocols,\" the functionality of this new advanced viewer powered by artificial intelligence automatically corrects image orientation and sorts images by body part.In veterinary medicine, unlike in human medicine, teams often follow varying protocols and take radiographs in the order in which they are able to obtain them based on the extent their nonverbal patients are willing to cooperate. As a result, veterinarians, technicians, specialists, and radiologists can spend up to 25% of their image interpretation time rotating or flipping images to properly orient them.1 Moreover, images are often stored by date versus body part, requiring additional administrative time to sort images according to medically accepted anatomical position.IDEXX Web PACS is the most widely subscribed cloud-based software solution in veterinary medicine and this innovation will be available to customers by the end of the first quarter.SediVue Dx and Catalyst analyzer customers are connected to IDEXX SmartService™ Solutions, which connects IDEXX devices globally, provides web-based customer service and support, and pushes regular updates to customers free of charge. Upon availability of the Neural Network and bile acids software updates, IDEXX SmartService Solutions will automatically push them to all connected analyzers.For more information on IDEXX products and services, go to idexx.com.About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency, and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit idexx.com. Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at sec.gov and via IDEXX's website at idexx.com).1 Data on file at IDEXX Laboratories, Inc. Westbrook, Maine USA.CONTACTS:Media RelationsRobin Woodcock1-207-632-8027robin-woodcock@idexx.comInvestor RelationsJohn Ravis 1-207-556-8155john-ravis@idexx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/latest-idexx-innovations-designed-to-enhance-patient-care-and-drive-veterinary-productivity-300988640.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Launches Rapid Digital Cytology Service to Further Accelerate Delivery of Veterinary Healthcare",
        "subtitle": "",
        "date": "Jan 17, 2020 7:30AM EST",
        "content": "Enables faster veterinary clinical decision-making, rapid case management, and enhanced client experienceWESTBROOK, Maine, Jan. 17, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics and software, today announced that it is launching a new rapid digital cytology service that digitally connects veterinarians to the largest global network of more than 100 veterinary clinical pathologists and enables them to receive cytology interpretations within 2 hours. Powered by a new in-clinic instrument and IDEXX's proprietary VetConnect® PLUS software, the service will be available 24 hours a day, 7 days a week, 365 days a year. IDEXX Digital Cytology™ will be available to IDEXX customers in North America by mid-February.IDEXX has also integrated digital cytology capability into its reference laboratories so that veterinarians who submit cytology cases to IDEXX Reference Laboratories will also get faster turnaround times and broader access to IDEXX's world-class network of pathologists. Many reference laboratory digital cytology customers now benefit from deeper case collaboration among IDEXX's wide range of experts and greater ability to ensure cases are directed to the pathologist best suited to provide an interpretation.Timely and accurate cytology reporting is a critical step for veterinarians toward faster clinical decision-making, rapid case management, and an enhanced client experience. With the accelerated turnaround times, veterinary teams will be more equipped to speed up their healthcare delivery in what can often be high-anxiety situations for pet owners. Veterinary teams will also be able to maximize the likelihood that the attending veterinarian manages a case to its next steps, reducing the number of different touchpoints within a care management team and with a pet owner.Veterinarians will be able to easily incorporate orders for these cytology reports into the same workflows they use for in-house diagnostics and other IDEXX Reference Laboratories services. Veterinarians using IDEXX Reference Laboratories for digital cytology will also use existing workflows for specimen submission. With the new in-clinic service, veterinarians will be able to scan and submit high-resolution images of slides that they've prepared in the practice, and the resulting interpretations will return to the veterinarian through VetConnect PLUS software. Only IDEXX technology allows for the viewing and sharing of pathology reports that include images in the context of a patient's complete diagnostic workup, accessible from anywhere. \"We frequently see patients with suspect 'lumps and bumps' that require cytology testing to check for cancer. This can be stressful to the client as well as our staff. Getting these results within 2 hours from an expert pathologist in VetConnect PLUS has been so valuable, especially in cases where the client would have been be waiting and worrying overnight. It allows us to discuss the results that same day, which helps client continuity if the doctor is out the next day. Providing earlier cytology results eases uncertainty, demonstrates our value, and builds our client-doctor bond,\" said Dr. Sonnya Dennis, Owner of Stratham-Newfields Veterinary Hospital in Newfields, NH, a pilot customer of the new in-house digital cytology service.  Many veterinarians currently perform cytology without the benefit of additional consultation, or they send prepared slides to a reference laboratory and wait several days for results. IDEXX Digital Cytology uses whole-slide imaging technology to easily capture a high‑resolution image of an entire slide whether via the in-clinic instrument or at the reference laboratory. This reduces the risk of missing a critical area of interest by enabling the entire diagnostic yield to be assessed by the pathologist. \"Everyone expects products and services to be delivered at warp speed,\" said Jay Mazelsky, President and Chief Executive Officer of IDEXX Laboratories. \"IDEXX Digital Cytology is our most recent innovation designed to bring reference laboratory-quality diagnostics to the point of care, speed up veterinary healthcare delivery, and advance the standard of care. As seen with chemistry, hematology, vector-borne disease testing, and beyond, we continue to accelerate the pace of veterinary medicine, while still ensuring veterinary teams, clients, and patients benefit from the same quality of world-class expertise, support, guidance, and connectivity expected from IDEXX.\"For more information on IDEXX Digital Cytology, go to idexx.com/digitalcyto. About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency, and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit idexx.com.Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at sec.gov and via IDEXX's website at idexx.com).CONTACTS:Media RelationsRobin Woodcock1-207-632-8027 robin-woodcock@idexx.comInvestor RelationsJohn Ravis 1-207-556-8155john-ravis@idexx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-launches-rapid-digital-cytology-service-to-further-accelerate-delivery-of-veterinary-healthcare-300988641.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Announces Senior Leadership Changes in Support of Global Companion Animal Group Growth",
        "subtitle": "",
        "date": "Jan 15, 2020 7:30AM EST",
        "content": "WESTBROOK, Maine, Jan. 15, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, today announced organizational changes to its global Companion Animal Group (\"CAG\") business aligned with leveraging best practices and execution capabilities to support global market development and sustained double-digit revenue growth. The following leadership changes in the Company's global CAG commercial organization will enhance its global CAG commercial efforts and foster greater integration and efficiencies across regions:  In addition, IDEXX is making the following organizational changes in its CAG lines of business: Under the enhanced organizational structure, which is effective immediately, the leadership team will continue to report to Jay Mazelsky, President and Chief Executive Officer.\"I am pleased to announce these well-deserved promotions and important changes to our leadership structure, which enhance our global integration efforts and execution capabilities across our CAG portfolio,\" said Jay Mazelsky, President and Chief Executive Officer of IDEXX Laboratories.  \"We have a deep and talented leadership team at IDEXX, and with our enhanced organizational structure, we are confident that IDEXX is well-positioned to drive continued market development and further adoption of diagnostics. We see tremendous opportunity for growth with a global addressable companion animal diagnostics market opportunity of over $30 billion, supported by the continued strengthening of the pet-owner bond, favorable demographic trends and improving standard of care. We remain committed to providing exceptional service to our customers while helping to advance the standard of care for pets as we continue in our mission to create exceptional long-term value for our customers, employees and shareholders.\" For more information about the IDEXX leadership team, go to: www.idexx.com/corporate/corporate-governance.html About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov and via IDEXX's website at www.idexx.com).ContactInvestor RelationsIDEXX LaboratoriesJohn Ravis1-207-556-8155john-ravis@idexx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-announces-senior-leadership-changes-in-support-of-global-companion-animal-group-growth-300987165.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories to Release 2019 Fourth Quarter and Full-Year Financial Results",
        "subtitle": "",
        "date": "Jan 10, 2020 11:30AM EST",
        "content": "WESTBROOK, Maine, Jan. 10, 2020 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, has scheduled the release of its 2019 fourth quarter and full-year financial results for Friday, January 31, 2020 before the market opens. The Company will host a conference call beginning at 8:30 a.m. ET on that day.Individuals can access a live webcast of the conference call through a link on the IDEXX website, www.idexx.com/investors. An archived edition of the webcast will be available after 1:00 p.m. ET on that day via the same link and will remain available for one year. The live call also will be accessible by telephone. To listen to the live conference call, please dial 1- 844-767-5679 or 1- 409-207-6967 and reference access code 176532. Replay of the conference call will be available through Friday, February 7, 2020 by dialing 1-866-207-1041 or 1- 402-970-0847 and referencing access code 8036553. About IDEXX Laboratories IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-to-release-2019-fourth-quarter-and-full-year-financial-results-300984985.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Announces Third Quarter Results",
        "subtitle": "",
        "date": "Oct 31, 2019 6:30AM EDT",
        "content": "WESTBROOK, Maine, Oct. 31, 2019 /PRNewswire/ --IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, reports revenues of $605 million for the third quarter of 2019, an increase of 11% on a reported basis, and 12% on an organic basis, including over 1% in growth benefit related to equivalent business day effects.Third quarter results were driven by CAG Diagnostics recurring revenue growth of 13% reported and 14% organic, including a nearly 2% growth benefit related to equivalent business day effects. CAG Diagnostics recurring revenue results reflected strong 13% reported and organic revenue growth in the U.S. and international revenue growth of 12% reported and 16% organic. Global results reflected strong double-digit growth in IDEXX VetLab® consumables, reference laboratory diagnostic and consulting services revenues, and high single-digit growth in rapid assay products revenues. IDEXX VetLab consumables revenue growth was supported by an 18% year-over-year increase in the Catalyst® chemistry analyzer installed base, benefiting from 1,270 placements at new and competitive accounts globally, a 23% year-over-year increase.  Overall organic revenue growth results in the third quarter were also supported by high single-digit organic growth in Water and livestock, poultry and dairy (\"LPD\") revenues.Earnings per diluted share (\"EPS\") was $1.24 for the third quarter, representing reported EPS growth of 18% and comparable constant currency EPS growth of 21%. These results reflected benefits from strong CAG Diagnostics recurring revenue gains, which supported a higher than projected 160 basis point improvement in operating margins on a reported basis and 130 basis points on a constant currency basis.The Company is updating its full year 2019 revenue growth outlook to 8% - 8.5% on a reported basis and 10% - 10.5% on an organic basis. This results in an increase of $5 million at midpoint, reflecting expectations for overall organic growth and CAG Diagnostics recurring organic revenue growth at the high end of previous estimates, incorporating strong third quarter results. This outlook is supported by expectations for CAG Diagnostics recurring reported revenue growth of 9.5% - 10% and organic revenue growth of 11.5% - 12%, consistent with strong year-to-date trends. The Company is lowering its 2019 EPS guidance range by $0.12 per share at mid-point to $4.72 - $4.78, as benefits from strong operating performance are offset by a projected $0.18 negative impact from CEO transition charges in the fourth quarter of 2019.  Our updated 2019 EPS guidance is for 11% - 12% in reported EPS growth, or 15% - 16% on a comparable constant currency basis. Our EPS outlook reflects expectations for full year operating margin improvement of 55 - 70 basis points on a constant currency basis, including 55 basis points of unfavorable impact related to CEO transition charges in the fourth quarter of 2019.The Company is providing preliminary 2020 guidance for reported and organic revenue growth of 9% - 10.5%, supported by sustained high growth CAG Diagnostics recurring revenues, and EPS of $5.30 - $5.46, supported by expectations of 100 - 150 basis points of constant currency operating margin expansion, including 50 basis points of benefit related to favorable comparisons to 2019 CEO transition charges. Reported 2020 EPS growth of 12% - 15% incorporates $0.11 of negative projected year-over-year impact from foreign exchange effects and a $0.12 year-over-year reduction in projected benefits from share-based compensation tax benefits. Adjusting for these impacts, the 2020 EPS guidance reflects projected year-over-year EPS growth of 17% - 20% on a comparable constant currency basis.\"IDEXX delivered outstanding operating results in the third quarter, supported by continued strong growth in CAG Diagnostics recurring revenues. Our high-return investments in our global commercial capability are driving the global adoption of our innovative products and services, including the rapid expansion of our Catalyst installed base and increased utilization of IDEXX's proprietary Fecal Dx® Antigen Panel and IDEXX SDMA® test,\" said Jay Mazelsky, the Company's President and Chief Executive Officer. Mazelsky continued,\" It is clear that our customers are benefiting from increased interaction and support from IDEXX engagement as we work together to advance the standard of companion animal healthcare.  We are building on this momentum with an eight percent expansion of our U.S. field commercial capability in the fourth quarter of this year, which will position us well to continue delivering strong financial results aligned with our long-term goals.\"Third Quarter Performance HighlightsCompanion Animal GroupThe Companion Animal Group generated 12% reported and 13% organic revenue growth for the quarter, supported by CAG Diagnostics recurring revenue growth of 13% reported and 14% organic, which included nearly 2% of growth benefit related to equivalent business day effects.Veterinary software, services and diagnostic imaging systems revenue grew 6% on a reported and organic basis, driven by growth in subscription-based service revenues, including continued expansion of our practice management platforms.  Overall segment growth was constrained by comparisons to very strong prior year digital imaging system placement levels.WaterWater achieved revenue growth of 5% on a reported basis and 7% on an organic basis in the third quarter, supported by solid volume growth across all regions.Livestock, Poultry and Dairy (\"LPD\")LPD generated revenue growth of 7% on a reported basis and 10% on an organic basis for the third quarter. These results reflected revenue gains across the product portfolio including increases in diagnostic testing in Asia from new testing programs and from testing associated with alternative food sources, such as poultry. Third quarter results also benefited from favorable comparisons to soft prior year revenue levels in the Asia region. These gains were partially offset by moderate declines in herd health screening, compared to strong prior year levels, and continued impacts on swine testing from the prolonged outbreak of African swine fever in China.Gross Profit and Operating ProfitGross profits increased 13% year-over-year, and gross margin was 57%, an increase of 100 basis points compared to prior year period results on a reported basis and 60 basis points on a constant currency basis. Gross margin improvement was supported by mix benefits from strong growth in IDEXX VetLab consumables revenue, reference laboratory productivity gains and continued moderate CAG Diagnostics recurring revenue net price gains.Operating margin was 23.1% in the quarter, 160 basis points higher than the prior year period results on a reported basis and 130 basis points on a constant currency basis, supported by gross margin gains and operating expense leverage on high revenue growth.  Operating expenses increased 9% on a reported basis and 10% on a constant currency basis, driven by increases in our CAG segment's sales and marketing costs and research and development spending.2019 and 2020 Financial OutlookThe following guidance for 2019 and 2020 reflects the assumptions that for the remainder of 2019 and the full year 2020, the value of foreign currencies will remain at the following rates in U.S. dollars:and relative to the U.S. dollar: Outlook for 2019We are updating our 2019 revenue outlook to $2,395 million - $2,405 million, reflecting expectations for reported revenue growth of 8% - 8.5% and organic revenue growth of 10% - 10.5%. At mid-point, the updated revenue outlook is $5 million above our previous guidance reflecting projected organic revenue growth at the higher end of our previous guidance range. Our outlook now reflects expectations for CAG Diagnostics recurring reported revenue growth of 9.5% - 10% and organic revenue growth of 11.5% - 12%. Modest benefits from a recently completed acquisition are offset by refinements to our foreign exchange rate assumptions. At the foreign exchange rate assumptions in 2019 noted above, we estimate that the effect of the stronger U.S. dollar will reduce full year 2019 reported revenue growth by approximately 2%.We are updating our 2019 EPS outlook to $4.72 - $4.78 per share, reflecting a decrease of $0.12 per share at mid-point, incorporating a projected $0.18 negative impact from CEO transition charges in the fourth quarter of 2019 and a negative $0.02 per share impact related to updated foreign exchange assumptions. These impacts are partially offset by $0.06 in operational improvement related to strong third quarter performance and lower projections for net interest costs, as well as $0.02 per share of improvement related to updated estimates for share-based compensation tax benefits. For the full year, we now expect a foreign exchange headwind of $0.06 per share, net of projected hedge gains of approximately $11.5 million in 2019. The updated outlook represents EPS growth of 11% - 12% on a reported basis, and 15% - 16% on a comparable constant currency growth basis.The Company continues to project free cash flow at approximately 60% - 65% of net income in 2019 and capital spending of approximately $160 million - $175 million, including an estimated $70 million of capital spending related to the completion of our Westbrook, Maine headquarters expansion and the relocation and expansion of our core laboratory in Germany.The Company provides the following updated guidance for 2019:Amounts in millions except per share data and percentagesWe now expect an effective tax rate of approximately 20%, including approximately 1% of impact related to CEO transition charges.  The effective tax rate outlook incorporates expectations for share-based compensation tax benefits of $15 million or approximately 300 basis points, resulting in EPS benefits of $0.17 per share. We continue to project a reduction in weighted average shares outstanding of approximately 1%, and now expect interest expense, net of interest income, of approximately $31.5 million reflecting current and projected borrowings.Preliminary Outlook for 2020The Company provides the following preliminary guidance for 2020:Amounts in millions except per share data and percentageThe Company's 2020 outlook is for continued strong overall organic revenue growth, supported by sustained high growth in CAG Diagnostics recurring revenues.At the foreign exchange rates assumed in this earnings release, we estimate that foreign exchange impacts will decrease 2020 reported revenue growth by approximately 0.5%, and EPS by approximately $0.11 per share, including impacts from comparisons to approximately $11.5 million of projected foreign exchange hedge gains in 2019.Our 2020 EPS outlook includes approximately $0.04 - $0.06 per share of projected benefit from share-based compensation tax benefits, $0.12 per share below higher than expected 2019 levels at midpoint. Our preliminary outlook for our effective tax rate is 21% - 22% and for a reduction in weighted average shares outstanding from continued stock repurchases of approximately 1%. We are projecting interest expense, net of interest income, of approximately $36 million, reflecting current and projected borrowings and the assumed continuation of current floating interest rate costs.Conference Call and Webcast InformationIDEXX Laboratories, Inc. will be hosting a conference call today at 8:30 a.m. (Eastern) to discuss its third quarter 2019 results and management's outlook. To participate in the conference call, dial 1-800-230-1096 or 1-612-332-0335 and reference confirmation code 472946. Replay of the conference call will be available through Thursday, November 7, 2019 by dialing 1-800-475-6701 or 1-320-365-3844 and referencing replay code 472946. Individuals can access a live webcast of the conference call through a link on the IDEXX website, www.idexx.com/investors. An archived edition of the webcast will be available after 1:00 p.m. (Eastern) on that day via the same link and will remain available for one year.About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Note Regarding Forward-Looking StatementsThis earnings release contains statements about the Company's business prospects and estimates of the Company's financial results for future periods that are forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Forward-looking statements are included above under \"2019 and 2020 Financial Outlook\", \"Outlook for 2019\", \"Preliminary Outlook for 2020\", and elsewhere and can be identified by the use of words such as \"expects\", \"may\", \"anticipates\", \"intends\", \"would\", \"will\", \"plans\", \"believes\", \"estimates\", \"projected\", \"should\", and similar words and expressions. Our forward-looking statements include statements relating to revenue growth and EPS outlooks; operating and free cash flow forecast; projected impact of foreign currency exchange rates; projected CEO transition charges and their impact; and projected operating margins and expenses, capital expenditures, commercial infrastructure expansion, gains from foreign currency hedging transactions, tax and EPS benefits from share-based compensation arrangements, effective tax rates, weighted average shares outstanding and interest expense. These statements are intended to provide management's expectation of future events as of the date of this earnings release; are based on management's estimates, projections, beliefs and assumptions as of the date of this earnings release; and are not guarantees of future performance. These forward-looking statements involve known and unknown risks and uncertainties that may cause the Company's actual results, levels of activity, performance or achievements to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, among other things, the matters described under the headings \"Business,\" \"Risk Factors,\" \"Legal Proceedings,\" \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Quantitative and Qualitative Disclosures About Market Risk\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2018 and in the corresponding sections of the Company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as well as those described from time to time in the Company's other filings with the U.S. Securities and Exchange Commission available at www.sec.gov. The Company specifically disclaims any obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise.Statement Regarding Non-GAAP Financial MeasuresThe following defines terms and conventions and provides reconciliations regarding certain measures used in this earnings release and/or the accompanying earnings conference call that are not required by, or presented in accordance with, generally accepted accounting principles in the United States of America (\"GAAP\"), otherwise referred to as non-GAAP financial measures. To supplement the Company's consolidated results presented in accordance with GAAP, the Company has disclosed non-GAAP financial measures that exclude or adjust certain items. Management believes these non-GAAP financial measures provide useful supplemental information for its and investors' evaluation of the Company's business performance and liquidity and are useful for period-over-period comparisons of the performance of the Company's business and its liquidity and to the performance and liquidity of our peers. While management believes that these non-GAAP financial measures are useful in evaluating the Company's business, this information should be considered as supplemental in nature and should not be considered in isolation or as a substitute for the related financial information prepared in accordance with GAAP. In addition, these non-GAAP financial measures may not be the same as similarly titled measures reported by other companies.Constant currency - Constant currency references are non-GAAP financial measures which exclude the impact of changes in foreign currency exchange rates and are consistent with how management evaluates our performance and comparisons with prior and future periods. We estimated the net impacts of currency on our revenue, gross profit, operating profit, and EPS results by restating results to the average exchange rates or exchange rate assumptions for the comparative period, which includes adjusting for the estimated impacts of foreign currency hedging transactions and certain impacts on our effective tax rates. These estimated currency changes impacted third quarter 2019 results as follows: decreased revenue growth by 1%, did not impact U.S. CAG Diagnostics recurring revenue growth, decreased international CAG Diagnostics recurring revenue growth by approximately 4%, decreased gross profit growth by approximately 1%, increased gross profit margin growth by 40 basis points, decreased operating expense growth by 1%, had an immaterial impact on operating profit growth, increased operating profit margin growth by 30 basis points, and had an immaterial impact on EPS growth. Estimated currency changes are also expected to decrease projected full year 2019 revenue growth by approximately 2%, decrease projected full year 2019 CAG Diagnostics recurring revenue growth by approximately 2%, increase projected 2019 operating profit margin growth by approximately 20 basis points, and decrease projected 2019 EPS growth by approximately 1%. Estimated currency changes are expected to decrease projected 2020 revenue growth by approximately 0.5%, decrease projected 2020 operating profit margin growth by 30 basis points and decrease projected 2020 EPS growth by 2%. Constant currency revenue growth represents the percentage change in revenue during the applicable period, as compared to the prior year period, excluding the impact of changes in foreign currency exchange rates. See the supplementary analysis of results below for revenue percentage change from currency for the three and nine months ended September 30, 2019.Growth and organic revenue growth - All references to growth and organic growth refer to growth compared to the equivalent prior year period unless specifically noted. Organic revenue growth is a non-GAAP financial measure that excludes the impact of changes in foreign currency exchange rates and revenue from certain business acquisitions. See the supplementary analysis of results below for a reconciliation of reported revenue growth to organic revenue growth for the three and nine months ended September 30, 2019.  See the constant currency note above for the impacts of estimated currency changes to the projected full year 2019 CAG Diagnostics recurring revenue growth and total revenue growth and projected full year 2020 revenue growth for the Company. The percentage change in revenue resulting from acquisitions represents incremental revenues attributable to business acquisitions that have occurred since the beginning of the prior year period. We exclude only acquisitions that are considered to be a business from organic revenue growth. For more detail on what acquisitions we consider to be a business in computing organic growth, please see Management's Discussion and Analysis of Financial Conditions and Results of Operations, Non-GAAP Financial Measures, contained in the Company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019. For the calculation of projected full year 2019 organic revenue growth and projected full year 2019 CAG Diagnostics recurring organic revenue growth, the impacts of revenue from acquisitions is immaterial. Revenue from acquisitions is expected to increase projected full year 2020 revenue growth by approximately 0.5%.Comparable constant currency EPS growth - Comparable constant currency EPS growth is a non-GAAP financial measure that excludes the tax benefits of share-based compensation activity under ASU 2016-09. Management believes comparable constant currency EPS growth is a more useful way to measure the Company's business performance than EPS growth because it enables better period-over-period comparisons of the fundamental financial results by excluding items that vary independent of performance and provides greater transparency to investors regarding a key metric used by management. Share-based compensation tax benefits are expected to increase projected EPS by $0.17 per share for the full year 2019 compared to $0.24 per share for the full year 2018, and increased third quarter 2019 EPS by $0.05 per share compared to $0.07 per share in the third quarter of 2018.  Share-based compensation tax benefits are expected to increase projected EPS by $0.05 per share for 2020. These impacts and those described in the constant currency note above reconcile reported EPS growth to comparable constant currency EPS growth for the Company.Free cash flow - Free cash flow is a non-GAAP financial measure and means, with respect to a measurement period, the cash generated from operations during that period, reduced by the Company's investments in property and equipment.  Management believes free cash flow is a useful measure because it indicates the cash the operations of the business are generating after appropriate reinvestment for recurring investments in property and equipment that are required to operate the business. See the supplementary analysis of results below for our calculation of free cash flow for the nine months ended September 30, 2019 and 2018. To estimate projected 2019 free cash flow, we have deducted projected purchases of property and equipment, also referred to as capital expenditures, of $160 million - $175 million.Debt to Adjusted EBITDA (Leverage Ratios) - Adjusted EBITDA, gross debt, and net debt are non-GAAP financial measures.  Adjusted EBITDA is a non-GAAP financial measure of earnings before interest, taxes, depreciation, amortization and certain other non-cash charges.  Management believes that using Adjusted EBITDA, gross debt and net debt in the Adjusted EBITDA ratio is a useful and recognized measure for evaluating financial leverage.  For further information on how Adjusted EBITDA and the Debt to Adjusted EBITDA Ratio are calculated, see the Company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019.Notes and DefinitionsCEO Transition Charges - Effective November 1, 2019, Jonathan W. Ayers, our Chairman and former President and Chief Executive Officer, who has been on a medical leave of absence since June 28, 2019, will step down as Chairman of our Board, cease to be an employee of the Company and transition to the role of external Senior Advisor to the Company.  Mr. Ayers will continue to serve as a member of our Board. In connection with a mutual separation agreement between the Company and Mr. Ayers, we expect to recognize charges to operating income of approximately $13.4 million in the fourth quarter of 2019, representing the cost of severance payments and an acceleration of the cost of his equity awards. In addition, we expect to increase our provision for income taxes by approximately $2.1 million, including a reduction of deferred tax assets related to previously recognized stock option tax benefits, resulting in a total charge to net income of approximately $15.5 million, net of tax impacts.                         Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-announces-third-quarter-results-300948681.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Announces Leadership Changes",
        "subtitle": "Jay Mazelsky Appointed President and Chief Executive Officer and Elected to IDEXX Board",
        "date": "Oct 24, 2019 7:30AM EDT",
        "content": "WESTBROOK, Maine, Oct. 24, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, today announced that Jonathan Ayers is stepping down as Chairman and a member of the IDEXX management team, effective November 1, 2019. This decision follows Mr. Ayers's previously announced medical leave of absence from IDEXX due to a bicycling accident, where he suffered a spinal cord injury. The IDEXX Board of Directors has appointed Jonathan (Jay) Mazelsky, who has been serving as Interim President and Chief Executive Officer since June 28, 2019, as President and Chief Executive Officer, effective immediately. Mr. Mazelsky has also been elected to the IDEXX Board. Lawrence Kingsley, Lead Director, has been appointed as Independent Chairman of the IDEXX Board, effective November 1, 2019. Mr. Ayers will continue as a member of the IDEXX Board and serve as a Senior Advisor to the Company.Mr. Ayers said, \"While the nature of my spinal cord injury and my continuing need to focus on an extended rehabilitation process preclude me from returning to IDEXX as CEO, my passion for the Company and its Purpose has not diminished. I am extremely proud of the significant long-term value we have created during my 17-year tenure with IDEXX, and it has been a true privilege to work with our outstanding management team, Board and employees. I am delighted with Jay's appointment as President and CEO and have complete confidence in his ability to lead IDEXX forward. I look forward to continuing to support the Company as a member of the Board and as a Senior Advisor, and I know much success lies ahead for IDEXX.\"\"On behalf of the Board, management team and employees of IDEXX, I thank Jon for his leadership, vision and unwavering commitment over his distinguished career at the Company,\" said Mr. Kingsley. \"Under Jon's guidance and stewardship, IDEXX has built a strong foundation for growth and the Company is well-positioned to drive continued innovation, accelerate product development and enhance profitability. We look forward to Jon's continued meaningful contributions to IDEXX as a Board member and Senior Advisor, and we wish him all the best as he continues his rehabilitation process.\" Mr. Kingsley concluded, \"Jay is an exceptionally talented and well-respected leader with deep industry experience and institutional knowledge, and the Board is confident that his expertise and strategic insight make him the ideal candidate to succeed Jon in the CEO role. Jay has done an outstanding job in the past four months since he assumed the responsibilities of President and CEO on an interim basis, and we look forward to IDEXX's continued growth and success under his leadership.\"Mr. Mazelsky stated, \"I am thrilled to lead IDEXX and I look forward to further building on our progress and driving enduring long-term value for shareholders and customers by advancing our Purpose to enhance the health and well-being of pets, people and livestock. I thank Jon for his mentorship and leadership of the Company and look forward to his continued contributions as a Board member and Senior Advisor.\"About Jay MazelskyPrior to his appointment as Interim President and Chief Executive Officer of IDEXX, Mr. Mazelsky, 59, was an Executive Vice President responsible for the Company's North American Companion Animal Group Commercial Organization and key elements of the innovation portfolio, including IDEXX's global in-house diagnostics and Veterinary Software and Service's businesses. He joined IDEXX in August 2012 as Executive Vice President. From 2010 to 2012, Mr. Mazelsky was a Senior Vice President and General Manager of Computed Tomography, Nuclear Medicine and Radiation Therapy Planning at Philips Healthcare, a subsidiary of Royal Philips Electronics. He holds an undergraduate degree in Mathematics from the University of Rochester and an M.B.A from The University of Chicago Booth School of Business. About Lawrence KingsleyMr. Kingsley served as Chairman of Pall Corporation from 2013 to 2015 and as Chief Executive Officer of Pall Corporation from 2011 to 2015, and he has served as an Advisory Director to Berkshire Partners LLC, a Boston-based investment firm, since spring of 2016. Prior to that, Mr. Kingsley was the Chief Executive Officer and a member of the Board of Directors of IDEX Corporation, a company specializing in fluid and metering technologies, health and science technologies and fire, safety and other diversified products, from 2005 to 2011, and the Chief Operating Officer of IDEX from August 2004 to March 2005. From 1995 to 2004, he held various positions of increasing responsibility at Danaher Corporation, including Corporate Vice President and Group Executive of Danaher Corporation. Mr. Kingsley has been a director on the Board of Polaris Industries Inc. since 2016 and Rockwell Automation, Inc. since 2013. Mr. Kingsley holds an undergraduate degree in Industrial Engineering and Management from Clarkson University and an M.B.A. from the College of William and Mary.About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit:  www.idexx.comNote Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov and via IDEXX's website at www.idexx.com).ContactInvestor Relations IDEXX Laboratories John Ravis 1-207-556-8155 john-ravis@idexx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-announces-leadership-changes-300944785.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories to Release 2019 Third Quarter Financial Results",
        "subtitle": "",
        "date": "Oct 10, 2019 1:30PM EDT",
        "content": "WESTBROOK, Maine, Oct. 10, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, has scheduled the release of its 2019 third quarter financial results for Thursday, October 31, 2019 before the market opens. The Company will conduct an analyst conference call beginning at 8:30 a.m. ET on that day. Individuals can access a live webcast of the conference call through a link on the IDEXX website, www.idexx.com/investors. An archived edition of the webcast will be available after 1:00 p.m. ET on that day via the same link and will remain available for one year. The live call also will be accessible by telephone. To listen to the live conference call, please dial 1-800-230-1096 or 1-612-332-0335 and reference confirmation code 472946. Replay of the conference call will be available through Thursday, November 7, 2019 by dialing 1-800-475-6701 or 1-320-365-3844 and referencing replay code 472946. About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-to-release-2019-third-quarter-financial-results-300936688.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Breakthrough Kidney Function Test Now Key Component of IRIS Staging Guidelines",
        "subtitle": "",
        "date": "Oct 2, 2019 7:30AM EDT",
        "content": "New guidelines enhance the ability of veterinarians to assess renal function   WESTBROOK, Maine, Oct. 2, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics and software, today announced that SDMA-based chronic kidney disease (CKD) staging guidelines have now been generated and approved by the International Renal Interest Society (IRIS). IDEXX is working with IRIS to support clinicians in realizing the clinical utility of the SDMA test and in creating tools that help shape the future of veterinary medicine and patient care. This much-anticipated development will help veterinarians assess kidney function with reliable, quantitative guidelines. This update reflects the evolution of the veterinary profession's understanding of the utility of SDMA since it was first added to the IRIS CKD staging guidelines in 2015.To date, SDMA has helped veterinarians detect kidney function in more than 20 million cats and dogs and has transformed the way renal health is addressed in veterinary medicine. A persistently elevated SDMA concentration is an indication of a decreased glomerular filtration rate (GFR). Therefore, it detects loss of kidney function as a result of kidney diseases or secondary disease processes that impact kidney function. For these reasons, SDMA increases the clinician's ability to monitor kidney function and helps them to accurately stage chronic kidney disease.\"As the leader in nephrology, IRIS has a responsibility to provide practicing veterinarians with evidence-based guidance for diagnosing, treating, and managing kidney diseases. Our responsibility includes providing the most useful direction in how to interpret diagnostic information,\" said Dr. Gregory F. Grauer, President of the IRIS Board of Directors. \"The inclusion of SDMA-based staging guidelines is the next step in our understanding of this important indicator of kidney function. Using both serum creatinine and SDMA could enhance one's ability to evaluate renal function as they are complementary to each other.\"Many veterinarians have already adopted SDMA into their practices and have successfully used the innovative diagnostic as part of their protocols to support better patient care. With the updated IRIS staging guidelines, veterinarians will be able to more accurately understand the utility of SDMA and how to interpret it. \"The expansion of IRIS staging to SDMA-based guidelines is a further proof point for this novel biomarker. IRIS has recognized how SDMA reflects kidney function. These updated SDMA-based staging guidelines will support clinicians in managing their CKD patients by staging and treating this condition appropriately,\" said Jay Mazelsky, interim President and Chief Executive Officer of IDEXX Laboratories. \"We're thrilled to partner with IRIS on this important development that we know will help more veterinarians improve the standard of care by incorporating SDMA into their workflow.\"The IRIS CKD Staging Guidelines can be found on the IRIS website. About IDEXX Laboratories, Inc.IDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency, and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: idexx.com. About IRISIRIS is the International Renal Interest Society. IRIS was created to advance the scientific understanding of kidney disease in small animals. It was originally organized at the 8th Annual Congress of the European Society of Veterinary Internal Medicine in Vienna, Austria, in 1998, with the support of Novartis Animal Health acquired by and now supported by Elanco Animal Health, a Division of Eli Lilly and Company, which provides funding and organizational assistance.IRIS is led by a board of 15 independent veterinarians with particular expertise in nephrology, from 11 different countries. The mission of IRIS is to help veterinary practitioners better diagnose, understand, and treat renal disease in cats and dogs. In order to achieve this mission, the group investigates ways to accurately diagnose early signs of chronic renal disease and explores novel therapies for these diseases.One of the organization's primary objectives is to establish an internationally recognized set of guidelines on the diagnosis and treatment of renal disease in small animals.As there is still much to learn in the field of veterinary nephrology, the members of the IRIS Board are dedicated to scientific efforts to study renal disease in order to advance our approach to this important problem.Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of some of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov and via IDEXX's website at www.idexx.com).CONTACTS:Media RelationsIzzy Forman207-210-8161 izzy-forman@idexx.com Investor RelationsJohn Ravis 207-556-3502john-ravis@idexx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-breakthrough-kidney-function-test-now-key-component-of-iris-staging-guidelines-300929033.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories to Host 2019 Investor Day",
        "subtitle": "",
        "date": "Aug 6, 2019 2:00PM EDT",
        "content": "WESTBROOK, Maine, Aug. 6, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, will host its 2019 Investor Day on August 14-15, 2019 at its corporate headquarters in Westbrook, Maine. A live audio webcast and accompanying slide presentations will be available at www.idexx.com/investors. An archived webcast replay of the event will be available approximately one hour following each event at www.idexx.com/investors. On August 14 from 3:00 p.m. to approximately 4:45 p.m. EDT, Jay Mazelsky, Interim President and Chief Executive Officer, and Brian McKeon, Executive Vice President and Chief Financial Officer, will discuss the overall companion animal diagnostic market, IDEXX's long-term growth strategy and provide an IDEXX financial overview. On August 15 from 8:00 a.m. to approximately 11:45 a.m. EDT, members of IDEXX's senior leadership team, including Tina Hunt, Corporate Vice President; Mike Lane, Corporate Vice President; Jim Polewaczyk, Corporate Vice President; and Kathy Turner, Corporate Vice President, will discuss growth strategies in IDEXX's Companion Animal Group. In addition, Corporate Vice President George Fennell will moderate a discussion with an IDEXX customer and veterinary diagnostic consultant on preventive care. The meeting will conclude with a question and answer session.While attendance at this event is open to professional investors by invitation only, we invite all investors to listen to the live audio webcast.About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX Laboratories employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-to-host-2019-investor-day-300897333.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Elects Sam Samad to Board of Directors",
        "subtitle": "",
        "date": "Jul 18, 2019 4:00PM EDT",
        "content": "WESTBROOK, Maine, July 18, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, announced today the election of Sam Samad, the Senior Vice President and Chief Financial Officer of Illumina, Inc., as a member of the Company's Board of Directors, effective July 16, 2019.\"We are very pleased to welcome Sam to our Board of Directors,\" said Larry Kingsley, the Company's Independent Lead Director. \"Sam's extensive financial expertise and international operational experience at innovative, R&D focused life science and health industry growth companies will be extremely valuable to IDEXX as we continue to advance the Company's Purpose to enhance the health and well-being of pets, people and livestock.\"\"IDEXX's focus on innovation in pet diagnostics and software has yielded strong financial returns,\" said Mr. Samad. \"I am excited to join the Board of this dynamic company and look forward to working closely with the IDEXX directors and leadership team to achieve the Company's goals and continue to build long-term value for our shareholders.\"Mr. Samad has served as the Senior Vice President and Chief Financial Officer of Illumina, Inc. since January 2017. Before joining Illumina, Mr. Samad held several senior leadership positions at Cardinal Health between November 2007 and January 2017, including Senior Vice President and Corporate Treasurer from February 2012 to January 2017, with leadership responsibility for Cardinal Health's China business. He was previously Senior Vice President and Chief Financial Officer for the pharmaceutical segment of Cardinal from 2009 to 2012, and Vice President, Healthcare Supply Chain Services. He also previously held finance roles at Eli Lilly and Pepsico Inc. Mr. Samad received his Bachelor of Business Administration degree from the American University of Beirut in Lebanon and his Master of Business Administration degree from McMaster University in Hamilton, Canada.About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency, and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov and via IDEXX's website at www.idexx.com).Contact: Investor Relations: John Ravis1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-elects-sam-samad-to-board-of-directors-300887612.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories to Release 2019 Second Quarter Financial Results",
        "subtitle": "",
        "date": "Jul 15, 2019 2:00PM EDT",
        "content": "WESTBROOK, Maine, July 15, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, has scheduled the release of its 2019 second quarter financial results for Thursday, August 1, 2019 before the market opens. The Company will conduct an analyst conference call beginning at 8:30 a.m. ET on that day. Individuals can access a live webcast of the conference call through a link on the IDEXX website, www.idexx.com/investors. An archived edition of the webcast will be available after 1:00 p.m. ET on that day via the same link and will remain available for one year. The live call also will be accessible by telephone. To listen to the live conference call, please dial 1-800-230-1093 or 1-612-288-0337 and reference confirmation code 470018. Replay of the conference call will be available through Thursday, August 8, 2019 by dialing 1-800-475-6701 or 1-320-365-3844 and referencing replay code 470018. About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-to-release-2019-second-quarter-financial-results-300884854.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories Chairman, President and Chief Executive Officer, Jonathan Ayers, Taking Medical Leave of Absence",
        "subtitle": "Jay Mazelsky, Executive Vice President, Companion Animal Group, Appointed Interim President and Chief Executive Officer",
        "date": "Jul 1, 2019 8:30AM EDT",
        "content": "WESTBROOK, Maine, July 1, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, today announced that Chairman, President and Chief Executive Officer, Jonathan Ayers, is on a medical leave of absence following a serious bicycling accident that occurred on June 27, 2019. Effective June 28, 2019, the IDEXX Board of Directors has appointed Jay Mazelsky as Interim President and Chief Executive Officer. Mr. Mazelsky will assume Mr. Ayers's day-to-day management responsibilities and work closely with Brian McKeon, Chief Financial Officer, who will continue to be responsible for the Company's finances and investor relations. Larry Kingsley, independent Lead Director of the IDEXX Board, will provide additional support to Jay, Brian and the management team.\"First and foremost, we support Jon and his family and wish him a speedy and full recovery,\" said Mr. Kingsley, Lead Director of the IDEXX Board. \"Jon is a passionate, dedicated and well-respected leader of IDEXX. Jon has expressed his confidence in Jay, Brian and IDEXX's talented leadership team to continue to advance the Company's Purpose to enhance the health and well-being of pets, people, and livestock. IDEXX is well-positioned for the future, and the Board is confident that IDEXX's extremely capable executives and employees will continue successfully executing the Company's strategy and creating value for shareholders.\"About Jay MazelskyPrior to his appointment as Interim President and Chief Executive Officer of IDEXX, Mr. Mazelsky, 58, has been an Executive Vice President since joining IDEXX in August 2012. In addition to his day-to-day management responsibilities as Interim President and Chief Executive Officer, he oversees the Company's North American Companion Animal Group Commercial Organization and key elements of the innovation portfolio, including IDEXX's global in-house diagnostics and Veterinary Software and Service's businesses. From 2007 to 2012, Mr. Mazelsky was a Senior Vice President and General Manager of a number of businesses at Philips Healthcare. About Brian McKeonMr. McKeon, 57, has been Executive Vice President, Chief Financial Officer, and Treasurer since January 2014. He leads IDEXX's finance, corporate development and strategy and worldwide operations functions. Mr. McKeon served as a Director of IDEXX from July 2003 through December 2013, including serving as Chair of the Audit Committee and as a member of the Compensation Committee.About IDEXX LaboratoriesIDEXX Laboratories, Inc.  is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX and additional background on Mr. Mazelsky and Mr. McKeon, visit: www.idexx.com. Note Regarding Forward-Looking Statements This news release contains or may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the use of words such as \"expects,\" \"may,\" \"anticipates,\" \"intends,\" \"would,\" \"will,\" \"plans,\" \"believes,\" \"estimates,\" \"should,\" \"project,\" and similar words and expressions. These forward-looking statements are intended to provide our current expectation or forecasts of future events; are based on current estimates, projections, beliefs, and assumptions; and are not guarantees of future performance. Actual events or results may differ materially from those described in the forward-looking statements, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by IDEXX pursuant to United States securities laws contain discussions of these risks and uncertainties. IDEXX assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review IDEXX's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov and via IDEXX's website at www.idexx.com).Contact: Investor Relations:  John Ravis  1-207-556-8155  john-ravis@idexx.com  View original content:http://www.prnewswire.com/news-releases/idexx-laboratories-chairman-president-and-chief-executive-officer-jonathan-ayers-taking-medical-leave-of-absence-300878442.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX CEO Establishes Wild Cat Conservation Foundation",
        "subtitle": "",
        "date": "Apr 23, 2019 6:00AM EDT",
        "content": "WESTBROOK, Maine, April 23, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics and software, today announced that its Chairman and Chief Executive Officer, Jonathan Ayers, and his wife, Helaine, have established a foundation that will support conservation of the estimated 40 species of felids in the wild. The Ayers Wild Cat Conservation Trust is endowed by a gift of IDEXX stock from the Ayers family. The foundation will focus on supporting the funding of global wild cat species conservation initiatives and organizations.\"We lionize cats such as jaguars, leopards, and cheetahs in popular culture—and yet felid species in the wild are threatened with declining populations and, in time, extinction. We need to do more to preserve their populations in their natural habitat,\" said Ayers. \"Helaine and I believe in the importance of dedicated species conservation efforts, and we hope that our foundation will help to support the vitality of wild cats, their natural habitats, and the professionals dedicated to them in a meaningful way for years to come.\"While the foundation's purpose is to support conservation initiatives for all species of wild cats, a specific focus will be on the 33 species of small cats, which currently receive only a small fraction of all wild cat conservation funding. Many of these felid species are endangered or vulnerable with declining populations, and include the clouded leopard, the black-footed cat, the sand cat, and the fishing cat. The foundation will fund initiatives such as the Panthera Small Cats Program, which the Ayers family has helped to establish. Panthera is devoted exclusively to the conservation of the world's 40 wild cat species and their ecosystems. The first foundation grants are expected to be made this year.The foundation's initial endowment has been established using IDEXX stock that Ayers purchased on the open market in 2002 and 2003. The foundation has no formal affiliation with IDEXX Laboratories. Media RelationsRobin Woodcock207-632-8027robin-woodcock@idexx.com Investor RelationsJohn Ravis207-556-8155john-ravis@idexx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-ceo-establishes-wild-cat-conservation-foundation-300834927.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "IDEXX Laboratories to Release 2019 First Quarter Financial Results",
        "subtitle": "",
        "date": "Apr 2, 2019 11:30AM EDT",
        "content": " WESTBROOK, Maine, April 2, 2019 /PRNewswire/ -- IDEXX Laboratories, Inc. (NASDAQ: IDXX), a global leader in veterinary diagnostics, veterinary practice software and water microbiology testing, has scheduled the release of its 2019 first quarter financial results for Wednesday, May 1, 2019 before the market opens. The Company will conduct an analyst conference call beginning at 8:30 a.m. ET on that day. Individuals can access a live webcast of the conference call through a link on the IDEXX website, www.idexx.com/investors. An archived edition of the webcast will be available after 1:00 p.m. ET on that day via the same link and will remain available for one year. The live call also will be accessible by telephone. To listen to the live conference call, please dial 1-800-230-1092 or 1-612-288-0337 and reference confirmation code 465882. Replay of the conference call will be available through Wednesday, May 8, 2019 by dialing 1-800-475-6701 or 1-320-365-3844 and referencing replay code 465882. About IDEXX LaboratoriesIDEXX Laboratories, Inc. is a member of the S&P 500® Index and is a leader in pet healthcare innovation, serving practicing veterinarians around the world with a broad range of diagnostic and information technology-based products and services. IDEXX products enhance the ability of veterinarians to provide advanced medical care, improve staff efficiency and build more economically successful practices. IDEXX is also a worldwide leader in providing diagnostic tests and information for livestock and poultry and tests for the quality and safety of water and milk. Headquartered in Maine, IDEXX employs more than 8,000 people and offers products to customers in over 175 countries. For more information about IDEXX, visit: www.idexx.com.Contact: John Ravis, Investor Relations, 1-207-556-8155 View original content to download multimedia:http://www.prnewswire.com/news-releases/idexx-laboratories-to-release-2019-first-quarter-financial-results-300823037.htmlSOURCE  IDEXX Laboratories, Inc."
    },
    {
        "title": "Consolidated Research: 2019 Summary Expectations for First Data, IDEXX Laboratories, CMS Energy, Worthington Industries, Triumph Group, and Cara Therapeutics — Fundamental Analysis, Key Performance Indications",
        "subtitle": "",
        "date": "Jan 24, 2019 8:10AM EST",
        "content": "NEW YORK, Jan. 24, 2019 (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Market Source Research released its latest key findings for all current investors, traders, and shareholders of First Data Corporation (NYSE:FDC), IDEXX Laboratories, Inc. (NASDAQ:IDXX), CMS Energy Corporation (NYSE:CMS), Worthington Industries, Inc. (NYSE:WOR), Triumph Group, Inc. (NYSE:TGI), and Cara Therapeutics, Inc. (NASDAQ:CARA), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.Complimentary Access: Research ReportsFull copies of recently published reports are available to readers at the links below.FDC DOWNLOAD: http://MarketSourceResearch.com/register/?so=FDCIDXX DOWNLOAD: http://MarketSourceResearch.com/register/?so=IDXXCMS DOWNLOAD: http://MarketSourceResearch.com/register/?so=CMSWOR DOWNLOAD: http://MarketSourceResearch.com/register/?so=WORTGI DOWNLOAD: http://MarketSourceResearch.com/register/?so=TGICARA DOWNLOAD: http://MarketSourceResearch.com/register/?so=CARA(You may have to copy and paste the link into your browser and hit the [ENTER] key)The new research reports from Market Source Research, available for free download at the links above, examine First Data Corporation (NYSE:FDC), IDEXX Laboratories, Inc. (NASDAQ:IDXX), CMS Energy Corporation (NYSE:CMS), Worthington Industries, Inc. (NYSE:WOR), Triumph Group, Inc. (NYSE:TGI), and Cara Therapeutics, Inc. (NASDAQ:CARA) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.-----------------------------------------Important Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed January 22nd, 2019. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.-----------------------------------------FIRST DATA CORPORATION ( FDC ) REPORT OVERVIEWFirst Data's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, First Data reported revenue of $2,369.00MM vs $3,076.00MM (down 22.98%) and analysts estimated basic earnings per share $0.43 vs $0.32 (up 34.38%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, First Data reported revenue of $12,052.00MM vs $11,584.00MM (up 4.04%) and analysts estimated basic earnings per share $1.60 vs $0.47 (up 240.43%). Analysts expect earnings to be released on February 11th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.38. The estimated EPS forecast for the next fiscal year is $1.38 and is expected to report on February 11th, 2019.To read the full First Data Corporation ( FDC ) report, download it here: http://MarketSourceResearch.com/register/?so=FDC-----------------------------------------IDEXX LABORATORIES, INC. ( IDXX ) REPORT OVERVIEWIDEXX Laboratories' Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, IDEXX Laboratories reported revenue of $545.45MM vs $491.98MM (up 10.87%) and analysts estimated basic earnings per share $1.07 vs $0.81 (up 32.10%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, IDEXX Laboratories reported revenue of $1,969.06MM vs $1,775.42MM (up 10.91%) and analysts estimated basic earnings per share $3.00 vs $2.47 (up 21.46%). Analysts expect earnings to be released on February 1st, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $0.77. The estimated EPS forecast for the next fiscal year is $4.68 and is expected to report on February 1st, 2019.To read the full IDEXX Laboratories, Inc. ( IDXX ) report, download it here: http://MarketSourceResearch.com/register/?so=IDXX-----------------------------------------CMS ENERGY CORPORATION ( CMS ) REPORT OVERVIEWCMS Energy's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, CMS Energy reported revenue of $1,599.00MM vs $1,527.00MM (up 4.72%) and analysts estimated basic earnings per share $0.60 vs $0.61 (down 1.64%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, CMS Energy reported revenue of $6,583.00MM vs $6,399.00MM (up 2.88%) and analysts estimated basic earnings per share $1.64 vs $1.99 (down 17.59%). Analysts expect earnings to be released on January 31st, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $0.51. The estimated EPS forecast for the next fiscal year is $2.51 and is expected to report on January 31st, 2019.To read the full CMS Energy Corporation ( CMS ) report, download it here: http://MarketSourceResearch.com/register/?so=CMS-----------------------------------------WORTHINGTON INDUSTRIES, INC. (WOR) REPORT OVERVIEWWorthington Industries' Recent Financial PerformanceFor the three months ended November 30th, 2018 vs November 30th, 2017, Worthington Industries reported revenue of $958.23MM vs $871.27MM (up 9.98%) and basic earnings per share $0.59 vs $0.64 (down 7.81%). For the twelve months ended May 31st, 2018 vs May 31st, 2017, Worthington Industries reported revenue of $3,581.62MM vs $3,014.11MM (up 18.83%) and analysts estimated basic earnings per share $3.20 vs $3.28 (down 2.44%). Analysts expect earnings to be released on April 4th, 2019. The report will be for the fiscal period ending February 28th, 2019. The reported EPS for the same quarter last year was $0.61. The estimated EPS forecast for the next fiscal year is $3.31 and is expected to report on June 26th, 2019.To read the full Worthington Industries, Inc. (WOR) report, download it here: http://MarketSourceResearch.com/register/?so=WOR-----------------------------------------TRIUMPH GROUP, INC. ( TGI ) REPORT OVERVIEWTriumph Group's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Triumph Group reported revenue of $855.11MM vs $745.16MM (up 14.76%) and analysts estimated basic earnings per share -$0.30 vs -$0.11. For the twelve months ended March 31st, 2018 vs March 31st, 2017, Triumph Group reported revenue of $3,198.95MM vs $3,532.80MM (down 9.45%) and analysts estimated basic earnings per share -$8.60 vs -$0.87. Analysts expect earnings to be released on February 7th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.76. The estimated EPS forecast for the next fiscal year is $1.85 and is expected to report on May 9th, 2019.To read the full Triumph Group, Inc. ( TGI ) report, download it here: http://MarketSourceResearch.com/register/?so=TGI-----------------------------------------CARA THERAPEUTICS, INC. ( CARA ) REPORT OVERVIEWCara Therapeutics' Recent Financial PerformanceFor the twelve months ended December 31st, 2017 vs December 31st, 2016, Cara Therapeutics reported revenue of $0.91MM vs $0.09MM (up 959.30%) and analysts estimated basic earnings per share -$1.86 vs -$2.10. Analysts expect earnings to be released on March 21st, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was -$0.43. The estimated EPS forecast for the next fiscal year is -$2.26 and is expected to report on March 21st, 2019.To read the full Cara Therapeutics, Inc. ( CARA ) report, download it here: http://MarketSourceResearch.com/register/?so=CARA-----------------------------------------ABOUT MARKET SOURCE RESEARCHMarket Source Research delivers the key research reports that helps serious investors, registered brokers, professional traders, and personal investment advisers find reliable information in today's markets. Market Source Research's team is comprised of financial professionals, many of which hold Chartered Financial Analyst® (CFA®) designations and FINRA® BrokerCheck® certifications. Whether identifying emerging trends, or discovering new opportunity, the team at Market Source Research is dedicated to providing accurate, informative, and objective content that's ahead of the curve. With insights on individual companies as well as sectors, readers get the industry's best available combination of big-picture perspective as well as granular detail.REGISTERED MEMBER STATUSMarket Source Research's oversight and audit staff are registered analysts, brokers, and/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Market Source Research's roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Market Source Research have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Market Source Research's Compliance department by Phone, at +1 (704) 343-6361, or by E-mail at compliance@MarketSourceResearch.com.LEGAL NOTICESInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Market Source Research, Market Source Research members, and/or Market Source Research affiliates are not responsible for any gains or losses that result from the opinions expressed. Market Source Research makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Market Source Research has not been compensated for the publication of this press release by any of the above mentioned companies. Market Source Research is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.Media Contact:Hugo Moreau, Media DepartmentOffice: +1 (704) 343-6361E-mail: media@MarketSourceResearch.com© 2019 Market Source Research. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@MarketSourceResearch.com.CFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.FINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.Source: Market Source Research"
    }
]