[
    {
        "title": "Illumina Files Additional Patent Infringement Suit Against BGI in the U.S.",
        "subtitle": "",
        "date": "Feb 27, 2020 4:05PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) today announced that it has filed a patent infringement suit relating to BGI’s “CoolMPS” sequencing products. The complaint was filed against BGI Genomics Co., Ltd., BGI Americas Corp., MGI Tech Co., Ltd., MGI Americas, Inc. and Complete Genomics Inc. in the United States District Court for the Northern District of California alleging infringement of three patents: US Patent Nos. 7,541,444; 7,771,973; and 10,480,025. The complaint seeks, among other things, damages, injunctive relief and attorney fees. The patents cover Illumina’s proprietary sequencing-by-synthesis chemistry.\n\n“BGI has brazenly copied Illumina’s proprietary sequencing chemistry. Illumina’s patent portfolio reflects the incredible innovation of Illumina’s employees and the investment of hundreds of millions of dollars that Illumina spends annually on research and development,” said Charles Dadswell, SVP and General Counsel for Illumina. “We will continue to monitor and defend our intellectual property by appropriate enforcement when our patents are infringed.”\n\nRelated patent suits are pending in Denmark, Germany, Sweden, Switzerland, Turkey, the UK and the U.S. Counterparts to these newly asserted patents have been upheld by the U.S. Patent Trial and Appeal Board and the European Patent Office over challenges filed by BGI, Complete Genomics and others.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005919/en/\nIllumina, Inc.\nInvestors:\nJacquie Ross, CFA\n+1-858-255-5243\nir@illumina.com\n\nMedia – U.S.:\nTina Amirkiai\n858-882-6822\npr@illumina.com\nor\nMedia – Europe, Middle East and Africa:\nKaren Birmingham\n+44(0) 7500105665\nkbirmingham@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina to Webcast Upcoming Investor Conference Presentations",
        "subtitle": "",
        "date": "Feb 12, 2020 4:22PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ:ILMN) today announced that its executives will be speaking at the following investor conferences and invited investors to participate via webcast.\n\nSVB Leerink Global Healthcare Conference in New York, NY\nWednesday, February 26, 2020 at 11:00 a.m. Eastern Time\n\nCowen Annual Health Care Conference in Boston, MA\nTuesday, March 3, 2020 at 11:20 a.m. Eastern Time\n\nThe live webcasts can be accessed in the Investor Relations section of Illumina's web site under the \"company\" tab at www.illumina.com. A replay of the presentations will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200212005895/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Dr. Scott Gottlieb, former US FDA Commissioner, joins Illumina’s Board of Directors",
        "subtitle": "",
        "date": "Feb 6, 2020 4:05PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) announced today that Scott Gottlieb, M.D. has joined the company’s Board of Directors, effective February 4, 2020. Dr. Gottlieb is currently a special partner at the venture capital firm New Enterprise Associates (NEA) and a resident fellow at the American Enterprise Institute (AEI). From 2017 to 2019, he served as the 23rd commissioner of the Food and Drug Administration (FDA).\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200206005292/en/Scott Gottlieb, M.D. (Photo: Business Wire)\nDuring his time at the FDA, Dr. Gottlieb helped make the regulatory process for the development and review of novel drug and medical devices more efficient, including the approval of the first gene-therapy-based cancer treatments. He advanced the FDA’s Oncology Center for Excellence and helped implement the 21st Century Cures Act to accelerate medical product development. He also presided over a record number of approvals for generic and new drugs and novel medical devices, and advanced other efforts to promote food safety, vaccinations, reduce smoking rates, and address opioid addiction.\n\nDr. Gottlieb previously served as the agency’s deputy commissioner for medical and scientific affairs, and as a senior adviser for medical technology to the FDA Commissioner. He also served as senior policy adviser to the administrator at the Centers for Medicare & Medicaid Services. Prior to joining the FDA as commissioner, he was a clinical assistant professor at New York University School of Medicine. Earlier, he was a practicing physician and hospitalist concurrently with his AEI work.\n\n“I am excited to welcome Scott to Illumina’s Board of Directors,” said Francis deSouza, Illumina’s Chief Executive Officer. “Illumina will benefit from Scott’s expertise in healthcare and public policy as we work to accelerate the adoption and impact of genomics into the standard of care in oncology, reproductive health and other clinical areas.”\n\nDr. Gottlieb has a medical degree from Mount Sinai School of Medicine and completed his residency in internal medicine at the Mount Sinai Medical Center. He is an elected member of the National Academy of Medicine. He has a B.A. in economics from Wesleyan University.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005292/en/\nIllumina, Inc.\nInvestors:\nJacquie Ross, CFA\n858-255-5243\nir@illumina.com\nor\nMedia:\nTina Amirkiai\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina Reports Financial Results for Fourth Quarter and Fiscal Year 2019",
        "subtitle": "",
        "date": "Jan 29, 2020 4:05PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) today announced its financial results for the fourth quarter and fiscal year 2019.\n\nFourth quarter 2019 results:\n\nGross margin in the fourth quarter of 2019 was 69.5% compared to 68.1% in the prior year period. Excluding amortization of acquired intangible assets, non-GAAP gross margin was 70.2% for the fourth quarter of 2019 compared to 69.1% in the prior year period.\n\nResearch and development (R&D) expenses for the fourth quarter of 2019 were $161 million compared to $176 million in the prior year period. Excluding restructuring charges, non-GAAP R&D expenses as a percentage of revenue were 16.8% compared to 20.3% in the prior year period.\n\nSelling, general and administrative (SG&A) expenses for the fourth quarter of 2019 were $233 million compared to $217 million in the prior year period. Excluding amortization of acquired intangible assets, acquisition-related expenses, and restructuring charges, non-GAAP SG&A expenses as a percentage of revenue were 22.2% compared to 24.5% in the prior year period.\n\nDepreciation and amortization expenses were $46 million and capital expenditures for free cash flow purposes were $57 million during the fourth quarter of 2019. At the close of the quarter, the company held $3.4 billion in cash, cash equivalents and short-term investments, compared to $3.5 billion as of December 30, 2018.\n\nFiscal year 2019 results:\n\nGross margin for fiscal 2019 was 69.6% compared to 69.0% in the prior year. Excluding amortization of acquired intangible assets, non-GAAP gross margin was 70.6% for fiscal 2019 compared to 70.1% in the prior year period.\n\nR&D expenses for fiscal 2019 were $647 million compared to $623 million in the prior year. Excluding restructuring charges, non-GAAP R&D expenses as a percentage of revenue were 18.2% compared to 18.7% in the prior year period.\n\nSG&A expenses for fiscal 2019 were $835 million compared to $794 million in the prior year period. Excluding amortization of acquired intangible assets, acquisition-related expenses, and restructuring charges, non-GAAP SG&A expenses as a percentage of revenue were 22.0% compared to 23.6% in the prior year period.\n\n“Illumina shipped a record 2,400 sequencing systems in 2019, including a record number of our high-throughput NovaSeq systems and mid-throughput NextSeq systems, reflecting strong demand for research and clinical sequencing,” said Francis deSouza, President and CEO. “With the launch of our most innovative system to date in the NextSeq 2000, and a growing pipeline of clinical IVD and software solutions, Illumina continues to improve the accessibility of sequencing. Almost 17 years after the first human genome was sequenced, we believe that this is the decade that genomics becomes available to cancer and genetic disease patients on a mass scale and integrates into standard of care.”\n\nUpdates since our last earnings release:\n\nFinancial outlook and guidance\n\nThe non-GAAP financial guidance discussed below reflects certain pro forma adjustments to assist in analyzing and assessing our core operational performance. Please see our Reconciliation of Non-GAAP Financial Guidance included in this release for a reconciliation of the GAAP and non-GAAP financial measures.\n\nFor fiscal 2020, the company expects year over year revenue growth in the range of 9% to 11%, and expects GAAP earnings per diluted share of $6.45 to $6.65 and non-GAAP earnings per diluted share of $6.80 to $7.00. GAAP guidance does not include any potential impact resulting from the termination of our merger agreement with Pacific Biosciences on January 2, 2020.\n\nQuarterly conference call information\n\nThe conference call will begin at 2:00 pm Pacific Time (5:00 pm Eastern Time) on Wednesday, January 29, 2020. Interested parties may access the live teleconference through the Investor Info section of Illumina’s website under the “Company” tab at www.illumina.com. Alternatively, individuals can access the call by dialing 1 (866) 211-4597 or 1 (647) 689-6853 outside North America, both with conference ID 2966099.\n\nA replay of the conference call will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nStatement regarding use of non-GAAP financial measures\n\nThe company reports non-GAAP results for diluted net income per share, net income, gross margins, operating expenses, operating margins, other income, and free cash flow in addition to, and not as a substitute for, or superior to, financial measures calculated in accordance with GAAP. The company’s financial measures under GAAP include substantial charges such as amortization of acquired intangible assets, non-cash interest expense associated with the company’s convertible debt instruments that may be settled in cash, and others that are listed in the itemized reconciliations between GAAP and non-GAAP financial measures included in this press release. Management has excluded the effects of these items in non-GAAP measures to assist investors in analyzing and assessing past and future operating performance. Additionally, non-GAAP net income attributable to Illumina stockholders and diluted earnings per share attributable to Illumina stockholders are key components of the financial metrics utilized by the company’s board of directors to measure, in part, management’s performance and determine significant elements of management’s compensation.\n\nThe company encourages investors to carefully consider its results under GAAP, as well as its supplemental non-GAAP information and the reconciliation between these presentations, to more fully understand its business. Reconciliations between GAAP and non-GAAP results are presented in the tables of this release.\n\nUse of forward-looking statements\n\nThis release contains forward-looking statements that involve risks and uncertainties, including our financial outlook and guidance for fiscal 2020 and our expectations and beliefs regarding future conduct and growth of the business and the markets in which we operate. Among the important factors that could cause actual results to differ materially from those in any forward-looking statements are: (i) changes in the rate of growth in the markets we serve; (ii) the volume, timing and mix of customer orders among our products and services; (iii) our ability to adjust our operating expenses to align with our revenue expectations; (iv) our ability to manufacture robust instrumentation and consumables; (v) the success of products and services competitive with our own; (vi) challenges inherent in developing, manufacturing, and launching new products and services, including expanding or modifying manufacturing operations and reliance on third-party suppliers for critical components; (vii) the impact of recently launched or pre-announced products and services on existing products and services; (viii) our ability to further develop and commercialize our instruments and consumables, to deploy new products, services, and applications, and to expand the markets for our technology platforms; (ix) our ability to obtain regulatory clearance for our products from government agencies; (x) our ability to successfully partner with other companies and organizations to develop new products, expand markets, and grow our business; (xi) our ability to successfully identify and integrate acquired technologies, products, or businesses; and (xxii) the application of generally accepted accounting principles, which are highly complex and involve many subjective assumptions, estimates, and judgments, together with other factors detailed in our filings with the Securities and Exchange Commission, including our most recent filings on Forms 10-K and 10-Q, or in information disclosed in public conference calls, the date and time of which are released beforehand. We undertake no obligation, and do not intend, to update these forward-looking statements, to review or confirm analysts’ expectations, or to provide interim reports or updates on the progress of the current quarter.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\n(1) Includes stock-based compensation of $1.5 million for Helix in fiscal 2019. This compares to stock-based compensation for Helix of $3.9 million in fiscal 2018, of which $1.6 million was in Q4 2018.\n\n(a) Free cash flow, which is a non-GAAP financial measure, is calculated as net cash provided by operating activities reduced by purchases of property and equipment. Free cash flow is useful to management as it is one of the metrics used to evaluate our performance and to compare us with other companies in our industry. However, our calculation of free cash flow may not be comparable to similar measures used by other companies.\n\n(b) Net cash provided by operating activities in fiscal 2019 included an $84 million payment of the accreted debt discount related to the conversions of our 2019 Notes.\n\nAll amounts in tables are rounded to the nearest millions, except as otherwise noted. As a result, certain amounts may not recalculate using the rounded amounts provided.\n\n(a) Non-GAAP net income attributable to Illumina stockholders and diluted earnings per share attributable to Illumina stockholders exclude the effect of the pro forma adjustments as detailed above. Non-GAAP net income attributable to Illumina stockholders and diluted earnings per share attributable to Illumina stockholders are key components of the financial metrics utilized by the company’s board of directors to measure, in part, management’s performance and determine significant elements of management’s compensation. Management has excluded the effects of these items in these measures to assist investors in analyzing and assessing our past and future core operating performance.\n\n(b) Refer to our “Itemized Reconciliation between GAAP and Non-GAAP Results of Operations as a Percent of Revenue,” below, for the components of these amounts.\n\n(c) Incremental non-GAAP tax expense reflects the tax impact of the non-GAAP adjustments listed.\n\n(d) Amounts represent tax deductions taken in excess of stock compensation cost. Amount for fiscal 2018 also includes an $11 million discrete tax expense associated with updating our 2017 estimates of the impact of U.S. Tax Reform.\n\n \n\n \n\nAll amounts in tables are rounded to the nearest millions, except as otherwise noted. As a result, certain amounts may not recalculate using the rounded amounts provided.\n\n(a) Non-GAAP gross profit, included within non-GAAP operating profit, is a key measure of the effectiveness and efficiency of manufacturing processes, product mix and the average selling prices of our products and services. Non-GAAP operating profit, and non-GAAP other income, net, exclude the effects of the pro forma adjustments as detailed above. Management has excluded the effects of these items in these measures to assist investors in analyzing and assessing past and future operating performance.\n\n(b) Amounts are recorded in cost of revenue.\n\n(c) Amounts consist primarily of employee and lease exit costs related to restructuring that occurred in 2019, 2018, and 2017.\n\n(d) Amounts consist of expenses related to the Pacific Biosciences acquisition which was terminated on January 2, 2020.\n\n(e) Non-cash interest expense is calculated in accordance with the authoritative accounting guidance for convertible debt instruments that may be settled in cash.\n\n(f) Amounts consist primarily of mark-to-market adjustments and impairments from our strategic investments.\n\n(g) Amounts consist of the $39 million gain recognized as a result of the Helix deconsolidation in Q2 and the $15 million gain recorded in Q1 that resulted from the settlement of a contingency related to the deconsolidation of GRAIL in 2017.\n\n(h) Amounts consist of mark-to-market adjustments related to our contingent value right received from Helix.\n\n(a) This guidance does not include any potential impact resulting from the termination of our merger agreement with Pacific Biosciences on January 2, 2020.\n\n(b) Non-cash interest expense is calculated in accordance with the authoritative accounting guidance for convertible debt instruments that may be settled in cash.\n\n(c) Incremental non-GAAP tax expense reflects the tax impact related to the non-GAAP adjustments listed.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200129005683/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina to Announce Fourth Quarter and Fiscal Year 2019 Financial Results on Wednesday, January 29, 2020",
        "subtitle": "",
        "date": "Jan 13, 2020 4:05PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ:ILMN) today announced that it will issue results for fourth quarter and fiscal year 2019 following the close of market on Wednesday, January 29, 2020.\n\nOn the same day, at 2:00 pm Pacific Time (5:00 pm Eastern Time) Francis deSouza, President and Chief Executive Officer, and Sam Samad, Senior Vice President and Chief Financial Officer, will host a conference call with analysts, investors, and other interested parties to discuss financial and operating results.\n\nConference Call Details\n\nThe conference call will begin at 2:00 pm Pacific Time (5:00 pm Eastern Time) on Wednesday, January 29, 2020. Interested parties may access the live teleconference through the Investor Relations section of Illumina’s website under the “company” tab at www.illumina.com. Alternatively, individuals can access the call by dialing 1 (866) 211-4597, or 1 (647) 689-6853 outside North America, both with Conference ID 2966099.\n\nA replay of the conference call will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005896/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina Announces New Sequencing System, Partnership with Roche and Software Suite to Accelerate Adoption of Genomics",
        "subtitle": "",
        "date": "Jan 13, 2020 12:06PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) further demonstrated its commitment to making genomics more accessible for the potential benefit of patients today with a series of technology and partnership announcements that further the company’s commitment to unlocking the power of the genome.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200113005753/en/The NextSeq 2000 Sequencing System — The latest NGS system from Illumina offers innovative design features, advanced chemistry, simplified bioinformatics, and an intuitive workflow that enable the widest range of applications on a benchtop sequencing system.  (Photo: Business Wire)\nSpeaking today at the 38th Annual J.P. Morgan Healthcare Conference in San Francisco, Illumina CEO, Francis deSouza, announced a 15-year, non-exclusive collaboration agreement with Roche, one of the world’s leading diagnostic companies to accelerate the availability of distributable NGS-based in-vitro diagnostic (IVD) tests on Illumina’s diagnostic (Dx) sequencing systems. Further, Roche will collaborate with Illumina to complement Illumina’s comprehensive pan-cancer assay TruSight Oncology 500 (TSO 500) with new companion diagnostic (CDx) claims. For additional details, please read the full press release on the Illumina News Center.\n\nTo support the growing demand for clinical grade genomic information at lower cost, Illumina announced the NextSeq™ 1000 and NextSeq 2000 Sequencing Systems offering breakthrough system design, chemistry innovations and on-instrument integrated informatics for rapid secondary analysis. The new systems incorporate more than 75 innovations, including the never before commercialized combination of super resolution and blue chemistry, that enables a substantial increase in density and throughput as well as a reduction in operating costs.\n\n“We are proud to continue our tradition of driving down the cost of sequencing without compromising accuracy,” said Omead Ostadan, Senior Vice President, Marketing and Products at Illumina. “NextSeq 1000 and 2000 are designed to enable core labs, small to medium research labs and clinical facilities to access high intensity sequencing applications using our industry-leading SBS technology.”\n\nIllumina also announced the development of a regulatory-cleared version of the high-throughput NovaSeq system to address growing demand for a Dx platform to support deeper sequencing at higher throughput. NovaSeqDx extends the company’s portfolio of Dx cleared systems and, ahead of commercial availability targeted for 2022, will be available to IVD partners, including Roche, for content development.\n\n“At Illumina, we are focused on three key areas to scale the reach and impact of genomics—enabling breakthrough genomics research, accelerating the clinical adoption of genomics and delivering fundamentally enabling technology innovations,” said Francis deSouza, Chief Executive Officer at Illumina. “The NextSeq 1000 and 2000 Sequencing Systems, TruSight Software and our partnership with Roche, will accelerate the adoption of research and clinical sequencing for the benefit of humanity.”\n\nTurn-key data analysis solutions also have the ability to facilitate and accelerate clinical adoption. TruSight Software Suite v1.0 delivers ready-made infrastructure to adopt, ramp and realize the full potential of genome sequencing in rare and undiagnosed genetic disease. TruSight Software enables sample-to-report for genetic disease making it easier to access the valuable insights enabled by sequencing with comprehensive variant class analysis for greatest diagnostic yield.\n\nAbout NextSeq 1000 and NextSeq 2000\n\nThe NextSeq 1000 and NextSeq 2000 were designed from the ground-up, with the aim of simplifying workflows and overcoming challenges commonly faced by users of mid-throughput sequencers today. The company’s proven sequencing by synthesis (SBS) chemistry, coupled with super resolution optics, an ultrahigh-density flow cell, and versatile informatics solutions, enable NGS discovery power in the most flexible format of any Illumina sequencer to date. Now, any size lab can afford to run tests and experiments more frequently.\n\nDesigned to create a user-friendly, end-to-end experience, the NextSeq 1000 and NextSeq 2000 are the first Illumina platforms to integrate DRAGEN on board, powering a flexible informatics suite, featuring both local and cloud-based options for run setup, management and analysis. The unique combination of robust instrument performance and run economics delivers the ability to take on new and emerging applications with speed and accuracy for applications like single cell RNA-seq, ctDNA and a variety of oncology panels. NextSeq 2000 and NextSeq 1000 are the first systems with this new architecture and have a U.S. list price of $335,000 and $210,000, respectively. The NextSeq 2000 is now available for order here and will begin shipping in Q4 2020. The NextSeq 1000 system will begin shipping in Q4 2020.\n\nFor Research Use Only. Not for use in diagnostic procedures.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nForward-Looking Statements\n\nCertain statements contained in this press release may be considered forward-looking statements within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the U.S. Securities Exchange Act of 1934, as amended. Such forward-looking statements involve risks and uncertainties, including our expectations and beliefs regarding future conduct and growth of our business and the markets in which we operate. Among the important factors that could cause actual results to differ materially from those in any forward-looking statements are: (i) changes in the rate of growth in the markets we serve; (ii) the volume, timing and mix of customer orders among our products and services; (iii) our ability to manufacture robust instrumentation and consumables; (iv) the success of products and services competitive with our own; (v) challenges inherent in developing, manufacturing, and launching new products and services, including expanding or modifying manufacturing operations and reliance on third-party suppliers for critical components; (vi) the impact of recently launched or pre-announced products and services on existing products and services; (vii) our ability to further develop and commercialize our instruments and consumables, to deploy new products, services, and applications, and to expand the markets for our technology platforms; (viii) our ability to obtain regulatory clearance for our products from government agencies; (ix) our ability to successfully partner with other companies and organizations to develop new products, expand markets, and grow our business; (ix) our ability to successfully identify and integrate acquired technologies, products, or businesses; and (x) the application of generally accepted accounting principles, which are highly complex and involve many subjective assumptions, estimates, and judgments, together with other factors detailed in our filings with the Securities and Exchange Commission, including our most recent filings on Forms 10-K and 10-Q, or in information disclosed in public conference calls, the date and time of which are released beforehand. We undertake no obligation, and do not intend, to update these forward-looking statements, to review or confirm analysts’ expectations, or to provide interim reports or updates on the progress of the current quarter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005753/en/\nMedia Contacts\nInvestors:\nJacquie Ross, CFA\nVice President, Investor Relations\n+1 858-882-2172\nir@illumina.com\n\nOR\n\nMedia:\nJen Carroll\nAssociate Director, Public Relations\n+1 858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina and Roche Partner to Broaden Patient Access to Genomic Testing",
        "subtitle": "",
        "date": "Jan 13, 2020 11:55AM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN), the global leader in DNA sequencing and array-based technologies, and Roche, a global pioneer in pharmaceuticals and diagnostics, today announced a 15-year, non-exclusive collaboration agreement to broaden the adoption of distributable next-generation sequencing-based (NGS) testing in oncology. As the understanding of genomic drivers of cancer evolves, NGS has the potential to transform cancer risk prediction, detection, diagnosis, treatment and monitoring.\n\nThis agreement brings together complementary capabilities of each company to broaden global adoption of NGS in cancer care. As part of this agreement, Illumina will grant Roche rights to develop and distribute in-vitro diagnostic (IVD) tests on Illumina’s NextSeq™ 550Dx System, as well as on its future portfolio of diagnostic (Dx) sequencing systems, including the forthcoming NovaSeqDx. Roche will in turn collaborate with Illumina to complement Illumina’s comprehensive pan-cancer assay, TruSight Oncology 500 (TSO 500), with new companion diagnostic (CDx) claims. The financial terms of the deal were not disclosed.\n\nUnder the IVD terms of the agreement, Roche will develop, manufacture and commercialize AVENIO IVD tests for both tissue and blood for use on Illumina’s NextSeq 550Dx System. Illumina will continue to sell the NextSeq 550Dx Systems and core sequencing consumables. Under the CDx terms of the agreement, Illumina and Roche will develop tests and pursue CDx claims on TSO 500 for both existing and pipeline oncology targeted therapies on the NextSeq 550Dx System. Illumina will lead the development and regulatory approval process, and will continue to manufacture, supply and commercialize TSO 500. Roche will support the development of the claims and regulatory filings.\n\n“We are excited Roche has selected Illumina’s sequencers as their platform of choice to accelerate the adoption and broaden the reach of oncology-based, distributable IVD tests into clinical care,” said Francis deSouza, CEO of Illumina. “This partnership complements and strengthens our strategy to establish TSO 500 as a comprehensive NGS panel for cancer therapies by expanding the supported set of CDx claims on this universal panel. Building on the momentum of other recently established diagnostic and pharmaceutical partnerships, together we aim to advance critical access to NGS testing to improve patient outcomes.”\n\nIllumina’s TSO 500 is a comprehensive pan-cancer assay designed to identify known and emerging tumor biomarkers. TSO 500 utilizes both DNA and RNA from tumor samples to identify key somatic variants underlying tumor progression, such as small DNA variants, fusions and splice variants. When used to test for companion diagnostics claims, TSO 500 is poised to identify cancer patients globally who might benefit from targeted therapeutics. As the anchor tenant of Illumina’s oncology product portfolio, TSO 500 enables labs to adopt a comprehensive genomic profiling panel, in a decentralized testing model, leveraging the accurate and reproducible results of Illumina’s diagnostic sequencing systems.\n\nAbout Illumina \n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nForward-Looking Statements\n\nCertain statements contained in this press release may be considered forward-looking statements within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the U.S. Securities Exchange Act of 1934, as amended. To the extent that any of the statements contained herein relating to each of Roche’s and Illumina’s products, launches, regulatory submissions, collaborations, markets, strategy, taxes or operating results, including without limitation their expected net sales, net sales of particular products, product launches, improvements in operating and financial leverage, currency movements, and plans for investment in their respective portfolios, are forward-looking, such statements are based on current expectations and assumptions that involve a number of uncertainties and risks. Such uncertainties and risks include, but are not limited to, risks associated with management of growth and international operations (including the effects of currency fluctuations, regulatory processes and dependence on logistics); variability of operating results and allocations between customer classes; the commercial development of markets for products to customers in academia, pharma, applied testing and molecular diagnostics; changing relationships with customers, suppliers and strategic partners; competition; rapid or unexpected changes in technologies; fluctuations in demand for each of Roche’s and Illumina’s products (including fluctuations due to general economic conditions, the level and timing of customers' funding, budgets and other factors); ability to obtain regulatory approval of products; difficulties in successfully adapting products to integrated solutions and producing such products; the ability to identify and develop new products and to differentiate and protect products from competitors' products; market acceptance of new products and the integration of acquired technologies and businesses; and the other factors discussed under the heading “Risk Factors” contained in Illumina’s most recent Quarterly Report on Form 10-Q and Annual Report on Form 10-K. For further information, please refer to the discussions in reports that Illumina has filed with, or furnished to, the U.S. Securities and Exchange Commission (SEC).\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005717/en/\nMedia Contacts\nInvestors:\nJacquie Ross, CFA\nVice President, Investor Relations\n+1 858-882-2172\nir@illumina.com \n\nOR\n\nMedia:\nLisa Warshaw\nSenior Manager, Public Relations\n+1 858-882-6822\npr@illumina.com \nSource: Illumina, Inc."
    },
    {
        "title": "ArcherDX and Illumina Partner for Future to Co-Market Portfolio of Planned In-Vitro Diagnostic (IVD) Tests",
        "subtitle": "Co-marketing partnership to drive awareness of ArcherDX IVD products and increase access to vital genomic information in the community oncology care setting",
        "date": "Jan 10, 2020 8:00AM EST",
        "content": "BOULDER, Colo., Jan. 10, 2020 /PRNewswire/ -- ArcherDX, Inc. today announced a non-exclusive, multi-year partnership with Illumina, Inc. (NASDAQ: ILMN) intended to broaden access of next generation sequencing (NGS)-based oncology testing, including companion diagnostics for therapeutic selection, personalized monitoring, and recurrence surveillance IVD tests, upon FDA approval, enabling more patient access to world-class care in their own community, delivered by local clinicians.\"Creating broad access to clinically relevant genomic information is core to our company's mission, and we expect this commercial partnership with Illumina will accelerate that process,\" said ArcherDX Chief Executive Officer Jason Myers. \"Illumina's NGS instruments are ubiquitous in thousands of clinical and research settings due to their accuracy, speed and user experience. That technology, together with our planned IVD test kits and companion software, will allow these platforms to guide clinical decision making and targeted therapy. The resulting shift away from a handful of centralized sequencing labs to more decentralized testing benefits patients through faster results, more competitive pricing and access to world-class cancer care delivered locally. It also allows hospitals and local labs to benefit as they can garner a growing share of the cancer diagnostics and monitoring market.\"This partnership expands and builds upon existing agreements with Illumina including developing ArcherDX IVD tests to run on Illumina's NextSeq™ 550Dx and MiSeq™ Dx Systems as well as a prior agreement to co-market and co-promote the Archer® FusionPlex® line of research products in markets outside of the United States.The multi-year agreement covers co-marketing of future ArcherDX IVD tests used with the Illumina NextSeq™ 550Dx and MiSeq™ Dx Systems. Upon approval, these tests will generate the genomic information needed to guide optimal cancer treatment and deliver information to clinicians and patients for cancer monitoring and recurrence surveillance. Upon FDA approval, ArcherDX anticipates the first IVD to be marketed under the partnership will be the ArcherDX STRATAFIDE™ companion diagnostic (CDx).  Upon FDA approval, STRATAFIDE would be the first pan-solid tumor IVD capable of identifying actionable genomic alterations in tissue or blood samples, including alterations targeted by emerging therapies undergoing clinical trials, therapies already recommended in clinical guidelines such as NCCN, and therapies approved by the FDA. These breakthrough capabilities would enable STRATAFIDE to be the first pan-solid tumor IVD NGS testing technology to accept both tissue and blood that can be used in any local hospital or regional reference lab with an Illumina sequencer. STRATAFIDE was granted FDA Breakthrough Device Designation in early 2019. Following FDA approval of STRATAFIDE, ArcherDX also plans to seek regulatory approval and launch its Personalized Cancer Monitoring (PCM) product. The ArcherDX PCM platform would enable local labs to assess therapy success and identify disease recurrence much earlier than current standard of care such as imaging or antigen test modalities, making successful treatment more likely.\"Since our initial partnership in 2016, we have remained aligned with ArcherDX via our shared mission to bring actionable genomic insights closer to patients,\" said Dr. Phil Febbo, Chief Medical Officer of Illumina. \"We are pleased to take this next step in our commercial partnership to support expanding access to leading-edge genomic cancer management to more patients, in more communities, to improve patient outcomes.\"About ArcherDXArcherDX is advancing molecular pathology with a robust technology platform for genetic mutation detection by next-generation sequencing. By combining patented Anchored Multiplex PCR (AMP™) chemistry in an easy-to-use, lyophilized format and powerful bioinformatics software, the Archer® platform dramatically enhances genetic mutation identification and discovery. ArcherDX provides oncology-focused research products and is pursuing regulatory approval for multiple companion diagnostic assays. ArcherDX is headquartered in Boulder, Colorado. Learn more at www.archerdx.com and follow us @ArcherDXInc on Twitter, Facebook and LinkedIn.    View original content to download multimedia:http://www.prnewswire.com/news-releases/archerdx-and-illumina-partner-for-future-to-co-market-portfolio-of-planned-in-vitro-diagnostic-ivd-tests-300984874.htmlSOURCE  ArcherDX"
    },
    {
        "title": "Illumina and Pacific Biosciences Announce Termination of Merger Agreement",
        "subtitle": "",
        "date": "Jan 2, 2020 4:05PM EST",
        "content": "    SAN DIEGO & MENLO PARK, Calif.--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ:ILMN) and Pacific Biosciences of California, Inc. (NASDAQ:PACB) today announced that they have mutually agreed to terminate their merger agreement, previously announced on November 1, 2018, under which Illumina would acquire Pacific Biosciences at a fully diluted enterprise value of approximately $1.2 billion in an all-cash transaction.\n\nConsidering the lengthy regulatory approval process the transaction has already been subject to and continued uncertainty of the ultimate outcome, the parties decided that terminating the agreement is in the best interest of their respective shareholders and employees. In accordance with the merger agreement, Illumina will pay Pacific Biosciences a termination fee of $98 million.\n\n“We believe this proposed combination would have broadened access to Pacific Biosciences sequencing technology, significantly expanded and accelerated innovation, and ultimately increased the clinical utility and impact of sequencing,” said Francis deSouza, President and Chief Executive Officer of Illumina. “I’d like to thank our employees, as well as the Pacific Biosciences team, for their unwavering dedication and commitment throughout this process. Moving forward, we will continue to look for ways to increase the impact and benefit of sequencing technologies for researchers, clinicians, and most importantly, patients.”\n\n“We are disappointed that our customers and other stakeholders will not realize the powerful advantages of integrating the sequencing capabilities of our two companies,” said Michael Hunkapiller, Ph.D., Chief Executive Officer of Pacific Biosciences. “With that said, we are confident in the future of Pacific Biosciences as we continue to pursue improved sequencing accuracy and throughput that can be utilized in an ever-expanding number of applications.”\n\nAbout Pacific Biosciences\n\nPacific Biosciences of California, Inc. (NASDAQ:PACB) offers sequencing systems to help scientists resolve genetically complex problems. Based on its novel Single Molecule, Real-Time (SMRT®) technology, Pacific Biosciences’ products enable: de novo genome assembly to finish genomes in order to more fully identify, annotate and decipher genomic structures; full-length transcript analysis to improve annotations in reference genomes, characterize alternatively spliced isoforms in important gene families, and find novel genes; targeted sequencing to more comprehensively characterize genetic variations; and real-time kinetic information for epigenome characterization. Pacific Biosciences’ technology provides high accuracy, ultra-long reads, uniform coverage, and the ability to simultaneously detect epigenetic changes. PacBio® sequencing systems, including consumables and software, provide a simple, fast, end-to-end workflow for SMRT Sequencing. More information is available at www.pacb.com.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nForward-Looking Statements\n\nAll statements in this press release that are not historical are forward-looking statements, including, among other things, statements relating to future improvements in the technology of each of Illumina and Pacific Biosciences, the growth of each company, the expansion of the applications for each company’s products and technology, and other future events. You should not place undue reliance on forward-looking statements because they involve known and unknown risks, uncertainties, changes in circumstances and other factors that are, in some cases, beyond each of Illumina’s and Pacific Biosciences’ control and could cause actual results to differ materially from the information expressed or implied by forward-looking statements made in this press release. Factors that could materially affect actual results can be found in Illumina’s and Pacific Biosciences’ most recent filings with the Securities and Exchange Commission, including Illumina’s and Pacific Biosciences’ most recent reports on Forms 8-K, 10-K and 10-Q, and include those listed under the caption “Risk Factors.” Each of Illumina and Pacific Biosciences undertakes no obligation to revise or update information in this press release to reflect events or circumstances in the future, even if new information becomes available.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200102005512/en/\nIllumina Contacts\n\nMedia:\nJen Carroll\n(858) 449-8082\npr@illumina.com\nOR\nInvestors:\nJacquie Ross, CFA\n(858) 882-2172\nir@illumina.com\n\nPacific Biosciences Contact\n\nBen Gong\n(650) 521-8203\nir@pacificbiosciences.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina to Webcast Upcoming Investor Conference Presentation",
        "subtitle": "",
        "date": "Dec 23, 2019 5:42PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ:ILMN) today announced that its executives will be speaking at the following investor conference and invite investors to participate via webcast.\n\nJ.P. Morgan Healthcare Conference in San Francisco, CA on Monday, January 13, 2020\nPresentation at 8:30am Pacific Time followed by a Q&A Session at 9am Pacific Time\n\nThe live webcasts can be accessed in the Investor Relations section of Illumina's website under the \"company\" tab at www.illumina.com. Replays will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191223005592/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "ArcherDX Announces Partnership with Illumina to Develop In-Vitro Diagnostic Tests",
        "subtitle": "Partnership Expands Physician Access to Clinical Testing that May be Performed in Local Laboratories for Solid Tumor Cancers, Hematological Malignancies and Minimal Residual Disease Monitoring",
        "date": "Dec 3, 2019 8:00AM EST",
        "content": " BOULDER, Colo., Dec. 3, 2019 /PRNewswire/ -- ArcherDX, Inc., a growth-stage molecular diagnostics company dedicated to developing breakthrough solutions that advance personalized genomic medicine, today announced a non-exclusive partnership with Illumina, Inc. (NASDAQ: ILMN) to develop in-vitro diagnostic (IVD) tests for Archer's planned portfolio of next-generation sequencing (NGS)-based companion diagnostics.The scope of the agreement includes ArcherDX's future portfolio of IVD tests used to facilitate targeted therapy selection and monitoring of Minimal Residual Disease for the management of patients with solid tumor and blood cancers. The planned IVD tests will empower commercial laboratories, hospitals and health systems to run these assays in their local laboratories worldwide.Under the agreement, ArcherDX will develop IVD tests to run on Illumina's NextSeq™ 550Dx System. ArcherDX will be responsible for obtaining necessary regulatory approvals for each IVD kit and for their subsequent commercialization. ArcherDX and Illumina entered into a similar agreement for the MiSeq™ Dx System in 2016.\"We are pleased to expand our development partnership with Illumina, whose large install base and highly accurate sequencing systems will accelerate our efforts to democratize access to high-quality genomic testing by developing distributable diagnostic assays that can be used to identify targeted therapy options, as well as monitor for the recurrence of disease across a wide variety of cancers,\" said Jason Myers, Chief Executive Officer and co-founder of ArcherDX. \"These IVD tests will provide important new options for providers and patients around the world.\"\"Partnerships that bring exceptional clinical content to customers and patients represent an exciting opportunity in clinical genomics,\" said Dr. Phil Febbo, Chief Medical Officer of Illumina. \"By enabling ArcherDX to develop IVD tests, we are ensuring health care providers and patients have access to a growing menu of important distributable diagnostic tests that will improve patient outcomes.\"About ArcherDXArcherDX is advancing molecular diagnostics with a robust technology platform for genetic mutation detection by next-generation sequencing. By combining patented Anchored Multiplexed PCR (AMP™) chemistry in an easy-to-use, lyophilized format and powerful bioinformatics software, the Archer® platform dramatically enhances genetic mutation identification and discovery. ArcherDX provides oncology-focused research products and is pursuing regulatory approval for multiple companion diagnostic assays. ArcherDX is headquartered in Boulder, Colorado. Learn more at www.archerdx.com and follow us @ArcherDXInc on Twitter, Facebook and LinkedIn.   View original content to download multimedia:http://www.prnewswire.com/news-releases/archerdx-announces-partnership-with-illumina-to-develop-in-vitro-diagnostic-tests-300967838.htmlSOURCE  ArcherDX"
    },
    {
        "title": "Illumina to Webcast Upcoming Investor Conference Presentations",
        "subtitle": "",
        "date": "Nov 20, 2019 4:05PM EST",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ:ILMN) today announced that its executives will be speaking at the following investor conferences and invited investors to participate via webcast.\n\nEvercore ISI HealthCONx Conference in Boston, MA\nWednesday, December 4, 2019 at 8:45am Eastern Time\n\nPiper Jaffray Annual Healthcare Conference in New York, NY\nThursday, December 5, 2019 at 10:30am Eastern Time\n\nThe live webcasts can be accessed in the Investor Relations section of Illumina's web site under the \"company\" tab at www.illumina.com. A replay of the presentations will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005815/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina Reports Financial Results for Third Quarter of Fiscal Year 2019",
        "subtitle": "",
        "date": "Oct 24, 2019 4:05PM EDT",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) today announced its financial results for the third quarter of fiscal year 2019.\n\nThird quarter 2019 results:\n\nGross margin in the third quarter of 2019 was 71.5% compared to 70.0% in the prior year period. Excluding amortization of acquired intangible assets, non-GAAP gross margin was 72.5% for the third quarter of 2019 compared to 71.1% in the prior year period.\n\nResearch and development (R&D) expenses for the third quarter of 2019 were $151 million compared to $159 million in the prior year period. Excluding restructuring charges, non-GAAP R&D expenses as a percentage of revenue were 16.4% compared to 18.6% in the prior year period.\n\nSelling, general and administrative (SG&A) expenses for the third quarter of 2019 were $189 million compared to $197 million in the prior year period. Excluding acquisition-related expenses and restructuring charges, non-GAAP SG&A expenses as a percentage of revenue were 20.0% compared to 23.2% in the prior year period.\n\nDepreciation and amortization expenses were $47 million and capital expenditures for free cash flow purposes were $49 million during the third quarter of 2019. At the close of the quarter, the company held $3.2 billion in cash, cash equivalents and short-term investments, compared to $3.5 billion as of December 30, 2018.\n\n“This was a solid quarter for Illumina, with product revenue in-line with expectations, and a stronger than expected revenue contribution associated with partner collaborations to develop distributable clinical IVDs for Illumina sequencers,” said Francis deSouza, President and CEO. “Third quarter NovaSeq system shipments represented the second highest since launch, and included capacity expansion to support the UK Biobank initiative to sequence 450,000 whole genomes over the next several years. Additionally, continued NovaSeq adoption resulted in the highest consumables pull-through quarter for the platform this year.”\n\nUpdates since our last earnings release:\n\nFinancial outlook and guidance\n\nThe non-GAAP financial guidance discussed below reflects certain pro forma adjustments to assist in analyzing and assessing our core operational performance. Please see our Reconciliation of Non-GAAP Financial Guidance included in this release for a reconciliation of the GAAP and non-GAAP financial measures.\n\nFor fiscal 2019, the company continues to expect year over year revenue growth of approximately 6%, and now expects GAAP earnings per diluted share attributable to Illumina stockholders of $6.55 to $6.60 and non-GAAP earnings per diluted share attributable to Illumina stockholders of $6.40 to $6.45.\n\nExcept for acquisition-related expenses incurred during the first three quarters of 2019 which are reflected in our GAAP guidance, this guidance excludes any impact from the pending acquisition of Pacific Biosciences.\n\nQuarterly conference call information\n\nThe conference call will begin at 2:00 pm Pacific Time (5:00 pm Eastern Time) on Thursday, October 24, 2019. Interested parties may access the live teleconference through the Investor Info section of Illumina’s website under the “Company” tab at www.illumina.com. Alternatively, individuals can access the call by dialing 1 (866) 211-4597 or 1 (647) 689-6853 outside North America, both with conference ID 2388693.\n\nA replay of the conference call will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nStatement regarding use of non-GAAP financial measures\n\nThe company reports non-GAAP results for diluted net income per share, net income, gross margins, operating expenses, operating margins, other income, and free cash flow in addition to, and not as a substitute for, or superior to, financial measures calculated in accordance with GAAP. The company’s financial measures under GAAP include substantial charges such as amortization of acquired intangible assets, non-cash interest expense associated with the company’s convertible debt instruments that may be settled in cash, and others that are listed in the itemized reconciliations between GAAP and non-GAAP financial measures included in this press release. Management has excluded the effects of these items in non-GAAP measures to assist investors in analyzing and assessing past and future operating performance. Additionally, non-GAAP net income attributable to Illumina stockholders and diluted earnings per share attributable to Illumina stockholders are key components of the financial metrics utilized by the company’s board of directors to measure, in part, management’s performance and determine significant elements of management’s compensation.\n\nThe company encourages investors to carefully consider its results under GAAP, as well as its supplemental non-GAAP information and the reconciliation between these presentations, to more fully understand its business. Reconciliations between GAAP and non-GAAP results are presented in the tables of this release.\n\nUse of forward-looking statements\n\nThis release contains forward-looking statements that involve risks and uncertainties, including our financial outlook and guidance for fiscal 2019 and our expectations and beliefs regarding future conduct and growth of the business and the markets in which we operate. Among the important factors that could cause actual results to differ materially from those in any forward-looking statements are: (i) changes in the rate of growth in the markets we serve; (ii) the volume, timing and mix of customer orders among our products and services; (iii) our ability to adjust our operating expenses to align with our revenue expectations; (iv) the outcome of the pending acquisition of Pacific Biosciences; (v) our ability to manufacture robust instrumentation and consumables; (vi) the success of products and services competitive with our own; (vii) challenges inherent in developing, manufacturing, and launching new products and services, including expanding or modifying manufacturing operations and reliance on third-party suppliers for critical components; (viii) the impact of recently launched or pre-announced products and services on existing products and services; (ix) our ability to further develop and commercialize our instruments and consumables, to deploy new products, services, and applications, and to expand the markets for our technology platforms; (x) our ability to successfully identify and integrate acquired technologies, products, or businesses; and (xi) the application of generally accepted accounting principles, which are highly complex and involve many subjective assumptions, estimates, and judgments, together with other factors detailed in our filings with the Securities and Exchange Commission, including our most recent filings on Forms 10-K and 10-Q, or in information disclosed in public conference calls, the date and time of which are released beforehand. We undertake no obligation, and do not intend, to update these forward-looking statements, to review or confirm analysts’ expectations, or to provide interim reports or updates on the progress of the current quarter.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nIllumina, Inc.\nReconciliation of Non-GAAP Financial Guidance\n(unaudited)\n\nOur future performance and financial results are subject to risks and uncertainties, and actual results could differ materially from the guidance set forth below. Some of the factors that could affect our financial results are stated above in this press release. More information on potential factors that could affect our financial results is included from time to time in the public reports filed with the Securities and Exchange Commission, including Form 10-K for the fiscal year ended December 30, 2018 filed with the SEC on February 11, 2019, Form 10-Q for the fiscal quarter ended March 31, 2019, and Form 10-Q for the fiscal quarter ended June 30, 2019. We assume no obligation to update any forward-looking statements or information.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191024005949/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina to Announce Third Quarter 2019 Financial Results on Thursday, October 24, 2019",
        "subtitle": "",
        "date": "Oct 8, 2019 4:05PM EDT",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ:ILMN) today announced that it will issue results for third quarter 2019 following the close of market on Thursday, October 24, 2019.\n\nOn the same day, at 2:00 pm Pacific Time (5:00 pm Eastern Time) Francis deSouza, President and Chief Executive Officer, and Sam Samad, Senior Vice President and Chief Financial Officer, will host a conference call with analysts, investors, and other interested parties to discuss financial and operating results.\n\nConference Call Details\n\nThe conference call will begin at 2:00 pm Pacific Time (5:00 pm Eastern Time) on Thursday, October 24, 2019. Interested parties may access the live teleconference through the Investor Relations section of Illumina’s website under the “company” tab at www.illumina.com. Alternatively, individuals can access the call by dialing 1 (866) 211-4597 or 1 (647) 689-6853 outside North America, both with conference ID 2388693.\n\nA replay of the conference call will be posted on Illumina’s website after the event and will be available for at least 30 days following.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191008005814/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina and QIAGEN Partner to Deliver Sequencing-Based In-Vitro Diagnostic (IVD) Tests",
        "subtitle": "",
        "date": "Oct 7, 2019 4:05PM EDT",
        "content": "\nPartnership to accelerate the adoption of next-generation sequencing (NGS) in clinical decision-making\n    SAN DIEGO & HILDEN, Germany & GERMANTOWN, Md.--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) and QIAGEN N.V. (NYSE: QGEN) (Frankfurt Prime Standard: QIA) today announced a 15-year partnership intended to broaden the availability and use of NGS-based IVD kits, including companion diagnostics, for patient management.\n\nThe agreement grants QIAGEN non-exclusive rights to develop and globally commercialize IVD kits to be used together with Illumina’s MiSeq™ Dx and NextSeq™ 550Dx Systems. The agreement also includes rights for expansion of the partnership on future Illumina diagnostic (Dx) systems. Both partners are also exploring opportunities for QIAGEN to develop and market companion diagnostics based on Illumina’s TruSight Oncology (TSO) assays that enable comprehensive genomic profiling of tumor samples in immunotherapy.\n\nIllumina and QIAGEN will cooperate to commercialize a menu of clinically validated workflows that combine QIAGEN’s proprietary content and bioinformatics solutions. The partnership will initially focus on commercializing oncology IVD kits to support patient management and may expand in the future to include additional clinical diagnostic fields, such as cardiology, hereditary diseases, infectious diseases, as well as inflammatory and autoimmune diseases.\n\n“We are committed to expanding the range of clinical use cases addressed by genomic sequencing by enabling partners to deliver IVD tests and companion diagnostics on Illumina’s Dx instruments,” said Francis deSouza, Chief Executive Officer of Illumina. “Our partnership with QIAGEN will complement Illumina’s TSO 500 family with additional testing menu options, accelerating NGS adoption in oncology patient management.”\n\n“Bringing together our highly complementary capabilities marks an important milestone to advance the use of NGS technologies in clinical decision-making and our shared vision of using this powerful technology to improve the outcomes for patients worldwide,” said Peer M. Schatz, Chief Executive Officer of QIAGEN. “We at QIAGEN are very pleased with this ground-breaking partnership and this first step in what we hope to be a long and productive relationship that capitalizes on combining our unique strengths. This partnership becomes a key cornerstone of our NGS strategy, which continues to include our universal solutions for use with any sequencer as well as the GeneReader NGS System for use primarily with smaller, targeted gene panels. Through this partnership, we look forward to creating significant benefits for customers and for both parties, as well as to allowing QIAGEN to maximize our opportunities as a company creating value by offering sample-to-insight solutions.”\n\nBringing Together Highly Complementary Capabilities\n\nThrough this partnership, QIAGEN endeavors to build a broad menu of IVD tests on Illumina’s Dx sequencers by leveraging its market leading companion diagnostic capabilities and Sample to Insight solutions, thereby enhancing both companies’ channel reach and presence in the IVD market.\n\nQIAGEN is an established global leader in molecular (PCR and NGS-driven) precision medicine given its portfolio of more than 25 master collaboration agreements with pharmaceutical and biotechnology companies to co-develop and gain regulatory approvals for companion diagnostics. So far, seven therapies have received FDA co-approval with a QIAGEN companion diagnostic assay.\n\nWith global availability of the MiSeq Dx and NextSeq 550Dx platforms, Illumina has a robust diagnostic NGS product portfolio capable of covering a broad range of clinical applications designed for a variety of clinical lab settings. As NGS testing begins to play a more significant role in patient care, Illumina is committed to providing clinical solutions, both Illumina developed and partner driven, that support the diagnosis and management of human diseases.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nAbout QIAGEN\n\nQIAGEN N.V., a Netherlands-based holding company, is the leading global provider of Sample to Insight solutions that enable customers to gain valuable molecular insights from samples containing the building blocks of life. Our sample technologies isolate and process DNA, RNA and proteins from blood, tissue and other materials. Assay technologies make these biomolecules visible and ready for analysis. Bioinformatics software and knowledge bases interpret data to report relevant, actionable insights. Automation solutions tie these together in seamless and cost-effective workflows. QIAGEN provides solutions to more than 500,000 customers around the world in Molecular Diagnostics (human healthcare) and Life Sciences (academia, pharma R&D and industrial applications, primarily forensics). As of June 30, 2019, QIAGEN employed approximately 5,200 people in over 35 locations worldwide. Further information can be found at http://www.qiagen.com.\n\nCertain statements contained in this press release may be considered forward-looking statements within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the U.S. Securities Exchange Act of 1934, as amended. To the extent that any of the statements contained herein relating to QIAGEN's and ILLUMINA’s products, launches, regulatory submissions, collaborations, markets, strategy, taxes or operating results, including without limitation its expected net sales, net sales of particular products, adjusted net sales, adjusted diluted earnings per share results, product launches, improvements in operating and financial leverage, currency movements, and plans for investment in its portfolio and share repurchase commitments, are forward-looking, such statements are based on current expectations and assumptions that involve a number of uncertainties and risks. Such uncertainties and risks include, but are not limited to, risks associated with management of growth and international operations (including the effects of currency fluctuations, regulatory processes and dependence on logistics); variability of operating results and allocations between customer classes; the commercial development of markets for our products to customers in academia, pharma, applied testing and molecular diagnostics; changing relationships with customers, suppliers and strategic partners; competition; rapid or unexpected changes in technologies; fluctuations in demand for QIAGEN's and ILLUMINA’s products (including fluctuations due to general economic conditions, the level and timing of customers' funding, budgets and other factors); ability to obtain regulatory approval of products; difficulties in successfully adapting products to integrated solutions and producing such products; the ability to identify and develop new products and to differentiate and protect our products from competitors' products; market acceptance of new products and the integration of acquired technologies and businesses; and the other factors discussed under the heading “Risk Factors” contained in Item 3 of QIAGEN’s most recent Annual Report on Form 20-F and Item 1A of ILLUMINA’s most recent Quarterly Report on Form 10-Q and Annual Report on Form 10-K. For further information, please refer to the discussions in reports that each of QIAGEN and ILLUMINA has filed with, or furnished to, the U.S. Securities and Exchange Commission (SEC).\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191007005792/en/\nIllumina Contacts\nJacquie Ross, CFA\nVice President, Investor Relations\n+1 858-882-2172\nir@illumina.com\n\nJen Carroll\nAssociate Director, Public Relations\n+1 858-882-6822\npr@illumina.com\n\nKaren Birmingham\nHead of Public Relations – Europe, Middle East and Africa\n+44 7500 105665\nkbirmingham@illumina.com\n\nQIAGEN contacts\nJohn Gilardi\nVice President Corporate Communications and Investor Relations\n+49 2103 29 11711 and +1 240 686 2222\njohn.gilardi@qiagen.com\n\nPhoebe Loh\nAssociate Director Investor Relations\n+49 2103 29 11457\nphoebe.loh@qiagen.com\n\nDr. Thomas Theuringer\nHead of External Communications\n+49 2103 29 11826 and +1 240 686 7425\nthomas.theuringer@qiagen.com\nwww.twitter.com/qiagen\nwww.facebook.com/QIAGEN\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina and Broad Institute Announce Agreement to Co-Develop Genomic Secondary Analysis Tools",
        "subtitle": "",
        "date": "Sep 30, 2019 8:55AM EDT",
        "content": "\nCollaboration Aims to Combine the Benefits of GATK Suite and DRAGEN Bio-IT Platform To Create Best-in-Class Open-Source Software for Secondary Genomic Analysis\n    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (NASDAQ: ILMN) and the Broad Institute of MIT and Harvard today announced they have entered into a collaboration for the co-development of secondary genomic analysis algorithms and software. Top data scientists from both institutions will collaborate to bring together the industry-leading open-source GATK algorithms with the speed and enhanced accuracy of Illumina’s DRAGEN™ (Dynamic Read Analysis for GENomics) Bio-IT Platform for commonly used methods, including small variant (SNV) and large variant (CNV/SV) detection.\n\n“Broad and Illumina are committed to ensuring labs of all sizes and disciplines have access to the best algorithms,” said Anthony Philippakis, MD, PhD, Chief Data Officer of the Broad Institute of MIT and Harvard. “By bringing our expertise together to improve on our open-source toolkit, we can offer our most advanced comprehensive pipeline, while ensuring it remains widely available, open, and accessible to the global genomics community. This is a long-term partnership – we will innovate together to drive the leading edge of novel variant calling for the advancement of genomics.”\n\nThe co-developed secondary analysis software will be open-source and will be distributed through the Broad Institute's usual community support channels, such as GitHub. Illumina intends to develop proprietary, hardware-accelerated versions of the co-developed software on the Illumina DRAGEN-Bio-IT platform. This accelerated version of the software will be complemented with the wide offering of currently available pipelines on the DRAGEN Bio-IT platform. The Broad Institute and Illumina teams will validate that the results of such hardware-accelerated versions are functionally equivalent to those of the co-developed open-source software in order to ensure interoperability of data for downstream analyses.\n\n“Illumina’s goal is to deliver industry leading technologies to our customers, whether that means creating tools ourselves, bringing new technologies and teams in-house, or partnering to enhance our offerings,” said Susan Tousi, Senior Vice President of Product Development at Illumina. “This is why we were so thrilled to acquire Edico Genome and DRAGEN last year and it is in this spirit that we are partnering with the Broad with the goal to deliver best-in-class open-source software for commonly used methods. By creating a suite of algorithms combining the best of DRAGEN and GATK, we believe we can fuel the clinical adoption of sequencing by decreasing the cost and time of analysis.”\n\nThe Broad Institute’s GATK is an industry leader for identifying SNPs and indels in germline DNA and RNA sequencing data. These tools were primarily designed to process exomes and whole genomes generated with Illumina sequencing technology. Over time, the scope expanded to include somatic short variant calling, and to tackle copy number variation (CNV) and structural variation (SV). In addition to variant callers, GATK also includes utilities to perform related tasks such as processing and quality control of high-throughput sequencing data.\n\nThe Illumina DRAGEN Bio-IT Platform delivers accurate, rapid secondary analysis for germline and somatic SNV, SV, CNV(A) calling as well as methylation, RNA and repeat expansion workflows. DRAGEN pipelines are hardware-accelerated using reconfigurable field-programmable gate array technology (FPGA). DRAGEN Pipelines can be deployed on-premise via a local server and in the cloud through Illumina’s BaseSpace™ Sequence Hub.\n\nThe co-developed secondary analysis software will provide a standardized methodology for processing high-throughput sequencing data and performing variant discovery analysis aiming for best-in-class sensitivity, accuracy and scalability.\n\n“This approach is a positive step for the community and will add to the available choices in data analysis to increase the quality and lower the cost of the current set of analysis methods,” said Ewan Birney, Director, Global Alliance for Genomics and Health (GA4GH) and EMBL’s European Bioinformatics Institute. “The scientific community is well-positioned to benefit from this collaboration toward gold standard analysis methods and file formats which we believe will further enable inter-institution interoperability, research, and insights to maximize the impact of genomics in healthcare.”\n\nInterested parties are invited to learn more at the 2019 Illumina Informatic Satellite Meeting at ASHG and encouraged to visit the Illumina booth or the Broad booth during ASHG in Houston October 15-19, 2019.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nAbout Broad Institute of MIT and Harvard\n\nBroad Institute of MIT and Harvard was launched in 2004 to empower this generation of creative scientists to transform medicine. The Broad Institute seeks to describe all the molecular components of life and their connections; discover the molecular basis of major human diseases; develop effective new approaches to diagnostics and therapeutics; and disseminate discoveries, tools, methods, and data openly to the entire scientific community.\n\nFounded by MIT, Harvard, Harvard-affiliated hospitals, and the visionary Los Angeles philanthropists Eli and Edythe L. Broad, the Broad Institute includes faculty, professional staff, and students from throughout the MIT and Harvard biomedical research communities and beyond, with collaborations spanning over a hundred private and public institutions in more than 40 countries worldwide. To learn more, visit www.broadinstitute.org and follow @broadinstitute.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190930005265/en/\nIllumina Contacts\n\nJacquie Ross, CFA\nVice President, Investor Relations\n+1 858-882-2172\nir@illumina.com\n\nJen Carroll\nAssociate Director, Public Relations\n+1 858-882-6822\npr@illumina.com\n\nBroad Institute of MIT and Harvard Contact\n\nLee McGuire\nChief Communications Officer\nlmcguire@broadinstitute.org\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina Names Joydeep Goswami Senior Vice President of Corporate Development and Strategic Planning",
        "subtitle": "",
        "date": "Sep 23, 2019 8:55AM EDT",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (Nasdaq:ILMN) today announced the appointment of Joydeep Goswami as Senior Vice President of Corporate Development and Strategic Planning. Mr. Goswami will be responsible for driving planning, strategic partnerships and acquisitions, and will report to President and Chief Executive Officer, Francis deSouza.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190923005311/en/Joydeep Goswami, Illumina Senior Vice President of Corporate Development and Strategic Planning (Photo: Business Wire)\nWith more than 20 years of global experience, Mr. Goswami has a strong track record of developing strategy and leading new product development, partnerships, licensing, and mergers and acquisitions. Most recently, he served as the President of Thermo Fisher Scientific’s Clinical Next-Generation Sequencing (NGS) and Oncology business unit, where he oversaw efforts that drove the adoption of NGS in clinical oncology, research and reproductive health.\n\n“We are very pleased to welcome Joydeep to Illumina,” said deSouza. “Joydeep’s global experience, entrepreneurial spirit and deep background in research and clinical businesses, will serve Illumina well as we accelerate the adoption of sequencing in existing markets and enable the most impactful, new opportunities for genomics.”\n\n\"I am honored to be joining Illumina and look forward to helping harness the power of the genome to shift the paradigm of healthcare and life science research across the globe,\" said Goswami.\n\nMr. Goswami has held senior leadership roles across the pharma/biotech, diagnostics and research tool continuum, previously serving at companies such as Life Technologies and Invitrogen, in addition to Thermo Fisher Scientific. He has led teams across various functions, including sales, marketing, R&D and other support functions. Mr. Goswami served as President, Asia Pacific and Japan while at Thermo Fisher Scientific and created the Stem Cells and Regenerative Medicine Business Unit at Invitrogen. Additionally, he spent five years at McKinsey & Co., where he specialized in strategy for pharmaceutical, medical technology and technology companies.\n\nMr. Goswami holds his M.S., Ph.D. in Chemical Engineering, an MBA from the Massachusetts Institute of Technology and a Bachelor’s degree in Chemical Engineering from the Indian Institute of Technology, Mumbai.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\n\nUse of forward-looking statements\n\nThis release contains forward-looking statements that involve risks and uncertainties. These forward-looking statements are based on our expectations as of the date of this release and may differ materially from actual future events or results. Among the important factors that could cause actual results to differ materially from those in any forward-looking statements are (i) our ability to further develop and commercialize our instruments and consumables, and to deploy new products, services and applications, and expand the markets for our technology platforms; (ii) our ability to manufacture robust instrumentation and consumables; (iii) our ability to successfully identify and integrate acquired technologies, products or businesses; (iv) the future conduct and growth of the business and the markets in which we operate; and (v) challenges inherent in developing, manufacturing, and launching new products and services, together with other factors detailed in our filings with the Securities and Exchange Commission, including our most recent filings on Forms 10-K and 10-Q, or in information disclosed in public conference calls, the date and time of which are released beforehand. We undertake no obligation, and do not intend, to update these forward-looking statements, to review or confirm analysts’ expectations, or to provide interim reports or updates on the progress of the current quarter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190923005311/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Illumina Recommends Stockholders Reject Mini-Tender Offer by TRC Capital Corporation",
        "subtitle": "",
        "date": "Sep 12, 2019 8:55AM EDT",
        "content": "    SAN DIEGO--(BUSINESS WIRE)--\nIllumina, Inc. (“Illumina”) (NASDAQ: ILMN) has been notified of an unsolicited “mini-tender offer” by TRC Capital Corporation (“TRC”) to purchase up to 500,000 shares of Illumina common stock at a price of $268.80 per share in cash.\n\nTRC’s offer is subject to a number of conditions, including TRC’s ability to obtain sufficient financing. By its terms, TRC’s offer will expire at 12:01 a.m., New York City time, on Thursday, October 3, 2019, but TRC may extend the offer, or terminate it, before the expiration date.\n\nIllumina is not affiliated or associated in any way with TRC, its offer or the offer documentation. Illumina recommends that stockholders not tender their shares in response to TRC's unsolicited offer because, among other things, it deprives stockholders who tender their Illumina shares of the potential opportunity to realize greater long-term value in their investment.\n\nTRC has made similar mini-tender offers for shares of other companies. Mini-tender offers seek to acquire not more than five percent of a company's outstanding shares, thereby avoiding many disclosure and procedural requirements of the U.S. Securities and Exchange Commission (the “SEC”) that apply to offers for more than five percent of a company's outstanding shares. As a result, investors are provided fewer protections in mini-tender offers than would be provided in larger tender offers under U.S. securities laws.\n\nIllumina encourages brokers and dealers, as well as other market participants, to review the SEC's letter regarding broker-dealer mini-tender offer dissemination and disclosure at www.sec.gov/divisions/marketreg/minitenders/sia072401.htm.\n\nIllumina requests that a copy of this news release be included with all distributions of materials relating to TRC's mini-tender offer related to shares of Illumina's common stock.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as the global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and follow @illumina.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190912005292/en/\nInvestors:\nJacquie Ross, CFA\n858-882-2172\nir@illumina.com\n\nMedia:\nEric Endicott\n858-882-6822\npr@illumina.com\nSource: Illumina, Inc."
    },
    {
        "title": "Helix Expands Focus to Population Health Solutions and Appoints Illumina Veteran Marc Stapley as CEO",
        "subtitle": "",
        "date": "Apr 25, 2019 4:12PM EDT",
        "content": "SAN CARLOS, Calif., April 25, 2019 /PRNewswire/ -- Helix today announced it is broadening its market focus to include health systems, payers and researchers who are interested in sequencing large population cohorts. Helix will be offering those partners its population health solutions, a suite of sequencing products and services built around the Helix proprietary Exome+™ assay, packaged with its workflow, CLIA/CAP lab, return of results platform and data capabilities. To lead this expansion, the company has named Marc Stapley as Chairman and CEO. \"While we are announcing a new strategic business focus today, Helix's mission remains unchanged: to empower every person to improve their life through DNA,\" said Marc Stapley, Helix CEO. \"Our turnkey population health solutions enable institutions to quickly scale projects that engage communities and accelerate translational research and discovery, ultimately allowing every person to benefit from the power of their genome.\" Stapley has been a member of Helix's Board of Directors since the company was founded four years ago, and is a seven-year veteran of Illumina, where he served as Chief Administrative Officer, Chief Financial Officer and from 2017–2018 oversaw the company's population genomics team. Prior to Illumina, he held executive finance positions at Pfizer and other large multinational companies.\"The Helix team, led by Robin Thurston, has succeeded in creating engaging genomics offerings, supported by a world-class CLIA/CAP laboratory and assay,\" said Jay Flatley, Executive Chairman of Illumina. \"I'd like to thank Robin for his leadership of Helix over the last three years, and welcome Marc as the incoming CEO. It is gratifying to see the business enter a new phase where Helix's technology and market knowledge will be leveraged to drive a new era where genomics is part of everyone's personal health record.\"Helix's population health solutions have already seen success in partnership with Renown IHI as part of the Healthy Nevada program. \"Helix sequenced 40,000 Nevadans for us in record time, and the company's consumer-facing engagement tools are key to helping us expand to 250,000 Nevadans in the fastest-growing population health project in the world,\" said Anthony Slonim, M.D., DrPH, FACHE, president and CEO of Renown Health and president of Renown Institute for Health Innovation. \"The consistency and quality of the Helix data has enabled us to make an immediate health impact in our community through broad-scale clinical screening. We're excited to see Helix expand its population health solutions to other institutions to change lives throughout the nation.\" Helix and AdventHealth today announced they will be collaborating to launch an Orlando, Florida population health program initially aiming to sequence 10,000 participants. The \"WholeMe\" study will provide researchers invaluable information about how Floridians respond to learning more about their genomes, while also showing how genomics can be integrated into healthcare to prevent, diagnose, and treat diseases. Every participant will receive results for familial hypercholesterolemia (FH) screening, as well as genetic ancestry and wellness traits provided by Helix.To enable this expansion, Helix and Illumina have entered into an agreement to restructure their relationship. Illumina no longer has an equity stake in Helix or any representatives on Helix's Board of Directors. Helix will continue to utilize Illumina's industry-leading sequencing products under an arms-length commercialization agreement.About HelixHelix is a genomics company with a simple but powerful mission: to empower every person to improve their life through DNA. Our affordable, turnkey population health solutions enable institutions to quickly scale projects that engage communities and accelerate research and discovery, ultimately allowing every person to benefit from the power of genomics. We've also created the first marketplace for DNA-powered products where people can explore diverse and uniquely personalized products developed by high-quality partners, providing powerful tools to increase engagement and speed the pace of population-scale genomics. Helix is headquartered in the San Francisco Bay Area, has an office in Denver, Colorado and operates a CLIA-certified and CAP-accredited next-generation sequencing lab in San Diego powered by Illumina (NASDAQ: ILMN) NGS technology. Learn more at www.helix.com.Helix, the Helix logo and Exome+ are trademarks of Helix Opco, LLC.  All other trademarks referenced herein are the property of their respective owners. View original content:http://www.prnewswire.com/news-releases/helix-expands-focus-to-population-health-solutions-and-appoints-illumina-veteran-marc-stapley-as-ceo-300838703.htmlSOURCE  Helix"
    }
]