[
    {
        "title": "Incyte Partners with Artist and Patient J.G. Jones to Raise Awareness for Myeloproliferative Neoplasms (MPNs)",
        "subtitle": "",
        "date": "Feb 27, 2020 9:00AM EST",
        "content": "\n- Incyte announces launch of “Rare Reflections: MPNs Unmasked” as part of its ongoing efforts to raise awareness of MPNs\n\n- J.G. Jones, a comic book artist who was diagnosed with an MPN over a decade ago, creates graphic art to tell the powerful and personal stories of individuals impacted by MPNs \n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIn honor of Rare Disease Day on February 29th, Incyte (NASDAQ:INCY) is proud to announce the launch of Rare Reflections: MPNs Unmasked, a disease awareness initiative focused on raising awareness of and educating about myeloproliferative neoplasms (MPNs), a group of rare, chronic blood cancers.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200227005127/en/(Photo: Business Wire)\nAs part of ongoing efforts to raise awareness of MPNs, Incyte has partnered with J.G. Jones, a renowned comic book artist who was diagnosed with an MPN over a decade ago, to capture the experiences of those impacted by MPNs. Rare Reflections features a series of portraits by Jones who uses graphic art to tell the powerful and personal stories of real patients with MPNs and those impacted by MPNs.\n\nThe illustrations can be viewed at www.VoicesofMPN.com/RareReflections, along with more information about Jones’ disease journey and the stories of others living with MPNs.\n\n“Art has the amazing ability to capture the emotions of its subjects beyond the surface, and I am honored to partner with Incyte on Rare Reflections to raise awareness of MPNs by doing the work I love,” said Jones. “I know first-hand how living with an MPN can affect many aspects of a person’s life – physically and emotionally – and I hope, through increased awareness and education, to empower others living with an MPN to take control of their journey.”\n\n“Rare Disease Day offers a time for patients, caregivers, advocates and healthcare providers to join together to shine a light on the estimated 200,000 individuals in the United States living with an MPN,” said Hervé Hoppenot, Chief Executive Officer, Incyte. “Incyte is pleased to partner with a respected illustrator such as J.G. Jones to bring to life the real stories of those living with an MPN and to highlight the unique experiences of people across the MPN community.”\n\nIn honor of Rare Disease Day, Incyte is also supporting several efforts intended to raise awareness of MPNs and help patients with MPNs find tools and resources to help address the daily challenges they may face:\n\nStay connected and informed about all of the MPN awareness activities by “Liking” the “Voices of MPN” Facebook page, following “Voices of MPN” on Pinterest and following “Voices of MPN” on Twitter.\n\nAbout Myeloproliferative Neoplasms \n\nMyeloproliferative neoplasms (MPNs) are a closely related group of blood cancers in which the bone marrow functions abnormally. The bone marrow is where the body’s blood cells are made. MPNs are progressive blood cancers that can strike anyone at any age, but they are more common in older adults. Estimates of the prevalence of MPNs vary, but analysis of claims data suggests there may be as many as 200,000 people in the U.S. living with MF, PV or ET.1\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nReferences\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005127/en/\nMedia\nJenifer Antonacci\n+1 302-498-7036\njantonacci@incyte.com\n\nCatalina Loveman\n+1 302-498-6171\ncloveman@incyte.com \nSource: Incyte"
    },
    {
        "title": "Incyte Announces Launch of the Incyte Ingenuity Award Program to Recognize Innovation Within the GVHD Community",
        "subtitle": "",
        "date": "Feb 19, 2020 9:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) is proud to announce the opening call for submissions for its newly launched Incyte Ingenuity Award, an annual program created to support people living with graft-versus-host disease (GVHD), as well as their caregivers and physicians, by encouraging innovative and novel solutions for the challenges currently facing the GVHD community. Each year, the Incyte Ingenuity Award is expected to fund, up to $100,000, one innovative program, idea or initiative that fosters collaboration within the GVHD community to address a specific unmet need.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200219005221/en/\n“At Incyte, we wanted to create a community-driven program dedicated to improving the lives of patients with a serious disease, such as GVHD, which can be difficult to treat and have a devastating impact on the lives of patients,” said Barry Flannelly, Pharm. D., Executive Vice President and General Manager, U.S., Incyte. “Through the Incyte Ingenuity Award, we hope to spark creativity and innovation, which we expect to result in impactful and actionable solutions for the GVHD community.”\n\nSubmissions are welcomed from non-profit 501(c)(3), patient, policy and caregiver organizations, as well as healthcare providers and mid-level/junior faculty from healthcare organizations. Applications are due by April 30, 2020. All applications will be reviewed and evaluated by an independent judging panel, consisting of Gerry Cowden, Founder, Meredith Cowden Foundation; Shrina Duggal, PharmD, BCOP, Clinical Pharmacy Specialist; and Navneet Majhail, M.D., Director, Blood and Marrow Transplant Program, Cleveland Clinic. The judging panel will review each application and select the top three entries, who will then submit a more detailed proposal of their initiative. The first award recipient of Incyte Ingenuity Award will be announced in August of 2020.\n\n“Through my practice, I see first-hand the struggles faced by those impacted by GVHD. Everywhere they turn, patients experience a limitation – whether it is through limited support, information and/or treatment options. This award and its outputs are expected to give the GVHD community hope for their future beyond this horrible disease,” said Dr. Majhail. “I look forward to reviewing the submitted applications and seeing the brilliant initiatives that may come to fruition because of this generous award.”\n\nTo apply and learn more about the eligibility criteria, visit www.IncyteIngenuityAward.com and submit an online application including a summary of the proposed initiative.\n\nAbout GVHD\n\nGVHD is a condition that can occur after an allogeneic stem cell transplant (the transfer of stem cells from a donor) where the donated cells initiate an immune response and attack the transplant recipient’s organs, leading to significant morbidity and mortality. There are two major forms of GVHD, acute and chronic, that can affect multiple organ systems including the skin, gastrointestinal (digestive) tract, lung and liver.1\n\nAbout Incyte \n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nReferences \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005221/en/\nMedia\nJenifer Antonacci\n+1 302-498-7036\nJantonacci@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte Announces Positive Topline Results From Phase 3 TRuE-AD Program Evaluating Ruxolitinib Cream in Patients With Atopic Dermatitis",
        "subtitle": "",
        "date": "Feb 19, 2020 7:30AM EST",
        "content": "\nPrimary and secondary endpoints met in both TRuE-AD1 and TRuE-AD2\n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) today announced that the second randomized, vehicle-controlled, pivotal Phase 3 study from the TRuE-AD clinical trial program has met its primary endpoint.\n\nBuilding on the previously-reported positive topline results from TRuE-AD2, the results of TRuE-AD1 also show that significantly more patients treated with ruxolitinib cream 0.75% or 1.5% achieved Investigator’s Global Assessment Treatment Success (IGA-TS) – defined as an IGA score of 0 (clear) or 1 (almost clear) with at least a two-point improvement from baseline at Week 8 – than patients treated with vehicle control (non-medicated cream). The overall efficacy and safety profile of ruxolitinib cream was consistent with previous data, and no new safety signals were observed.\n\nThe TRuE-AD1 and TRuE-AD2 trials both evaluated the safety and efficacy of ruxolitinib cream in adolescent and adult patients (age ≥ 12 years) with mild-to-moderate atopic dermatitis (AD). The long-term safety portion of both studies will continue as planned. Additionally, data from both studies will be further analyzed and submitted for publication and presentation at an upcoming scientific meeting.\n\n“The successful outcomes of both the TRuE-AD1 and TRuE-AD2 studies confirm the potential of ruxolitinib cream as an important, non-steroidal treatment option for the millions of patients suffering from AD,” said Jim Lee, M.D., Group Vice President, Inflammation & AutoImmunity, Incyte. “We look forward to working with regulators as we seek approval of ruxolitinib cream as the first topical formulation of a JAK inhibitor for patients with AD.”\n\nKey Findings from TRuE-AD1 and TRuE-AD2\n\nAlmost 1,250 patients (age ≥ 12 years) diagnosed with AD for at least two years and who are candidates for topical therapy were enrolled in the identically-designed TRuE-AD1 and TRuE-AD2 trials. Patients with an Investigator’s Global Assessment (IGA) score of 2 to 3, and with AD on 3% to 20% of their Body Surface Area (BSA) (excluding scalp) were randomized 2:2:1 into one of three treatment arms for eight weeks, including: ruxolitinib cream 0.75% administered twice daily (BID); ruxolitinib cream 1.5% BID; and vehicle (non-medicated cream).\n\nThe primary endpoint of both TRuE-AD1 and TRuE-AD2 was IGA-TS at week 8. Secondary endpoints in both trials included the proportion of participants who achieved a ≥75% improvement in Eczema Area and Severity Index (EASI75) score at week 8 and the proportion of participants with a ≥ 4-point improvement in Itch Numerical Rating Scale (NRS4) score at week 8. Key efficacy results include:\n\nTRuE-AD1\n\nTRuE-AD2\n\nIn addition, a statistically-significant difference in itch reduction as measured by the NRS4 was observed for both dose strengths compared to vehicle control in both TRuE-AD1 and TRuE-AD2.\n\nIn both TRuE-AD1 and TRuE-AD2 after 8 weeks of treatment, the overall rate of treatment emergent adverse events was comparable between the ruxolitinib cream 0.75% BID, ruxolitinib cream 1.5% BID and vehicle control groups (29.4%, 26.3% and 33.6%, respectively). The rate of serious adverse events was 0.8% and 0.6% for ruxolitinib cream 0.75% BID and 1.5% BID, respectively, and 0.8% for vehicle control. Long-term safety is currently being evaluated in the 44-week extension period of both studies.\n\nAbout Atopic Dermatitis\n\nAD is a common chronic disease characterized by inflammation of the skin. At least 11 million people in the United States have been diagnosed with and are being treated for AD. The majority of these patients have a mild or moderate form of the disease and approximately 80% are adults or adolescents. Signs and symptoms of AD include irritated and itchy skin that can cause red lesions that may ooze and crust. Patients with AD are also more susceptible to bacterial, viral and fungal infections.\n\nAbout TRuE-AD\n\nThe TRuE-AD clinical trial program consists of two randomized, double-blind, dose-ranging, vehicle-controlled Phase 3 studies, TRuE-AD1 (NCT03745638) and TRuE-AD2 (NCT03745651), evaluating the safety and efficacy of ruxolitinib cream compared to vehicle (non-medicated cream) in patients with atopic dermatitis (AD). Both studies enrolled more than 600 patients (age ≥ 12 years) diagnosed with AD for at least two years and who were candidates for topical therapy.\n\nPatients with an Investigator’s Global Assessment (IGA) score of 2 to 3, and with AD on 3% to 20% of their Body Surface Area (BSA) (excluding scalp) were randomized 2:2:1 into one of three treatment arms for eight weeks, including: ruxolitinib cream 0.75% administered twice daily (BID); ruxolitinib cream 1.5% BID; and vehicle (non-medicated cream). Participants who successfully completed an assessment at Week 8 were offered participation in the 44-week long-term safety treatment extension period with ruxolitinib cream 0.75% or 1.5% BID.\n\nThe primary endpoint of the TRuE-AD studies was the proportion of participants achieving an Investigator’s Global Assessment Treatment Success (IGA-TS), defined as an IGA score of 0 (clear) or 1 (almost clear) with at least a 2-point improvement from baseline at Week 8. Other key secondary endpoints include: the proportion of patients achieving at least a 75% improvement from baseline in the Eczema Area and Severity Index (EASI75) score – another measurement of the extent and severity of AD, and the proportion of participants with at least a four-point improvement in the itch numerical rating scale (NRS). The studies have also been tracking the frequency, duration and severity of adverse events associated with the use of ruxolitinib cream.\n\nFor more information about the TRuE-AD studies, please visit http://clinicaltrials.gov/ct2/show/NCT03745638 and http://clinicaltrials.gov/ct2/show/NCT03745651.\n\nAbout Ruxolitinib Cream \n\nRuxolitinib cream is a proprietary formulation of Incyte’s selective JAK1/JAK2 inhibitor ruxolitinib that has been designed for topical application. Ruxolitinib cream is currently in Phase 3 development for the treatment of patients with mild-to-moderate atopic dermatitis (TRuE-AD) and for the treatment of adolescents and adults with vitiligo (TRuE-V). Incyte has worldwide rights for the development and commercialization of ruxolitinib cream.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding the presentation of data from the Company’s ongoing clinical development program for ruxolitinib cream, whether and when the Company will file an NDA for ruxolitinib cream, and whether ruxolitinib cream will be approved for use in the U.S. or elsewhere, contain predictions, estimates and other forward-looking statements.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-K for the year ended December 31, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005204/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.comm\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte Reports 2019 Fourth Quarter and Year-End Financial Results and Provides 2020 Financial Guidance and Updates on Key Clinical Programs",
        "subtitle": "",
        "date": "Feb 13, 2020 7:00AM EST",
        "content": "\nConference Call and Webcast Scheduled Today at 8:00 a.m. EST\n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) today reports 2019 fourth quarter and year-end financial results, announces 2020 guidance and provides a status update on the Company’s development portfolio.\n\n“Revenue growth continues to be very strong, driven by robust demand across all three indications for Jakafi,” stated Hervé Hoppenot, Chief Executive Officer, Incyte. “As we enter 2020, we have multiple opportunities for additional growth. We recently announced successful initial results from the Phase 3 TRuE-AD program, which we plan to include as part of the NDA in the fourth quarter of 2020 seeking approval of ruxolitinib cream for the treatment of patients with mild-to-moderate atopic dermatitis. We also look forward to the FDA decisions on the potential approvals of pemigatinib and capmatinib later this year. The recent progress made within both oncology and dermatology, as well as the recently announced MorphoSys collaboration for tafasitamab, positions Incyte very well as we deliver on our objectives for diversification and growth.”\n\nPortfolio Update\n\nLIMBER – key highlights\n\nThe LIMBER program, a key development priority designed to maintain our Leadership In MPNs BEyond Ruxolitinib, is evaluating multiple monotherapy and combination strategies to deliver improved therapies for patients with myeloproliferative neoplasms (MPNs). The program has three key areas of focus: new formulations of ruxolitinib; JAK inhibitor-based combinations; and new targets beyond JAK inhibition.\n\nA once-a-day formulation of ruxolitinib is being developed and is currently being evaluated in clinical pharmacology studies. Following positive proof-of-concept data of ruxolitinib plus parsaclisib in myelofibrosis (MF) patients with a suboptimal response to ruxolitinib monotherapy, a randomized pivotal trial is being prepared in this setting. Additional JAK-based combinations are either ongoing or in preparation.\n\nRecruitment has been discontinued in the RESET trial evaluating ruxolitinib as a potential treatment for patients with essential thrombocythemia.\n\nOncology beyond MPNs – key highlights\n\nData from the randomized Phase 3 REACH2 trial of ruxolitinib versus best available therapy (BAT) in patients with steroid-refractory acute graft-versus-host disease (GVHD) have been accepted for presentation within the Presidential Symposium of the 46th annual meeting of the European Society for Blood and Marrow Transplantation (EBMT, March 22-25). As previously announced, the trial, which was conducted in collaboration with Novartis, met its primary endpoint of improving overall response rate (ORR) at Day 28 with ruxolitinib treatment compared to BAT.\n\nREACH3, the Phase 3 trial of ruxolitinib in patients with steroid-refractory chronic GVHD being run in collaboration with Novartis, is ongoing and results are expected in the second half of 2020. If successful, and if approved, steroid-refractory chronic GVHD would be the fourth Jakafi indication available to patients in the US.\n\nIn January, it was announced that GRAVITAS-301, the Phase 3 trial of itacitinib as a treatment for patients with newly diagnosed acute GVHD, did not meet the primary endpoint.\n\nClinical development of itacitinib also includes GRAVITAS-309, a Phase 3 trial of itacitinib as a treatment for patients with newly diagnosed chronic GVHD.\n\nIn November, the FDA accepted the New Drug Application (NDA) for pemigatinib in second-line cholangiocarcinoma for Priority Review. The Prescription Drug User Fee Act (PDUFA) target action date is May 30, 2020. In early January, Incyte announced that the Marketing Authorization Application (MAA) seeking approval in Europe for pemigatinib as a second-line treatment for cholangiocarcinoma patients with FGFR2 fusions or rearrangements was validated by the EMA.\n\nThe CITADEL program is evaluating parsaclisib as a monotherapy across three types of non-Hodgkin lymphoma: follicular lymphoma; marginal zone lymphoma; and mantle cell lymphoma.\n\nClinical development of INCMGA0012 includes ongoing evaluation as a monotherapy in niche cancer opportunities as well as a planned program for the first-line treatment of patients with non-small cell lung cancer (NSCLC).\n\nIncyte recently announced a global collaboration with MorphoSys for the development and commercialization of tafasitamab, an anti-CD19 monoclonal antibody. Pending clearance by antitrust authorities, the collaboration agreement is expected to become effective in the first half of 2020.\n\nInflammation and Autoimmunity (IAI) – key highlights\n\nTRuE-AD2, the first of two Phase 3 trials in the TRuE-AD development program of ruxolitinib cream in patients with mild-to-moderate atopic dermatitis, met its primary endpoint. The overall efficacy and safety profile observed in TRuE-AD2 was consistent with previous data, and no new safety signals were observed.\n\nThe results of TRuE-AD1, the second of two Phase 3 trials required for regulatory submission, are anticipated to be available in the first quarter of 2020. The NDA submission, seeking approval of ruxolitinib cream in atopic dermatitis, is expected in the fourth quarter of 2020 following long-term safety and efficacy data from both pivotal trials.\n\nThe two Phase 3 trials in the TRuE-V pivotal program evaluating ruxolitinib cream in patients with vitiligo are recruiting well and results are expected in 2021.\n\nPhase 2 trials of INCB54707 in hidradenitis suppurativa and parsaclisib in autoimmune hemolytic anemia are progressing as planned.\n\nThe clinical program of INCB00928, Incyte’s ALK2 inhibitor, is in preparation in patients with fibrodysplasia ossificans progressiva, a disorder in which muscle tissue and connective tissue such as tendons and ligaments are gradually replaced by bone.\n\nThe Phase 2 trial of low-dose itacitinib in patients with ulcerative colitis has been discontinued, and initial data from the clinical evaluation of parsaclisib in patients with Sjögren’s syndrome did not warrant continuation of the trial.\n\nDiscovery and early development – key highlights\n\nIncyte’s portfolio of earlier-stage clinical candidates is summarized below.\n\nPartnered – key highlights\n\nIn January, Incyte and Lilly announced initial results of BREEZE-AD4 and BREEZE-AD5, the final two trials in the pivotal program evaluating baricitinib in patients with moderate-to-severe atopic dermatitis. Lilly recently submitted baricitinib for regulatory review in Europe as a treatment for patients with moderate-to-severe atopic dermatitis, and has announced plans to submit for approval in the U.S. and Japan in 2020.\n\nIn February, Incyte and Novartis announced that the NDA for capmatinib was accepted for Priority Review by the FDA, seeking approval in patients with NSCLC and MET exon 14 skipping mutations.\n\n2019 Fourth Quarter and Year-End Financial Results \n\nThe financial measures presented in this press release for the quarter and year ended December 31, 2019 and 2018 have been prepared by the Company in accordance with U.S. Generally Accepted Accounting Principles (“GAAP”), unless otherwise identified as a Non-GAAP financial measure. Management believes that Non-GAAP information is useful for investors, when considered in conjunction with Incyte’s GAAP disclosures. Management uses such information internally and externally for establishing budgets, operating goals and financial planning purposes. These metrics are also used to manage the Company’s business and monitor performance. The Company adjusts, where appropriate, for expenses in order to reflect the Company’s core operations. The Company believes these adjustments are useful to investors by providing an enhanced understanding of the financial performance of the Company’s core operations. The metrics have been adopted to align the Company with disclosures provided by industry peers.\n\nBeginning in the first quarter of 2019, after reviewing our Reconciliation of GAAP Net Income to Selected Non-GAAP Adjusted Information with the U.S. Securities & Exchange Commission, we no longer adjust for upfront consideration and milestones that are part of collaboration agreements with new or existing partners. This revised methodology is reflected in this press release for the quarter and year ended December 31, 2019 and 2018.\n\nNon-GAAP information is not prepared under a comprehensive set of accounting rules and should only be used in conjunction with and to supplement Incyte’s operating results as reported under GAAP. Non-GAAP measures may be defined and calculated differently by other companies in our industry.\n\nFinancial Highlights\n\nRevenue Details\n\nProduct and Royalty Revenues Product and royalty revenues for the quarter and year ended December 31, 2019 increased 24% and 22%, respectively, over the prior year comparative periods as a result of increases in Jakafi and Iclusig net product revenues and higher product royalty revenues from Jakavi and Olumiant. Jakafi net product revenues for the quarter and year ended December 31, 2019 increased 23% and 21%, respectively, over the prior year comparative periods, primarily driven by growth in patient demand across all indications.\n\nOperating Expenses\n\nResearch and development expenses GAAP and Non-GAAP research and development expense for the quarter ended December 31, 2019 increased 3% and 2%, respectively, compared to the same periods in 2018. This increase was primarily due to our existing pipeline programs progressing to later stages of development and was partially offset by our election to end additional co-funding of development of baricitinib with Lilly effective as of January 1, 2019. GAAP and Non-GAAP research and development expense for the year ended December 31, 2019 decreased 4% and 5%, respectively, compared to the same periods in 2018, primarily due to our election to end additional co-funding of the development of baricitinib and a decrease in upfront and milestone expenses related to collaborative agreements.\n\nSelling, general and administrative expenses GAAP and Non-GAAP selling, general and administrative expenses for the quarter ended December 31, 2019 increased 26% and 27%, respectively, and for the year ended December 31, 2019 increased 8% compared to the same period in 2018, primarily due to the growth in commercialization efforts related to Jakafi.\n\nOther Financial Information\n\nOperating income GAAP and Non-GAAP operating income increased for the quarter and year ended December 31, 2019 compared to the same periods in 2018 due to the growth in total revenues exceeding the growth in operating expenses.\n\nCash, cash equivalents and marketable securities position As of December 31, 2019 and 2018, cash, cash equivalents and marketable securities totaled $2.1 billion and $1.4 billion, respectively.\n\n2020 Financial Guidance \n\nThe Company’s 2020 financial guidance as detailed below excludes the financial impact of the recently announced collaboration with MorphoSys, which is pending clearance by antitrust authorities. In addition, the 2020 financial guidance does not include the impact of any potential future strategic transactions.\n\nFuture Non-GAAP financial measures may also exclude impairment of goodwill or other assets, changes in the fair value of equity investments in our collaboration partners, non-cash interest expense related to the amortization of the initial discount on our 2020 Senior Notes and the impact on our tax provision of discrete changes in our valuation allowance position on deferred tax assets.\n\nConference Call and Webcast Information\n\nIncyte will hold a conference call and webcast this morning at 8:00 a.m. EST. To access the conference call, please dial 877-407-3042 for domestic callers or 201-389-0864 for international callers. When prompted, provide the conference identification number, 13698234.\n\nIf you are unable to participate, a replay of the conference call will be available for 30 days. The replay dial-in number for the United States is 877-660-6853 and the dial-in number for international callers is 201-612-7415. To access the replay you will need the conference identification number, 13698234.\n\nThe conference call will also be webcast live and can be accessed at investor.incyte.com.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nAbout Jakafi® (ruxolitinib)\n\nJakafi is a first-in-class JAK1/JAK2 inhibitor approved by the U.S. FDA for treatment of steroid-refractory acute GVHD in adult and pediatric patients 12 years and older.\n\nJakafi is also indicated for treatment of polycythemia vera (PV) in adults who have had an inadequate response to or are intolerant of hydroxyurea as well as adults with intermediate or high-risk myelofibrosis (MF), including primary MF, post-polycythemia vera MF and post-essential thrombocythemia MF.\n\nJakafi is marketed by Incyte in the United States and by Novartis as Jakavi® (ruxolitinib) outside the United States. Jakafi is a registered trademark of Incyte Corporation. Jakavi is a registered trademark of Novartis AG in countries outside the United States.\n\nAbout Iclusig® (ponatinib) tablets\n\nIclusig targets not only native BCR-ABL but also its isoforms that carry mutations that confer resistance to treatment, including the T315I mutation, which has been associated with resistance to other approved TKIs.\n\nIn the EU, Iclusig is approved for the treatment of adult patients with chronic phase, accelerated phase or blast phase chronic myeloid leukemia (CML) who are resistant to dasatinib or nilotinib; who are intolerant to dasatinib or nilotinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation, or the treatment of adult patients with Philadelphia-chromosome positive acute lymphoblastic leukemia (Ph+ ALL) who are resistant to dasatinib; who are intolerant to dasatinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation.\n\nIncyte has an exclusive license from ARIAD Pharmaceuticals, Inc., since acquired by Takeda Pharmaceutical Company Limited, to develop and commercialize Iclusig in the European Union and 22 other countries, including Switzerland, Norway, Turkey, Israel and Russia.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this release contain predictions, estimates and other forward-looking statements, including without limitation statements regarding: the Company having multiple opportunities for additional growth and diversification; the expected timing for submission of an NDA for ruxolitinib cream for atopic dermatitis; the expected timing of decisions from the FDA on pemigatinib and capmatinib; the expected timing of the receipt of data from the Phase 3 trial evaluating ruxolitinib in GVHD; the expected timing of effectiveness of the MorphoSys collaboration agreement; the expected timing of the receipt and presentation of data from the Phase 3 trials of ruxolitinib cream in vitiligo and atopic dermatitis; expectations of the Company’s collaboration partner for the submission for approval in the U.S. and Japan of baricitinib for atopic dermatitis; plans and expectations for the rest of the Company’s development portfolio, including without limitation its LIMBER program; and the Company’s financial guidance for 2020 and the expectations underlying such guidance.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; delays and other issues in obtaining regulatory approval for the MorphoSys collaboration and the ability to satisfy conditions to effectiveness of the MorphoSys agreement; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company's dependence on its relationships with and changes in the plans of its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; unexpected variations in the demand for the Company’s products; unexpected price regulation or limitations on reimbursement or coverage for the Company’s products; sales, marketing, manufacturing and distribution requirements, including the Company’s ability to successfully commercialize and build commercial infrastructure for any new products that become approved; greater than expected expenses, including expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its quarterly report on Form 10-Q for the quarter ended September 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200213005188/en/\nIncyte Contacts\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Feb 11, 2020 8:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) announced today that it will present at the Cowen and Company 40th Annual Health Care Conference on Monday, March 2, 2020 at 11:20 a.m. ET in Boston.\n\nThe presentation will be webcast live and can be accessed at Investor.Incyte.com and will be available for replay for 30 days.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005084/en/\nIncyte Contacts\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte Announces Acceptance and Priority Review of NDA for Capmatinib for Advanced Non-Small Cell Lung Cancer",
        "subtitle": "",
        "date": "Feb 11, 2020 1:17AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) today announced that the U.S. Food and Drug Administration (FDA) has accepted and granted Priority Review to the New Drug Application (NDA) for capmatinib, an investigational, selective MET inhibitor, as a treatment for first-line and previously treated patients with locally advanced or metastatic MET exon 14 skipping (METex14) mutated non-small cell lung cancer (NSCLC). If approved, capmatinib will be the first therapy to specifically target METex14 mutated advanced lung cancer, a type of lung cancer with a particularly poor prognosis2,3.\n\nThere are currently no approved therapies that specifically target METex14 mutated advanced NSCLC. NSCLC accounts for approximately 85% of lung cancer diagnoses4. METex14 mutations occur in 3-4% of newly-diagnosed advanced NSCLC cases5 and is a recognized oncogenic driver6,7.\n\n“Patients with METex14 mutated advanced NSCLC, an aggressive form of the disease, often face a poor prognosis due to lack of available treatment options,” said Steven Stein, M.D., Chief Medical Officer, Incyte. “We are pleased the FDA has accepted the NDA for capmatinib for Priority Review – a critical step toward providing the first METex14 mutation targeted therapy to this subset of lung cancer patients.”\n\nThe FDA grants Priority Review to medicines that may offer a major advance in treatment where none currently exists. This designation shortens the FDA review period following the acceptance of the NDA to six months compared to 10 months for Standard Review. Capmatinib was previously granted Breakthrough Therapy designation by the FDA.\n\nThe NDA submission for capmatinib was supported by results from the Novartis-sponsored GEOMETRY mono-1 Phase 2 study, which demonstrated overall response rates of 67.9% (95% CI, 47.6 - 84.1)1 and 40.6% (95% CI, 28.9–53.1)1 among treatment-naïve and previously treated patients, respectively, based on the Blinded Independent Review Committee (BIRC) assessment per RECIST v1.1. The study also demonstrated that capmatinib provided durable responses among all patients: median duration of response was 11.14 months (95% CI, 5.55 - NE) in treatment-naïve patients and 9.72 months (95% CI, 5.55 - 12.98) in previously treated patients1.\n\nAll results were based on independent assessment by the BIRC, and all tumor CT scans were evaluated in parallel by two radiologists to confirm the response1. The most common treatment-related adverse events (AE) (≥ 10% all grades) across all cohorts (N=334), were peripheral edema (42%), nausea (33%), creatinine increase (20%), vomiting (19%), fatigue (14%), decreased appetite (13%) and diarrhea (11%). The majority of the AEs were grades 1/21.\n\nAbout GEOMETRY mono-1\n\nThe Novartis-sponsored GEOMETRY mono-1 trial is an international, prospective, multi-cohort, non-randomized, open-label Phase 2 study to evaluate the efficacy and safety of single-agent capmatinib in adult patients with EGFR wildtype, ALK-negative rearrangement, advanced NSCLC harboring a MET amplification and/or mutation. Patients with locally advanced or metastatic NSCLC harboring a MET exon-14 skipping mutation (centrally confirmed) were assigned to Cohorts 4 (previously treated patients) or 5B (treatment-naïve), regardless of MET amplification/gene copy number and received 400 mg capmatinib tablets orally twice daily. The primary endpoint was ORR based on BIRC assessment per RECIST v1.1. The key secondary endpoint was DOR by BIRC.\n\nAbout Capmatinib\n\nCapmatinib (INC280) is an investigational, oral and selective MET inhibitor discovered by Incyte and licensed to Novartis in 2009. Under the terms of the Agreement, Incyte granted Novartis exclusive worldwide development and commercialization rights to capmatinib and certain back-up compounds in all indications. If capmatinib is successfully developed by Novartis, Incyte may become eligible for over $500 million in future milestones as well as royalties of between 12 and 14 percent on global sales by Novartis.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding the ongoing clinical development program for capmatinib and its potential in treating NSCLC, whether and when the FDA might approve capmatinib in the U.S., and whether and when Incyte may receive milestone payments or royalties from Novartis relating to capmatinib, contain predictions, estimates and other forward-looking statements.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ended September 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\n\nReferences\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200210005864/en/\nMedia\nCatalina Loveman +1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil +1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte Announces that the TRuE-AD2 Pivotal Trial of Ruxolitinib Cream Met its Primary Endpoint in Patients with Atopic Dermatitis",
        "subtitle": "",
        "date": "Jan 28, 2020 7:30AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) today announced positive topline results from its randomized, vehicle-controlled, pivotal Phase 3 TRuE-AD2 study evaluating the safety and efficacy of ruxolitinib cream in adolescent and adult patients (age ≥ 12 years) with atopic dermatitis (AD).\n\nThe study, part of the TRuE-AD clinical trial program, met its primary endpoint. Significantly more patients treated with ruxolitinib cream 0.75% and 1.5% achieved Investigator’s Global Assessment Treatment Success (IGA-TS) – defined as an IGA score of 0 (clear) or 1 (almost clear) with at least a two-point improvement from baseline at Week 8 – than patients treated with vehicle control (non-medicated cream). The overall efficacy and safety profile of ruxolitinib cream is consistent with previous data, and no new safety signals were observed. The long-term safety portion of the study will continue as planned.\n\n\"This positive topline result reinforces the potential of ruxolitinib cream, if approved, to offer AD patients a much-needed effective, non-steroidal therapy,\" said Jim Lee, M.D., Group Vice President, Inflammation & AutoImmunity, Incyte. \"We look forward to the results of the TRuE-AD1 trial, the second study in the pivotal clinical trial program, later this quarter, and to sharing these data with the medical community as part of our commitment to develop a new first-line treatment option for these patients.\"\n\nData from TRuE-AD2 will be submitted for presentation at an upcoming scientific meeting.\n\nAD is a common chronic disease characterized by inflammation of the skin. At least 11 million people in the United States have been diagnosed with and are being treated for AD. The majority of these patients have a mild or moderate form of the disease and approximately 80% are adults or adolescents. Signs and symptoms of AD include irritated and itchy skin that can cause red lesions that may ooze and crust. Patients with AD are also more susceptible to bacterial, viral and fungal infections.\n\nAbout TRuE-AD2\n\nTRuE-AD2 (NCT03745651) is an Incyte-sponsored randomized, double-blind, vehicle-controlled Phase 3 study evaluating the safety and efficacy of ruxolitinib cream compared to vehicle (non-medicated cream) in patients with atopic dermatitis (AD). The study enrolled over 600 patients (age ≥ 12 years) diagnosed with AD for at least two years and who are candidates for topical therapy.\n\nPatients with an Investigator’s Global Assessment (IGA) score of 2 to 3 (a measure of disease severity), and with AD involving between 3% to 20% of their Body Surface Area (BSA) (excluding scalp) were randomized 2:2:1 into one of three treatment arms for eight weeks, including: ruxolitinib cream 0.75% administered twice daily (BID); ruxolitinib cream 1.5% BID; and vehicle (non-medicated cream). Participants who successfully completed an assessment at Week 8 were offered participation in the 44-week long-term safety treatment extension period with ruxolitinib cream 0.75% or 1.5% BID.\n\nThe primary endpoint of TRuE-AD2 is the proportion of participants achieving an Investigator’s Global Assessment Treatment Success (IGA-TS), defined as an IGA score of 0 (clear) or 1 (almost clear) with at least a two-point improvement from baseline at Week 8. Other key secondary endpoints include: the proportion of patients achieving at least a 75% improvement from baseline in the Eczema Area and Severity Index (EASI) score – another measurement of disease extent and severity – or EASI75, and the proportion of participants with at least a four-point improvement in the itch numerical rating scale (NRS). The study is also tracking the frequency, duration and severity of adverse events associated with the use of ruxolitinib cream.\n\nFor more information about the study, please visit http://clinicaltrials.gov/ct2/show/NCT03745651.\n\nAbout TRuE-AD\n\nThe TRuE-AD clinical trial program is evaluating ruxolitinib cream in patients with atopic dermatitis (AD) and includes two Phase 3 studies: TRuE-AD1 (NCT03745638) and TRuE-AD2 (NCT03745651). The TRuE-AD1 trial is ongoing with initial results expected in the first quarter of 2020. For more information about TRuE-AD1, please visit http://clinicaltrials.gov/ct2/show/NCT03745638.\n\nAbout Ruxolitinib Cream \n\nRuxolitinib cream is a proprietary formulation of Incyte’s selective JAK1/JAK2 inhibitor ruxolitinib that has been designed for topical application. Ruxolitinib cream is currently in Phase 3 development for the treatment of patients with mild to moderate atopic dermatitis (TRuE-AD) and for the treatment of adolescents and adults with vitiligo (TRuE-V). Incyte has worldwide rights for the development and commercialization of ruxolitinib cream.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding the potential of ruxolitinib cream to become a first line treatment for patients with atopic dermatitis, the planned submission of the TRuE-AD data to the U.S. FDA, whether and when ruxolitinib cream will be approved by the U.S. FDA and the presentation of data from the Company’s ongoing clinical development program for ruxolitinib cream, contain predictions, estimates and other forward-looking statements.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ended September 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005173/en/\nIncyte Contacts\nMedia\nCatalina Loveman, +1 302 498 6171\ncloveman@incyte.com \n\nInvestors\nMichael Booth, DPhil, +1 302 498 5914\nmbooth@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte to Report Fourth Quarter and Year-End Financial Results",
        "subtitle": "",
        "date": "Jan 23, 2020 8:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) announced today that it has scheduled its fourth quarter and year-end 2019 financial results conference call and webcast for 8:00 a.m. ET on Thursday, February 13, 2020.\n\nThe schedule for the press release and conference call/webcast is as follows:\n\nIf you are unable to participate, a replay of the conference call will be available for thirty days. The replay dial-in number for the U.S. is 877-660-6853 and the dial-in number for international callers is 201-612-7415. To access the replay you will need the conference ID number 13698234.\n\nThe live webcast with slides can be accessed at Investor.Incyte.com and will be available for replay for 30 days.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005007/en/\nIncyte Contacts\nMedia\nCatalina Loveman +1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil +1 302 498 5914\nmbooth@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte Announces the Validation by the European Medicines Agency of its Marketing Authorization Application for Pemigatinib in Patients with Cholangiocarcinoma",
        "subtitle": "",
        "date": "Jan 7, 2020 6:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\n      Incyte (Nasdaq:INCY) today announced the validation of the Company’s\n      Marketing Authorization Application (MAA) for pemigatinib for the\n      treatment of adults with locally advanced or metastatic\n      cholangiocarcinoma with a fibroblast growth factor receptor 2 (FGFR2)\n      fusion or rearrangement that is relapsed or refractory after at least\n      one line of systemic therapy. The European Medicines Agency’s (EMA)\n      validation of the MAA confirms that the submission is sufficiently\n      complete to begin the formal review process.\n    \n      “The EMA’s validation of Incyte’s Marketing Authorization Application\n      opens the review process as we seek to bring the first targeted therapy\n      to Europe for patients with cholangiocarcinoma,” said Peter Langmuir,\n      M.D., Group Vice President, Targeted Therapeutics, Incyte. “The need for\n      new therapies for cholangiocarcinoma was also recently recognized by the\n      U.S. Food and Drug Administration’s acceptance, for Priority Review, of\n      our New Drug Application for pemigatinib this past November. We are\n      looking forward to continuing to work with regulatory authorities to\n      bring this novel targeted therapy to eligible patients around the world.”\n    \n      The MAA application is based on data from the FIGHT-202 study evaluating\n      pemigatinib as a treatment for patients with previously treated, locally\n      advanced or metastatic cholangiocarcinoma.1\n    \n      Cholangiocarcinoma is a rare cancer that forms in the bile duct. It is\n      classified based on its origin: intrahepatic cholangiocarcinoma (iCCA)\n      occurs in the bile duct inside the liver and extrahepatic\n      cholangiocarcinoma occurs in the bile duct outside the liver. Patients\n      with cholangiocarcinoma are often diagnosed at a late or advanced stage\n      when the prognosis is poor.2,3 The incidence of\n      cholangiocarcinoma varies regionally, but ranges between 0.4 – 1.8 per\n      100,000 in Europe.4 FGFR2 fusions or rearrangements occur\n      almost exclusively in iCCA, where they are observed in 10-16 percent of\n      patients.5-7\n    \n      About FIGHT-202\n    \n      The FIGHT-202 Phase 2, open-label, multicenter study (NCT02924376) is\n      evaluating the safety and efficacy of pemigatinib – a selective\n      fibroblast growth factor receptor (FGFR) inhibitor – in adult (age ≥ 18\n      years) patients with previously treated, locally advanced or metastatic\n      cholangiocarcinoma with documented FGF/FGFR status.\n    \n      Patients were enrolled into one of three cohorts – Cohort A (FGFR2\n      fusions or rearrangements), Cohort B (other FGF/FGFR genetic\n      alterations) or Cohort C (no FGF/FGFR genetic alterations). All patients\n      received 13.5 mg pemigatinib orally once daily (QD) on a 21-day cycle\n      (two weeks on/one week off) until radiological disease progression or\n      unacceptable toxicity.\n    \n      The primary endpoint of FIGHT-202 is overall response rate (ORR) in\n      Cohort A, assessed by independent review per RECIST v1.1. Secondary\n      endpoints include ORR in Cohorts B, A plus B, and C; progression free\n      survival (PFS), overall survival (OS), duration of response (DOR),\n      disease control rate (DCR) and safety in all cohorts.\n    \n      For more information about FIGHT-202, visit https://clinicaltrials.gov/ct2/show/NCT02924376.\n    \n      About FIGHT\n    \n      The FIGHT (FIbroblast Growth factor receptor in\n      oncology and Hematology Trials) clinical trial\n      program includes ongoing Phase 2 and 3 studies investigating safety and\n      efficacy of pemigatinib therapy across several FGFR-driven malignancies.\n      Phase 2 monotherapy studies include FIGHT-202, as well as FIGHT-201\n      investigating pemigatinib in patients with metastatic or surgically\n      unresectable bladder cancer, including with activating FGFR3 mutations\n      or fusions/rearrangements; FIGHT-203 in patients with myeloproliferative\n      neoplasms with activating FGFR1 fusions/rearrangements; FIGHT-207 in\n      patients with previously treated, locally-advanced/metastatic or\n      surgically unresectable solid tumor malignancies harboring activating\n      FGFR mutations or fusions/rearrangements, irrespective of tumor type.\n      FIGHT-205 is a Phase 2 study investigating pemigatinib plus\n      pembrolizumab combination therapy and pemigatinib monotherapy in\n      patients with previously untreated, metastatic or unresectable bladder\n      cancer harboring FGFR3 mutations or fusions/rearrangements who are not\n      eligible to receive cisplatin. FIGHT-302 is a recently initiated Phase 3\n      study investigating pemigatinib as a first-line treatment for patients\n      with cholangiocarcinoma with FGFR2 fusions or rearrangements.\n    \n      About FGFR and Pemigatinib\n    \n      Fibroblast growth factor receptors (FGFRs) play an important role in\n      tumor cell proliferation and survival, migration and angiogenesis (the\n      formation of new blood vessels). Activating fusions, rearrangements,\n      translocations and gene amplifications in FGFRs are closely correlated\n      with the development of various cancers.\n    \n      Pemigatinib is a potent, selective, oral inhibitor of FGFR isoforms 1, 2\n      and 3 which, in preclinical studies, has demonstrated selective\n      pharmacologic activity against cancer cells with FGFR alterations.\n    \n      About Incyte\n    \n      Incyte is a Wilmington, Delaware-based, global biopharmaceutical company\n      focused on finding solutions for serious unmet medical needs through the\n      discovery, development and commercialization of proprietary\n      therapeutics. For additional information on Incyte, please visit Incyte.com\n      and follow @Incyte.\n    \n      Forward Looking Statements\n    \n      Except for the historical information set forth herein, the matters set\n      forth in this press release, including statements regarding whether or\n      when pemigatinib might be approved in the EU, the US or elsewhere for\n      the treatment of, and whether or when pemigatinib might provide a\n      treatment option for, patients with previously treated, locally advanced\n      or metastatic cholangiocarcinoma with FGFR2 fusions or rearrangements,\n      and the FIGHT clinical trial program. These forward-looking statements\n      are based on the Company’s current expectations and subject to risks and\n      uncertainties that may cause actual results to differ materially,\n      including unanticipated developments in and risks related to:\n      unanticipated delays; further research and development and the results\n      of clinical trials possibly being unsuccessful or insufficient to meet\n      applicable regulatory standards or warrant continued development; the\n      ability to enroll sufficient numbers of subjects in clinical trials;\n      determinations made by the EMA; the Company’s dependence on its\n      relationships with its collaboration partners; the efficacy or safety of\n      the Company’s products and the products of the Company’s collaboration\n      partners; the acceptance of the Company’s products and the products of\n      the Company’s collaboration partners in the marketplace; market\n      competition; sales, marketing, manufacturing and distribution\n      requirements; greater than expected expenses; expenses relating to\n      litigation or strategic activities; and other risks detailed from time\n      to time in the Company’s reports filed with the Securities and Exchange\n      Commission, including its Form 10-Q for the quarter ending September 30,\n      2019. The Company disclaims any intent or obligation to update these\n      forward-looking statements.\n    \n      ____________________1 Vogel A, et al. FIGHT-202: A\n      Phase 2 Study of Pemigatinib in Patients with Previously Treated Locally\n      Advanced or Metastatic Cholangiocarcinoma. Proffered paper #2550.\n      European Society for Medical Oncology. 2019.2 Banales\n      JM, et al. Nat Rev Gastroenterol Hepatol. 2016;13:261‒280.3\n      Uhlig J, et al. Ann Surg Oncol. 2019;26:1993–2000.4\n      Blechacz B, et al. Gut and Liver. 2017; 11(1):13-265\n      Graham RP, et al. Hum Pathol. 2014;45:1630‒1638.6\n      Farshidfar F, et al. Cell Rep. 2017;18(11):2780–2794.7\n      Ross JS et al. The Oncologist. 2014;19:235–242.\n    \n    View source version on businesswire.com: https://www.businesswire.com/news/home/20200107005093/en/\n      MediaCatalina Loveman +1 302 498 6171cloveman@incyte.com\n    \n      Ela Zawislak + 41 21 343 3113ezawislak@incyte.com\n    \n      InvestorsMichael Booth, DPhil +1 302 498 5914mbooth@incyte.com\n    Source: Incyte Corporation"
    },
    {
        "title": "Incyte Announces Results of Phase 3 Study of Itacitinib in Patients with Treatment-Naïve Acute Graft-Versus-Host Disease",
        "subtitle": "",
        "date": "Jan 2, 2020 4:30PM EST",
        "content": "\n- GRAVITAS-301 results show that treatment with itacitinib in combination with corticosteroids did not statistically improve overall response rate or non-relapse mortality compared to placebo plus corticosteroids\n\n- Conference call scheduled today at 5:00 p.m. ET\n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) today announced that the pivotal Phase 3 GRAVITAS-301 study evaluating itacitinib in combination with corticosteroids in patients with treatment-naïve acute graft-versus-host disease (GVHD) did not meet the primary endpoint of improving overall response rate (ORR) at Day 28 compared to placebo plus corticosteroids (74.0 percent vs. 66.4 percent, p=0.08, respectively). Itacitinib added to corticosteroids improved the overall response rate in patients with treatment-naïve acute GVHD; however, the difference versus placebo plus corticosteroids was not statistically significant. In addition, there was no difference observed in non-relapse mortality (NRM) at Month 6, the study’s key secondary endpoint, between the treatment and placebo arms.\n\nThe safety profile observed in GRAVITAS-301 was consistent with that observed in previously reported studies of itacitinib in combination with corticosteroids. The most common adverse events were thrombocytopenia (34.9 percent for itacitinib and 34.7 percent for placebo) and anemia (29.8 percent for itacitinib and 25.0 percent for placebo).\n\n“The result of this study is disappointing. However, we remain committed to building on the success of the REACH program for ruxolitinib, which showed positive results in steroid refractory acute GVHD. Additionally we will continue to study the role of JAK inhibition in chronic GVHD and in the prophylactic setting, as we seek to develop treatments for patients with this debilitating and often fatal disease,” said Steven Stein, M.D., Chief Medical Officer, Incyte.\n\nIncyte will inform investigators of the results and work with them to appropriately conclude the study in a manner consistent with the best interest of each patient. Data from this study will be submitted for presentation at an upcoming scientific meeting.\n\nAbout GRAVITAS-301\n\nGRAVITAS-301 (NCT03139604) is a randomized, double-blind, placebo-controlled pivotal Phase 3 study evaluating itacitinib or placebo, in combination with corticosteroids, as a first-line treatment for patients with acute GVHD. The primary endpoint is overall response rate (ORR) at Day 28, defined as the proportion of subjects demonstrating a complete response, very good partial response, or partial response. The key secondary endpoint is non-relapse mortality at Month 6, defined as the proportion of subjects who died due to causes other than malignancy relapse. Other secondary endpoints include duration of response. For more information about the study, please visit https://clinicaltrials.gov/ct2/show/NCT03139604?term=gravitas&rank=2.\n\nAbout Itacitinib\n\nItacitinib (INCB039110) is a novel and selective JAK1 inhibitor currently in clinical studies for the first-line treatment of patients with acute and chronic GVHD.\n\nItacitinib was discovered at Incyte, and Incyte holds the global development and commercialization rights for itacitinib with the exception of China, where the rights to develop and commercialize itacitinib have been licensed to Innovent Biologics, Inc.\n\nConference Call Information\n\nIncyte will host a conference call at 5:00 p.m. ET on January 2, 2020. To access the conference call, please dial 877-407-3042 for domestic callers or 201-389-0864 for international callers. When prompted, provide the conference identification number, 13697736.\n\nIf you are unable to participate, a replay of the conference call will be available for 30 days. The replay dial-in number for the United States is 877-660-6853 and the dial-in number for international callers is 201-612-7415. To access the replay you will need the conference identification number, 13697736.\n\nThe conference call will also be webcast live and can be accessed at www.incyte.com in the Investors section under “Events and Presentations.”\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding the presentation of data from the Company’s ongoing clinical development program for itacitinib, development plans for ruxolitinib and further development in GVHD, contain predictions, estimates and other forward-looking statements.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ended September 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200102005480/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte Names New Member to Its Board of Directors",
        "subtitle": "",
        "date": "Dec 19, 2019 7:30AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) announces the appointment of Edmund P. Harrigan, M.D., as a new member of the Board of Directors, effective December 16, 2019.\n\n“We are delighted to welcome Edmund to Incyte. His extensive leadership experience in a variety of important areas including Clinical, Regulatory and Business Development will be instrumental as we continue to develop and commercialize innovative medicines for serious unmet medical conditions,” said Hervé Hoppenot, Chief Executive Officer, Incyte. “We look forward to benefiting from his valuable experience and further strengthening Incyte’s leadership.”\n\n“It is an exciting time to be joining Incyte as the company strives to advance clinical candidates from its diverse portfolio,” said Dr. Harrigan. “I look forward working closely with the team to deliver on the company’s commitment to improving the lives of patients worldwide and building sustainable value for stakeholders.”\n\nDr. Harrigan served in various senior roles at Pfizer, Inc., including Senior Vice President of Worldwide Safety and Regulatory from 2012 until his retirement in 2015. Dr. Harrigan’s previous executive leadership roles at Pfizer included Senior Vice President, Head of Worldwide Business Development; Senior Vice President, Head of Worldwide Regulatory Affairs and Quality Assurance; and Vice President, Head of Neuroscience and Ophthalmology. In addition, he has served in senior leadership positions at Karuna Pharmaceuticals, Inc., Sepracor Inc. and Neurogen Corporation. Prior to joining the pharmaceutical industry in 1990, Dr. Harrigan was a practicing neurologist for seven years. Dr. Harrigan earned his B.A. in Chemistry from St. Anselm College and M.D. from University of Massachusetts.\n\nAbout Incyte\n\nIncyte is a Wilmington, Delaware-based, global biopharmaceutical company focused on finding solutions for serious unmet medical needs through the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit Incyte.com and follow @Incyte. \n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this press release, including without limitation statements regarding the Company’s efforts to advance its clinical pipeline, improve the lives of patients and build value for stakeholders contain predictions, estimates and other forward-looking statements. These forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including risks related to market competition, the results of and risks associated with research and development, risks and uncertainties associated with sales, marketing and distribution requirements, and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ended September 30, 2019. Incyte disclaims any intent or obligation to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191219005068/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com \n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Dec 5, 2019 8:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) announced today that it will present at the J. P. Morgan 38th Annual Healthcare Conference on Monday, January 13, 2020 at 8:30 am (PST) in San Francisco.\n\nThe presentation will be webcast live and can be accessed at www.incyte.com under For Investors, Events and Presentations and will be available for replay for 30 days. Investors interested in listening to the live webcast should log on before the start time in order to download any software required.\n\nAbout Incyte\n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company's web site at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005001/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte Announces Acceptance and Priority Review of NDA for Pemigatinib as a Treatment for Patients with Cholangiocarcinoma",
        "subtitle": "",
        "date": "Nov 27, 2019 7:30AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) today announced that the U.S. Food and Drug Administration (FDA) has accepted for Priority Review its New Drug Application (NDA) for pemigatinib, a selective fibroblast growth factor receptor (FGFR) inhibitor, as a treatment for patients with previously treated, locally advanced or metastatic cholangiocarcinoma with FGFR2 fusions or rearrangements.\n\nThe NDA submission is based on data from the FIGHT-202 study evaluating pemigatinib as a treatment for patients with previously treated, locally advanced or metastatic cholangiocarcinoma. Study results, recently presented at the European Society for Medical Oncology (ESMO) 2019 Congress, demonstrated that in patients harboring FGFR2 fusions or rearrangements (Cohort A), pemigatinib monotherapy resulted in an overall response rate (ORR) of 36 percent (primary endpoint), and median duration of response (DOR) of 7.5 months (secondary endpoint) with a median follow-up of 15 months. Adverse events were manageable and consistent with the mechanism of action of pemigatinib.\n\n“There is a significant need for new therapies for patients with cholangiocarcinoma, who have limited treatment options beyond first-line chemotherapy and often face a poor prognosis,” said Peter Langmuir, M.D., Group Vice President, Targeted Therapeutics, Incyte. “We are very pleased that the FDA has accepted our NDA for Priority Review which we believe represents an important step toward providing the first treatment option for patients with previously treated, locally advanced or metastatic cholangiocarcinoma with FGFR2 fusions or rearrangements. We intend to work closely with the FDA to bring this innovative targeted therapy to patients suffering from this devastating disease as soon as possible.”\n\nThe FDA grants Priority Review to medicines that may offer a major advance in treatment where none currently exists. This designation shortens the review period to eight months compared to 12 months for Standard Review. The Prescription Drug User Fee Act (PDUFA) target action date is May 30, 2020.\n\nCholangiocarcinoma is a rare cancer that forms in the bile duct. It is classified based on its origin: intrahepatic cholangiocarcinoma (iCCA) occurs in the bile duct inside the liver and extrahepatic cholangiocarcinoma occurs in the bile duct outside the liver. Patients with cholangiocarcinoma are often diagnosed at a late or advanced stage when the prognosis is poor.1,2 The incidence of cholangiocarcinoma varies regionally and ranges between 0.3 – 3.4 per 100,000 in North America and Europe.1 FGFR2 fusions or rearrangements occur almost exclusively in iCCA, where they are observed in 10-16 percent of patients.3-5\n\nAbout FIGHT-202\n\nThe FIGHT-202 Phase 2, open-label, multicenter study (NCT02924376) is evaluating the safety and efficacy of pemigatinib – a selective fibroblast growth factor receptor (FGFR) inhibitor – in adult (age ≥ 18 years) patients with previously treated, locally advanced or metastatic cholangiocarcinoma with documented FGF/FGFR status.\n\nPatients were enrolled into one of three cohorts – Cohort A (FGFR2 fusions or rearrangements), Cohort B (other FGF/FGFR genetic alterations) or Cohort C (no FGF/FGFR genetic alterations). All patients received 13.5 mg pemigatinib orally once daily (QD) on a 21-day cycle (two weeks on/one week off) until radiological disease progression or unacceptable toxicity.\n\nThe primary endpoint of FIGHT-202 is overall response rate (ORR) in Cohort A, assessed by independent review per RECIST v1.1. Secondary endpoints include ORR in Cohorts B, A plus B, and C; progression free survival (PFS), overall survival (OS), duration of response (DOR), disease control rate (DCR) and safety in all cohorts.\n\nFor more information about FIGHT-202, visit https://clinicaltrials.gov/ct2/show/NCT02924376.\n\nAbout FIGHT \n\nThe FIGHT (FIbroblast Growth factor receptor in oncology and Hematology Trials) clinical trial program includes ongoing Phase 2 and 3 studies investigating safety and efficacy of pemigatinib therapy across several FGFR-driven malignancies. Phase 2 monotherapy studies include FIGHT-202, as well as FIGHT-201 investigating pemigatinib in patients with metastatic or surgically unresectable bladder cancer, including with activating FGFR3 mutations or fusions/rearrangements; FIGHT-203 in patients with myeloproliferative neoplasms with activating FGFR1 fusions/rearrangements; FIGHT-207 in patients with previously treated, locally-advanced/metastatic or surgically unresectable solid tumor malignancies harboring activating FGFR mutations or fusions/rearrangements, irrespective of tumor type. FIGHT-205 is a Phase 2 study investigating pemigatinib plus pembrolizumab combination therapy and pemigatinib monotherapy in patients with previously untreated, metastatic or unresectable bladder cancer harboring FGFR3 mutations or fusions/rearrangements who are not eligible to receive cisplatin. FIGHT-302 is a recently initiated Phase 3 study investigating pemigatinib as a first-line treatment for patients with cholangiocarcinoma with FGFR2 fusions or rearrangements.\n\nAbout FGFR and Pemigatinib \n\nFibroblast growth factor receptors (FGFRs) play an important role in tumor cell proliferation and survival, migration and angiogenesis (the formation of new blood vessels). Activating fusions, rearrangements, translocations and gene amplifications in FGFRs are closely correlated with the development of various cancers.\n\nPemigatinib is a potent, selective, oral inhibitor of FGFR isoforms 1, 2 and 3 which, in preclinical studies, has demonstrated selective pharmacologic activity against cancer cells with FGFR alterations. The U.S. Food and Drug Administration (FDA) has granted pemigatinib Breakthrough Therapy designation for the treatment of previously treated, advanced/metastatic or unresectable FGFR2 translocated cholangiocarcinoma. The FDA’s Breakthrough Therapy designation is designed to expedite the development and review of drugs for serious conditions that have shown encouraging early clinical results and may demonstrate substantial improvements over available medicines. Additionally, the FDA granted pemigatinib Orphan Drug designation for the treatment of cholangiocarcinoma, a designation granted to investigational compounds intended for the safe and effective treatment, diagnosis or prevention of rare diseases or disorders that affect fewer than 200,000 people.\n\nAbout Incyte \n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company’s website at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\n\nForward Looking Statements \n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding whether or when pemigatinib might be approved in the U.S. for the treatment of, and whether or when pemigatinib might provide a treatment option for, patients with previously treated, locally advanced or metastatic cholangiocarcinoma with FGFR2 fusions or rearrangements, and the FIGHT clinical trial program. These forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ending September 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\n\n1 Banales JM, et al. Nat Rev Gastroenterol Hepatol. 2016;13:261‒280.\n2 Uhlig J, et al. Ann Surg Oncol. 2019;26:1993–2000.\n3 Graham RP, et al. Hum Pathol. 2014;45:1630‒1638.\n4 Farshidfar F, et al. Cell Rep. 2017;18(11):2780–2794.\n5 Ross JS et al. The Oncologist. 2014;19:235–242.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191127005145/en/\nMedia\nJenifer Antonacci +1 302 498 7036\njantonacci@incyte.com\nCatalina Loveman +1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil +1 302 498 5914\nmbooth@incyte.com \nSource: Incyte"
    },
    {
        "title": "Data from Incyte’s Oncology Portfolio Accepted for Presentation at the 61st Annual ASH Meeting",
        "subtitle": "",
        "date": "Nov 25, 2019 8:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) announces that numerous abstracts, including data from its clinical development programs for ruxolitinib (Jakafi®), itacitinib and ponatinib (Iclusig®) will be presented at the upcoming American Society of Hematology (ASH) Annual Meeting 2019 in Orlando, Florida from December 7-10, 2019.\n\n“We look forward to ASH 2019 and the opportunity to present data for our approved and late stage compounds from our oncology portfolio,” said Steven Stein, M.D., Chief Medical Officer, Incyte. “These data strengthen the body of evidence supporting treatments that may deliver meaningful benefit for patients with rare cancers like polycythemia vera and myelofibrosis, leukemias and serious conditions such as graft-versus-host disease.”\n\nSelect key abstract presentations include:\n\nOral Presentations\n\nRisk of Hemorrhage in Patients with Polycythemia Vera Exposed to Aspirin in Combination with Anticoagulants: Results of a Prospective, Multicenter, Observational Cohort Study (REVEAL) (Abstract #168)\n\nPoster Sessions\n\nRuxolitinib (Jakafi): Myeloproliferative Neoplasms \n\nU.S. OPTUM Database Study in Polycythemia Vera Patients: Thromboembolic Events (TEs) with Hydroxyurea (HU) vs Ruxolitinib Switch Therapy and Machine-Learning Model to Predict Incidence of TEs and HU Failure (Abstract #1659)1\n\nA Retrospective Real-World Study of the Current Treatment Pathways for Myelofibrosis in the UK (The REALISM UK Study) (Abstract #1671)1\n\nPatient-Reported Outcomes (PRO) Data from Patients (Pts) with Essential Thrombocythemia (ET) Enrolled in the MOST Study (Abstract #1665)\n\nRuxolitinib (RUX) Induced Meaningful and Directional Changes in the Bone Marrow Microenvironment of Patients with Myelofibrosis Enrolled in the COMFORT-I Study (Abstract #2948)\n\nBaseline Mutational Status of Patients with Myelofibrosis and Anemia in the REALISE Trial and Impact on Outcome (Abstract #2952)1\n\nRuxolitinib for Patients (Pts) with Polycythemia Vera: Responders vs Non-Responders as Defined in the RESPONSE Trial (Abstract #2947)1\n\nDisease and Clinical Characteristics of Patients with Myelofibrosis Enrolled in the MOST Study (Abstract #4190)\n\nReal-World Dosing Patterns of Ruxolitinib in Patients with Polycythemia Vera Who Are Resistant to or Intolerant of Hydroxyurea (Abstract #4192)\n\nAdherence to Treatment in Myelofibrosis Patients: Preliminary Results from Italian ROMEI Observational Study (Abstract #4179)1\n\nImpact of Disease Burden in Myelofibrosis Patients: A Sub Analysis from Italian ROMEI Observational Study (Abstract #4188)1\n\nRuxolitinib (Jakafi): Graft-Versus-Host Disease \n\nDisease Progression, Hospital Readmissions, and Clinical Outcomes of Patients with Steroid-Refractory Acute Graft-Versus-Host Disease: A Multicenter Chart Review (Abstract #1994)\n\nPopulation Pharmacokinetics of Ruxolitinib in Patients with aGVHD Who Had an Inadequate Response to Corticosteroids (Abstract #4534)\n\nStratification of Responders and Non-Responders in the REACH-1 Trial Based on Serum Proteomic Analysis (Abstract #4531)\n\nItacitinib\n\nProphylactic Itacitinib (INCB039110) for the Prevention of Cytokine Release Syndrome Induced by Chimeric Antigen Receptor T-Cells (CAR-T-cells) Therapy (Abstract #1934)\n\nA Biomarker Signature to Predict Complete Response to Itacitinib and Corticosteroids in Acute Graft Versus Host Disease (Abstract #3279)\n\nPonatinib (Iclusig)\n\nMulticenter, Prospective and Retrospective Observational Cohort Study of Ponatinib in Patients with CML in Italy: Interim Analysis of the OITI Trial (Abstract #1652)\n\nReal-World Treatment Patterns, Health-Care Costs and Predictors for TKI Changes in CML: Results from a Population Representative German Claims Data Analysis (Abstract #1645)\n\nInterim Analysis of a Prospective Multicentre Study Using Next Generation Sequencing for Kinase Domain Mutational Analysis in CML Patients on First or Subsequent TKI Therapy (Abstract #2935)\n\nSequence of Second Generation Tyrosine Kinase Inhibitors (TKIs) in the Treatment of Patients with Chronic Phase Philadelphia Chromosome-Positive Chronic Myeloid Leukaemia - Real World Experience in the UK (Abstract #3434)\n\nUltra-Accurate Assessment of Pretreatment ABL1 Kinase Domain (KD) Mutations in Patients (Pts) with Newly Diagnosed Philadelphia Chromosome-Positive Acute Lymphoblastic Leukemia (Ph+ ALL) Using Duplex Sequencing (DS)2\n\nReal-Life Outcomes of Ponatinib Treatment in Patients with Chronic Myeloid Leukemia (CML) and Philadelphia Chromosome-Positive Acute Lymphoblastic Leukemia (Ph+ ALL): Data from a Nationwide Belgian Registry (Abstract #4161)\n\nMajor Adverse Cardiac, Arterial Occlusive, and Venous Occlusive Events Among Chronic Myeloid Leukemia Patients Prescribed Ponatinib vs Bosutinib (Abstract #4751)\n\nFull session details and data presentation listings for ASH 2019 can be found at https://ash.confex.com/ash/2019/webprogram/start.html.\n\nAbout Jakafi® (ruxolitinib)\n\nJakafi is a first-in-class JAK1/JAK2 inhibitor approved by the U.S. FDA for treatment of steroid-refractory acute GVHD in adult and pediatric patients 12 years and older.\n\nJakafi is also indicated for treatment of polycythemia vera (PV) in adults who have had an inadequate response to or are intolerant of hydroxyurea as well as adults with intermediate or high-risk myelofibrosis (MF), including primary MF, post-polycythemia vera MF and post-essential thrombocythemia MF.\n\nJakafi is marketed by Incyte in the United States and by Novartis as Jakavi® (ruxolitinib) outside the United States. Jakafi is a registered trademark of Incyte Corporation. Jakavi is a registered trademark of Novartis AG in countries outside the United States.\n\nAbout Iclusig® (ponatinib) \n\nIclusig targets not only native BCR-ABL but also its isoforms that carry mutations that confer resistance to treatment, including the T315I mutation, which has been associated with resistance to other approved TKIs.\n\nIn the EU, Iclusig is approved for the treatment of adult patients with chronic phase, accelerated phase or blast phase chronic myeloid leukemia (CML) who are resistant to dasatinib or nilotinib; who are intolerant to dasatinib or nilotinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation, or the treatment of adult patients with Philadelphia-chromosome positive acute lymphoblastic leukemia (Ph+ ALL) who are resistant to dasatinib; who are intolerant to dasatinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation.\n\nIncyte has an exclusive license from ARIAD Pharmaceuticals, Inc., since acquired by Takeda Pharmaceutical Company Limited, to develop and commercialize Iclusig in the European Union and 22 other countries, including Switzerland, Norway, Turkey, Israel and Russia.\n\nAbout Incyte\n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company’s website at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding the Company’s development pipeline and its presentation plans for the upcoming ASH annual meeting, contain predictions, estimates and other forward-looking statements.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ended September 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\n\n1 Novartis-sponsored abstract.\n2 Takeda-sponsored abstract.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191125005113/en/\nIncyte Contacts\nMedia\nCatalina Loveman, +1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil, +1 302 498 5914\nmbooth@incyte.com\nSource: Incyte"
    },
    {
        "title": "Incyte to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Nov 14, 2019 8:00AM EST",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) announced today that it will present at the Piper Jaffray 31st Annual Healthcare Conference on Wednesday, December 4, 2019 at 8:30 am (EST) in New York.\n\nThe presentation will be webcast live and can be accessed at www.incyte.com under For Investors, Events and Presentations and will be available for replay for 30 days. Investors interested in listening to the live webcast should log on before the start time in order to download any software required.\n\nAbout Incyte\n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company's web site at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191114005002/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte Reports 2019 Third Quarter Financial Results and Provides Updates on Key Clinical Programs",
        "subtitle": "",
        "date": "Oct 29, 2019 7:00AM EDT",
        "content": "\nConference Call and Webcast Scheduled Today at 8:00 a.m. EDT\n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) today reports 2019 third quarter financial results and provides a status update on the Company’s development portfolio.\n\n“Revenue growth continues to be very strong, driven by robust demand for Jakafi (ruxolitinib) in all three approved indications and, as a result, we are raising guidance for full year Jakafi net sales,” stated Hervé Hoppenot, Chief Executive Officer, Incyte. “At the beginning of 2019, we laid out an ambitious set of development goals for our late-stage portfolio, and in the third quarter we have continued to execute against them. The recent clinical success in the REACH2 trial of ruxolitinib in steroid-refractory acute GVHD; the updated data from pemigatinib in cholangiocarcinoma and subsequent NDA submission; and the recently-presented 52-week data from the randomized Phase 2 trial of ruxolitinib cream in vitiligo are all illustrative of the significant progress we have made this year.”\n\nPortfolio Update\n\nOncology – key highlights\n\nThe positive result of REACH2, the Phase 3 study evaluating ruxolitinib in patients with steroid-refractory acute graft-versus-host disease (GVHD), was announced in October. The study met its primary endpoint of superior overall response rate (ORR) at Day 28 with ruxolitinib treatment compared to best available therapy. No new safety signals were observed, and the ruxolitinib safety profile in REACH2 was consistent with that seen in previously reported studies in steroid-refractory acute GVHD.\n\nA recent interim efficacy and safety analysis conducted by an Independent Data Monitoring Committee (IDMC) recommended that the Phase 3 REACH3 trial of ruxolitinib in patients with steroid-refractory chronic GVHD should continue without modification. The result of REACH3 is expected in 2020.\n\nThe top-line result from GRAVITAS-301, the Phase 3 trial of itacitinib as a treatment for patients with newly diagnosed acute GVHD, is expected to be available at the end of 2019. GRAVITAS-309, a Phase 3 trial of itacitinib as a treatment for patients with newly diagnosed chronic GVHD, was initiated in January of this year with results expected in 2021.\n\nThe NDA seeking approval for pemigatinib as a second-line treatment for cholangiocarcinoma patients with FGFR2 fusions or rearrangements was submitted to the U.S. Food and Drug Administration (FDA) under Breakthrough Therapy designation. Data from FIGHT-202, which supported the NDA, were presented at the recent European Society for Medical Oncology (ESMO) Congress.\n\nEnrollment in the continuous dosing cohort of FIGHT-201, the Phase 2 trial of pemigatinib in patients with bladder cancer, is expected to complete by the end of 2019 and FIGHT-207, a Phase 2 solid tumor-agnostic trial evaluating pemigatinib in patients with driver-activations of FGF/FGFR, has been initiated.\n\nNotes:\n\nInflammation and autoimmunity (IAI) – key highlights\n\nEvidence of continued improvement with longer-term treatment was shown in the 52-week data from the randomized Phase 2 trial of ruxolitinib cream in patients with vitiligo, which were recently presented at the European Academy of Dermatology and Venereology (EADV) Congress. The Phase 3 TRuE-V development program of ruxolitinib cream in patients with vitiligo was initiated in September, with initial results expected in 2021.\n\nThe Phase 3 TRuE-AD development program of ruxolitinib cream in patients with atopic dermatitis is ongoing, with initial results expected in the first half of 2020.\n\nDiscovery and early development – key highlights\n\nIncyte’s portfolio of earlier-stage clinical candidates is detailed below.\n\nNotes:\n\nPartnered – key highlights\n\nThe status of Incyte’s partnered compounds is detailed below.\n\nNotes:\n\n2019 Third-Quarter and Year-to-Date Financial Results \n\nThe financial measures presented in this press release for the three and nine months ended September 30, 2019 and 2018 have been prepared by the Company in accordance with U.S. Generally Accepted Accounting Principles (“GAAP”), unless otherwise identified as a Non-GAAP financial measure. Management believes that Non-GAAP information is useful for investors, when considered in conjunction with Incyte’s GAAP disclosures. Management uses such information internally and externally for establishing budgets, operating goals and financial planning purposes. These metrics are also used to manage the Company’s business and monitor performance. The Company adjusts, where appropriate, for expenses in order to reflect the Company’s core operations. The Company believes these adjustments are useful to investors by providing an enhanced understanding of the financial performance of the Company’s core operations. The metrics have been adopted to align the Company with disclosures provided by industry peers.\n\nBeginning in the first quarter of 2019, after reviewing our Reconciliation of GAAP Net Income to Selected Non-GAAP Adjusted Information with the U.S. Securities & Exchange Commission, we no longer adjust for upfront consideration and milestones that are part of collaboration agreements with new or existing partners. This revised methodology is reflected in this press release for the three and nine months ended September 30, 2019 and 2018.\n\nNon-GAAP information is not prepared under a comprehensive set of accounting rules and should only be used in conjunction with and to supplement Incyte’s operating results as reported under GAAP. Non-GAAP measures may be defined and calculated differently by other companies in our industry.\n\nThe Company’s 2019 financial guidance related to research and development and selling, general and administrative expenses does not include estimates associated with any potential future strategic transactions.\n\nRevenues\n\nFor the quarter ended September 30, 2019, net product revenues of Jakafi were $433 million as compared to $348 million for the same period in 2018, representing 25 percent growth. For the nine months ended September 30, 2019, net product revenues of Jakafi were $1.2 billion as compared to $1.0 billion for the same period in 2018, representing 21 percent growth. For the quarter ended September 30, 2019, net product revenues of Iclusig® (ponatinib) were $21 million as compared to $20 million for the same period in 2018. For the nine months ended September 30, 2019, net product revenues of Iclusig were $66 million as compared to $61 million for the same period in 2018.\n\nFor the quarter and nine months ended September 30, 2019, product royalties from sales of Jakavi® (ruxolitinib), which has been out-licensed to Novartis outside of the United States, were $58 million and $161 million, respectively, as compared to $51 million and $139 million, respectively, for the same periods in 2018. For the quarter and nine months ended September 30, 2019, product royalties from sales of Olumiant® (baricitinib), which has been out-licensed to Lilly globally, were $22 million and $57 million, respectively, as compared to $11 million and $26 million, respectively, for the same periods in 2018.\n\nFor the quarter and nine months ended September 30, 2019, milestone and contract revenues earned from our collaborative partners were $18 million and $78 million, respectively, as compared to $20 million and $120 million, respectively, for the same periods in 2018.\n\nFor the quarter and nine months ended September 30, 2019, total revenues were $552 million and $1.6 billion, respectively, as compared to $450 million and $1.4 billion, respectively, for the same periods in 2018.\n\nCost of product revenues GAAP cost of product revenues for the quarter and nine months ended September 30, 2019 was $30 million and $82 million, respectively, as compared to $25 million and $68 million, respectively, for the same periods in 2018. Non-GAAP cost of product revenues for the quarter and nine months ended September 30, 2019 was $24 million and $65 million, respectively, as compared to $19 million and $52 million, respectively, for the same periods in 2018. Non-GAAP cost of product revenues excludes the amortization of licensed intellectual property for Iclusig relating to the acquisition of the European business of ARIAD Pharmaceuticals, Inc. and the cost of stock-based compensation.\n\nResearch and development expenses GAAP research and development expenses for the quarter and nine months ended September 30, 2019 were $281 million and $841 million, respectively, as compared to $293 million and $894 million, respectively, for the same periods in 2018. The decrease in GAAP research and development expenses over the prior year quarter and prior year nine month period was driven primarily by our decision to no longer co-fund the development of baricitinib with Lilly and lower costs related to the epacadostat program, partially offset by costs to advance our other internal development programs.\n\nNon-GAAP research and development expenses for the quarter and nine months ended September 30, 2019 were $251 million and $756 million, respectively, including upfront and milestone expenses related to collaborative agreements of $0 million and $25 million, respectively. Non-GAAP research and development expenses for the quarter and nine months ended September 30, 2018 were $266 million and $818 million, respectively, including upfront and milestone expenses related to collaborative agreements of $15 million and $47 million, respectively. Non-GAAP research and development expenses exclude the cost of stock-based compensation.\n\nSelling, general and administrative expenses GAAP selling, general and administrative expenses for the quarter and nine months ended September 30, 2019 were $103 million and $333 million, respectively, as compared to $97 million and $326 million, respectively, for the same periods in 2018.\n\nNon-GAAP selling, general and administrative expenses for the quarter and nine months ended September 30, 2019 were $90 million and $294 million, respectively, as compared to $85 million and $291 million, respectively, for the same periods in 2018. Non-GAAP selling, general and administrative expenses exclude the cost of stock-based compensation.\n\nChange in fair value of acquisition-related contingent consideration GAAP change in fair value of acquisition-related contingent consideration for the quarter and nine months ended September 30, 2019 and was $3 million and $17 million, respectively, as compared to $5 million and $19 million, respectively, for the same periods in 2018.\n\nUnrealized gain (loss) on long term investments GAAP unrealized gain on long term investments for the quarter and nine months ended September 30, 2019 was $2 million and $19 million, respectively. GAAP unrealized loss on long term investments for the quarter and nine months ended September 30, 2018 was $10 million and $22 million, respectively. The unrealized gain (loss) on long term investments represents the fair market value adjustments of the Company’s investments in Agenus, Calithera, Merus and Syros.\n\nNet income GAAP net income for the quarter ended September 30, 2019 was $128 million, or $0.60 per basic and $0.59 per diluted share, as compared to net income of $29 million, or $0.14 per basic and diluted share for the same period in 2018. GAAP net income for the nine months ended September 30, 2019 was $336 million, or $1.57 per basic and $1.55 per diluted share, as compared to net income of $40 million, or $0.19 per basic and diluted share for the same period in 2018.\n\nNon-GAAP net income for the quarter ended September 30, 2019 was $179 million, or $0.83 per basic and $0.82 per diluted share, as compared to Non-GAAP net income of $87 million, or $0.41 per basic and diluted share for the same period in 2018. Non-GAAP net income for the nine months ended September 30, 2019 was $476 million, or $2.22 per basic and $2.19 per diluted share, as compared to Non-GAAP net income of $208 million, or $0.98 per basic and $0.97 per diluted share for the same period in 2018.\n\nCash, cash equivalents and marketable securities position As of September 30, 2019 and December 31, 2018, cash, cash equivalents and marketable securities totaled $2.0 billion and $1.4 billion, respectively.\n\n2019 Financial Guidance \n\nThe Company has updated its full year 2019 financial guidance, as detailed below.\n\nFuture Non-GAAP financial measures may also exclude impairment of goodwill or other assets, changes in the fair value of equity investments in our collaboration partners, non-cash interest expense related to the amortization of the initial discount on our 2020 Senior Notes and the impact on our tax provision of discrete changes in our valuation allowance position on deferred tax assets.\n\nConference Call and Webcast Information\n\nIncyte will hold a conference call and webcast this morning at 8:00 a.m. EDT. To access the conference call, please dial 877-407-3042 for domestic callers or 201-389-0864 for international callers. When prompted, provide the conference identification number, 13695247.\n\nIf you are unable to participate, a replay of the conference call will be available for 30 days. The replay dial-in number for the United States is 877-660-6853 and the dial-in number for international callers is 201-612-7415. To access the replay you will need the conference identification number, 13695247.\n\nThe conference call will also be webcast live and can be accessed at www.incyte.com in the Investors section under “Events and Presentations”.\n\nAbout Incyte \n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company’s website at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\n\nAbout Jakafi® (ruxolitinib)\n\nJakafi is a first-in-class JAK1/JAK2 inhibitor approved by the U.S. FDA for treatment of steroid-refractory acute GVHD in adult and pediatric patients 12 years and older.\n\nJakafi is also indicated for treatment of polycythemia vera (PV) in adults who have had an inadequate response to or are intolerant of hydroxyurea as well as adults with intermediate or high-risk myelofibrosis (MF), including primary MF, post-polycythemia vera MF and post-essential thrombocythemia MF.\n\nJakafi is marketed by Incyte in the United States and by Novartis as Jakavi® (ruxolitinib) outside the United States. Jakafi is a registered trademark of Incyte Corporation. Jakavi is a registered trademark of Novartis AG in countries outside the United States.\n\nAbout Iclusig® (ponatinib) tablets\n\nIclusig targets not only native BCR-ABL but also its isoforms that carry mutations that confer resistance to treatment, including the T315I mutation, which has been associated with resistance to other approved TKIs.\n\nIn the EU, Iclusig is approved for the treatment of adult patients with chronic phase, accelerated phase or blast phase chronic myeloid leukemia (CML) who are resistant to dasatinib or nilotinib; who are intolerant to dasatinib or nilotinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation, or the treatment of adult patients with Philadelphia-chromosome positive acute lymphoblastic leukemia (Ph+ ALL) who are resistant to dasatinib; who are intolerant to dasatinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation.\n\nIncyte has an exclusive license from ARIAD Pharmaceuticals, Inc., since acquired by Takeda Pharmaceutical Company Limited, to develop and commercialize Iclusig in the European Union and 22 other countries, including Switzerland, Norway, Turkey, Israel and Russia.\n\nForward-Looking Statements\n\nExcept for the historical information set forth herein, the matters set forth in this release contain predictions, estimates and other forward-looking statements, including without limitation statements regarding: the revision to the Company’s 2019 Jakafi revenue guidance range; the expected timing of results of the trials evaluating ruxolitinib and itacitinib in GVHD; the expected date of completion of enrollment in the Phase 2 trial of pemigatinib in patients with bladder cancer; expectations of the Company’s collaboration partner for the submission of an NDA for capmatinib; the expected timing of the receipt of data from the Phase 3 trials of ruxolitinib cream in vitiligo and atopic dermatitis; and the Company’s updated financial guidance for 2019 and the expectations underlying such guidance.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company's dependence on its relationships with and changes in the plans of its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; unexpected variations in the demand for the Company’s products; sales, marketing, manufacturing and distribution requirements; greater than expected expenses, including expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its quarterly report on Form 10-Q for the quarter ended June 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005365/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Oct 22, 2019 8:00AM EDT",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) announced today that it will present at the Credit Suisse 28th Annual Healthcare Conference on Tuesday, November 12, 2019 at 8:35 am (MST) / 10:35 am (EST) in Scottsdale, Arizona.\n\nThe presentation will be webcast live and can be accessed at www.incyte.com under For Investors, Events and Presentations and will be available for replay for 30 days. Investors interested in listening to the live webcast should log on before the start time in order to download any software required.\n\nAbout Incyte\n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company's web site at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005001/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte Announces that the REACH2 Pivotal Trial of Ruxolitinib (Jakafi®) Meets Primary Endpoint in Patients with Steroid-Refractory Acute Graft-Versus-Host Disease",
        "subtitle": "",
        "date": "Oct 16, 2019 7:00AM EDT",
        "content": "\n- Results of randomized Phase 3 REACH2 trial show that ruxolitinib significantly improves overall response rate (ORR) at 28 days vs. best available therapy in patients with steroid-refractory acute graft-versus-host disease (GvHD)\n\n- Full results expected to be submitted to an upcoming scientific meeting\n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) today announced positive results from the Novartis-sponsored pivotal Phase 3 REACH2 study evaluating ruxolitinib (Jakafi®) in patients with steroid-refractory acute graft-versus-host disease (GVHD). The study met its primary endpoint of improving overall response rate (ORR) at Day 28 with ruxolitinib treatment compared to best available therapy. No new safety signals were observed, and the ruxolitinib safety profile in REACH2 was consistent with that seen in previously reported studies in steroid-refractory acute GVHD.\n\nFurther analysis of the safety and efficacy data is ongoing. Novartis expects to initiate discussions with ex-U.S. regulatory authorities in 2020, and to submit REACH2 results for presentation at an upcoming scientific meeting.\n\n“GVHD is a challenging and serious disease, and physicians around the world need access to therapies that can improve outcomes for patients,” said Peter Langmuir, M.D., Group Vice President, Targeted Therapies, Incyte. “This positive result of the REACH2 study is excellent news for patients as it further reinforces the potential of ruxolitinib as a treatment option that can provide meaningful results for patients with steroid-refractory acute GVHD.”\n\nGVHD is a condition that can occur after an allogeneic transplant (the transfer of stem cells from a donor) where the donated cells initiate an immune response and attack the transplant recipient’s organs, leading to significant morbidity and mortality. There are two major forms of GVHD, acute and chronic, that can affect multiple organ systems including the skin, gastrointestinal (digestive) tract and liver.\n\nEarlier this year, Jakafi was approved by the U.S. Food and Drug Administration (FDA) for the treatment of steroid-refractory acute GVHD in adult and pediatric patients 12 years and older based on results of the REACH1 trial. Jakafi is marketed by Incyte in the U.S.; ruxolitinib (Jakavi®) is licensed to Novartis ex-U.S.\n\nIn addition, the pivotal REACH3 trial evaluating ruxolitinib in patients with steroid-refractory chronic GVHD is ongoing. A recent interim efficacy and safety analysis conducted by an Independent Data Monitoring Committee has recommended that REACH3, which is co-sponsored by Incyte and Novartis, should continue without modification. The results of the REACH3 trial are expected to be available in 2020.\n\nAbout REACH2\n\nREACH2 (NCT02913261) is a randomized, open-label, multicenter Phase 3 study sponsored by Novartis, evaluating safety and efficacy of ruxolitinib compared with best available therapy in patients with steroid-refractory acute GVHD.\n\nThe primary endpoint was overall response rate (ORR) at Day 28, defined as the proportion of patients demonstrating a best overall response (complete response or partial response). Secondary endpoints include durable ORR at Day 56, ORR at Day 14, duration of response, overall survival and event-free survival, among others. For more information about the study, please visit https://clinicaltrials.gov/ct2/show/NCT02913261.\n\nAbout REACH\n\nThe REACH clinical trial program is evaluating Jakafi in patients with steroid-refractory GVHD and includes the collaborative Novartis-sponsored randomized pivotal Phase 3 trials: REACH2 and REACH3. The ongoing REACH3 trial is evaluating patients with steroid-refractory chronic GVHD with results expected next year. For more information about the REACH3 study, please visit https://clinicaltrials.gov/ct2/show/NCT03112603.\n\nThe REACH program was initiated with the Incyte-sponsored REACH1 trial, a prospective, open-label, single-cohort, multicenter, pivotal Phase 2 trial (NCT02953678) evaluating Jakafi in combination with corticosteroids in patients with steroid-refractory grade II-IV acute GVHD. For more information about the study, including trial results, please visit https://clinicaltrials.gov/show/NCT02953678.\n\nAbout Jakafi® (ruxolitinib)\n\nJakafi is a first-in-class JAK1/JAK2 inhibitor approved by the U.S. FDA for treatment of steroid-refractory acute GVHD in adult and pediatric patients 12 years and older.\n\nJakafi is also indicated for treatment of polycythemia vera (PV) in adults who have had an inadequate response to or are intolerant of hydroxyurea as well as adults with intermediate or high-risk myelofibrosis (MF), including primary MF, post-polycythemia vera MF and post-essential thrombocythemia MF.\n\nJakafi is marketed by Incyte in the United States and by Novartis as Jakavi® (ruxolitinib) outside the United States. Jakafi is a registered trademark of Incyte Corporation. Jakavi is a registered trademark of Novartis AG in countries outside the United States.\n\nImportant Safety Information\n\nJakafi can cause serious side effects, including:\n\nLow blood counts: Jakafi® (ruxolitinib) may cause your platelet, red blood cell, or white blood cell counts to be lowered. If you develop bleeding, stop taking Jakafi and call your healthcare provider. Your healthcare provider will perform blood tests to check your blood counts before you start Jakafi and regularly during your treatment. Your healthcare provider may change your dose of Jakafi or stop your treatment based on the results of your blood tests. Tell your healthcare provider right away if you develop or have worsening symptoms such as unusual bleeding, bruising, tiredness, shortness of breath, or a fever.\n\nInfection: You may be at risk for developing a serious infection during treatment with Jakafi. Tell your healthcare provider if you develop any of the following symptoms of infection: chills, nausea, vomiting, aches, weakness, fever, painful skin rash or blisters.\n\nSkin cancers: Some people who take Jakafi have developed certain types of non-melanoma skin cancers. Tell your healthcare provider if you develop any new or changing skin lesions.\n\nIncreases in cholesterol: You may have changes in your blood cholesterol levels. Your healthcare provider will do blood tests to check your cholesterol levels during your treatment with Jakafi.\n\nThe most common side effects of Jakafi include: for certain types of MF and PV - low platelet count, low red blood cell count, bruising, dizziness, and headache; and for acute GVHD – low red blood cell counts, low platelet counts, low white blood cell counts, infections and fluid retention.\n\nThese are not all the possible side effects of Jakafi. Ask your pharmacist or healthcare provider for more information. Tell your healthcare provider about any side effect that bothers you or that does not go away.\n\nBefore taking Jakafi, tell your healthcare provider about: all the medications, vitamins, and herbal supplements you are taking and all your medical conditions, including if you have an infection, have or had tuberculosis (TB), or have been in close contact with someone who has TB, have or had hepatitis B, have or had liver or kidney problems, are on dialysis, have a high level of fat in your blood (high blood cholesterol or triglycerides), had skin cancer or have any other medical condition. Take Jakafi exactly as your healthcare provider tells you. Do not change or stop taking Jakafi without first talking to your healthcare provider.\n\nWomen should not take Jakafi while pregnant or planning to become pregnant. Do not breast-feed during treatment with Jakafi and for 2 weeks after the final dose.\n\nFull Prescribing Information, which includes a more complete discussion of the risks associated with Jakafi, is available at www.jakafi.com.\n\nAbout Incyte \n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company’s website at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\n\nForward Looking Statements \n\nExcept for the historical information set forth herein, the matters set forth in this press release, including statements regarding whether and when the REACH2 data will be presented, when results from the REACH3 study will be available, and the effect of the REACH2 results on patients with GVHD, contain predictions, estimates and other forward-looking statements.\n\nThese forward-looking statements are based on the Company’s current expectations and subject to risks and uncertainties that may cause actual results to differ materially, including unanticipated developments in and risks related to: unanticipated delays; further research and development and the results of clinical trials possibly being unsuccessful or insufficient to meet applicable regulatory standards or warrant continued development; the ability to enroll sufficient numbers of subjects in clinical trials; determinations made by the FDA; the Company’s dependence on its relationships with its collaboration partners; the efficacy or safety of the Company’s products and the products of the Company’s collaboration partners; the acceptance of the Company’s products and the products of the Company’s collaboration partners in the marketplace; market competition; sales, marketing, manufacturing and distribution requirements; greater than expected expenses; expenses relating to litigation or strategic activities; and other risks detailed from time to time in the Company’s reports filed with the Securities and Exchange Commission, including its Form 10-Q for the quarter ended June 30, 2019. The Company disclaims any intent or obligation to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191016005061/en/\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com \n\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\nSource: Incyte Corporation"
    },
    {
        "title": "Incyte Announces Positive 52-Week Results From a Randomized Phase 2 Study of Ruxolitinib Cream in Patients With Vitiligo",
        "subtitle": "",
        "date": "Oct 12, 2019 2:32AM EDT",
        "content": "\n- Data presented at EADV demonstrate continued improvement in repigmentation of vitiligo lesions upon longer treatment duration with ruxolitinib cream\n    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte (Nasdaq:INCY) today announces positive 52-week results from its randomized, double-blind, dose-ranging, Phase 2 study evaluating ruxolitinib cream, a nonsteroidal, anti-inflammatory, JAK inhibitor therapy, in adult patients with vitiligo.\n\nAs previously announced, the study met its primary endpoint, demonstrating that significantly more patients treated with ruxolitinib cream for 24 weeks achieved a ≥50 percent improvement from baseline in the facial vitiligo area severity index (F-VASI50) score compared to patients treated with a vehicle control (non-medicated cream).\n\nUpdated results at week 52 show substantial improvements in total body repigmentation with ruxolitinib cream, measured by the proportion of patients achieving a ≥50 percent improvement from baseline in the total vitiligo area severity index (T-VASI50), a key secondary endpoint. In addition, after 52 weeks of treatment with ruxolitinib cream 1.5 percent administered twice daily (BID), 58 percent of patients achieved F-VASI50 and 51 percent of patients achieved a ≥75 percent improvement (F-VASI75). F-VASI75 after 24 weeks is the primary outcome measure of both the TRuE-V1 and TRuE-V2 randomized Phase 3 trials that are already underway.\n\nThe 52-week results are being shared at the 28th European Academy of Dermatology and Venereology (EADV) congress in Madrid, Spain, during a late-breaking research session today, October 12, 2019, from 11:30 a.m. CEST to 11:45 a.m. CEST (Location: Hall 10 Dalí; Late Breaking News, Abstract #D3T01.1L).\n\n“We are very encouraged about the positive updated data presented at EADV, which demonstrate substantial facial and total body repigmentation of vitiligo lesions in patients treated with ruxolitinib cream, and continued improvements with longer duration of treatment,” said Jim Lee, M.D., Group Vice President, Inflammation & Autoimmunity, Incyte. “As we seek to offer a much-needed option for those patients impacted by this life-altering disease, we are excited that the pivotal Phase 3 studies evaluating ruxolitinib cream in patients with vitiligo are underway, with results expected in 2021.”\n\nKey 52-week results include:\n"
    },
    {
        "title": "Incyte to Report Third Quarter Financial Results",
        "subtitle": "",
        "date": "Oct 10, 2019 8:00AM EDT",
        "content": "    WILMINGTON, Del.--(BUSINESS WIRE)--\nIncyte Corporation (Nasdaq:INCY) announced today that it has scheduled its third quarter 2019 financial results conference call and webcast for 8:00 a.m. ET on Tuesday, October 29, 2019.\n\nThe schedule for the press release and conference call/webcast is as follows:\n\nIf you are unable to participate, a replay of the conference call will be available for thirty days. The replay dial-in number for the U.S. is 877-660-6853 and the dial-in number for international callers is 201-612-7415. To access the replay you will need the conference ID number 13695247.\n\nThe live webcast with slides can be accessed at www.incyte.com under For Investors, Events and Presentations and will be available for replay for 30 days.\n\nAbout Incyte\n\nIncyte Corporation is a Wilmington, Delaware-based biopharmaceutical company focused on the discovery, development and commercialization of proprietary therapeutics. For additional information on Incyte, please visit the Company's website at www.incyte.com.\n\nFollow @Incyte on Twitter at https://twitter.com/Incyte.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005003/en/\nInvestors\nMichael Booth, DPhil\n+1 302 498 5914\nmbooth@incyte.com\n\nMedia\nCatalina Loveman\n+1 302 498 6171\ncloveman@incyte.com\nSource: Incyte Corporation"
    }
]