[
    {
        "title": "Intel Highlights Latest Security Investments at RSA 2020",
        "subtitle": "",
        "date": "Feb 26, 2020 9:00AM EST",
        "content": "\nAnnounces Compute Lifecycle Assurance Momentum, Previews New Security Capabilities\n    SAN FRANCISCO--(BUSINESS WIRE)--\nAt the Intel Security Day event during RSA Conference 2020, Intel underscored its commitment to security with several announcements, including details on security capabilities coming in future products. At Intel, security is a fundamental and foundational element of all aspects of architecture, design and implementation. Together with customers and partners, Intel is building a more trusted foundation in this data-centric world.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200226005170/en/Tom Garrison, Intel vice president and general manager of Client Security Strategy and Initiatives, discusses strategy for evolving security in CPUs that have 30 billion transistors and are 1/100th the size of a photon of light, starting with Intel Transparent Supply Chain (Intel TSC) at RSA Conference 2020 in San Francisco on Monday, Feb. 24, 2020. Intel TSC proves transparency of a device’s origin and helps establish the foundation for a trusted supply chain. (Credit: Intel Corporation)\n“Hardware is the bedrock of any security solution. Just as a physical structure requires a foundation established on bedrock to withstand the forces of nature, security solutions rooted in hardware will provide the greatest opportunity to provide security assurance against current and future threats,” said Tom Garrison, Intel vice president and general manager of Client Security Strategy and Initiatives. “Intel hardware, and the assurance and security technologies it brings, help harden the layers above from attack.”\n\nMore: Intel Security News\n\nIntel customers build solutions and services that depend on the breadth and depth of technologies in the silicon, vertical integration and substantive reach from edge to cloud. It is Intel’s mission to provide common security capabilities across all architectures, to help address the ever-increasing sophistication of user experiences.\n\nData must be protected at rest and in motion. The protection of data is critical to extracting value from it, while delivering uncompromised performance. The next 10 years will see more architecture ​advancements than the past 50 years.\n\n“Intel is uniquely positioned in the industry to create and deliver truly innovative security technologies that span architectures, memory and interconnect,” said John Sell, Intel Fellow and director of Intel Security Architecture and Technology.\n\nData Platform Protection\n\nAs the demand for data-intensive computing grows, there is a need to balance the ease of scaling deployment with the level of data protections. To address customer challenges, new confidential computing capabilities on future data center platforms are expected to offer scale and choice:\n\nMore information can be found on Intel's IT Peer Network.\n\nCompute Lifecycle Assurance Industry Traction\n\nSince its launch in December, Intel’s Compute Lifecycle Assurance Initiative has gained traction with customers and ecosystem partners, starting with the foundational offering Intel® Transparent Supply Chain (Intel TSC).\n\nTransparency of a device’s origin helps establish the foundation for a trusted supply chain. Intel TSC tools allow platform manufacturers to bind platform information and measurement using the Trusted Computing Group’s (TCG) Trusted Platform Module 2.0 (TPM) standard, also referred to as ISO 11889. This allows customers to gain traceability and accountability for platforms with component-level reporting. More information can be found in a blog by Intel's Tom Dodson.\n\nIntel TSC is currently available for customers across Intel vPro® platform-based PCs, Intel® NUC, Intel® Xeon® SP systems, Intel® solid-state drives and certain Intel® Core™ commercial PCs.\n\nTo demonstrate Intel’s commitment to transparency, measurement and assurance of the supply chain, Intel also enables ecosystem partners with Intel TSC tools. Today, Hyve Solutions, Inspur, Lenovo (client and server), Mitac, Quanta, Supermicro and ZT Systems have enabled Intel TSC tools. In addition, Intel has active deployments of Intel TSC with enterprise IT and cloud service providers.\n\n“This chain of trust process provides essential traceability based on the TPM,” said Thorsten Stremlau, chair of TCG’s Marketing Work Group. “Bringing component-level traceability to platforms and systems increases confidence and reduces the risk of counterfeit electronic parts while also facilitating procurement standards. This is the right direction for the industry.”\n\nIt often takes the industry working together to make technological advancements. Intel has a strong legacy of assisting its customers and industry partners in developing new and innovative ways to improve hardware security. Intel shares knowledge of this experience through its participation and contributions to leading industry initiatives and standards bodies, including the Confidential Computing Consortium under the Linux Foundation, the FIDO Alliance’s IoT Technical Workgroup and the newly expanded Common Weakness Enumeration led by MITRE. Such efforts underscore Intel’s unique capacity to build a more trusted foundation for the industry.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\nNotices and Disclosures:\nIntel technologies may require enabled hardware, software or service activation.\nNo product or component can be absolutely secure.\nYour costs and results may vary.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005170/en/\nMegan Phelan\nHighwire Public Relations for Intel Corporation\n916-834-0802\nmegan@highwirepr.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel World Open: Path to Tokyo Kicks Off in March",
        "subtitle": "",
        "date": "Feb 25, 2020 1:00PM EST",
        "content": "    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nWhat's New: Intel is elevating esports for audiences worldwide with the Intel World Open ahead of the Olympic Games Tokyo 2020, giving gamers a chance to compete among the world’s best athletes on a global stage. Anyone from anywhere can register, beginning March 2, for a chance to be crowned the Intel World Open champion.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200225005876/en/As an extension of Intel’s Worldwide TOP Partnership, Intel will host the Intel World Open esports tournament ahead of the Olympic Games Tokyo 2020. It will feature Capcom’s Street Fighter V: Champion Edition and Psyonix’s Rocket League. (Credit: Intel Corporation)\n\"We introduced Intel Extreme Masters PyeongChang in 2018 and we’re excited to continue raising the stakes for esports with the Intel World Open in 2020. There are more than 490 million esports fans worldwide and the Intel World Open exemplifies Intel’s global leadership in esports and delivers a pinnacle tournament on the world’s biggest sports stage.”\n– Mark Subotnick, Intel director of gaming and esports business development\n\nWhat It Is: The Intel World Open is an extension of Intel’s Worldwide TOP Partnership with the International Olympic Committee (IOC), and will feature two of the most recognized esports titles: Capcom’s Street Fighter™ V: Champion Edition and Psyonix’s Rocket League. Online qualifiers for Street Fighter V: Champion Edition start March 21 and Rocket League start May 2.\n\nThe Path to Tokyo: Any player at any level can compete in the Intel World Open for a chance to join a national, territory or regional team. Live qualifier events in Katowice, Poland, in June will determine which teams advance to the championship esports tournament in Tokyo.\n\nThe final event in Tokyo on July 22-24 will host hundreds of fans at the Zepp DiverCity venue – the same area as Olympic venues – where teams will compete for a majority share of the prize pool:\n\nFor more details and registration, visit the Intel World Open website.\n\nThe Street Fighter V: Champion Edition Tournament Format: A force in the fighting genre and esports scene for 32 years, the legendary fighting franchise returns with Street Fighter V: Champion Edition.\n\nTournament Structure:\n\nFor full qualification rules and details, visit the Intel World Open website.\n\nThe Rocket League Tournament Format: Developed by Epic Games' San Diego-based studio, Psyonix, Rocket League is a high-powered hybrid of arcade-style soccer and vehicular mayhem. The Rocket League Intel World Open will feature 3v3 competitions in Psyonix's signature game mode, Soccar.\n\nTournament Structure:\n\nFor full qualification rules and details, visit the Intel World Open website.\n\nIntel’s Role in Gaming Technology Leadership: Intel’s gaming technology, led by the Intel® Core™ i7 and i9 processors, has powered the best esports experiences for more than 15 years. Intel inspires fans and players by supporting a vibrant community that brings together committed partners in the industry to deliver best-in-class technology that pushes the boundaries of the sport. Intel’s leadership in end-to-end solutions will power the future of gaming and grow the esports market for the next billion fans.\n\nMore Context: Intel and the Olympic Games Tokyo 2020\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Capcom and the Capcom logo are registered trademarks of Capcom Co. Ltd. in the U.S. or other countries. Street Fighter is a trademark and/or registered trademark of Capcom U.S.A. Inc. in the U.S. and/or other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225005876/en/\nFarm Saechou\n916-377-9577\nfarm.p.saechou@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel Announces Unmatched Portfolio for 5G Network Infrastructure",
        "subtitle": "",
        "date": "Feb 24, 2020 9:00AM EST",
        "content": "\nLeading Providers Choose Intel’s 10nm Base Station SoC; New 2nd Generation Xeon Scalable Platforms in Market Now from Industry Leaders\n    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nUnlocking the full potential of 5G requires transforming network infrastructure from core to edge. As the world’s leading network silicon provider, Intel is at the forefront of driving this transformation. Today, the company made a sweeping set of hardware and software announcements, including the launch of the new Intel® Atom™ P5900, a 10nm system-on-a-chip (SoC) for wireless base stations, which is a critical early deployment target for 5G networks.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200224005298/en/Intel Atom® P5900 Processor, Intel’s first 10nm datacenter processor (Credit: Walden Kirsch/ Intel Corporation)\n“As the industry makes the transition to 5G, we continue to see network infrastructure as the most significant opportunity, representing a $25 billion silicon opportunity by 2023,” said Navin Shenoy, executive vice president and general manager, Data Platforms Group at Intel. “By offering customers the fastest and most effective path to design, deliver and deploy 5G solutions across core, edge and access, we are poised to expand our leading silicon position in this growing market.”\n\nUnmatched Portfolio for 5G Infrastructure\n\nAs the promise of 5G takes hold, customers are demanding the increased performance and flexibility they need to rapidly deliver services with lower latency where they are needed most. In this light, Intel announced a number of firsts today, including:\n\nNew Software Investments\n\nIntel expands its industry-leading edge computing software toolkits to accelerate time-to-market innovation for its customers and partners with new capabilities integrated into the Open Network Edge Services Software (OpenNESS) toolkit. OpenNESS now supports standalone 5GNR and Enhanced Platform Awareness (EPA) deployments, giving customers the flexibility to easily deploy their choice of cloud-native edge microservices. Intel is delivering customized OpenNESS experience kits to accelerate custom 5G deployments. OpenNESS complements Intel’s OpenVINO™ and Open Visual Cloud for edge computing development needs.\n\nUnrivaled Ecosystem Collaborations \n\nTechnology innovation requires deep collaboration across industry innovators that build on each other’s contributions. Given its rich heritage in leading technology transitions, Intel is in a unique position to accelerate collaboration across its customers and partners. Intel has announced strategic collaborations with industry leaders, including Altiostar, Dell, Deutsche Telecom, HPE, Lenovo, QCT, Rakuten, VMware, and ZTE, to advance network infrastructure capability and speed edge solutions in the market.\n\nIntel has been at the forefront of technology innovation for 51 years. By delivering the broadest silicon portfolio for 5G network infrastructure, the company continues to open a world of opportunity for its customers and partners.\n\nMore information on all of these announcements, including visual assets, is available at the 5G Network Portfolio Launch press kit on the Intel Newsroom.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\n\ni Source: Dell’Oro Mobile Core Network 5 year forecast Report, Dell’Oro Group, 01/2020\n\nii Geomean of Integer Throughput, Floating Point Throughput, Stream Triad, and Linpack across ten new 2-socket 2nd Gen Gold processors vs first generation. 2nd Gen Gold R processors: 1-node, 2x 2nd Gen Intel Xeon Gold cpu on Intel Reference platform with 384 GB (12 slots / 32 GB / 2933) total memory, ucode 0x500002c, HT on for all except off for Stream, Linpack, Turbo on, with Ubuntu19.10, 5.3.0-24-generic, 6258R/$3950: int=323, fp=262, stream=224, Linpack=3305, 6248R/$2700: int=299, fp=248, stream=224, Linpack=3010, 6246R/$3286: int=238, fp=217, stream=225, Linpack=2394, 6242R/$2529: int=265, fp=231, stream=227, Linpack=2698, 6240R/$2200: int=268, fp=228, stream=223, Linpack=2438, 6238R/$2612: int=287, fp=240, stream=222, Linpack=2545, 6230R/$1894: int=266, fp=227, stream=222, Linpack=2219, 6226R/$1300: int=208, fp=192, stream=200, Linpack=2073, 5220R/$1555: int=257, fp=220, stream=210, Linpack=1610, 5218R/$1273: int=210, fp=188, stream=199, Linpack=1290 test by Intel on 12/25/2019. First Gen Gold processor: 1-node, 2x Intel Xeon Gold cpu on Intel Reference platform with 384 GB (12 slots / 32 GB / 2933) total memory, ucode 0x2000065, HT on for all except off for Stream, Linpack, Turbo on, with Ubuntu19.10, 5.3.0-24-generic, 6152/$3655: int=224, fp=198, stream=200, Linpack=19886148/$3072: int=225, fp=198, stream=197, Linpack=2162, 6146/$3286: int=161, fp=175, stream=185, Linpack=1896, 6142/$2946: int=193, fp=176, stream=185, Linpack=1895, 6140/$2445: int=202, fp=183, stream=188, Linpack=1877, 6138/$2612: int=189, fp=195, stream=189, Linpack=1976, 6130/$1894: int=172, fp=165, stream=185, Linpack=1645, 6126/$1776: int=141, fp=157, stream=170, Linpack=1605, 5120/$1555: int=133, fp=148, stream=159, Linpack=924, 5118/$1273: int=134, fp=132, stream=149, Linpack=818 test by Intel on 2/18/2020.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200224005298/en/\nAnn Goldmann\nann.goldmann@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel and Sinclair Holdings Build First All-Digital Hotel for a Greener and More Personal Experience",
        "subtitle": "",
        "date": "Feb 4, 2020 8:00AM EST",
        "content": "    FORT WORTH, Texas--(BUSINESS WIRE)--\nWhat’s New: Today, Intel announced its collaboration with The Sinclair, Autograph Collection, in Fort Worth, Texas, the world’s first all-digital hotel. The Sinclair utilizes Intel internet of things (IoT) functionality, including building and in-room sensors, IoT gateways, dashboards and restaurant sinks and appliances. Together, Intel and The Sinclair are delivering the next-generation connected guest experience through location-based analytics, as well as by utilizing the latest offerings from Cisco, SAS and other digital vendors.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200204005413/en/A guest interacts with the smart mirror inside a guest room bathroom at The Sinclair hotel. Intel and The Sinclair, Autograph Collection, in Fort Worth, Texas, announced in February 2020 a collaboration to deliver a next-generation connected guest experience. (Credit: Sinclair Holdings LLC)\n“The Sinclair combines the beauty and historical significance of Fort Worth with the innovative connected technology of the future. By using the latest connected technology from Intel and our other partners, we can offer guests the absolute best experience from the moment they walk through the door. Intel has a rich history of delivering innovative solutions to improve the guest experience, and this hotel will drive innovation forward in the hospitality industry.”\n–Farukh Aslam, CEO and president of Sinclair Holdings LLC\n\nHow It Works: The Sinclair transforms hotel operations to function more efficiently, as well as provide data-driven business insights that enable management and staff to personalize each guest’s experience.\n\nThe technology underpinnings of this smart hotel include:\n\nWhy It Matters: Through these innovations, The Sinclair is reimagining the future of hotels to provide enhanced and personalized technology-driven experiences for guests and hospitality professionals alike.\n\nHotel staff can use mobile devices to connect to reservation and property management software anywhere on the premises, increasing productivity and customer service. Wireless point of sale systems enable food and drink sales anywhere on the property. Hotel guests can configure environmental settings such as temperature, lighting and shower preferences with a few taps to a digital screen, allowing for a personalized experience.\n\n“Our collaboration with The Sinclair is one of a growing number of examples of how IoT technology is making buildings smarter and allowing hospitality providers to build richer, more personalized and powerful experiences for guests and associates,” said Joe Jensen, Intel vice president and general manager of the Retail, Banking, Hospitality and Education Division. “Intel technology will help The Sinclair deliver next-generation connected experiences to hotel staff and guests.”\n\nMore Context: Sinclair Hotel Spotlight | A Visit to the Hotel of the Future | A Visit to the All-Digital Sinclair Hotel in Fort Worth, Texas (YouTube Video) | The Sinclair Uses Intel Technology to Build First All-Digital Hotel (B-Roll) | Internet of Things News\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005413/en/\nLiz Wu\nIntel Corporation\n503-696-2098\nliz.wu@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel Board of Directors Elects New Chairman and New Director",
        "subtitle": "",
        "date": "Jan 21, 2020 4:01PM EST",
        "content": "\nAndy Bryant to Retire from Board after 2020 Stockholders’ Meeting\n    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nIntel Corporation announced today that at the company’s Jan. 15 board meeting Andy D. Bryant stepped down as chairman and the board elected lead independent director Dr. Omar Ishrak to succeed Bryant as an independent chairman, effective immediately. Intel also announced that Alyssa Henry was elected to Intel’s board. Her election marks the seventh new independent director added to Intel’s board since the beginning of 2016.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200121006001/en/Andy Bryant serves on the Intel Corporation board of directors and as an executive advisor to the company. From May 2012 to January 2020, Bryant served as chairman of the board of directors. (Credit: Intel Corporation)\nBryant will remain on the board through the end of Intel’s 2020 annual stockholders’ meeting. He had previously notified the board in March 2019 that he did not intend to stand for re-election at this year’s meeting. Bryant made the decision to leave the role now in order to facilitate an effective transition.\n\n“I want to thank and congratulate Andy for over seven years’ service as chairman of the board,” said Intel CEO Bob Swan. “Andy has been a rudder for Intel during a time of change and transformation. He has led the board with integrity and always with Intel’s best interest in mind.”\n\n“It has been my great honor to serve as Intel chairman, and I plan to retire from the board in May with great optimism about Intel’s future,” Bryant said. “I have full confidence in Omar leading the board, which is fortunate to have his expertise at leading an innovative, global company. In addition, Alyssa’s wealth of senior leadership, cloud computing and emerging technologies experience further strengthens Intel’s board.”\n\nHenry, 49, has served as seller lead for Square Inc. -- a provider of software, hardware and financial services for small businesses and individuals -- since 2014. She oversees global engineering, product management, design, sales, marketing, partnerships and support for Square’s seller-facing software and financial services products. Prior to Square, she served in various positions with Amazon.com Inc. from 2006 to 2014, including as vice president of Amazon Web Services Storage Services, where she led services including Amazon S3, Amazon EBS and Amazon Lambda; and as Amazon’s director of software development for ordering, with responsibility for Amazon’s ordering workflow software and databases. Before Amazon, Henry spent 12 years at Microsoft Corp. working on databases and data access technologies in a variety of engineering, program management and product unit management roles. Henry started her career as a developer in the financial services industry. She has served as a member of the board of directors of Unity Technologies, a privately held company, since December 2018.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world - from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121006001/en/\nBrooke Wells\nInvestor Relations\n+1 (503) 613-8230\nbrooke.wells@intel.com\n\nCara Walker\nMedia Relations\n+1 (503) 696-0831\ncara.walker@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel and AREA15 Bring Experiential Retail to Life in Las Vegas",
        "subtitle": "",
        "date": "Jan 12, 2020 10:30AM EST",
        "content": "    NEW YORK--(BUSINESS WIRE)--\nWhat’s New: Today, Intel announced a collaboration with AREA15, one of the first purpose-built experiential retail and entertainment complexes. To thrive in the digital age, traditional retailers and malls face a reinvent-or-die reality. AREA15 is tackling this issue by offering live events, immersive experiences and activations, and monumental art installations, employing ground-breaking technology and much more for the retail environment.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200112005023/en/Opening in April 2020, the AREA15 property in Las Vegas will include a flexible platform where Intel innovation will play an integral role. (Credit: The Vox Agency)\n“Today, only top retailers can afford to explore and implement experiential design in their stores. We believe immersive, authentically engaging and inspiring experiences in retail are not only possible, but should be accessible for all. Ecosystem collaboration is in Intel’s DNA. AREA15 will help provide scalable, world-class experiential retail solutions for retailers and brands of all sizes.”\n– Joe Jensen, Intel vice president and general manager of the Retail, Banking, Hospitality and Education Division\n\nWhy It’s Important: Research shows that 81 percent of Generation Z prefer to shop in stores, and 73 percent like to discover new products in stores. This offers the opportunity to transform how a new generation of consumers chooses to interact with brands. Retailers and brands can’t afford to miss out on engaging this demographic, which is on track to become the largest generation of consumers by 2020 — responsible for $29 billion to $143 billion in direct spending.\n\nThe rise of the “experience economy,” fueled by rapid shifts in technology-enabled design and culture, has resulted in the business-critical need to understand customers — not only Gen Z — and use that data to design a real-time personal experience.\n\nIntel’s Role: The alliance will initially focus on immersive experiential retail design with the launch of the Intel© Experience Incubation Hub, a multiuse venue for innovation and collaboration. It will allow retail ecosystem partners — from creatives to technologists — to test new design concepts and leading-edge technologies.\n\nOpening in April, the AREA15 property in Las Vegas aims to be the gravitational center for the new experience economy, building a flexible platform where Intel innovation will play an integral role. AREA15’s technical and physical infrastructure will be modular, allowing for innovations coming out of the Experience Incubation Hub to be easily tested for proof of concept and scalability — within AREA15 and beyond — in a variety of forms, from pop-ups to short-term engagements to more permanent installations.\n\nEarly collaborators and experiences featured in the Experience Incubation Hub include Artist TRAV, Papinee, Pressure Point Creative, ThenWhat Inc. and Variant.\n\n“AREA15 is a radical reimagining of retail, where visitors can expect to be authentically engaged and inspired in an otherworldly setting,” said Winston Fisher, CEO of AREA15 and partner in Fisher Brothers. “Experience design cannot be separated from technology — it is essential that the two are intertwined and co-developed. That’s where our collaboration with Intel comes in. Together, we’re raising the standard of experience design, and developing best practices for combining technology, art and commerce in exciting, unexpected ways.”\n\nMore Context: Intel at 2020 NRF: Intel Gives Retail the Edge\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200112005023/en/\nMichelle Newburgh\n408-250-9874\nmichelle.b.newburgh@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "At CES 2020, Mobileye Raises the Bar",
        "subtitle": "",
        "date": "Jan 8, 2020 4:51PM EST",
        "content": "    LAS VEGAS--(BUSINESS WIRE)--\nEquipped with a business strategy unlike any other automotive supplier and growth ambitions to become a complete mobility provider, Mobileye President and CEO Prof. Amnon Shashua called on the industry to be transparent with its autonomous driving technology and then showed a 23-minute unedited, uninterrupted drive of an autonomous vehicle (AV) using camera-only sensors.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200108005870/en/At CES 2020, Mobileye revealed new growth metrics demonstrating the continued strength of Intel’s fastest-growing business, including more than 54 million EyeQ chips shipped to date. (Credit: Intel Corporation)\nMore: All Mobileye and Intel News from CES 2020 | Mobileye News | Mobileye’s Computer Vision (Event Replay) | Autonomous Driving at Intel\n\nDuring his annual CES address, Shashua provided an under-the-hood tour of Mobileye’s leading computer vision technology, showed how the company’s mapping strategy is helping the company achieve global scale, and introduced new deals for advanced driver-assistance systems (ADAS) and driverless mobility-as-a-service (MaaS). Scroll down for a synopsis of Mobileye’s updates from #CES2020.\n\nUnder the Hood with Mobileye: In his annual CES address, Intel Senior Vice President and Mobileye CEO Prof. Amnon Shashua called for more transparency in technology to enable the future of autonomous driving. In front of a captivated audience in Las Vegas, Shashua went under the hood of Mobileye’s computer vision, presenting new details behind the company’s latest technology advancements to demonstrate the innovative approach it is taking to make autonomy a reality. For the first time, Shashua discussed \"VIDAR,” Mobileye’s unique solution for achieving outputs akin to lidar using only camera sensors. In addition, he detailed how Mobileye achieves pixel-level scene segmentation that can be used to detect tiny fragments of road users such as wheelchairs, open vehicle doors and more, as well as the ways in which Mobileye technology turns two-dimensional sensors into 3D understanding. Highlighting the progress and purpose of Mobileye’s drive to full autonomy, Shashua’s address showcased exactly how the company will lead the industry in realizing autonomous driving. » Watch full presentation, \"2020 CES: Amnon Shashua’s ‘Under the Hood of Mobileye’s Computer Vision’ (Event Replay)\" | » Download speaker presentation\n\nCamera-Driven AV Navigates Jerusalem: Mobileye is developing two truly redundant sensing systems: one with surround-view cameras alone and the other with radars and lidars. In this unedited video demonstrating the camera-only technology in Jerusalem, you can see Mobileye’s car successfully navigate a complex driving environment heavy with pedestrians, unguarded intersections, delivery vehicles and more. This is the everyday capability of Mobileye’s technology. » Watch “Unedited Ride in Mobileye’s Camera-Driven Autonomous Vehicle”\n\nMobileye in Numbers: At CES 2020, Mobileye revealed new growth metrics demonstrating the continued strength of Intel’s fastest-growing business, including more than 54 million EyeQ chips shipped to date. 2019 was another record year for the company, with sales close to $1 billion driven by significant growth in the ADAS market. Mobileye’s future business is expanding greatly with forays into data monetization and the nascent robotaxi market. » Download “Mobileye in Numbers” infographic\n\nMobileye Maps Las Vegas: Using its crowd-sourced Road Experience Management™ (REM™) technology, Mobileye created a demonstration high-definition map of more than 400 km (248 miles) of Las Vegas roads from over 16,000 drives. Map creation of Nevada-area roads took less than 24 hours. This map provides centimeter-level accuracy for thousands of on-road and near-road objects, including 60,000 signs, 20,000 poles and more than 1,500 km of lane centerlines. The near-real-time capability of REM coupled with the extremely low-bandwidth data upload (approximately 10 kilobits/km) from millions of Mobileye-equipped passenger cars makes this technology highly scalable and practical for both advanced ADAS (L2+) solutions and full AVs including driverless mobility-as-a-service (MaaS) fleets. » Watch “2020 CES: Mobileye Maps Las Vegas (B-Roll)”\n\nMobileye in China: Mobileye announced a new agreement with SAIC, a leading Chinese OEM to use Mobileye’s REM mapping technology to map China for L2+ ADAS deployment while paving the way for autonomous vehicles in the country. The deployment of the mapping solution in China presents opportunities for additional OEM partners to enter the Chinese market with map-related features. China is the first country to benefit from the four Mobileye strategic product categories. With the addition of the SAIC agreement, Mobileye’s China footprint now includes L2+ ADAS, mapping (a first for China), MaaS and consumer AVs.\n\nMobileye Expands Driverless to South Korea: Mobileye and the leaders of Daegu Metropolitan City, South Korea, announced an agreement to establish a long-term cooperation to test and deploy robotaxi-based mobility solutions powered by Mobileye’s autonomous vehicle technology. Mobileye will integrate its industry-leading self-driving system into vehicles to enable a driverless MaaS operation. The agreement with Daegu City, one of South Korea’s largest metropolitan areas, extends Mobileye’s global MaaS footprint. Combined with Mobileye’s previously announced robotaxi-based mobility services agreements, the new deal shows how Mobileye is quickly scaling its autonomous MaaS ambitions globally.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005870/en/\nRobin Holt\n503-616-1532\nrobin.holt@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Mobileye’s Global Ambitions Take Shape with New Deals in China, South Korea",
        "subtitle": "",
        "date": "Jan 7, 2020 3:30PM EST",
        "content": "    LAS VEGAS--(BUSINESS WIRE)--\nWhat’s New: With sales close to $1 billion in 2019 and expected to rise double-digits this year, Mobileye’s global ambitions in advanced driver-assistance systems (ADAS) and autonomous mobility-as-a-service (MaaS) came into sharper focus with two agreements announced today. SAIC, a leading Chinese OEM, plans to use Mobileye’s REM mapping technology to map China for L2+ ADAS deployment while paving the way for autonomous vehicles in the country. And the leaders of Daegu Metropolitan City, South Korea, agreed to establish a long-term cooperation to deploy MaaS based on Mobileye’s self-driving system.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200107005959/en/A photo from December 2018 shows the interior cabin of a Mobileye autonomous vehicle as it maneuvers through traffic in Jerusalem. Mobileye, an Intel company, is the leader in assisted driving and a pioneer in the use of computer vision technology to save lives on the road. (Credit: Mobileye)\n“These two new agreements build our global footprint in both MaaS and ADAS and demonstrate our commitment to true global leadership toward full autonomy.”\n-- Prof. Amnon Shashua, Mobileye president & CEO and Intel senior vice president\n\nWhy It Matters: The two deals show how Mobileye, an Intel Company, is executing on its multiprong strategy toward full autonomy, which includes mapping, ADAS, MaaS and consumer AVs. The agreements build on other recent announcements, including: an agreement with RATP in partnership with the city of Paris to bring robotaxis to France; a collaboration with NIO to manufacture Mobileye’s self-driving system and sell consumer AVs based on that system, and to supply robotaxis exclusively to Mobileye for China and other markets; a joint venture with UniGroup in China for use of map data; and a joint venture with Volkswagen and Champion Motors to operate an autonomous ride-hailing fleet in Israel.\n\nBased on third-party data, Mobileye estimates the autonomous MaaS total addressable market (TAM) at $160 billion by 2030. Mobileye’s ADAS leadership, uniquely scalable mapping tools and global robotaxi-based mobility ambitions have been designed to address this massive opportunity.\n\nChina is the first country to benefit from the four Mobileye strategic product categories. With the addition of the SAIC agreement, Mobileye’s China footprint now includes L2+ ADAS, mapping (a first for China), MaaS and consumer AVs.\n\nHow the SAIC Agreement Works: SAIC and Mobileye have signed an agreement to use Mobileye's Road Experience Management™ (REM™) mapping technology on SAIC vehicles via SAIC’s licensed map subsidiary (Heading). SAIC vehicles will contribute to Mobileye’s RoadBook by gathering information on China’s roadways, creating a high-definition map of the country that can be used by vehicles with L2+ and higher levels of autonomy. The deployment of the mapping solution in China presents opportunities for additional OEM partners to enter the Chinese market with map-related features.\n\nThe SAIC agreement marks Mobileye’s first design win with a major Chinese automaker to harvest road data while also utilizing Mobileye’s REM mapping technology to enable L2+ in passenger vehicles.\n\nSAIC joins other Mobileye OEM partners around the world in collecting road data to enable a global real-time high-definition map. It is the first Chinese OEM to use Mobileye's REM technology to offer sharper ADAS capabilities and accelerate the development of autonomous driving in China.\n\nHow the Daegu Metropolitan City Agreement Works: Mobileye and Daegu City will collaborate to test and deploy robotaxi-based mobility solutions powered by Mobileye’s autonomous vehicle technology. Mobileye will integrate its industry-leading self-driving system into vehicles to enable a driverless MaaS operation. Daegu Metropolitan City partners will ensure the regulatory framework supports the establishment of robotaxi fleet operation.\n\nThe agreement with Daegu City, one of South Korea’s largest metropolitan areas, extends Mobileye’s global MaaS footprint. Combined with Mobileye’s previously announced robotaxi-based mobility services agreements, the new deal shows how Mobileye is quickly scaling its autonomous MaaS ambitions globally. No other MaaS provider has declared a global MaaS footprint that rivals Mobileye’s strategy and go-to-market plan.\n\nHow Mobileye’s Strategy Differs: Leaders on the road to full autonomy must successfully navigate the phases of both ADAS and MaaS before the consumer AV industry can take shape. Doing this requires a simple, scalable mapping solution, such as Mobileye’s REM. With its eye toward full autonomy, Mobileye addresses these critical aspects of the autonomous revolution.\n\nREM technology: Because it relies on crowd sourcing and low-bandwidth uploads, Mobileye REM technology is a fast and cost-effective way to create high-definition maps that can be utilized for enhanced ADAS such as L2+, as well as higher levels of autonomy for future self-driving cars. Mobileye’s REM map data has significant value beyond the automotive industry and can bring insights to businesses in new market segments, such as smart cities. SAIC is the latest OEM to turn passenger cars into harvesting vehicles that will contribute to the global RoadBook.\n\nRobotaxis: Mobileye’s strategy for deploying robotaxis covers the specification, development and integration of all five value layers of the robotaxi market including: self-driving systems, self-driving vehicles, fleet operations, mobility intelligence, and rider experience and services. Mobileye’s approach is cost-effective, allowing the company to scale global operations more quickly than competitors and thereby capture a greater share of the aforementioned $160 billion global robotaxi opportunity, which is a significant step on the way to the fully autonomous future. Mobileye’s unique approach of scaling globally with a more economical solution, coupled with its superior technology, enable the company to lead MaaS and consumer-AV development at scale well ahead of the market.\n\nMore Context: Autonomous Driving at Intel | Intel and Mobileye at 2020 CES | Mobileye News\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200107005959/en/\nRobin Holt\n503-616-1532\nrobin.holt@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "2020 CES: Intel Brings Innovation to Life with Intelligent Tech Spanning the Cloud, Network, Edge & PC",
        "subtitle": "",
        "date": "Jan 6, 2020 7:45PM EST",
        "content": "\n      American Red Cross, Lenovo, Netflix, National Football League (NFL)\n      and Olympic Games Tokyo 2020 Highlight How Intel Technology is\n      Delivering Broad Positive Impact\n        LAS VEGAS--(BUSINESS WIRE)--\n      Breakthroughs in artificial intelligence (AI) that pave the way for\n      autonomous driving. A new era of mobile computing innovation. The future\n      of immersive sports and entertainment. Intel demonstrated all of these\n      and more today at CES 2020, showcasing how the company is infusing\n      intelligence across the cloud, network, edge and PC, and driving\n      positive impact for people, business and society.\n    \nThis press release features multimedia. View the full release here:\nhttps://www.businesswire.com/news/home/20200106006026/en/\nAt CES 2020 in Las Vegas, Intel previewed a foldable OLED display form factor, code-named “Horseshoe Bend.” Based on Intel’s upcoming Tiger Lake mobile processors, the design is similar in size to a 12-inch laptop with a folding touchscreen display that can be opened up to more than 17 inches. (Credit: Walden Kirsch/Intel Corporation)  \n      Intel CEO Bob Swan kicked off today’s news conference by sharing updates\n      from its Mobileye business, including a demonstration\n      of its self-driving robocar navigating traffic in a natural manner. The\n      drive demonstrated Mobileye’s unique and innovative approach to deliver\n      safer mobility for all with a combination of artificial intelligence,\n      computer vision, the regulatory science model of RSS\n      and true redundancy through independent sensing systems.\n    \n      Swan also highlighted Intel’s\n      work with the American Red Cross and its Missing Maps project to\n      improve disaster preparedness. Using integrated AI acceleration on 2nd\n      Generation Intel® Xeon® Scalable processors, Intel is helping the\n      American Red Cross and its Missing Maps project to build highly accurate\n      maps with bridges and roads for remote regions of the world, which helps\n      emergency responders in the event of a disaster.\n    \n      “At Intel, our ambition is to help customers make the most of technology\n      inflections like AI, 5G and the intelligent edge so that together we can\n      enrich lives and shape the world for decades to come. As we highlighted\n      today, our drive to infuse intelligence into every aspect of computing\n      can have positive impact at unprecedented scale,” Swan said.\n    \n      Intelligence-Driven Mobile Computing\n    \n      Mobile computing was an area of emphasis, as Intel made announcements\n      spanning new products, partnerships and exciting platform-level\n      innovations that will transform the way people focus, create and engage.\n      Intel Executive Vice President Gregory Bryant announced the following:\n    \n      Intelligence-Driven Business Transformation\n    \n      The data center is the force that delivers intelligence to businesses\n      around the world and Intel Xeon Scalable processors continue to be the\n      foundation of the data center. Intel Executive Vice President Navin\n      Shenoy announced that 3rd Generation Intel Xeon Scalable processors,\n      coming in the first half of 2020, will include new Intel® DL Boost\n      extensions for built-in AI training acceleration, providing up to a 60%\n      increase in training performance over the previous family.\n    \n      Shenoy highlighted several ways Intel is threading intelligence into\n      data platforms across cloud, network and edge and how this is\n      transforming sports and entertainment:\n    \n      More information on all of these announcements, including visual assets\n      from the event, is available in the CES\n      press kit on the Intel Newsroom.\n    \n      About Intel\n    \n      Intel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping\n      the data-centric future with computing and communications technology\n      that is the foundation of the world’s innovations. The company’s\n      engineering expertise is helping address the world’s greatest challenges\n      as well as helping secure, power and connect billions of devices and the\n      infrastructure of the smart, connected world – from the cloud to the\n      network to the edge and everything in between. Find more information\n      about Intel at newsroom.intel.com\n      and intel.com.\n    \n      Forward-Looking Statements\n    \n      Statements in this news summary that refer to future plans and\n      expectations, including with respect to Intel’s future products and the\n      expected availability and benefits of such products, are forward-looking\n      statements that involve a number of risks and uncertainties. Words such\n      as “anticipates,” “expects,” “intends,” “goals,” “plans,” “believes,”\n      “seeks,” “estimates,” “continues,” “may,” “will,” “would,” “should,”\n      “could,” and variations of such words and similar expressions are\n      intended to identify such forward-looking statements. Statements that\n      refer to or are based on estimates, forecasts, projections, uncertain\n      events or assumptions, including statements relating to total\n      addressable market (TAM) or market opportunity and anticipated trends in\n      our businesses or the markets relevant to them, also identify\n      forward-looking statements. Such statements are based on the company’s\n      current expectations and involve many risks and uncertainties that could\n      cause actual results to differ materially from those expressed or\n      implied in these forward-looking statements. Important factors that\n      could cause actual results to differ materially from the company’s\n      expectations are set forth in Intel’s earnings release dated October 25,\n      2018, which is included as an exhibit to Intel’s Form 8-K furnished to\n      the SEC on such date. Additional information regarding these and other\n      factors that could affect Intel’s results is included in Intel’s SEC\n      filings, including the company’s most recent reports on Forms 10-K and\n      10-Q. Copies of Intel’s Form 10-K, 10-Q and 8-K reports may be obtained\n      by visiting our Investor Relations website at www.intc.com\n      or the SEC’s website at www.sec.gov.\n    \n      Software and workloads used in performance tests may have been optimized\n      for performance only on Intel microprocessors.\n    \n      Performance tests, such as SYSmark and MobileMark, are measured using\n      specific computer systems, components, software, operations and\n      functions. Any change to any of those factors may cause the results to\n      vary. You should consult other information and performance tests to\n      assist you in fully evaluating your contemplated purchases, including\n      the performance of that product when combined with other products. For\n      more complete information visit www.intel.com/benchmarks.\n    \n      © Intel Corporation. Intel, the Intel logo, and other Intel marks are\n      trademarks of Intel Corporation or its subsidiaries. Other names and\n      brands may be claimed as the property of others.\n    \n      1 -- Based on Intel testing and configurations\n    View source version on businesswire.com: https://www.businesswire.com/news/home/20200106006026/en/\n      Farm Saechou(916) 377-9577farm.p.saechou@intel.com\n    Source: Intel Corporation"
    },
    {
        "title": "IEEE to Define a Formal Model for Safe Automated Vehicle Decision-Making",
        "subtitle": "",
        "date": "Dec 19, 2019 3:30PM EST",
        "content": "    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nIntel Corporation (NASDAQ: INTC):\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191219005720/en/Jack Weast, senior principal engineer at Intel and vice president of Automated Vehicle Standards at Mobileye, speaks Tuesday, Nov. 5, 2019, at the 2019 Mobileye Investor Summit. (Credit: Walden Kirsch/Intel Corporation)\nWhat’s New: The Institute of Electrical and Electronics Engineers (IEEE) has approved a proposal to develop a standard for safety considerations in automated vehicle (AV) decision-making and named Intel Senior Principal Engineer Jack Weast to lead the workgroup. Participation in the workgroup is open to companies across the AV industry, and Weast hopes for broad industry representation. Group members will hold their first meeting in 2020’s first quarter.\n\n“The forthcoming IEEE standard will provide a useful tool to answer the question of what it means for an AV to drive safely.”\n– Jack Weast, Intel senior principal engineer\n\nWhy It Matters: Industry and regulators are struggling to agree on a method for evaluating the safety of AVs, although most people agree that standards are needed to establish regulatory thresholds for granting AVs their driver’s licenses. Multiple approaches are in development even though industry consensus is lacking.\n\nMeanwhile, technology development is not standing still and is nearly ready. This puts pressure on regulators to create rules for operating AVs worldwide. Known for its technical depth and relative speed at standards development, IEEE expects to publish the first version of the standard within a year – an important consideration as calls for regulation increase.\n\n“This standardization project will provide an important basis for the development of open, formal models in automated vehicle decision-making,” said Riccardo Mariani, vice president of Standards Activities at IEEE Computer Society and vice president of Industry Safety at NVIDIA. “Redundancy and diversity are crucial to developing scalable frameworks for safe automated driving.”\n\nHow It Works: The new standard – IEEE 2846 – will establish a formal rules-based mathematical model for automated vehicle decision-making that will be formally verifiable (with math), technology neutral (meaning anybody can apply it) and adjustable to allow for regional customization by local governments. It will also include a test methodology and tools necessary to perform verification of an AV to assess conformance with the standard.\n\nWho Is Involved: Two IEEE committees co-sponsored the proposal: The IEEE Computer Society and the Vehicle Technology Society. Weast will chair the workgroup, which Weast says is open to “anyone with an interest in crafting this essential AV standard.”\n\nIntel’s Role: Intel will bring its Responsibility-Sensitive Safety (RSS) framework as a starting point for the industry to align on what it means for an AV to drive safely. Open and technology-neutral, RSS defines what it means for a machine to drive safely with a set of logically provable rules and prescribed proper responses to dangerous situations. It formalizes human notions of safe driving in mathematical formulas that are transparent and verifiable.\n\nWhy It’s Needed: The IEEE standard is needed because the decision-making capability of an AV’s computer is mostly hidden from observation. This capability is largely driven by a collection of artificial intelligence algorithms – a “black box” of sorts – that is at the heart of important intellectual property from the leading companies in the AV industry. The black-box nature of an AV’s driving policy makes it nearly impossible to comparatively judge the safety of the different vehicles. As some industry experts have said, statistical evidence – such as number of miles driven, frequency of human intervention or hours in simulation – can only go so far before the car gets into a scenario it’s never seen before.\n\nMore Context: Autonomous Driving at Intel\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191219005720/en/\nRobin Holt\n503-616-1532\nrobin.holt@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Media Alert: CES 2020: Intel Highlights Positive Global Impact in AI, Autonomous Driving and Intelligence-driven Computing",
        "subtitle": "",
        "date": "Dec 19, 2019 11:00AM EST",
        "content": "    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nIntel has a long heritage of creating technology that serves nearly every person on Earth every day. At CES 2020, the company will demonstrate several of its latest advancements focused on creating broad positive impact for people, businesses and society as a whole.\n\nIntel News Conference – “Innovation through Intelligence”\n\nThis year, Intel’s CES news conference will feature Intel CEO Bob Swan, Client Computing Group Executive Vice President Gregory Bryant and Data Platforms Group Executive Vice President Navin Shenoy, along with several special guests. During an action-packed 45 minutes, Intel will highlight how it is infusing intelligence across the cloud, the network, the edge and everything in between – opening a world of opportunity and innovation for customers and partners.\n\nPlease note, there is limited seating. Doors open to media and analysts at 3:30 p.m. PST.\n\nMobileye Media & Customer Conference – “An Hour with Amnon” \n\nA future with fewer crashes and mobility for all. Intel and Mobileye see it as a moral imperative to deliver the technology that will make these possible. Join Mobileye CEO Prof. Amnon Shashua as he connects today's technology to tomorrow's vision. He will advance the discussion on breakthrough developments in advanced driver-assistance systems (ADAS) that are the building blocks for the future of autonomous driving. Shashua will address Mobileye’s industry-leading assets in computer vision, mapping and safety. He also will provide the latest on the company’s global robotaxi plans, strategic new business wins and partnerships.\n\nVisit Mobileye and Intel in the Las Vegas Convention Center North Hall (Booth #7506) \n\nStop by the booth for an up-close look at how Mobileye’s technology will impact people and society. If you ever wished you had X-ray vision and could see inside the workings of an automated vehicle, now is your chance to access a purpose-built see-through car, along with hands-on demonstrations, an up-close look at production ADAS from Mobileye’s ecosystem, spotlights and plenty of video explainers.\n\nCan’t make it to CES 2020?\n\nVisit our newsroom at newsroom.intel.com/2020-CES and follow us on Twitter at @IntelNews and @Intel, and on Facebook.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191219005098/en/\nFarm Saechou\n(916) 377-9577\nfarm.p.saechou@intel.com\n\nDanielle Mann (for Mobileye)\n(973) 997-1154\ndanielle.mann@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "Intel Acquires Artificial Intelligence Chipmaker Habana Labs",
        "subtitle": "",
        "date": "Dec 16, 2019 9:00AM EST",
        "content": "\nCombination Advances Intel’s AI Strategy, Strengthens Portfolio of AI Accelerators for the Data Center\n    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nIntel Corporation today announced that it has acquired Habana Labs, an Israel-based developer of programmable deep learning accelerators for the data center for approximately $2 billion. The combination strengthens Intel’s artificial intelligence (AI) portfolio and accelerates its efforts in the nascent, fast-growing AI silicon market, which Intel expects to be greater than $25 billion by 20241.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191216005167/en/Habana Labs chairman Avigdor Willenz stands near a rack that incorporates Habana Labs' HLS-1 Gaudi artificial intelligence training system at Habana Labs' office in Caesarea, Israel. Willenz will serve as a senior adviser to the business unit as well as to Intel Corporation after Intel's purchase of Habana. (Credit: Eyal Toueg/Intel Corporation)\n“This acquisition advances our AI strategy, which is to provide customers with solutions to fit every performance need – from the intelligent edge to the data center,” said Navin Shenoy, executive vice president and general manager of the Data Platforms Group at Intel. “More specifically, Habana turbo-charges our AI offerings for the data center with a high-performance training processor family and a standards-based programming environment to address evolving AI workloads.”\n\nIntel’s AI strategy is grounded in the belief that harnessing the power of AI to improve business outcomes requires a broad mix of technology – hardware and software – and full ecosystem support. Today, Intel AI solutions are helping customers turn data into business value and driving meaningful revenue for the company. In 2019, Intel expects to generate over $3.5 billion in AI-driven revenue, up more than 20 percent year-over-year. Together, Intel and Habana can accelerate the delivery of best-in-class AI products for the data center, addressing customers’ evolving needs.\n\nShenoy continued: “We know that customers are looking for ease of programmability with purpose-built AI solutions, as well as superior, scalable performance on a wide variety of workloads and neural network topologies. That’s why we’re thrilled to have an AI team of Habana’s caliber with a proven track record of execution joining Intel. Our combined IP and expertise will deliver unmatched computing performance and efficiency for AI workloads in the data center.”\n\nHabana will remain an independent business unit and will continue to be led by its current management team. Habana will report to Intel’s Data Platforms Group, home to Intel’s broad portfolio of data center class AI technologies. This combination gives Habana access to Intel AI capabilities, including significant resources built over the last three years with deep expertise in AI software, algorithms and research that will help Habana scale and accelerate.\n\nHabana chairman Avigdor Willenz has agreed to serve as a senior adviser to the business unit as well as to Intel. Habana will continue to be based in Israel where Intel also has a significant presence and long history of investment. Prior to this transaction, Intel Capital was an investor in Habana.\n\n“We have been fortunate to get to know and collaborate with Intel given its investment in Habana, and we’re thrilled to be officially joining the team,” said David Dahan, CEO of Habana. “Intel has created a world-class AI team and capability. We are excited to partner with Intel to accelerate and scale our business. Together, we will deliver our customers more AI innovation, faster.”\n\nGoing forward, Intel plans to take full advantage of its growing portfolio of AI technology and talent to deliver customers unmatched computing performance and efficiency for AI workloads.\n\nHabana’s AI Training and Inference Products\n\nHabana’s Gaudi AI Training Processor is currently sampling with select hyperscale customers. Large-node training systems based on Gaudi are expected to deliver up to a 4x increase in throughput versus systems built with the equivalent number of GPUs. Gaudi is designed for efficient and flexible system scale-up and scale-out.\n\nAdditionally, Habana’s Goya AI Inference Processor, which is commercially available, has demonstrated excellent inference performance including throughput and real-time latency in a highly competitive power envelope. Gaudi for training and Goya for inference offer a rich, easy-to-program development environment to help customers deploy and differentiate their solutions as AI workloads continue to evolve with growing demands on compute, memory and connectivity.\n\nAbout Intel \n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\n\n1Intel estimates the total addressable market (TAM) for AI silicon by 2024 will be greater than $25 billion, and within that, AI silicon in the data center is expected to be greater than $10 billion in the same timeframe.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191216005167/en/\nTrey Campbell\nIntel Investor Relations\n+1 (503) 696 2829\ntrey.s.campbell@intel.com\n\nCara Walker\nIntel Media Relations\n+1 (503) 696-0831\ncara.walker@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel’s Continued Commitment to Transparency and Equity at All Levels",
        "subtitle": "",
        "date": "Dec 10, 2019 11:00AM EST",
        "content": "\nBuilding Diverse Representation Across the Company\n    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nThe following is an opinion editorial by Barbara Whye from Intel Corporation:\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191210005252/en/Barbara Whye is chief diversity and inclusion officer and vice president of Human Resources for the Technology, Systems Architecture and Client Group at Intel Corporation. (Credit: Intel Corporation)\nAt Intel, we believe that a diverse workforce and inclusive culture are key to our evolution and to driving our growth. If we want to shape the future of technology, our workforce must be representative of that future. Transparency and open sharing of our data enable us to both celebrate our progress and confront our setbacks on that journey. We feel a sense of responsibility to continue to lead the industry in this space by raising the transparency bar for ourselves and, as a result, raising it for others.\n\nThat’s why today, in keeping with that commitment, we are disclosing our latest workforce representation data. We are also releasing our 2017 and 2018 EEO-1 pay data, as we pledged to do in October. These datasets each tell an important part of the story and point to work that lies ahead.\n\nHopefully, openly sharing the details of our representation journey will encourage others in the industry to do the same. When transparency reveals areas for improvement, we must work together to understand the challenges and put forth specific actions to create a more inclusive industry. Overcoming systemic challenges will require accountability on all fronts and a fierce sense of urgency.\n\nWorking toward better representation\n\nI am proud that our company reached full market representation in our U.S. workforce last year. This was achieved through a comprehensive strategy that encompassed hiring, retention and progression. However, there is much more to be done.\n\nIntel was one of the first companies to launch a report with its workforce representation and we’ve been happy to see at least a dozen other companies join us over the years. This year, we are including a deeper look at our leadership levels, our directors and executives, to show a more comprehensive picture. We are also looking beyond the U.S. and expanding disclosure of our global diversity data, as we’ve been focused on extending our diversity and inclusion initiatives to our entire workforce throughout 2019.\n\nOur key findings from 2018-2019 include:\n\nOur company still needs better female and underrepresented male representation in leadership positions in the U.S. and worldwide. There is a gap in progression for women and underrepresented populations from senior management into our director and executive level ranks. These drops are preventable, and we are doubling down on our inclusion efforts, including a re-evaluation of leadership progression to make sure women and underrepresented groups are advancing within the company. After all, we know that representation at the top matters most if we want to change the rest of the company.\n\nThis year, our Warmline service was expanded globally. The Warmline is an employee hotline that provides retention support to any employee who is having issues with a manager or their current position or career progression. We also launched a program encouraging employees to become allies to support a more inclusive work environment, helping them understand and role model inclusive behaviors. And we have developed a broad set of training programs for managers and executives on inclusion practices that we see within our highest performing teams. Inclusion is an integral part of our culture evolution, which reflects our company transformation and ongoing efforts to attract and retain top talent.\n\nWhat our pay data shows\n\nEarlier this year, we announced gender pay equity globally across our 107,000 employees in over 50 countries. This is a critical first step — ensuring all employees in the same or similar roles are paid fairly regardless of gender or race/ethnicity, taking into consideration factors that influence pay such as performance, time in grade and tenure.\n\nIn keeping with our commitment to transparency, we are publicly releasing our 2017 and 2018 EEO-1 pay data filing, also known as the new component 2 disclosure requirement, alongside our annual 2019 companywide representation data. It’s important to consider that the data in this report is collected from employees’ W2 box 1 earnings, which includes all taxable income and has not been normalized for factors such as hire date, shift differentials and employee retirement contributions.\n\nAs might be expected, the pay data overall also reflects our representation gaps — there are fewer females and underrepresented groups at the senior-most, and therefore most highly compensated, levels of the company. Many of our executives, directors and managers in the highest EEO-1 pay categories are white and Asian males, while there are proportionally more females and underrepresented groups in lower pay categories.\n\nHowever, due to our diversity and inclusion efforts, there is promising growth of our junior female and underrepresented talent from which our future leadership will be drawn. Our challenge now is to create an environment that better helps our female and underrepresented employees develop and progress in their careers, while also ensuring we are expanding our hiring and retention of diverse talent at more senior, higher paying positions.\n\nTransforming our culture with inclusion at the center\n\nIt is clear from our latest representation and pay data that we must continue to focus on the progression of all qualified employees within the company and build a deeper culture of inclusion to allow all voices to be heard. We’ve learned that transparency is our strength and something that is critical for real progress. It clarifies our challenges and opportunities, allowing us to work together on solutions. We urge other companies to join us in being transparent and open with their successes and setbacks so we can continue to learn from each other.\n\nIntel will continue to be bold and dedicated to transforming our culture for a new world. At the center of that cultural change is diversity and inclusion, and growing representation at every level of the company. We have made inclusion an integral part of our plan to evolve our culture and enable us to continue to attract and retain top talent needed to support our transformation to a data-centric company. This is a journey, and we know there is still much more to be done. We are committed to continuing our efforts and leading the industry toward a future workforce that reflects the population at large.\n\nI look forward to sharing more details in the coming months about how we will achieve these goals.\n\nBarbara Whye is Chief Diversity and Inclusion Officer and vice president of Human Resources for the Technology, Systems Architecture and Client Group at Intel Corporation.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191210005252/en/\nPatricia Oliverio-Lauderdale\n408-653-5478\npatricia.oliverio-lauderdale@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Thinking about buying stock in Corvus Pharmaceuticals, Fitbit, Intel, Sprint, or Slack Technologies?",
        "subtitle": "",
        "date": "Dec 6, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 6, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CRVS, FIT, INTC, S, and WORK.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-corvus-pharmaceuticals-fitbit-intel-sprint-or-slack-technologies-300970637.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Intel Editorial: Advancing Industrywide Compute Lifecycle Assurance",
        "subtitle": "",
        "date": "Dec 4, 2019 1:00PM EST",
        "content": "\nAssurance Begins with Security-First Design and Extends Throughout the Compute Lifecycle\n    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nThe following is an opinion editorial from Leslie Culbertson of Intel Corporation.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191204005239/en/Leslie S. Culbertson is an executive vice president and general manager of Product Assurance and Security at Intel Corporation. (Credit: Intel Corporation)\nThe globalization of technology design, development, manufacturing and distribution has created an environment of complicated supply chains with limited transparency. There is a growing need to provide assurances of platform integrity in every stage of the compute lifecycle, and to do so in a manner that is as transparent as possible. Government agencies, commercial organizations and consumers deserve this transparency and the benefit it can bring for improved platform security and resiliency.\n\nThis presents both an incredible challenge and opportunity for the ecosystem. Today, Intel is responding to the challenge with the introduction of our Compute Lifecycle Assurance Initiative.\n\nWe have tackled big, complex problems like this before and we are doing it again. Intel has already taken several important steps toward supply chain transparency. We actively led and collaborated with the industry to influence policies and processes concerning the use of conflict-free minerals — not only for Intel products — but across the industry. In addition, we have already developed a set of policies and procedures at our own factories to validate where and when every component of a server was manufactured. These examples represent an important beginning, and there is more that can be done.\n\nIn today’s increasingly complex environment, we want to provide our customers with a full range of tools and solutions that deliver assurances of integrity throughout the entire lifetime of a platform. This starts with a security-first approach to design. It continues as platforms change custody, ownership and physical location several times during their assembly, transportation and provisioning. Once operational, they may then require updates for optimal performance and security. Finally upon retirement from service, platforms should ensure the confidentiality of data that was transmitted, erased or stored.\n\nThe industry needs an end-to-end framework that can be applied across this multiyear life of any platform. And that is our goal with the Compute Lifecycle Assurance Initiative — to substantially improve transparency and to provide higher levels of assurance that improve integrity, resilience and security during the entire platform lifecycle.\n\nMore: Introduction to Compute Lifecycle Assurance | Security News at Intel\n\nWe have identified four key lifecycle stages: build, transfer, operate and retire. Over the next year, we commit to:\n\nChallenges to overcome\n\nWorldwide, policymakers have begun to focus on supply chain risks in new ways. In August 2018, MITRE published the highly influential report, Deliver Uncompromised. MITRE’s report described the urgency and importance for supply chain risks to receive attention during product procurement. New U.S. laws, including the 2018 SECURE Technology Act, gave U.S. federal agencies new authority to consider supply chain risks when procuring products. From Europe’s “digital sovereignty” efforts to Japan’s “Cyber/Physical Security Framework” efforts, there are signs of strong interest in shining a spotlight on the trust and transparency of supply chains for information and communications technology.\n\nWe believe a broader set of commercial enterprises from around the world will find value in this level of assurance for validation, compliance and governance. In the next 12 to 18 months, we expect to see growing interest from our customers, partners and government oversight organizations to improve transparency beyond the manufacturing supply chain to also include transportation, provisioning, attestation and in-field updates.\n\nWe’re in a unique and fortunate position as a trusted member of the ecosystem and as a leader in the transparency of our own supply chain. We intend to use this position to help mobilize the industry at large and to anticipate the needs of our global — and mutual — customers.\n\nThese are early days, and we know we can’t do this alone. We invite the broader ecosystem to join us on this journey. Together with our partners and customers, we will continue to build a more trusted foundation for all computing systems.\n\nLeslie S. Culbertson is an executive vice president and general manager of Product Assurance and Security at Intel Corporation. \n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204005239/en/\nLeigh Rosenwald\n503-784-7492\nleigh.rosenwald@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel Solutions Marketplace for Partners Helps Speed Growth, Innovation through Global Collaboration",
        "subtitle": "",
        "date": "Dec 4, 2019 11:30AM EST",
        "content": "    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nWhat’s New: Intel today launched Intel® Solutions Marketplace, an innovative platform to help partners deploy solutions in an increasingly complex, data-centric economy. On the new platform, and all from personal dashboards, Intel partners can grow their businesses through new partner connections and matchmaking, receive and manage leads, monitor business performance, and market solutions to end customers. The new platform joins Intel® Partner University as a key offering of Intel® Partner Alliance, the company’s announced channel partner program transformation designed to help partners connect, innovate and grow in a data-centric world.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191204005102/en/Intel Corporation in December 2019 launches the Intel Solutions Marketplace, a platform to help partners deploy solutions in a complex, data-centric economy. (Credit: Intel Corporation)\n“The sum of the world’s data will grow from 33 zettabytes in 2018 to an incredible 175 zettabytes by 20251. As data continues to define the future, solutions are becoming increasingly complex. Innovation requires a broader array of partners working together to build offerings that provide customers better ways to move, store and process data. We created a platform to help partners explore new points of collaboration, showcase innovative offerings and help grow new business.”\n–Eric Thompson, Intel general manager of Global Partner Enablement\n\nWhy It is Important: The Solutions Marketplace facilitates better collaboration between partners, helping them focus on desired outcomes and delivering customization. The platform is equipped with powerful new capabilities that enable partners to connect and collaborate with a global network of other peer partners to jointly deliver innovative data-centric solutions to business end customers. Today, solutions typically include hardware, software and services in varying combinations and are increasingly being designed to solve specific business challenges. For example, a solution to help a municipality reduce energy consumption using smart devices could be entirely led by the services side of the business, while an artificial intelligence solution to drive predictive maintenance for reduced downtime might be led by a software or hardware vendor. The Solutions Marketplace makes this kind of collaboration easier and more efficient.\n\nWhat It Offers: Intel Solutions Marketplace encourages partners to collaborate within an expanded ecosystem, allowing Intel partners and business end customers to research and pursue thousands of partner solutions, including Intel® IOT Market Ready Solutions, artificial intelligence, autonomous technology, data center and cloud, 5G, and next-generation computing. It enables a new way for partners to innovate, go to market and grow their businesses. Among the key features:\n\nWhat’s Next: The Intel Solutions Marketplace is designed to drive collaboration across the ecosystem, making it easy for partners to connect with each other, all within the trusted Intel ecosystem. Intel will roll out enhancements throughout 2020 to help partners manage leads, monitor performance from personal dashboards and continue to grow their businesses.\n\nMore Context: Intel Solutions Marketplace for Partners Helps Speed Growth, Innovation through Global Collaboration (YouTube Video)\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n1Source: IDC White Paper, sponsored by Seagate, “Data Age 2025: The Digitization of the World from Edge to Core,” November 2018. https://www.seagate.com/files/www-content/our-story/trends/files/idc-seagate-dataage-whitepaper.pdf\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204005102/en/\nSusan Martenson\n978-905-9582\nsusan.martenson@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Intel Completes Sale of Smartphone Modem Business to Apple",
        "subtitle": "",
        "date": "Dec 2, 2019 9:00AM EST",
        "content": "    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nIntel Corporation today announced it has completed the sale of the majority of its smartphone modem business to Apple. This transaction, valued at $1 billion, was announced on July 25, 2019. As previously disclosed, this transaction enables Intel to focus on developing technology for 5G networks while retaining the option to develop modems for non-smartphone applications, such as PCs, internet of things devices and autonomous vehicles.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\nForward-Looking Statements \n\nThis press release contains forward-looking statements relating to the expected benefits of the sale of the majority of Intel’s smartphone modem business to Apple and Intel’s future plans and expectations. Such statements are based on management expectations as of the date of this release and, except as required by law, Intel disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. Forward-looking statements involve many risks and uncertainties that could cause actual results to differ materially from those expressed or implied in such statements. Important factors that could cause actual results to differ materially are set forth in Intel’s earnings release dated Oct. 24, 2019, which is included as an exhibit to Intel’s Form 8-K furnished to the SEC on such date. Additional information regarding these and other factors that could affect Intel’s results is included in Intel’s SEC filings, including the company’s most recent reports on Forms 10-K and 10-Q. Copies of Intel’s Form 10-K, 10-Q and 8-K reports may be obtained by visiting our Investor Relations website at www.intc.com or the SEC’s website at www.sec.gov.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005256/en/\nBrooke Wells\n503-613-8230\nbrooke.wells@intel.com \n\nCara Walker\n503-696-0831\ncara.walker@intel.com\nSource: Intel Corporation"
    },
    {
        "title": "Thinking about buying stock in Fitbit, HP, Intel, Sorrento Therapeutics, or Wells Fargo?",
        "subtitle": "",
        "date": "Nov 26, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 26, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FIT, HPQ, INTC, SRNE, and WFC.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-fitbit-hp-intel-sorrento-therapeutics-or-wells-fargo-300965402.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Intel to Redeem 3.25% Junior Subordinated Convertible Debentures Due 2039",
        "subtitle": "",
        "date": "Nov 25, 2019 4:30PM EST",
        "content": "    SANTA CLARA, Calif.--(BUSINESS WIRE)--\nIntel Corporation (NASDAQ: INTC) announced today that it has issued a notice of redemption to redeem on Jan. 9, 2020, all of its outstanding 3.25% Junior Subordinated Convertible Debentures due 2039 (CUSIP Number 458140AF7) (the \"Securities\"). As of Nov. 12, 2019, approximately $372 million principal amount of the Securities was outstanding.\n\nThe Securities called for redemption will be redeemed at a stated redemption price equal to 100% of the aggregate principal amount of such Securities, plus accrued and unpaid interest to (but excluding) the redemption date.\n\nThe conversion rate of the Securities as of Nov. 22, 2019, is 49.6852 shares of Intel common stock per $1,000 principal amount of the Securities, which is equivalent to a conversion price of $20.13 per share of common stock. The Securities called for redemption may be converted at any time before the close of business (which is 5 p.m., ET) on Jan. 6, 2020, the third Scheduled Trading Day (as defined in the indenture governing the Securities) immediately preceding the redemption date. Intel will settle the conversion obligation with respect to the Securities in cash. The amount of cash payable upon conversion of any Security shall, for each share of common stock into which the Security is convertible, be equal to the sum of the Daily Settlement Amounts (as defined in the indenture) for each of the 20 trading days during the Observation Period. The Observation Period means the 20 consecutive trading days beginning on and including the 22nd Scheduled Trading Day prior to the redemption date. Upon conversion, a Holder will not receive any separate cash payment for accrued and unpaid interest and the Company’s settlement of the conversion obligation shall be deemed to satisfy its obligation to pay the principal amount of the Security and accrued and unpaid interest to, but not including the conversion date.\n\nA copy of the notice of redemption may be obtained from Wells Fargo Bank, National Association, as trustee, paying agent and conversion agent, by calling 1-800-344-5128.\n\nAbout Intel\n\nIntel (NASDAQ: INTC), a leader in the semiconductor industry, is shaping the data-centric future with computing and communications technology that is the foundation of the world’s innovations. The company’s engineering expertise is helping address the world’s greatest challenges as well as helping secure, power and connect billions of devices and the infrastructure of the smart, connected world – from the cloud to the network to the edge and everything in between. Find more information about Intel at newsroom.intel.com and intel.com.\n\n© Intel Corporation. Intel, the Intel logo, and other Intel marks are trademarks of Intel Corporation or its subsidiaries. Other names and brands may be claimed as the property of others.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements relating to the redemption of the Securities, as well as forward-looking statements relating to Intel’s future plans and expectations. Words such as “anticipates,” “expects,” “intends,” “goals,” “plans,” “believes,” “seeks,” “estimates,” “continues,” “may,” “will,” “would,” “should,” “could,” and variations of such words and similar expressions are intended to identify such forward-looking statements. All forward-looking statements included in this release are based on management expectations as of the date of this release and, except as required by law, Intel disclaims any obligation to update these forward-looking statements to reflect future events or circumstances. Forward-looking statements involve many risks and uncertainties that could cause actual results to differ materially from those expressed or implied in such statements. Such risks and uncertainties include changes in market conditions and other risks detailed in Intel’s SEC filings, including its most recent reports on Form 10-K, Form 10-Q, and Form 8-K, which are available at the SEC’s website at www.sec.gov. Copies of Intel’s SEC filings may also be obtained by visiting Intel’s Investor Relations website at www.intc.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191125005678/en/\nBrooke Wells\nInvestor Relations\n503-613-8230\nbrooke.wells@intel.com\n\nCara Walker\nMedia Relations\n503-696-0831\ncara.walker@intel.com\nSource: Intel Corporation"
    }
]