[
    {
        "title": "Intuit ProConnect Announces Karbon Partnership to Deliver Intuit Practice Management to Tax Professionals",
        "subtitle": "",
        "date": "Feb 25, 2020 10:00AM EST",
        "content": "\nIntuit adds new partner to advance capabilities in ProConnect Tax Online and Lacerte, deliver automated tasks and optimize workflows for tax professionals \n    PLANO, Texas--(BUSINESS WIRE)--\nToday, Intuit ProConnect is announcing Intuit Practice Management powered by Karbon, to continue accelerating software capabilities for tax professionals. Karbon, a practice management solution and advanced work and communications platform, enables a collaborative place for accounting firms and professional services to manage workflows, communicate with teams and deliver exceptional client work in today’s digital workplace.\n\n“We’re continuing to build meaningful relationships with trusted partners like Karbon to make sure tax and accounting professionals have the tools they need to reduce compliance work and help their clients thrive,” said Jorge Olavarrieta, Vice President of Product Management at Intuit. “With Intuit Practice Management, firms can now increase their team’s output with a centralized, collaborative work management platform deeply integrated with their email and the tax software they know and love from Intuit.”\n\n“At Karbon, we have always had the greatest admiration for Intuit’s best-in-class products, and their willingness to innovate and explore new initiatives that will significantly benefit their customers,” said Stuart McLeod, Chief Executive Officer & Co-Founder at Karbon. “We are beyond excited to be partnering with Intuit in this space to offer a solution that can create a meaningful impact on our joint customers and the accounting profession as a whole.”\n\nEnhanced and expanded capabilities with a subscription to Intuit Practice Management include:\n\nAfter creating an account, tax professionals can now seamlessly navigate from Intuit Practice Management to Intuit ProConnect Tax Online and Lacerte to confidently scope work, automate data collection, scale client onboarding, anticipate bottlenecks and automate recurring work. All communication and work can now be in one place so tax firms know their team has everything they need to analyze team performance, improve efficient processes and inform future planning.\n\n“This partnership gives accounting firms something they’ve never had before, combining their best-of-breed tax and compliance software seamlessly with their professional-grade practice management,” said Ian Vacin, Chief Customer Officer & Co-Founder at Karbon. “For the first time, they can streamline their workflow from end-to-end, allowing them to work more efficiently, make better-informed decisions and improve their client service.”\n\nWith Intuit Practice Management, Intuit is continuing to expand its new, advanced capabilities for tax professionals. Integrations with trusted partners helps automate compliance work by working with tax professionals’ existing core tax software, freeing up more time for firms to deliver advisory services to clients. Intuit knows availability to tools that deliver on client and firm needs is paramount to firm productivity. Intuit Practice Management is expected to be available for tax year 2020. Additional terms, conditions and fees apply. Tax professionals will need to share client information with Karbon. To learn more visit http://proconnect.intuit.com/practice-management.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nAbout Karbon\n\nKarbon is work management software for accounting firms. It provides a truly collaborative platform to manage workflows, communicate with teams and deliver exceptional client work. By combining email, discussions, tasks and powerful workflows, Karbon aligns your team with a single place to communicate and collaborate, increasing capacity to deliver on time and budget. To learn how you can maximize your team's output with Karbon, visit http://www.karbonhq.com\n\nThis information is intended to outline our general product direction, but represents no obligation and should not be relied on in making a purchase decision.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225005680/en/\nStephanie Friswell\nIntuit Inc.\n214-387-2958\nstephanie_friswell@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit Second Quarter Revenue Increased 13 Percent; Small Business Online Ecosystem Revenue Grew 35 Percent",
        "subtitle": "",
        "date": "Feb 24, 2020 4:01PM EST",
        "content": "\nReiterates Full Year Fiscal 2020 Guidance\n"
    },
    {
        "title": "Intuit to Acquire Credit Karma",
        "subtitle": "",
        "date": "Feb 24, 2020 4:00PM EST",
        "content": "\nCombined Companies to Create Consumer Finance Platform That Works Like a Personalized Financial Assistant\n\nCompanies Aim to Transform FinTech, Power the Economy and Help Consumers Make Financial Progress\n    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit (Nasdaq: INTU), proud maker of TurboTax, QuickBooks and Mint, today announced that it has agreed to acquire Credit Karma, the consumer technology platform with more than 100 million members in the U.S., Canada and U.K., for approximately $7.1 billion in cash and stock. By agreeing to acquire Credit Karma, a company with nearly $1 billion in unaudited revenue in calendar year 2019, up 20% from the previous year, Intuit accelerates its mission of powering prosperity around the world.\n\nThe combination brings together two technology leaders with a shared goal to help solve the personal finance problems that consumers face today, regardless of their financial situation -- managing debt, maximizing savings, access to better credit cards and loans -- with an aim to put more money in consumers’ pockets.\n\n“Our mission is to power prosperity around the world with a bold goal of doubling the household savings rate for customers on our platform,” said Sasan Goodarzi, CEO of Intuit. “We wake up every day trying to help consumers make ends meet. By joining forces with Credit Karma, we can create a personalized financial assistant that will help consumers find the right financial products, put more money in their pockets and provide insights and advice, enabling them to buy the home they’ve always dreamed about, pay for education and take the vacation they’ve always wanted.”\n\n“We started Credit Karma with a goal to build a trusted destination for all consumers, to make financial progress regardless of where they are in life,” said Kenneth Lin, Founder and CEO of Credit Karma. “We saw the opportunity to enrich people’s financial lives through transparency, simplicity and certainty.”\n\nMany consumers struggle with not knowing or not fully understanding where they stand with their finances. Household debt in the United States hit $14.1 trillion including, among other sources, $9.6 trillion in mortgage debt, nearly $1 trillion in credit card debt and $1.5 trillion in student loan debt.1 In addition, 23 million people relied on at least one payday loan in 2018 to get faster access to cash.2 At the same time, we know consumers want to improve. In fact, 60% of consumers say they are trying to improve their credit score.3\n\nIntuit and Credit Karma will tackle these problems by making it simple for consumers to make better decisions with their money through a consumer finance platform that works like a personalized financial assistant, helping consumers find the right financial products, put more money in their pockets and have access to actionable insights and advice. This platform will provide consumers with transparent access to their critical personal finance information - including their income, spending, and credit history - to help them better understand their complete financial picture and use it to their advantage, such as for obtaining better interest rates, all with security in mind. The result will be a complete financial profile that puts the power in consumers’ hands so they can take the steps necessary to improve their financial health and maximize their money.\n\nThe platform, leveraging artificial intelligence and connections to over 100 financial partners, will help consumers:\n\nFounded in 2007, Credit Karma has experienced remarkable success. Credit Karma presently has the largest engaged member base in consumer digital finance with more than 100 million members, with 37 million monthly active users of which 88% engage on mobile devices. The company has nearly tripled the growth of its member base over the past five years and created a marketplace comprised of more than 100 financial service providers.\n\n“There’s a lot of innovation and investment in FinTech, but we don’t see anyone, with our collective capabilities, pursuing a personalized financial assistant to help consumers take control of their financial lives,” Goodarzi said. “Together with Ken and the Credit Karma team, we’re going to bring together consumers and financial institutions in innovative ways that lower costs for all those involved and level the playing field for consumers regardless of their economic status. We believe we can transform the personal finance industry and power the economy.”\n\n“We could not have picked a better partner than Sasan and the Intuit team to accelerate our mission to champion financial progress for our members,” Lin added. “Together, the complementary strengths of our combined companies will help us to invest in innovation, build faster and deliver products our consumers expect and deserve.”\n\nTransaction Details\n\nThe transaction is expected to be neutral to accretive to Intuit’s non-GAAP earnings per share in the first full fiscal year after the transaction closes. Intuit has agreed to pay total consideration of approximately $7.1 billion to acquire Credit Karma, subject to customary adjustments for transactions of this nature. The purchase price for Credit Karma will be payable in equal portions of cash and Intuit common stock, with the shares of Intuit common stock being valued at approximately $299.73 per share (which price was calculated based on the daily volume-weighted average sales price per share for Intuit common stock for the ten trading days ending on February 21, 2020). The per share price of these shares has been fixed as of the merger agreement signing date. The aggregate value of these shares will fluctuate based on changes in our share price between the signing date and the closing date.\n\nThe total consideration of $7.1 billion includes an estimated $1 billion of equity awards that will be expensed over up to three years. Following the close of the transaction Intuit will issue approximately $300 million of restricted stock units to Credit Karma employees, which will be expensed over four years.\n\nIntuit expects the cash consideration to be financed through cash and its existing unsecured line of credit. The transaction is not expected to have an impact on Intuit’s existing dividend and share repurchase principles. The transaction is expected to close in the second half of calendar year 2020, subject to receipt of required regulatory approvals and satisfaction or waiver of other customary closing conditions.\n\nAdvisors\n\nQatalyst Partners is serving as Intuit’s financial advisor, with Latham & Watkins, LLP serving as legal advisor. Goldman Sachs & Co. LLC is serving as Credit Karma’s financial advisor, with Skadden, Arps, Slate, Meagher & Flom LLP and Wilson Sonsini Goodrich & Rosati serving as legal advisors.\n\nConference Call Details\n\nIntuit and Credit Karma executives will discuss the details of this transaction during Intuit’s second quarter earnings conference call at 1:30 p.m. Pacific time on February 24. To listen to the call, dial 844-246-4601 in the United States or 703-639-1172 from international locations. No reservation or access code is needed. The conference call can also be heard live at http://investors.intuit.com/Events/default.aspx. Prepared remarks for the call will be available on Intuit’s website after the call ends and at www.smartmoneydecisions.com.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nAbout Credit Karma\n\nFounded in 2007 by Ken Lin, Credit Karma is a consumer technology company with more than 100 million members in the U.K., United States and Canada, including almost half of all U.S. millennials. While best known for pioneering free credit scores, the company’s members turn to Credit Karma for everything related to their financial goals, including identity monitoring, applying for credit cards, shopping for loans (car, home and personal), filing their taxes and now high-yield savings accounts through our bank partner, MVB, Inc., Member FDIC -- all for free.\n\nLearn more about how Credit Karma members are making financial progress on Facebook, Twitter, and YouTube.\n\nCautions About Forward-looking Statements\n\nThis communication contains forward-looking statements within the meaning of applicable securities laws. Forward-looking statements and information usually relate to future events and anticipated revenues, earnings, cash flows or other aspects of our operations or operating results. Forward-looking statements are often identified by the words “believe,” “expect,” “anticipate,” “plan,” “intend,” “foresee,” “should,” “would,” “could,” “may,” “estimate,” “outlook” and similar expressions, including the negative thereof. The absence of these words, however, does not mean that the statements are not forward-looking.\n\nBecause these forward-looking statements involve risks and uncertainties, there are important factors that could cause our actual results to differ materially from the expectations expressed in the forward-looking statements. These factors include, without limitation, the following: failure to obtain required regulatory approvals in a timely manner or otherwise; failure to satisfy any closing conditions to the proposed acquisition of Credit Karma, Inc.; risks associated with tax liabilities or changes in U.S. federal tax laws or interpretations to which the proposed transaction with Credit Karma, Inc. or parties thereto are subject; failure to successfully integrate any new business; failure to realize anticipated benefits of any combined operations; unanticipated costs of acquiring or integrating Credit Karma, Inc.; potential impact of announcement or consummation of the proposed acquisition on relationships with third parties, including employees, customers, partners and competitors; inability to retain key personnel; changes in legislation or government regulations affecting the acquisition or the parties; and economic, social or political conditions that could adversely affect the acquisition or the parties. More details about these and other risks that may impact our business are included in our Form 10-K for fiscal 2019 and in our other SEC filings. You can locate these reports through our website at http://investors.intuit.com. We caution you not to place undue reliance on any forward-looking statements, which speak only as of the date hereof. We do not undertake any duty to update any forward-looking statement or other information in this communication, except to the extent required by law.\n\nNo Offer or Solicitation\n\nThis communication is not intended to and does not constitute an offer to sell or the solicitation of an offer to subscribe for or buy or an invitation to purchase or subscribe for any securities or the solicitation of any vote in any jurisdiction pursuant to the proposed transactions or otherwise, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in contravention of applicable law. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act. Subject to certain exceptions to be approved by the relevant regulators or certain facts to be ascertained, the public offer will not be made directly or indirectly, in or into any jurisdiction where to do so would constitute a violation of the laws of such jurisdiction, or by use of the mails or by any means or instrumentality (including without limitation, facsimile transmission, telephone and the internet) of interstate or foreign commerce, or any facility of a national securities exchange, of any such jurisdiction.\n\nAdditional Information\n\nImportant Additional Information Will be Filed with the SEC\n\nIntuit will file with the SEC a registration statement on Form S-4, which will include the prospectus of Intuit (the “prospectus”). INVESTORS AND SHAREHOLDERS ARE URGED TO CAREFULLY READ THE PROSPECTUS, AND OTHER RELEVANT DOCUMENTS TO BE FILED WITH THE SEC, IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT INTUIT, CREDIT KARMA, INC., THE PROPOSED TRANSACTIONS AND RELATED MATTERS. Investors and shareholders will be able to obtain free copies of the prospectus and other documents filed with the SEC by the parties through the website maintained by the SEC at www.sec.gov. In addition, investors and shareholders will be able to obtain free copies of the prospectus and other documents filed with the SEC on Intuit’s website at http://investors.intuit.com.\n\n1 NY Fed 2019 https://www.newyorkfed.org/medialibrary/interactives/householdcredit/data/pdf/HHDC_2019Q2.pdf\n2 Financial research company Moebs Services\n3 Shopping around for a mortgage pays off, Q1 2019 Fannie Mae https://www.fanniemae.com/resources/file/research/housingsurvey/pdf/consumer-mortgage-shopping-infographic.pdf\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200224005884/en/\nInvestors\nKim Watkins\nIntuit Inc.\n650-944-3324\nkim_watkins@intuit.com\n\nMedia\nKali Fry\nIntuit Inc.\n650-944-3036\nkali_fry@intuit.com\n\nMedia\nEmily Donohue\nCredit Karma\n805-260-6401\nemily.donohue@creditkarma.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit to Announce Second-quarter Fiscal 2020 Results on Feb. 24",
        "subtitle": "",
        "date": "Jan 31, 2020 4:00PM EST",
        "content": "    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU), maker of QuickBooks, TurboTax and Mint, will announce its second-quarter results for fiscal year 2020 on Feb. 24 following the close of market. The company’s second quarter ends today, January 31. Intuit executives will discuss the financial results on a conference call at 1:30 p.m. Pacific time on Feb. 24. To listen to the call, dial 844-246-4601 in the United States or 703-639-1172 from international locations. No reservation or access code is needed. The conference call can also be heard live at http://investors.intuit.com/Events/default.aspx. Prepared remarks for the call will be available on Intuit’s website after the call ends.\n\nReplay Information\n\nA replay of the conference call will be available for one week by calling 855-859-2056, or 404-537-3406 from international locations. The access code for this call is 5593966. The audio webcast will remain available on Intuit’s website for one week after the conference call.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200131005496/en/\nInvestors\nLisa Patterson\nIntuit Inc.\n650-944-2713\nlisa_patterson@intuit.com\n\nMedia\nKali Fry\nIntuit Inc.\n650-944-3036\nkali_fry@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit Recommends Shareholders Reject Mini-Tender Offer by TRC Capital Investment Corporation",
        "subtitle": "",
        "date": "Jan 27, 2020 6:49PM EST",
        "content": "    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU), maker of TurboTax, QuickBooks and Mint, has been notified of an unsolicited mini-tender offer by TRC Capital Investment Corporation (“TRC”) to purchase up to 400,000 shares of Intuit common stock at a price of $270.00 per share in cash. TRC’s offer price is approximately 4.54 percent lower than the closing price of Intuit common stock on Jan. 17, 2020 ($282.85), the last trading day prior to the commencement of the offer, and approximately 6.28 percent lower than closing price of Intuit common stock on Jan. 24, 2020 ($288.08), the last trading day prior to this release.\n\nIntuit does not endorse TRC’s offer and recommends that Intuit shareholders reject the offer and not tender their shares in response to TRC’s unsolicited offer. The mini-tender offer is at a price below the market price of shares of Intuit’s common stock (as of today’s date) and is subject to numerous conditions, including TRC’s ability to obtain financing. Intuit is not associated in any way with TRC, its mini-tender offer or the offer documentation.\n\nTRC has made many similar unsolicited mini-tender offers for shares of other publicly traded companies. Mini-tender offers seek to acquire less than 5 percent of a company’s outstanding shares, thereby avoiding many disclosure and procedural requirements of the Securities and Exchange Commission (“SEC”) that apply to tender offers for more than 5 percent of a company’s outstanding shares. As a result, mini-tender offers may not provide investors with the same level of protections as provided in larger tender offers under U.S. securities laws.\n\nThe SEC has cautioned investors that some bidders making mini-tender offers at below-market prices are “hoping that they will catch investors off guard if the investors do not compare the offer price to the current market price.” More on the SEC’s guidance to investors on mini-tender offers is available at www.sec.gov/investor/pubs/minitend.htm.\n\nLike TRC’s other mini-tender offers, this one may put individual investors at risk because they may not realize they are selling their shares at a discount. Intuit urges investors to obtain current market quotations for their shares, review the conditions to the offer, consult with their broker or financial advisor and exercise caution with respect to TRC’s mini-tender offer.\n\nIntuit recommends that shareholders who have not responded to TRC’s offer take no action. According to the TRC offer documents received by Intuit, shareholders who have already tendered their shares may withdraw them at any time prior to the expiration of the offer by delivering a written notice of withdrawal as described in the TRC offer documents. The offer is currently scheduled to expire at 12:01 a.m., New York City time, on Feb. 20, 2020. TRC may extend the offering period at its discretion.\n\nIntuit encourages broker-dealers, as well as other market participants, to review the SEC’s letter regarding broker-dealer mini-tender offer dissemination and disclosure at https://www.sec.gov/divisions/marketreg/minitenders/sia072401.htm and the NASD Notice to Members regarding guidance to members forwarding mini-tender offers to their customers, which can be found at https://www.finra.org/sites/default/files/NoticeDocument/p004221.pdf.\n\nIntuit requests that a copy of this news release be included with all distributions of materials relating to TRC’s mini-tender offer related to shares of common stock of Intuit.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200127005734/en/\nInvestors\nKim Watkins\nIntuit Inc.\n650-944-3324\nkim_watkins@intuit.com\n\nMedia\nKali Fry\nIntuit Inc.\n650-944-3036\nkali_fry@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit ProConnect Expands Partnership Ecosystem to Accelerate Software Capabilities for Tax Professionals",
        "subtitle": "",
        "date": "Jan 23, 2020 11:26AM EST",
        "content": "\nIntegrations with trusted partners allow tax professionals and their clients to grow and prosper\n    PLANO, Texas--(BUSINESS WIRE)--\nIntuit ProConnect is announcing plans to expand the capabilities in ProConnect Tax Online, Lacerte and ProSeries with new third-party integrations. The expanding partnership ecosystem will give tax professionals access to new tools to deliver on client needs, help automate compliance work and keep the software they know and love, with the added benefit of an enhanced workflow.\n\n“We believe that meaningful relationships are at the heart of every interaction between clients and tax professionals, and reducing the compliance work will free up time so that professionals can focus more of their time giving valuable advice to their clients, helping them reach their goals,” said Barry Pennett, Intuit ProConnect General Manager.\n\nEnhanced and expanded capabilities for tax year 2019 include:\n\nHosting for ProSeries and Lacerte\n\nExpanded Intuit eSignature Capabilities\n\nImproved Pay-by-Refund Enrollment and Signature Pad Integration\n\nWith new, impactful workflow integrations and accelerated capabilities, Intuit is also maintaining the security of Intuit products as a top priority, continuing to invest and ensure our platform and integrations have industry-leading fraud protection. As part of its ongoing commitment to protect customer information, Intuit has implemented multiple security measures in its professional tax products, including multi-factor authentication, an additional level of data encryption to help further protect data and in-product security tips.\n\n\"We are very excited about the new capabilities we will deliver to our customers as we work jointly with strategic partners to better serve the needs of the tax and accounting firm,\" said Jorge Olavarrieta, Intuit ProConnect Vice President of Product Management. “We are enabling deeper integrations at the most critical points of the professional’s workflow to create a platform that allows them to more effectively manage their work and provides them with richer insights that enables them and their clients to grow and prosper.”\n\nIntegrations with trusted partners helps automate compliance work by working with your existing core tax software, freeing up more time for firms and tax professionals to deliver advisory services to clients. Intuit knows availability to tools that deliver on client needs is paramount to the productivity of firms, and with these new advanced capabilities, Intuit is working to increase functionality in the professional tax software, including ProConnect Tax Online, Lacerte and ProSeries. To learn more visit proconnect.intuit.com/accelerating-capabilities/.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax, QuickBooks, Mint and Turbo, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005608/en/\nStephanie Friswell\nIntuit Inc.\n214-387-2958\nstephanie_friswell@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit TurboTax Welcomes 2020 with Confidence Inspiring Brand Campaign “All People Are Tax People”",
        "subtitle": "",
        "date": "Jan 1, 2020 12:18PM EST",
        "content": "\nNew TurboTax campaign reminds us that all people are capable\n    SAN DIEGO--(BUSINESS WIRE)--\nTurboTax®, the nation’s leading online tax preparation service from Intuit Inc. (Nasdaq: INTU), today announced the launch of its new brand campaign, “All People Are Tax People”. The integrated campaign, which will span broadcast, digital and social, and culminates with a celebratory spot in the NFL Super Bowl, reminds people that they accomplish amazing things every day and, with the right tools and encouragement, they are capable of doing anything – including their taxes.\n\n“Every day we watch the people around us do remarkable things. Yet when it comes to their taxes and finances these same people can feel overwhelmed and intimidated,” said Mary-Ann Somers, Senior Vice President, Intuit’s Consumer Group. “‘At TurboTax, we’ve long believed that with the right tools and encouragement, people are capable of anything – including their taxes. ‘All People Are Tax People’ brings this belief to life, giving consumers the confidence they need to accomplish their taxes.”\n\nThe campaign launches with a 60-second anthem, “All People Are Tax People”, which showcases relatable scenarios and the amazing feats people accomplish every day. Having a baby. Acing a science fair project. Cooking marvelous meals. All the things, big and small, that people accomplish each and every day is proof they can do their own taxes. And while every tax situation is unique and different, consumers can have confidence that TurboTax has the tools, guidance and experts to help them accomplish their taxes too.\n\nA series of addition spots for English and Spanish speaking audiences provide further proof points that people are capable and highlight specific products or features:\n\nAs the NFL’s official sponsor for financial and accounting software, as well as tax preparation services and the presenting sponsor of both the AFC and NFC Championship Games, the campaign has the unique opportunity to connect with the league’s 180 Million fans at the height of tax season. The “All People Are Tax People” campaign also includes high impact, culturally relevant media moments, including a 45-second spot in the NFL Super Bowl.\n\n“As an official sponsor of the NFL, we hope to inspire and empower football fans across the country that they can tackle anything life throws at them, including their taxes,” said Somers.\n\nThe campaign was created in partnership with independent advertising agency Wieden+Kennedy, based in Portland, Oregon.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Its global products and platforms, including TurboTax, QuickBooks, Mint and Turbo, are designed to empower consumers, self-employed, and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Intuit’s innovative ecosystem of financial management solutions serves partners and 46 million customers worldwide, unleashing the power of many for the prosperity of one. For the latest news and in-depth information about Intuit and its brands, visit Intuit.com and follow on Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200101005092/en/\nMedia:\nAshley McMahon\nIntuit\nAshley_McMahon@intuit.com\n\nNanea Woods\nWieden+Kennedy\nNanea.Woods@wk.com\nSource: Intuit Inc."
    },
    {
        "title": "QuickBooks Launches Expanded Suite of Automated Payroll Services, Including Industry Leading Tax Penalty Protection Plan, On-demand HR Experts, and Employee Benefits",
        "subtitle": "",
        "date": "Dec 12, 2019 8:30AM EST",
        "content": "\nBuilt for Growing Businesses, New QuickBooks Online Payroll Elite Transforms How Small Businesses Run Payroll and Manage Their Employees\n    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU) today announced an expanded suite of QuickBooks Online Payroll offerings that enable small businesses to run payroll and file taxes automatically, all while receiving tax penalty protection and gaining access to essential services like on-demand HR, health benefits, and workers’ compensation.\n\nThe new and expanded suite includes three options for small businesses: Core, Premium and Elite, all of which allow small business owners to run payroll and file taxes automatically. Research shows that 41% of small business owners report it typically takes a week or more to prepare payroll. QuickBooks Online Payroll helps small businesses pay their employees in a short amount of time, allowing them to focus on more pressing business needs.\n\nAdditionally, with superior time tracking powered by TSheets, which is built into QuickBooks Online Payroll Premium and Elite and included at no extra cost, workers’ hours will automatically appear for small businesses to view and approve, enabling faster payroll runs with better accuracy.\n\nWithin the Core, Premium and Elite offerings, QuickBooks Online Payroll benefits include:\n\n“The expanded QuickBooks Online Payroll suite focuses on three benefits for our customers - automation, accuracy and additional services,” said Laurent Sellier, Vice President and Business Leader of QuickBooks Online Payroll. “By automating payroll and tax filing, and by offering access to additional on-demand services, the expanded QuickBooks Online Payroll suite helps meet the end-to-end needs of small businesses. And of course, it works automatically with QuickBooks Online, so small business owners can pay, manage, and grow their teams all while managing their books.”\n\nAutomation: Helping Small Businesses Run Payroll and File Taxes with Ease\n\nSmall business owners spend on average 4.5 hours each pay period preparing, calculating, and filing payroll taxes1. By automating paying employees and taxes, as well as tracking time on the go with TSheets, the new QuickBooks Online Payroll suite saves small business owners valuable time each payroll cycle by eliminating manual data entry and reducing errors.\n\nAccuracy: Giving Small Businesses Confidence that Employees are Paid and Taxes are Filed Correctly\n\nWith the expanded QuickBooks Online Payroll suite, small businesses can automate filing and paying payroll taxes with accuracy. QuickBooks stands behind all the calculations of customers paychecks, tax payments and forms and helps ensure they are accurate and on time. New to the suite, QuickBooks Online Payroll Elite now offers Tax Penalty Protection, which uses an Onboarding Expert Review to proactively spot problems. This guarantees that if a customer receives a federal, state, or local payroll tax penalty from an error made while using QuickBooks Online Payroll Elite, QuickBooks will help resolve it with the government and pay all fees and interest up to $25,000 per year.2\n\nAdditional Services: Enabling Small Businesses to Manage and Grow Their Teams with Simplicity\n\nSeventy percent of business owners report they have HR questions they don’t know how to handle. QuickBooks Online Payroll is giving small business owners access to an on-demand HR advisory team and HR support center packed with useful insights. QuickBooks also recognizes the importance small business owners place on taking care of their growing teams, which is why QuickBooks Online Payroll now brings together additional services to help small businesses grow, including workers compensation powered by AP Intego and recently added health benefits.\n\nFor more information about the new QuickBooks Online Payroll suite, please visit https://quickbooks.intuit.com/payroll/.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax®, QuickBooks®, Mint® and Turbo®, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nIntuit, QuickBooks, QuickBooks Connect, QuickBooks ProAdvisor, TurboTax, and Mint are trademarks of Intuit Inc. Other parties’ marks are property of their respective owners.\n\nThis information is intended to outline our general product direction, but represents no obligation and should not be relied on in making a purchase decision.\n\n1QuickBooks Online Payroll commissioned Kelton Global to survey 1,006 small business owners, aged 18+, throughout the U.S. in November 2019.\n\n2Tax Penalty Protection: If you receive a tax notice and send it to us within 15-days of the tax notice we will cover the payroll tax penalty, up to $25,000. Additional conditions and restrictions apply. See more information about the guarantee here: https://payroll.intuit.com/disclosure/\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191212005231/en/\nDanielle Ernst\nIntuit Inc.\n650-944-2391\nDanielle_Ernst@intuit.com\n\nCarolyn Linck\nAccess Brand Communications\n702-845-6466\ncarolynl@accesstheagency.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit Announces New Updates to ProConnect Tax Online for Tax Year 2019",
        "subtitle": "",
        "date": "Dec 11, 2019 6:08PM EST",
        "content": "\nNew innovations to Intuit’s online professional tax software help firms of all sizes prepare for the upcoming tax season\n    PLANO, Texas--(BUSINESS WIRE)--\nToday, Intuit Inc. (Nasdaq: INTU) announced a wide variety of new features, updates and enhancements to its cloud-based professional tax preparation software Intuit® ProConnect™ Tax Online for Tax Year 2019. The software enhancements include behind-the-scenes upgrades, new forms and e-file capabilities.\n\nLast year, tax reform was top of mind for tax professionals who were focused on helping clients navigate tax reform for the first time. Since then, Intuit has been making key improvements to ProConnect Tax Online to ensure continued, strong support for updated tax legislation and increased efficiency, productivity and peace of mind for tax professionals at both small and large firms.\n\nProConnect Tax Online Tax Year 2019 Updates\n\nNew features and enhancements available in Intuit ProConnectTax Online for Tax Year 2019 include:\n\nOver 134 new forms and 43 new e-file capabilities for returns, extensions, estimates and amended returns will be added to Intuit ProConnect Tax Online. Tax professionals can now also access enhanced help features inside their software — without leaving the workflow — including help articles, FAQs, peer community answers and tips. In addition, they can join the discussion in Intuit’s Accountants Community to post questions and get answers from experts and other tax professionals.\n\nTax professionals can read more about these additional enhancements and visit our training pages, where they will find training modules with content, videos and webinars about these features and more. For more information on features and updates, visit ProConnect.Intuit.com/Tax-Online.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax, QuickBooks, Mint and Turbo, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005975/en/\nStephanie Friswell\nIntuit Inc.\n214-387-2958\nstephanie_friswell@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit ProConnect Group Announces New Updates to ProSeries® and Lacerte® for Tax Year 2019",
        "subtitle": "",
        "date": "Dec 11, 2019 6:04PM EST",
        "content": "\nNew tax software helps tax professionals prepare for the upcoming tax season with Intuit\n    PLANO, Texas--(BUSINESS WIRE)--\nToday, Intuit Inc. (Nasdaq: INTU) is announcing the availability of ProSeries and Lacerte updates for Tax Year 2019. Intuit has made key improvements designed to make ProSeries (Basic and Professional) and Lacerte better for tax professionals, including upgrades to security, overall performance, steps toward reaching 100% e-file coverage and continued strong support for tax reform.\n\nSecurity and Personalization \n\nIntuit knows security is always top of mind for its customers, which is why new security features will help ensure strong data protection for tax pros and their clients, including meeting or exceeding IRS security guidelines and updated access rights.\n\nBoth ProSeries and Lacerte will also have updates to help tax pros further personalize their accounts. With updated integrations available in Quick Employer Forms, Document Management, and Tax Scan, pros can save time with these added features, all in one place. Plus with smart search and enhanced alerts, tax professionals can find answers and get notified earlier to be more proactive and in control for their clients.\n\nUpdates to ProSeries Tax Year 2019\n\nFor ProSeries, new features and productivity enhancements, include:\n\nIn addition to 121 new forms and 69 new e-file capabilities, there is a new automatic data flow from 1040NR to NY and CA state returns, multiple new client letters to choose from, including a standard engagement letter, amendment letter, client letter in Spanish and privacy statement for 1040 clients and new pay-by-refund enhancements, including a new signature pad integration and streamlined enrollment experience. ProSeries Professional and ProSeries Basic are now available for download.\n\nUpdates to Lacerte Tax Year 2019\n\nThere are several new features and productivity enhancements for Lacerte, including:\n\nIn addition to 134 new forms and 43 new e-file capabilities within Lacerte, there are also new bank options for Pay-by-Refund, client list column sorting, and password protection for PDF files. Lacerte is now available for download.\n\nThe new Intuit Hosting for Lacerte and ProSeries will be available for tax professionals to access their software, data and tools on virtually any device with cloud hosting backed by Intuit and Right Networks, along with new eSignature experiences for both Lacerte and ProSeries. Tax Professionals should visit the Tax Reform Resource Center for the latest tax reform news, tools and in-depth tax reform webinars, as they continue to prepare for the upcoming season.\n\nIntuit is also expanding the team of in-season support and adding new community forums and help center improvements so tax professionals have the help they need, especially during tax season. For more information on ProSeries, visit https://proconnect.intuit.com/proseries/ and for more information on Lacerte, visit https://proconnect.intuit.com/lacerte/.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax, QuickBooks, Mint and Turbo, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005973/en/\nStephanie Friswell\nIntuit Inc.\n214-387-2958\nstephanie_friswell@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "TurboTax Live Puts Virtual Team of Credentialed Tax Experts at Your Fingertips",
        "subtitle": "",
        "date": "Dec 5, 2019 8:00AM EST",
        "content": "\nLive, expert review from a CPA or EA, no matter your tax situation\n    SAN DIEGO--(BUSINESS WIRE)--\nToday, TurboTax, from Intuit Inc. (Nasdaq: INTU) – the leader in online tax preparation, processing over 37 million tax returns last year alone in the U.S. – announced the launch of its TurboTax Live products for tax year 2019. TurboTax Live combines the ease, convenience and technology that taxpayers love about TurboTax with on-demand access to the expertise of an elite team of credentialed tax experts – ALL Certified Public Accountants (CPAs), IRS-licensed Enrolled Agents (EAs) or Tax Attorneys.\n\nTaxpayers can easily click and connect with real tax experts live on screen, either on-demand or by appointment, for unlimited tax advice, answers and even a line-by-line review of their tax return before they file, so they can be 100% confident their taxes are done right. TurboTax Live tax experts are available year-round, as often as you need – in English or Spanish.\n\n“At TurboTax we are continuously innovating on ways to help our customers easily and accurately get their biggest refund. Each year there are millions of Americans that would like to do their taxes themselves but are worried they will make a mistake,” said Greg Johnson, executive vice president and GM of Intuit’s Consumer Group. “That’s why we launched TurboTax Live. TurboTax Live combines the ease and convenience of doing taxes online with the confidence that comes with a credentialed tax expert. Now taxpayers can file their taxes when, where and how they want.”\n\nOnly TurboTax Live gives taxpayers:\n\nTurboTax Live and TurboTax Online products are now available at www.TurboTax.com, the Apple App Store and Google Play Store.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax, QuickBooks, Mint and Turbo, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005259/en/\nMedia Contact:\nAshley McMahon\nIntuit Inc.\nAshley_Mcmahon@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit TurboTax Unveils Redesign of TurboTax Premier for Investors",
        "subtitle": "",
        "date": "Dec 5, 2019 8:00AM EST",
        "content": "\nTurboTax Premier 2019 Delivers Tailored Experience for the nearly 21 Million Investors\n    SAN DIEGO--(BUSINESS WIRE)--\nToday, TurboTax, from Intuit Inc. (Nasdaq: INTU) – the leader in online tax preparation, processing over 37 million tax returns last year alone in the U.S. – unveiled a redesign of its popular TurboTax Premier to deliver the best experience for the 21 million investors, including the traditional investor, robo-investor, cryptocurrency investor, and the new millennial investor.\n\nOver the past five years, the profile of the taxpayer with “investments” has changed. With the rise of investing apps, homestays, and cryptocurrency, investors are younger and playing a more prominent role in their personal investment choices. Today, there are nearly five million millennial investors who will be filing 1099Bs with an average age of 30, but, until now, they’ve faced imperfect tax solutions.\n\nWith this new millennial investor in mind, TurboTax Premier 2019 has been redesigned to deliver a breakthrough experience for investors. It covers nearly every investment situation, including stocks, bonds, ESPPs, cryptocurrency, rental property and more, and provides personalized guidance and advice for each.\n\n“As the investment landscape continues to evolve, we’re excited to launch a new and more robust version of TurboTax Premier that for the first time tackles the biggest pain points for the millions of taxpayers with investments,” said Greg Johnson, executive vice president and general manager of Intuit’s Consumer Group. “And with TurboTax Live Premier, customers get the added confidence that they can connect live via one-way video to a TurboTax Live CPA or Enrolled Agent with an average 15 years-experience to get their questions answered, have their tax return reviewed, signed, and filed, and they can also get answers to their questions year-round.”\n\nEliminates Work Through Data Import\n\nOne of the biggest pain points for investors is entering all of their reportable transactions into their tax return. In addition to W-2 import supporting over 150 million W-2s, TurboTax Premier automatically imports investment transactions from hundreds of financial institutions, eliminating time and improving accuracy. TurboTax Online now supports uploading more than 2,000 cryptocurrency transactions at one time, covering the vast majority of taxpayers with crypto. TurboTax also enables investors to import more transactions across all supported investment types than any other tax software provider.\n\nTurboTax Live Premier\n\nFor those who want the extra assurance of a credentialed tax expert, TurboTax Live Premier gives taxpayers on-demand access to an elite team of credentialed tax experts – ALL Certified Public Accountants (CPAs), IRS Enrolled Agents (EAs) or Tax Attorneys with an average of 15 years of experience. There is no need to leave the house – TurboTax Live connects customers live, to highly qualified CPAs and Enrolled Agents, in English or Spanish, via one-way video, as often as they want to ask questions, get personalized advice or even have their tax return reviewed, signed and filed. For those that don’t want to connect via one-way video, TurboTax Live Premier also gives taxpayers the ability to connect to their tax expert with chat and email. And TurboTax Live tax returns are backed by our 100% Accurate Expert Approved Guarantee.\n\nPricing and Availability\n\nTurboTax Online and TurboTax Live products are now available at https://www.TurboTax.com, the Apple App Store and Google Play Store.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax, QuickBooks, Mint and Turbo, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005256/en/\nAshley McMahon\nIntuit Inc.\nAshley_Mcmahon@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit Hosts First Small Business QuickBooks Council in Washington D.C.",
        "subtitle": "",
        "date": "Dec 3, 2019 9:00AM EST",
        "content": "\nFive Small Businesses Met with Lawmakers, Thought Leaders to Share Perspectives on What They Need from Government to Help them Prosper\n    WASHINGTON--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU), makers of TurboTax, QuickBooks and Mint, today announced it brought and hosted five small businesses from across the United States and a variety of industries at its inaugural Small Business QuickBooks Council in November in Washington, D.C.\n\nThe small business owners met on Capitol Hill to discuss the needs of U.S. small businesses with lawmakers and regulators, including the Small Business Administration, the U.S. Department of the Treasury, and the Senate Committee on Small Business and Entrepreneurship. The goal was to further educate the group about how government policies can foster even stronger small business growth. They shared perspectives and personal stories in four key policy areas:\n\n“Being a part of Intuit’s first Small Business QuickBooks Council was unlike any experience I have ever had,” said Joe Rice, QuickBooks Council Member and Executive Director of SOVRN, a leading advertising platform for small businesses. “I felt empowered to share my thoughts on how policy can help, not hinder, my success as well as the success of all small businesses. I look forward to further conversations and discussions with the Intuit team and policy leaders.”\n\nThe five small businesses that participated in the first QuickBooks Council are:\n\n“There are 800 million small businesses worldwide, 47 million of which are in the United States, and they create two out of three new jobs, yet they often don’t have a seat at the table with policy makers to share their perspectives and stories on how government can help ensure their long-term success and prosperity,” said Chris Leahy, Vice President, National Government Relations and Regulatory Affairs, Intuit. “As the champion of small businesses, we saw an opportunity to work more closely with these small business owners to ensure their voices are heard by lawmakers, regulators and administration officials who create policy.”\n\nRead more about the Small Business QuickBooks Council’s experience here.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nIntuit, QuickBooks, QuickBooks Connect, QuickBooks ProAdvisor, TurboTax, and Mint are trademarks of Intuit Inc. Other parties’ marks are property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191203005369/en/\nErik Rettig\nIntuit Inc.\n202-484-9011\nErik_Rettig@Intuit.com \n\nKim Amsbaugh\nIntuit Inc.\n650-944-3645\nKim_Amsbaugh@Intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "Intuit CEO Sasan Goodarzi to Present at Credit Suisse Conference",
        "subtitle": "",
        "date": "Dec 2, 2019 2:43PM EST",
        "content": "    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nSasan Goodarzi, chief executive officer of Intuit (Nasdaq: INTU), will present at the Credit Suisse Technology Conference in Scottsdale, AZ on Dec. 2.\n\nThe presentation will begin at 1:45 p.m. Pacific time and will be available live via audio webcast on Intuit’s investor relations website at http://investors.intuit.com/events/default.aspx. A replay of the webcast will be available approximately 24 hours after the presentation ends.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005891/en/\nInvestors\nLisa Patterson\nIntuit Inc.\n650-944-2713\nlisa_patterson@intuit.com\n\nMedia\nKali Fry\nIntuit Inc.\n650-944-3036\nkali_fry@intuit.com\n\n \nSource: Intuit Inc."
    },
    {
        "title": "Intuit Grows Total Revenue 15 Percent in First Quarter; Small Business Online Ecosystem Revenue Grows 35 Percent",
        "subtitle": "",
        "date": "Nov 21, 2019 4:00PM EST",
        "content": "\nReiterates Full Year Fiscal 2020 Guidance\n    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU), makers of TurboTax, QuickBooks and Mint, announced financial results for the first quarter of fiscal 2020, which ended Oct. 31.\n\n“This was a strong quarter across the company. We continue to make progress on our strategy of becoming an A.I.-driven expert platform,\" said Sasan Goodarzi, Intuit's CEO. \"Small Business Online Ecosystem revenue grew 35 percent, exceeding our target to grow 30 percent or more,\" said Goodarzi. \"As we look forward to the upcoming tax season, we're focused on applying the learnings from the last year, including extension season, to deliver even better experiences for our customers.\"\n\nFinancial Highlights\n\nFor the first quarter, Intuit grew:\n\nUnless otherwise noted, all growth rates refer to the current period versus the comparable prior-year period, and the business metrics and associated growth rates refer to worldwide business metrics.\n\nDollars are in millions, except earnings per share. See “About Non-GAAP Financial Measures” below for more information regarding financial measures not prepared in accordance with Generally Accepted Accounting Principles (GAAP). GAAP earnings per share for the first quarter of fiscal 2020 and first quarter fiscal 2019 include excess tax benefits on share-based compensation of $29 million and $41 million respectively.\n\nBusiness Segment Results\n\nSmall Business and Self-Employed Group\n\nConsumer and Strategic Partner Groups\n\nCapital Allocation Summary\n\nIn the first quarter the company:\n\nForward-looking Guidance\n\nIntuit announced guidance for the second quarter of fiscal year 2020, which ends Jan. 31. The company expects:\n\nIntuit reiterated guidance for full fiscal year 2020. The company expects:\n\nConference Call Details\n\nIntuit executives will discuss the financial results on a conference call at 1:30 p.m. Pacific time on Nov. 21. To hear the call, dial 844-246-4601 in the United States or 703-639-1172 from international locations. No reservation or access code is needed. The conference call can also be heard live at http://investors.intuit.com/Events/default.aspx. Prepared remarks for the call will be available on Intuit’s website after the call ends.\n\nReplay Information\n\nA replay of the conference call will be available for one week by calling 855-859-2056, or 404-537-3406 from international locations. The access code for this call is 1181886. The audio webcast will remain available on Intuit’s website for one week after the conference call.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nAbout Non-GAAP Financial Measures\n\nThis press release and the accompanying tables include non-GAAP financial measures. For a description of these non-GAAP financial measures, including the reasons management uses each measure, and reconciliations of these non-GAAP financial measures to the most directly comparable financial measures prepared in accordance with Generally Accepted Accounting Principles, please see the section of the accompanying tables titled \"About Non-GAAP Financial Measures\" as well as the related Table B1, Table B2, and Table E. A copy of the press release issued by Intuit today can be found on the investor relations page of Intuit's website.\n\nCautions About Forward-looking Statements\n\nThis press release contains forward-looking statements, including forecasts of expected growth and future financial results of Intuit and its reporting segments; Intuit’s prospects for the business in fiscal 2020 and beyond; expectations regarding timing and growth of revenue for each of Intuit’s reportable segments and from current or future products and services; expectations regarding customer growth; expectations regarding changes to our products and their impact on Intuit’s business; expectations regarding the amount and timing of any future dividends or share repurchases; expectations regarding availability of our offerings; expectations regarding Intuit’s corporate tax rate; expectations regarding the impact of our strategic decisions on Intuit’s business; and all of the statements under the heading “Forward-looking Guidance.”\n\nBecause these forward-looking statements involve risks and uncertainties, there are important factors that could cause our actual results to differ materially from the expectations expressed in the forward-looking statements. These factors include, without limitation, the following: our ability to compete successfully; our participation in the Free File Alliance; potential governmental encroachment in our tax businesses; our ability to adapt to technological change; our ability to predict consumer behavior; our reliance on third-party intellectual property; our ability to protect our intellectual property rights; any harm to our reputation; risks associated with acquisition and divestiture activity; the issuance of equity or incurrence of debt to fund an acquisition; our cybersecurity incidents (including those affecting the third parties we rely on); customer concerns about privacy and cybersecurity incidents; fraudulent activities by third parties using our offerings; our failure to process transactions effectively; interruption or failure of our information technology; our ability to maintain critical third-party business relationships; our ability to attract and retain talent; any deficiency in the quality or accuracy of our products (including the advice given by experts on our platform); any delays in product launches; difficulties in processing or filing customer tax submissions; risks associated with international operations; changes to public policy, laws or regulations affecting our businesses; litigation in which we are involved; the seasonal nature of our tax business; changes in tax rates and tax reform legislation; global economic changes; exposure to credit risk of the businesses we provide capital to; amortization of acquired intangible assets and impairment charges; our ability to repay outstanding debt; our ability to repurchase shares or distribute dividends; volatility of our stock price; and our ability to successfully market our offerings. More details about these and other risks that may impact our business are included in our Form 10-K for fiscal 2019 and in our other SEC filings. You can locate these reports through our website at http://investors.intuit.com. Fiscal 2020 and second quarter fiscal 2020 guidance speaks only as of the date it was publicly issued by Intuit. Other forward-looking statements represent the judgment of the management of Intuit as of the date of this presentation. We do not undertake any duty to update any forward-looking statement or other information in this presentation.\n\nINTUIT INC.\nABOUT NON-GAAP FINANCIAL MEASURES\n\nThe accompanying press release dated November 21, 2019 contains non-GAAP financial measures. Table B1, Table B2 and Table E reconcile the non-GAAP financial measures in that press release to the most directly comparable financial measures prepared in accordance with Generally Accepted Accounting Principles (GAAP). These non-GAAP financial measures include non-GAAP operating income (loss), non-GAAP net income (loss) and non-GAAP net income (loss) per share.\n\nNon-GAAP financial measures should not be considered as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP. These non-GAAP financial measures do not reflect a comprehensive system of accounting, differ from GAAP measures with the same names, and may differ from non-GAAP financial measures with the same or similar names that are used by other companies.\n\nWe compute non-GAAP financial measures using the same consistent method from quarter to quarter and year to year. We may consider whether other significant items that arise in the future should be excluded from our non-GAAP financial measures.\n\nWe exclude the following items from all of our non-GAAP financial measures:\n\nWe also exclude the following items from non-GAAP net income (loss) and diluted net income (loss) per share:\n\nWe believe these non-GAAP financial measures provide meaningful supplemental information regarding Intuit’s operating results primarily because they exclude amounts that we do not consider part of ongoing operating results when planning and forecasting and when assessing the performance of the organization, our individual operating segments, or our senior management. Segment managers are not held accountable for share-based compensation expense, amortization, or the other excluded items and, accordingly, we exclude these amounts from our measures of segment performance. We believe our non-GAAP financial measures also facilitate the comparison by management and investors of results for current periods and guidance for future periods with results for past periods.\n\nThe following are descriptions of the items we exclude from our non-GAAP financial measures.\n\nShare-based compensation expenses. These consist of non-cash expenses for stock options, restricted stock units, and our Employee Stock Purchase Plan. When considering the impact of equity awards, we place greater emphasis on overall shareholder dilution rather than the accounting charges associated with those awards.\n\nAmortization of acquired technology and amortization of other acquired intangible assets. When we acquire an entity, we are required by GAAP to record the fair values of the intangible assets of the entity and amortize them over their useful lives. Amortization of acquired technology in cost of revenue includes amortization of software and other technology assets of acquired entities. Amortization of other acquired intangible assets in operating expenses includes amortization of assets such as customer lists, covenants not to compete, and trade names.\n\nGoodwill and intangible asset impairment charges. We exclude from our non-GAAP financial measures non-cash charges to adjust the carrying values of goodwill and other acquired intangible assets to their estimated fair values.\n\nGains and losses on disposals of businesses and long-lived assets. We exclude from our non-GAAP financial measures gains and losses on disposals of businesses and long-lived assets because they are unrelated to our ongoing business operating results.\n\nProfessional fees for business combinations. We exclude from our non-GAAP financial measures the professional fees we incur to complete business combinations. These include investment banking, legal, and accounting fees.\n\nGains and losses on debt and equity securities and other investments. We exclude from our non-GAAP financial measures gains and losses that we record when we impair available-for-sale debt and equity securities and other investments.\n\nIncome tax effects and adjustments. We use a long-term non-GAAP tax rate for evaluating operating results and for planning, forecasting, and analyzing future periods. This long-term non-GAAP tax rate excludes the income tax effects of the non-GAAP pre-tax adjustments described above, and eliminates the effects of non-recurring and period specific items which can vary in size and frequency. Based on our current long-term projections, we are using a long-term non-GAAP tax rate of 23% for fiscal 2019 and fiscal 2020. This long-term non-GAAP tax rate could be subject to change for various reasons including significant changes in our geographic earnings mix or fundamental tax law changes in major jurisdictions in which we operate. We will evaluate this long-term non-GAAP tax rate on an annual basis and whenever any significant events occur which may materially affect this rate.\n\nOperating results and gains and losses on the sale of discontinued operations. From time to time, we sell or otherwise dispose of selected operations as we adjust our portfolio of businesses to meet our strategic goals. In accordance with GAAP, we segregate the operating results of discontinued operations as well as gains and losses on the sale of these discontinued operations from continuing operations on our GAAP statements of operations but continue to include them in GAAP net income or loss and net income or loss per share. We exclude these amounts from our non-GAAP financial measures.\n\nThe reconciliations of the forward-looking non-GAAP financial measures to the most directly comparable GAAP financial measures in Table E include all information reasonably available to Intuit at the date of this press release. These tables include adjustments that we can reasonably predict. Events that could cause the reconciliation to change include acquisitions and divestitures of businesses, goodwill and other asset impairments, sales of available-for-sale debt securities and other investments, and disposals of businesses and long-lived assets.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191121005931/en/\nInvestors\nKim Watkins\nIntuit Inc.\n650-944-3324\nkim_watkins@intuit.com\n\nMedia\nKali Fry\nIntuit Inc.\n650-944-3036\nkali_fry@intuit.com\nSource: Intuit Inc."
    },
    {
        "title": "QuickBooks Online Advanced Continues Innovating for High-Growth Mid-Market Businesses with AI-Enabled Capabilities",
        "subtitle": "",
        "date": "Nov 20, 2019 4:00PM EST",
        "content": "\nNew Capabilities Designed to Help Mid-Market Businesses Grow and Scale Demonstrated at Dreamforce 2019\n    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq:INTU) today announced five new capabilities to QuickBooks Online Advanced, Intuit’s cloud-based offering specifically designed for high-growth, mid-market small businesses that leverages AI, automation and data insights to deliver more ways for them to grow and scale. Intuit unveiled the new QuickBooks Online Advanced capabilities at Dreamforce 2019 this month in San Francisco.\n\n“Intuit introduced QuickBooks Online Advanced last year to disrupt and transform the small business mid-market by providing innovative tools that solve the problems faced by businesses as they grow and go up-market,” said Kelly Vincent, Vice President, Mid-Market, Intuit QuickBooks. “The momentum we have seen since launching QuickBooks Online Advanced proves the unmet market need that QuickBooks Online Advanced solves: providing mid-market businesses with a comprehensive, affordable, online solution that includes robust reporting, faster invoicing and dedicated support. We are excited to unveil five new capabilities within the product that are delivering additional reporting and workflow management, customization properties and new integrations with leading tech partners.”\n\nFive New Capabilities Available Today in QuickBooks Online Advanced\n\nIntuit is committed to delivering an online accounting solution that helps mid-market small businesses be more productive, collaborate and grow as they scale rapidly. QuickBooks Online Advanced supports these types of businesses with several capabilities already in place, including all the capabilities within QuickBooks Online Plus as well as smart reporting powered by Fathom, accelerated invoicing, custom user permissions and membership in Priority Circle, a premier priority care and training program. The new capabilities launched today further meet the unique needs of these high-growth businesses by delivering even deeper insights through added reporting and business management tools as well as identifying potential cash flow issues through the display of sales patterns and seasonality trends. The five new capabilities introduced to QuickBooks Online Advanced are:\n\nIn addition, Intuit recently announced the acquisition of ChronoBooks, a cloud-based solution that accountants and businesses rely on to view and restore historical QuickBooks Online activity. In the near future, each QuickBooks Online Advanced subscription will include ChronoBooks at no additional charge.\n\nTo see a demo of QuickBooks Online Advanced and learn more about the new capabilities and how QuickBooks is delivering innovation for mid-market small businesses, visit us at the SMB Lodge at Dreamforce located in the Marriott Marquis.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax®, QuickBooks®, Mint® and Turbo®, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nIntuit, QuickBooks, QuickBooks Connect, QuickBooks ProAdvisor, TurboTax, and Mint are trademarks of Intuit Inc. Other parties’ marks are property of their respective owners.\n\nThis information is intended to outline our general product direction, but represents no obligation and should not be relied on in making a purchase decision.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005677/en/\nKim Amsbaugh\nIntuit Inc.\n650-944-6649\nkim_amsbaugh@intuit.com\n\nKaylin Deutscher\nAccess Brand Communications\n415-844-6234\nkaylind@accesstheagency.com\nSource: Intuit Inc."
    },
    {
        "title": "QuickBooks Offers Live Bookkeeping On-Demand",
        "subtitle": "",
        "date": "Nov 7, 2019 9:05PM EST",
        "content": "\nFlexible New Offering Transforms How Small Businesses Can Access and Leverage Bookkeeping Experts to Drive Business Success\n    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU) today introduced QuickBooks Live Bookkeeping, a new offering that turns QuickBooks into a trusted collaboration platform, connecting self-employed people and small business owners with on-demand live experts through the QuickBooks product. Offered via a monthly subscription, QuickBooks Live connects small businesses to an experienced bookkeeper to help ensure their records are accurate and up-to-date, giving them the confidence that their books are done right and the freedom to focus on the important work of delighting their customers.\n\nQuickBooks Live solves the two biggest challenges small business owners without accountants face: the lack of confidence that they’re managing their books correctly and finding an expert to help them manage their books on an ongoing basis. Today, 40 percent of small businesses using QuickBooks are not connected to an accountant. Yet, small businesses connected to an accountant say they are twice as likely to succeed. For bookkeepers, many struggle to find new clients and retain them, with most only adding an average of four new clients per year.\n\nCombining the technology and simplicity of QuickBooks with a virtual, on-demand network of screened bookkeeping professionals, QuickBooks Live delivers both confidence and expertise to small businesses when they need it most, giving them the freedom to focus on other aspects of their businesses.\n\nSmall business owners who don’t know exactly what kind of accounting help they need can get basic bookkeeping services from experts inside the product, including categorizing expenses, reconciling accounts and transactions. Through QuickBooks Live, small businesses are provided with a dedicated, virtual bookkeeping team to oversee their needs, including a primary bookkeeper, who serves as the main point of contact. This lead expert will understand an individual’s unique needs, walk the business owner through a custom setup of QuickBooks and close the business’s books each month, while providing an accuracy guarantee1 for the work they perform. Additionally, business owners can get on-demand assistance from their dedicated bookkeeping team when questions come up, including chat with screen share and one-way video options. QuickBooks Live also provides a full year-end report for small businesses using the service to assist with tax preparation.\n\n“QuickBooks Live is truly the first of its kind - an expert-driven, AI platform that enables small businesses to make smarter decisions and achieve better money outcomes so they can take their businesses to the next level,” said Alex Chriss, Executive Vice President and General Manager of Small Business Self-Employed Group at Intuit. “By introducing QuickBooks Live, we believe more businesses will be able to tap not only into the technology platform that is delivering smarter business outcomes, but accounting and bookkeeping experts they may not have access to today.”\n\nQuickBooks Live was designed specifically for small businesses who are not currently connected with an accountant or bookkeeper and feel they only require a light level of ongoing assistance. The easy connection to expert bookkeeping advisors is significant, as a recent study conducted by QuickBooks and Wakefield Research2 found that nearly three in four (72 percent) small businesses first sought advice from family and friends before going to an expert or professional. Furthermore, the study found that more than a quarter (29 percent) cited difficulty in finding experts as a barrier for receiving business advice. By driving increased access to the experts small businesses need to manage and grow, QuickBooks is enabling its mission of powering prosperity for millions of small businesses around the world.\n\nFor accountants and bookkeepers, QuickBooks Live provides the opportunity to earn extra money with the flexibility of working remotely and setting their own hours. To participate as a QuickBooks Live bookkeeper, professionals must be QuickBooks Online certified and meet several other qualifications, including active credentials and work history with small business clients.\n\n“QuickBooks Live has been amazing for me, providing extreme value to my business. My dedicated, virtual bookkeeper, Jenni, has been so great. She can literally point and light up the buttons I need to push while she’s explaining things to me in real-time,” said Jon Shelton, business owner of Shelton Builders in Warrenton, Oregon. “When I first started using QuickBooks, it felt like a jumbo jet. I knew it would help my business tremendously, but it was a bit intimidating. Now, after getting set up correctly with Jenni’s help, I feel confident about what I’m doing, plus I know she’s always there if I have a question down the road.”\n\nFor more information about QuickBooks Live Bookkeeping, please visit https://quickbooks.intuit.com/live/.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax®, QuickBooks®, Mint® and Turbo®, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nIntuit, QuickBooks, QuickBooks Connect, QuickBooks ProAdvisor, TurboTax, and Mint are trademarks of Intuit Inc. Other parties’ marks are property of their respective owners.\n\nThis information is intended to outline our general product direction, but represents no obligation and should not be relied on in making a purchase decision.\n\n1 100% Accurate Books Guarantee: If your QuickBooks Live Bookkeeper makes an error that requires you to re-open your books for any month, we will correct the errors in your books for the month that the error occurred at no additional charge.\n\n2 The Intuit QuickBooks State of Small Business Growth and Success Report was conducted by Wakefield Research (www.wakefieldresearch.com) among 1,000 U.S. small business owners at companies of 0-100 employees, between Sept. 18 and Oct. 2, 2019, using an email invitation and an online survey.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191107006181/en/\nKim Amsbaugh\nIntuit Inc.\n650-944-6649\nkim_amsbaugh@intuit.com\n\nJen Garcia\nAccess Brand Communications\n415-828-2514\njeng@accesstheagency.com\nSource: Intuit Inc."
    },
    {
        "title": "QuickBooks Brings AI-Driven Innovations to Small Businesses",
        "subtitle": "",
        "date": "Nov 7, 2019 9:00PM EST",
        "content": "\nAdvancements in AI Can Level the Playing Field for Small Business, Helping to Improve Overall Survival Rates Worldwide\n    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU) today announced new product innovations designed to leverage the latest in artificial intelligence (AI), bringing technology typically reserved for the world’s biggest companies directly to small businesses. Being part of QuickBooks now means being part of the growth of one of the most advanced AI-driven, expert small business financial platforms in the world, giving small businesses the advantage they need to succeed.\n\nAnnounced at Intuit’s sixth annual QuickBooks Connect conference, more than five thousand attendees were the first to see the advanced capabilities of QuickBooks’ AI-driven expert platform. New innovations help simplify and automate work, while eliminating drudgery and tedious tasks by identifying patterns in the billions of transactions that flow through the QuickBooks platform. QuickBooks takes the guesswork out of being a small business owner or self-employed by being the single source of truth for their business. QuickBooks Online now uses AI to automate certain repetitive back-office work, reduce friction in getting paid, and improve forecasts of cash flow. This makes small businesses smarter, more successful and free to focus on the important work of delighting customers.\n\n“The reality of running a small business is hard, and often owners are left to figure out how to leverage and take advantage of AI by themselves. QuickBooks is changing this by leveling the playing field, giving small businesses access to data and insights they’ve never had before,” said Alex Chriss, Executive Vice President and General Manager of Small Business Self-Employed Group at Intuit. “By turning data into meaningful and useful insights, QuickBooks will be able to help small businesses make more data-driven decisions, spotting mistakes that would otherwise cost time and money.”\n\nQuickBooks has delivered innovations in all areas of running a small business. At last year’s QuickBooks Connect, QuickBooks showcased its first look at smarter ways to add payment capabilities to invoices. As a result of those innovations, QuickBooks customers on average get paid within five days of sending an invoice, three times faster than those who don’t use QuickBooks payments. In regards to payroll, employers using the QuickBooks flagship online payroll products can now hold onto their money until payday, instead of tying up funds several days in advance. This allows business owners to hold onto $22 billion in funds for days longer each year. Finally, with QuickBooks Capital, $1.7 billion in funding has been distributed to small businesses, including $1.3 billion in marketplace funds and $441 million in direct lending.\n\nThis year, QuickBooks builds on this momentum with three key areas to accelerate the benefits for our customers: Smart Money, Smart Decisions, and Smart Connections. \n\nSmart Money\n\nMoney is like oxygen to small business owners. They can’t survive without it. In fact, in 82 percent of small business failures, cash flow problems are a contributing factor. QuickBooks is unveiling new innovations to help small businesses get paid faster, get access to the capital they need and better understand their cash flow, allowing them to stay ahead of challenges.\n\nSmart Decisions\n\nToo often, small businesses and the self-employed are making decisions about their business without the right information or expertise. QuickBooks has seen millions of similar decisions across its ecosystem and through the power of AI, QuickBooks provides insights to help businesses be smarter.\n\nSmart Connections\n\nAs the world’s leading small business ecosystem, QuickBooks now intelligently matches small businesses to experts to help them grow and prosper with the launch of QuickBooks Live Bookkeeping.\n\nFor more information visit smarter.quickbooks.com.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. Our global products and platforms, including TurboTax®, QuickBooks®, Mint® and Turbo®, are designed to empower consumers, self-employed and small businesses to improve their financial lives, finding them more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves 50 million customers worldwide, unleashing the power of many for the prosperity of one. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\n\nIntuit, QuickBooks, QuickBooks Connect, QuickBooks ProAdvisor, TurboTax, and Mint are trademarks of Intuit Inc. Other parties’ marks are property of their respective owners.\n\nThis information is intended to outline our general product direction, but represents no obligation and should not be relied on in making a purchase decision.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191107006151/en/\nKim Amsbaugh\nIntuit Inc.\n650-944-6649\nkim_amsbaugh@intuit.com\n\nJen Garcia\nAccess Brand Communications\n415-828-2514\njeng@accesstheagency.com\nSource: Intuit Inc."
    },
    {
        "title": "INTUIT INVESTIGATION UPDATE BY FORMER LOUISIANA ATTORNEY GENERAL:  Kahn Swick & Foti, LLC Continues to Investigate the Officers and Directors of Intuit Inc. - INTU",
        "subtitle": "",
        "date": "Nov 1, 2019 10:50PM EDT",
        "content": "NEW ORLEANS, Nov. 1, 2019 /PRNewswire/ -- Former Attorney General of Louisiana, Charles C. Foti, Jr., Esq., a partner at the law firm of Kahn Swick & Foti, LLC (\"KSF\"), announces that KSF continues its investigation into Intuit Inc. (NasdaqGS: INTU).  For many years, the Company operated under an agreement with the Internal Revenue Service to provide a free version of its commercial tax filing products called TurboTax \"Freedom Edition\" to low-income taxpayers in exchange for the IRS agreeing not to compete by offering its own free online tax filing service.  The Company has been sued in a consumer class action lawsuit alleging that it defrauded customers through a scheme to deliberately hide or limit access to its free service, while aggressively marketing another program as free even though it had limited functionality and deceived users otherwise eligible for free filing into paying for product upgrades to file their taxes. The Company has also been sued on similar allegations by the City of Los Angeles and Santa Clara County on behalf of the State of California for violations of the state's Unfair Competition Law. Recently, the court presiding over the Los Angeles case denied the Company's request to have to case dismissed, allowing it to proceed forward.KSF's investigation is focusing on whether Intuit's officers and/or directors breached their fiduciary duties to Intuit's shareholders or otherwise violated state or federal laws.  If you have information that would assist KSF in its investigation, or have been a long-term holder of Intuit shares and would like to discuss your legal rights, you may, without obligation or cost to you, call toll-free at 1-877-515-1850 or email KSF Managing Partner Lewis Kahn (lewis.kahn@ksfcounsel.com), or visit https://www.ksfcounsel.com/cases/nasdaqgs-intu/ to learn more.About Kahn Swick & Foti, LLCKSF, whose partners include the Former Louisiana Attorney General Charles C. Foti, Jr., is a law firm focused on securities, antitrust and consumer class actions, along with merger & acquisition and breach of fiduciary litigation against publicly traded companies on behalf of shareholders. The firm has offices in New York, California and Louisiana.To learn more about KSF, you may visit www.ksfcounsel.com.Contact:Kahn Swick & Foti, LLCLewis Kahn, Managing Partnerlewis.kahn@ksfcounsel.com1-877-515-18501100 Poydras St., Suite 3200New Orleans, LA 70163 View original content to download multimedia:http://www.prnewswire.com/news-releases/intuit-investigation-update-by-former-louisiana-attorney-general--kahn-swick--foti-llc-continues-to-investigate-the-officers-and-directors-of-intuit-inc---intu-300950175.htmlSOURCE  Kahn Swick & Foti, LLC"
    },
    {
        "title": "Intuit to Announce First-quarter Fiscal 2020 Results on Nov. 21",
        "subtitle": "",
        "date": "Oct 31, 2019 4:00PM EDT",
        "content": "    MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--\nIntuit Inc. (Nasdaq: INTU), makers of QuickBooks, TurboTax and Mint, will announce its first-quarter results for fiscal year 2020 on Nov. 21 following the close of market. The company’s first quarter ends today, October 31. Intuit executives will discuss the financial results on a conference call at 1:30 p.m. Pacific time on Nov. 21. To listen to the call, dial 844-246-4601 in the United States or 703-639-1172 from international locations. No reservation or access code is needed. The conference call can also be heard live at http://investors.intuit.com/Events/default.aspx. Prepared remarks for the call will be available on Intuit’s website after the call ends.\n\nReplay Information\n\nA replay of the conference call will be available for one week by calling 855-859-2056, or 404-537-3406 from international locations. The access code for this call is 1181886. The audio webcast will remain available on Intuit’s website for one week after the conference call.\n\nAbout Intuit\n\nIntuit’s mission is to Power Prosperity Around the World. We are a global financial platform company with products including TurboTax, QuickBooks, Mint and Turbo, designed to empower consumers, self-employed and small businesses to improve their financial lives. Our platform and products help customers get more money with the least amount of work, while giving them complete confidence in their actions and decisions. Our innovative ecosystem of financial management solutions serves approximately 50 million customers worldwide. Please visit us for the latest news and in-depth information about Intuit and its brands and find us on social.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191031005710/en/\nInvestors\nLisa Patterson\nIntuit Inc.\n650-944-2713\nlisa_patterson@intuit.com\n\nMedia\nKali Fry\nIntuit Inc.\n650-944-3036\nkali_fry@intuit.com\nSource: Intuit Inc."
    }
]