[
    {
        "title": "Intuitive Acquires Orpheus Medical to Expand Informatics Platform for Hospitals",
        "subtitle": "",
        "date": "Feb 10, 2020 4:01PM EST",
        "content": "SUNNYVALE, Calif., Feb.  10, 2020  (GLOBE NEWSWIRE) -- Intuitive (Nasdaq: ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, announced it has acquired privately held Orpheus Medical to deepen and expand its integrated informatics platform.Orpheus Medical provides hospitals with information technology connectivity, as well as expertise in processing and archiving surgical video.“The addition of Orpheus will provide customers —including surgeons, patient care teams and hospitals—with ready access to and a deeper understanding of their data, which we believe may help our customers improve patient outcomes and lower total treatment costs,” said Julian Nikolchev, Intuitive’s senior vice president of corporate development and strategy.Orpheus develops and distributes its clinical video management and analytics platform, which hospitals use across surgical disciplines. The platform offers the ability to capture and share clinical video and imaging from many sources, which may help improve physician and OR care team workflow and enable analysis of their interventions.“Combining both companies’ innovative technologies with Intuitive’s global reach and resources will enable current and future customers easier and faster access to their data,” said Gaddi Menahem, CEO of Orpheus Medical.Orpheus will be a wholly owned subsidiary of Intuitive. Terms of the acquisition were not disclosed.About Intuitive Intuitive (Nasdaq: ISRG), headquartered in Sunnyvale, Calif., is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings, and develops, manufactures and markets the da Vinci® surgical system and the Ion™ endoluminal system.About the da Vinci Surgical System There are several models of the da Vinci surgical system. The da Vinci surgical systems are designed to help surgeons perform minimally invasive surgery. Da Vinci systems offer surgeons high-definition 3D vision, a magnified view, and robotic and computer assistance. They use specialized instrumentation, including a miniaturized surgical camera and wristed instruments (i.e., scissors, scalpels and forceps) that are designed to help with precise dissection and reconstruction deep inside the body.For more information, please visit the company’s website at www.intuitive.com.Forward-Looking StatementThis press release contains forward-looking statements, including statements regarding the company’s acquisition of Orpheus Medical. These forward-looking statements are necessarily estimates reflecting the best judgment of the company’s management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the risk that Orpheus Medical cannot successfully expand its customer base or grow revenue after closing, risks associated with integrating a newly acquired business outside of the United States, diversion of management and other resources in supporting the newly acquired business, and other risk factors under the heading “Risk Factors” in the Company’s report on Form 10-K for the year ended December 31, 2018, as updated by the Company’s other filings with the Securities and Exchange Commission.  Statements using words such as “estimates,” “projects,” “believes,” “anticipates,” “plans,” “expects,” “intends,” “may,” “will,” “could,” “should,” “would,” “targeted,” and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.Contact Global Public Affairs Intuitive Surgical corp.comm@intusurg.com +1-408-523-7337Source: Intuitive Surgical, Inc.PN# 1069571-RevA-US-February2020 "
    },
    {
        "title": "Intuitive Announces Retirement of Board Chair Lonnie M. Smith; Dr. Craig H. Barratt Succeeds Smith as New Chair",
        "subtitle": "",
        "date": "Feb 3, 2020 4:01PM EST",
        "content": "SUNNYVALE, Calif., Feb.  03, 2020  (GLOBE NEWSWIRE) -- Intuitive (Nasdaq: ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, announced today that Lonnie M. Smith has decided to retire from the company’s board of directors when his term ends at the company’s 2020 annual meeting of stockholders, currently scheduled for April. Mr. Smith will join the board of directors of the Intuitive Foundation after his retirement.Intuitive’s board of directors elected Dr. Craig H. Barratt to succeed Mr. Smith as chair effective as of the date of the company’s 2020 annual meeting of stockholders. Dr. Barratt is the senior vice president and general manager of the Connectivity Group at Intel Corporation. He has served on Intuitive’s board since 2011 and as independent lead director since 2018.“It has been an honor to serve as the chair of Intuitive’s board. During the past 23 years, I have had the privilege of working with an extraordinary team, who have taken the company from a start-up of approximately 12 people with an early prototype, to an organization of more than 7,100 team members who are transforming surgery, with more than 5,500 currently installed da Vinci surgical systems, more than 21,000 peer reviewed articles published and 1.2 million surgical procedures performed this past year,” said Smith. “I look forward to assisting the team in their future philanthropic efforts with the Intuitive Foundation.”Mr. Smith has served as chair of Intuitive’s board since joining the company as CEO in June 1997.“Lonnie’s contributions to Intuitive are extensive and his philosophy lives in the company’s mission and culture,” said Gary Guthart, Intuitive CEO. “On behalf of the company, I extend our thanks for his unwavering guidance of the team. I am delighted that Lonnie’s work with us will continue in the form of assisting our Foundation.”The Intuitive Foundation launched in 2018 to promote health, develop educational tools and advance clinical understanding globally through a combination of research grants, philanthropic giving, and volunteerism in local communities. The Foundation awards grants in technology research, clinical research, and clinical education and training. Additionally, the Foundation supports clinical fellowships, and projects related to STEM educational programs and healthcare training with a particular focus on underserved communities. “I am honored to serve as chair of Intuitive’s board, a company whose mission and culture I wholeheartedly support,” Barratt said. “Lonnie leaves a strong legacy of outstanding stewardship that I am committed to uphold.”About IntuitiveIntuitive (Nasdaq: ISRG), headquartered in Sunnyvale, California, is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings and develops, manufactures, and markets the da Vinci® surgical system and the IonTM endoluminal system.Da Vinci®, da Vinci X®, da Vinci Xi®, IonTM, and SynchroSealTM are trademarks or registered trademarks of Intuitive Surgical, Inc.For more information, please visit the Company's website at www.intuitive.com.Photos of the da Vinci surgical robot systems are available for press use from https://www.intuitive.com/en-us/about-us/press/press-resources.Surgical RisksFor important safety information, indications for use, risks, full cautions and warnings related to the use of da Vinci systems, please refer to www.intuitive.com/safety.Forward-Looking StatementThis press release contains forward-looking statements, including statements regarding the retirement of Mr.  Smith and the appointment of Dr. Barratt to succeed Mr. Smith as chair of Intuitive’s board.  These forward-looking statements are based on current expectations and estimates and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements.  These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the re-election of Dr. Barratt to our board of directors by our shareholders at the 2020 annual meeting of stockholders and other risk factors under the heading “Risk Factors” in the company’s annual report on Form 10-K for the year ended December 31, 2018, as updated by the company’s other filings with the Securities and Exchange Commission.  You should not place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.ContactGlobal Public Affairs Intuitive Surgical corp.comm@intusurg.com +1-408-523-7337 "
    },
    {
        "title": "Intuitive Announces Fourth Quarter Earnings",
        "subtitle": "",
        "date": "Jan 23, 2020 4:05PM EST",
        "content": "SUNNYVALE, Calif., Jan.  23, 2020  (GLOBE NEWSWIRE) -- Intuitive (the “Company”) (Nasdaq: ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced financial results for the quarter ended December 31, 2019. Reported revenue and procedure results are consistent with the Company’s press release on January 9, 2020.Q4 HighlightsQ4 Financial SummaryGross profit, income from operations, net income, net income per diluted share, and diluted shares are reported on a GAAP and non-GAAP* basis. The non-GAAP* measures are described below and are reconciled to the corresponding GAAP measures at the end of this release.Fourth quarter 2019 revenue was $1.28 billion, an increase of 22% compared with $1.05 billion in the fourth quarter of 2018. Higher fourth quarter revenue was driven by increased procedures and systems placements.Fourth quarter 2019 instruments and accessories revenue increased by 24% to $671 million, compared with $539 million in the fourth quarter of 2018, primarily driven by approximately 19% growth in da Vinci procedure volume.Fourth quarter 2019 systems revenue increased by 22% to $416 million, compared with $341 million in the fourth quarter of 2018. The Company shipped 336 da Vinci Surgical Systems in the fourth quarter of 2019, compared with 290 in the fourth quarter of 2018. The fourth quarter 2019 system shipments included 126 systems shipped under operating lease and usage-based arrangements, compared with 84 in the fourth quarter of 2018.Fourth quarter 2019 GAAP income from operations increased to $398 million, compared with $332 million in the fourth quarter of 2018. Fourth quarter 2019 GAAP income from operations included intangible asset charges of $16 million, compared with $9 million in the fourth quarter of 2018, and share-based compensation expense of $89 million, compared with $70 million in the fourth quarter of 2018. Fourth quarter 2019 non-GAAP* income from operations increased to $506 million, compared with $412 million in the fourth quarter of 2018.Fourth quarter 2019 GAAP net income was $358 million, or $2.99 per diluted share, compared with $293 million, or $2.45 per diluted share, in the fourth quarter of 2018. Fourth quarter 2019 GAAP net income included excess tax benefits of $34 million, or $0.28 per share, compared with $16 million, or $0.13 per share, in the first quarter of 2018.Fourth quarter 2019 non-GAAP* net income was $417 million, or $3.48 per diluted share, compared with $353 million, or $2.96 per diluted share, in the fourth quarter of 2018.The Company ended the fourth quarter of 2019 with $5.8 billion in cash, cash equivalents, and investments, an increase of $415 million during the quarter, primarily driven by cash generated from operations.Additional supplemental financial and procedure information has been posted to the Investor Relations section of the Intuitive website at https://isrg.gcs-web.com/.Webcast and Conference Call InformationIntuitive will hold a teleconference at 1:30 p.m. PST today to discuss the fourth quarter 2019 financial results. The call will be webcast by Nasdaq OMX and can be accessed on Intuitive’s website at www.intuitive.com or by dialing (844) 721-7241 or (409) 207-6955 using the access code 2014590.About IntuitiveIntuitive (Nasdaq: ISRG), headquartered in Sunnyvale, California, is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings and develops, manufactures, and markets the da Vinci® surgical system and the Ion™ endoluminal system.Da Vinci® and Ion™ are trademarks or registered trademarks of Intuitive Surgical, Inc.For more information, please visit the Company’s website at www.intuitive.com.Forward-Looking StatementsThis press release contains forward-looking statements. These forward-looking statements are necessarily estimates reflecting the best judgment of the Company's management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the timing and success of product development and market acceptance of developed products, including, but not limited to, Intuitive's Ion endoluminal system, da Vinci SP surgical system, and 3rd generation stapling platform; the impact of global and regional economic and credit market conditions on healthcare spending; competition in the medical device industry and in the specific markets of surgery in which the Company operates; risks associated with our operations outside of the United States; product liability and other litigation claims; adverse publicity regarding the Company and the safety of the Company’s products and adequacy of training; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the Company is or may become a party; the Company's reliance on sole and single source suppliers; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances, or partnerships, including the joint venture with Shanghai Fosun Pharmaceutical (Group) Co., Ltd.; the Company's completion of and ability to successfully integrate the acquisition of Schölly Fiberoptic's robotic endoscope business; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement, and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; procedure counts; regulatory approvals, clearances, and restrictions or any dispute that may occur with any regulatory body; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; the Company’s ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; changes in tariffs, trade barriers, and regulatory requirements; and other risk factors identified under the heading “Risk Factors” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2018, as updated by the Company’s other filings with the Securities and Exchange Commission. Statements using words such as “estimates,” “projects,” “believes,” “anticipates,” “plans,” “expects,” “intends,” “may,” “will,” “could,” “should,” “would,” “targeted,” and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.*About Non-GAAP Financial MeasuresTo supplement its consolidated financial statements, which are prepared and presented in accordance with accounting principles generally accepted in the United States (“GAAP”), the Company uses the following non-GAAP financial measures: non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, non-GAAP net income per diluted share (“EPS”), and non-GAAP diluted shares. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP.The Company uses these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. The Company believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding items such as intangible asset charges, share-based compensation (“SBC”) expenses, and other special items. Intangible asset charges consist of non-cash charges, such as the amortization of intangible assets, as well as in-process R&D charges. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning, forecasting, and analyzing future periods. These non-GAAP financial measures also facilitate management’s internal comparisons to its historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors, because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making, and (2) they are used by institutional investors and the analyst community to help them analyze the performance of the Company’s business.Non-GAAP gross profit. The Company defines non-GAAP gross profit as gross profit, excluding intangible asset charges, expenses related to SBC, and litigation charges and recoveries.Non-GAAP income from operations. The Company defines non-GAAP income from operations as income from operations, excluding intangible asset charges, certain acquisition-related items for the re-measurement of contingent consideration, expenses related to SBC, and litigation charges and recoveries.Non-GAAP net income and EPS. The Company defines non-GAAP net income as net income (loss), excluding intangible asset charges, non-cash impairment charges and recoveries, certain acquisition-related items for the re-measurement of contingent consideration, expenses related to SBC, litigation charges and recoveries, adjustments attributable to noncontrolling interest in joint venture, net of the related tax effects, and tax adjustments, including the excess tax benefits or deficiencies associated with SBC arrangements, the one-time impact of the enactments of the 2017 Tax Act and the 2019 Swiss tax reform, and the net tax effects related to intra-entity transfers of non-inventory assets. The Company excludes the one-time impact of the enactments of the 2017 Tax Act and the 2019 Swiss tax reform, because they are discrete in nature, and excludes the excess tax benefits or deficiencies associated with SBC arrangements as well as the tax effects associated with non-cash amortization of deferred tax assets related to intra-entity non-inventory transfers, because the Company does not believe these items correlate with the on-going results of its core operations. The tax effects of the non-GAAP items are determined by applying a calculated non-GAAP effective tax rate, which is commonly referred to as the with-and-without method. Without excluding these tax effects, investors would only see the gross effect that these non-GAAP adjustments had on the Company’s operating results. The Company’s calculated non-GAAP effective tax rate is generally higher than its GAAP effective tax rate. The Company defines non-GAAP EPS as non-GAAP net income divided by non-GAAP diluted shares, which are calculated as GAAP weighted average outstanding shares plus dilutive potential shares outstanding during the period.There are a number of limitations related to the use of non-GAAP measures versus measures calculated in accordance with GAAP. Non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, and non-GAAP EPS exclude items such as intangible asset charges, re-measurement of contingent consideration, SBC, excess tax benefits or deficiencies associated with SBC arrangements, and non-cash amortization of deferred tax assets related to intra-entity transfer of non-inventory assets, which are primarily recurring items. SBC has been, and will continue to be for the foreseeable future, a significant recurring expense in the Company’s business. In addition, the components of the costs that the Company excludes in its calculation of non-GAAP net income and non-GAAP EPS may differ from the components that its peer companies exclude when they report their results of operations. Management addresses these limitations by providing specific information regarding the GAAP amounts excluded from non-GAAP net income and non-GAAP EPS and evaluating non-GAAP net income and non-GAAP EPS together with net income (loss) and net income (loss) per share calculated in accordance with GAAP. INTUITIVE SURGICAL, INC. UNAUDITED QUARTERLY CONDENSED CONSOLIDATED STATEMENTS OF INCOME (IN MILLIONS, EXCEPT PER SHARE DATA) INTUITIVE SURGICAL, INC. UNAUDITED TWELVE MONTHS ENDED CONDENSED CONSOLIDATED STATEMENTS OF INCOME (IN MILLIONS, EXCEPT PER SHARE DATA) INTUITIVE SURGICAL, INC. UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS (IN MILLIONS) INTUITIVE SURGICAL, INC.UNAUDITED RECONCILIATION OF GAAP FINANCIAL MEASURES TO NON-GAAP FINANCIAL MEASURES(IN MILLIONS, EXCEPT PER SHARE DATA)Contact: Investor Relations (408) 523-2161"
    },
    {
        "title": "Intuitive Announces Preliminary Fourth Quarter and Full Year 2019 results",
        "subtitle": "",
        "date": "Jan 9, 2020 4:05PM EST",
        "content": "SUNNYVALE, Calif., Jan.  09, 2020  (GLOBE NEWSWIRE) -- Intuitive (the “Company”) (Nasdaq: ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced certain unaudited preliminary fourth quarter and full year 2019 financial results ahead of its participation at the 38th Annual JP Morgan Healthcare Conference on January 14-15, 2020, in San Francisco, California.Financial and Operational HighlightsPreliminary ResultsThe Company expects fourth quarter 2019 revenue of approximately $1.278 billion, an increase of 22% compared with $1.047 billion in the fourth quarter of 2018. The Company expects 2019 revenue of approximately $4.479 billion, an increase of 20% compared with $3.724 billion in 2018. The unaudited results in this press release are preliminary and subject to the completion of the Company’s annual independent audit and, therefore, are subject to adjustment.Preliminary fourth quarter 2019 instrument and accessory revenue increased 24% to approximately $671 million, compared with $539 million in the fourth quarter of 2018. Preliminary full year 2019 instrument and accessory revenue increased 23% to approximately $2.408 billion, compared with $1.962 billion for 2018. Fourth quarter and full year 2019 instrument and accessory revenue growth was primarily driven by growth in da Vinci procedure volume.Fourth quarter 2019 da Vinci procedures increased approximately 19% compared with the fourth quarter of 2018. In 2019, approximately 1,229,000 surgical procedures were performed with da Vinci Surgical Systems, an increase of approximately 18% compared with approximately 1,038,000 surgical procedures performed with da Vinci Surgical Systems in 2018. The growth in our overall procedure volume in 2019 was primarily driven by growth in U.S. general surgery procedures and worldwide urologic procedures. The Company expects worldwide da Vinci procedures to increase approximately 13% to 16% in 2020.Preliminary fourth quarter 2019 systems revenue increased 22% to approximately $416 million, compared with $341 million in the fourth quarter of 2018. Preliminary full year 2019 systems revenue increased 19% to approximately $1.346 billion, compared with $1.127 billion in 2018. The Company shipped 336 da Vinci Surgical Systems in the fourth quarter of 2019, compared with 290 systems in the fourth quarter of 2018. The fourth quarter 2019 system shipments included 126 shipped under operating lease and usage-based arrangements, compared with 84 in the fourth quarter of 2018. The Company shipped 1,119 da Vinci Surgical Systems in 2019, compared with 926 systems in 2018. The 2019 system shipments included 384 systems shipped under operating lease and usage-based arrangements, compared with 229 systems in 2018.Commenting on the announcement, Intuitive CEO Gary Guthart said, “We are pleased with our fourth quarter procedure growth, system placements, and the financial results that follow. As we enter 2020, we remain focused on innovation across our ecosystem of products and working collaboratively with our customers to support best in class robotics programs.”Additional unaudited preliminary revenue and procedure information has been posted to the Investor Relations section of the Intuitive website at: https://isrg.gcs-web.com/.The Company is scheduled to present at the 2020 JP Morgan Healthcare Conference on January 14, 2020, at 10:30 a.m. Pacific Time. The Company is scheduled to report its fourth quarter 2019 results during a conference call on January 23, 2020, at which point the Company will discuss the 2019 financial results in more detail. Dial-in and webcast access information for both of these events are also available in the Investor Relations section of the Intuitive website.About IntuitiveIntuitive (Nasdaq: ISRG), headquartered in Sunnyvale, California, is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings and develops, manufactures, and markets the da Vinci® surgical system and the IonTM endoluminal system.Da Vinci®, da Vinci X®, da Vinci Xi®, IonTM, and SynchroSealTM are trademarks or registered trademarks of Intuitive Surgical, Inc.For more information, please visit the Company's website at www.intuitive.com.Forward-Looking StatementsThe Company has not filed its Form 10-K for 2019. As a result, all financial results described in this press release should be considered preliminary and are subject to change to reflect any necessary corrections or adjustments, or changes in accounting estimates, that are identified prior to the time that the Company is in a position to complete these filings. Actual results could differ materially from these preliminary results.This press release contains forward-looking statements, including statements regarding the Company’s unaudited preliminary financial and operational results for the fourth quarter and full year 2019, expected procedure growth in 2020 and the Company’s focus on innovation across its ecosystem of products. These forward-looking statements are necessarily estimates reflecting the best judgment of the Company’s management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: completion of the Company’s final closing procedures, final adjustments, and other developments that may arise in the course of audit procedures; the impact of global and regional economic and credit market conditions on healthcare spending; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; the timing and success of product development and market acceptance of developed products, including, but not limited to, Intuitive's Ion endoluminal, da Vinci SP surgical system, and 3rd generation stapling platform; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances, or partnerships, including the joint venture with Shanghai Fosun Pharmaceutical (Group) Co., Ltd.; the Company's completion of and ability to successfully integrate the acquisition of Schölly Fiberoptic's robotic endoscope business; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; competition in the medical device industry and in the specific markets of surgery in which the Company operates; risks associated with our operations outside of the United States; unanticipated manufacturing disruptions or the inability to meet demand for products; the Company's reliance on sole and single source suppliers; the results of legal proceedings to which the Company is or may become a party; product liability and other litigation claims; adverse publicity regarding the Company and the safety of the Company’s products and adequacy of training; the Company’s ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; changes in tariffs, trade barriers, and regulatory requirements; and other risk factors under the heading “Risk Factors” in the Company’s report on Form 10-K for the year ended December 31, 2018, as updated by the Company’s other filings with the Securities and Exchange Commission. Statements using words such as “estimates,” “projects,” “believes,” “anticipates,” “plans,” “expects,” “intends,” “may,” “will,” “could,” “should,” “would,” “targeted,” and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.Contact:Investor Relations408-523-2161"
    },
    {
        "title": "U.S. FDA Clears SynchroSeal and E-100 Generator for da Vinci X/Xi Platforms",
        "subtitle": "",
        "date": "Nov 26, 2019 6:40PM EST",
        "content": "Intuitive’s new sealing instrument and its first generator add versatility1SUNNYVALE, Calif., Nov.  26, 2019  (GLOBE NEWSWIRE) -- Intuitive (Nasdaq: ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced U.S. Food and Drug Administration clearance of two innovative technologies for two of the company’s da Vinci® surgical systems to help improve procedures that require sealing.Intuitive’s E-100 generator is its first internally developed robotic generator to power two key instruments on the da Vinci X® and Xi™ systems. Vessel Sealer Extend is the flagship instrument in the da Vinci energy sealing portfolio today, and the new SynchroSeal instrument offers enhanced capabilities1 in general surgery.We are pleased to receive FDA clearance, providing surgeons an additional tool for the X and Xi da Vinci platforms,” said Bob DeSantis, Intuitive’s Senior Vice President and General Manager for Instruments and Accessories.  “We developed SynchroSeal and the E-100 generator to help surgeons quickly seal and transect tissue and vessels, facilitating efficient technique.”The E-100 is Intuitive’s first generator and is offered as an upgrade to power Vessel Sealer Extend and SynchroSeal. SynchroSeal will enable a surgeon to perform rapid1 one-step sealing and transection with a single pedal press.   SynchroSeal uses advanced bipolar energy from its raised cut electrode to transect tissue then cool down quickly2, and will allow surgeons to move on to the next step. With its wristed articulation, its rapid sealing cycle, and refined curved jaw, SynchroSeal offers enhanced versatility to the da Vinci Energy portfolio1.1Compared to Vessel Sealer Extend on Erbe VIO dV2Data on fileAbout IntuitiveIntuitive (Nasdaq: ISRG), headquartered in Sunnyvale, Calif., is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings, and develops, manufactures and markets the da Vinci® surgical system and the Ion™ endoluminal system.About the da Vinci Surgical SystemThere are several models of the da Vinci surgical system. The da Vinci surgical systems are designed to help surgeons perform minimally invasive surgery. Da Vinci systems offer surgeons high-definition 3D vision, a magnified view, and robotic and computer assistance. They use specialized instrumentation, including a miniaturized surgical camera and wristed instruments (i.e., scissors, scalpels and forceps) that are designed to help with precise dissection and reconstruction deep inside the body.For more information, please visit the company’s website at www.intuitive.com.Forward Looking StatementsThis press release contains forward-looking statements, including statements regarding the performance of the company’s products.  These forward-looking statements are based on current expectations and estimates and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to the risk factors under the heading “Risk Factors” in the company’s annual report on Form 10-K for the year ended December 31, 2018, as updated by the company’s other filings with the Securities and Exchange Commission.  Statements using words such as “estimates,” “projects,” “believes,” “anticipates,” “plans,” “expects,” “intends,” “may,” “will,” “could,” “should,” “would,” “targeted” and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.Contact Global Public Affairs Intuitive Surgical corp.comm@intusurg.com +1-408-523-7337 "
    },
    {
        "title": "Intuitive Announces Third Quarter Earnings",
        "subtitle": "",
        "date": "Oct 17, 2019 4:05PM EDT",
        "content": "SUNNYVALE, Calif., Oct.  17, 2019  (GLOBE NEWSWIRE) -- Intuitive (the “Company”) (Nasdaq: ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced financial results for the quarter ended September 30, 2019.Q3 HighlightsQ3 Financial SummaryGross profit, income from operations, net income, net income per diluted share, and diluted shares are reported on a GAAP and non-GAAP* basis. The non-GAAP* measures are described below and are reconciled to the corresponding GAAP measures at the end of this release.Third quarter 2019 revenue was $1,128 million, an increase of 23% compared with $921 million in the third quarter of 2018. Higher third quarter revenue was driven by increased procedures and systems placements.Third quarter 2019 instrument and accessory revenue increased by 25% to $606 million, compared with $486 million for the third quarter of 2018, primarily driven by nearly 20% growth in da Vinci procedure volume.Third quarter 2019 systems revenue increased by 23% to $339 million, compared with $275 million for the third quarter of 2018. The Company shipped 275 da Vinci Surgical Systems in the third quarter of 2019, compared with 231 in the third quarter of 2018. The third quarter 2019 system shipments included 92 systems shipped under operating lease and usage-based arrangements, compared with 58 during the third quarter of 2018.Third quarter 2019 GAAP income from operations increased to $366 million, compared with $313 million in the third quarter of 2018. Third quarter 2019 non-GAAP* income from operations increased to $462 million, compared with $391 million in the third quarter of 2018.Third quarter 2019 GAAP net income was $397 million, or $3.33 per diluted share, compared with $293 million, or $2.45 per diluted share, for the third quarter of 2018. As a result of the enactment of Swiss tax reform, third quarter 2019 GAAP net income included a tax benefit from the re-measurement of Swiss deferred tax assets of $51 million, or $0.43 per share. This benefit is excluded from non-GAAP net income.Third quarter 2019 non-GAAP* net income was $409 million, or $3.43 per diluted share, compared with $337 million, or $2.83 per diluted share, for the third quarter of 2018.The Company ended the third quarter of 2019 with $5.4 billion in cash, cash equivalents, and investments, an increase of $282 million during the quarter, primarily driven by cash generated from operations.“We are pleased with performance in the quarter, reflected in our support of customers in procedures performed and system placements.  Intuitive is committed to enabling care givers in their pursuit of better outcomes while lowering their total cost of treatment,” said Intuitive CEO Gary Guthart.Additional supplemental financial and procedure information has been posted to the Investor Relations section of the Intuitive website at: https://isrg.gcs-web.com/.Webcast and Conference Call InformationIntuitive will hold a teleconference at 1:30 p.m. PDT today to discuss the third quarter 2019 financial results. The call is being webcast by Nasdaq OMX and can be accessed at Intuitive’s website at www.intuitive.com or by dialing (800) 288-8975 or (612) 332-0335.About IntuitiveIntuitive (Nasdaq: ISRG), headquartered in Sunnyvale, California, is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings, and develops, manufactures, and markets the da Vinci® surgical system and the Ion™ endoluminal system.Da Vinci®, da Vinci SP®, IonTM, and SureFormTM are trademarks or registered trademarks of Intuitive Surgical, Inc.For more information, please visit the Company’s website at www.intuitive.com.Forward-Looking StatementsThis press release contains forward-looking statements, including statements regarding the Company's pursuit of better outcomes while lowering their total cost of treatment and the potential for the acquisition of Schölly Fiberoptic's robotic endoscope business to strengthen the Company's supply chain and increase manufacturing capacity for imaging products. These forward-looking statements are necessarily estimates reflecting the best judgment of the Company’s management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the timing and success of product development and market acceptance of developed products, including, but not limited to, Intuitive’s Ion endoluminal system, da Vinci SP surgical system, and 3rd generation stapling platform; the impact of global and regional economic and credit market conditions on healthcare spending; competition in the medical device industry and in the specific markets of surgery in which the Company operates; risks associated with our operations outside of the United States; product liability and other litigation claims; adverse publicity regarding the Company and the safety of the Company’s products and adequacy of training; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the Company is or may become a party; the Company’s reliance on sole and single source suppliers; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances, or partnerships, including the joint venture with Shanghai Fosun Pharmaceutical (Group) Co., Ltd.; the Company's completion of and ability to successfully integrate the acquisition of Schölly Fiberoptic's robotic endoscope business; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement, and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; the Company’s ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; changes in tariffs, trade barriers, and regulatory requirements; and other risk factors identified under the heading “Risk Factors” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2018, as updated by the Company’s other filings with the Securities and Exchange Commission. Statements using words such as “estimates,” “projects,” “believes,” “anticipates,” “plans,” “expects,” “intends,” “may,” “will,” “could,” “should,” “would,” “targeted,” and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.*About Non-GAAP Financial MeasuresTo supplement its consolidated financial statements, which are prepared and presented in accordance with accounting principles generally accepted in the United States (“GAAP”), the Company uses the following non-GAAP financial measures: non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, non-GAAP net income per diluted share (“EPS”), and non-GAAP diluted shares. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP.  The Company uses these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. The Company believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding items such as intangible asset charges, share-based compensation (“SBC”) expenses, and other special items. Intangible asset charges consist of non-cash charges, such as the amortization of intangible assets, as well as in-process R&D charges. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning, forecasting, and analyzing future periods. These non-GAAP financial measures also facilitate management’s internal comparisons to its historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors, because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making, and (2) they are used by institutional investors and the analyst community to help them analyze the performance of the Company’s business. Non-GAAP gross profit. The Company defines non-GAAP gross profit as gross profit, excluding intangible asset charges, expenses related to SBC, and litigation charges and recoveries.Non-GAAP income from operations. The Company defines non-GAAP income from operations as income from operations, excluding intangible asset charges, certain acquisition-related items for the re-measurement of contingent consideration, expenses related to SBC, and litigation charges and recoveries.Non-GAAP net income and EPS. The Company defines non-GAAP net income as net income (loss), excluding intangible asset charges, non-cash impairment charges and recoveries, certain acquisition-related items for the re-measurement of contingent consideration, expenses related to SBC, litigation charges and recoveries, adjustments attributable to noncontrolling interest in joint venture, net of the related tax effects, and tax adjustments, including the excess tax benefits or deficiencies associated with SBC arrangements, the one-time impact of the enactments of the 2017 Tax Act and the 2019 Swiss tax reform, and the net tax effects related to intra-entity transfers of non-inventory assets. The Company excludes the one-time impact of the enactments of the 2017 Tax Act and the 2019 Swiss tax reform, because they are discrete in nature, and excludes the excess tax benefits or deficiencies associated with SBC arrangements as well as the tax effects associated with non-cash amortization of deferred tax assets related to intra-entity non-inventory transfers, because the Company does not believe these items correlate with the on-going results of its core operations. The tax effects of the non-GAAP items are determined by applying a calculated non-GAAP effective tax rate, which is commonly referred to as the with-and-without method. Without excluding these tax effects, investors would only see the gross effect that these non-GAAP adjustments had on the Company’s operating results. The Company’s calculated non-GAAP effective tax rate is generally higher than its GAAP effective tax rate. The Company defines non-GAAP EPS as non-GAAP net income divided by non-GAAP diluted shares, which are calculated as GAAP weighted average outstanding shares plus dilutive potential shares outstanding during the period. There are a number of limitations related to the use of non-GAAP measures versus measures calculated in accordance with GAAP. Non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, and non-GAAP EPS exclude items such as intangible asset charges, re-measurement of contingent consideration, SBC, excess tax benefits or deficiencies associated with SBC arrangements, and non-cash amortization of deferred tax assets related to intra-entity transfer of non-inventory assets, which are primarily recurring items. SBC has been, and will continue to be for the foreseeable future, a significant recurring expense in the Company’s business. In addition, the components of the costs that the Company excludes in its calculation of non-GAAP net income and non-GAAP EPS may differ from the components that its peer companies exclude when they report their results of operations. Management addresses these limitations by providing specific information regarding the GAAP amounts excluded from non-GAAP net income and non-GAAP EPS and evaluating non-GAAP net income and non-GAAP EPS together with net income (loss) and net income (loss) per share calculated in accordance with GAAP. INTUITIVE SURGICAL, INC. UNAUDITED QUARTERLY CONDENSED CONSOLIDATED STATEMENTS OF INCOME (IN MILLIONS, EXCEPT PER SHARE DATA)INTUITIVE SURGICAL, INC. UNAUDITED NINE MONTHS ENDED CONDENSED CONSOLIDATED STATEMENTS OF INCOME (IN MILLIONS, EXCEPT PER SHARE DATA)INTUITIVE SURGICAL, INC. UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS (IN MILLIONS)INTUITIVE SURGICAL, INC.UNAUDITED RECONCILIATION OF GAAP FINANCIAL MEASURES TO NON-GAAP FINANCIAL MEASURES(IN MILLIONS, EXCEPT PER SHARE DATA)"
    },
    {
        "title": "Intuitive Announces First Quarter Earnings",
        "subtitle": "",
        "date": "Apr 18, 2019 4:05PM EDT",
        "content": "SUNNYVALE, Calif., April 18, 2019 (GLOBE NEWSWIRE) -- Intuitive Surgical, Inc. (\"Intuitive\" or the \"Company\") (Nasdaq:ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced financial results for the quarter ended March 31, 2019.Q1 HighlightsQ1 Financial SummaryGross profit, income from operations, net income, net income per diluted share, and diluted shares are reported on a GAAP and non-GAAP* basis. The non-GAAP* measures are described below and are reconciled to the corresponding GAAP measures at the end of this release.First quarter 2019 revenue was $974 million, an increase of approximately 15% compared with $848 million in the first quarter of 2018. Higher first quarter revenue was driven by increased procedures and systems placements.First quarter 2019 instrument and accessory revenue increased by approximately 20% to $552 million, compared with $460 million for the first quarter of 2018, primarily driven by approximately 18% growth in da Vinci procedure volume.First quarter 2019 systems revenue increased by approximately 6% to $248 million, compared with $235 million for the first quarter of 2018. The Company shipped 235 da Vinci Surgical Systems in the first quarter of 2019, compared with 185 in the first quarter of 2018. The first quarter 2019 system shipments included 78 systems shipped under operating lease and usage-based arrangements, compared with 43 during the first quarter of 2018.First quarter 2019 GAAP income from operations decreased to $252 million, compared with $277 million in the first quarter of 2018. First quarter 2019 GAAP income from operations included intangible asset charges of $30 million, compared with $8 million in the first quarter of 2018, and share-based compensation expense of $76 million, compared with $58 million in the first quarter of 2018. First quarter 2019 non-GAAP* income from operations increased to $362 million, compared with $346 million in the first quarter of 2018.First quarter 2019 GAAP net income was $307 million, or $2.56 per diluted share, compared with $288 million, or $2.44 per diluted share, for the first quarter of 2018. First quarter 2019 GAAP net income included excess tax benefits of $73 million, or $0.61 per share, compared with $55 million, or $0.46 per share, for the first quarter of 2018.First quarter 2019 non-GAAP* net income was $312 million, or $2.61 per diluted share, compared with $288 million, or $2.44 per diluted share, for the first quarter of 2018.The Company ended the first quarter of 2019 with $5.1 billion in cash, cash equivalents, and investments, an increase of $230 million during the quarter, primarily driven by cash generated from operations.Commenting on the announcement, Intuitive CEO Gary Guthart said, \"We are pleased with our first quarter procedure and da Vinci system placements. Our teams continue to work closely with hospitals, physicians and their care teams in pursuit of better outcomes, decreased variability, better experiences for both physicians and patients and, ultimately, lowering the total cost of care.\"Additional supplemental financial and procedure information has been posted to the Investor Relations section of the Intuitive website at: https://isrg.gcs-web.com/.Webcast and Conference Call InformationIntuitive will hold a teleconference at 1:30 p.m. PDT today to discuss the first quarter 2019 financial results. The call is being webcast by Nasdaq OMX and can be accessed at Intuitive's website at www.intuitive.com or by dialing (800) 230-1059 or (612) 234-9959.About IntuitiveIntuitive (Nasdaq:ISRG), headquartered in Sunnyvale, California, is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings, and develops, manufactures and markets the da Vinci® surgical system and the Ion™ endoluminal system.Da Vinci®, da Vinci SP®, IonTM, and IRISTM are trademarks or registered trademarks of Intuitive Surgical, Inc.For more information, please visit the Company's website at www.intuitive.com.Forward-Looking StatementsThis press release contains forward-looking statements, including statements regarding the Company continuing to work closely with hospitals, physicians, and care teams in pursuit of better outcomes, decreased variability, better experiences, and lowering the total cost of care. These forward-looking statements are necessarily estimates reflecting the best judgment of the Company's management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the timing and success of product development and market acceptance of developed products, including, but not limited to, the Ion endoluminal system, the da Vinci SP surgical system, and 3rd generation stapling platform; the impact of global and regional economic and credit market conditions on healthcare spending; competition in the medical device industry and in the specific markets of surgery in which the Company operates; risks associated with our operations outside of the United States; product liability and other litigation claims; adverse publicity regarding the Company and the safety of the Company's products and adequacy of training; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the Company is or may become a party; the Company's reliance on sole and single source suppliers; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances, or partnerships, including the joint venture with Shanghai Fosun Pharmaceutical (Group) Co., Ltd.; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement, and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; the Company's ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; changes in tariffs, trade barriers, and regulatory requirements; and other risk factors under the heading \"Risk Factors\" in the Company's report on Form 10-K for the year ended December 31, 2018, as updated by the Company's other filings with the Securities and Exchange Commission. Statements using words such as \"estimates,\" \"projects,\" \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"targeted,\" and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.*About Non-GAAP Financial MeasuresTo supplement its consolidated financial statements, which are prepared and presented in accordance with accounting principles generally accepted in the United States (\"GAAP\"), the Company uses the following non-GAAP financial measures: non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, non-GAAP net income per diluted share (\"EPS\"), and non-GAAP diluted shares. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP.The Company uses these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. The Company believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding items such as intangible asset charges, share-based compensation (\"SBC\") expenses, and other special items. Intangible asset charges consist of non-cash charges, such as the amortization of intangible assets, as well as in-process R&D charges. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning, forecasting, and analyzing future periods. These non-GAAP financial measures also facilitate management's internal comparisons to its historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they are used by institutional investors and the analyst community to help them analyze the performance of the Company's business.Non-GAAP gross profit. The Company defines non-GAAP gross profit as gross profit excluding intangible asset charges, expenses related to SBC, and litigation charges and recoveries.Non-GAAP income from operations. The Company defines non-GAAP income from operations as income from operations excluding intangible asset charges, certain acquisition related items for the re-measurement of contingent considerations, expenses related to SBC, and litigation charges and recoveries.Non-GAAP net income and EPS. The Company defines non-GAAP net income as net income (loss) excluding intangible asset charges; expenses related to SBC; litigation charges and recoveries; non-cash impairment charges; certain acquisition related items for the re-measurement of contingent considerations; adjustments attributable to noncontrolling interest in joint venture, net of the related tax effects; and tax adjustments including the excess tax benefits or deficiencies associated with SBC arrangements, the one-time impact of the enactment of the 2017 Tax Act, and the net tax effects related to intra-entity transfers of non-inventory assets. The Company excludes the one-time impact of the enactment of the 2017 Tax Act because it is discrete in nature as well as the excess tax benefits or deficiencies associated with SBC arrangements and the tax effects associated with non-cash amortization of deferred tax assets related to intra-entity non-inventory transfers as the Company does not believe these items correlate with the on-going results of its core operations. The tax effects of the non-GAAP items are determined by applying a calculated non-GAAP effective tax rate, which is commonly referred to as the with-and-without method. Without excluding these tax effects, investors would only see the gross effect that these non-GAAP adjustments had on the Company's operating results. The Company's calculated non-GAAP effective tax rate is generally higher than its GAAP effective tax rate. The Company defines non-GAAP EPS as non-GAAP net income divided by non-GAAP diluted shares which are calculated as GAAP weighted average outstanding shares plus dilutive potential shares outstanding during the period.There are a number of limitations related to the use of non-GAAP measures versus measures calculated in accordance with GAAP. Non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, and non-GAAP EPS exclude items such as intangible asset charges, re-measurement of contingent considerations, SBC, excess tax benefits or deficiencies associated with SBC arrangements, and non-cash amortization of deferred tax assets related to intra-entity transfer of non-inventory assets, which are primarily recurring items. SBC has been and will continue to be for the foreseeable future a significant recurring expense in the Company's business. In addition, the components of the costs that the Company excludes in its calculation of non-GAAP net income and non-GAAP EPS may differ from the components that its peer companies exclude when they report their results of operations. Management addresses these limitations by providing specific information regarding the GAAP amounts excluded from non-GAAP net income and non-GAAP EPS and evaluating non-GAAP net income and non-GAAP EPS together with net income (loss) and net income (loss) per share calculated in accordance with GAAP.INTUITIVE SURGICAL, INC.UNAUDITED QUARTERLY CONDENSED CONSOLIDATED STATEMENTS OF INCOME(IN MILLIONS, EXCEPT PER SHARE DATA)\n  \n\n  \n    \n      Three months ended\n              \n                      March 31,2019\n                      \n                      \n                      \n                      December 31,2018\n                      \n                      \n                      \n                      March 31,2018\n                      \n                      \n                  Revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Instruments and accessories\n                      $\n                      552.3\n                      \n                      \n                      $\n                      539.3\n                      \n                      \n                      $\n                      460.3\n                      \n                  Systems\n                      247.5\n                      \n                      \n                      \n                      340.6\n                      \n                      \n                      \n                      234.5\n                      \n                      \n                  Services\n                      173.9\n                      \n                      \n                      \n                      166.6\n                      \n                      \n                      \n                      152.7\n                      \n                      \n                  Total revenue\n                      973.7\n                      \n                      \n                      \n                      1,046.5\n                      \n                      \n                      \n                      847.5\n                      \n                      \n                  Cost of revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Product\n                      246.4\n                      \n                      \n                      \n                      251.5\n                      \n                      \n                      \n                      201.5\n                      \n                      \n                  Service\n                      57.7\n                      \n                      \n                      \n                      59.3\n                      \n                      \n                      \n                      52.2\n                      \n                      \n                  Total cost of revenue\n                      304.1\n                      \n                      \n                      \n                      310.8\n                      \n                      \n                      \n                      253.7\n                      \n                      \n                  Gross profit\n                      669.6\n                      \n                      \n                      \n                      735.7\n                      \n                      \n                      \n                      593.8\n                      \n                      \n                  Operating expenses:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Selling, general and administrative (1)\n                      273.4\n                      \n                      \n                      \n                      283.8\n                      \n                      \n                      \n                      221.6\n                      \n                      \n                  Research and development\n                      144.0\n                      \n                      \n                      \n                      119.9\n                      \n                      \n                      \n                      95.5\n                      \n                      \n                  Total operating expenses\n                      417.4\n                      \n                      \n                      \n                      403.7\n                      \n                      \n                      \n                      317.1\n                      \n                      \n                  Income from operations (2)\n                      252.2\n                      \n                      \n                      \n                      332.0\n                      \n                      \n                      \n                      276.7\n                      \n                      \n                  Interest and other income, net\n                      27.5\n                      \n                      \n                      \n                      26.8\n                      \n                      \n                      \n                      13.2\n                      \n                      \n                  Income before taxes\n                      279.7\n                      \n                      \n                      \n                      358.8\n                      \n                      \n                      \n                      289.9\n                      \n                      \n                  Income tax expense (3)\n                      (24.3\n                      \n                      )\n                      \n                      67.5\n                      \n                      \n                      \n                      2.6\n                      \n                      \n                  Net income\n                      304.0\n                      \n                      \n                      \n                      291.3\n                      \n                      \n                      \n                      287.3\n                      \n                      \n                  Less: net loss attributable to noncontrolling interest in joint venture\n                      (2.5\n                      \n                      )\n                      \n                      (1.2\n                      \n                      )\n                      \n                      (0.3\n                      \n                      )\n                  Net income attributable to Intuitive Surgical, Inc.\n                      $\n                      306.5\n                      \n                      \n                      $\n                      292.5\n                      \n                      \n                      $\n                      287.6\n                      \n                  Net income per share attributable to Intuitive Surgical, Inc.:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      $\n                      2.67\n                      \n                      \n                      $\n                      2.56\n                      \n                      \n                      $\n                      2.55\n                      \n                  Diluted (4)\n                      $\n                      2.56\n                      \n                      \n                      $\n                      2.45\n                      \n                      \n                      $\n                      2.44\n                      \n                  Weighted average shares outstanding:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      115.0\n                      \n                      \n                      \n                      114.3\n                      \n                      \n                      \n                      112.8\n                      \n                      \n                  Diluted\n                      119.6\n                      \n                      \n                      \n                      119.2\n                      \n                      \n                      \n                      118.0\n                      \n                      \n                  (1) Selling, general and administrative includes the effect of the following item:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Contributions to the Intuitive Foundation\n                      $\n                      —\n                      \n                      \n                      $\n                      25.2\n                      \n                      \n                      $\n                      —\n                      \n                  (2) Income from operations includes the effect of the following item:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Intangible asset charges\n                      $\n                      30.2\n                      \n                      \n                      $\n                      9.4\n                      \n                      \n                      $\n                      7.6\n                      \n                  (3) Income tax expense includes the effect of the following item:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Excess tax benefits related to share-based compensation arrangements\n                      $\n                      (72.7\n                      )\n                      \n                      $\n                      (15.8\n                      )\n                      \n                      $\n                      (54.7\n                      )\n                  (4) Diluted net income per share includes the effect of the following items:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Contributions to the Intuitive Foundation, net of tax\n                      $\n                      —\n                      \n                      \n                      $\n                      (0.16\n                      )\n                      \n                      $\n                      —\n                      \n                  Intangible asset charges, net of tax\n                      $\n                      (0.21\n                      )\n                      \n                      $\n                      (0.07\n                      )\n                      \n                      $\n                      (0.05\n                      )\n                  Excess tax benefits related to share-based compensation arrangements\n                      $\n                      0.61\n                      \n                      \n                      $\n                      0.13\n                      \n                      \n                      $\n                      0.46\n                      \n                  \n  \n  INTUITIVE SURGICAL, INC.UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS(IN MILLIONS)\n  \n\n  \n    \n      March 31,2019\n                  December 31,2018\n              Cash, cash equivalents, and investments\n                      $\n                      5,064.6\n                      \n                      \n                      $\n                      4,834.4\n                      \n                  Accounts receivable, net\n                      547.6\n                      \n                      \n                      \n                      682.3\n                      \n                      \n                  Inventory\n                      468.3\n                      \n                      \n                      \n                      409.0\n                      \n                      \n                  Property, plant, and equipment, net\n                      935.4\n                      \n                      \n                      \n                      812.0\n                      \n                      \n                  Goodwill\n                      247.5\n                      \n                      \n                      \n                      240.6\n                      \n                      \n                  Deferred tax assets\n                      392.4\n                      \n                      \n                      \n                      428.6\n                      \n                      \n                  Other assets\n                      579.1\n                      \n                      \n                      \n                      439.8\n                      \n                      \n                  Total assets\n                      $\n                      8,234.9\n                      \n                      \n                      $\n                      7,846.7\n                      \n                  Accounts payable and other accrued liabilities\n                      $\n                      865.3\n                      \n                      \n                      $\n                      831.9\n                      \n                  Deferred revenue\n                      329.2\n                      \n                      \n                      \n                      327.3\n                      \n                      \n                  Total liabilities\n                      1,194.5\n                      \n                      \n                      \n                      1,159.2\n                      \n                      \n                  Stockholders' equity\n                      7,040.4\n                      \n                      \n                      \n                      6,687.5\n                      \n                      \n                  Total liabilities and stockholders' equity\n                      $\n                      8,234.9\n                      \n                      \n                      $\n                      7,846.7\n                      \n                  \n  \n  INTUITIVE SURGICAL, INC.UNAUDITED RECONCILIATION OF GAAP FINANCIAL MEASURES TO NON-GAAP FINANCIAL MEASURES(IN MILLIONS, EXCEPT PER SHARE DATA)\n  \n\n  \n    \n      Three months ended\n              \n                      \n                      March 31,2019\n                      \n                      \n                      \n                      December 31,2018\n                      \n                      \n                      \n                      March 31,2018\n                      \n                      \n                  GAAP gross profit\n                      \n                      $\n                      669.6\n                      \n                      \n                      $\n                      735.7\n                      \n                      \n                      $\n                      593.8\n                      \n                  Share-based compensation expense\n                      \n                      15.1\n                      \n                      \n                      \n                      13.5\n                      \n                      \n                      \n                      11.9\n                      \n                      \n                  Intangible asset charges\n                      \n                      8.2\n                      \n                      \n                      \n                      2.0\n                      \n                      \n                      \n                      1.0\n                      \n                      \n                  Non-GAAP gross profit\n                      \n                      $\n                      692.9\n                      \n                      \n                      $\n                      751.2\n                      \n                      \n                      $\n                      606.7\n                      \n                  GAAP income from operations\n                      \n                      $\n                      252.2\n                      \n                      \n                      $\n                      332.0\n                      \n                      \n                      $\n                      276.7\n                      \n                  Share-based compensation expense\n                      \n                      76.1\n                      \n                      \n                      \n                      70.4\n                      \n                      \n                      \n                      57.5\n                      \n                      \n                  Intangible asset charges\n                      \n                      30.2\n                      \n                      \n                      \n                      9.4\n                      \n                      \n                      \n                      7.6\n                      \n                      \n                  Litigation charges\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      4.5\n                      \n                      \n                  Acquisition related items\n                      \n                      3.0\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Non-GAAP income from operations\n                      \n                      $\n                      361.5\n                      \n                      \n                      $\n                      411.8\n                      \n                      \n                      $\n                      346.3\n                      \n                  GAAP net income attributable to Intuitive Surgical, Inc.\n                      \n                      $\n                      306.5\n                      \n                      \n                      $\n                      292.5\n                      \n                      \n                      $\n                      287.6\n                      \n                  Share-based compensation expense\n                      \n                      76.1\n                      \n                      \n                      \n                      70.4\n                      \n                      \n                      \n                      57.5\n                      \n                      \n                  Intangible asset charges\n                      \n                      30.2\n                      \n                      \n                      \n                      9.4\n                      \n                      \n                      \n                      7.6\n                      \n                      \n                  Litigation charges\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      4.5\n                      \n                      \n                  Impairment charges\n                      \n                      1.5\n                      \n                      \n                      \n                      1.2\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Acquisition related items\n                      \n                      3.0\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Tax adjustments (1)\n                      \n                      (101.5\n                      \n                      )\n                      \n                      (20.3\n                      \n                      )\n                      \n                      (69.7\n                      \n                      )\n                  Adjustments attributable to noncontrolling interest in joint venture\n                      \n                      (3.8\n                      \n                      )\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Non-GAAP net income attributable to Intuitive Surgical, Inc.\n                      \n                      $\n                      312.0\n                      \n                      \n                      $\n                      353.2\n                      \n                      \n                      $\n                      287.5\n                      \n                  GAAP net income per share attributable to Intuitive Surgical, Inc. - diluted\n                      \n                      $\n                      2.56\n                      \n                      \n                      $\n                      2.45\n                      \n                      \n                      $\n                      2.44\n                      \n                  Share-based compensation expense\n                      \n                      0.64\n                      \n                      \n                      \n                      0.59\n                      \n                      \n                      \n                      0.49\n                      \n                      \n                  Intangible asset charges\n                      \n                      0.25\n                      \n                      \n                      \n                      0.08\n                      \n                      \n                      \n                      0.06\n                      \n                      \n                  Litigation charges\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      0.04\n                      \n                      \n                  Impairment charges\n                      \n                      0.01\n                      \n                      \n                      \n                      0.01\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Acquisition related items\n                      \n                      0.03\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Tax adjustments (1)\n                      \n                      (0.85\n                      \n                      )\n                      \n                      (0.17\n                      \n                      )\n                      \n                      (0.59\n                      \n                      )\n                  Adjustments attributable to noncontrolling interest in joint venture\n                      \n                      (0.03\n                      \n                      )\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Non-GAAP net income per share attributable to Intuitive Surgical, Inc. - diluted\n                      \n                      $\n                      2.61\n                      \n                      \n                      $\n                      2.96\n                      \n                      \n                      $\n                      2.44\n                      \n                  (1) For the three months ended March 31, 2019, tax adjustments included: (a) excess tax benefits associated with share-based compensation arrangements of $(72.7) million, or $(0.61) per diluted share; (b) tax impact related to intra-entity transfers of non-inventory assets of $10.2 million, or $0.09 per diluted share; and (c) other tax adjustments effects determined by applying a calculated non-GAAP effective tax rate of $(39.0) million, or $(0.33) per diluted share.\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n  \n  Contact: Investor Relations(408) 523-2161   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Intuitive Surgical, Inc."
    },
    {
        "title": "U.S. FDA Clears da Vinci SP for Certain Transoral Otolaryngology Procedures",
        "subtitle": "",
        "date": "Mar 15, 2019 1:36PM EDT",
        "content": "SUNNYVALE, Calif., March 15, 2019 (GLOBE NEWSWIRE) -- Intuitive (Nasdaq:ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced it has received clearance for the da Vinci SP® surgical system for use in certain transoral otolaryngology procedures in adults. The FDA cleared the single port approach for lateral oropharyngectomy procedures (commonly referred to as radical tonsillectomy) and tongue base resection.\"Today's FDA clearance means surgeons can utilize da Vinci SP robotic-assisted surgery to conduct radical tonsillectomy and tongue base resection transorally,\" said Gary Guthart, Intuitive CEO. \"Our single port innovation is part of our commitment to helping surgeons and their teams improve patient outcomes, decrease variability in surgery, and improve the patient and surgical team experience.\"The da Vinci SP system provides surgeons with robotic-assisted technology designed for deep and narrow access to tissue in the body. The ability to enter the body through a single, small incision or through a natural orifice can provide a minimally invasive experience for complex procedures.\"Intuitive's da Vinci SP complements our other systems by enabling surgeons to access narrow workspaces while maintaining high quality vision, precision, and control that surgeons have come to trust from da Vinci systems,\" said Guthart.The da Vinci SP system includes three, multi-jointed, wristed instruments and a fully wristed 3D HD camera. The instruments and the camera all emerge through a single cannula and are properly triangulated around the target anatomy at the distal tip to avoid external instrument collisions that can occur in narrow surgical workspaces. The system enables flexible port placement and excellent internal and external range of motion (e.g., 360-degrees of anatomical access) through the single SP arm. Surgeons control the fully articulating instruments and the camera on the da Vinci SP system, which uses the same surgeon console as the da Vinci X® and Xi™ systems.Transoral otolaryngology procedures represent the second category of procedures the FDA has cleared for the da Vinci SP surgical system; the FDA cleared the da Vinci SP system for urology procedures in May 2018. Since the initial clearance, Intuitive has shipped 15 da Vinci SP systems in 2018. With this additional indication, Intuitive plans to continue with its measured introduction of the da Vinci SP system in 2019.About Intuitive Surgical, Inc.Intuitive (Nasdaq:ISRG), headquartered in Sunnyvale, Calif., is a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings, and develops, manufactures and markets the da Vinci® surgical system and the Ion™ endoluminal system.Surgical RisksFor Important Safety Information, indications for use, risks, full cautions and warnings, please refer to www.intuitive.com/safety.Forward-Looking StatementThis press release contains forward-looking statements, including statements regarding the da Vinci SP Surgical System and its potential utility. These forward-looking statements are based on current expectations and estimates and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the impact of global and regional economic and credit market conditions on healthcare spending; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; the timing and success of product development and market acceptance of developed products, including, but not limited to, the recently cleared Ion endoluminal system, da Vinci SP Surgical System and 3rd generation stapling platform; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances or partnerships; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; competition in the medical device industry and in the specific markets of surgery in which the company operates; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the company is or may become a party; product liability and other litigation claims; adverse publicity regarding the company and the safety of the company's products and adequacy of training; the company's ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; and other risk factors under the heading \"Risk Factors\" in the company's annual report on Form 10-K for the year ended December 31, 2018, as updated by the company's other filings with the Securities and Exchange Commission. Statements using words such as \"estimates,\" \"projects,\" \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"targeted\" and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.CONTACT: Intuitive Surgical Corporate Communications408-523-7337corp.comm@intusurg.comPN#1058628-Rev A   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Intuitive Surgical, Inc."
    },
    {
        "title": "U. S. FDA Grants Clearance for Ion by Intuitive",
        "subtitle": "",
        "date": "Feb 19, 2019 11:18AM EST",
        "content": "SUNNYVALE, Calif., Feb. 19, 2019 (GLOBE NEWSWIRE) -- Intuitive Surgical, Inc. (Nasdaq:ISRG), a global technology leader in minimally invasive care and the pioneer of robotic-assisted surgery, today announced that the U.S. Food and Drug Administration (FDA) cleared the Ion™ endoluminal system to enable minimally invasive biopsy in the peripheral lung.Lung cancer is the world's leading cause of cancer deaths. Many suspicious lesions found in the lung may be small and difficult to access, which can make obtaining a diagnosis challenging.\"Early lung cancer diagnosis can save lives. Intuitive's advanced, robotic-assisted, minimally invasive Ion system helps address a challenging aspect of lung biopsy by enabling physicians to obtain tissue samples from deep within the lung,\" said Gary Guthart, Intuitive CEO.The Ion system uses an ultra-thin articulating robotic catheter that can move 180 degrees in all directions. The outer diameter of the catheter is 3.5 mm, which physicians can navigate through small and tortuous airways to reach nodules in any airway segment within the lung. The Ion system's flexible biopsy needle (called the Flexision Biopsy Needle) can also pass through very tight bends via Ion's catheter to collect tissue in the peripheral lung. The catheter's 2mm working channel can also accommodate other biopsy tools, such as biopsy forceps or cytology brushes, if necessary.Intuitive developed the system's fiber optic shape sensor technology to provide the physician with the precise location and shape information of the catheter throughout the navigation and biopsy process.Intuitive designed the Ion system to easily integrate into existing lung nodule biopsy workflows, as well as existing imaging technology, including fluoroscopy, radial-endobronchial ultrasound, and cone-beam CT.\"The Ion system represents Intuitive's continued commitment to innovating for minimally invasive care, and extends our focus beyond surgery,\" said Guthart. \"At Intuitive, we innovate for need, and lung cancer is clearly a global health challenge that requires new modalities of care.\"Intuitive plans to introduce the Ion system in the U.S. in a measured fashion, with customer shipments beginning in the second quarter of 2019.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to this innovative new platform, which supports the company's mission in the advancement of minimally invasive care.About IntuitiveIntuitive (Nasdaq:ISRG), headquartered in Sunnyvale, Calif., is the pioneer and a global leader in robotic-assisted, minimally invasive surgery. At Intuitive, we believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we expand the potential of physicians to heal without constraints.Intuitive brings more than two decades of leadership in robotic-assisted surgical technology and solutions to its offerings, and develops, manufactures and markets the da Vinci® surgical system and the Ion™ endoluminal system.Forward Looking StatementsThis press release contains forward-looking statements, including statements regarding the Ion endoluminal system and the company's leadership in the advancement of minimally invasive care. These forward-looking statements are based on current expectations and estimates and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the impact of global and regional economic and credit market conditions on healthcare spending; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; the timing and success of product development and market acceptance of developed products, including, but not limited to, the recently cleared Ion endoluminal system, da Vinci SP Surgical System and 3rd generation stapling platform; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances or partnerships; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; competition in the medical device industry and in the specific markets of surgery in which the company operates; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the company is or may become a party; product liability and other litigation claims; adverse publicity regarding the company and the safety of the company's products and adequacy of training; the company's ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; and other risk factors under the heading \"Risk Factors\" in the company's annual report on Form 10-K for the year ended December 31, 2018, as updated by the company's other filings with the Securities and Exchange Commission. Statements using words such as \"estimates,\" \"projects,\" \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"targeted\" and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.Global Public AffairsIntuitive Surgicalcorp.comm@intusurg.com+1-408-523-7337PN1057696-A   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Intuitive Surgical, Inc."
    },
    {
        "title": "Intuitive Surgical Announces Fourth Quarter Earnings",
        "subtitle": "",
        "date": "Jan 24, 2019 4:05PM EST",
        "content": "SUNNYVALE, Calif., Jan. 24, 2019 (GLOBE NEWSWIRE) -- Intuitive Surgical, Inc. (\"Intuitive\" or the \"Company\") (Nasdaq:ISRG), the pioneer and a global technology leader in robotic-assisted, minimally invasive surgery, today announced financial results for the quarter ended December 31, 2018. Reported revenue and procedure results are consistent with the Company's press release on January 9, 2019.Q4 HighlightsQ4 Financial SummaryGross profit, income from operations, net income (loss), net income (loss) per diluted share, and diluted shares are reported on a GAAP and non-GAAP* basis. The non-GAAP* measures are described below and are reconciled to the corresponding GAAP measures at the end of this release.Fourth quarter 2018 revenue was $1,047 million, an increase of approximately 17% compared with $892 million in the fourth quarter of 2017. Higher fourth quarter revenue was driven by increased procedures and systems placements.Fourth quarter 2018 instrument and accessory revenue increased by approximately 18% to $539 million, compared with $457 million for the fourth quarter of 2017, primarily driven by approximately 19% growth in da Vinci procedure volume.Fourth quarter 2018 systems revenue increased by approximately 20% to $341 million, compared with $285 million for the fourth quarter of 2017. The Company shipped 290 da Vinci Surgical Systems in the fourth quarter of 2018, compared with 216 in the fourth quarter of 2017. The fourth quarter 2018 system shipments included 84 systems shipped under operating lease and usage-based arrangements, compared with 40 during the fourth quarter of 2017.Fourth quarter 2018 GAAP income from operations increased to $332 million, compared with $329 million in the fourth quarter of 2017. Fourth quarter 2018 non-GAAP* income from operations increased to $412 million, compared with $386 million in the fourth quarter of 2017. The contribution made to the Intuitive Foundation reduced fourth quarter 2018 GAAP and non-GAAP* income from operations by $25 million.Fourth quarter 2018 GAAP net income was $293 million, or $2.45 per diluted share, compared with net loss of $32 million, or $0.28 per diluted share, for the fourth quarter of 2017. Fourth quarter 2017 GAAP net loss reflected $318 million, or $2.83 per diluted share, of income tax expense as a result of the 2017 Tax Act.Fourth quarter 2018 non-GAAP* net income was $353 million, or $2.96 per diluted share, compared with $305 million, or $2.60 per diluted share, for the fourth quarter of 2017. The contribution made to the Intuitive Foundation reduced fourth quarter 2018 GAAP and non-GAAP* net income by $0.16 per diluted share.The Company ended the fourth quarter of 2018 with $4.8 billion in cash, cash equivalents, and investments, an increase of $264 million during the quarter, primarily driven by cash generated from operations.Additional supplemental financial and procedure information has been posted to the Investor Relations section of the Intuitive website at: https://isrg.gcs-web.com/.Webcast and Conference Call InformationIntuitive will hold a teleconference at 1:30 p.m. PST today to discuss the fourth quarter 2018 financial results. The call is being webcast by Nasdaq OMX and can be accessed at Intuitive's website at www.intuitive.com or by dialing (800) 230-1059 or (612) 234-9959.About Intuitive Surgical, Inc.Intuitive Surgical, Inc. (Nasdaq:ISRG), headquartered in Sunnyvale, California, is the pioneer and a global technology leader in robotic-assisted, minimally invasive surgery. Intuitive develops, manufactures and markets the da Vinci surgical system. The company strives to make surgery more effective, less invasive and easier on surgeons, patients and their families.About the da Vinci Surgical SystemThere are several models of the da Vinci surgical systems. The da Vinci surgical systems are designed to help surgeons perform minimally invasive surgery. Da Vinci systems offer surgeons high-definition 3D vision, a magnified view, and robotic and computer assistance. They use specialized instrumentation, including a miniaturized surgical camera and wristed instruments (i.e., scissors, scalpels and forceps) that are designed to help with precise dissection and reconstruction deep inside the body.Da Vinci®, da Vinci SP®, and Ion™ are trademarks or registered trademarks of Intuitive Surgical, Inc.For more information, please visit the Company's website at www.intuitive.com.Forward-Looking StatementsThis press release contains forward-looking statements, including statements regarding the Company striving to make surgery more effective, less invasive and easier on surgeons, patients and their families. These forward-looking statements are necessarily estimates reflecting the best judgment of the Company's management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: the timing and success of product development and market acceptance of developed products, including, but not limited to, the da Vinci SP surgical system and 3rd generation stapling platform; the impact of global and regional economic and credit market conditions on healthcare spending; competition in the medical device industry and in the specific markets of surgery in which the Company operates; risks associated with our operations outside of the United States; product liability and other litigation claims; adverse publicity regarding the Company and the safety of the Company's products and adequacy of training; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the Company is or may become a party; the Company's reliance on sole and single source suppliers; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances, or partnerships, including the joint venture with Shanghai Fosun Pharmaceutical (Group) Co., Ltd.; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement, and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body, including, but not limited to, the premarket notification to the FDA for the Ion endoluminal system; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; the Company's ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; changes in tariffs, trade barriers, and regulatory requirements; and other risk factors under the heading \"Risk Factors\" in the Company's report on Form 10-K for the year ended December 31, 2017, as updated by the Company's other filings with the Securities and Exchange Commission. Statements using words such as \"estimates,\" \"projects,\" \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"targeted\" and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.*About Non-GAAP Financial MeasuresTo supplement its consolidated financial statements, which are prepared and presented in accordance with accounting principles generally accepted in the United States (\"GAAP\"), the Company uses the following non-GAAP financial measures: non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, non-GAAP net income per diluted share (\"EPS\"), and non-GAAP diluted shares. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP.The Company uses these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. The Company believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding items such as intangible asset charges, share-based compensation (\"SBC\") expenses, and other special items. Intangible asset charges consist of non-cash charges, such as the amortization of intangible assets, as well as in-process R&D charges. The Company believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning, forecasting, and analyzing future periods. These non-GAAP financial measures also facilitate management's internal comparisons to its historical performance and liquidity. The Company believes these non-GAAP financial measures are useful to investors because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they are used by institutional investors and the analyst community to help them analyze the performance of the Company's business.Non-GAAP gross profit. The Company defines non-GAAP gross profit as gross profit excluding intangible asset charges, expenses related to SBC, and litigation charges.Non-GAAP income from operations. The Company defines non-GAAP income from operations as income from operations excluding intangible asset charges, expenses related to SBC, and litigation charges and recoveries.Non-GAAP net income and EPS. The Company defines non-GAAP net income as net income (loss) excluding intangible asset charges; expenses related to SBC; litigation charges and recoveries; non-cash impairment of investments, net of the related tax effects; and tax adjustments including the excess tax benefits or deficiencies associated with share-based compensation arrangements, the one-time impact of the enactment of the 2017 Tax Act, and the net tax effects related to intra-entity transfers of non-inventory assets. The Company excludes the one-time impact of the enactment of the 2017 Tax Act because it is discrete in nature as well as the excess tax benefits or deficiencies associated with share-based compensation arrangements and the tax effects associated with non-cash amortization of deferred tax assets related to intra-entity non-inventory transfers as the Company does not believe these items correlate with the on-going results of its core operations. The tax effects of the non-GAAP items are determined by applying a calculated non-GAAP effective tax rate, which is commonly referred to as the with-and-without method. Without excluding these tax effects, investors would only see the gross effect that these non-GAAP adjustments had on the Company's operating results. The Company's calculated non-GAAP effective tax rate is generally higher than its GAAP effective tax rate. The Company defines non-GAAP EPS as non-GAAP net income divided by non-GAAP diluted shares which are calculated as GAAP weighted average outstanding shares plus dilutive potential shares outstanding during the period.There are a number of limitations related to the use of non-GAAP measures versus measures calculated in accordance with GAAP. Non-GAAP gross profit, non-GAAP income from operations, non-GAAP net income, and non-GAAP EPS exclude items such as intangible asset charges, SBC, excess tax benefits or deficiencies associated with share-based compensation arrangements, and non-cash amortization of deferred tax assets related to intra-entity transfer of non-inventory assets, which are primarily recurring items. SBC has been and will continue to be for the foreseeable future a significant recurring expense in the Company's business. In addition, the components of the costs that the Company excludes in its calculation of non-GAAP net income and non-GAAP EPS may differ from the components that its peer companies exclude when they report their results of operations. Management addresses these limitations by providing specific information regarding the GAAP amounts excluded from non-GAAP net income and non-GAAP EPS and evaluating non-GAAP net income and non-GAAP EPS together with net income (loss) and net income (loss) per share calculated in accordance with GAAP.INTUITIVE SURGICAL, INC.UNAUDITED QUARTERLY CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS(IN MILLIONS, EXCEPT PER SHARE DATA)\n  \n\n  \n    \n      Three months ended\n              \n                      December 31,2018\n                      \n                      \n                      \n                      September 30,2018\n                      \n                      \n                      \n                      December 31,2017\n                      \n                      \n                  Revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Instruments and accessories\n                      $\n                      539.3\n                      \n                      \n                      $\n                      486.3\n                      \n                      \n                      $\n                      457.1\n                      \n                  Systems\n                      340.6\n                      \n                      \n                      \n                      274.6\n                      \n                      \n                      \n                      284.5\n                      \n                      \n                  Services\n                      166.6\n                      \n                      \n                      \n                      160.0\n                      \n                      \n                      \n                      150.4\n                      \n                      \n                   Total revenue\n                      1,046.5\n                      \n                      \n                      \n                      920.9\n                      \n                      \n                      \n                      892.0\n                      \n                      \n                  Cost of revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Product\n                      251.5\n                      \n                      \n                      \n                      225.1\n                      \n                      \n                      \n                      210.7\n                      \n                      \n                  Service\n                      59.3\n                      \n                      \n                      \n                      53.5\n                      \n                      \n                      \n                      47.3\n                      \n                      \n                   Total cost of revenue\n                      310.8\n                      \n                      \n                      \n                      278.6\n                      \n                      \n                      \n                      258.0\n                      \n                      \n                  Gross profit\n                      735.7\n                      \n                      \n                      \n                      642.3\n                      \n                      \n                      \n                      634.0\n                      \n                      \n                  Operating expenses:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Selling, general and administrative (1)\n                      283.8\n                      \n                      \n                      \n                      221.4\n                      \n                      \n                      \n                      217.9\n                      \n                      \n                  Research and development\n                      119.9\n                      \n                      \n                      \n                      107.6\n                      \n                      \n                      \n                      87.1\n                      \n                      \n                   Total operating expenses\n                      403.7\n                      \n                      \n                      \n                      329.0\n                      \n                      \n                      \n                      305.0\n                      \n                      \n                  Income from operations\n                      332.0\n                      \n                      \n                      \n                      313.3\n                      \n                      \n                      \n                      329.0\n                      \n                      \n                  Interest and other income, net\n                      26.8\n                      \n                      \n                      \n                      21.9\n                      \n                      \n                      \n                      12.3\n                      \n                      \n                  Income before taxes\n                      358.8\n                      \n                      \n                      \n                      335.2\n                      \n                      \n                      \n                      341.3\n                      \n                      \n                  Income tax expense (2)\n                      67.5\n                      \n                      \n                      \n                      43.4\n                      \n                      \n                      \n                      372.8\n                      \n                      \n                  Net income (loss)\n                      291.3\n                      \n                      \n                      \n                      291.8\n                      \n                      \n                      \n                      (31.5\n                      \n                      )\n                  Less: net loss attributable to noncontrolling interest in jointventure\n                      (1.2\n                      \n                      )\n                      \n                      (0.7\n                      \n                      )\n                      \n                      —\n                      \n                      \n                  Net income (loss) attributable to Intuitive Surgical, Inc.\n                      $\n                      292.5\n                      \n                      \n                      $\n                      292.5\n                      \n                      \n                      $\n                      (31.5\n                      )\n                  Net income (loss) per share attributable to Intuitive Surgical, Inc.:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      $\n                      2.56\n                      \n                      \n                      $\n                      2.57\n                      \n                      \n                      $\n                      (0.28\n                      )\n                  Diluted (3)\n                      $\n                      2.45\n                      \n                      \n                      $\n                      2.45\n                      \n                      \n                      $\n                      (0.28\n                      )\n                  Weighted average shares outstanding:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      114.3\n                      \n                      \n                      \n                      114.0\n                      \n                      \n                      \n                      112.2\n                      \n                      \n                  Diluted*\n                      119.2\n                      \n                      \n                      \n                      119.2\n                      \n                      \n                      \n                      112.2\n                      \n                      \n                  (1) Selling, general and administrative includes the effect of the following item:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Contributions to the Intuitive Foundation\n                      $\n                      25.2\n                      \n                      \n                      $\n                      —\n                      \n                      \n                      $\n                      —\n                      \n                  (2) Income tax expense includes the effect of the following items:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Excess tax benefits related to share-based compensation arrangements\n                      $\n                      (15.8\n                      )\n                      \n                      $\n                      (24.1\n                      )\n                      \n                      $\n                      (19.9\n                      )\n                  One-time impact of the enactment of the 2017 Tax Act**\n                      $\n                      0.5\n                      \n                      \n                      $\n                      —\n                      \n                      \n                      $\n                      317.8\n                      \n                  (3) Diluted net income (loss) per share includes the effect of the following items:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Contributions to the Intuitive Foundation, net of tax\n                      $\n                      (0.16\n                      )\n                      \n                      $\n                      —\n                      \n                      \n                      $\n                      —\n                      \n                  Excess tax benefits related to share-based compensation arrangements\n                      $\n                      0.13\n                      \n                      \n                      $\n                      0.20\n                      \n                      \n                      $\n                      0.18\n                      \n                  One-time impact of the enactment of the 2017 Tax Act**\n                      $\n                      —\n                      \n                      \n                      $\n                      —\n                      \n                      \n                      $\n                      (2.83\n                      )\n                  (*) The fourth quarter 2017 diluted share amount did not include approximately 5.2 million shares, because including such shares would have been anti-dilutive due to the net loss incurred in the period.\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (**) On December 22, 2017, the 2017 Tax Act was enacted, which resulted in a fourth quarter 2017 income tax expense primarily related to a one-time deemed repatriation tax on undistributed foreign earnings and the revaluation of deferred taxes due to a reduction of the U.S. corporate income tax rate. In December 2018, the Company completed its accounting for the effect of the 2017 Tax Act within the measurement period under applicable SEC guidance, and reflected a $0.5 million increase in the 2018 income tax expense.\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n  \n  INTUITIVE SURGICAL, INC.UNAUDITED TWELVE MONTHS ENDED CONDENSED CONSOLIDATED STATEMENTS OF INCOME(IN MILLIONS, EXCEPT PER SHARE DATA)\n  \n\n  \n    \n      Twelve months ended\n              \n                      December 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                      \n                  Revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Instruments and accessories\n                      $\n                      1,962.0\n                      \n                      \n                      $\n                      1,636.9\n                      \n                  Systems\n                      1,127.1\n                      \n                      \n                      \n                      928.4\n                      \n                      \n                  Services\n                      635.1\n                      \n                      \n                      \n                      572.9\n                      \n                      \n                   Total revenue\n                      3,724.2\n                      \n                      \n                      \n                      3,138.2\n                      \n                      \n                  Cost of revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Product\n                      906.2\n                      \n                      \n                      \n                      756.3\n                      \n                      \n                  Service\n                      213.9\n                      \n                      \n                      \n                      179.9\n                      \n                      \n                  Total cost of revenue\n                      1,120.1\n                      \n                      \n                      \n                      936.2\n                      \n                      \n                   Gross profit\n                      2,604.1\n                      \n                      \n                      \n                      2,202.0\n                      \n                      \n                  Operating expenses:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Selling, general and administrative (1)\n                      986.6\n                      \n                      \n                      \n                      810.5\n                      \n                      \n                  Research and development\n                      418.1\n                      \n                      \n                      \n                      328.6\n                      \n                      \n                   Total operating expenses\n                      1,404.7\n                      \n                      \n                      \n                      1,139.1\n                      \n                      \n                  Income from operations\n                      1,199.4\n                      \n                      \n                      \n                      1,062.9\n                      \n                      \n                  Interest and other income, net\n                      80.1\n                      \n                      \n                      \n                      41.9\n                      \n                      \n                  Income before taxes\n                      1,279.5\n                      \n                      \n                      \n                      1,104.8\n                      \n                      \n                  Income tax expense (2)\n                      154.5\n                      \n                      \n                      \n                      433.9\n                      \n                      \n                  Net income\n                      1,125.0\n                      \n                      \n                      \n                      670.9\n                      \n                      \n                  Less: net loss attributable to noncontrolling interest in joint venture\n                      (2.9\n                      \n                      )\n                      \n                      —\n                      \n                      \n                  Net income attributable to Intuitive Surgical, Inc.\n                      $\n                      1,127.9\n                      \n                      \n                      $\n                      670.9\n                      \n                  Net income per share attributable to Intuitive Surgical, Inc.:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      $\n                      9.92\n                      \n                      \n                      $\n                      6.01\n                      \n                  Diluted (3)\n                      $\n                      9.49\n                      \n                      \n                      $\n                      5.77\n                      \n                  Weighted average shares outstanding:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      113.7\n                      \n                      \n                      \n                      111.7\n                      \n                      \n                  Diluted\n                      118.8\n                      \n                      \n                      \n                      116.3\n                      \n                      \n                  (1) Selling, general and administrative includes the effect of the following items:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Litigation charges\n                      $\n                      45.2\n                      \n                      \n                      $\n                      17.5\n                      \n                  Contributions to the Intuitive Foundation\n                      $\n                      25.2\n                      \n                      \n                      $\n                      —\n                      \n                  (2) Income tax expense includes the effect of the following items:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                   Certain one-time tax benefits\n                      $\n                      (7.1\n                      )\n                      \n                      $\n                      (60.6\n                      )\n                  Excess tax benefits related to share-based compensation arrangements\n                      $\n                      (116.2\n                      )\n                      \n                      $\n                      (102.8\n                      )\n                   One-time impact of the enactment of the 2017 Tax Act*\n                      $\n                      0.5\n                      \n                      \n                      $\n                      317.8\n                      \n                  (3) Diluted net income per share includes the effect of the following items:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Litigation charges, net of tax\n                      $\n                      (0.29\n                      )\n                      \n                      $\n                      (0.10\n                      )\n                  Contributions to the Intuitive Foundation, net of tax\n                      $\n                      (0.16\n                      )\n                      \n                      $\n                      —\n                      \n                   Certain one-time tax benefits\n                      $\n                      0.06\n                      \n                      \n                      $\n                      0.52\n                      \n                   Excess tax benefits related to share-based compensation arrangements\n                      $\n                      0.98\n                      \n                      \n                      $\n                      0.88\n                      \n                   One-time impact of the enactment of the 2017 Tax Act*\n                      $\n                      —\n                      \n                      \n                      $\n                      (2.73\n                      )\n                  (*) On December 22, 2017, the 2017 Tax Act was enacted, which resulted in a fourth quarter 2017 income tax expense primarily related to a one-time deemed repatriation tax on undistributed foreign earnings and the revaluation of deferred taxes due to a reduction of the U.S. corporate income tax rate. In December 2018, the Company completed its accounting for the effect of the 2017 Tax Act within the measurement period under applicable SEC guidance, and reflected a $0.5 million increase in the 2018 income tax expense.\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n  \n  INTUITIVE SURGICAL, INC.UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS(IN MILLIONS)\n  \n\n  \n    \n      December 31,2018\n                  December 31,2017\n              Cash, cash equivalents, and investments\n                      $\n                      4,834.4\n                      \n                      \n                      $\n                      3,846.5\n                      \n                  Accounts receivable, net\n                      682.3\n                      \n                      \n                      \n                      507.9\n                      \n                      \n                  Inventory\n                      409.0\n                      \n                      \n                      \n                      241.2\n                      \n                      \n                  Property, plant, and equipment, net\n                      812.0\n                      \n                      \n                      \n                      613.1\n                      \n                      \n                  Goodwill\n                      240.6\n                      \n                      \n                      \n                      201.1\n                      \n                      \n                  Deferred tax assets\n                      428.6\n                      \n                      \n                      \n                      72.0\n                      \n                      \n                  Other assets\n                      439.8\n                      \n                      \n                      \n                      295.0\n                      \n                      \n                  Total assets\n                      $\n                      7,846.7\n                      \n                      \n                      $\n                      5,776.8\n                      \n                  Accounts payable and other accrued liabilities\n                      $\n                      831.9\n                      \n                      \n                      $\n                      727.8\n                      \n                  Deferred revenue\n                      327.3\n                      \n                      \n                      \n                      268.6\n                      \n                      \n                  Total liabilities\n                      1,159.2\n                      \n                      \n                      \n                      996.4\n                      \n                      \n                  Stockholders' equity\n                      6,687.5\n                      \n                      \n                      \n                      4,780.4\n                      \n                      \n                  Total liabilities and stockholders' equity\n                      $\n                      7,846.7\n                      \n                      \n                      $\n                      5,776.8\n                      \n                  \n  \n  INTUITIVE SURGICAL, INC.UNAUDITED RECONCILIATION OF GAAP FINANCIAL MEASURES TO NON-GAAP FINANCIAL MEASURES(IN MILLIONS, EXCEPT PER SHARE DATA)\n  \n\n  \n    \n      Three months ended\n                  Twelve months ended\n              \n                      \n                      December 31,2018\n                      \n                      \n                      \n                      September 30,2018\n                      \n                      \n                      \n                      December 31,2017\n                      \n                      \n                      \n                      December 31,2018\n                      \n                      \n                      \n                      December 31,2017\n                      \n                      \n                  GAAP gross profit\n                      \n                      $\n                      735.7\n                      \n                      \n                      $\n                      642.3\n                      \n                      \n                      $\n                      634.0\n                      \n                      \n                      $\n                      2,604.1\n                      \n                      \n                      $\n                      2,202.0\n                      \n                  Share-based compensation expense\n                      \n                      13.5\n                      \n                      \n                      \n                      14.3\n                      \n                      \n                      \n                      11.1\n                      \n                      \n                      \n                      52.5\n                      \n                      \n                      \n                      41.7\n                      \n                      \n                  Intangible asset charges\n                      \n                      2.0\n                      \n                      \n                      \n                      1.8\n                      \n                      \n                      \n                      1.0\n                      \n                      \n                      \n                      6.1\n                      \n                      \n                      \n                      5.4\n                      \n                      \n                  Litigation charges\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      7.8\n                      \n                      \n                  Non-GAAP gross profit\n                      \n                      $\n                      751.2\n                      \n                      \n                      $\n                      658.4\n                      \n                      \n                      $\n                      646.1\n                      \n                      \n                      $\n                      2,662.7\n                      \n                      \n                      $\n                      2,256.9\n                      \n                  GAAP income from operations\n                      \n                      $\n                      332.0\n                      \n                      \n                      $\n                      313.3\n                      \n                      \n                      $\n                      329.0\n                      \n                      \n                      $\n                      1,199.4\n                      \n                      \n                      $\n                      1,062.9\n                      \n                  Share-based compensation expense\n                      \n                      70.4\n                      \n                      \n                      \n                      70.1\n                      \n                      \n                      \n                      55.6\n                      \n                      \n                      \n                      261.2\n                      \n                      \n                      \n                      209.1\n                      \n                      \n                  Intangible asset charges\n                      \n                      9.4\n                      \n                      \n                      \n                      9.0\n                      \n                      \n                      \n                      2.7\n                      \n                      \n                      \n                      31.6\n                      \n                      \n                      \n                      18.6\n                      \n                      \n                  Litigation charges (recoveries)\n                      \n                      —\n                      \n                      \n                      \n                      (1.8\n                      \n                      )\n                      \n                      (1.2\n                      \n                      )\n                      \n                      45.2\n                      \n                      \n                      \n                      25.3\n                      \n                      \n                  Non-GAAP income from operations\n                      \n                      $\n                      411.8\n                      \n                      \n                      $\n                      390.6\n                      \n                      \n                      $\n                      386.1\n                      \n                      \n                      $\n                      1,537.4\n                      \n                      \n                      $\n                      1,315.9\n                      \n                  GAAP net income (loss) attributable to Intuitive Surgical, Inc.\n                      \n                      $\n                      292.5\n                      \n                      \n                      $\n                      292.5\n                      \n                      \n                      $\n                      (31.5\n                      )\n                      \n                      $\n                      1,127.9\n                      \n                      \n                      $\n                      670.9\n                      \n                  Share-based compensation expense\n                      \n                      70.4\n                      \n                      \n                      \n                      70.1\n                      \n                      \n                      \n                      55.6\n                      \n                      \n                      \n                      261.2\n                      \n                      \n                      \n                      209.1\n                      \n                      \n                  Intangible asset charges\n                      \n                      9.4\n                      \n                      \n                      \n                      9.0\n                      \n                      \n                      \n                      2.7\n                      \n                      \n                      \n                      31.6\n                      \n                      \n                      \n                      18.6\n                      \n                      \n                  Litigation charges (recoveries)\n                      \n                      —\n                      \n                      \n                      \n                      (1.8\n                      \n                      )\n                      \n                      (1.2\n                      \n                      )\n                      \n                      45.2\n                      \n                      \n                      \n                      25.3\n                      \n                      \n                  Impairment of investments\n                      \n                      1.2\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      1.2\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Tax adjustments (1)\n                      \n                      (20.3\n                      \n                      )\n                      \n                      (32.8\n                      \n                      )\n                      \n                      279.4\n                      \n                      \n                      \n                      (162.0\n                      \n                      )\n                      \n                      132.9\n                      \n                      \n                  Non-GAAP net income attributable to Intuitive Surgical, Inc.\n                      \n                      $\n                      353.2\n                      \n                      \n                      $\n                      337.0\n                      \n                      \n                      $\n                      305.0\n                      \n                      \n                      $\n                      1,305.1\n                      \n                      \n                      $\n                      1,056.8\n                      \n                  GAAP net income (loss) per share attributable to Intuitive Surgical, Inc. - diluted\n                      \n                      $\n                      2.45\n                      \n                      \n                      $\n                      2.45\n                      \n                      \n                      $\n                      (0.28\n                      )\n                      \n                      $\n                      9.49\n                      \n                      \n                      $\n                      5.77\n                      \n                  Effect of dilutive shares (2)\n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      0.02\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Share-based compensation expense\n                      \n                      0.59\n                      \n                      \n                      \n                      0.59\n                      \n                      \n                      \n                      0.47\n                      \n                      \n                      \n                      2.20\n                      \n                      \n                      \n                      1.80\n                      \n                      \n                  Intangible asset charges\n                      \n                      0.08\n                      \n                      \n                      \n                      0.08\n                      \n                      \n                      \n                      0.02\n                      \n                      \n                      \n                      0.27\n                      \n                      \n                      \n                      0.16\n                      \n                      \n                  Litigation charges (recoveries)\n                      \n                      —\n                      \n                      \n                      \n                      (0.02\n                      \n                      )\n                      \n                      (0.01\n                      \n                      )\n                      \n                      0.38\n                      \n                      \n                      \n                      0.22\n                      \n                      \n                  Impairment of investments\n                      \n                      0.01\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      —\n                      \n                      \n                      \n                      0.01\n                      \n                      \n                      \n                      —\n                      \n                      \n                  Tax adjustments (1)\n                      \n                      (0.17\n                      \n                      )\n                      \n                      (0.27\n                      \n                      )\n                      \n                      2.38\n                      \n                      \n                      \n                      (1.36\n                      \n                      )\n                      \n                      1.14\n                      \n                      \n                  Non-GAAP net income per share attributable to Intuitive Surgical, Inc. - diluted (2)\n                      \n                      $\n                      2.96\n                      \n                      \n                      $\n                      2.83\n                      \n                      \n                      $\n                      2.60\n                      \n                      \n                      $\n                      10.99\n                      \n                      \n                      $\n                      9.09\n                      \n                  (1) For the three months ended December 31, 2018, tax adjustments included: (a) excess tax benefits associated with share-based compensation arrangements of $(15.8) million, or $(0.13) per diluted share; (b) tax impact related to intra-entity transfers of non-inventory assets of $8.3 million, or $0.07 per diluted share; and (c) other tax adjustments effects determined by applying a calculated non-GAAP effective tax rate of $(12.8) million, or $(0.11) per diluted share.For the twelve months ended December 31, 2018, tax adjustments included: (a) excess tax benefits associated with share-based compensation arrangements of $(116.2) million, or $(0.98) per diluted share; (b) tax impact related to intra-entity transfers of non-inventory assets of $38.9 million, or $0.33 per diluted share; and (c) other tax adjustments effects determined by applying a calculated non-GAAP effective tax rate of $(84.7) million, or $(0.71) per diluted share.\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  (2) For purpose of calculating fourth quarter 2017 non-GAAP diluted net income per share, the number of shares used was 117.4 million, which included 5.2 million dilutive potential shares outstanding. These shares were excluded for purposes of calculating GAAP net loss per share, because including them would have been anti-dilutive due to the GAAP net loss incurred in the period.\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n  \n  \n  \n\n  \n    \n      Contact: Investor Relations(408) 523-2161\n              \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Intuitive Surgical, Inc."
    },
    {
        "title": "Intuitive Surgical Announces Preliminary Fourth Quarter and Full Year 2018 Results",
        "subtitle": "",
        "date": "Jan 9, 2019 9:05AM EST",
        "content": "SUNNYVALE, Calif., Jan. 09, 2019 (GLOBE NEWSWIRE) -- Intuitive Surgical, Inc. (\"Intuitive\") (Nasdaq:ISRG), the pioneer and a global technology leader in robotic-assisted, minimally invasive surgery, today announced certain unaudited preliminary fourth quarter and full year 2018 financial results ahead of its participation at the 37th Annual JP Morgan Healthcare Conference on January 9-10, 2019, in San Francisco, California.Financial and Operational HighlightsPreliminary ResultsThe Company expects revenue for the fourth quarter of 2018 of approximately $1.047 billion, an increase of approximately 17% compared with $0.892 billion for the fourth quarter of 2017. The Company expects 2018 revenue of approximately $3.724 billion, an increase of approximately 19% compared with $3.138 billion for 2017. These unaudited results are preliminary and prior to the completion of the Company's annual independent audit and therefore are subject to adjustment.Preliminary fourth quarter 2018 instrument and accessory revenue increased approximately 18% to approximately $539 million compared with $457 million for the fourth quarter of 2017. Preliminary full year 2018 instrument and accessory revenue increased approximately 20% to approximately $1.962 billion compared with $1.637 billion for 2017. Fourth quarter and full year 2018 instrument and accessory revenue growth was driven primarily by da Vinci procedure growth.Da Vinci procedures increased approximately 19% for the fourth quarter of 2018 compared with the fourth quarter of 2017. Approximately 1,037,000 surgical procedures were performed with the da Vinci Surgical System in 2018, an increase of approximately 18% compared with approximately 877,000 procedures performed in 2017. The growth in overall 2018 procedure volume was primarily driven by growth in U.S. general surgery procedures and worldwide urologic procedures. The Company expects total da Vinci procedures to grow approximately 13% to 17% in 2019.Preliminary fourth quarter 2018 da Vinci Surgical Systems revenue increased approximately 20% to approximately $341 million from $285 million for the fourth quarter of 2017. Preliminary systems revenue for 2018 increased approximately 21% to approximately $1.127 billion compared with $0.928 billion in 2017. The Company shipped 290 da Vinci Surgical Systems in the fourth quarter of 2018, compared with 216 systems in the fourth quarter of 2017. The fourth quarter 2018 da Vinci Surgical Systems shipments included 84 shipped under operating lease and usage-based arrangements, compared with 40 in the fourth quarter of 2017. The Company shipped 926 da Vinci Surgical Systems in 2018, compared with 684 systems in 2017.Preliminary fourth quarter 2018 service revenue of approximately $167 million increased approximately 11% compared with $150 million in the fourth quarter of 2017. Preliminary 2018 service revenue increased approximately 11% to approximately $635 million compared with $573 million in 2017.Commenting on the announcement, Gary Guthart, President and CEO of Intuitive, said, \"We are pleased with our fourth quarter procedure growth, system placements, and the financial results that follow. We are committed to advancing intelligent minimally invasive care through the combination of human understanding, smart systems and instruments, and digital insights.\"Additional unaudited preliminary revenue and procedure information has been posted to the Investor Relations section of the Intuitive website at: https://isrg.gcs-web.com/.The Company is scheduled to present at the 2019 JP Morgan Healthcare Conference on January 10, 2019, at 9:00 a.m. Pacific Time. The Company is scheduled to report its fourth quarter 2018 results during a conference call on January 24, 2019, at which point the Company will discuss the 2018 financial results in more detail. Dial-in and webcast access information for both of these events are also available in the Investor Relations section of the Intuitive website.About Intuitive Surgical, Inc.Intuitive Surgical, Inc. (Nasdaq:ISRG), headquartered in Sunnyvale, California, is the pioneer and a global technology leader in robotic-assisted, minimally invasive surgery. Intuitive develops, manufactures, and markets the da Vinci surgical system. The Company strives to make surgery more effective, less invasive, and easier on surgeons, patients, and their families.About the da Vinci Surgical SystemThere are several models of the da Vinci surgical system. The da Vinci surgical systems are designed to help surgeons perform minimally invasive surgery. Da Vinci systems offer surgeons high-definition 3D vision, a magnified view, and robotic and computer assistance. They use specialized instrumentation, including a miniaturized surgical camera and wristed instruments (i.e., scissors, scalpels, and forceps) that are designed to help with precise dissection and reconstruction deep inside the body.Da Vinci® is trademark of Intuitive Surgical, Inc. For more information, please visit the Company's website at www.intuitive.com/.Forward-Looking StatementsThis press release contains forward-looking statements, including statements regarding the Company's unaudited preliminary financial and operational results for the fourth quarter and full year 2018, expected procedure growth in 2019, the mission of the Intuitive Foundation, systems sales under the China National Health Commission quota, and the Company's commitment to advancing intelligent minimally invasive care through the combination of human understanding, smart systems and instruments, and digital insights. These forward-looking statements are necessarily estimates reflecting the best judgment of the Company's management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including, but not limited to, the following: completion of the Company's final closing procedures, final adjustments and other developments that may arise in the course of audit procedures; the uncertainty regarding the timing and extent of purchases of da Vinci Surgical Systems under the China National Health Commission quota, which may be adversely impacted by Provincial approvals in China, hospital tendering processes, tariffs assessed on certain medical equipment manufactured in the United States, and competitive products that will share the quota; the impact of global and regional economic and credit market conditions on healthcare spending; healthcare reform legislation in the United States and its impact on hospital spending, reimbursement and fees levied on certain medical device revenues; changes in hospital admissions and actions by payers to limit or manage surgical procedures; the timing and success of product development and market acceptance of developed products, including, but not limited to, the SP surgical system and 3rd generation stapling platform; the results of any collaborations, in-licensing arrangements, joint ventures, strategic alliances or partnerships; procedure counts; regulatory approvals, clearances and restrictions or any dispute that may occur with any regulatory body, including, but not limited to, the premarket notification to the FDA for the IonTM endoluminal system; guidelines and recommendations in the healthcare and patient communities; intellectual property positions and litigation; competition in the medical device industry and in the specific markets of surgery in which the Company operates; unanticipated manufacturing disruptions or the inability to meet demand for products; the results of legal proceedings to which the Company is or may become a party; product liability and other litigation claims; adverse publicity regarding the Company and the safety of the Company's products and adequacy of training; the Company's ability to expand into foreign markets; the impact of changes to tax legislation, guidance, and interpretations; changes in tariffs, trade barriers, and regulatory requirements; and other risk factors under the heading \"Risk Factors\" in the Company's report on Form 10-K for the year ended December 31, 2017, as updated by the Company's other filings with the Securities and Exchange Commission. Statements using words such as \"estimates,\" \"projects,\" \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"targeted\" and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. The Company undertakes no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law.Contact: Investor Relations(408) 523-2161   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Intuitive Surgical, Inc."
    }
]