[
    {
        "title": "JD.com Announces Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Mar 2, 2020 5:03AM EST",
        "content": "BEIJING, March  02, 2020  (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ: JD), China’s leading technology driven e-commerce company and retail infrastructure service provider, today announced its unaudited financial results for the quarter and the full year ended December 31, 2019.Fourth Quarter and Full Year 2019 Highlights“We achieved robust top-line growth for the fourth quarter as Chinese consumers increasingly associate the JD brand with trust and reliability,” said Richard Liu, Chairman and Chief Executive Officer of JD.com. “We also saw strong customer growth, especially in China’s lower-tier cities, driven by innovative marketing, superior product selection and better customer service.”Richard Liu continued, “Since late January, we’ve spared no effort in the fight against COVID-19 in China. Our leading supply chain and logistics network have been called upon to address unmet needs across China. We’ve been ensuring consumers’ livelihoods while partnering with public institutions to ensure access to emergency supplies. In Hubei, the epicenter of the outbreak, we have been providing medical supplies and facilitating relief organizations to maintain continuous supply to hospitals, in addition to rolling out a suite of innovations across our business to help the country. All of us at JD will continue working around the clock to help Chinese consumers, merchants and communities get through this challenging time.”“We are pleased to conclude 2019 with another strong set of results in the fourth quarter,” said Sidney Huang, Chief Financial Officer of JD.com. “The year 2019 sets a new milestone in our corporate history with record earnings and excellent cash flow on an annual basis as our continued investments in infrastructure and technology began to yield solid financial results. Our vertically integrated ecommerce model, resilient self-built logistics network and high level of consumer trust allow us to continue serving consumers effectively now and in the long term.”Business HighlightsEnvironment, Social and GovernanceJD RetailJD LogisticsEquity Investees Update Operational Metrics UpdateFourth Quarter 2019 Financial ResultsNet Revenues.  For the fourth quarter of 2019, JD.com reported net revenues of RMB170.7 billion (US$24.5 billion), representing a 26.6% increase from the same period in 2018. Net product revenues increased by 24.5%, while net service revenues increased by 43.6% for the fourth quarter of 2019, as compared to the same period of 2018.Cost of Revenues.  Cost of revenues increased by 26.8% to RMB146.7 billion (US$21.1 billion) for the fourth quarter of 2019 from RMB115.7 billion for the fourth quarter of 2018. This increase was primarily due to the growth of the company’s online direct sales business and the logistics services provided to third parties.Fulfillment Expenses.  Fulfillment expenses, which primarily include procurement, warehousing, delivery, customer service and payment processing expenses, increased by 24.1% to RMB11.0 billion (US$1.6 billion) for the fourth quarter of 2019 from RMB8.9 billion for the fourth quarter of 2018. Fulfillment expenses as a percentage of net revenues decreased to 6.4% for the fourth quarter of 2019, compared to 6.6% in the same period last year, mainly due to economies of scale from enhanced logistics capacity utilization and staff productivity.Marketing Expenses.  Marketing expenses increased by 29.5% to RMB8.2 billion (US$1.2 billion) for the fourth quarter of 2019 from RMB6.4 billion for the fourth quarter of 2018.Research and Development Expenses.  Research and development expenses increased to RMB3.6 billion (US$0.5 billion) for the fourth quarter of 2019 from RMB3.5 billion for the fourth quarter of 2018.General and Administrative Expenses.  General and administrative expenses increased to RMB1.5 billion (US$0.2 billion) for the fourth quarter of 2019 from RMB1.4 billion for the fourth quarter of 2018.Gain on Sale of Development Properties.  Gain on sale of development properties for the fourth quarter of 2019 was RMB0.8 billion (US$0.1 billion), which was part of the gain on sale of development properties to the Core Fund in relation to the previously disclosed February 2019 transaction.Income/(Loss) from Operations and Non-GAAP Income from Operations.  Income from operations for the fourth quarter of 2019 was RMB529.5 million (US$76.1 million), compared to loss from operations of RMB938.9 million for the same period last year. Non-GAAP income from operations for the fourth quarter of 2019 was RMB704.0 million (US$101.1 million), compared to RMB313.0 million for the fourth quarter of 2018. Operating margin of JD Retail before unallocated items for the fourth quarter of 2019 was 1.4%, compared to 1.1% for the fourth quarter of 2018.Non-GAAP EBITDA for the fourth quarter of 2019 was RMB2.0 billion (US$0.3 billion) with a non-GAAP EBITDA margin of 1.2%, as compared to RMB1.5 billion with a non-GAAP EBITDA margin of 1.1% for the fourth quarter of 2018.Others, net. Others are other non-operating income/(loss) including gains/(losses) from fair value change of long-term investments, gains from business and investment disposals, impairment of investments, government incentives, foreign exchange gains/(losses) and others. In the fourth quarter of 2019, other non-operating income was RMB3.6 billion (US$0.5 billion), compared with a loss of RMB4.0 billion for the fourth quarter of 2018. The substantial increase was primarily due to the increase of the fair value change of long-term investments, which had a gain of RMB4.2 billion (US$0.6 billion) for the fourth quarter of 2019, compared with a loss of RMB4.1 billion for the same period of last year.Net Income/(Loss) Attributable to Ordinary Shareholders and Non-GAAP Net Income Attributable to Ordinary Shareholders.  Net income attributable to ordinary shareholders for the fourth quarter of 2019 was RMB3.6 billion (US$0.5 billion), compared to net loss attributable to ordinary shareholders of RMB4.8 billion for the same period last year. Non-GAAP net income attributable to ordinary shareholders for the fourth quarter of 2019 was RMB810.7 million (US$116.5 million), compared to RMB749.9 million for the same period last year.Diluted EPS and Non-GAAP Diluted EPS.  Diluted net income per ADS for the fourth quarter of 2019 was RMB2.44 (US$0.35), compared to diluted net loss per ADS of RMB3.32 for the fourth quarter of 2018. Non-GAAP diluted net income per ADS for the fourth quarter of 2019 was RMB0.54 (US$0.08), as compared to RMB0.51 for the fourth quarter of 2018.Cash Flow and Working CapitalAs of December 31, 2019, the company’s cash and cash equivalents, restricted cash and short-term investments totaled RMB64.5 billion (US$9.3 billion), compared to RMB39.5 billion as of December 31, 2018. For the fourth quarter of 2019, free cash flow of the company was as follows:* Including logistics facilities and other real estate properties developed by the company’s property management group (“JD Property”), which may be sold under various equity structures. In the fourth quarter of 2019, approximately RMB2.5 billion proceeds from the sale of development properties were included in this line.    ** Including capital expenditures related to the company’s headquarters in Beijing and all other CAPEX.Net cash provided by investing activities was RMB2.5 billion (US$0.4 billion) for the fourth quarter of 2019, consisting primarily of the loans repaid by JD Digits. In addition, cash paid for capital expenditures in the fourth quarter of 2019 was RMB2.3 billion, offset by the proceeds from sale of development properties to the Core Fund of RMB2.5 billion.Net cash provided by financing activities was RMB3.1 billion (US$0.4 billion) for the fourth quarter of 2019, consisting primarily of cash received in the second closing of JD Health’s Series A financing.For working capital turnover days, see table under “Supplemental Financial Information and Business Metrics.”Full Year 2019 Financial ResultsNet Revenues.  For the full year of 2019, JD.com reported net revenues of RMB576.9 billion (US$82.9 billion), representing a 24.9% increase from the full year of 2018. Net product revenues increased by 22.7%, while net service revenues increased by 44.1% for the full year of 2019, as compared to the full year of 2018.Cost of Revenues.  Cost of revenues increased by 24.3% to RMB492.5 billion (US$70.7 billion) for the full year of 2019 from RMB396.1 billion for the full year of 2018. This increase was primarily due to the growth of the company’s online direct sales business and the logistics services provided to third parties.Fulfillment Expenses.  Fulfillment expenses, which primarily include procurement, warehousing, delivery, customer service and payment processing expenses, increased by 15.5% to RMB37.0 billion (US$5.3 billion) for the full year of 2019 from RMB32.0 billion for the full year of 2018. Fulfillment expenses as a percentage of net revenues was 6.4% for the full year of 2019, compared to 6.9% for the full year of 2018.Fulfilled Gross Margin5.  Fulfilled gross margin for the full year of 2019 was 8.2%, as compared to 7.3% for the full year of 2018.Marketing Expenses.  Marketing expenses increased by 15.6% to RMB22.2 billion (US$3.2 billion) for the full year of 2019 from RMB19.2 billion for the full year of 2018.Research and Development Expenses.  Research and development expenses increased by 20.4% to RMB14.6 billion (US$2.1 billion) for the full year of 2019 from RMB12.1 billion for the full year of 2018.General and Administrative Expenses.  General and administrative expenses increased by 6.4% to RMB5.5 billion (US$0.8 billion) for the full year of 2019 from RMB5.2 billion for the full year of 2018.Gain on Sale of Development Properties.  Gain on sale of development properties for the full year of 2019 was RMB3.9 billion (US$0.6 billion), consisting primarily of the gain on sale of development properties to the Core Fund.Income/(Loss) from Operations and Non-GAAP Income from Operations.  Income from operations for the full year of 2019 was RMB9.0 billion (US$1.3 billion), compared to loss from operations of RMB2.6 billion for the full year of 2018. Non-GAAP income from operations for the full year of 2019 increased by 364% to RMB8.9 billion (US$1.3 billion) with a non-GAAP operating margin of 1.5%, as compared to RMB1.9 billion for the full year of 2018 with a non-GAAP operating margin of 0.4%. Operating margin of JD Retail before unallocated items for the full year of 2019 was 2.5%, compared to 1.6% for the full year of 2018.Non-GAAP EBITDA for the full year of 2019 increased by 144% to RMB13.8 billion (US$2.0 billion) with a non-GAAP EBITDA margin of 2.4%, from RMB5.7 billion with a non-GAAP EBITDA margin of 1.2% for the full year of 2018.Others, net.  Other non-operating income for the full year of 2019 was RMB5.4 billion (US$0.8 billion), compared with RMB0.1 billion for the full year of 2018. The 2019 income was primarily attributable to gains from fair value change of long-term investments of RMB3.5 billion (US$0.5 billion) as well as various government incentives and gain on investment disposals.Net Income/(Loss) Attributable to Ordinary Shareholders and Non-GAAP Net Income Attributable to Ordinary Shareholders.  Net income attributable to ordinary shareholders for the full year of 2019 was RMB12.2 billion (US$1.8 billion), compared to net loss attributable to ordinary shareholders of RMB2.5 billion for the full year of 2018. Non-GAAP net income attributable to ordinary shareholders for the full year of 2019 increased by 211% to RMB10.7 billion (US$1.5 billion), compared to RMB3.5 billion for the full year of 2018.Diluted EPS and Non-GAAP Diluted EPS.  Diluted net income per ADS for the full year of 2019 was RMB8.21 (US$1.18), compared to diluted net loss per ADS of RMB1.73 for the full year of 2018. Non-GAAP diluted net income per ADS for the full year of 2019 was RMB7.25 (US$1.04) as compared to RMB2.35 for the full year of 2018.Cash Flow and Working CapitalFor the full year of 2019, free cash flow of the company was as follows:* Including logistics facilities and other real estate properties developed by JD Property, which may be sold under various equity structures. For the year ended December 31, 2019, approximately RMB7.9 billion proceeds from the sale of development properties were included in this line.** Including capital expenditures related to the company’s headquarters in Beijing and all other CAPEX.Net cash used in investing activities was RMB25.3 billion (US$3.6 billion) for the full year of 2019, consisting primarily of increase in short-term investments of RMB22.5 billion, prepayments and investments in equity investees and purchases investment securities of RMB11.3 billion, and cash paid for capital expenditures of RMB9.0 billion, partially offset by the proceeds from sale of development properties of RMB7.9 billion, cash received from disposals of equity investment and investment securities of RMB4.6 billion, and the loans settled by JD Digits of RMB4.1 billion.Net cash provided by financing activities was RMB2.6 billion (US$0.4 billion) for the full year of 2019, consisting primarily of cash received as part of JD Health’s Series A financing of RMB6.3 billion, partially offset by repayment of nonrecourse securitization debt of RMB3.9 billion.For working capital turnover days, see table under “Supplemental Financial Information and Business Metrics.”Full-Year Supplemental InformationThe table below sets forth the full year segment operating results:* New businesses of the company include logistics services provided to third parties, overseas business, technology initiatives, as well as asset management services to logistics property investors and sale of development properties by JD Property.JD Property develops and manages logistics facilities and other real estate properties. By leveraging its fund management platform, JD Property can realize development profits and recycle capital from mature properties to fund new developments and scale the business.** Unallocated items include share-based compensation, amortization of intangible assets resulting from assets and business acquisitions, effects of business cooperation arrangements, and impairment of goodwill and intangible assets, which are not allocated to segments.The table below sets forth the full year revenue information:First Quarter 2020 GuidanceNet revenues for the first quarter of 2020 are expected to grow at least 10% compared with the first quarter of 2019. This forecast reflects JD.com’s current and preliminary expectation, which is subject to change in light of uncertainties related to how COVID-19 develops.Conference CallJD.com’s management will hold a conference call at 7:00 am, Eastern Time on March 2, 2020 (8:00 pm, Beijing/Hong Kong Time on March 2, 2020) to discuss the fourth quarter and full year 2019 financial results.Listeners may access the call by dialing the following numbers:A telephone replay will be available from 10:00 am, Eastern Time on March 2, 2020 through 8:59 am, Eastern Time on March 10, 2020. The dial-in details are as follows:Additionally, a live and archived webcast of the conference call will also be available on the company’s investor relations website at http://ir.jd.com.About JD.com.JD.com is a leading technology driven e-commerce company transforming to become the leading supply chain based technology and service provider. The company’s cutting-edge retail infrastructure seeks to enable consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.Non-GAAP MeasuresIn evaluating the business, the company considers and uses non-GAAP measures, such as non-GAAP income/(loss) from operations, non-GAAP operating margin, non-GAAP net income/(loss) attributable to ordinary shareholders, non-GAAP net margin, free cash flow, non-GAAP EBITDA, non-GAAP EBITDA margin, non-GAAP net income/(loss) per share and non-GAAP net income/(loss) per ADS, as supplemental measures to review and assess operating performance. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). The company defines non-GAAP income/(loss) from operations as income/(loss) from operations excluding share-based compensation, amortization of intangible assets resulting from assets and business acquisitions, effects of business cooperation arrangements, gain on sale of development properties and impairment of goodwill and intangible assets. The company defines non-GAAP net income/(loss) attributable to ordinary shareholders as net income/(loss) attributable to ordinary shareholders excluding share-based compensation, amortization of intangible assets resulting from assets and business acquisitions, effects of business cooperation arrangements and non-compete agreements, gain/(loss) on disposals/deemed disposals of investments, reconciling items on the share of equity method investments, loss/(gain) from fair value change of long-term investments, impairment of goodwill, intangible assets and investments, gain and foreign exchange impact in relation to sale of development properties and tax effects on non-GAAP adjustments. The company defines free cash flow as operating cash flow adjusting the impact from JD Baitiao receivables included in the operating cash flow and capital expenditures, net of the proceeds from sale of development properties. Capital expenditures include purchase of property, equipment and software, cash paid for construction in progress, purchase of intangible assets and land use rights. The company defines non-GAAP EBITDA as non-GAAP income/(loss) from operations plus depreciation and amortization excluding amortization of intangible assets resulting from assets and business acquisitions. Non-GAAP basic net income/(loss) per share is calculated by dividing non-GAAP net income/(loss) attributable to ordinary shareholders by the weighted average number of ordinary shares outstanding during the periods. Non-GAAP diluted net income/(loss) per share is calculated by dividing non-GAAP net income/(loss) attributable to ordinary shareholders by the weighted average number of ordinary shares and dilutive potential ordinary shares outstanding during the periods, including the dilutive effect of share-based awards as determined under the treasury stock method. Non-GAAP net income/(loss) per ADS is equal to non-GAAP net income/(loss) per share multiplied by two.The company presents these non-GAAP financial measures because they are used by management to evaluate operating performance and formulate business plans. Non-GAAP income/(loss) from operations, non-GAAP net income/(loss) attributable to ordinary shareholders and non-GAAP EBITDA reflect the company’s ongoing business operations in a manner that allows more meaningful period-to-period comparisons. Free cash flow enables management to assess liquidity and cash flow while taking into account the impact from JD Baitiao receivables included in the operating cash flow and the demands that the expansion of fulfillment infrastructure and technology platform has placed on financial resources. The company also believes that the use of the non-GAAP financial measures facilitates investors to understand and evaluate the company’s current operating performance and future prospects in the same manner as management does, if they so choose. The company also believes that the non-GAAP financial measures provide useful information to both management and investors by excluding certain expenses, gain/loss and other items that are not expected to result in future cash payments or that are non-recurring in nature or may not be indicative of the company's core operating results and business outlook.The non-GAAP financial measures have limitations as analytical tools. The company’s non-GAAP financial measures do not reflect all items of income and expense that affect the company’s operations or not represent the residual cash flow available for discretionary expenditures. Further, these non-GAAP measures may differ from the non-GAAP information used by other companies, including peer companies, and therefore their comparability may be limited. The company compensates for these limitations by reconciling the non-GAAP financial measures to the nearest U.S. GAAP performance measure, all of which should be considered when evaluating performance. The company encourages you to review the company’s financial information in its entirety and not rely on a single financial measure.CONTACTS:Investor RelationsRuiyu LiSenior Director of Investor Relations+86 (10) 8912-6805IR@JD.comMedia+86 (10) 8911-6155Press@JD.com Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. Among other things, the business outlook and quotations from management in this announcement, as well as JD.com's strategic and operational plans, contain forward-looking statements. JD.com may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission (the “SEC”), in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about JD.com's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: JD.com's growth strategies; its future business development, results of operations and financial condition; its ability to attract and retain new customers and to increase revenues generated from repeat customers; its expectations regarding demand for and market acceptance of its products and services; trends and competition in China's e-commerce market; changes in its revenues and certain cost or expense items; the expected growth of the Chinese e-commerce market; Chinese governmental policies relating to JD.com's industry and general economic conditions in China. Further information regarding these and other risks is included in JD.com's filings with the SEC. All information provided in this press release and in the attachments is as of the date of this press release, and JD.com undertakes no obligation to update any forward-looking statement, except as required under applicable law.1 The U.S. dollar (US$) amounts disclosed in this press release, except for those transaction amounts that were actually settled in U.S. dollars, are presented solely for the convenience of the readers. The conversion of Renminbi (RMB) into US$ in this press release is based on the exchange rate set forth in the H.10 statistical release of the Board of Governors of the Federal Reserve System as of December 31, 2019, which was RMB6.9618 to US$1.00. The percentages stated in this press release are calculated based on the RMB amounts.2 See the sections entitled “Non-GAAP Measures” and “Unaudited Reconciliation of GAAP and Non-GAAP Results” for more information about the non-GAAP measures referred to in this press release.3 Annual active customer accounts are customer accounts that made at least one purchase during the twelve months ended on the respective dates, whether through online direct sales or online marketplaces.4 Mobile monthly active users in a given month are the number of unique mobile devices that were used to visit JD mobile app at least once during that month.5 Fulfilled gross margin is calculated by dividing fulfilled gross profit by net revenues. Fulfilled gross profit is defined as the difference between net revenues and the total amount of cost of revenues and fulfillment expenses."
    },
    {
        "title": "JD.com Chief Financial Officer Sidney Huang to Retire in September 2020",
        "subtitle": "",
        "date": "Mar 2, 2020 5:03AM EST",
        "content": "BEIJING, March  02, 2020  (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ: JD), China’s leading technology driven e-commerce company and retail infrastructure service provider, today announced that Sidney Huang, Chief Financial Officer of JD.com, will retire in September 2020. Sandy Xu, currently Senior Vice President of JD.com and CFO of JD Retail, will succeed Mr. Huang as the Chief Financial Officer of JD.com and report to Richard Liu, Chairman and Chief Executive Officer. Mr. Huang will begin the process of handing the CFO role over to Ms. Xu beginning in June, leaving ample time for a seamless transition until Sidney's retirement in September. Mr. Huang will also serve as a senior consultant to the company following his retirement.“Sidney has served as our CFO over the past six and a half years as JD.com grew revenue over 7 times from RMB 69 billion in 2013 to RMB 577 billion in 2019, and achieved important milestones including our successful IPO in the US and the remarkable expansion of our business scope,” said Richard Liu, Chairman and Chief Executive Officer of JD.com. “As CFO, Sidney has enhanced the value of JD.com by continuously improving our financial management system, providing deep insights and effective support for our business development, and establishing confidence in JD among the investor community. His leadership, integrity, fairness and professional expertise have made tremendous contributions to JD.com, earning respect and commendation throughout the company. I am deeply grateful that JD has had Sidney to help overcome the many challenges we have faced. We have offered a retirement plan for Sidney and his family, and we wish him all the best in his well-deserved retirement.\"“Sidney has designed a detailed succession plan to transition his responsibilities to Sandy. As CFO of JD Retail, Sandy has contributed significantly to both the business and finance functions, demonstrating a clear understanding of our business and strong leadership,” Mr. Liu continued. “With her impressive professional experience and broad international perspective, I am confident that she will be a great CFO for JD.com going forward.”“It’s truly been a privilege for me to have served JD.com through some of its most exciting and rewarding years, and I now look forward to spending more time with my family and on other personal interests,” said Mr. Huang. “I have much gratitude for Richard for his trust and support during the years we’ve worked together, and I feel fortunate to have worked with so many highly talented JD colleagues. I am also delighted to have known and worked closely with Sandy since she joined JD. With her deep professional experience and understanding of the company, Sandy is clearly the ideal person to take over the CFO role.”Sandy Xu currently serves as Senior Vice President of JD.com. She oversees group finance, accounting and tax functions in addition to serving as the CFO of JD Retail where she has played a critical role in improving JD Retail’s financial and operational performance in 2019. Prior to joining JD.com in July 2018, Sandy was an audit partner at PricewaterhouseCoopers and had nearly 20 years’ experience at PricewaterhouseCoopers in its Beijing and San Jose offices, focusing on the TMT industry and U.S. capital markets. Sandy was a Certified Public Accountant in both China and the United States. She received her bachelor’s degree with double majors in information science and economics from Peking University. About JD.com, Inc.  JD.com is a leading technology driven e-commerce company transforming to become the leading supply chain based technology and service provider. The company’s cutting-edge retail infrastructure seeks to enable consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as “will,” “expects,” “anticipates,” “future,” “intends,” “plans,” “believes,” “estimates,” “confident” and similar statements. Among other things, the quotations from management in this announcement contain forward-looking statements. JD.com may also make written or oral forward-looking statements in its periodic reports to the SEC, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about JD.com’s beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: JD.com’s growth strategies; its future business development, results of operations and financial condition; its ability to attract and retain new customers and to increase revenues generated from repeat customers; its expectations regarding demand for and market acceptance of its products and services; trends and competition in China’s e-commerce market; changes in its revenues and certain cost or expense items; the expected growth of the Chinese e-commerce market; Chinese governmental policies relating to JD.com’s industry and general economic conditions in China. Further information regarding these and other risks is included in JD.com’s filings with the SEC. All information provided in this press release and in the attachments is as of the date of this press release, and JD.com undertakes no obligation to update any forward-looking statement, except as required under applicable law.For investor and media inquiries, please contact:Investor Relations Ruiyu Li +86 (10) 8912-6804 IR@JD.comMedia Relations +86 (10) 8911-6155 Press@JD.com "
    },
    {
        "title": "JD.com to Report Fourth Quarter and Full Year 2019 Financial Results on March 2, 2020",
        "subtitle": "",
        "date": "Feb 20, 2020 6:00AM EST",
        "content": "BEIJING, Feb.  20, 2020  (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ: JD), China’s leading technology driven e-commerce company and retail infrastructure service provider, today announced that it plans to release its unaudited fourth quarter and full year 2019 financial results on Monday, March 2, 2020, before the market opens. JD.com’s management will hold a conference call at 7:00 am, Eastern Time on March 2, 2020, (8:00 pm, Beijing/Hong Kong Time on March 2, 2020) to discuss the fourth quarter and full year 2019 financial results.Listeners may access the call by dialing the following numbers:   Passcode: 3837306A telephone replay will be available from 10:00 am, Eastern Time on March 2, 2020 through 8:59 am, Eastern Time on March 10, 2020. The dial-in details are as follows:   Passcode: 3837306Additionally, a live and archived webcast of the conference call will also be available on the Company’s investor relations website at http://ir.jd.com.About JD.com, Inc.JD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.For investor and media inquiries, please contact:Investor Relations Ruiyu Li +86 (10) 8912-6804IR@JD.comMedia Relations+86 (10) 8911-6155Press@JD.com"
    },
    {
        "title": "JD.com Announces Pricing of US$1.0 Billion Notes Offering",
        "subtitle": "",
        "date": "Jan 7, 2020 4:10PM EST",
        "content": "BEIJING, Jan.  07, 2020  (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ: JD), China’s leading technology driven e-commerce company and retail infrastructure service provider, today announced the pricing of its public offering of US$1.0 billion aggregate principal amount of its notes. The public offering consists of US$700.0 million of 3.375% notes due 2030 and US$300.0 million of 4.125% notes due 2050. The notes have been registered under the U.S. Securities Act of 1933, as amended, and are expected to be listed on the Singapore Exchange Securities Trading Limited.The Company expects to receive net proceeds from the offering of approximately US$988.3 million, after deducting underwriting discounts and commissions and estimated offering expenses. The Company intends to use the net proceeds from the offering for general corporate purposes and refinancing.The joint bookrunners of the offering are BofA Securities, Inc. and UBS AG Hong Kong Branch.The Company has an automatic shelf registration statement on Form F-3 (including a base prospectus) on file with the U.S. Securities and Exchange Commission (the “SEC”) and has filed a related preliminary prospectus supplement with the SEC for the offering of the notes. When available, the final prospectus supplement for the offering of the notes will be filed with the SEC. The offering is being made only by means of the prospectus supplement and accompanying base prospectus. Before you invest, you should read the prospectus supplement and accompanying base prospectus and other documents that the Company has filed with the SEC for more complete information about the Company and the offering. You may obtain these documents free of charge by visiting EDGAR on the SEC website at www.sec.gov. Alternatively, the Company, any underwriter or any dealer participating in the offering will arrange to send an investor the prospectus if the investor requests it by calling BofA Securities, Inc. toll-free at +1 (800) 294-1322 and UBS Securities LLC at +1 (203) 719-1088.This announcement is not an offer of the securities for sale in the United States and shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. The securities referred to herein have not been and will not be registered under the applicable securities laws of any jurisdiction outside of the United States.About JD.com JD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.Safe Harbor Statement This announcement contains forward-looking statements. These statements are made under the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as “will,” “expects,” “anticipates,” “future,” “intends,” “plans,” “believes,” “estimates,” “confident” and similar statements. Among other things, the description of the proposed offering in this announcement contain forward-looking statements. JD.com may also make written or oral forward-looking statements in its periodic reports to the SEC, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about JD.com’s beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: JD.com’s growth strategies; its future business development, results of operations and financial condition; its ability to attract and retain new customers and to increase revenues generated from repeat customers; its expectations regarding demand for and market acceptance of its products and services; trends and competition in China’s e-commerce market; changes in its revenues and certain cost or expense items; the expected growth of the Chinese e-commerce market; Chinese governmental policies relating to JD.com’s industry and general economic conditions in China. Further information regarding these and other risks is included in JD.com’s filings with the SEC. All information provided in this press release and in the attachments is as of the date of this press release, and JD.com undertakes no obligation to update any forward-looking statement, except as required under applicable law.Contacts Investor RelationsRuiyu LiSenior Director of Investor Relations+86 (10) 8912-6805IR@JD.comMedia+86 (10) 8911-6155Press@JD.com "
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Advanced Micro Devices, Beyond Meat, JD.Com, or Square?",
        "subtitle": "",
        "date": "Nov 15, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 15, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, AMD, BYND, JD, and SQ.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-advanced-micro-devices-beyond-meat-jdcom-or-square-300959142.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "JD.com Announces Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Nov 15, 2019 4:58AM EST",
        "content": "BEIJING, Nov.  15, 2019  (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ: JD), China’s leading technology driven e-commerce company and retail infrastructure service provider, today announced its unaudited financial results for the quarter ended September 30, 2019.Third Quarter 2019 Highlights“JD’s commitment to providing consumers with the best possible online shopping experience drove another strong quarter of growth,” said Richard Liu, Chairman and Chief Executive Officer of JD.com. “In particular, more and more consumers in China’s fast-growing lower-tier cities are turning to JD for our superior value and service. We will continue to invest in technology and innovation to meet the growing needs of Chinese consumers and businesses for fast and reliable e-commerce and supply chain solutions.”“JD saw excellent results for the third quarter marked by accelerating revenue growth and record operating profit margin,” said Sidney Huang, Chief Financial Officer of JD.com. “Customer growth also remained solid, reflecting our commitment to becoming China’s top source for quality products at everyday low prices, supported by world class operating efficiency. Looking forward, we will increasingly benefit from the economies of scale inherent in JD’s unique business model through our leading supply chain, technology and service capabilities.”Business HighlightsJD RetailJD LogisticsJD HealthJD PropertyEnvironment, Social and GovernanceEquity Investees UpdateOperational Metrics UpdateThird Quarter 2019 Financial ResultsNet Revenues.  For the third quarter of 2019, JD.com reported net revenues of RMB134.8 billion (US$18.9 billion), representing a 28.7% increase from the same period in 2018. Net product revenues increased by 26.6%, while net service revenues increased by 47.0% in the third quarter of 2019, as compared to the third quarter of 2018.Cost of Revenues.  Cost of revenues increased by 29.4% to RMB114.7 billion (US$16.1 billion) in the third quarter of 2019 from RMB88.7 billion in the third quarter of 2018. This increase was primarily due to the growth of the company’s online direct sales business and the logistics services provided to third parties.Fulfillment Expenses.  Fulfillment expenses, which primarily include procurement, warehousing, delivery, customer service and payment processing expenses, increased by 12.8% to RMB8.8 billion (US$1.2 billion) in the third quarter of 2019 from RMB7.8 billion in the third quarter of 2018. Fulfillment expenses as a percentage of net revenues decreased to 6.5% in the third quarter of 2019, compared to 7.4% in the same period last year, mainly due to economies of scale from enhanced logistics capacity utilization and staff productivity.Marketing Expenses.  Marketing expenses increased by 7.6% to RMB4.4 billion (US$0.6 billion) in the third quarter of 2019 from RMB4.1 billion in the third quarter of 2018.Technology and Content Expenses.  Technology and content expenses increased to RMB3.6 billion (US$0.5 billion) in the third quarter of 2019 from RMB3.4 billion in the third quarter of 2018.General and Administrative Expenses.  General and administrative expenses decreased to RMB1.3 billion (US$0.2 billion) in the third quarter of 2019 from RMB1.4 billion in the third quarter of 2018.Gain on Disposals of Long-Lived Assets.  Gain on disposals of long-lived assets for the third quarter of 2019 was RMB3.0 billion (US$0.4 billion), which was the gain on disposals of logistics facilities to Core Fund.Income/(Loss) from Operations and Non-GAAP Income from Operations.  Income from operations for the third quarter of 2019 was RMB5.0 billion (US$0.7 billion), compared to loss from operations of RMB0.7 billion for the same period last year. Non-GAAP income from operations for the third quarter of 2019 was RMB3.0 billion (US$0.4 billion) with a non-GAAP operating margin of 2.2%, as compared to RMB0.6 billion in the third quarter of 2018 with a non-GAAP operating margin of 0.6%.Non-GAAP EBITDA for the third quarter of 2019 was RMB4.2 billion (US$0.6 billion) with a non-GAAP EBITDA margin of 3.1%, as compared to RMB1.7 billion with a non-GAAP EBITDA margin of 1.6% for the third quarter of 2018.Net Income Attributable to Ordinary Shareholders and Non-GAAP Net Income Attributable to Ordinary Shareholders.  Net income attributable to ordinary shareholders for the third quarter of 2019 was RMB612.3 million (US$85.7 million), compared to RMB3.0 billion for the same period last year. Non-GAAP net income attributable to ordinary shareholders for the third quarter of 2019 was RMB3.1 billion (US$0.4 billion), compared to RMB1.2 billion for the same period last year.Diluted EPS and Non-GAAP Diluted EPS.  Diluted net income per ADS for the third quarter of 2019 was RMB0.41 (US$0.06), compared to RMB2.03 for the third quarter of 2018. Non-GAAP diluted net income per ADS for the third quarter of 2019 was RMB2.08 (US$0.29), as compared to RMB0.80 for the third quarter of 2018. Cash Flow and Working CapitalAs of September 30, 2019, the company’s cash and cash equivalents, restricted cash and short-term investments totaled RMB59.2 billion (US$8.3 billion), compared to RMB39.5 billion as of December 31, 2018. For the third quarter of 2019, free cash flow of the company was as follows:* Including logistics facilities and other real estate properties developed by the company’s property management group, which may be disposed under various equity structures. In the third quarter of 2019, approximately RMB2.9 billion proceeds from the sale of logistics assets were included in this line.** Including capital expenditures related to the company’s headquarters in Beijing and all other capital expenditures.Net cash used in investing activities was RMB5.7 billion (US$0.8 billion) for the third quarter of 2019, consisting primarily of increase in investments in equity investees and short-term loans to JD Digits. In addition, cash paid for capital expenditures in the third quarter of 2019 was RMB2.8 billion, offset by the net cash consideration of RMB2.9 billion received in relation to the disposals of development projects to Core Fund.Net cash provided by financing activities was RMB2.5 billion (US$0.3 billion) for the third quarter of 2019, consisting primarily of cash received as part of JD Health’s Series A financing.For the twelve months ended September 30, 2019, free cash flow of the company was as follows:Supplemental InformationThe table below sets forth the three months segment operating results:* New Businesses of the company include technology initiatives, overseas business and logistics services provided to third parties.** Unallocated items are consistent with non-GAAP adjustments and include revenue from business cooperation arrangements with equity investees, share-based compensation, effects of business cooperation arrangements, gain on disposals of long-lived assets, and impairment of goodwill and intangible assets, which are not allocated to segments.The table below sets forth the revenue information for the third quarter of 2019:Fourth Quarter 2019 GuidanceNet revenues for the fourth quarter of 2019 are expected to be between RMB163 billion and RMB168 billion, representing a growth rate between 21% and 25% compared with the fourth quarter of 2018. This forecast reflects JD.com’s current and preliminary expectation, which is subject to change.Conference CallJD.com’s management will hold a conference call at 7:00 am, Eastern Time on November 15, 2019, (8:00 pm, Beijing/Hong Kong Time on November 15, 2019) to discuss the third quarter 2019 financial results.Listeners may access the call by dialing the following numbers:A telephone replay will be available from 9:00 am, Eastern Time on November 15, 2019 through 07:59 am, Eastern Time on November 23, 2019. The dial-in details are as follows:Additionally, a live and archived webcast of the conference call will also be available on the company’s investor relations website at http://ir.jd.com.About JD.com.JD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.Non-GAAP MeasuresIn evaluating the business, the company considers and uses non-GAAP measures, such as non-GAAP income/(loss) from operations, non-GAAP operating margin, non-GAAP net income/(loss) attributable to ordinary shareholders, non-GAAP net margin, free cash flow, non-GAAP EBITDA, non-GAAP EBITDA margin, non-GAAP net income/(loss) per share and non-GAAP net income/(loss) per ADS, as supplemental measures to review and assess operating performance. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). The company defines non-GAAP income/(loss) from operations as income/(loss) from operations excluding share-based compensation, amortization of intangible assets resulting from assets and business acquisitions, effects of business cooperation arrangements, gain on disposals of long-lived assets and impairment of goodwill and intangible assets. The company defines non-GAAP net income/(loss) attributable to ordinary shareholders as net income/(loss) attributable to ordinary shareholders excluding share-based compensation, amortization of intangible assets resulting from assets and business acquisitions, effects of business cooperation arrangements and non-compete agreements, gain/(loss) on disposals/deemed disposals of investments, reconciling items on the share of equity method investments, loss/(gain) from fair value change of long-term investments, impairment of goodwill, intangible assets and investments, gain and foreign exchange impact in relation to disposals of long-lived assets and tax effects on non-GAAP adjustments. The company defines free cash flow as operating cash flow adjusting the impact from JD Baitiao receivables included in the operating cash flow and capital expenditures, net of proceeds from disposals of long-lived assets. Capital expenditures include purchase of property, equipment and software, cash paid for construction in progress, purchase of intangible assets and land use rights. The company defines non-GAAP EBITDA as non-GAAP income/(loss) from operations plus depreciation and amortization excluding amortization of intangible assets resulting from assets and business acquisitions. Non-GAAP basic net income/(loss) per share is calculated by dividing non-GAAP net income/(loss) attributable to ordinary shareholders by the weighted average number of ordinary shares outstanding during the periods. Non-GAAP diluted net income/(loss) per share is calculated by dividing non-GAAP net income/(loss) attributable to ordinary shareholders by the weighted average number of ordinary shares and dilutive potential ordinary shares outstanding during the periods, including the dilutive effect of share-based awards as determined under the treasury stock method. Non-GAAP net income/(loss) per ADS is equal to non-GAAP net income/(loss) per share multiplied by two.The company presents these non-GAAP financial measures because they are used by management to evaluate operating performance and formulate business plans. Non-GAAP income/(loss) from operations, non-GAAP net income/(loss) attributable to ordinary shareholders and non-GAAP EBITDA reflect the company’s ongoing business operations in a manner that allows more meaningful period-to-period comparisons. Free cash flow enables management to assess liquidity and cash flow while taking into account the impact from JD Baitiao receivables included in the operating cash flow and the demands that the expansion of fulfillment infrastructure and technology platform has placed on financial resources. The company also believes that the use of the non-GAAP financial measures facilitates investors to understand and evaluate the company’s current operating performance and future prospects in the same manner as management does, if they so choose. The company also believes that the non-GAAP financial measures provide useful information to both management and investors by excluding certain expenses, gain/loss and other items that are not expected to result in future cash payments or that are non-recurring in nature or may not be indicative of the company's core operating results and business outlook. The non-GAAP financial measures have limitations as analytical tools. The company’s non-GAAP financial measures do not reflect all items of income and expense that affect the company’s operations or not represent the residual cash flow available for discretionary expenditures. Further, these non-GAAP measures may differ from the non-GAAP information used by other companies, including peer companies, and therefore their comparability may be limited. The company compensates for these limitations by reconciling the non-GAAP financial measures to the nearest U.S. GAAP performance measure, all of which should be considered when evaluating performance. The company encourages you to review the company’s financial information in its entirety and not rely on a single financial measure.CONTACTS:Investor RelationsRuiyu LiSenior Director of Investor Relations+86 (10) 8912-6805IR@JD.comMedia+86 (10) 8911-6155Press@JD.com Safe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. Among other things, the business outlook and quotations from management in this announcement, as well as JD.com's strategic and operational plans, contain forward-looking statements. JD.com may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission (the “SEC”), in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about JD.com's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: JD.com's growth strategies; its future business development, results of operations and financial condition; its ability to attract and retain new customers and to increase revenues generated from repeat customers; its expectations regarding demand for and market acceptance of its products and services; trends and competition in China's e-commerce market; changes in its revenues and certain cost or expense items; the expected growth of the Chinese e-commerce market; Chinese governmental policies relating to JD.com's industry and general economic conditions in China. Further information regarding these and other risks is included in JD.com’s filings with the SEC. All information provided in this press release and in the attachments is as of the date of this press release, and JD.com undertakes no obligation to update any forward-looking statement, except as required under applicable law.   ___________________1 The U.S. dollar (US$) amounts disclosed in this press release, except for those transaction amounts that were actually settled in U.S. dollars, are presented solely for the convenience of the readers. The conversion of Renminbi (RMB) into US$ in this press release is based on the exchange rate set forth in the H.10 statistical release of the Board of Governors of the Federal Reserve System as of September 30, 2019, which was RMB7.1477 to US$1.00. The percentages stated in this press release are calculated based on the RMB amounts.2 See the sections entitled “Non-GAAP Measures” and “Unaudited Reconciliation of GAAP and Non-GAAP Results” for more information about the non-GAAP measures referred to in this press release.3 Annual active customer accounts are customer accounts that made at least one purchase during the twelve months ended on the respective dates, through either online direct sales or online marketplaces.4 Mobile monthly active users in a given month are the number of unique mobile devices that were used to visit JD mobile app at least once during that month."
    },
    {
        "title": "JD.com to Report Third Quarter 2019 Financial Results on November 15, 2019",
        "subtitle": "",
        "date": "Oct 30, 2019 6:00AM EDT",
        "content": "BEIJING, Oct.  30, 2019  (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ: JD), China’s leading technology driven e-commerce company and retail infrastructure service provider, today announced that it plans to release its unaudited third quarter 2019 financial results on Friday, November 15, 2019, before the market opens.JD.com’s management will hold a conference call at 7:00 am, Eastern Time on November 15, 2019, (8:00 pm, Beijing/Hong Kong Time on November 15, 2019) to discuss the third quarter 2019 financial results.Listeners may access the call by dialing the following numbers:   Passcode: 2508598A telephone replay will be available from 9:00 am, Eastern Time on November 15, 2019 through 07:59 am, Eastern Time on November 23, 2019. The dial-in details are as follows:   Passcode: 2508598Additionally, a live and archived webcast of the conference call will also be available on the Company’s investor relations website at http://ir.jd.com.About JD.com, Inc.JD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.For investor and media inquiries, please contact:Investor Relations Ruiyu Li +86 (10) 8912-6804IR@JD.comMedia Relations+86 (10) 8911-6155Press@JD.com"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Dova Pharmaceuticals, JD.Com, Nike, or Wells Fargo?",
        "subtitle": "",
        "date": "Sep 30, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 30, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, DOVA, JD, NKE, and WFC.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-dova-pharmaceuticals-jdcom-nike-or-wells-fargo-300927649.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Canopy Growth, Deciphera Pharmaceuticals, Genworth Financial, JD.Com, or Tilray?",
        "subtitle": "",
        "date": "Aug 13, 2019 9:31AM EDT",
        "content": "NEW YORK, Aug. 13, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CGC, DCPH, GNW, JD, and TLRY.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-canopy-growth-deciphera-pharmaceuticals-genworth-financial-jdcom-or-tilray-300900787.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "InvestorsObserver releases stock and option data on Bank of America, Facebook, JD.com, Qualcomm, and Sea Ltd.",
        "subtitle": "",
        "date": "May 23, 2019 9:31AM EDT",
        "content": "NEW YORK, May 23, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BAC, FB, JD, QCOM, and SE.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/investorsobserver-releases-stock-and-option-data-on-bank-of-america-facebook-jdcom-qualcomm-and-sea-ltd-300855908.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Ford, GoPro, JD.com, or Lyft?",
        "subtitle": "",
        "date": "May 10, 2019 9:31AM EDT",
        "content": "NEW YORK, May 10, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, F, GPRO, JD, and LYFT.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment. View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-ford-gopro-jdcom-or-lyft-300848023.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "JD.com, Inc. Files Its Annual Report on Form 20-F",
        "subtitle": "",
        "date": "Apr 15, 2019 8:54AM EDT",
        "content": "BEIJING, April 15, 2019 (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ:JD), China's leading technology driven e-commerce company and retail infrastructure service provider, today announced it filed its annual report on Form 20-F for the fiscal year ended December 31, 2018 with the Securities and Exchange Commission on April 15, 2019 U.S. Eastern Time. The annual report can be accessed on the Company's investor relations website at http://ir.jd.com.The Company will provide a copy of its annual report containing the audited consolidated financial statements, free of charge, to its shareholders and ADS holders upon request. Requests should be directed to Investor Relations, JD.com, Inc., 20th Floor, Building A, No. 18 Kechuang 11 Street, Yizhuang Economic and Technological Development Zone, Daxing District, Beijing 101111, People's Republic of China.About JD.com, Inc.JD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.ContactsInvestor RelationsRuiyu LiSenior Director of Investor Relations+86 (10) 8912-6805IR@JD.comMedia+86 (10) 8911-6155Press@JD.comSource: JD.com"
    },
    {
        "title": "JD.com’s Chief Technology Officer Appointed To New Role",
        "subtitle": "",
        "date": "Mar 15, 2019 4:31AM EDT",
        "content": "BEIJING, March 15, 2019 (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ:JD), China's leading technology driven e-commerce company and retail infrastructure service provider, today announced that Mr. Chen Zhang will be appointed to a new role as a senior advisor based in the United States and will depart from his full time role as the Chief Technology Officer of JD.com effective June 30, 2019. The company will announce a succession plan in the future.Richard Liu, Chairman and Chief Executive Officer of JD.com, said, \"We appreciate Chen's valuable contribution and leadership since he joined, and we are pleased to appoint Chen to his new role. We wish him and his family all the best during this time. The company will continue to further strengthen our research and development into the coming year.\"Zhang shared, \"I am grateful to be a member of the executive leadership team, and it has been my privilege to serve as JD.com's Chief Technology Officer during a period of transformational growth. Due to personal and family reasons, I am unfortunately no longer able to work in China on a full-time basis but delighted to provide support to the Company as an advisor abroad.\"About JD.com.JD.com is a leading technology driven e-commerce Company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.Contacts:Investor RelationsRuiyu LiSenior Director of Investor Relations+86 (10) 8912-6805IR@JD.comMedia+86 (10) 8911-6155Press@JD.comSafe Harbor StatementThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. Among other things, the business outlook and quotations from management in this announcement, as well as JD.com's strategic and operational plans, contain forward-looking statements. JD.com may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission (the \"SEC\"), in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about JD.com's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: JD.com's growth strategies; its future business development, results of operations and financial condition; its ability to attract and retain new customers and to increase revenues generated from repeat customers; its expectations regarding demand for and market acceptance of its products and services; trends and competition in China's e-commerce market; changes in its revenues and certain cost or expense items; the expected growth of the Chinese e-commerce market; Chinese governmental policies relating to JD.com's industry and general economic conditions in China. Further information regarding these and other risks is included in JD.com's filings with the SEC. All information provided in this press release and in the attachments is as of the date of this press release, and JD.com undertakes no obligation to update any forward-looking statement, except as required under applicable law.Source: JD.com"
    },
    {
        "title": "Mellanox Propels JD Cloud to New Levels of Performance and Efficiency",
        "subtitle": "",
        "date": "Mar 4, 2019 8:30AM EST",
        "content": "E-Commerce Giant's Cloud Computing Platform Leverages ConnectX 25G Ethernet NIC Advanced Offloads to Support More Customers in their Data CenterSAN FRANCISCO--(BUSINESS WIRE)-- RSA Conference 2019— Mellanox® Technologies, Ltd. (NASDAQ:MLNX), a leading supplier of high-performance, end-to-end interconnect solutions for data center servers and storage systems, today announced that JD Cloud, a full-service cloud computing platform and integrated cloud service provider from China's E-commerce giant JD.com (NASDAQ:JD), has adopted Mellanox ConnectX adapters with advanced offloads to improve performance, efficiency, security and reduce cost of their data center. JD Cloud worked closely with Mellanox and the Linux kernel community to develop pioneering new capabilities based on Accelerated Switching and Packet Processing (ASAP2) technology supported by the ConnectX series of Ethernet network adapters. By leveraging ConnectX adapters with ASAP2, JD.com was able to develop cloud native applications, network function virtualization, and distributed security with unmatched performance and efficiency.ASAP2 significantly boosts the efficiency of Software-Defined Networking (SDN), Network Function Virtualization (NFV), and cloud deployments. The solution combines the performance and efficiency of Mellanox networking hardware accelerators with the flexibility of server based virtual switching to deliver software-defined networks that perform with the highest total infrastructure efficiency, deployment flexibility and operational simplicity. JD Cloud and Mellanox co-designed the most advanced connection tracking feature of the ASAP2 acceleration technology, and will open-source the code to Linux community. This is a fundamental technology that accelerates stateful software defined applications such as firewalls, load-balancers, and intrusion detection and prevention systems. The deployment of this advanced ASAP2 technology allows JD.com to serve more customers, more efficiently, and more cost-effectively than previously possible.\"Stateful connection tracking in hardware is quite challenging. JD Cloud and Mellanox worked closely to co-design and implement this feature based on Mellanox's ASAP2 technology. Now we achieve excellent network performance and deliver a better user experience to our customers,\" said Gang He, corporate vice president of JD Group and head of JD Cloud product development. \"By offloading network packet processing, ASAP2 technology frees up the CPU, so that it no longer needs to handle every data packet. Instead, almost all CPU cycles become available to run applications. The net result is that our customers see better and more predictable performance for their applications workloads, while simultaneously achieving better security, scalability, efficiency, and cost savings.\"\"Total infrastructure efficiency, operational simplicity and deployment flexibility were the guiding principles for designing ASAP2,\" said Amir Prescher, senior vice president of business development and end user sales, Mellanox Technologies. \"Working with the JD Cloud development team, we were able to unlock the potential of our networking technology, and improve both performance and efficiency of the JD cloud data center. The result is that JD Cloud is able deliver a better customer experience while simultaneously reducing costs.\"\"This deployment of hardware accelerated virtual switching in the cloud confirms the needs as expressed in our recent Efficient Data Center survey,\" said Scott Raynovich, founder and chief analyst, Futuriom. \"IT managers and cloud architects cited overcoming virtualization performance penalties as their biggest challenge. Using advanced NICs such as those from Mellanox that offload the CPU and accelerate virtualization and security processing is the key to achieving penalty-free performance.\"The new generation of SDN, NFV and cloud-native computing technologies are pushing the limits of application instances that can be packed efficiently, securely and quickly on virtualized and containerized server infrastructure. In addition, the co-existence of multiple microservices, applications, and tenants - necessitates a more efficient underlying network fabric. Hypervisor based virtual switching and routing software has enabled agility and flexibility, however has suffered from poor performance, poor scalability, and high CPU overhead within the server. These problems get worse as cloud infrastructures migrate from 10 Gb/s networking connectivity to 25 and 100 Gb/s, required for increasingly data and I/O intensive applications.The Mellanox ASAP2 solution addresses these challenges head-on, by offloading virtual switch data path operations to the ConnectX NICs and BlueField SmartNICs. Both of these product families have pipelined, programmable hardware accelerators to perform intelligent flow processing and connection tracking at scale. With Mellanox connection tracking security technology, protecting the host from attacks is done at wire speed. Furthermore to simplify deployment, the acceleration is transparent - and the virtual switch control plane, SDN controller interface, and cloud management platforms, all remain unchanged. ASAP2 optimizes network application performance by streamlining I/O operations, in the most cost-effective manner possible with minimal CPU impact. This enables customers to maximize resources to run application workloads, instead of network I/O processing.Demonstrations at RSA 2019 Conference, San Francisco, CAMarch 4-7, 2019Visit Mellanox at booth 4528 to learn about the benefits of Mellanox 10/25/40/50/100/200 Gb/s networking solutions with ASAP2 to secure your data centers.Supporting Resources:About MellanoxMellanox Technologies (NASDAQ:MLNX) is a leading supplier of end-to-end Ethernet and InfiniBand smart interconnect solutions and services for servers and storage. Mellanox interconnect solutions increase data center efficiency by providing the highest throughput and lowest latency, delivering data faster to applications, unlocking system performance and improving data security. Mellanox offers a choice of fast interconnect products: adapters, switches, software and silicon that accelerate application performance and maximize business results for a wide range of markets including cloud and hyperscale, high performance computing, artificial intelligence, enterprise data centers, cyber security, storage, financial services and more. More information is available at: http://www.mellanox.com/About JD CloudJD Cloud is JD.com's full-service cloud computing platform and integrated cloud service provider. It houses the world's leading technologies and a wealth of cloud computing solutions. JD Cloud offers full stack services ranging from IaaS and PaaS to SaaS. It also provides a full spectrum services from IDC and cloud computing services to integrated offerings and services spanning several industries. JD Cloud covers Public Cloud, Private Cloud, Hybrid Cloud and Dedicated Cloud. It delivers a comprehensive range of cloud computing services including infrastructure building, strategic consulting, and business platforms development and operation.View source version on businesswire.com: https://www.businesswire.com/news/home/20190304005342/en/Source: Mellanox Technologies, Ltd."
    },
    {
        "title": "Farfetch and JD.com Expand Strategic Partnership to Build the Premier Luxury Gateway to China",
        "subtitle": "",
        "date": "Feb 28, 2019 3:00AM EST",
        "content": "LONDON & BEIJING--(BUSINESS WIRE)-- Farfetch Limited (NYSE:FTCH), the leading global technology platform for the luxury fashion industry and JD.com (NASDAQ:JD), China's largest retailer, today announced the expansion of their strategic partnership in order to provide the ‘Premier Luxury Gateway to China' for luxury brands.Under the agreement, Toplife will merge into Farfetch China. In addition, Farfetch will gain a ‘Level 1' entry point on the JD.com app, providing JD.com's 300 million customers with instant access to more than 3,000 brands via Farfetch's network of more than 1,000 luxury brand and boutique partners.The partnership builds on the existing successful relationship between Farfetch and JD.com, started in July 2017. Since then, Farfetch has leveraged JD.com's logistics capabilities in China, as well as JD.com's insights into the behaviors of China's luxury consumers. JD is one of Farfetch's largest shareholders.Farfetch has strengthened its China business through its agreement to acquire CuriosityChina, a leading integrated marketing and social commerce company. Through this expanded agreement with JD.com, Farfetch will offer the full suite of Farfetch's technology and logistics platform to brands wanting to reach luxury consumers in China, which accounts for significant growth in the luxury industry1.Luxury is an integral component of JD Fashion. As a key player in China's luxury market, JD has been working directly with luxury brands to offer an end-to-end luxury shopping experience, from customer service to logistics, with luxury warehousing and ‘white glove' delivery via JD Luxury Express. It has also pioneered omnichannel luxury partnerships. Several top brands have made their official e-commerce luxury debut with JD. Going forward, JD will continue to expand its direct partnerships with luxury brands.José Neves, Founder, CEO and Co-Chairman, Farfetch said: \"We are delighted to build on our relationship with JD.com, and bring to market an unrivalled solution for luxury brands to succeed in the Chinese market. We believe our Level 1 access with JD.com \"closes the circle\" and will be transformational for the luxury industry's digital landscape in China. With this agreement, and our previous strategic investments in China including our acquisition of CuriosityChina, we now offer luxury brands a one-stop solution to develop their digital strategies in accessing the engaged and sophisticated audience in this important market. Today we mark the launch of what I believe is the Premier Luxury Gateway to China.\"Jon Liao, Chief Strategy Officer of JD.com, said \"This win-win collaboration is a key development in our ongoing relationship with Farfetch. We are combining the best of global and local market expertise in the luxury segment. This is an important step for JD.com in developing its global fashion and luxury ecosystem. In just over a year of operation, Toplife has worked with many of the world's top brands, and has grown to become the platform of choice among China's discerning luxury consumers and brands. Luxury is an integral part of our fashion offering, and we are excited to work together with Farfetch to create the ultimate destination for luxury shopping in China.\"_______________1 Bain \"Altagamma 2018 Worldwide Luxury Market Monitor - The Future of Luxury: A Look into Tomorrow to Understand Today (November 2018)\"ENDSAbout FarfetchFarfetch Limited is the leading global technology platform for the luxury fashion industry. Founded in 2007 by José Neves for the love of fashion, and launched in 2008, Farfetch began as an e-commerce marketplace for luxury boutiques around the world. Today the Farfetch.com Marketplace connects customers in over 190 countries with items from more than 50 countries and over 1,000 of the world's best brands, boutiques and department stores, delivering a truly unique shopping experience and access to the most extensive selection of luxury on a single platform. Through its business units, which also include Store of The Future, Farfetch Black & White Solutions, Browns, and Stadium Goods, Farfetch continues to invest in innovation and develop key technologies, business solutions, and services for the luxury fashion industry.For more information, please visit www.farfetch.com.About JD.comJD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.View source version on businesswire.com: https://www.businesswire.com/news/home/20190228005311/en/Source: Farfetch Limited"
    },
    {
        "title": "JD.com to Report Fourth Quarter and Full Year 2018 Financial Results on February 28, 2019",
        "subtitle": "",
        "date": "Feb 15, 2019 5:30AM EST",
        "content": "BEIJING, Feb. 15, 2019 (GLOBE NEWSWIRE) -- JD.com, Inc. (NASDAQ:JD), China's leading technology driven e-commerce company and retail infrastructure service provider, today announced that it plans to release its unaudited fourth quarter and full year 2018 financial results on Thursday, February 28, 2019, before the market opens.JD.com's management will hold a conference call at 7:00 am, Eastern Time on February 28, 2019, (8:00 pm, Beijing/Hong Kong Time on February 28, 2019) to discuss the fourth quarter and full year 2018 financial results.Listeners may access the call by dialing the following numbers:\n  \n\n  \n    \n      US:\n                  +1-845-675-0437 or +1-866-519-4004\n              Hong Kong:\n                      +852-3018-6771 or 800-906-601\n                  China:\n                      400-6208-038 or 800-8190-121\n                  International:\n                      +65-6713-5090\n                  \n  \n  Passcode: 2707999A telephone replay will be available from 10:30 am, Eastern Time on February 28, 2019 through 07:59 am, Eastern Time on March 7, 2019. The dial-in details are as follows:\n  \n\n  \n    \n      US:\n                  +1-855-452-5696 or +1-646-254-3697\n              International:\n                      +61-2-8199-0299\n                  \n  \n  Passcode: 2707999Additionally, a live and archived webcast of the conference call will also be available on the Company's investor relations website at http://ir.jd.com.About JD.com, Inc.JD.com is a leading technology driven e-commerce company and retail infrastructure service provider in China. Its cutting-edge retail infrastructure enables consumers to buy whatever they want, whenever and wherever they want it. The company has opened its technology and infrastructure to partners, brands and other sectors, as part of its Retail as a Service offering to help drive productivity and innovation across a range of industries. JD.com is the largest retailer in China, a member of the NASDAQ100 and a Fortune Global 500 company.For investor and media inquiries, please contact:Investor RelationsRuiyu Li+86 (10) 8912-6804IR@JD.comMedia Relations+86 (10) 8911-6155 (China)Press@JD.comSource: JD.com"
    }
]