[
    {
        "title": "For the First Time Ever, PLANTERS Launches New Cheez Balls Flavors, Including Blazin’ Hot",
        "subtitle": "",
        "date": "Feb 14, 2020 3:58PM EST",
        "content": "\nPLANTERS White Cheddar and Nacho Cheez Balls also are among new flavors \n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nFor the first time ever, PLANTERS is launching all new flavors of everyone’s favorite 90s treat, Cheez Balls!\n\nJust in time for the upcoming basketball madness, PLANTERS is giving fans a flavor slam dunk with new White Cheddar, Nacho and Blazin’ Hot Cheez Balls! Whether fans are feeling extra cheezy or want to bring some heat to their taste buds, these Cheezballin’ snacks are a new twist on the classic neon orange goodness fans know and love.\n\n“There has been incredible excitement around the return of PLANTERS Cheez Balls over the past few years,” said Samantha Hess, brand manager for PLANTERS. “We know fans love the cheezy flavor of Cheez Balls, but they also crave new and interesting flavor options. We created these new versions to give fans what they want, and we can’t wait for America to get their cheezy hands on them.”\n\nPLANTERS White Cheddar and Nacho Cheez Balls are available nationwide now. Blazin’ Hot Cheez Balls will start scorching the snack aisle beginning May 2020. A fourth new flavor, Jalapeno Cheddar Cheez Balls, will be available nationally later this year.\n\nFor more information on Cheez Balls or other PLANTERS products, visit Planters.com. Fans can also find the latest about Baby Nut on Twitter (@MrPeanut).\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200214005486/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nlynne.galia@kraftheinz.com\n\nTaylor Higgins\nICF Next\n312-577-1773\ntaylor.higgins@icfnext.com\nSource: Kraft Heinz Company"
    },
    {
        "title": "The Kraft Heinz Company Declares Regular Quarterly Dividend of $0.40 Per Share",
        "subtitle": "",
        "date": "Feb 13, 2020 7:10AM EST",
        "content": "    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nThe Board of Directors of The Kraft Heinz Company (Nasdaq: KHC) today unanimously declared a regular quarterly dividend of $0.40 per share of common stock payable on March 27, 2020, to stockholders of record as of March 13, 2020.\n\nToday’s dividend declaration is the Board’s confirmation of their confidence in the turnaround plan being led by CEO Miguel Patricio and the team he has now put in place. The Board and the Management Team believe that maintaining a strong payout is an important commitment to shareholders of the company, particularly during this important period of transformation. The Company also expects to reduce leverage as it repositions itself for sustainable growth and returns.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (Nasdaq: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit www.kraftheinzcompany.com or follow us on LinkedIn and Twitter.\n\nForward-Looking Statements\n\nThis press release contains a number of forward-looking statements. Words such as “commit,” “plan,” \"believe,\" \"anticipate,\" \"reflect,\" \"invest,\" \"make,\" \"expect,\" \"deliver,\" “develop,” \"drive,\" \"assess,\" \"evaluate,\" “establish,” “focus,” “build,” “turn,” “expand,” “leverage,” \"grow,\" \"remain,\" \"will,\" and variations of such words and similar future or conditional expressions are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements regarding the Company's plans, costs and cost savings, legal matters, taxes, expectations, investments, innovations, opportunities, capabilities, execution, initiatives, pipeline, and growth. These forward-looking statements are not guarantees of future performance and are subject to a number of risks and uncertainties, many of which are difficult to predict and beyond the Company's control.\n\nImportant factors that may affect the Company's business and operations and that may cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, operating in a highly competitive industry; the Company’s ability to correctly predict, identify, and interpret changes in consumer preferences and demand, to offer new products to meet those changes, and to respond to competitive innovation; changes in the retail landscape or the loss of key retail customers; changes in the Company's relationships with significant customers, suppliers and other business relationships; the Company’s ability to maintain, extend, and expand its reputation and brand image; the Company’s ability to leverage its brand value to compete against private label products; the Company’s ability to drive revenue growth in its key product categories, increase its market share, or add products that are in faster-growing and more profitable categories; product recalls or product liability claims; unanticipated business disruptions; the Company’s ability to identify, complete or realize the benefits from strategic acquisitions, alliances, divestitures, joint ventures or other investments; the Company’s ability to realize the anticipated benefits from prior or future streamlining actions to reduce fixed costs, simplify or improve processes, and improve its competitiveness; the Company’s ability to successfully execute its strategic initiatives; the impacts of the Company’s international operations; economic and political conditions in the United States and in various other nations where the Company does business; changes in the Company’s management team or other key personnel and the Company’s ability to hire or retain key personnel or a highly skilled and diverse global workforce; risks associated with information technology and systems, including service interruptions, misappropriation of data or breaches of security; impacts of natural events in the locations in which we or the Company’s customers, suppliers, distributors, or regulators operate; the Company’s ownership structure; the Company’s indebtedness and ability to pay such indebtedness, as well as its ability to comply with covenants under debt instruments; additional impairments of the carrying amounts of goodwill or other indefinite-lived intangible assets; foreign exchange rate fluctuations; volatility in commodity, energy, and other input costs; volatility in the market value of all or a portion of the commodity derivatives we use; increased pension, labor and people-related expenses; compliance with laws, regulations, and related interpretations and related legal claims or other regulatory enforcement actions, including additional risks and uncertainties related to any potential actions resulting from the Securities and Exchange Commission’s (“SEC”) ongoing investigation, as well as potential additional subpoenas, litigation, and regulatory proceedings; an inability to remediate the material weaknesses in the Company’s internal control over financial reporting or additional material weaknesses or other deficiencies in the future or the failure to maintain an effective system of internal controls; the Company’s failure to prepare and timely file its periodic reports; the restatement of certain of the Company’s previously issued consolidated financial statements, which resulted in unanticipated costs and may affect investor confidence and raise reputational issues; the Company’s ability to protect intellectual property rights; tax law changes or interpretations; the impact of future sales of the Company's common stock in the public markets; the Company’s ability to continue to pay a regular dividend and the amounts of any such dividends; volatility of capital markets and other macroeconomic factors; and other factors. For additional information on these and other factors that could affect the Company's forward-looking statements, see the Company's risk factors, as they may be amended from time to time, set forth in its filings with the SEC. The Company disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200213005227/en/\nMichael Mullen (media)\nMichael.Mullen@kraftheinz.com\n\nChristopher Jakubik, CFA (investors)\nir@kraftheinzcompany.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Kraft Heinz Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Feb 13, 2020 7:01AM EST",
        "content": "    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nThe Kraft Heinz Company (Nasdaq: KHC) (“Kraft Heinz” or the “Company”) today reported fourth quarter and full year 2019 financial results.\n\n“While our 2019 results were disappointing, we closed the year with performance consistent with our expectations, and driven by factors we anticipated,” said Kraft Heinz CEO Miguel Patricio. \"We have taken critical actions over the past six months to re-establish visibility and control over the business. And we remain convinced Kraft Heinz has the potential to achieve best-in-class financial performance as we begin transforming our capabilities and making necessary investments in our brands based on deep consumer insights. Our turnaround will take time, but we expect to make significant progress in 2020, laying a strong foundation for future growth.”\n\nQ4 2019 Financial Summary\n\nNet sales were $6.5 billion, down 5.1 percent versus the year-ago period, including a negative 2.3 percentage point impact from divestitures and an unfavorable 0.6 percentage point impact from currency. Organic Net Sales(1) decreased 2.2 percent versus the year-ago period. Pricing increased 2.0 percentage points versus the prior year period, with higher pricing in all business segments except Canada. Volume/mix decreased 4.2 percentage points, primarily driven by volume/mix declines in the United States and, to a lesser extent, Rest of World markets that more than offset growth in Canada and EMEA.\n\nNet income attributable to common shareholders increased to $182 million and diluted EPS increased to $0.15, primarily reflecting lower non-cash impairment charges recognized in the current year period. The current period included approximately $453 million of non-cash impairment charges to lower the carrying amount of goodwill in the Company’s Australia & New Zealand, as well as Latin America Exports businesses, as well as non-cash impairment charges of approximately $213 million to lower the carrying amount of the Maxwell House trademark. Adjusted EBITDA decreased 6.6 percent versus the year-ago period to $1.6 billion, including an unfavorable 1.3 percentage point impact from currency and a negative 1.5 percentage point impact from divestitures. Excluding these factors, growth in the United States and EMEA was more than offset by higher supply chain costs in Rest of World markets, higher general corporate expenses, and lower pricing versus the prior year period in Canada. Adjusted EPS decreased 14.3 percent to $0.72, reflecting lower Adjusted EBITDA, a higher effective tax rate, and higher stock-based compensation versus the prior year period.\n\nQ4 2019 Business Segment Highlights\n\nUnited States\n\nUnited States net sales were $4.7 billion, down 2.7 percent versus the year-ago period. Pricing increased 3.1 percentage points, reflecting a combination of higher list prices in several categories, including price increases to reflect higher key commodity(2) costs for dairy and meats, as well as a favorable impact from promotional timing versus the prior year, and reduced promotional intensity compared to the year-ago period. Volume/mix decreased 5.8 percentage points, primarily due to lower shipments of cheese, coffee, cold cuts, and bacon that more than offset growth in condiments and sauces as well as foodservice. The decreases reflect volume declines in response to higher prices, including prior year promotional activities that were not repeated, as well as lower distribution in cold cuts and frozen categories at select retailers.\n\nUnited States Segment Adjusted EBITDA increased 1.6 percent versus the year-ago period to $1.3 billion, driven by higher pricing, lower procurement and logistics costs, as well as lower variable compensation versus the prior year. This more than offset unfavorable impacts from volume/mix and key commodity cost inflation, specifically in dairy and meats, as well as higher manufacturing costs.\n\nCanada\n\nCanada net sales were $457 million, 23.8 percent lower than the year-ago period, including a negative 21.4 percentage point impact from the Canadian natural cheese divestiture and a favorable 0.1 percentage point impact from currency. Organic Net Sales decreased 2.5 percent versus the year-ago period. Pricing declined 5.0 percentage points, reflecting unfavorable trade expense versus the prior year and increased holiday-related promotional activity across several categories. Volume/mix increased 2.5 percent, driven by consumption-led growth in peanut butter and pasta sauce that more than offset lower shipments for cheese and ongoing weakness in coffee.\n\nCanada Segment Adjusted EBITDA decreased 26.1 percent versus the year-ago period to $116 million, including a negative 14.8 percentage point impact from a divestiture and a 0.2 percentage point favorable impact from currency. Excluding the impact of these factors, the decrease versus prior year was due to lower pricing, as well as unfavorable dairy and procurement costs versus the prior year period.\n\nEMEA\n\nEMEA net sales were $689 million, down 0.5 percent versus the year-ago period, due to a negative 0.8 percentage point impact from currency. Organic Net Sales increased 0.3 percent versus the year-ago period. Pricing was slightly favorable as gains from pricing initiatives, particularly in the UK, more than offset lower pricing versus the prior year in Russia. Volume/mix increased 0.2 percentage points, reflecting condiments and sauces growth in Russia, as well as foodservice growth across most regions that more than offset ongoing weakness in infant nutrition and the impact of reduced promotional activity versus the year-ago period in the UK.\n\nEMEA Segment Adjusted EBITDA increased 6.3 percent versus the year-ago period to $182 million, despite a negative 1.4 percentage point impact from currency. Excluding currency, Segment Adjusted EBITDA increased 7.7 percent, from a combination of Organic Net Sales growth and lower variable compensation versus the prior year period.\n\nRest of World(3)\n\nRest of World net sales of $708 million decreased 10.1 percent versus the year-ago period, including a negative 5.2 percentage point impact from currency and a negative 3.3 percentage point impact from the India nutritional beverages divestiture. Organic Net Sales decreased 1.6 percent versus the year-ago period. Pricing increased 0.7 percentage points, due to higher pricing in Latin America and China that more than offset lower pricing in Australia. Volume/mix decreased 2.3 percentage points, as growth in Indonesia and Brazil was more than offset by lower shipments across several categories in Australia and New Zealand as well as lower shipments in Latin American exports, including Colombia and Puerto Rico.\n\nRest of World Segment Adjusted EBITDA decreased 53.9 percent versus the year-ago period to $60 million, including an 8.0 percentage point unfavorable impact from currency and a 0.3 percentage point unfavorable impact from divestiture. Results also included approximately $35 million of costs not expected to repeat, due to $15 million of higher labor-related expenses associated with the Holidays Act in New Zealand as well as $20 million of asset- and inventory-related write-offs in Australia, New Zealand, and Latin America. Excluding these factors, the decline in Segment Adjusted EBITDA was driven by ongoing supply chain cost inflation and lower volume/mix.\n\nEnd Notes\n\nWebcast, Conference Call, and Filing Information\n\nA webcast of The Kraft Heinz Company's fourth quarter and full year 2019 earnings conference call will be available at ir.kraftheinzcompany.com. The call begins today at 8:30 a.m. Eastern Standard Time.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (Nasdaq: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2019 net sales of approximately $25 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit www.kraftheinzcompany.com or follow us on LinkedIn and Twitter.\n\nForward-Looking Statements\n\nThis press release contains a number of forward-looking statements. Words such as “commit,” “plan,” \"believe,\" \"anticipate,\" \"reflect,\" \"invest,\" \"make,\" \"expect,\" \"deliver,\" “develop,” \"drive,\" \"assess,\" \"evaluate,\" “establish,” “focus,” “build,” “turn,” “expand,” “leverage,” \"grow,\" \"remain,\" \"will,\" and variations of such words and similar future or conditional expressions are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements regarding the Company's plans, costs and cost savings, legal matters, taxes, expectations, investments, innovations, opportunities, capabilities, execution, initiatives, pipeline, and growth. These forward-looking statements are not guarantees of future performance and are subject to a number of risks and uncertainties, many of which are difficult to predict and beyond the Company's control.\n\nImportant factors that may affect the Company's business and operations and that may cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, operating in a highly competitive industry; the Company’s ability to correctly predict, identify, and interpret changes in consumer preferences and demand, to offer new products to meet those changes, and to respond to competitive innovation; changes in the retail landscape or the loss of key retail customers; changes in the Company's relationships with significant customers, suppliers and other business relationships; the Company’s ability to maintain, extend, and expand its reputation and brand image; the Company’s ability to leverage its brand value to compete against private label products; the Company’s ability to drive revenue growth in its key product categories, increase its market share, or add products that are in faster-growing and more profitable categories; product recalls or product liability claims; unanticipated business disruptions; the Company’s ability to identify, complete or realize the benefits from strategic acquisitions, alliances, divestitures, joint ventures or other investments; the Company’s ability to realize the anticipated benefits from prior or future streamlining actions to reduce fixed costs, simplify or improve processes, and improve its competitiveness; the Company’s ability to successfully execute its strategic initiatives; the impacts of the Company’s international operations; economic and political conditions in the United States and in various other nations where the Company does business; changes in the Company’s management team or other key personnel and the Company’s ability to hire or retain key personnel or a highly skilled and diverse global workforce; risks associated with information technology and systems, including service interruptions, misappropriation of data or breaches of security; impacts of natural events in the locations in which we or the Company’s customers, suppliers, distributors, or regulators operate; the Company’s ownership structure; the Company’s indebtedness and ability to pay such indebtedness, as well as its ability to comply with covenants under debt instruments; additional impairments of the carrying amounts of goodwill or other indefinite-lived intangible assets; foreign exchange rate fluctuations; volatility in commodity, energy, and other input costs; volatility in the market value of all or a portion of the commodity derivatives we use; increased pension, labor and people-related expenses; compliance with laws, regulations, and related interpretations and related legal claims or other regulatory enforcement actions, including additional risks and uncertainties related to any potential actions resulting from the Securities and Exchange Commission’s (“SEC”) ongoing investigation, as well as potential additional subpoenas, litigation, and regulatory proceedings; an inability to remediate the material weaknesses in the Company’s internal control over financial reporting or additional material weaknesses or other deficiencies in the future or the failure to maintain an effective system of internal controls; the Company’s failure to prepare and timely file its periodic reports; the restatement of certain of the Company’s previously issued consolidated financial statements, which resulted in unanticipated costs and may affect investor confidence and raise reputational issues; the Company’s ability to protect intellectual property rights; tax law changes or interpretations; the impact of future sales of the Company's common stock in the public markets; the Company’s ability to continue to pay a regular dividend and the amounts of any such dividends; volatility of capital markets and other macroeconomic factors; and other factors. For additional information on these and other factors that could affect the Company's forward-looking statements, see the Company's risk factors, as they may be amended from time to time, set forth in its filings with the SEC. The Company disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.\n\nNon-GAAP Financial Measures\n\nThe non-GAAP financial measures provided should be viewed in addition to, and not as an alternative for, results prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”) that are presented in this press release.\n\nTo supplement the financial information, the Company has presented Organic Net Sales, Adjusted EBITDA, Constant Currency Adjusted EBITDA, and Adjusted EPS, which are considered non-GAAP financial measures. The non-GAAP financial measures presented may differ from similarly titled non-GAAP financial measures presented by other companies, and other companies may not define these non-GAAP financial measures in the same way. These measures are not substitutes for their comparable GAAP financial measures, such as net sales, net income/(loss), diluted earnings per share, or other measures prescribed by GAAP, and there are limitations to using non-GAAP financial measures.\n\nManagement uses these non-GAAP financial measures to assist in comparing the Company's performance on a consistent basis for purposes of business decision making by removing the impact of certain items that management believes do not directly reflect the Company's underlying operations. Management believes that presenting the Company's non-GAAP financial measures (i.e., Organic Net Sales, Adjusted EBITDA, Constant Currency Adjusted EBITDA, and Adjusted EPS) is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items, (ii) permits investors to view performance using the same tools that management uses to budget, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating the Company's results. The Company believes that the presentation of these non-GAAP financial measures, when considered together with the corresponding GAAP financial measures and the reconciliations to those measures, provides investors with additional understanding of the factors and trends affecting the Company's business than could be obtained absent these disclosures.\n\nOrganic Net Sales is defined as net sales excluding, when they occur, the impact of currency, acquisitions and divestitures, and a 53rd week of shipments. The Company calculates the impact of currency on net sales by holding exchange rates constant at the previous year's exchange rate, with the exception of highly inflationary subsidiaries, for which the Company calculates the previous year's results using the current year's exchange rate. Organic Net Sales is a tool that can assist management and investors in comparing the Company's performance on a consistent basis by removing the impact of certain items that management believes do not directly reflect the Company's underlying operations.\n\nAdjusted EBITDA is defined as net income/(loss) from continuing operations before interest expense, other expense/(income), provision for/(benefit from) income taxes, and depreciation and amortization (excluding integration and restructuring expenses); in addition to these adjustments, the Company excludes, when they occur, the impacts of integration and restructuring expenses, deal costs, unrealized losses/(gains) on commodity hedges, impairment losses, and equity award compensation expense (excluding integration and restructuring expenses). The Company also presents Adjusted EBITDA on a constant currency basis. The Company calculates the impact of currency on Adjusted EBITDA by holding exchange rates constant at the previous year's exchange rate, with the exception of highly inflationary subsidiaries, for which it calculates the previous year's results using the current year's exchange rate. Adjusted EBITDA and Constant Currency Adjusted EBITDA are tools that can assist management and investors in comparing the Company's performance on a consistent basis by removing the impact of certain items that management believes do not directly reflect the Company's underlying operations.\n\nAdjusted EPS is defined as diluted earnings per share excluding, when they occur, the impacts of integration and restructuring expenses, deal costs, unrealized losses/(gains) on commodity hedges, impairment losses, losses/(gains) on the sale of a business, other losses/(gains) related to acquisitions and divestitures (e.g., tax and hedging impacts), nonmonetary currency devaluation (e.g., remeasurement gains and losses), debt prepayment and extinguishment costs, and U.S. Tax Reform discrete income tax expense/(benefit), and including when they occur, adjustments to reflect preferred stock dividend payments on an accrual basis. The Company believes Adjusted EPS provides important comparability of underlying operating results, allowing investors and management to assess operating performance on a consistent basis.\n\nSee the attached schedules for supplemental financial data, which includes the financial information, the non-GAAP financial measures and corresponding reconciliations to the comparable GAAP financial measures for the relevant periods.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200213005226/en/\nMichael Mullen (media)\nMichael.Mullen@kraftheinz.com \n\nChristopher Jakubik, CFA (investors)\nir@kraftheinz.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Kraft Launches Big Bowls of Mac & Cheese Ahead of Valentine’s Day, so Parents Can Get Kids Fed, Get Them to Bed and Get It On",
        "subtitle": "",
        "date": "Feb 5, 2020 7:00AM EST",
        "content": "\nEven More Noodles & Cheese to Make a Deliciously Easy Dinner in Just 3.5 Minutes\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nValentine’s Day should be the most romantic holiday of the year, but some parents admit that kids put a wedge in candlelit dinners and alone time. In fact, 86% of parents want to get intimate with their partner this Valentine’s Day but claim children will prevent 1 out of 4 of them from actually getting it on*. That’s why Kraft Macaroni & Cheese is giving parents a chance to win new Big Bowls before they hit stores nationwide.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200205005113/en/(Photo: Business Wire)\nNew Kraft Macaroni & Cheese Big Bowls have even more of your favorite mac & cheese to make a deliciously cheesy and easy dinner in just three and a half minutes – just add water.\n\n“We decided to launch our new Kraft Big Bowls early to give parents what they really want on Valentine’s Day, some time to get it on, “said Kelsey Cooperstein, Brand Manager at Kraft Heinz. “Kraft Big Bowls is an easy and kid-pleasing dinner solution with even more cheese and noodles than our microwavable Easy Mac cups, so parents can put their kids to bed and enjoy a night of romance.”\n\nStarting today, parents can visit http://www.kraftmacisforlovers.com to enter for a chance to win Kraft Macaroni & Cheese Big Bowls in time for Valentine’s Day. Along with the Kraft Macaroni & Cheese Big Bowls, parents will receive some romantic goodies which includes candles, rose petals and a card – all in the spirit of getting kids to bed and setting the mood for parents.\n\nKraft Macaroni & Cheese Big Bowls are available online February 15 and at other national retailers starting in March.\n\nWatch the video here: https://www.youtube.com/watch?v=ZNlrP_mb1CA&feature=youtu.be and join the conversation with Kraft on Instagram @kraft_macandcheese, Twitter @kraftmacncheese, and Facebook @kraftmacaroniandcheese, using #KraftMacIsForLovers.\n\nOpen to legal residents of the 50 U.S. & D.C. (excluding AK & HI), 18 years of age and older or who have reached the age of majority in his or her state of residence. Sweepstakes starts 12:00 AM CT on 2/5/2020 and ends 2:59 PM CT on 2/9/2020. Void where prohibited. Visit KraftMacIsForLovers.com for Official Rules and to enter. Sponsor: Kraft Heinz Foods Company.\n\n*December 2019, online panel survey based on 450 US parents\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200205005113/en/\nBrooke Scher Mogan\nALISON BROD MARKETING + COMMUNICATIONS\n212-230-1800\nkraftheinz@alisonbrodmc.com \n\nLynne Galia\nThe Kraft Heinz Company\n847-646-4396\nLynne.galia@kraftheinz.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "HEINZ Reminds Us It Will Always Be There To Add Some Goodness By Airing Four Spots At Once In The Big Game",
        "subtitle": "",
        "date": "Jan 29, 2020 9:09AM EST",
        "content": "\nWith so many situations shown in just 30 seconds, HEINZ guarantees fans will want to watch the ad multiple times.\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nToday HEINZ revealed its full commercial for the big game, directed by Roman Coppola, which will bring to life four ads at once in a four-quadrant split-screen format. With so much happening in just 30 seconds, HEINZ guarantees fans will want to watch the ad again and again and again. The ad will run during the second quarter, fourth commercial break of the big game on FOX.\n\nIn the commercial, four distinct, nerve-racking situations play out simultaneously to show how in so many situations, the familiarity of HEINZ can offer a little reassurance. The ad storylines include navigating an unfamiliar market (on another planet), stopping at a lonely diner (complete with a solo clown), meeting a significant other’s parents (who are evil super villains), and moving into a new (seemingly haunted) house. All scenarios are instantly made better by the reassuring presence of a HEINZ Ketchup bottle.\n\n“For Americans everywhere, HEINZ is that staple you can always count on. No matter where you are, when you spot that iconic bottle, it has the power to make so many situations just a little bit better,” said Dalia Adler, brand building lead, HEINZ. “The big game felt like the perfect time to remind the world that HEINZ will always be there to add some goodness.”\n\nFor over 150 years, HEINZ has been there to add “goodness” to moments big and small, and is using the big game to kick off its new “Find the Goodness” campaign developed in partnership with advertising agency Wieden+Kennedy New York.\n\n“This campaign is all about those little moments of reassurance that remind you things are going to be okay,” said Laddie Peterson, creative director at Wieden+Kennedy New York. “That’s what HEINZ brings to any situation — the goodness. What fans will see in this spot and throughout the Find the Goodness campaign is some of those moments when HEINZ made something better. And since there were too many to choose from, we’re doing something that’s never been done before in the big game: airing four spots at once. With Roman’s precision, attention to detail and cinematic eye, he was a great creative partner to pull this challenge off. We’re excited to give fans a peek into this one before the big game.”\n\n“To think of a way that four stories can share resemblance, be on the screen together, be cohesive and visually attractive, and be inviting for the viewer to watch, was a fun challenge that gave a very interesting set of parameters to work within,” said Roman Coppola, the director of the HEINZ ad. “We tried to be creative and also strict about the form, to make the ad best suited for people to see four things at once.”\n\nWatch HEINZ’s big game spot by visiting HEINZ on YouTube or following HEINZ on Twitter, and stay tuned for more goodness from HEINZ in 2020.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200129005474/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nRachel Cooper\nICF Next\n312-854-8901\nRachel.Cooper@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "The Kraft Heinz Company to Report Fourth Quarter and Full Year 2019 Results on February 13, 2020",
        "subtitle": "",
        "date": "Jan 24, 2020 8:30AM EST",
        "content": "    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nThe Kraft Heinz Company (Nasdaq:KHC) (“Kraft Heinz”) will release its fourth quarter and full year 2019 financial results on Thursday, Feb. 13, 2020, before the market opens. Kraft Heinz will host a conference call at 8:30 a.m. Eastern Standard Time that day to review and discuss the results, followed by a question-and-answer session with analysts.\n\nThe earnings release and live audio webcast of Kraft Heinz’s earnings conference call can be accessed at ir.kraftheinzcompany.com. A replay of the webcast will be available following the conference call through the same website.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (Nasdaq:KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit www.kraftheinzcompany.com or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200124005234/en/\nMichael Mullen (media)\nMichael.Mullen@kraftheinz.com\n\nChristopher Jakubik, CFA (investors)\nir@kraftheinz.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "HEINZ to Air Four Ads at Once During the Big Game",
        "subtitle": "",
        "date": "Jan 23, 2020 11:10AM EST",
        "content": "\nFirst-of-its-kind ad directed by Roman Coppola brings goodness to so many situations, you’ll need to watch it again. and again. and again. \n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nToday HEINZ confirmed they will bring to life four ads at once for the big game. With so much happening in just thirty seconds, HEINZ guarantees fans will want to watch the ad multiple times to spot all the ‘goodness’ packed into one spot.\n\n“HEINZ brings goodness to any and all situations, whether it’s at the local diner, on the dinner table, or at your big game viewing party,” said Dalia Adler, brand building lead, HEINZ. “That’s why we couldn’t pick just one to feature on football’s biggest stage. Fans should be ready to hit rewind.\"\n\nHEINZ isn’t revealing all the details just yet. For now, HEINZ is encouraging fans to do everything they can to ensure they’re paying close attention during the second quarter, fourth commercial break.\n\n“The notion of using the big game to present a conceptual media art piece is very attractive to me,” said the director of the HEINZ ad, Roman Coppola. “By telling four stories at once, this ad is unusual and I'm eager for people to experience it communally with family and friends during the big game. Then I hope that they will have fun re-watching to further discover the multiple stories ...”\n\nFans will get the first look at HEINZ’s ad in a cryptic 15-second clip that launched today.\n\nHEINZ teased scenes featuring a _____ in a ____, _____ your significant other's evil family of _____, ______ on another planet and ______ to a house with a candelabra lit by a ______. The hero of these stories, and so many stories is a ______ of beloved ______ that reminds all of us that it’s ________ when things feel ______.\n\nThere are a handful of surprises for eagle-eyed viewers of HEINZ’s ad, like _________ and _________.\n\nGet ready to watch closely – blink and you might miss it!\n\nWatch HEINZ’s one-of-a kind spot by visiting HEINZ on YouTube or following HEINZ or Twitter.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005589/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nJenna Perlman\nICF Next\n312-377-4130\nJenna.Perlman@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "MR. PEANUT Passes Away at 104 Years Old, Sacrificing Himself to Save Friends Matt Walsh and Wesley Snipes in New Super Bowl Pre-Game Ad",
        "subtitle": "",
        "date": "Jan 22, 2020 10:43AM EST",
        "content": "\nFans can tune into the beloved legume’s funeral during the third quarter of the Super Bowl to celebrate his life\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nToday, PLANTERS, one of America’s biggest snacking brands, revealed its Super Bowl pre-game ad showing just how far MR. PEANUT will go to save his friends Matt Walsh and Wesley Snipes from impending doom.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200122005567/en/Wesley Snipes, MR. PEANUT and Matt Walsh star in PLANTERS nutty Super Bowl pre-game ad. (Photo: Business Wire)\nWhereas last year MR. PEANUT saved friends from snacking disappointment, this year he’s saving lives. The newly released pre-game ad shows MR. PEANUT, Matt Walsh and Wesley Snipes are on a nutty adventure in the NUTmobile when MR. PEANUT is forced to swerve, causing the vehicle to spin out of control. The trio jumps out of the NUTmobile, clinging to a tree branch, as the vehicle crashes down into a deep canyon below. They momentarily find safety until their combined weight begins to break the branch. In the ultimate act of friendship, MR. PEANUT lets go and sacrifices himself to save his friends from impending doom.\n\nFans can witness the epic series of events and MR. PEANUT’s ultimate sacrifice here. The ad will air before the big game kicks off during the pregame show. The brand’s official Super Bowl commercial will air in the third quarter of the game and broadcast MR. PEANUT’s funeral, so the world can mourn the loss of the beloved legume together.\n\n“It’s with heavy hearts that we confirm MR. PEANUT has passed away at 104 years old,” said Samantha Hess, PLANTERS Brand Manager at Kraft Heinz. “He will be remembered as the legume who always brought people together for nutty adventures and a good time. We encourage fans to tune in to MR. PEANUT’s funeral during the third quarter of the Super Bowl to celebrate his life.”\n\n“MR. PEANUT was more than just a friend – he was a hero. His passing has shook me to my core,” said Matt Walsh. “I’ll do my best to honor his legacy and be there for my friends like he was always there for me even until our last wild ride together. I’ll pay my last respects during his funeral on Super Bowl Sunday. I encourage our entire nation to do the same.”\n\nIn addition to mourning MR. PEANUT during his funeral, fans have several ways to celebrate his life, including:\n\nThe ad was produced by VaynerMedia and features Cutting Crew’s “(I Just) Died in Your Arms” in the background to accompany the crews nutty adventure.\n\nFor more information, fans can follow along on the MR. PEANUT Twitter page.\n\n*NoPurNec.18+VoidWhereProhib.Rules.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200122005567/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nlynne.galia@kraftheinz.com\n\nTaylor Higgins\nICF Next\n312-577-1773\ntaylor.higgins@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "HEINZ Offers Football Fans 57-Cent Change Fees for Miami-Bound Flights",
        "subtitle": "",
        "date": "Jan 15, 2020 9:26AM EST",
        "content": "\nMaker of America’s Favorite Ketchup makes things a bit better, even if your team doesn’t make it all the way\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nWith less than five days until the final four teams in the playoffs seal their fate, dedicated football fans are throwing caution and superstition to the wind by booking their flights to Miami with hopes of cheering their team to victory on football’s biggest stage. By Sunday night, fans whose team doesn’t make it all the way will be left with both a team out of the running and an added cost to change their flight, which only adds insult to injury. To reassure fans that even in the bleakest moments not all hope is lost, HEINZ is offering football fans a chance to win 57-cent change fees for Miami-bound flights.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200115005505/en/To reassure fans that even in the bleakest moments not all hope is lost, HEINZ is offering football fans a chance to win 57-cent change fees for Miami-bound flights. (Photo: Business Wire)\nStarting Monday, January 20 at 8 p.m. EST, fans can visit www.Heinz57FlightChange.com to enter for a chance to have HEINZ cover the change fees to re-route your Miami-bound flight to a destination of your choice for just 57 cents*.\n\n“HEINZ has been adding the goodness to any moment, big or small, for decades,” said Dalia Adler, brand building lead, HEINZ. “There’s a feeling you get when you spot a bottle of HEINZ — that things are looking up — and we’re excited to continue being a brand that Americans and football fans alike can always count on, even during playoff season.”\n\nDuring the big game, HEINZ is also airing a 30-second commercial. Directed by Hollywood favorite Roman Coppola, the ad will be the first creative work HEINZ develops in partnership with advertising agency Wieden+Kennedy New York and will air in the game’s second quarter, fourth commercial break.\n\nHEINZ wants fans to know that a team out of the running for the big game doesn’t have to mean all hope is lost. There’s always HEINZ to bring some goodness to any moment, even the football playoffs.\n\nFor more information on how to enter for a chance to have HEINZ cover your change fees for just 57 cents, visit www.Heinz57FlightChange.com or follow HEINZ on Twitter or Instagram.\n\n*NO PURCH. NEC., US 18+, Ends 2/7/20. To enter and for Official Rules, including additional eligibility requirements, visit www.Heinz57FlightChange.com. The Promotion is not sponsored by, endorsed by or affiliated or associated with the National Football League or any NFL team or game. If eligible, you’ll be entered for a chance to win $199.34 to cover the fees.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200115005505/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nJenna Perlman\nICF Next\n312-377-4130\nJenna.Perlman@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "MR. PEANUT Returns to the Super Bowl in a New Nutty Adventure With Matt Walsh",
        "subtitle": "",
        "date": "Jan 14, 2020 9:00AM EST",
        "content": "\nMR. PEANUT will leave fans shell-shocked in his second ever Super Bowl ad\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nPLANTERS, America’s #1 nut brand, is returning to the Super Bowl with a story that will show fans just how far MR. PEANUT will go to have his friends’ backs.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200114005202/en/Matt Walsh with the PLANTERS NUTmobile and MR. PEANUT. (Photo: Business Wire)\nThe thirty second spot stars MR. PEANUT alongside longtime friend and “Veep” star Matt Walsh and will air during the Super Bowl’s third quarter.\n\n“I’m a huge fan of PLANTERS snacks, and I’m thrilled to star alongside my pal MR. PEANUT,” said Walsh. “I’ve starred in some nutty scenarios in the past, but I can assure our fans they haven’t seen anything like our Super Bowl journey!\"\n\nMR. PEANUT made his first-ever Super Bowl appearance last year to save his friends from snacking disappointment, and this year he’s back like you’ve never seen him before.\n\n“As one of the biggest snacking brands in America, we’re very excited to bring MR. PEANUT back to the Super Bowl to have some fun on one of the biggest snacking days of the year,” said Samantha Hess, PLANTERS Brand Manager at Kraft Heinz. “MR. PEANUT is always there for his friends, and this year is no different. We’ve got some surprises in store along his journey and can’t wait to show our fans what’s coming up on Super Bowl Sunday.”\n\nStay tuned as PLANTERS releases additional details about MR. PEANUT and Matt Walsh’s adventures in the month leading up to the Big Game. For more information, fans can visit www.Planters.com or follow MR. PEANUT on Twitter.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005202/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nlynne.galia@kraftheinz.com\n\nTaylor Higgins\nICF Next\n312-577-1773\ntaylor.higgins@icfnext.com\nSource: Kraft Heinz Company"
    },
    {
        "title": "Kraft Heinz Names Carlos Abrams-Rivera As New U.S. Zone President",
        "subtitle": "",
        "date": "Jan 8, 2020 10:00AM EST",
        "content": "    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nAs The Kraft Heinz Company (Nasdaq: KHC) continues to rebuild its business momentum with a focus on driving business growth through consumer-first marketing, innovation and people development, CEO Miguel Patricio today announced that Carlos Abrams-Rivera will join his Senior Leadership Team as the new U.S. Zone President. Effective Feb. 3, 2020, Abrams-Rivera will lead all U.S. business operations, the company’s largest business.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200108005544/en/Carlos Abrams-Rivera (Photo: Business Wire)\nSince officially stepping into the CEO role in July 2019, Patricio also has served as interim President of the U.S. Zone, in addition to his global duties.\n\n“The U.S. represents the majority of our company’s overall business, so this is an enormously important role. I have every confidence that Carlos is the visionary leader we need to drive the U.S. business forward at this moment of transformation,” said Patricio. “Carlos has successfully implemented a strategic approach to reinvigorating brands and has a strong track record of growing businesses with a consumer-first focus to consistently drive strong business results.”\n\n“I am honored to step into the role of U.S. Zone President and look forward to working closely with Miguel and the strong, capable senior leaders he’s assembled at Kraft Heinz,” said Abrams-Rivera. “I’m also very excited to bring my consumer insights passion to drive growth for so many world-class brands, many of which are already very familiar to me.”\n\nA native of Puerto Rico, Abrams-Rivera, 52, will join the company after a successful career spanning more than two decades at companies including Campbell Soup Company, Mondelēz International, and Kraft Foods.\n\nAbrams-Rivera joined Campbell in 2015 and most recently served as Executive Vice President and President, Campbell Snacks, a new division that represents nearly 50 percent of Campbell’s annual sales.\n\nPreviously, Abrams-Rivera was President of Campbell’s Pepperidge Farm subsidiary, where he improved the results of this iconic business, driving consistent profitable growth.\n\nHis roles at Mondelēz International from 2012-2015 included President of Gum & Candy for Mondelēz Latin America; President, Mondelēz Mexico; Senior Vice President, Global Beverages; and Senior Vice President, Marketing and Strategy for Developing Markets.\n\nAbrams-Rivera began his career at Kraft Foods and held numerous roles from 1998 to 2012, including Senior Vice President, Marketing and Strategy for Developing Markets; Vice President, Nabisco Savory Snacks; and Vice President, Global Biscuits Brands. He also led the development of iconic brands in Cheese, Enhancers, Frozen Pizza, and Oscar Mayer businesses.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\n\nForward-Looking Statements\n\nThis press release contains a number of forward-looking statements. Words such as “plan,” “invest,” “grow,” “support,” “work,” “aim,” “accelerate,” “leverage,” “will,” “take,” “focus,” “capitalize,” “confident,” and variations of such words and similar future or conditional expressions are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements regarding Kraft Heinz’s investments and growth plans. These forward-looking statements are not guarantees of future performance and are subject to a number of risks and uncertainties, many of which are difficult to predict and beyond Kraft Heinz’s control.\n\nImportant factors that may affect Kraft Heinz’s business and operations and that may cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, operating in a highly competitive industry; Kraft Heinz’s ability to predict, identify, and interpret changes in consumer preferences and demand, to offer new products to meet those changes, and to respond to competitive innovation; changes in the retail landscape or the loss of key retail customers; changes in relationships with significant customers or suppliers; Kraft Heinz’s ability to maintain, extend, and expand its reputation and brand image; Kraft Heinz’s ability to leverage its brand value to compete against private label products; Kraft Heinz’s ability to drive revenue growth in its key product categories, increase its market share, or add products that are in faster-growing and more profitable categories; product recalls or product liability claims; unanticipated business disruptions; Kraft Heinz’s ability to identify, complete, or realize the benefits from strategic acquisitions, alliances, divestitures, joint ventures, or other investments; Kraft Heinz’s ability to realize the anticipated benefits from prior or future streamlining actions to reduce fixed costs, simplify or improve processes, and improve its competitiveness; the execution of Kraft Heinz’s international strategic initiatives; the impacts of Kraft Heinz’s international operations; economic and political conditions in the United States and in various other nations in which Kraft Heinz does business; changes in Kraft Heinz’s management team or other key personnel and Kraft Heinz’s ability to hire or retain key personnel or a highly skilled and diverse global workforce; risks associated with information technology and systems, including service interruptions, misappropriation of data, or breaches of security; impacts of natural events in the locations in which Kraft Heinz or its customers, suppliers, distributors, or regulators operate; Kraft Heinz’s ownership structure; Kraft Heinz’s indebtedness and ability to pay such indebtedness; an impairment of the carrying value of goodwill or other indefinite-lived intangible assets; exchange rate fluctuations; volatility in commodity, energy, and other input costs; volatility in the market value of all or a portion of the derivatives we use; increased pension, labor and people-related expenses; compliance with laws, regulations, and related interpretations and related legal claims or other regulatory enforcement actions; Kraft Heinz’s ability to protect intellectual property rights; tax law changes or interpretations; the impact of future sales of Kraft Heinz’s common stock in the public markets; Kraft Heinz’s ability to continue to pay a regular dividend and the amounts of any such dividends; volatility of capital markets and other macroeconomic factors; and other factors. For additional information on these and other factors that could affect Kraft Heinz’s forward-looking statements, see Kraft Heinz’s risk factors, as they may be amended from time to time, set forth in its filings with the Securities and Exchange Commission. Kraft Heinz disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005544/en/\nThe Kraft Heinz Company\nMichael Mullen (media)\nMichael.Mullen@kraftheinz.com \n\nChristopher Jakubik, CFA (investors)\nir@kraftheinz.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Here’s Your Chance to Become the Next Oscar Mayer Wienermobile Driver",
        "subtitle": "",
        "date": "Jan 6, 2020 10:00AM EST",
        "content": "\nBeloved meats brand in search of recent college graduates to hit the hot dog highways for a year\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nIt’s a new decade, which means time for change! If you are a recent college grad on the hunt for a new job, here’s a career you can truly relish. Oscar Mayer announced that submissions are now open for the 2020 class of Hotdoggers. Have you dreamt of seeing the country through the windshield of a 27-foot hot dog on wheels? Here’s your chance!\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200106005226/en/2019 Hotdoggers (Photo: Business Wire)\nThe Hotdogger role is a full-time, paid, one-year job with the opportunity to crisscross the hot dog highways in the iconic Wienermobile vehicle. As a brand spokesperson, you’ll represent Oscar Mayer in radio and television appearances and interviews, retail grocery events, charity functions, and more. You’ll “meat” and greet folks from coast to coast and receive an untraditional and memorable marketing experience!\n\nOscar Mayer is looking to fill 12 open Hotdogger positions, which will kick off in June at Hot Dog High — a two-week training where you’ll be taught the ins and outs of life as a Hotdogger. At this time you’ll also select your Hotdogger name, become an expert on hot dog puns, and learn to parallel park the Wienermobile, all before heading on the road!\n\nLast year, Oscar Mayer received thousands of resumes for the coveted position. It’s true that more people have been to outer space than have held the position of Oscar Mayer Hotdogger.\n\n“We’re eager to see who will cut the mustard in 2020 and travel the country on behalf of the Oscar Mayer brand,” said Matt Riezman, Associate Director of Oscar Mayer. “With 33 years under our belt, the Hotdogger job continues to be a highly coveted position. If you’re ready to celebrate our love of meats, drive miles of smiles nationwide and provide fans with an unforgettable Wienermobile experience, send us your resume!”\n\nInterested candidates should submit their resume and cover letter via email or mail by January 31. For more information, click here.\n\nTo learn more about Oscar Mayer, the Wienermobile, Hotdoggers and more, visit oscarmayer.com/wienermobile or following along on Facebook, Twitter or Instagram.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005226/en/\nLynne Galia\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nJenna Perlman\n312-377-4130\nJenna.Perlman@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Kraft Hockeyville™ USA Is Looking for the Most-Spirited Hockey Communities in America",
        "subtitle": "",
        "date": "Jan 1, 2020 4:03PM EST",
        "content": "\nNominations are now open to name one U.S. community Kraft Hockeyville™ USA 2020, with $150,000 in rink upgrades and the chance to host an NHL® Pre-Season Game\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nKraft Hockeyville™ USA is back again this year to find America’s most-spirited hockey community. Together with the National Hockey League (NHL) and the National Hockey League Players’ Association (NHLPA), Kraft Heinz is looking to crown one hockey community in America with the Kraft Hockeyville™ USA 2020 title, award $150,000 in rink upgrades along with $10,000 worth of hockey equipment through the NHLPA Goals & Dreams program, and provide the chance to host an NHL® Pre-Season Game in their community rink.\n\n“The incredible response we’ve seen from hockey communities over the years has been an inspiration,” said Magen Hanrahan, vice president of media and marketing services, Kraft Heinz. “Every year, we’ve seen communities come together to support their local rinks, and we’re proud to be a small part of the passion that ignites hockey communities each year.”\n\nKraft Hockeyville™ USA is proud to rally local communities around their true passion for hockey. The 2020 program was announced live during today’s broadcast of the 2020 Bridgestone NHL Winter Classic® outdoor game in Dallas, Texas, featuring the Dallas Stars against the Nashville Predators.\n\nHow Kraft Hockeyville™ USA 2020 Works\n\nHockey communities hoping to become the next Kraft Hockeyville™ winner can kick off their chance during the nomination phase, where they can share unique stories about their local rink, teams and passion for hockey. Throughout the submission process, hockey towns need to rally their fans on the mobile-friendly platform at www.KraftHockeyville.com, where communities earn Rally Points by adding notes, uploading photos and videos, and tweeting from the community page. Finalists will be selected based on the best stories and their community’s total Rally Points through three periods:\n\nThis year, one lucky fan will also win a trip for two to a Stanley Cup® Game from Kraft Heinz. Starting March 22 through 29, fans can register online at www.krafthockeyville.com to be entered. Additionally, each vote cast during the 28-hour voting phase from March 28 to 29 equals one entry into the sweepstakes, so fans are encouraged to vote multiple times for their favorite community1.\n\nSince launching in Canada in 2006, Kraft Hockeyville™ has positively impacted more than 120 communities with more than $5 million awarded in rink upgrades across Canada and the U.S. During the program, Kraft Heinz will feature its diverse portfolio of products to unite hockey fans in their celebrations of the sport and their communities, including Planters, Kraft Natural Cheese, Maxwell House, Oscar Mayer, Heinz Ketchup and Kraft Macaroni & Cheese.\n\nFor complete contest rules and nomination applications, visit www.KraftHockeyville.com. Kraft Hockeyville™ USA can also be found on Facebook (KraftHockeyvilleUSA), Twitter (@HockeyvilleUSA) and Instagram (@KraftHockeyvilleUSA). Fans can join the conversation using #HockeyvilleUSA.\n\nNHL, the NHL Shield, the word mark and image of the Stanley Cup, and the word mark NHL Winter Classic are registered trademarks and the NHL Winter Classic logo, and HOCKEYVILLE are trademarks of the National Hockey League. © NHL 2019. All rights reserved.\n\nNHLPA, National Hockey League Players’ Association and the NHLPA logo are registered trademarks of the NHLPA. © 2020. All rights reserved.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit https://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\n\nAbout the NHL \n\nThe National Hockey League (NHL®), founded in 1917, consists of 31 Member Clubs and proudly welcomes its 32nd franchise, based in Seattle, for the 2021-22 season. Each team roster reflects the League’s international makeup with players from more than 20 countries represented, all vying for the most cherished and historic trophy in professional sports – the Stanley Cup®. Gary Bettman has served the NHL as Commissioner since February 1, 1993 and has guided the world’s top professional hockey league to more than $5 billion in annual revenues and partnerships with more than 40 blue chip corporate sponsors. Every year, the NHL entertains more than 670 million fans in-arena and through its partners on national television and radio; more than 151 million followers - league, team and player accounts combined - across Facebook, Twitter, Instagram, Snapchat and YouTube; and more than 100 million fans online at NHL.com. The League broadcasts games in more than 160 countries and territories through its rightsholders including NBC/NBCSN and the NHL Network™ in the U.S., Sportsnet and TVA in Canada, Viasat in the Nordic Region, Yandex in Russia and CCTV and Tencent in China. The NHL reaches fans worldwide with games available online in every country including via its live and on-demand streaming service NHL.TV™. Having entered the esports world in 2018, the League hosts the NHL Gaming World Championship™ annually, drawing record digital streaming audiences during the 2019 campaign. Fans are engaged across the League’s digital assets on mobile devices via the free NHL® App; across nine social media platforms; on SiriusXM NHL Network Radio™; and on NHL.com, available in eight languages and featuring unprecedented access to player and team statistics as well as every regular-season and playoff game box score dating back to the League’s inception, powered by SAP. The NHL is committed to building healthy and vibrant communities through the sport of hockey by increasing youth participation and engagement; fostering positive family experiences; promoting inclusion, positive culture and leadership; and supporting sustainable community impact.\n\nAbout the National Hockey League Players’ Association\n\nThe National Hockey League Players’ Association (NHLPA), established in 1967, is a labour organization whose members are the players in the National Hockey League (NHL). The NHLPA works on behalf of the players in varied disciplines such as labour relations, product licensing, marketing, international hockey and community relations, all in furtherance of its efforts to promote its members and the game of hockey. In 1999, NHLPA Goals & Dreams was launched as a way for the players to give something back to the game they love. Over the past 20 years, more than 80,000 deserving children in 34 countries have benefited from the players' donations of hockey equipment. NHLPA Goals & Dreams has donated more than $25 million to grassroots hockey programs, making it the largest program of its kind. For more information on the NHLPA, please visit www.nhlpa.com.\n\n1 NO PURCHASE NECESSARY. Legal residents of the 50 United States (D.C.), 13 or older. Void where prohibited. Promotion starts 3/22/20 and ends 3/29/20. For Official Rules, entry requirements, and prize descriptions, visit www.krafthockeyville.com. PRIZES/ARV: One (1) Grand Prize/$6,550; Fifty (50) First Prizes/$20. Odds of winning depend on the number of eligible entries received during the Promotion Period. Sponsor: Kraft Heinz Foods Company, 200 E Randolph, Chicago, IL 60601.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200101005098/en/\nLynne Galia\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nJessica Lutchen\n312-577-1777\nJessica.Lutchen@icfnext.com\nSource: Kraft Heinz Company"
    },
    {
        "title": "Zippin Announces $12 Million Series A Financing Round Led by Evolv Ventures, the Venture Fund Backed by Kraft Heinz",
        "subtitle": "",
        "date": "Dec 12, 2019 9:19AM EST",
        "content": "    SAN FRANCISCO--(BUSINESS WIRE)--\nZippin, the industry leading startup enabling cashierless checkout for brick and mortar retail, announced the recent closing of $12 million in Series A funding led by Evolv Ventures, the venture fund backed by Kraft Heinz.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191212005444/en/Zippin cashierless checkout. (Photo: Business Wire)\nZippin uses a combination of computer vision, AI, and sensor fusion technology to offer consumers a completely checkout-free shopping experience. Launched in 2015, the company is powering four autonomous public stores and several private pilot stores globally. Zippin most recently made headlines for its newly operational autonomous concession stand in Golden 1 Center, home of the Sacramento Kings.\n\nThe Series A round was led by Evolv Ventures, which is focused on making investments in emerging and fast-growing technology-enabled companies transforming the food and CPG industry. Other investors in the round include SAP.iO, Scrum Ventures, major Latin American distributor Arca Continental, and Nomura Research Institute and NTT DOCOMO Ventures from Japan. Existing investors Maven Ventures, Core Ventures Group, Pear Ventures and Montage Ventures also participated in the over-subscribed round.\n\nThe Series A funding will help Zippin accelerate new store launches in the coming months, with plans to open new stores for grocery and convenience chains, sports facilities, airports and more. The Sacramento Kings’ venue also marks the launch of the ‘Zippin Cube’, a unique modular, pre-fabricated ‘store-in-a-box’ concept that allows retailers to launch a fully functional autonomous microstore (300 – 500 sq. ft) in less than three weeks from placing the order.\n\n“When we launched the Zippin platform for retailers in 2018, we removed friction from the checkout process. With the Zippin Cube, we are aiming to remove friction from bringing that experience to retail stores,” said Krishna Motukuri, CEO of Zippin. “We obsess about retail operations and physical infrastructure just as much as we obsess about AI and computer vision. That’s why we have more operational public stores than most other startups in the checkout-free space.”\n\nFor leading global CPG companies like Kraft Heinz, the emergence of this new retail paradigm presents an opportunity to get closer to the end consumer, provide a superior shopping experience, and build a better, data-driven understanding of shopper behaviors and preferences.\n\n“We’re excited to join Zippin’s journey as these new formats become critical to the transition currently underway in retail,” said Smriti Jayaraman, Principal at Evolv Ventures. “Zippin’s technology also offers CPG brands, which have previously been at arm’s length from the point of sale, a unique set of opportunities to participate in the customer journey.”\n\nThis round brings the company’s total funding to $15 million and will allow Zippin to further invest in product innovation, grow its technical team and expand sales and partnership efforts.\n\nTo learn more or launch a Zippin pilot, visit www.getzippin.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191212005444/en/\nMedia Contact:\nLynne Galia\nLynne.galia@kraftheinz.com\nSource: Kraft Heinz"
    },
    {
        "title": "Kool-Aid Man and Lil Jon Are Back to Give You All You Want for Christmas",
        "subtitle": "",
        "date": "Dec 3, 2019 9:00AM EST",
        "content": "\nWhether You Krash Like Kool-Aid Man or Turn Up Like Lil Jon, the Epic Duo Are Krashing the Holidays to Give One Fan $10,000 to Get Everything on Their Christmas List \n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nThe iconic, always-hype pair Kool-Aid Man and Grammy award-winning artist Lil Jon are krashing the holidays again this year to help fans get into the Christmas spirit and make one lucky fan's Christmas wish list come true.\n\nStarting today through December 12 at 11:59 p.m. ET, fans can head to TikTok and post a video showing off their best “Oh Yeahhhh” and dance moves to their lit holiday track, “All I Really Want For Christmas.” Fans must include #OhYEAHChristmas and #Contest to enter for the chance to win $10,000 to get everything on their list, just in time for Christmas.\n\n“It’s cool to rock with the big man in red again this holiday season,” said Lil Jon. “The holidays are about to be even more lit for the winner of our #OhYEAHChristmas Challenge!”\n\nLast year, Kool-Aid Man and Lil Jon krashed the holidays with the holiday collaboration no one knew they needed but everyone loved: the holiday song, “All I Really Want for Christmas,” that had fans turning up even after their trees were down and their decorations packed away.\n\n“At Kool-Aid, we’re always looking for new, unexpected ways to bring the fun to every situation,” said Rachel Drof, Marketing Director, Beverages, Kraft Heinz. “Last year, Kool-Aid Man had so much fun teaming up with Lil Jon to release the holiday banger of the season. This year, we’re excited to make the song a reality by giving one lucky fan all they really want for Christmas.”\n\nTo enter, fans must use #OhYEAHChristmas and #Contest on their TikTok post for a chance to win. The video with the highest views on TikTok will get everything they want on their Christmas list. For official rules, click here.\n\nTo learn more about the Kool-Aid collaboration, fans can follow the brand on Twitter (@koolaid), Instagram (@koolaid) and Facebook (facebook.com/koolaid) for updates. For more general information about Kool-Aid, visit www.koolaid.com.\n\nAbout The Kraft Heinz Company\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit https://www.kraftheinzcompany.com/or follow us on LinkedIn and Twitter.\n\nAbout Lil Jon\n\nFor the last decade plus, the words “YEAH,” “OK,” and “WHAT” have been synonymous with multi-platinum, Grammy award winning artist Lil Jon. He has been one of the most prominent figures in music and pop culture alike, performing for hundreds of thousands of fans with Usher & Ludacris, Afrojack, Steve Aoki, Pitbull, TLC (on FOX’s American Idol), Yandel, LMFAO and Sydney Samson just to name a few. In 2014, Lil Jon proved once again he’s a powerhouse artist teaming up with DJ Snake for their smash hit “Turn Down For What,” which created a massive worldwide craze and recently named by Billboard as one of the ‘Songs of The Decade’. His success as a mainstay in the DJ-world is evident with a current residency at Hakkasan Nightclub (MGM Grand) along with Jewel Nightclub at Aria Resort & Casino. Lil Jon’s consistent hitmaking has earned him legions of fans which is evident as Lil Jon has won BMI’s Songwriter of the Year award as well as scored eleven Billboard Awards (for the two hit Usher tracks “Yeah!” and “Lovers and Friends”), a Grammy, a Radio Music Award, a BET award, two MTV Video Music Awards, and an American Music Award.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191203005141/en/\nLynne Galia\n847-646-4396\nLynne.Galia@KraftHeinz.com\n\nJenna Perlman\n312-377-4130\nJenna.Perlman@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Oscar Mayer Bacon Is the Only Bae You’ll Need This Cuffing Season",
        "subtitle": "",
        "date": "Nov 20, 2019 9:14AM EST",
        "content": "\nNew weighted Oscar Mayer BAEcon Blanket wraps you in the love of bacon all winter long\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nCuffing season is upon us, when singles “tie up” with less-than-perfect significant others to partake in cozy, indoor activities together. But now you can end the search for that special-ish someone, because the only bae you’ll need this year is Oscar Mayer Bacon, thanks to the new Oscar Mayer BAEcon Blanket.\n\nDesigned with delicious strips of sizzlin’ Oscar Mayer Bacon, the Oscar Mayer BAEcon Blanket is a 15-lb. weighted blanket that will wrap you in so much bacon love, you can actually feel it during cuffing season (and beyond).\n\n“Oscar Mayer sets the golden standard of bacon, and we want to help our fans maintain a high standard this cuffing season with the ultimate bae(con),” says Matt Riezman, associate director of marketing for Oscar Mayer. “Just as our bacon is reliable and cooks up perfectly every time, we’re confident the Oscar Mayer BAEcon Blanket will be the reliable companion you need to get through the winter.”\n\nPeople in search of warm bacon hugs can head to Twitter now through Friday, November 22 at 9 a.m. ET and use the hashtag #CuffOscar and #Giveaway for a chance to win the limited-edition Oscar Mayer BAEcon Blanket. Fans will be randomly selected to receive the coziest, tastiest bae of cuffing season.\n\nFor more information about Oscar Mayer, visit OscarMayer.com or Facebook, Twitter or Instagram.\n\nAbout The Kraft Heinz Company \n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit https://www.kraftheinzcompany.com/or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191120005542/en/\nLynne Galia\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nJenna Perlman\n312-377-4130\nJenna.Perlman@icfnext.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Kraft Heinz Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 31, 2019 7:35AM EDT",
        "content": "    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nThe Kraft Heinz Company (Nasdaq: KHC) (“Kraft Heinz” or the “Company”) today reported third quarter 2019 financial results that reflected a one-time gain on the sale of the Company's Canadian natural cheese business, lower net sales, and higher input costs.\n\n“While our third-quarter results remain below our potential, we showed sequential improvement versus the first half, and I believe we are beginning to operate the business better,” said Kraft Heinz CEO Miguel Patricio. \"We are making good progress in identifying and addressing the root causes of past performance, as well as setting our strategic direction. Although there is still much work ahead, we’re encouraged by our improving performance, and are even more confident in our ability to turn around the Company and set a path of long term growth and profitability.”\n\nQ3 2019 Financial Summary\n\nNet sales were $6.1 billion, down 4.8 percent versus the year-ago period, including a negative 2.0 percentage point impact from divestitures and an unfavorable 1.7 percentage point impact from currency. Organic Net Sales(1) decreased 1.1 percent versus the year-ago period. Pricing increased 1.0 percent versus the prior year period, reflecting higher pricing in the United States, Rest of World and EMEA segments that more than offset lower pricing in Canada. Volume/mix was 2.1 percentage points below the prior year period as global growth in condiments and sauces was more than offset by lower shipments in the United States.\n\nNet income attributable to common shareholders increased to $899 million and diluted EPS increased to $0.74, primarily reflecting the gain on the sale of Canadian natural cheese business and a non-cash impairment charge in the prior year period that was partially offset by debt extinguishment costs associated with the tender offers. Adjusted EBITDA decreased 7.8 percent versus the year-ago period to $1.5 billion, including 3.2 percentage point impact from unfavorable currency and a negative 1.4 percentage point impact from divestitures. Excluding these factors, the decrease was driven by declines in the United States and Canada, as well as higher general corporate expenses that more than offset growth in EMEA. Adjusted EPS decreased 9.2% percent to $0.69, reflecting lower Adjusted EBITDA, higher taxes on adjusted earnings in the current period, and lower interest expense versus the year-ago period.\n\nQ3 2019 Business Segment Highlights\n\nUnited States\n\nUnited States net sales were $4.4 billion, down 1.6 percent versus the year-ago period. Pricing increased 1.5 percentage points, driven by price increases across several categories, including Oscar Mayer cold cuts, Philadelphia cream cheese, macaroni & cheese, and Lunchables. This more than offset pricing to offset lower key commodity(2) costs in coffee and nuts. Volume/mix decreased 3.1 percentage points, primarily driven by lower retail takeaway in natural cheese, cold cuts and Lunchables, as well as unfavorable changes in retail inventory levels versus the prior year period. This more than offset consumption-led growth in condiments and sauces, and, to a lesser extent, nuts.\n\nUnited States Segment Adjusted EBITDA decreased 1.8 percent versus the year-ago period to $1.2 billion, driven by unfavorable volume/mix that more than offset higher pricing and favorable timing of marketing expenses versus the prior year period.\n\nCanada\n\nCanada net sales were $415 million, 21.1 percent lower than the year-ago period, including a negative 19.8 percentage point impact from the Canadian natural cheese divestiture and a 0.8 percentage point unfavorable impact from currency. Organic Net Sales decreased 0.5 percent versus the year-ago period. Pricing declined 2.6 percentage points, driven by increased promotional activity and unfavorable trade expense in cheese that more than offset higher pricing of macaroni and cheese. Volume/mix increased 2.1 percent, reflecting growth from increased promotional support in cheese and pasta sauce, as well as a partial recovery of retail inventory levels in certain categories. These gains more than offset a decline in macaroni and cheese due to reduced promotional activity and lower coffee shipments versus the prior year period.\n\nCanada Segment Adjusted EBITDA decreased 25.7 percent versus the year-ago period to $107 million, including a 14.9 percentage point impact from a divestiture and a 0.8 percentage point unfavorable impact from currency. Excluding the impact of these factors, the decrease versus the prior year was driven by lower pricing and higher input costs.\n\nEMEA\n\nEMEA net sales were $612 million, down 3.5 percent versus the year-ago period, due to a negative 3.9 percentage point impact from currency. Organic Net Sales increased 0.4 percent versus the year-ago period. Pricing was up 0.2 percentage points, with higher pricing in the UK more than offsetting lower pricing in other regions. Volume/mix increased 0.2 percentage points, driven by favorable shipment timing versus the prior year period in Russia and foodservice growth across most regions that more than offset ongoing weakness in infant nutrition.\n\nEMEA Segment Adjusted EBITDA increased 0.3 percent versus the year-ago period to $165 million, despite a negative 4.4 percentage point impact from currency. Excluding currency, Segment Adjusted EBITDA increased 4.7 percent, primarily reflecting lower supply chain costs.\n\nRest of World(3)\n\nRest of World net sales of $688 million decreased 13.3 percent versus the year-ago period, including a negative 10.2 percentage point impact from currency and a 3.3 percentage point negative impact from the India nutritional beverages divestiture. Organic Net Sales increased 0.2 percent versus the year-ago period, driven by a 0.9 percentage point increase from pricing. Price increases in Latin America, including in highly inflationary markets, more than offset lower pricing in Asia Pacific. Volume/mix decreased 0.7 percentage points, as ongoing weakness in China infant nutritional products more than offset growth from condiments and sauces, foodservice, and Indonesia beverages.\n\nRest of World Segment Adjusted EBITDA decreased 32.7 percent versus the year-ago period to $100 million, due to a negative 31.1 percentage point impact from currency, as well as higher supply chain costs and lower Organic Net Sales in Asia Pacific.\n\nEnd Notes\n\nWebcast, Conference Call, and Filing Information\n\nA webcast of The Kraft Heinz Company's third quarter 2019 earnings conference call will be available at ir.kraftheinzcompany.com. The call begins today at 8:30 a.m. Eastern Daylight Time.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (Nasdaq: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit www.kraftheinzcompany.com or follow us on LinkedIn and Twitter.\n\nForward-Looking Statements\n\nThis press release contains a number of forward-looking statements. Words such as “commit,” “plan,” \"believe,\" \"anticipate,\" \"reflect,\" \"invest,\" \"make,\" \"expect,\" \"deliver,\" “develop,” \"drive,\" \"assess,\" \"evaluate,\" “establish,” “focus,” “build,” “turn,” “expand,” “leverage,” \"grow,\" \"remain,\" \"will,\" and variations of such words and similar future or conditional expressions are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements regarding the Company's plans, costs and cost savings, legal matters, taxes, expectations, investments, innovations, opportunities, capabilities, execution, initiatives, pipeline, and growth. These forward-looking statements are not guarantees of future performance and are subject to a number of risks and uncertainties, many of which are difficult to predict and beyond the Company's control.\n\nImportant factors that may affect the Company's business and operations and that may cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, operating in a highly competitive industry; the Company’s ability to correctly predict, identify, and interpret changes in consumer preferences and demand, to offer new products to meet those changes, and to respond to competitive innovation; changes in the retail landscape or the loss of key retail customers; changes in the Company's relationships with significant customers, suppliers and other business relationships; the Company’s ability to maintain, extend, and expand its reputation and brand image; the Company’s ability to leverage its brand value to compete against private label products; the Company’s ability to drive revenue growth in its key product categories, increase its market share, or add products that are in faster-growing and more profitable categories; product recalls or product liability claims; unanticipated business disruptions; the Company’s ability to identify, complete or realize the benefits from strategic acquisitions, alliances, divestitures, joint ventures or other investments; the Company’s ability to realize the anticipated benefits from prior or future streamlining actions to reduce fixed costs, simplify or improve processes, and improve its competitiveness; the Company’s ability to successfully execute its strategic initiatives; the impacts of the Company’s international operations; economic and political conditions in the United States and in various other nations where the Company does business; changes in the Company’s management team or other key personnel and the Company’s ability to hire or retain key personnel or a highly skilled and diverse global workforce; risks associated with information technology and systems, including service interruptions, misappropriation of data or breaches of security; impacts of natural events in the locations in which we or the Company’s customers, suppliers, distributors, or regulators operate; the Company’s ownership structure; the Company’s indebtedness and ability to pay such indebtedness; additional impairments of the carrying amounts of goodwill or other indefinite-lived intangible assets; exchange rate fluctuations; volatility in commodity, energy, and other input costs; volatility in the market value of all or a portion of the derivatives we use; increased pension, labor and people-related expenses; compliance with laws, regulations, and related interpretations and related legal claims or other regulatory enforcement actions, including additional risks and uncertainties related to the Company’s restatement and any potential actions resulting from the Securities and Exchange Commission’s (“SEC”) ongoing investigation, as well as potential additional subpoenas, litigation, and regulatory proceedings; an inability to remediate the material weaknesses in the Company’s internal control over financial reporting or additional material weaknesses or other deficiencies in the future or the failure to maintain an effective system of internal controls; the Company’s failure to prepare and timely file its periodic reports; the restatement of certain of the Company’s previously issued consolidated financial statements, which resulted in unanticipated costs and may affect investor confidence and raise reputational issues; the Company’s ability to protect intellectual property rights; tax law changes or interpretations; the impact of future sales of the Company's common stock in the public markets; the Company’s ability to continue to pay a regular dividend and the amounts of any such dividends; volatility of capital markets and other macroeconomic factors; and other factors. For additional information on these and other factors that could affect the Company's forward-looking statements, see the Company's risk factors, as they may be amended from time to time, set forth in its filings with the SEC. The Company disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.\n\nNon-GAAP Financial Measures\n\nThe non-GAAP financial measures provided should be viewed in addition to, and not as an alternative for, results prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”) that are presented in this press release.\n\nTo supplement the financial information, the Company has presented Organic Net Sales, Adjusted EBITDA, Constant Currency Adjusted EBITDA, and Adjusted EPS, which are considered non-GAAP financial measures. The non-GAAP financial measures presented may differ from similarly titled non-GAAP financial measures presented by other companies, and other companies may not define these non-GAAP financial measures in the same way. These measures are not substitutes for their comparable GAAP financial measures, such as net sales, net income/(loss), diluted earnings per share, or other measures prescribed by GAAP, and there are limitations to using non-GAAP financial measures.\n\nManagement uses these non-GAAP financial measures to assist in comparing the Company's performance on a consistent basis for purposes of business decision making by removing the impact of certain items that management believes do not directly reflect the Company's underlying operations. Management believes that presenting the Company's non-GAAP financial measures (i.e., Organic Net Sales, Adjusted EBITDA, Constant Currency Adjusted EBITDA, and Adjusted EPS) is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items, (ii) permits investors to view performance using the same tools that management uses to budget, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating the Company's results. The Company believes that the presentation of these non-GAAP financial measures, when considered together with the corresponding GAAP financial measures and the reconciliations to those measures, provides investors with additional understanding of the factors and trends affecting the Company's business than could be obtained absent these disclosures.\n\nOrganic Net Sales is defined as net sales excluding, when they occur, the impact of currency, acquisitions and divestitures, and a 53rd week of shipments. The Company calculates the impact of currency on net sales by holding exchange rates constant at the previous year's exchange rate, with the exception of highly inflationary subsidiaries, for which the Company calculates the previous year's results using the current year's exchange rate. Organic Net Sales is a tool that can assist management and investors in comparing the Company's performance on a consistent basis by removing the impact of certain items that management believes do not directly reflect the Company's underlying operations.\n\nAdjusted EBITDA is defined as net income/(loss) from continuing operations before interest expense, other expense/(income), provision for/(benefit from) income taxes, and depreciation and amortization (excluding integration and restructuring expenses); in addition to these adjustments, the Company excludes, when they occur, the impacts of integration and restructuring expenses, deal costs, unrealized losses/(gains) on commodity hedges, impairment losses, and equity award compensation expense (excluding integration and restructuring expenses). The Company also presents Adjusted EBITDA on a constant currency basis. The Company calculates the impact of currency on Adjusted EBITDA by holding exchange rates constant at the previous year's exchange rate, with the exception of highly inflationary subsidiaries, for which it calculates the previous year's results using the current year's exchange rate. Adjusted EBITDA and Constant Currency Adjusted EBITDA are tools that can assist management and investors in comparing the Company's performance on a consistent basis by removing the impact of certain items that management believes do not directly reflect the Company's underlying operations.\n\nAdjusted EPS is defined as diluted earnings per share excluding, when they occur, the impacts of integration and restructuring expenses, deal costs, unrealized losses/(gains) on commodity hedges, impairment losses, losses/(gains) on the sale of a business, other losses/(gains) related to acquisitions and divestitures (e.g., tax and hedging impacts), nonmonetary currency devaluation (e.g., remeasurement gains and losses), debt prepayment and extinguishment costs, and U.S. Tax Reform discrete income tax expense/(benefit), and including when they occur, adjustments to reflect preferred stock dividend payments on an accrual basis. The Company believes Adjusted EPS provides important comparability of underlying operating results, allowing investors and management to assess operating performance on a consistent basis.\n\nSee the attached schedules for supplemental financial data, which includes the financial information, the non-GAAP financial measures and corresponding reconciliations to the comparable GAAP financial measures for the relevant periods.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191031005469/en/\nMichael Mullen (media)\nMichael.Mullen@kraftheinz.com\n\nChristopher Jakubik, CFA (investors)\nir@kraftheinz.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "The Kraft Heinz Company Declares Regular Quarterly Dividend of $0.40 Per Share",
        "subtitle": "",
        "date": "Oct 31, 2019 7:31AM EDT",
        "content": "    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nThe Board of Directors of The Kraft Heinz Company (Nasdaq: KHC) today declared a regular quarterly dividend of $0.40 per share of common stock payable on December 13, 2019, to stockholders of record as of November 15, 2019.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (Nasdaq: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit www.kraftheinzcompany.com or follow us on LinkedIn and Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191031005471/en/\nMichael Mullen (media)\nMichael.Mullen@kraftheinz.com\n\nChristopher Jakubik, CFA (investors)\nir@kraftheinzcompany.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "Oscar Mayer Brings the Sizzle Back to NASCAR for 2020 Season and Beyond",
        "subtitle": "",
        "date": "Oct 30, 2019 10:35AM EDT",
        "content": "\nOscar Mayer Announces Two-Year Partnership Extension with Roush Fenway Racing and Driver Ryan Newman and Will Offer Fans Opportunity to Design 2020 Paint Scheme\n    CONCORD, N.C. & PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nEveryone’s favorite name in racing, O-S-C-A-R, is extending its sponsorship of the No. 6 Oscar Mayer Ford Mustang with driver Ryan Newman and Roush Fenway Racing through the 2021 season.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191030005645/en/\nOscar Mayer will return as the primary partner on the No. 6 Ford for multiple races during the 2020 and 2021 seasons, beginning at the TicketGuardian 500 in Phoenix on March 8, 2020.\n\n“After a strong 2019 season, we at Oscar Mayer couldn’t be prouder to continue our season-long sponsorship of driver Ryan Newman and Roush Fenway Racing,” said Matt Riezman, associate director for Oscar Mayer. “Through our sponsorship, we’re able to connect with fans in a whole new way from our paint schemes to pre-race celebrations. We look forward to supporting the sport and No. 6 over the next two seasons and feeding people’s love of meat, both on and off the track.”\n\nFans can catch Ryan sizzling around the track in NASCAR’s tastiest paint schemes highlighting Oscar Mayer’s quality meat offerings for the whole family, including bacon, hot dogs and cold cuts.\n\nTo celebrate the two-year extension, Oscar Mayer is giving fans the chance to design a 2020 paint scheme for the No. 6 Oscar Mayer Ford Mustang. Starting today, meat-loving fans can head to Oscar Mayer’s social channels (Facebook, Twitter or Instagram) to download a car template and put their creative pedal to the metal by designing their own meat-inspired paint scheme. The winning design will race at the TicketGuardian 500 in Phoenix on March 8, 2020. Interested fans can keep an eye on Oscar Mayer’s social channels for more details on how to submit their designs and when the window for submission will close.\n\n“We’re obviously excited to continue our relationship with such a great brand in Oscar Mayer and the Kraft-Heinz Company,” said Newman. “The Oscar Mayer team and everyone at Roush Fenway has done a great job on collaborating on various innovative ideas throughout this season, and we’re looking forward to more creative excitement both on and off the track in the future.”\n\nOscar Mayer made its return to Roush Fenway in 2018 at the famed Darlington Raceway and served as the primary sponsor for seven races during Newman’s run to the 2019 NASCAR Playoffs.\n\nNewman has scored three top-five and 13 top-10 finishes in 2019. He has finished inside the top 15 in 20 races in 2019 and came inches short of putting the No. 6 in victory lane two weeks ago at Talladega Superspeedway.\n\nPrior to last season, Oscar Mayer appeared as a primary sponsor on NASCAR Hall-of-Famer Mark Martin’s Ford in 2004 and served as an associate partner with Roush Fenway Racing in the early 2000s and was featured on Matt Kenseth’s No. 17 Ford and Kurt Busch’s No. 97 Ford, when NASCAR Hall-of-Fame owner Jack Roush led the team to back-to-back Cup championships in 2003 and 2004.\n\nAlong with the Oscar Mayer red and yellow displayed across the No. 6 Mustang this season, Oscar Mayer will bring miles of smiles to fans throughout the 2020 season with the help of the Oscar Mayer Wienermobile and the Hotdoggers. To keep up with the vehicle and see exactly what races it will be at, follow along at https://www.oscarmayer.com/wienermobile.\n\nFor more information about Oscar Mayer bacon, Deli Fresh and hot dogs, visit OscarMayer.com or Facebook, Twitter or Instagram.\n\nAbout The Kraft Heinz Company \n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit https://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\n\nAbout Roush Fenway Racing \n\nRoush Fenway Racing is one of the most successful teams in NASCAR history. In its 32nd season, Roush Fenway is a leader in driver development, having launched the careers for many of the top drivers in the sport. Off-track, Roush Fenway is a leader in NASCAR marketing solutions, producing multiple award-winning Social Media, digital content and experiential marketing campaigns. Roush Fenway is co-owned by NASCAR Hall of Famer Jack Roush and Fenway Sports Group, parent company of Major League Baseball’s Boston Red Sox and English Premier League’s Liverpool F.C. Visit RoushFenway.com, become a fan on Facebook and Instagram, and follow on Twitter at @roushfenway. \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005645/en/\nLynne Galia\n847-646-4396\nLynne.Galia@kraftheinz.com\n\nJenna Perlman\n312-377-4130\nJenna.Perlman@icfnext.com\n\nKevin Woods\n704-720-4642\nKWoods@roushfenway.com\nSource: The Kraft Heinz Company"
    },
    {
        "title": "MR. PEANUT and JVN Want to Help YOU Feel Your Best Inside and Out This Movember",
        "subtitle": "",
        "date": "Oct 23, 2019 11:29AM EDT",
        "content": "\nThis Iconic Duo are dishing out health and grooming tips for the men’s health movement\n    PITTSBURGH & CHICAGO--(BUSINESS WIRE)--\nMR. PEANUT always has men’s backs, especially when it comes to their health. To support Movember, the leading global men’s health charity dedicated to changing the face of men’s health and encourage men everywhere to join the cause, MR. PEANUT is teaming up with grooming expert and television personality Jonathan Van Ness to help “Mo Bros” everywhere feel their best inside and out.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191023005590/en/Mr. Peanut and Jonathan Van Ness Support Movember (Photo: Business Wire)\nThroughout Movember, MR. PEANUT and JVN are taking to social media to shell out advice for the men’s health movement and striving to bring more openness to the men’s health discussion. Three Movember participants video chatted with the legume and hair guru to get tips on how to properly grow moustaches, keep themselves groomed throughout the month and maintain their best selves.\n\n“MR. PEANUT is excited to support the Movember cause again this year and help bring more openness to discussions around men’s health,” said Samantha Hess, brand manager for PLANTERS. “As a grooming expert, moustache enthusiast and advocate for body positivity and care, Jonathan is truly the perfect partner for MR. PEANUT to enable discussions around men’s health.”\n\n“My mission in life is to help people feel amazing inside and out—and that means giving TLC to your gorgeous self, from your moustache to your health,” said Jonathan Van Ness. “I’ve always been nuts about PLANTERS so supporting this meaningful Movember movement with the legendary MR. PEANUT is the dream.”\n\n“As the leading men’s health charity dedicated to changing the face of men’s health, Movember understands the importance of making men feel more comfortable about discussing their health,” said Mark Hedstrom, US Country Director of Movember. “Working with MR. PEANUT and Jonathan Van Ness will help us support Mo Bros everywhere to take action to live happier, healthier and longer lives.”\n\nPLANTERS continues to support the Movember movement with a donation to bring men’s health issues to light. Fans can follow @MRPEANUT on Twitter to watch the videos and support MR. PEANUT’s page on Movember.com. For those in Los Angeles or New York City during Movember’s Undie Run, click here to learn more.\n\nFor more information, visit Planters.com and follow MR. PEANUT on Twitter @MrPeanut.\n\nABOUT THE KRAFT HEINZ COMPANY\n\nFor 150 years, we have produced some of the world’s most beloved products at The Kraft Heinz Company (NASDAQ: KHC). Our Vision is To Be the Best Food Company, Growing a Better World. We are one of the largest global food and beverage companies, with 2018 net sales of approximately $26 billion. Our portfolio is a diverse mix of iconic and emerging brands. As the guardians of these brands and the creators of innovative new products, we are dedicated to the sustainable health of our people and our planet. To learn more, visit http://www.kraftheinzcompany.com/ or follow us on LinkedIn and Twitter.\n\nMOVEMBER\n\nMovember is the leading global men’s health charity. The charity raises funds to deliver innovative, breakthrough research and support programs that enable men to live happier, healthier and longer lives. Committed to disrupting the status quo, millions have joined the movement, helping fund over 1,250 projects focusing on prostate cancer, testicular cancer and suicide prevention. In addition to tackling key health issues faced by men, Movember is working to encourage men to stay healthy in all areas of their life, with a focus on men staying socially connected and becoming more open to discussing their health and significant moments in their lives. The charity’s vision is to have an everlasting impact on the face of men’s health. To donate or learn more, please visit Movember.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191023005590/en/\nLynne Galia\nKraft Heinz\n847-646-4396\nlynne.galia@kraftheinz.com\n\nTaylor Higgins\nICF Next\n312-577-1773\ntaylor.higgins@icfnext.com\nSource: Kraft Heinz Company"
    }
]