[
    {
        "title": "KLA Introduces New IC Metrology Systems",
        "subtitle": "",
        "date": "Feb 24, 2020 4:05PM EST",
        "content": "MILPITAS, Calif., Feb. 24, 2020 /PRNewswire/ -- Today KLA Corporation (NASDAQ: KLAC) announced the Archer™ 750 imaging-based overlay metrology system and the SpectraShape™ 11k optical critical dimension (\"CD\") metrology system for integrated circuit (\"IC\" or \"chip\") manufacturing. As each layer in a chip is constructed, the Archer 750 helps verify that pattern features are correctly aligned to features on previous layers, while the SpectraShape 11k monitors the shapes of three-dimensional structures, such as transistors and memory cells, to ensure they remain in spec. By identifying subtle variations in pattern alignment or feature shape, these new metrology systems help IC manufacturers maintain strict control of the complex processes required to bring high-performance memory and logic chips to market, for applications such as 5G, AI, data centers, and edge computing.\"IC manufacturers are facing process tolerances measured on the atomic scale as they integrate novel structures and new materials into leading-edge chips,\" said Jon Madsen, senior vice president and general manager of the Metrology division at KLA. \"KLA plays a key part in ensuring that these chips can be manufactured cost-effectively with high quality standards. Today I'm proud to announce two additions to our portfolio of metrology solutions, representing the hard work and creative thinking of a top-notch, multi-disciplinary team of engineers and scientists. The new SpectraShape 11k and Archer 750 systems bring much-needed process control capabilities to our fab customers, helping them to produce the innovative electronics that move our world forward.\"  The Archer 750 overlay metrology system generates accurate and robust measurements of overlay error in the presence of process variation, while achieving productivity levels previously seen only with scatterometry-based overlay systems. This breakthrough system delivers accurate, fast feedback across a range of layers, helping lithographers identify process excursions inline and improve overall patterning integrity, for faster yield ramp and more stable production of advanced logic, DRAM and 3D NAND devices.  The SpectraShape 11k CD and dimensional shape metrology system provides an unprecedented combination of sensitivity and productivity, and accommodates materials, structures and wafer shapes that were previously inaccessible. With its ability to measure advanced logic, DRAM and 3D NAND device features with high precision and speed, the SpectraShape 11k enables quick identification of process issues and rigorous process monitoring during production.More information about the new metrology systems and the technology advances that enable their enhanced performance can be found on the portfolio information page.Numerous Archer 750 and SpectraShape 11k systems have been qualified and are in operation at leading IC manufacturers worldwide, where they provide critical feedback for many of the process steps used to produce innovative electronic devices. The Archer 750 and SpectraShape 11k are integrated with KLA's 5D Analyzer® advanced data analysis system, which supports real-time process control, and engineering monitoring and analysis. To maintain the high performance and productivity demanded by chip manufacturers, the Archer 750 and SpectraShape 11k metrology systems are backed by KLA's global comprehensive service network. About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-P).Forward Looking Statements:Statements in this press release other than historical facts, such as statements regarding the expected performance of the Archer 750 and SpectraShape 11k systems and the economic effects of metrology measurements for wafer, equipment, materials and chip manufacturing facilities, are forward-looking statements, and are subject to the Safe Harbor provisions created by the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on current information and expectations and involve risks and uncertainties. Actual results may differ materially from those projected in such statements due to various factors, including delays in the adoption of new technologies (whether due to cost or performance issues or otherwise), the introduction of competing products by other companies or unanticipated technology challenges or limitations that affect the implementation, performance or use of KLA's products.Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg View original content to download multimedia:http://www.prnewswire.com/news-releases/kla-introduces-new-ic-metrology-systems-301010093.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Prices Senior Notes Offering",
        "subtitle": "",
        "date": "Feb 19, 2020 7:45PM EST",
        "content": "MILPITAS, Calif., Feb. 19, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced it has entered into a firm commitment underwriting agreement on Feb. 19, 2020 to sell $750 million aggregate principal amount of its 3.300% Senior Notes due 2050 (the \"notes\") under an automatic shelf registration statement on file with the Securities and Exchange Commission (the \"SEC\"). The offering is expected to settle on Feb. 28, 2020, subject to customary closing conditions.Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg The notes will bear interest at a rate of 3.300% per year. Interest on the notes will be payable semi-annually on Mar. 1 and Sept. 1 of each year, commencing on Sept. 1, 2020.KLA estimates that the net proceeds from the sale of the notes will be approximately $741.2 million after deducting the estimated underwriting discounts and estimated offering expenses. KLA intends to use approximately $523.8 million of the net proceeds of this offering to redeem $500.0 million in aggregate principal amount of its 4.125% senior notes due 2021, and the remaining net proceeds for general corporate purposes, which may include repayment of amounts outstanding under KLA's credit agreement. Citigroup Global Markets Inc., J.P. Morgan Securities LLC, Wells Fargo Securities, LLC, BofA Securities, Inc., MUFG Securities Americas Inc., and SunTrust Robinson Humphrey, Inc. are acting as joint book-running managers of the offering.KLA has filed an effective registration statement (including a preliminary prospectus supplement and accompanying base prospectus) with the SEC for the offering to which this communication relates. Before you invest, you should read the effective registration statement (including the preliminary prospectus supplement and accompanying base prospectus) for more complete information about KLA and this offering. You may obtain copies of these documents free of charge by visiting EDGAR on the SEC website at www.sec.gov. Alternatively, copies may be obtained from Citigroup Global Markets Inc. at: Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, Telephone: (800) 831-9146; prospectus@citi.com, J.P. Morgan Securities LLC at: 383 Madison Avenue, New York, NY 10179, Attn: Investment Grade Syndicate Desk-3rd Floor or by calling collect at (212) 834-4533, Wells Fargo Securities, LLC at: 608 2nd Avenue South, Suite 1000, Minneapolis, MN 55402, Attn: WFS Customer Service, Email: wfscustomerservice@wellsfargo.com, Toll-Free: 1-800-645-3751, BofA Securities, Inc. at: 200 North College Street, 3rd Floor, Charlotte, NC 28255, Attn: Prospectus Department, Email: dg.prospectus_requests@bofa.com, Toll-Free: 1-800-294-1322, MUFG Securities Americas Inc. at: 1221 Avenue of the Americas, 6th Floor, New York, NY 10020, Attn: Capital Markets Group, Phone: 877-649-6848, or SunTrust Robinson Humphrey, Inc. at: 303 Peachtree Street, Atlanta, GA 30308, Email: STRHdocs@SunTrust.com, Phone: 800-685-4786.This press release shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of these securities, in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. Forward-Looking Statements: Statements in this press release other than historical facts, such as statements regarding KLA's anticipated use of proceeds from this offering, are forward-looking statements, and are subject to the Safe Harbor provisions created by the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on current information and expectations and involve a number of risks and uncertainties. Actual results may differ materially from those projected in such statements due to various factors, including but not limited to those identified in KLA's Quarterly Report on Form 10-Q for the quarter ended Dec. 31, 2019, and other filings with the SEC (including, but not limited to, the risk factors described therein). KLA assumes no obligation to, and does not currently intend to, update these forward-looking statements. About KLA:  KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F). View original content:http://www.prnewswire.com/news-releases/kla-prices-senior-notes-offering-301008017.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Offering Of Senior Notes",
        "subtitle": "",
        "date": "Feb 19, 2020 9:15AM EST",
        "content": "MILPITAS, Calif., Feb. 19, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced that it intends to offer, subject to market and other conditions, senior notes under an automatic shelf registration statement on file with the Securities and Exchange Commission (SEC). https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg KLA intends to use approximately $523.6 million of the net proceeds of the offering to redeem $500.0 million in aggregate principal amount of its 4.125% senior notes due 2021, and the remaining net proceeds for general corporate purposes, which may include repayment of amounts outstanding under KLA's credit agreement. Citigroup Global Markets Inc., J.P. Morgan Securities LLC, Wells Fargo Securities, LLC, BofA Securities, Inc., MUFG Securities Americas Inc., and SunTrust Robinson Humphrey, Inc. are acting as joint book-running managers of the offering.KLA has filed an effective registration statement (including a preliminary prospectus supplement and accompanying base prospectus) with the SEC for the offering to which this communication relates. Before you invest, you should read the effective registration statement (including the preliminary prospectus supplement and accompanying base prospectus) for more complete information about KLA and this offering. You may obtain copies of these documents free of charge by visiting EDGAR on the SEC website at www.sec.gov. Alternatively, copies may be obtained from Citigroup Global Markets Inc. at: Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, Telephone: (800) 831-9146; prospectus@citi.com, J.P. Morgan Securities LLC at: 383 Madison Avenue, New York, NY 10179, Attn: Investment Grade Syndicate Desk-3rd Floor or by calling collect at (212) 834-4533, Wells Fargo Securities, LLC at: 608 2nd Avenue South, Suite 1000, Minneapolis, MN 55402, Attn: WFS Customer Service, Email: wfscustomerservice@wellsfargo.com, Toll-Free: 1-800-645-3751, BofA Securities, Inc. at: 200 North College Street, 3rd Floor, Charlotte, NC 28255, Attn: Prospectus Department, Email: dg.prospectus_requests@bofa.com, Toll-Free: 1-800-294-1322, MUFG Securities Americas Inc. at: 1221 Avenue of the Americas, 6th Floor, New York, NY 10020, Attn: Capital Markets Group, Phone: 877-649-6848, or SunTrust Robinson Humphrey, Inc. at: 303 Peachtree Street, Atlanta, GA 30308, Email: STRHdocs@SunTrust.com, Phone: 800-685-4786.This press release shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of these securities, in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. Forward-Looking Statements: Statements in this press release other than historical facts, such as statements regarding KLA's intention to offer, subject to market and other conditions, senior notes and the anticipated use of proceeds thereof, are forward-looking statements, and are subject to the Safe Harbor provisions created by the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on current information and expectations, and involve a number of risks and uncertainties. Actual results may differ materially from those projected in such statements due to various factors, including but not limited to those identified in KLA's Quarterly Report on Form 10-Q for the quarter ended Dec. 31, 2019, and other filings with the SEC (including, but not limited to, the risk factors described therein). KLA assumes no obligation to, and does not currently intend to, update these forward-looking statements. About KLA:  KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-announces-offering-of-senior-notes-301007292.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Names Marie Myers To Board Of Directors",
        "subtitle": "",
        "date": "Feb 13, 2020 4:05PM EST",
        "content": "MILPITAS, Calif., Feb. 13, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced the appointment of Marie Myers to its board of directors.https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg A multi-faceted strategic finance executive with a proven track record in driving innovation and global business development and spearheading transformational change, Myers brings a wealth of experience to the KLA board. She also currently serves on the board of directors of F5 Networks, Inc. \"We're excited to have Marie Myers join the KLA board,\" commented Edward W. (Ned) Barnholt, chairman of the board of KLA. \"Marie's extensive experience in global financial leadership for a multinational technology company, and her expertise in advanced data analytics and artificial intelligence make her an ideal fit for KLA's Board as we execute our strategies for growth.\" Myers was most recently the CFO of UiPath, a robotics process automation software company and prior to that she served as the global controller of Hewlett Packard (HP), where she was responsible for HP's financial statements and global financial operations. In her twenty-year career at HP and Compaq, Marie held various leadership positions in finance, including VP of finance strategy, sales, and Hp.com, as well as head of audit, and CFO of the personal systems group.She has been widely recognized for her leadership expertise and contributions as a technology executive. Myers is also a passionate advocate in the community. She founded and is president emeritus of Anti-Gray Market Alliance and serves on the advisory board for the University of St. Thomas, Houston, the Girlstart Council for Houston and the U.S. advisory board for the University of Queensland North America.About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-names-marie-myers-to-board-of-directors-301004878.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Declares Regular Cash Dividend",
        "subtitle": "",
        "date": "Feb 11, 2020 4:05PM EST",
        "content": "MILPITAS, Calif., Feb. 11, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that its board of directors has declared a quarterly cash dividend of $0.85 per share on its common stock, payable on March 5, 2020 to KLA shareholders of record as of the close of business on Feb. 22, 2020. https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-declares-regular-cash-dividend-301003127.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Upcoming Investor Presentation",
        "subtitle": "",
        "date": "Feb 6, 2020 4:05PM EST",
        "content": "MILPITAS, Calif., Feb. 6, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that a live audio webcast of the following investor presentation will be available as described below:The live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available for the following 30 days.Logo: https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg  About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F). View original content:http://www.prnewswire.com/news-releases/kla-announces-upcoming-investor-presentation-301000563.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Corporation Reports Fiscal 2020 Second Quarter Results",
        "subtitle": "",
        "date": "Feb 4, 2020 4:05PM EST",
        "content": "MILPITAS, Calif., Feb. 4, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced operating results for its second quarter of fiscal year 2020, which ended on Dec. 31, 2019, and reported GAAP net income attributable to KLA of $381 million and GAAP earnings per diluted share attributable to KLA of $2.40 on revenues of $1.51 billion.Logo: https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg \"KLA once again demonstrated solid execution in the December quarter, delivering results in the upper end of the range of guidance, and capping multiple records across revenue, GAAP EPS and non-GAAP EPS for the quarter,\" commented Rick Wallace, president and CEO of KLA. \"As we begin the new calendar year, we are excited with the growth opportunities that lie ahead for KLA, with the industry outlook calling for growth led by technology transitions in advanced Logic, expanding investment in EUV, and with the expectation that Memory investment will improve in the calendar year. As the leading supplier of process control and specialty semiconductor process equipment for semiconductor and related electronics industries, and supported by a large and growing services business, KLA is uniquely positioned to benefit from this growth while continuing to deliver high levels of profitability.\"A reconciliation between GAAP operating results and non-GAAP operating results is provided following the financial statements included in this release. Non-GAAP results include the impact of recurring stock-based compensation, but exclude the impact of acquisitions or pending acquisitions, restructuring, severance, merger and other related charges and certain discrete tax items. KLA will discuss the results for its fiscal year 2020 second quarter, along with its outlook, on a conference call today beginning at 2:00 p.m. Pacific Time. A webcast of the call will be available at: www.kla.com.About KLA:KLA Corporation (\"KLA\") develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at: www.kla.com. Use of Non-GAAP Financial Information:The non-GAAP and supplemental information provided in this press release is a supplement to, and not a substitute for, KLA's financial results presented in accordance with United States GAAP.To supplement KLA's condensed consolidated financial statements presented in accordance with GAAP, the company provides certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses (benefits), as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of KLA's operating performance and its prospects in the future. Specifically, KLA believes that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to KLA's financial performance by excluding certain costs and expenses (benefits) that the company believes are not indicative of its core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses (benefits) to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.Note Regarding Forward-Looking Statements:This release contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements, including statements regarding the industry outlook on growth, are subject to risks and uncertainties. For the factors that may cause actual results to differ materially from those projected and anticipated in the forward-looking statements in this release, please refer to KLA's annual report on Form 10-K for the year ended June 30, 2019, subsequently filed quarterly reports on Form 10-Q and other filings with the Securities and Exchange Commission (including, without limitation, the risk factors described therein). Except as otherwise specifically indicated, the information included in this release is as of the date it is delivered. KLA assumes no obligation to, and does not currently intend to, update these forward-looking statements.To supplement our condensed consolidated financial statements presented in accordance with GAAP, we provide certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses, as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of our operating performance and our prospects in the future. Specifically, we believe that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to our financial performance by excluding certain costs and expenses that we believe are not indicative of our core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.  View original content:http://www.prnewswire.com/news-releases/kla-corporation-reports-fiscal-2020-second-quarter-results-300998961.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Live Webcast To Review Second Quarter Fiscal Year 2020 Results",
        "subtitle": "",
        "date": "Jan 15, 2020 4:15PM EST",
        "content": "MILPITAS, Calif., Jan. 15, 2020 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that the company will conduct a live audio webcast to review its second quarter fiscal year 2020 results on Tuesday, Feb. 4, 2020 at 2 p.m. PT.https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg The live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available for the following 30 days.About KLA: KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F). View original content:http://www.prnewswire.com/news-releases/kla-announces-live-webcast-to-review-second-quarter-fiscal-year-2020-results-300987094.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Upcoming Investor Presentation",
        "subtitle": "",
        "date": "Dec 3, 2019 6:15PM EST",
        "content": "MILPITAS, Calif., Dec. 3, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that a live audio webcast of the following investor presentation will be available as described below:Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg The live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available for the following 30 days.About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).   View original content:http://www.prnewswire.com/news-releases/kla-announces-upcoming-investor-presentation-300968687.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Upcoming Investor Presentation",
        "subtitle": "",
        "date": "Nov 20, 2019 4:15PM EST",
        "content": "MILPITAS, Calif., Nov. 20, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that a live audio webcast of the following investor presentation will be available as described below:The live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available for the following 30 days.https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F). View original content:http://www.prnewswire.com/news-releases/kla-announces-upcoming-investor-presentation-300962411.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Declares Regular Cash Dividend",
        "subtitle": "",
        "date": "Nov 6, 2019 4:05PM EST",
        "content": "MILPITAS, Calif., Nov. 6, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that its board of directors has declared a quarterly cash dividend of $0.85 per share on its common stock, payable on Dec. 3, 2019 to KLA shareholders of record as of the close of business on Nov. 18, 2019. https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-declares-regular-cash-dividend-300953120.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Corporation Reports Fiscal 2020 First Quarter Results",
        "subtitle": "- Record quarterly revenue of $1.4 billion, above the guidance range of $1.31 to $1.39 billion",
        "date": "Oct 30, 2019 4:05PM EDT",
        "content": "MILPITAS, Calif., Oct. 30, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced operating results for its first quarter of fiscal year 2020, which ended on Sept. 30, 2019, and reported GAAP net income attributable to KLA of $347 million and GAAP earnings per diluted share attributable to KLA of $2.16 on revenues of $1,413 million.Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg  \"KLA delivered a strong result in the September quarter, with revenue and GAAP and non-GAAP EPS finishing above the range of guidance, a result of solid execution in what continues to be a challenging overall industry environment,\" commented Rick Wallace, president and CEO of KLA. \"As a global leader in process control and supplier of process-enabling solutions for the data era, KLA is at the forefront of the most important industry trends and technology inflections in the electronics industry. Our performance in the September quarter demonstrates KLA is benefiting from our long-term strategies for growth, technology leadership and operational excellence.\"A reconciliation between GAAP operating results and non-GAAP operating results is provided following the financial statements included in this release. Non-GAAP results include the impact of recurring stock-based compensation, but exclude the impact of acquisitions or pending acquisitions, restructuring, severance, merger and other related charges and certain discrete tax items. KLA will discuss the results for its fiscal year 2020 first quarter, along with its outlook, on a conference call today beginning at 2 p.m. PT. A webcast of the call will be available at: www.kla.com.About KLA:KLA Corporation, formerly known as KLA-Tencor Corporation, (aka \"KLA\") develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at http://www.kla.com (KLAC-F).Use of Non-GAAP Financial Information:The non-GAAP and supplemental information provided in this press release is a supplement to, and not a substitute for, KLA's financial results presented in accordance with United States GAAP.To supplement KLA's condensed consolidated financial statements presented in accordance with GAAP, the company provides certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses (benefits), as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of KLA's operating performance and its prospects in the future. Specifically, KLA believes that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to KLA's financial performance by excluding certain costs and expenses (benefits) that the company believes are not indicative of its core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses (benefits) to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.     To supplement our condensed consolidated financial statements presented in accordance with GAAP, we provide certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses, as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of our operating performance and our prospects in the future. Specifically, we believe that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to our financial performance by excluding certain costs and expenses that we believe are not indicative of our core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.  View original content:http://www.prnewswire.com/news-releases/kla-corporation-reports-fiscal-2020-first-quarter-results-300948480.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Live Webcast To Review First Quarter Fiscal Year 2020 Results",
        "subtitle": "",
        "date": "Oct 15, 2019 4:15PM EDT",
        "content": "MILPITAS, Calif., Oct. 15, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that the company will conduct a live audio webcast to review its first quarter fiscal year 2020 results on Wednesday, Oct. 30, 2019 at 2 p.m. PT.Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpgThe live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available for the following 30 days.About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F). View original content:http://www.prnewswire.com/news-releases/kla-announces-live-webcast-to-review-first-quarter-fiscal-year-2020-results-300938205.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "SHAREHOLDER ALERT: Purcell Julie & Lefkowitz LLP Is Investigating KLA Corporation for Potential Breaches of Fiduciary Duty By Its Board of Directors",
        "subtitle": "",
        "date": "Sep 23, 2019 8:06AM EDT",
        "content": "NEW YORK, Sept. 23, 2019 /PRNewswire/ -- Purcell Julie & Lefkowitz LLP, a class action law firm dedicated to representing shareholders nationwide, is investigating a potential breach of fiduciary duty claim involving the board of directors of KLA Corporation (NASDAQ: KLAC). If you are a shareholder of KLA Corporation and are interested in obtaining additional information regarding this investigation, free of charge, please visit us at:http://pjlfirm.com/kla-corporation/ You may also contact Robert H. Lefkowitz, Esq. either via email at rl@pjlfirm.com or by telephone at 212-725-1000.  One of our attorneys will personally speak with you about the case at no cost or obligation. Purcell Julie & Lefkowitz LLP is a law firm exclusively committed to representing shareholders nationwide who are victims of securities fraud, breaches of fiduciary duty and other types of corporate misconduct. For more information about the firm and its attorneys, please visit http://pjlfirm.com.  Attorney advertising. Prior results do not guarantee a similar outcome.   View original content:http://www.prnewswire.com/news-releases/shareholder-alert-purcell-julie--lefkowitz-llp-is-investigating-kla-corporation-for-potential-breaches-of-fiduciary-duty-by-its-board-of-directors-300923077.htmlSOURCE  Purcell Julie & Lefkowitz LLP"
    },
    {
        "title": "KLA Corporation Hosts Investor Day",
        "subtitle": "- Announces 13% increase in quarterly dividend level to $0.85 per share from $0.75",
        "date": "Sep 17, 2019 6:30AM EDT",
        "content": "MILPITAS, Calif, Sept. 17, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) will hold an investor day today in New York City with presentations given by Rick Wallace, president and CEO, Bren Higgins, executive vice president and CFO, and other senior executives.Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg Management will present strategic growth initiatives and provide an in-depth review of the company's systems, services, and Orbotech businesses, as well as growth opportunities in automotive electronics.In addition, the company is announcing an increase in the quarterly dividend level to $0.85 per share, the tenth consecutive annual increase, as well as authorization from the board of directors to repurchase up to $1 billion of the company's common stock. This is in addition to the existing share repurchase authorization, which had $859 million remaining as of June 30, 2019.\"We are excited to host KLA Corporation's investor day to provide the investment community with a deeper understanding of our company and the opportunities that lie before us as we execute our strategic objectives,\" said Rick Wallace, president and CEO. \"With the recent acquisition of Orbotech, we have have extended our reach in the global electronics value chain, and we continue to execute our profitable growth strategy, with the KLA operating model as the framework to drive performance,\" added Wallace. \"The announced increase in the quarterly dividend level and new share repurchase authorization reflect our confidence in these strategies and the opportunities that lie ahead for KLA.\"Event Webcast DetailsThe presentation, which includes question and answer sessions, will begin at 8:30 a.m. (ET) and is expected to conclude at approximately 12:30 p.m. The public may access the event through a live webcast available on the Investor Relations section of KLA Corporation's website. The conference will also be available by dialing the following numbers: (855) 459-5948 in the U.S. or (330) 863-3386 for international participants; Conference ID 4966377. Presentation materials will be posted to the Investor Relations section of the Company's website today at approximately 8:30 a.m. (ET). A replay of the webcast will be available following the presentation at the same link listed above.About KLAKLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F). Forward-Looking StatementsThis press release contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934.  These forward-looking statements, including statements regarding our anticipated revenue and non-GAAP diluted earnings per share for the quarter ending September 30, 2019.  For the factors that may cause actual results to differ materially from those projected and anticipated in the forward-looking statements in this presentation, please refer to the Company's annual report on Form 10-K for the year ended June 30, 2019 and other filings with the Securities and Exchange Commission (including, without limitation, the risk factors described therein).   View original content:http://www.prnewswire.com/news-releases/kla-corporation-hosts-investor-day-300919169.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Joins Automotive Electronics Council",
        "subtitle": "",
        "date": "Aug 27, 2019 4:35PM EDT",
        "content": "MILPITAS, Calif., Aug. 27, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that the Automotive Electronics Council (AEC), the organization that sets qualification standards for electronic components in the automotive industry, has accepted the company as an associate member. As the first semiconductor equipment company to join AEC, KLA helps chip manufacturers implement Zero Defect strategies aimed at optimizing the reliability of automotive electronics.  Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg As vehicles increasingly rely on semiconductor chips for enhanced performance, electrification, and assisted and autonomous driving capabilities, chip quality requirements are more demanding than ever. A modern electric car with autonomous features has four times the number of semiconductor devices than a typical gas-powered automobile today, to support everything from basic functionality to safety-critical features. \"For automakers, reliability is synonymous with brand reputation. Consumers are unlikely to be repeat buyers if they experience failures,\" noted Oreste Donzella, executive vice president and chief marketing officer at KLA. \"Today, automotive chip manufacturers are relying on KLA's tools and services to find defects that cause yield or latent reliability failures. However, reliability is truly a team effort. By joining AEC, we can work collaboratively with the entire automotive electronics ecosystem to work towards the Zero Defect imperative.\"KLA is building a second headquarters in Ann Arbor, Michigan to encourage further collaboration with the automotive industry. Visit our website for more information about KLA's expansion into Michigan or the continued work in the automotive ecosystem. About KLA: KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-joins-automotive-electronics-council-300908010.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Corporation Reports Fiscal 2019 Fourth Quarter And Full Year Results",
        "subtitle": "",
        "date": "Aug 5, 2019 4:15PM EDT",
        "content": "MILPITAS, Calif., Aug. 5, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced operating results for its fourth quarter and fiscal year ended June 30, 2019. KLA reported GAAP net income attributable to KLA of $218 million and GAAP earnings per diluted share attributable to KLA of $1.35 on revenues of $1,258 million for the fourth quarter of fiscal year 2019. For the fiscal year ended June 30, 2019, the company reported GAAP net income attributable to KLA of $1,176 million and GAAP earnings per diluted share attributable to KLA of $7.49 on revenues of $4.6 billion.Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg \"In the fourth fiscal quarter KLA delivered results above the midpoint of our range of guidance, reflecting solid execution in a challenging business environment,\" commented Rick Wallace, president and chief executive officer. \"These results demonstrate KLA is benefitting from our strategies for growth and market leadership, which in combination with the recent acquisition of Orbotech, is translating to good relative performance for the company in calendar year 2019.\"Effective on the first day of fiscal 2019, the company adopted Accounting Standards Update 2014-09, Revenue from Contracts with Customers (\"ASC 606\"). Prior periods were not retrospectively restated, and accordingly, the condensed consolidated unaudited balance sheet as of June 30, 2018, and the condensed consolidated unaudited statements of operations for the three and twelve months ended June 30, 2018 and cash flows for the three months ended June 30, 2018 were prepared using accounting standards that were different from those in effect for the three and twelve months ended June 30, 2019.A reconciliation between GAAP operating results and non-GAAP operating results is provided following the financial statements included in this release. Non-GAAP results include the impact of stock-based compensation, but exclude the impact of acquisitions or pending acquisitions, restructuring, severance, merger and other related charges and certain discrete tax items. KLA will discuss the results for its fiscal year 2019 fourth quarter and full year, along with its outlook, on a conference call today beginning at 2 p.m. PT. A webcast of the call will be available at: www.kla.com.  About KLA:KLA Corporation, formerly known as KLA-Tencor Corporation, (aka \"KLA\") develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at http://www.kla.com (KLAC-F).Use of Non-GAAP Financial Information:The non-GAAP and supplemental information provided in this press release is a supplement to, and not a substitute for, KLA's financial results presented in accordance with United States GAAP.To supplement KLA's condensed consolidated financial statements presented in accordance with GAAP, the company provides certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses (benefits), as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of KLA's operating performance and its prospects in the future. Specifically, KLA believes that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to KLA's financial performance by excluding certain costs and expenses (benefits) that the company believes are not indicative of its core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses [benefits] to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.     To supplement our condensed consolidated financial statements presented in accordance with GAAP, we provide certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses, as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of our operating performance and our prospects in the future. Specifically, we believe that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to our financial performance by excluding certain costs and expenses that we believe are not indicative of our core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP. View original content:http://www.prnewswire.com/news-releases/kla-corporation-reports-fiscal-2019-fourth-quarter-and-full-year-results-300896528.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Declares Regular Cash Dividend",
        "subtitle": "",
        "date": "Aug 1, 2019 4:15PM EDT",
        "content": "MILPITAS, Calif., Aug. 1, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that its board of directors has declared a quarterly cash dividend of $0.75 per share on its common stock, payable on Sept. 3, 2019 to KLA shareholders of record as of the close of business on Aug. 15, 2019. Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpgAbout KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-declares-regular-cash-dividend-300893682.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces Live Webcast To Review Fourth Quarter Fiscal Year 2019 Results",
        "subtitle": "",
        "date": "Jul 18, 2019 4:15PM EDT",
        "content": "MILPITAS, Calif., July 18, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) announced today that the company will conduct a live audio webcast to review its fourth quarter fiscal year 2019 results on Monday, August 5, 2019 at 2 p.m. PDT. Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg The live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available on KLA's Investor Relations web page for 30 days following the webcast.About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-announces-live-webcast-to-review-fourth-quarter-fiscal-year-2019-results-300887496.htmlSOURCE  KLA Corporation"
    },
    {
        "title": "KLA Announces September 2019 Investor Day",
        "subtitle": "",
        "date": "Jul 9, 2019 9:00AM EDT",
        "content": " MILPITAS, Calif., July 9, 2019 /PRNewswire/ -- KLA Corporation (NASDAQ: KLAC) today announced that it will host an investor day on Tuesday, Sept. 17, 2019, at 8 a.m. ET in New York City. Registration and breakfast will be followed by formal presentations by Rick Wallace, president and CEO; Bren Higgins, executive vice president and CFO; as well as other members of executive management. The presentations will start at 8:30 a.m. ET and are expected to conclude at 12:30 p.m. ET, including a question and answer session. Logo - https://mma.prnewswire.com/media/806571/KLA_Corporation_Logo.jpg The live webcast will be available on the Investor Relations page of KLA's website at http://ir.kla.com/, and a replay of the webcast will remain available on KLA's Investor Relations web page for 30 days following the webcast.About KLA:KLA develops industry-leading equipment and services that enable innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. In close collaboration with leading customers across the globe, our expert teams of physicists, engineers, data scientists and problem-solvers design solutions that move the world forward. Additional information may be found at www.kla.com (KLAC-F).  View original content:http://www.prnewswire.com/news-releases/kla-announces-september-2019-investor-day-300881308.htmlSOURCE  KLA Corporation"
    }
]