[
    {
        "title": "Liberty Global Reports Full Year 2019 Results",
        "subtitle": "",
        "date": "Feb 13, 2020 4:15PM EST",
        "content": "\nExceeded full-year FCF guidance; achieved all other guidance targets\n\nRecord year for share repurchases with $3.2 billion spent in 2019\n\n2019 operating income down 11% YoY for continuing operations\n\nFull-year OFCF1 grew 35% YoY fueled by 22% decrease in capital intensity\n    Denver, Colorado--(BUSINESS WIRE)--\nLiberty Global plc today announced its full-year 2019 and Q4 2019 financial results. Our former operations in Austria, Germany, Hungary, Romania and the Czech Republic, along with our DTH business (collectively, the \"Discontinued Operations\") have been accounted for as discontinued operations. Unless otherwise indicated, the information in this release relates only to our continuing operations.\n\nCEO Mike Fries stated, \"2019 was a transformational year on many fronts. In July, we sold our operations in Germany, Hungary, Romania and the Czech Republic to Vodafone for over $21 billion. We are now geographically concentrated in five attractive Western European markets, while enjoying substantial financial firepower with over $11 billion of total liquidity.\n\nTechnologically, we continued to push the boundaries of our fiber-rich HFC networks by accelerating our gigabit broadband rollouts to more European homes and businesses. As a result, millions of our customers currently have access to 1 gigabit download speeds, far surpassing what our competitors are able to offer across the vast majority of our footprint.\n\nIn the U.K., our largest market, our focus on fixed-mobile convergence drove record mobile subscription growth in 2019. Last fall, we announced a transformational MVNO deal with Vodafone, which will allow Virgin Media to launch 5G mobile speeds. Combined with our fixed-line gigabit broadband speeds, our cutting-edge FMC bundles place us in an enviable position as we continue to extend the reach of our network with Project Lightning. And while we expect some unavoidable headwinds in 2020, we believe the medium-term outlook in the U.K. remains attractive, especially as we evaluate strategic options for value creation. From a leadership perspective, we recently appointed Severina Pascu as CFO and Deputy CEO of Virgin Media, and expect her depth of operating expertise to make a significant impact over the coming years.\n\nIn Switzerland, we are encouraged by the continued success of our turnaround plan. In January, we announced the appointment of Baptiest Coopmans as the incoming CEO of UPC Switzerland. He brings a wealth of experience to this important role. Meanwhile, we continue to believe the Swiss market remains ripe for fixed-mobile convergence over the medium term, and in addition to our organic growth, we will consider other strategic options in due course.\n\nLooking ahead to 2020, for the full year we are forecasting a mid-single-digit rebased1 OCF decline, mid-single-digit rebased1 OFCF growth and approximately $1 billion of Adjusted FCF2, which represents 30% year-over-year growth. Also, our Board of Directors has authorized a new $1 billion share repurchase plan.\"\n\nFull Year and Q4 Highlights (on a continuing operations basis unless otherwise noted)\n\nCustomer and Subscriber Growth \n\nRevenue Highlights\n\nThe following table presents (i) revenue of each of our consolidated reportable segments for the comparative periods and (ii) the percentage change from period to period on both a reported and rebased basis:\n\n______________________________\n\nN.M. - Not Meaningful\n\nQ4 2019 Rebased Revenue Growth - Segment Highlights\n\nOperating Income\n\nOperating Cash Flow Highlights\n\nThe following table presents (i) OCF of each of our consolidated reportable segments for the comparative periods, and (ii) the percentage change from period to period on both a reported and rebased basis:\n\n______________________________\n\nN.M. - Not Meaningful\n\nQ4 2019 Rebased Operating Cash Flow Growth - Segment Highlights\n\nOFCF Highlights\n\nThe following table presents (i) OFCF of each of our consolidated reportable segments for the comparative periods and (ii) the percentage change from period to period on a rebased basis:\n\nNet Earnings (Loss) Attributable to Liberty Global Shareholders\n\nLeverage and Liquidity\n\nShare Repurchase Program\n\nAs announced today, our Board of Directors has authorized a new $1 billion share repurchase program. Under the program, Liberty Global may acquire from time to time its Class A ordinary shares, Class C ordinary shares, or any combination of Class A and Class C ordinary shares. The program may be effected through open market transactions and/or privately negotiated transactions, which may include derivative transactions. The timing of the repurchase of shares pursuant to the program will depend on a variety of factors, including market conditions and applicable law. The program may be implemented in conjunction with brokers for the Company and other financial institutions with whom the Company has relationships within certain pre-set parameters and purchases may continue during closed periods in accordance with applicable restrictions. The program may be suspended or discontinued at any time.\n\nForward-Looking Statements and Disclaimer\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements with respect to our strategies, future growth prospects and opportunities; expectations with respect to our rebased OCF decline, our rebased OFCF growth and our Adjusted FCF; expectations with respect to our share repurchase plan; expected launch of 5G speeds at Virgin Media; anticipated headwinds in 2020; our medium-term outlook in the U.K. as well as in Switzerland; expected impacts of new leadership at Virgin Media and in Switzerland; expectations with respect to the development, launch and benefits of our innovative and advanced products and services; the strength of our balance sheet and tenor of our third-party debt; and other information and statements that are not historical fact. These forward-looking statements involve certain risks and uncertainties that could cause actual results to differ materially from those expressed or implied by these statements. These risks and uncertainties include events that are outside of our control, such as the continued use by subscribers and potential subscribers of our and our affiliates’ services and their willingness to upgrade to our more advanced offerings; our and our affiliates’ ability to meet challenges from competition, to manage rapid technological change or to maintain or increase rates to subscribers or to pass through increased costs to subscribers; the effects of changes in laws or regulation; the effects of the U.K.'s exit from the E.U.; general economic factors; our and our affiliates’ ability to obtain regulatory approval and satisfy regulatory conditions associated with acquisitions and dispositions; our and affiliates’ ability to successfully acquire and integrate new businesses and realize anticipated efficiencies from acquired businesses; the availability of attractive programming for our and our affiliates’ video services and the costs associated with such programming; our and our affiliates’ ability to achieve forecasted financial and operating targets; the outcome of any pending or threatened litigation; the ability of our operating companies and affiliates to access cash of their respective subsidiaries; the impact of our operating companies' and affiliates’ future financial performance, or market conditions generally, on the availability, terms and deployment of capital; fluctuations in currency exchange and interest rates; the ability of suppliers, vendors and contractors to timely deliver quality products, equipment, software, services and access; our and our affiliates’ ability to adequately forecast and plan future network requirements including the costs and benefits associated with network expansions; and other factors detailed from time to time in our filings with the Securities and Exchange Commission, including our most recently filed Form 10-K. These forward-looking statements speak only as of the date of this release. We expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statement contained herein to reflect any change in our expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.\n\nAbout Liberty Global\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, Lionsgate, the Formula E racing series and several regional sports networks. For more information, please visit www.libertyglobal.com or contact:\n\nBalance Sheets, Statements of Operations and Statements of Cash Flows\n\nThe consolidated balance sheets, statements of operations and statements of cash flows of Liberty Global are in our 10-K.\n\nRebase Information\n\nFor purposes of calculating rebased growth rates on a comparable basis for all businesses that we owned during 2019, we have adjusted our historical revenue, OCF and OFCF for the three months and year ended December 31, 2018 to (i) include the pre-acquisition revenue, OCF and P&E additions of entities acquired during 2019 in our rebased amounts for the three months and year ended December 31, 2018 to the same extent that the revenue, OCF and P&E additions of these entities are included in our results for the three months and year ended December 31, 2019, (ii) include revenue and costs for the temporary elements of transitional and other services provided to the VodafoneZiggo JV, Vodafone, Deutsche Telekom (the buyer of UPC Austria), Liberty Latin America and M7 Group (the buyer of UPC DTH), to reflect amounts related to these services equal to those included in our results for the three months and year ended December 31, 2019 and (iii) reflect the translation of our rebased amounts for the three months and year ended December 31, 2018 at the applicable average foreign currency exchange rates that were used to translate our results for the three months and year ended December 31, 2019. We have reflected the revenue, OCF and P&E additions of these acquired entities in our 2018 rebased amounts based on what we believe to be the most reliable information that is currently available to us (generally pre-acquisition financial statements), as adjusted for the estimated effects of (a) any significant differences between U.S. GAAP and local generally accepted accounting principles, (b) any significant effects of acquisition accounting adjustments, (c) any significant differences between our accounting policies and those of the acquired entities and (d) other items we deem appropriate. We do not adjust pre-acquisition periods to eliminate nonrecurring items or to give retroactive effect to any changes in estimates that might be implemented during post-acquisition periods. As we did not own or operate the acquired businesses during the pre-acquisition periods, no assurance can be given that we have identified all adjustments necessary to present the revenue, OCF and OFCF of these entities on a basis that is comparable to the corresponding post-acquisition amounts that are included in our historical results or that the pre-acquisition financial statements we have relied upon do not contain undetected errors. The adjustments reflected in our rebased amounts have not been prepared with a view towards complying with Article 11 of Regulation S-X. In addition, the rebased growth percentages are not necessarily indicative of the revenue, OCF and OFCF that would have occurred if these transactions had occurred on the dates assumed for purposes of calculating our rebased amounts or the revenue, OCF and OFCF that will occur in the future. The rebased growth percentages have been presented as a basis for assessing growth rates on a comparable basis, and are not presented as a measure of our pro forma financial performance.\n\nThe following table provides adjustments made to the 2018 amounts to derive our rebased growth rates for our continuing operations:\n\n_____________________\n\nSummary of Debt, Finance Lease Obligations & Cash and Cash Equivalents\n\nThe following table(i) details the U.S. dollar equivalent balances of the outstanding principal amount of our continuing operations debt, finance lease obligations and cash and cash equivalents at December 31, 2019:\n\n______________________\n\nProperty and Equipment Additions and Capital Expenditures\n\nThe table below highlights the categories of the property and equipment additions of our continuing operations for the indicated periods and reconciles those additions to the capital expenditures of our continuing operations that are presented in the consolidated statements of cash flows in our 10-K.\n\n____________________________\n\nARPU per Cable Customer Relationship\n\nThe following table provides ARPU per cable customer relationship for the indicated periods:\n\nMobile ARPU\n\nThe following tables provide ARPU per mobile subscriber for the indicated periods:\n\nFootnotes for Consolidated Operating Data and Subscriber Variance Tables\n\nAdditional General Notes to Tables:\n\nMost of our broadband communications subsidiaries provide telephony, broadband internet, data, video or other B2B services. Certain of our B2B revenue is derived from SOHO subscribers that pay a premium price to receive enhanced service levels along with video, internet or telephony services that are the same or similar to the mass marketed products offered to our residential subscribers. All mass marketed products provided to SOHOs, whether or not accompanied by enhanced service levels and/or premium prices, are included in the respective RGU and customer counts of our broadband communications operations, with only those services provided at premium prices considered to be “SOHO RGUs” or “SOHO customers.” To the extent our existing customers upgrade from a residential product offering to a SOHO product offering, the number of SOHO RGUs or SOHO customers will increase, but there is no impact to our total RGU or customer counts. With the exception of our B2B SOHO subscribers, we generally do not count customers of B2B services as customers or RGUs for external reporting purposes.\n\nIn Belgium, Telenet leases a portion of its network under a long-term finance lease arrangement. These tables include operating statistics for Telenet's owned and leased networks.\n\nWhile we take appropriate steps to ensure that subscriber statistics are presented on a consistent and accurate basis at any given balance sheet date, the variability from country to country in (i) the nature and pricing of products and services, (ii) the distribution platform, (iii) billing systems, (iv) bad debt collection experience and (v) other factors add complexity to the subscriber counting process. We periodically review our subscriber counting policies and underlying systems to improve the accuracy and consistency of the data reported on a prospective basis. Accordingly, we may from time to time make appropriate adjustments to our subscriber statistics based on those reviews.\n\nSubscriber information for acquired entities is preliminary and subject to adjustment until we have completed our review of such information and determined that it is presented in accordance with our policies.\n\nFootnotes\n\nGlossary\n\n10-Q or 10-K: As used herein, the terms 10-Q and 10-K refer to our most recent quarterly or annual report as filed with the Securities and Exchange Commission on Form 10-Q or Form 10-K, as applicable.\n\nAdjusted Free Cash Flow (FCF): net cash provided by our operating activities, plus (i) cash payments for third-party costs directly associated with successful and unsuccessful acquisitions and dispositions and (ii) expenses financed by an intermediary, less (a) capital expenditures, as reported in our consolidated statements of cash flows, (b) principal payments on amounts financed by vendors and intermediaries and (c) principal payments on finance leases (exclusive of the portions of the network lease in Belgium that we assumed in connection with certain acquisitions), with each item excluding any cash provided or used by our Discontinued Operations. We believe that our presentation of Adjusted Free Cash Flow provides useful information to our investors because this measure can be used to gauge our ability to service debt and fund new investment opportunities. Adjusted Free Cash Flow should not be understood to represent our ability to fund discretionary amounts, as we have various mandatory and contractual obligations, including debt repayments, which are not deducted to arrive at this amount. Investors should view Adjusted Free Cash Flow as a supplement to, and not a substitute for, U.S. GAAP measures of liquidity included in our consolidated statements of cash flows.\n\nThe following table provides a reconciliation of our net cash provided by operating activities from continuing operations to Adjusted Free Cash Flow for the indicated periods. In addition, in order to provide information regarding our Adjusted Free Cash Flow that excludes the Discontinued Operations, we also present Adjusted Free Cash Flow on a pro forma basis for the three months and year ended December 31, 2019 as if the sale of the Discontinued Operations had been completed on January 1, 2019.\n\n_______________\n\nARPU: Average Revenue Per Unit is the average monthly subscription revenue per average cable customer relationship or mobile subscriber, as applicable. Following the adoption of ASU 2014-09, subscription revenue excludes interconnect fees, channel carriage fees, mobile handset sales and late fees, but includes the amortization of installation fees. Prior to the adoption of ASU 2014-09, installation fees were excluded from subscription revenue. ARPU per average cable customer relationship is calculated by dividing the average monthly subscription revenue from residential cable and SOHO services by the average number of fixed-line customer relationships for the period. ARPU per average mobile subscriber is calculated by dividing residential mobile and SOHO revenue for the indicated period by the average number of mobile subscribers for the period. Unless otherwise indicated, ARPU per cable customer relationship or mobile subscriber is not adjusted for currency impacts. ARPU per RGU refers to average monthly revenue per average RGU, which is calculated by dividing the average monthly subscription revenue from residential and SOHO services for the indicated period, by the average number of the applicable RGUs for the period. Unless otherwise noted, ARPU in this release is considered to be ARPU per average cable customer relationship or mobile subscriber, as applicable. Fixed-line customer relationships, mobile subscribers and RGUs of entities acquired during the period are normalized. In addition, for purposes of calculating the percentage change in ARPU on a rebased basis, we adjust the prior-year subscription revenue, fixed-line customer relationships, mobile subscribers and RGUs, as applicable, to reflect acquisitions, dispositions, FX and the January 1, 2018 adoption of the new revenue recognition standard (ASU 2014-09, Revenue from Contracts with Customers) on a comparable basis with the current year, consistent with how we calculate our rebased growth for revenue and OCF, as further described in the body of this release.\n\nARPU per Mobile Subscriber: Our ARPU per mobile subscriber calculation that excludes interconnect revenue refers to the average monthly mobile subscription revenue per average mobile subscriber and is calculated by dividing the average monthly mobile subscription revenue (excluding handset sales and late fees) for the indicated period, by the average of the opening and closing balances of mobile subscribers in service for the period. Our ARPU per mobile subscriber calculation that includes interconnect revenue increases the numerator in the above-described calculation by the amount of mobile interconnect revenue during the period.\n\nBasic Video Subscriber: a home, residential multiple dwelling unit or commercial unit that receives our video service over our broadband network either via an analog video signal or via a digital video signal without subscribing to any recurring monthly service that requires the use of encryption-enabling technology. Encryption-enabling technology includes smart cards, or other integrated or virtual technologies that we use to provide our enhanced service offerings. We count RGUs on a unique premises basis. In other words, a subscriber with multiple outlets in one premises is counted as one RGU and a subscriber with two homes and a subscription to our video service at each home is counted as two RGUs.\n\nBlended fully-swapped debt borrowing cost: the weighted average interest rate on our aggregate variable- and fixed-rate indebtedness (excluding finance leases and including vendor financing obligations), including the effects of derivative instruments, original issue premiums or discounts and commitment fees, but excluding the impact of financing costs.\n\nB2B: Business-to-Business.\n\nCustomer Churn: the rate at which customers relinquish their subscriptions. The annual rolling average basis is calculated by dividing the number of disconnects during the preceding 12 months by the average number of customer relationships. For the purpose of computing churn, a disconnect is deemed to have occurred if the customer no longer receives any level of service from us and is required to return our equipment. A partial product downgrade, typically used to encourage customers to pay an outstanding bill and avoid complete service disconnection, is not considered to be disconnected for purposes of our churn calculations. Customers who move within our cable footprint and upgrades and downgrades between services are also excluded from the disconnect figures used in the churn calculation.\n\nEnhanced Video Subscriber: a home, residential multiple dwelling unit or commercial unit that receives our video service over our broadband network or through a partner network via a digital video signal while subscribing to any recurring monthly service that requires the use of encryption-enabling technology. Enhanced Video Subscribers are counted on a unique premises basis. For example, a subscriber with one or more set-top boxes that receives our video service in one premises is generally counted as just one subscriber. An Enhanced Video Subscriber is not counted as a Basic Video Subscriber. As we migrate customers from basic to enhanced video services, we report a decrease in our Basic Video Subscribers equal to the increase in our Enhanced Video Subscribers.\n\nFixed-Line Customer Relationships: the number of customers who receive at least one of our internet, video or telephony services that we count as RGUs, without regard to which or to how many services they subscribe. Fixed-Line Customer Relationships generally are counted on a unique premises basis. Accordingly, if an individual receives our services in two premises (e.g., a primary home and a vacation home), that individual generally will count as two Fixed-Line Customer Relationships. We exclude mobile-only customers from Fixed-Line Customer Relationships.\n\nFixed-Mobile Convergence (FMC): Fixed-mobile convergence penetration represents the number of customers who subscribe to both a fixed broadband internet service and postpaid mobile telephony service, divided by the total number of customers who subscribe to our fixed broadband internet service.\n\nHomes Passed: homes, residential multiple dwelling units or commercial units that can be connected to our networks without materially extending the distribution plant. Certain of our Homes Passed counts are based on census data that can change based on either revisions to the data or from new census results.\n\nInternet Subscriber: a home, residential multiple dwelling unit or commercial unit that receives internet services over our networks, or that we service through a partner network.\n\nMDU: Multiple Dwelling Unit.\n\nMobile Subscriber Count: the number of active SIM cards in service rather than services provided. For example, if a mobile subscriber has both a data and voice plan on a smartphone this would equate to one mobile subscriber. Alternatively, a subscriber who has a voice and data plan for a mobile handset and a data plan for a laptop would be counted as two mobile subscribers. Customers who do not pay a recurring monthly fee are excluded from our mobile telephony subscriber counts after periods of inactivity ranging from 30 to 90 days, based on industry standards within the respective country. In a number of countries, our mobile subscribers receive mobile services pursuant to prepaid contracts.\n\nMVNO: Mobile Virtual Network Operator.\n\nNPS: Net Promoter Score.\n\nOCF: As used herein, OCF has the same meaning as the term \"Adjusted OIBDA\" that is referenced in our 10-K. OCF is the primary measure used by our chief operating decision maker to evaluate segment operating performance. OCF is also a key factor that is used by our internal decision makers to (i) determine how to allocate resources to segments and (ii) evaluate the effectiveness of our management for purposes of annual and other incentive compensation plans. As we use the term, OCF is defined as operating income before depreciation and amortization, share-based compensation, provisions and provision releases related to significant litigation and impairment, restructuring and other operating items. Other operating items include (a) gains and losses on the disposition of long-lived assets, (b) third-party costs directly associated with successful and unsuccessful acquisitions and dispositions, including legal, advisory and due diligence fees, as applicable, and (c) other acquisition-related items, such as gains and losses on the settlement of contingent consideration. Our internal decision makers believe OCF is a meaningful measure because it represents a transparent view of our recurring operating performance that is unaffected by our capital structure and allows management to (1) readily view operating trends, (2) perform analytical comparisons and benchmarking between segments and (3) identify strategies to improve operating performance in the different countries in which we operate. We believe our OCF measure is useful to investors because it is one of the bases for comparing our performance with the performance of other companies in the same or similar industries, although our measure may not be directly comparable to similar measures used by other public companies. OCF should be viewed as a measure of operating performance that is a supplement to, and not a substitute for, operating income, net earnings or loss, cash flow from operating activities and other U.S. GAAP measures of income or cash flows.\n\nA reconciliation of our operating income to total OCF for our continuing operations is presented in the following table:\n\nOCF margin: calculated by dividing OCF by total revenue for the applicable period.\n\nOFCF: As used herein, Operating Free Cash Flow or \"OFCF\" represents OCF less property and equipment additions. OFCF is an additional metric that we use to measure the performance of our operations after considering the level of property and equipment additions incurred during the period. For limitations of OFCF, see the definition of OCF.\n\nA reconciliation of our total OCF to total OFCF for our continuing operations is presented in the following table:\n\nOFCF margin: OFCF margin is calculated by dividing OFCF by total revenue for the applicable period.\n\nProperty and equipment additions (P&E additions): includes capital expenditures on an accrual basis, amounts financed under vendor financing or finance lease arrangements and other non-cash additions.\n\nRGU: A Revenue Generating Unit is separately a Basic Video Subscriber, Enhanced Video Subscriber, Internet Subscriber or Telephony Subscriber. A home, residential multiple dwelling unit, or commercial unit may contain one or more RGUs. For example, if a residential customer in our U.K. market subscribed to our enhanced video service, fixed-line telephony service and broadband internet service, the customer would constitute three RGUs. Total RGUs is the sum of Basic Video, Enhanced Video, Internet and Telephony Subscribers. RGUs generally are counted on a unique premises basis such that a given premises does not count as more than one RGU for any given service. On the other hand, if an individual receives one of our services in two premises (e.g., a primary home and a vacation home), that individual will count as two RGUs for that service. Each bundled cable, internet or telephony service is counted as a separate RGU regardless of the nature of any bundling discount or promotion. Non-paying subscribers are counted as subscribers during their free promotional service period. Some of these subscribers may choose to disconnect after their free service period. Services offered without charge on a long-term basis (e.g., VIP subscribers or free service to employees) generally are not counted as RGUs. We do not include subscriptions to mobile services in our externally reported RGU counts. In this regard, our RGU counts exclude our separately reported postpaid and prepaid mobile subscribers.\n\nSIM: Subscriber Identification Module.\n\nSOHO: Small or Home Office Subscribers.\n\nTelephony Subscriber: a home, residential multiple dwelling unit or commercial unit that receives voice services over our networks, or that we service through a partner network. Telephony Subscribers exclude mobile telephony subscribers.\n\nU.S. GAAP: Accounting principles generally accepted in the United States.\n\nYoY: Year-over-year.\n\nAppendix - Supplemental OCF, P&E and OFCF information\n\nThe following table presents (i) OCF, (ii) property and equipment additions, (iii) OFCF and (iv) percentage change from period to period for OCF and OFCF on a rebased basis for each of our consolidated reportable segments:\n\n_______________\n\nCentrally-held Operating Cost Allocations\n\nDuring the fourth quarter of 2019, we changed the presentation of certain operating costs related to our centrally-managed technology and innovation function. These costs, which were previously included in Central and Corporate, are now allocated to our consolidated reportable segments. This change, which we refer to as the “Centrally-held Operating Cost Allocations”, was made as a result of internal changes with respect to the way in which our chief operating decision maker evaluates the OCF of our operating segments. Segment information for all periods presented has been revised in our reported U.S. GAAP disclosures to reflect this change. The following table provides a summary of the impact on the OCF of our consolidated reportable segments and Central and Corporate that resulted from the Centrally-held Operating Cost Allocations.\n\nCentrally-held Property & Equipment Attributions\n\nProperty and equipment additions presented for Central and Corporate include certain capital costs incurred for the benefit of our operating segments. Generally, for purposes of the consolidated financial statements of our borrowing groups, the expense associated with these capital costs is allocated and/or charged to our operating segments as related-party fees and allocations in their respective statements of operations over the period in which the operating segment benefits from the use of the Central and Corporate asset. Related-party fees and allocations are excluded from the reported OCF metric of these borrowing groups. These amounts are based on (i) our estimate of its share of underlying costs, (ii) our estimate of its share of the underlying costs plus a mark-up or (iii) commercially-negotiated rates. These charges and allocations differ from the attributed OFCF approach, as further described below.\n\nFor internal management reporting and capital allocation purposes, we evaluate the OFCF of our operating segments on an \"attributed\" basis, whereby we estimate and attribute certain capital costs incurred by Central and Corporate to our operating segments as if that operating segment directly incurred its estimated share of the capital costs in the same period the costs were incurred by Central and Corporate. These capital costs represent assets that are jointly used by our operating segments. In the context of evaluating our operating segments, we believe this non-GAAP approach, which we refer to as the \"Centrally-held Property and Equipment Attributions\", is a meaningful measure as it represents a transparent view of what the estimated capital spend for our operating segments might be if they were to operate as a stand-alone business (excluding, among other considerations, any impact from lost economies of scale) and allows us to more accurately (i) review capital trends by operating segment, (ii) perform benchmarking between operating segments and (iii) drive alignment and accountability between Central and Corporate and our operating segments with respect to our consolidated capital spend. The amounts attributed to each operating segment are estimated based on (a) actual costs incurred by Central and Corporate, without any mark-up, and (b) each respective operating segment's estimated use of the associated assets.\n\nThe below table summarizes the Centrally-held Property and Equipment Attributions, consistent with our internal management reporting approach. This presentation is for illustrative purposes only and is intended as a supplement to, and not a substitute for, our U.S. GAAP presentation of the property and equipment additions of our reportable segments.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200213005868/en/\nInvestor Relations\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global"
    },
    {
        "title": "Liberty Global Enhances Customer Broadband Experience With Plume’s Smart Home Services",
        "subtitle": "",
        "date": "Feb 11, 2020 4:07AM EST",
        "content": "    London, United Kingdom--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global” or the “Company”) (NASDAQ: LBTYA, LBTYB and LBTYK) today announced it has expanded its relationship with Plume to give consumers more control over devices connected to their home network.\n\nLiberty Global will roll out Smart Home Services from Plume across its footprint this year. A first selection of these services were made available to Virgin Media customers last year and as a result of a new deal, all Liberty Global customers will be able to benefit from intelligent WiFi in all gateways to set controls around online access for guests and children, pause internet use on specific devices and monitor broadband performance remotely. The new features will be integrated into the Connect App, available free of charge to all customers across the UK, the Netherlands, Switzerland, Ireland and Poland.\n\nThe innovative new features build on Liberty Global’s speed leadership as it continues to roll out gigabit speed services across its footprint. In the UK, this includes Virgin Media’s commitment to rolling out gigabit services to its entire network of 15 million homes before the end of next year.\n\nThe deal also means that Liberty Global markets will start rolling out next generation Mesh WiFi Boosters; called the WiFi Pods. The Pods have been trialled by Virgin Media customers in the UK and other European countries. The Pods extend WiFi throughout the home increasing speed, reliability and coverage by adapting to the environment it operates in. This is made possible by Plume Adaptive WiFi™ which optimises and tailors broadband connections according to the customer and their individual habits, which in turn is enabled by open-source software OpenSync™.\n\nEnrique Rodriguez, Chief Technology Officer, Liberty Global, comments: “Combining Plume with Liberty Global’s gigabit network capabilities releases the full potential of broadband speeds and spreads them throughout the home, adapting to the unique environment each connection operates in. The expanded partnership with Plume builds on our commitment to creating the next-generation of broadband by working with partners to enhance our network capability and go beyond speed-leadership. This strongly positions Liberty Global to offer a highly reliable internet residential services in the home that enables smart homes, online gaming and wide variety of use cases which rely on wireless connectivity.”\n\n“We are thrilled to strengthen our partnership with Liberty Global beyond intelligent WiFi by introducing Plume’s Smart Home Services across Liberty Global’s total footprint,” adds Fahri Diner, CEO and co-founder at Plume. “Coupled with OpenSync, this initiative will give Liberty Global unprecedented flexibility, time to market advantage, sophisticated back office tools, intelligence, and deep insight to deliver their customers the best experience possible.”\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nABOUT Plume®\n\nPlume is the creator of the world's first Smart Home Services Platform. As the only open and hardware-independent solution, Plume enables the curation and delivery of new services rapidly and at massive scale. The Plume service bundle which includes Plume Adaptive WiFi™, HomePass®, and AI Security™ is managed by the Plume Cloud, a data- and AI-driven cloud controller currently running the largest software-defined network in the world. Plume leverages OpenSync™, an open-source framework which integrates into a broad set of silicon & platform SDKs for connection to the Plume Cloud. Plume’s smart home service and back-end product suites are proven to help communications service providers around the globe deliver on the promise of fast and reliable internet throughout the home, while increasing ARPU, improving NPS, and reducing call-in rates, truck rolls, and subscriber churn.\n\nVisit www.plume.com, www.platform.plume.com, and www.opensync.io.\n\nPlume, Powered by Plume, Plume Adaptive WiFi, AI Security, SuperPod, HomePass, and OpenSync are either trademarks, or registered trademarks of Plume Design, Inc.\n\nFor more information, please visit www.libertyglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005441/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Extends Partnership With Netflix Across Its European Footprint",
        "subtitle": "",
        "date": "Feb 10, 2020 9:00AM EST",
        "content": "\nLiberty Global will continue to bring critically-acclaimed Netflix content to customers across Europe\n    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global”) (NASDAQ: LBTYA, LBTYB and LBTYK), one of the world’s leading converged video, broadband and communications companies, today announced a multi-year deal with Netflix (NASDAQ: NFLX) that will continue to offer 11 million video customers in Europe convenient access to the Netflix service, including some of today’s most popular and award-winning series, movies and original content, such as The Irishman, Sex Education and The Witcher.\n\nThe partnership follows Liberty Global’s commitment to leverage its next-generation Gigabit speed broadband networks to provide its customers with their favorite streaming content, alongside world-class broadcast and on demand programming on the main TV screens in the home, in a truly seamless and flexible viewer experience.\n\nLiberty Global is a first mover in this space, with its own Virgin Media in the UK being the first TV and broadband provider in Europe to launch Netflix within its advanced digital television platform seven years ago. In that time, Virgin Media has proven the success of the partnership as approximately half of its V6 video subscribers regularly access Netflix content on their TV sets, and embedding the service on Liberty Global set top boxes delivers significantly higher net promoter and customer satisfaction scores. Today Netflix is available on the Horizon platform in nearly every country operated by Liberty Global. And with this agreement, Liberty Global will continue to enhance functionality and overall integration of Netflix within its offering, beginning again with its UK operation.\n\n“We are excited to extend our partnership with Netflix and continue to provide the best of all worlds in content on a single, intuitive platform,” said Enrique Rodriguez, CTO, Liberty Global. “Our customers are savvy. And with one voice control command, they can continue to directly access the programming they want on networks that deliver reliable, uninterrupted viewing. Netflix is a global leader in streaming content, and that’s precisely a partner we want for our customers.”\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, Lionsgate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200210005428/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Announces Partnership With Infosys to Optimize Workforce Across IT and Infrastructure Platforms",
        "subtitle": "",
        "date": "Feb 4, 2020 4:02AM EST",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global”) (NASDAQ: LBTYA, LBTYB, LBTYK), one of the world’s leading converged video, broadband and communications companies, today announced that it has selected Infosys (NYSE: INFY) as the strategic partner to ensure business continuity in the company’s transfer of approximately 300 roles across operations management and service delivery.\n\nFollowing the completion of the sale of its operations in five markets over the past two years, Liberty Global has been optimizing its workforce to better deliver services to its customer base while also providing services under its Transitional Service Agreements (“TSAs”) with third-party purchasers, like Vodafone. Infosys – a global leader in next-generation digital services and consulting – will focus primarily on managing IT and infrastructure platforms under the TSAs.\n\nThe new agreement provides Liberty Global with enhanced flexibility to serve its customers, simplify, and align its operating model with its overall existing business, while ensuring seamless operational continuity for customers and partners. As part of this contract, Liberty Global will transfer up to 300 employees from its operations in The Netherlands, United Kingdom and Poland to Infosys, helping to retain talent and expertise while also providing access to additional resource and centres of excellence.\n\n“Infosys is the ideal partner to help us transform our business to better serve consumers and our corporate customers,” said Enrique Rodriguez, CTO of Liberty Global. “Infosys has been a highly-valued and trusted partner to us for eight years, with extensive industry experience and a commitment to efficiency. And importantly, they are the right partner to provide the right home and future career opportunities for our people who will transfer to Infosys through this agreement.”\n\n“We’re excited to be building on our partnership with Liberty Global as part of a successful long-term relationship delivering mission-critical operations across its brands,” said Anand Swaminathan, Executive Vice President – Global Head of Communications, Media & Technology at Infosys. “Europe is a key geography for us; we’re investing heavily in skills development in the region to support our clients’ digital transformation journey. We believe our renewed partnership with Liberty Global further underlines our commitment to Europe and our clients here.”\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, Lionsgate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\n\nABOUT INFOSYS\n\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.\n\nFor more information contact PR_Global@Infosys.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005426/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Terminates Discussions Regarding Combination of UPC Switzerland and Sunrise, Confirms Turnaround Plan on Track",
        "subtitle": "",
        "date": "Dec 17, 2019 12:00AM EST",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global” or the “Company”) (NASDAQ: LBTYA, LBTYB and LBTYK) announced that it has terminated discussions regarding the combination of UPC Switzerland and Sunrise Communications.\n\n“We wish Sunrise well but we are moving on. Despite our willingness to show significant flexibility on terms, it’s clear to us that the Sunrise Board of Directors and their largest shareholder cannot agree amongst themselves on the best path forward,” said Mike Fries, CEO of Liberty Global. “As we close that door, we are excited by the success of UPC Switzerland’s turnaround plan and free cash flow generation, and we will obviously consider other strategic options in the marketplace. We’ve seen in The Netherlands, Belgium and elsewhere around the world, that the industrial logic of fixed-mobile convergence is indisputable. UPC Switzerland is the fulcrum asset in the Swiss telecom market, with a nationwide 1 Gigabit network, the best entertainment platform and a growing fixed-mobile subscriber base.”\n\nLiberty Global and Sunrise announced a binding agreement on February 27, 2019 and the combination received unconditional regulatory approval in September. However, in October, Sunrise cancelled its extraordinary general meeting (EGM), with approval from Liberty Global, due to a dispute with its largest shareholder and the Share Purchase Agreement providing for the transaction was terminated in November. After payment to Liberty Global of a CHF 50 million break fee, negotiations continued up until this announcement.\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191216005872/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global"
    },
    {
        "title": "Liberty Global Schedules Investor Call for Full-Year 2019 Results",
        "subtitle": "",
        "date": "Dec 16, 2019 4:30PM EST",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global” or the “Company”) (NASDAQ: LBTYA, LBTYB and LBTYK) today announced plans to release its full-year 2019 results on Thursday, February 13, 2020 after Nasdaq market close. You are invited to participate in its Investor Call, which will begin the following day at 09:00 a.m. (Eastern Time) on Friday, February 14, 2020. During the call, management will discuss the Company’s results, and may provide other forward-looking information. Please dial in using the information provided below at least 15 minutes prior to the start of the call.\n\nIn addition to the dial-in teleconference, a summary investor presentation and listen-only webcast will be available within the Investor Relations section of www.libertyglobal.com. The webcast will be archived in the Investor Relations section of the Company’s website for at least 75 days.\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191216005777/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Responds to Sunrise Termination of Share Purchase Agreement",
        "subtitle": "",
        "date": "Nov 12, 2019 5:34PM EST",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global” or the “Company”) (NASDAQ: LBTYA, LBTYB and LBTYK) responded to the notification of termination received today from Sunrise Communications regarding the amended Share Purchase Agreement concerning UPC Switzerland. The agreement provides for Sunrise to pay a CHF 50 million termination fee after providing the notice.\n\nMike Fries, CEO of Liberty Global, said:\n\n“While we would have preferred to keep the current SPA in place, we understand this move by Sunrise. The Sunrise board has been navigating a difficult situation. We look forward to continuing our conversations with either the board or Freenet about a potential transaction that creates significant value for both sets of shareholders and Swiss consumers. There is no question that UPC remains the fulcrum player in Switzerland’s converging telecom market.”\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in 6 European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution.\n\nOur substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191112006124/en/\nInvestor Relations:\nMatt Coates, +44 20 8483 6333\nJohn Rea, +1 303 220 4238\nStefan Halters, +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce, +1 303 220 4202\nMatt Beake, +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Nov 6, 2019 5:15PM EST",
        "content": "\nAccelerated our Gigabit broadband rollout to millions of European homes and businesses\n\nCompleted $2.7 billion tender offer for Class A & C shares in September\n\nQ3 2019 operating income up 1.8% YoY to $208.8 million for continuing operations\n\nCapital intensity continues to decrease substantially fueling YTD1 OFCF growth2 of 80%\n    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK):\n\nLiberty Global plc today announced its Q3 2019 financial results. Our former operations in Austria, Germany, Hungary, Romania and the Czech Republic, along with our DTH business (collectively, the \"Discontinued Operations\") have been accounted for as discontinued operations. Unless otherwise indicated, the information in this release relates only to our continuing operations.\n\nCEO Mike Fries stated, \"Over the past two years, we have undertaken a substantial reshaping of our distribution footprint, taking advantage of the fixed-mobile convergence wave across Europe with transactions that recognize the premium value of broadband networks. As a result of this rebalancing, we find ourselves in an enviable position from both operating and liquidity perspectives.\n\nWe have substantial scale in our remaining businesses, with 31 million consolidated fixed and mobile subscribers, generating approximately $5 billion of OCF per annum, and an additional 15 million fixed and mobile subscribers and $2 billion in annual OCF from our VodafoneZiggo joint venture in the Netherlands. In all markets we are leading the way with gigabit broadband speeds, converged fixed-mobile bundles, and a focus on profitable subscriber growth.\"\n\n\"Just as importantly, we are entering a new phase of operating and free cash flow expansion with capital intensity down 29%1 through nine months and operating free cash flow up 80%1. Not surprisingly we are confirming our OCF and FCF guidance for the full year.\n\nOne of the highlights of the quarter was the successful completion of our modified Dutch auction tender offers. We were able to purchase nearly 100 million shares in total at a blended average price of just over $27 per share, which represented around 14% of our shares outstanding, for a combined aggregate cost of $2.7 billion. Today we have $10 billion of liquidity 6 on the balance sheet and remain focused on long-term value creation.\n\nWhile we are disappointed that Sunrise was unable to obtain approval for the financing of their acquisition of our Swiss operation3, we are excited with the progress we continue to make in that market. All of our key operating metrics - fixed subscriber movement, ARPU growth, NPS, mobile net adds - are moving in the right direction. Like the rest of Europe, Switzerland is rapidly converging around fixed-mobile services, and our gigabit broadband networks and superior TV platform are the fulcrum assets in that market.\n\nOur third quarter 2019 earnings call is tomorrow morning at 9:00 a.m. E.T. and we hope you can join us.\"\n\nAbout Liberty Global\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nQ3 Highlights (on a continuing operations basis unless otherwise noted)\n\n \n\nSubscriber Growth \n\nRevenue Highlights\n\nThe following table presents (i) revenue of each of our consolidated reportable segments for the comparative periods and (ii) the percentage change from period to period on both a reported and rebased basis:\n\n______________________________\n\nN.M. - Not Meaningful\n\nQ3 2019 Rebased Revenue Growth - Segment Highlights\n\nOperating Income\n\nOperating Cash Flow Highlights\n\nThe following table presents (i) OCF of each of our consolidated reportable segments for the comparative periods, and (ii) the percentage change from period to period on both a reported and rebased basis:\n\n______________________________\n\nN.M. - Not Meaningful\n\nQ3 2019 Rebased Operating Cash Flow Growth - Segment Highlights\n\nOFCF Highlights\n\nThe following table presents (i) OFCF of each of our consolidated reportable segments for the comparative periods and (ii) the percentage change from period to period on a rebased basis:\n\nNet Earnings Attributable to Liberty Global Shareholders\n\nLeverage and Liquidity\n\nForward-Looking Statements and Disclaimer\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements with respect to our strategies, future growth prospects and opportunities; expectations with respect to our rebased OCF growth, our Adjusted FCF and our P&E additions; expectations with respect to Switzerland; decisions regarding the deployment of our capital; expectations with respect to the development, launch and benefits of our innovative and advanced products and services; the strength of our balance sheet and tenor of our third-party debt; and other information and statements that are not historical fact. These forward-looking statements involve certain risks and uncertainties that could cause actual results to differ materially from those expressed or implied by these statements. These risks and uncertainties include events that are outside of our control, such as the continued use by subscribers and potential subscribers of our and our affiliates’ services and their willingness to upgrade to our more advanced offerings; our and our affiliates’ ability to meet challenges from competition, to manage rapid technological change or to maintain or increase rates to subscribers or to pass through increased costs to subscribers; the effects of changes in laws or regulation; general economic factors; our and our affiliates’ ability to obtain regulatory approval and satisfy regulatory conditions associated with acquisitions and dispositions; our and affiliates’ ability to successfully acquire and integrate new businesses and realize anticipated efficiencies from acquired businesses; the availability of attractive programming for our and our affiliates’ video services and the costs associated with such programming; our and our affiliates’ ability to achieve forecasted financial and operating targets; the outcome of any pending or threatened litigation; the ability of our operating companies and affiliates to access cash of their respective subsidiaries; the impact of our operating companies' and affiliates’ future financial performance, or market conditions generally, on the availability, terms and deployment of capital; fluctuations in currency exchange and interest rates; the ability of suppliers, vendors and contractors to timely deliver quality products, equipment, software, services and access; our and our affiliates’ ability to adequately forecast and plan future network requirements including the costs and benefits associated with network expansions; and other factors detailed from time to time in our filings with the Securities and Exchange Commission, including our most recently filed Form 10-K/A and Forms 10-Q. These forward-looking statements speak only as of the date of this release. We expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statement contained herein to reflect any change in our expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.\n\nBalance Sheets, Statements of Operations and Statements of Cash Flows\n\nThe condensed consolidated balance sheets, statements of operations and statements of cash flows of Liberty Global are in our 10-Q.\n\nRebase Information\n\nFor purposes of calculating rebased growth rates on a comparable basis for all businesses that we owned during 2019, we have adjusted our historical revenue, OCF and OFCF for the three and nine months ended September 30, 2018 to (i) include the pre-acquisition revenue, OCF and P&E additions of entities acquired during 2019 in our rebased amounts for the three and nine months ended September 30, 2018 to the same extent that the revenue, OCF and P&E additions of these entities are included in our results for the three and nine months ended September 30, 2019, (ii) include revenue and costs for the temporary elements of transitional and other services provided to the VodafoneZiggo JV, Vodafone, Deutsche Telekom (the buyer of UPC Austria), Liberty Latin America and M7 Group (the buyer of UPC DTH), to reflect amounts related to these services equal to those included in our results for the three and nine months ended September 30, 2019 and (iii) reflect the translation of our rebased amounts for the three and nine months ended September 30, 2018 at the applicable average foreign currency exchange rates that were used to translate our results for the three and nine months ended September 30, 2019. We have reflected the revenue, OCF and P&E additions of these acquired entities in our 2018 rebased amounts based on what we believe to be the most reliable information that is currently available to us (generally pre-acquisition financial statements), as adjusted for the estimated effects of (a) any significant differences between U.S. GAAP and local generally accepted accounting principles, (b) any significant effects of acquisition accounting adjustments, (c) any significant differences between our accounting policies and those of the acquired entities and (d) other items we deem appropriate. We do not adjust pre-acquisition periods to eliminate nonrecurring items or to give retroactive effect to any changes in estimates that might be implemented during post-acquisition periods. As we did not own or operate the acquired businesses during the pre-acquisition periods, no assurance can be given that we have identified all adjustments necessary to present the revenue, OCF and OFCF of these entities on a basis that is comparable to the corresponding post-acquisition amounts that are included in our historical results or that the pre-acquisition financial statements we have relied upon do not contain undetected errors. The adjustments reflected in our rebased amounts have not been prepared with a view towards complying with Article 11 of Regulation S-X. In addition, the rebased growth percentages are not necessarily indicative of the revenue, OCF and OFCF that would have occurred if these transactions had occurred on the dates assumed for purposes of calculating our rebased amounts or the revenue, OCF and OFCF that will occur in the future. The rebased growth percentages have been presented as a basis for assessing growth rates on a comparable basis, and are not presented as a measure of our pro forma financial performance.\n\nThe following table provides adjustments made to the 2018 amounts to derive our rebased growth rates for our continuing operations:\n\nSummary of Debt, Finance Lease Obligations & Cash and Cash Equivalents\n\nThe following table(i) details the U.S. dollar equivalent balances of the outstanding principal amount of our continuing operations debt, finance lease obligations and cash and cash equivalents at September 30, 2019:\n\n______________________________\n\nProperty and Equipment Additions and Capital Expenditures\n\nThe table below highlights the categories of the property and equipment additions of our continuing operations for the indicated periods and reconciles those additions to the capital expenditures of our continuing operations that are presented in the condensed consolidated statements of cash flows in our 10-Q.\n\n______________________________\n\nARPU per Cable Customer Relationship\n\nThe following table provides ARPU per cable customer relationship for the indicated periods:\n\nMobile ARPU\n\nThe following tables provide ARPU per mobile subscriber for the indicated periods:\n\nFootnotes for Consolidated Operating Data and Subscriber Variance Tables\n\nAdditional General Notes to Tables:\n\nMost of our broadband communications subsidiaries provide telephony, broadband internet, data, video or other B2B services. Certain of our B2B revenue is derived from SOHO subscribers that pay a premium price to receive enhanced service levels along with video, internet or telephony services that are the same or similar to the mass marketed products offered to our residential subscribers. All mass marketed products provided to SOHOs, whether or not accompanied by enhanced service levels and/or premium prices, are included in the respective RGU and customer counts of our broadband communications operations, with only those services provided at premium prices considered to be “SOHO RGUs” or “SOHO customers.” To the extent our existing customers upgrade from a residential product offering to a SOHO product offering, the number of SOHO RGUs or SOHO customers will increase, but there is no impact to our total RGU or customer counts. With the exception of our B2B SOHO subscribers, we generally do not count customers of B2B services as customers or RGUs for external reporting purposes.\n\nIn Belgium, Telenet leases a portion of its network under a long-term finance lease arrangement. These tables include operating statistics for Telenet's owned and leased networks.\n\nWhile we take appropriate steps to ensure that subscriber statistics are presented on a consistent and accurate basis at any given balance sheet date, the variability from country to country in (i) the nature and pricing of products and services, (ii) the distribution platform, (iii) billing systems, (iv) bad debt collection experience and (v) other factors add complexity to the subscriber counting process. We periodically review our subscriber counting policies and underlying systems to improve the accuracy and consistency of the data reported on a prospective basis. Accordingly, we may from time to time make appropriate adjustments to our subscriber statistics based on those reviews.\n\nSubscriber information for acquired entities is preliminary and subject to adjustment until we have completed our review of such information and determined that it is presented in accordance with our policies.\n\nFootnotes\n\nGlossary\n\n10-Q or 10-K: As used herein, the terms 10-Q and 10-K refer to our most recent quarterly or annual report as filed with the Securities and Exchange Commission on Form 10-Q or Form 10-K, as applicable.\n\nAdjusted Free Cash Flow (FCF): net cash provided by our operating activities, plus (i) cash payments for third-party costs directly associated with successful and unsuccessful acquisitions and dispositions and (ii) expenses financed by an intermediary, less (a) capital expenditures, as reported in our condensed consolidated statements of cash flows, (b) principal payments on amounts financed by vendors and intermediaries and (c) principal payments on finance leases (exclusive of the portions of the network lease in Belgium and the duct leases in Germany that we assumed in connection with certain acquisitions), with each item excluding any cash provided or used by our discontinued operations. We believe that our presentation of Adjusted Free Cash Flow provides useful information to our investors because this measure can be used to gauge our ability to service debt and fund new investment opportunities. Adjusted Free Cash Flow should not be understood to represent our ability to fund discretionary amounts, as we have various mandatory and contractual obligations, including debt repayments, which are not deducted to arrive at this amount. Investors should view Adjusted Free Cash Flow as a supplement to, and not a substitute for, U.S. GAAP measures of liquidity included in our condensed consolidated statements of cash flows.\n\nThe following table provides a reconciliation of our net cash provided by operating activities from continuing operations to Adjusted Free Cash Flow for the indicated periods. In addition, in order to provide information regarding our Adjusted Free Cash Flow that excludes the Discontinued Operations and the Switzerland Disposal Group, we also present Adjusted Free Cash Flow on a pro forma basis for the three and nine months ended September 30, 2019 as if the sale of the Discontinued Operations and the Switzerland Disposal Group had been completed on January 1, 2019.\n\n_______________\n\nARPU: Average Revenue Per Unit is the average monthly subscription revenue per average cable customer relationship or mobile subscriber, as applicable. Following the adoption of ASU 2014-09, subscription revenue excludes interconnect fees, channel carriage fees, mobile handset sales and late fees, but includes the amortization of installation fees. Prior to the adoption of ASU 2014-09, installation fees were excluded from subscription revenue. ARPU per average cable customer relationship is calculated by dividing the average monthly subscription revenue from residential cable and SOHO services by the average number of cable customer relationships for the period. ARPU per average mobile subscriber is calculated by dividing residential mobile and SOHO revenue for the indicated period by the average number of mobile subscribers for the period. Unless otherwise indicated, ARPU per cable customer relationship or mobile subscriber is not adjusted for currency impacts. ARPU per RGU refers to average monthly revenue per average RGU, which is calculated by dividing the average monthly subscription revenue from residential and SOHO services for the indicated period, by the average number of the applicable RGUs for the period. Unless otherwise noted, ARPU in this release is considered to be ARPU per average cable customer relationship or mobile subscriber, as applicable. Cable customer relationships, mobile subscribers and RGUs of entities acquired during the period are normalized. In addition, for purposes of calculating the percentage change in ARPU on a rebased basis, we adjust the prior-year subscription revenue, cable customer relationships, mobile subscribers and RGUs, as applicable, to reflect acquisitions, dispositions, FX and the January 1, 2018 adoption of the new revenue recognition standard (ASU 2014-09, Revenue from Contracts with Customers) on a comparable basis with the current year, consistent with how we calculate our rebased growth for revenue and OCF, as further described in the body of this release.\n\nARPU per Mobile Subscriber: Our ARPU per mobile subscriber calculation that excludes interconnect revenue refers to the average monthly mobile subscription revenue per average mobile subscriber and is calculated by dividing the average monthly mobile subscription revenue (excluding handset sales and late fees) for the indicated period, by the average of the opening and closing balances of mobile subscribers in service for the period. Our ARPU per mobile subscriber calculation that includes interconnect revenue increases the numerator in the above-described calculation by the amount of mobile interconnect revenue during the period.\n\nBasic Video Subscriber: a home, residential multiple dwelling unit or commercial unit that receives our video service over our broadband network either via an analog video signal or via a digital video signal without subscribing to any recurring monthly service that requires the use of encryption-enabling technology. Encryption-enabling technology includes smart cards, or other integrated or virtual technologies that we use to provide our enhanced service offerings. We count RGUs on a unique premises basis. In other words, a subscriber with multiple outlets in one premises is counted as one RGU and a subscriber with two homes and a subscription to our video service at each home is counted as two RGUs.\n\nBlended fully-swapped debt borrowing cost: the weighted average interest rate on our aggregate variable- and fixed-rate indebtedness (excluding finance leases and including vendor financing obligations), including the effects of derivative instruments, original issue premiums or discounts and commitment fees, but excluding the impact of financing costs.\n\nB2B: Business-to-Business.\n\nCable Customer Relationships: the number of customers who receive at least one of our video, internet or telephony services that we count as RGUs, without regard to which or to how many services they subscribe. Cable Customer Relationships generally are counted on a unique premises basis. Accordingly, if an individual receives our services in two premises (e.g., a primary home and a vacation home), that individual generally will count as two Cable Customer Relationships. We exclude mobile-only customers from Cable Customer Relationships.\n\nCustomer Churn: the rate at which customers relinquish their subscriptions. The annual rolling average basis is calculated by dividing the number of disconnects during the preceding 12 months by the average number of customer relationships. For the purpose of computing churn, a disconnect is deemed to have occurred if the customer no longer receives any level of service from us and is required to return our equipment. A partial product downgrade, typically used to encourage customers to pay an outstanding bill and avoid complete service disconnection, is not considered to be disconnected for purposes of our churn calculations. Customers who move within our cable footprint and upgrades and downgrades between services are also excluded from the disconnect figures used in the churn calculation.\n\nDTH Subscriber: a home, residential multiple dwelling unit or commercial unit that receives our video programming broadcast directly via a geosynchronous satellite.\n\nEnhanced Video Subscriber: a home, residential multiple dwelling unit or commercial unit that receives our video service over our broadband network or through a partner network via a digital video signal while subscribing to any recurring monthly service that requires the use of encryption-enabling technology. Enhanced Video Subscribers are counted on a unique premises basis. For example, a subscriber with one or more set-top boxes that receives our video service in one premises is generally counted as just one subscriber. An Enhanced Video Subscriber is not counted as a Basic Video Subscriber. As we migrate customers from basic to enhanced video services, we report a decrease in our Basic Video Subscribers equal to the increase in our Enhanced Video Subscribers.\n\nHomes Passed: homes, residential multiple dwelling units or commercial units that can be connected to our networks without materially extending the distribution plant, except for DTH homes. Certain of our Homes Passed counts are based on census data that can change based on either revisions to the data or from new census results. We do not count homes passed for DTH.\n\nInternet Subscriber: a home, residential multiple dwelling unit or commercial unit that receives internet services over our networks, or that we service through a partner network. Our Internet Subscribers do not include customers that receive services from dial-up connections.\n\nMDU: Multiple Dwelling Unit.\n\nMobile Subscriber Count: the number of active SIM cards in service rather than services provided. For example, if a mobile subscriber has both a data and voice plan on a smartphone this would equate to one mobile subscriber. Alternatively, a subscriber who has a voice and data plan for a mobile handset and a data plan for a laptop would be counted as two mobile subscribers. Customers who do not pay a recurring monthly fee are excluded from our mobile telephony subscriber counts after periods of inactivity ranging from 30 to 90 days, based on industry standards within the respective country. In a number of countries, our mobile subscribers receive mobile services pursuant to prepaid contracts.\n\nMVNO: Mobile Virtual Network Operator.\n\nNPS: Net Promoter Score.\n\nOCF: As used herein, OCF has the same meaning as the term \"Adjusted OIBDA\" that is referenced in our 10-Q. OCF is the primary measure used by our chief operating decision maker to evaluate segment operating performance. OCF is also a key factor that is used by our internal decision makers to (i) determine how to allocate resources to segments and (ii) evaluate the effectiveness of our management for purposes of annual and other incentive compensation plans. As we use the term, OCF is defined as operating income before depreciation and amortization, share-based compensation, provisions and provision releases related to significant litigation and impairment, restructuring and other operating items. Other operating items include (a) gains and losses on the disposition of long-lived assets, (b) third-party costs directly associated with successful and unsuccessful acquisitions and dispositions, including legal, advisory and due diligence fees, as applicable, and (c) other acquisition-related items, such as gains and losses on the settlement of contingent consideration. Our internal decision makers believe OCF is a meaningful measure because it represents a transparent view of our recurring operating performance that is unaffected by our capital structure and allows management to (1) readily view operating trends, (2) perform analytical comparisons and benchmarking between segments and (3) identify strategies to improve operating performance in the different countries in which we operate. We believe our OCF measure is useful to investors because it is one of the bases for comparing our performance with the performance of other companies in the same or similar industries, although our measure may not be directly comparable to similar measures used by other public companies. OCF should be viewed as a measure of operating performance that is a supplement to, and not a substitute for, operating income, net earnings or loss, cash flow from operating activities and other U.S. GAAP measures of income or cash flows.\n\nA reconciliation of our operating income to total OCF for our continuing operations is presented in the following table:\n\nOCF margin: calculated by dividing OCF by total revenue for the applicable period.\n\nOFCF: As used herein, Operating Free Cash Flow or \"OFCF\" represents OCF less property and equipment additions. OFCF is an additional metric that we use to measure the performance of our operations after considering the level of property and equipment additions incurred during the period. For limitations of OFCF, see the definition of OCF.\n\nA reconciliation of our total OCF to total OFCF for our continuing operations is presented in the following table:\n\nOFCF margin: OFCF margin is calculated by dividing OFCF by total revenue for the applicable period.\n\nProperty and equipment additions (P&E Additions): includes capital expenditures on an accrual basis, amounts financed under vendor financing or finance lease arrangements and other non-cash additions.\n\nRGU: A Revenue Generating Unit is separately a Basic Video Subscriber, Enhanced Video Subscriber, DTH Subscriber, Internet Subscriber or Telephony Subscriber. A home, residential multiple dwelling unit, or commercial unit may contain one or more RGUs. For example, if a residential customer in our U.K. market subscribed to our enhanced video service, fixed-line telephony service and broadband internet service, the customer would constitute three RGUs. Total RGUs is the sum of Basic Video, Enhanced Video, DTH, Internet and Telephony Subscribers. RGUs generally are counted on a unique premises basis such that a given premises does not count as more than one RGU for any given service. On the other hand, if an individual receives one of our services in two premises (e.g., a primary home and a vacation home), that individual will count as two RGUs for that service. Each bundled cable, internet or telephony service is counted as a separate RGU regardless of the nature of any bundling discount or promotion. Non-paying subscribers are counted as subscribers during their free promotional service period. Some of these subscribers may choose to disconnect after their free service period. Services offered without charge on a long-term basis (e.g., VIP subscribers or free service to employees) generally are not counted as RGUs. We do not include subscriptions to mobile services in our externally reported RGU counts. In this regard, our RGU counts exclude our separately reported postpaid and prepaid mobile subscribers.\n\nSIM: Subscriber Identification Module.\n\nSOHO: Small or Home Office Subscribers.\n\nTelephony Subscriber: a home, residential multiple dwelling unit or commercial unit that receives voice services over our networks, or that we service through a partner network. Telephony Subscribers exclude mobile telephony subscribers.\n\nU.S. GAAP: Accounting principles generally accepted in the United States.\n\nYoY: Year-over-year.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191106006093/en/\nInvestor Relations\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\n\nCorporate Communications\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\n\n\nCorporate Website\nwww.libertyglobal.com\nSource: Liberty Global"
    },
    {
        "title": "Liberty Global to Present at the Morgan Stanley European Technology, Media & Telecom Conference",
        "subtitle": "",
        "date": "Oct 30, 2019 4:30PM EDT",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global”) (NASDAQ: LBTYA, LBTYB and LBTYK) will be presenting at the Morgan Stanley European Technology, Media & Telecom Conference on Wednesday, November 13, 2019 at 1:10 p.m. CET at the Hotel Arts in Barcelona, Spain. Liberty Global may make observations concerning its historical operating performance and outlook. The presentation will be webcast live at www.libertyglobal.com. We intend to archive the webcast under the Investor Relations section of our website for approximately 30 days.\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005952/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\n\nCorporate Communications:\nBill Myers +1 303 220 6686\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Supports Cancellation of Sunrise EGM",
        "subtitle": "",
        "date": "Oct 22, 2019 12:55AM EDT",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global” or the “Company”) (NASDAQ: LBTYA, LBTYB and LBTYK) announced today that it supports the cancellation of Sunrise Communications’ Extraordinary General Meeting (EGM), which had been scheduled to take place Wednesday, October 23, 2019. Sunrise was seeking approval for an ordinary capital increase by way of a rights offering to finance its pending acquisition of UPC Switzerland. Sunrise has reviewed the vote tally, including the intention of its largest shareholder Freenet to vote against the deal, and determined that the proposal was unlikely to be approved by shareholders.\n\nThe existing share purchase agreement between the parties will remain in place with some minor amendments, including the flexibility to convene a new EGM and certain adjusted termination rights. In addition, the commitments by Liberty Global in the recently announced Conditional Rights Purchase Agreement will lapse and thereby terminate.\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005905/en/\nFor more information, please visit www.libertyglobal.com or contact:\n\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nBill Myers +1 303 220 6686\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Announces CHF 500 Million Conditional Rights Purchase Commitment for Sunrise’s Financing of UPC Switzerland Acquisition",
        "subtitle": "",
        "date": "Oct 14, 2019 12:49AM EDT",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global”) (NASDAQ: LBTYA, LBTYB and LBTYK) and Sunrise Communications AG (“Sunrise”) today announced an agreement whereby Liberty Global will support Sunrise’s rights offering related to the acquisition of UPC Switzerland1.\n\nLiberty Global has agreed to support the Sunrise rights offering up to an aggregate amount of CHF 500 million2 through the purchase of tradeable subscription rights at market prices and the subsequent purchase of newly issued shares, if any, in the rights offering. If fully utilized, Liberty Global’s resulting ownership would reach 7.8% at current market prices3. Sunrise and Liberty Global have also agreed that Liberty Global will receive one board seat nomination as long as its shareholding exceeds 5%. All other terms of the CHF 6.3 billion transaction remain unchanged.\n\n“We have always believed in the logic of this combination. It creates a national powerhouse that will provide a fully-converged challenger to Swisscom and represents a smart and accretive transaction for both Sunrise and Liberty shareholders,” said Mike Fries, CEO of Liberty Global. “We are also happy to support the financing. Both investors and consumers win when this deal closes. Olaf and his team are excellent operators and are uniquely qualified to realize the strategic and financial benefits of the merger.”\n\nSunrise shareholders will vote to approve the relevant capital increase required to consummate the transaction on October 23rd. The Swiss regulatory authority, WEKO, approved the deal without conditions, citing the fact that it will create the second largest telecommunications carrier in Switzerland and that the combination will stimulate competition. Glass Lewis, Ethos, zRating, three leading proxy advisory firms, recommended Sunrise shareowners approve the capital increase.\n\nSeparately, ISS issued a flawed report recommending that Sunrise shareholders vote against the capital increase. While ISS found the combined entity “could reasonably provide a strategic advantage” over the near and medium term, it raised unfounded concerns about the long-term viability of UPC’s fiber-rich HFC networks versus emerging technologies and, among other errors, misstated both current and historical transaction multiples.\n\n“ISS demonstrated a surprisingly poor understanding of the telecom industry in this report,” said Fries. “Fixed-mobile convergence is the future. Industry leaders, regulators and sector analysts all agree on that point. European operators have already completed over €100 billion in transactions just like this one, and at even higher multiples. Nearly all of these transactions involved cable networks precisely because our systems are fiber-rich and future-proof. That’s just one of the many reasons we are so confident in UPC Switzerland even if this deal does not close. We’ve already launched gigabit speeds throughout Switzerland as well as 20 cities across Europe and, unlike telecom incumbents, have the fastest and most efficient path to 10 gig speeds down the road.”\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nIMPORTANT NOTICE\n\nThis document is for informational purposes only and does not constitute an offer to purchase or a solicitation of an offer to sell any securities of any issuer.\n\n_________________________________________________________\n\n1 Sunrise’s capital increase is expected to be structured as a rights offering with subscription rights being issued to Sunrise’s existing shareholders that will entitle holders of those rights to subscribe for new shares at a discount to be determined by Sunrise prior to launch. The subscription rights are expected to trade on the SIX Stock Exchange for a given period. The rights offering is conditional on approval of a capital increase of Sunrise by Sunrise shareholders at an extraordinary general meeting scheduled for October 23.\n\n2 Liberty Global has agreed to acquire subscription rights at market prices not exceeding the theoretical rights price at launch of the rights offering. The theoretical rights price will be calculated following the close of trading in Sunrise shares on October 22. The obligation of Liberty Global to acquire subscription rights is subject to certain conditions described further in the agreement with Sunrise.\n\n3 Based on the Sunrise closing share price on October 11, 2019 of CHF80.25 and a rights offering of CHF2.8 billion.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191013005047/en/\nFor more information, please visit www.libertyglobal.com or contact:\n\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "Liberty Global Announces Preliminary Results of Modified Dutch Auction Tender Offers",
        "subtitle": "",
        "date": "Sep 10, 2019 8:45AM EDT",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (NASDAQ: LBTYA, LBTYB and LBTYK) (“Liberty Global,” the “Company,” “our” or “we”) today announced the preliminary results of its modified Dutch auction tender offers, which expired one (1) minute after 11:59 p.m., New York City time, on September 9, 2019.\n\nIn accordance with the terms and conditions of the tender offers and based on the preliminary count by Computershare Trust Company, N.A., the depositary for the tender offers, Liberty Global expects to acquire, though Credit Suisse Securities (USA) LLC and HSBC Securities (USA) Inc., each acting as principal, (i) approximately 24,088,242 Class A Shares at a price of $27.50 per Class A Share, and (ii) approximately 75,453,852 Class C Shares at a price of $27.00 per Class C Share, for a combined aggregate cost of approximately $2.7 billion, excluding fees and expenses relating to the tender offers.\n\nThe total number of shares expected to be acquired in the tender offers includes an additional 1,360,970 Class A Shares and 6,009,408 Class C Shares pursuant to Liberty Global’s right to increase the number of shares acquired by no more than 2% of the respective shares outstanding, without amending or extending the tender offers. The Class A Shares expected to be acquired represent approximately 11.75% of the Class A Shares outstanding, and the Class C Shares expected to be acquired represent approximately 14.70% of the Class C Shares outstanding, in each case, as of September 9, 2019.\n\nThe number of shares to be purchased and the purchase prices are preliminary and subject to change. The preliminary information contained in this press release is subject to confirmation by the Depositary and is based on the assumption that all shares tendered through notice of guaranteed delivery will be delivered within the two trading day settlement period. The final number of shares to be purchased and the final purchase prices will be announced following the expiration of the guaranteed delivery period and completion by the Depositary of the confirmation process. Payment for the shares accepted under the tender offers, and return of all other shares tendered and not purchased, will occur promptly thereafter.\n\nThe information agent for the tender offer is Innisfree M&A Incorporated. The depositary for the tender offer is Computershare Trust Company, N.A. The dealer managers for the tender offer are Credit Suisse Securities (USA) LLC and HSBC Securities (USA) Inc. For all questions relating to the tender offer, please call the information agent, Innisfree M&A Incorporated, toll-free at (888) 750-5834; banks and brokers may call either dealer manager, Credit Suisse Securities (USA) LLC at (800) 318-8219 or HSBC Securities (USA) Inc. at (888) 472-2456.\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nFORWARD-LOOKING STATEMENTS AND DISCLAIMER\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including the expected size or other terms of the tender offers and the Company’s ability to complete the tender offers. These forward-looking statements involve certain risks and uncertainties that could cause actual results to differ materially from those expressed or implied by these statements. These risks and uncertainties include events that are outside of our control, such as the continued use by subscribers and potential subscribers of our and our affiliates’ services and their willingness to upgrade to our more advanced offerings; our and our affiliates’ ability to meet challenges from competition, to manage rapid technological change or to maintain or increase rates to subscribers or to pass through increased costs to subscribers; the effects of changes in laws or regulation; general economic factors; our and our affiliates’ ability to obtain regulatory approval and satisfy regulatory conditions associated with acquisitions and dispositions; our and affiliates’ ability to successfully acquire and integrate new businesses and realize anticipated efficiencies from acquired businesses; the availability of attractive programming for our and our affiliates’ video services and the costs associated with such programming; our and our affiliates’ ability to achieve forecasted financial and operating targets; the outcome of any pending or threatened litigation; the ability of our operating companies and affiliates to access cash of their respective subsidiaries; the impact of our operating companies' and affiliates’ future financial performance, or market conditions generally, on the availability, terms and deployment of capital; fluctuations in currency exchange and interest rates; the ability of suppliers, vendors and contractors to timely deliver quality products, equipment, software, services and access; our and our affiliates’ ability to adequately forecast and plan future network requirements including the costs and benefits associated with network expansions; and other factors detailed from time to time in our filings with the Securities and Exchange Commission, including our most recently filed Form 10-K and Form 10-Q. Further, estimated cash proceeds from pending dispositions are inherently uncertain and represent management’s expectations and beliefs and do not take into account the ultimate use of the proceeds or any other changes in our capital structure or tax effects, directly or indirectly related to the pending dispositions. These forward-looking statements speak only as of the date of this release. We expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statement contained herein to reflect any change in our expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.\n\nFor more information, please visit www.libertyglobal.com or contact:\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190910005561/en/\nInvestor Relations:\nMatt Coates +44 20 8483 6333\nJohn Rea +1 303 220 4238\nStefan Halters +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce +1 303 220 4202\nMatt Beake +44 20 8483 6428\nSource: Liberty Global"
    },
    {
        "title": "Liberty Global Completes the Sale of Its Operations in Germany, Hungary, Romania and the Czech Republic to Vodafone",
        "subtitle": "",
        "date": "Jul 31, 2019 4:59PM EDT",
        "content": "    DENVER, Colorado--(BUSINESS WIRE)--\nLiberty Global plc (“Liberty Global”) (NASDAQ: LBTYA, LBTYB and LBTYK) today announced that it has completed the sale of its operations in Germany, Hungary, Romania and the Czech Republic to Vodafone Group plc (“Vodafone”) for approximately €19.0 billion ($21.3 billion)1 on a U.S. GAAP basis2. The purchase price represents a multiple for all four businesses combined of 11.5x3 adjusted Segment OCF4, or approximately 24.0x operating free cash flow (“OFCF”)5, for 2017 (the full year prior to announcement).\n\nThe net cash proceeds were approximately €10.1 billion ($11.3 billion)1.\n\nWe have hedged the foreign currency risk associated with the net proceeds through the use of various derivative instruments, which had the effect of converting the majority of the euro denominated proceeds into U.S. dollars at an average USD/EUR exchange rate of 1.12.\n\nABOUT LIBERTY GLOBAL\n\nLiberty Global (NASDAQ: LBTYA, LBTYB and LBTYK) is one of the world’s leading converged video, broadband and communications companies, with operations in six European countries under the consumer brands Virgin Media, Telenet and UPC. We invest in the infrastructure and digital platforms that empower our customers to make the most of the digital revolution. Our substantial scale and commitment to innovation enable us to develop market-leading products delivered through next-generation networks that connect 11 million customers subscribing to 25 million TV, broadband internet and telephony services. We also serve 6 million mobile subscribers and offer WiFi service through millions of access points across our footprint.\n\nIn addition, Liberty Global owns 50% of VodafoneZiggo, a joint venture in the Netherlands with 4 million customers subscribing to 10 million fixed-line and 5 million mobile services, as well as significant investments in ITV, All3Media, ITI Neovision, LionsGate, the Formula E racing series and several regional sports networks.\n\nFor more information, please visit www.libertyglobal.com.\n\n_________________\n1 Convenience translation based on USD/EUR rate of 1.12. The amount of net cash proceeds we received from the transaction differs from the amount we estimated at the time the deal was announced in May 2018 primarily due to the net effect of (i) adverse movement in the EUR/USD exchange rate, (ii) higher vendor financing at Unitymedia in the interim period between transaction announcement and closing, which had the effect of Liberty Global receiving a corresponding increase in cash generated by Unitymedia during the period prior to closing, (iii) a debt recapitalization at Unitymedia, (iv) the settlement of centrally-procured vendor financing amounts that are attributable to the disposed operations, (v) changes in the value of our derivatives associated with the debt at Unitymedia and (vi) working capital and cash adjustments\n\n2 Total enterprise value is calculated on a U.S. GAAP basis and does not include any outstanding indebtedness of the UPC Holding borrowing group\n\n3 For the purpose of the purchase price multiple calculations, the U.S. GAAP 2017 Segment OCF of Germany (€1,493 million) has been reduced by €26 million and the combined U.S. GAAP 2017 Segment OCF of Unitymedia, UPC Hungary, UPC Czech Republic and UPC Romania (€1,714 million) has been reduced by €58 million, with each reduction representing the allocable estimated net amount of transitional services (excluding amounts related to costs expected to be capitalized by Liberty Global) to be provided by Liberty Global during the first year following closing. Segment OCF represents the portion of Liberty Global’s consolidated OCF that is attributed to the applicable business and gives pro forma effect to the adoption of Accounting Standards Update (“ASU\") No. 2014-09, Revenue from Contracts with Customers. The Germany purchase price multiple calculation is based on our estimate of the total enterprise value that is attributable to Germany\n\n4 Represents operating cash flow, as customarily defined by Liberty Global\n\n5 OFCF represents adjusted Segment OCF, as described above, less property and equipment additions as customarily defined by Liberty Global\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190731005954/en/\nInvestor Relations:\nMatt Coates, +44 20 8483 6333\nJohn Rea, +1 303 220 4238\nStefan Halters, +44 20 8483 6211\n\nCorporate Communications:\nMolly Bruce, +1 303 220 4202\nMatt Beake, +44 20 8483 6428\nSource: Liberty Global plc"
    },
    {
        "title": "CounterPath Receives 2019 INTERNET TELEPHONY Product of the Year Award from TMC",
        "subtitle": "",
        "date": "Mar 20, 2019 6:25PM EDT",
        "content": "Bria Teams Recognized for Industry InnovationVANCOUVER, BC / ACCESSWIRE / March 20, 2019 / CounterPath Corporation (NASDAQ:CPAH) (TSX: PATH), a global provider of award-winning Unified Communications (UC) solutions for enterprises and service providers, announced that TMC, a global, integrated media company has named Bria Teams as a recipient of a 2019 INTERNET TELEPHONY Product of the Year Award.Bria Teams is the latest Software-as-a Service (SaaS) offering from the company which combines all of CounterPath's core technologies with newly introduced services such as team voice and video calling; in addition to secure corporate instant messaging, presence, message synchronization and screen sharing, all hosted by CounterPath from the cloud. Targeted towards new users within the small and medium-sized business (SMB) enterprise market, this subscription-based offering is easy to deploy and helps deliver significant benefits to SMBs by enhancing team efficiency and improving business processes. Recently, the company also announced a major update to Bria Teams with the launch of Bria Teams Pro, a new addition to the Bria Teams family, which adds a dedicated high-definition (HD) virtual meeting room for each user to facilitate voice and video conferencing for multiple participants.''We are extremely honored and proud that TMC has recognized our next-gen team collaborations service - Bria Teams - as the Product of the Year. In today's increasingly mobile and distributed workforce, Bria Teams makes it easy to connect, communicate and collaborate within business workflows. This achievement celebrates our commitment to innovation in the integrated UC workspace,'' said Todd Carothers, EVP of Sales, Marketing and Product CounterPath.''I am honored to recognize CounterPath with a 2019 Product of the Year Award for its commitment to excellence and innovation,'' said Rich Tehrani, CEO, TMC. ''In the opinion of our judges and editorial team, its team collaboration solution - Bria Teams has proven to be among the best communications and technology solutions available on the market. I look forward to continued leadership from CounterPath.''The winners of the 2019 INTERNET TELEPHONY Product of the Year will be featured in INTERNET TELEPHONY magazine online and on TMCnet.About INTERNET TELEPHONY magazineINTERNET TELEPHONY has been the IP Communications Authority since 1998™. Beginning with the first issue, INTERNET TELEPHONY magazine has been providing unbiased views of the complicated converged communications space. For more information, please visit www.itmag.com. Follow INTERNET TELEPHONY magazine on Twitter or join our Linked In group.About TMCThrough education, industry news, live events and social influence, global buyers rely on TMC's content-driven marketplaces to make purchase decisions and navigate markets. As a result, leading technology vendors turn to TMC for unparalleled branding, thought leadership and lead generation opportunities. Our in-person and online events deliver unmatched visibility and sales prospects for all participants. Through our custom lead generation programs, we provide clients with an ongoing stream of leads that turn into sales opportunities and build databases. Additionally, we bolster brand reputations with the millions of impressions from display advertising on our news sites and newsletters. Making TMC a 360-degree marketing solution, we offer comprehensive event and road show management services and custom content creation with expertly ghost-crafted blogs, press releases, articles and marketing collateral to help with SEO, branding, and overall marketing efforts. For more information about TMC and to learn how we can help you reach your marketing goals, please visit www.tmcnet.com and follow us on Facebook, LinkedIn and Twitter, @tmcnet.For more information about TMC, visit www.tmcnet.com.About CounterPathCounterPath Unified Communications solutions are changing the face of telecommunications. An industry and user favorite, Bria softphones for desktop, tablet and mobile devices, together with Stretto Platform™ server solutions, enable service providers, OEMs and enterprises large and small around the globe to offer a seamless and unified communications experience across any network. The Bria and Stretto combination enables an improved user experience as an overlay to the most popular UC and IMS telephony and applications servers on the market today. Standards-based, cost-effective and reliable, CounterPath's award-winning solutions deliver high-quality voice and video calling, messaging, and presence offerings to our customers such as AT&T, Avaya, Bell Canada, BT, Liberty Global, Ribbon Communications, Uber and Vonex. Visit www.counterpath.com and follow @counterpath.###Contacts:CounterPathMabel LouieVice President, Marketinge-mail: mlouie@counterpath.comTMC ContactStephanie ThompsonManagersthompson@tmcnet.comSOURCE:CounterPath Corporation"
    },
    {
        "title": "CounterPath Reports Third Quarter Fiscal 2019 Financial Results",
        "subtitle": "",
        "date": "Mar 18, 2019 8:15AM EDT",
        "content": "Year-over-Year Recurring Revenue Growth of 22%VANCOUVER, BC / ACCESSWIRE / March 18, 2019 /CounterPath Corporation (NASDAQ:CPAH) (TSX: PATH) (the ''Company'' or ''CounterPath''), a global provider of award-winning Unified Communications (UC) solutions for enterprises and service providers, today announced the financial and operating results for its quarter ended January 31, 2019, being the third quarter of fiscal year 2019.Third Quarter Financial Highlights (unaudited)Management Commentary''We continue to make progress on our strategy of growing our recurring revenue business in the quarter, which contributed 53% of total revenue and grew 22% over the same quarter last year'' said David Karp, interim CEO and CFO. ''We recorded $1.4 million in recurring revenue, the highest level on record at CounterPath. Contributing to this growth included our channel partner program and e-store Software-as-a-Service (SaaS) offerings. We also sold our first on-premises collaboration solution to a North American service provider that offers cloud communication services to small and medium sized businesses. The CounterPath solution is intended to displace their legacy BroadSoft solution over time. Our solution will extend the customer's internally developed PBX to enable a complete unified communications and collaboration offering to their customers powered by Bria softphones and the Stretto Platform. During the quarter, we also received recognition for our innovation as Bria Teams was named a finalist for the Best of Enterprise Connect Award 2019. The winner will be announced on March 19, 2019 at the event. Bria Teams is a subscription-based cloud service that unifies team communications and collaboration across desktop and mobile devices, enabling organizations to enhance team productivity and improve business processes. SMBs and enterprises can easily integrate Bria Teams with existing call server (PBX) or VoIP service, allowing users to take their business number with them as their single identity. Bria Teams overlays an organization's infrastructure to leverage their existing investments, reducing both costs and complexity''.Financial Overview(All amounts in U.S. dollars and in accordance with accounting principles generally accepted in the United States (''GAAP'') unless otherwise specified - unaudited).Revenue was $2.6 million for the quarter ended January 31, 2019 compared to $3.1 million for the same quarter in the last fiscal year. Software revenue was $1.1 million compared to $1.8 million for the same quarter in the last fiscal year, subscription, support and maintenance revenue was $1.4 million compared to $1.1 million for the same quarter in the last fiscal year, and professional services and other revenue was $0.1 million compared to $0.2 million for the same quarter in the last fiscal year.Operating expenses for the quarter ended January 31, 2019 were $3.6 million compared to $3.5 million for the same quarter in the last fiscal year. Operating expenses for the quarter ended January 31, 2019 included a non-cash stock-based compensation expense of $0.1 million (2018 - $0.1 million). Cost of sales was $0.6 million for the quarter ended January 31, 2019 compared to $0.4 million for the same quarter in the last fiscal year. Sales and marketing expenses were $1.0 million for the quarter ended January 31, 2019 compared to $1.0 million for the same quarter last fiscal year. For the quarter ended January 31, 2019, research and development expenses were $1.4 million and general and administrative expenses were $0.7 million compared to $1.4 million and $0.8 million, respectively, for the same quarter in the last fiscal year.Foreign exchange loss for the quarter ended January 31, 2019 was $0.0 million compared to $0.3 million for the same quarter last fiscal year. The foreign exchange gain (loss) represents the gain (loss) on account of translation of the intercompany accounts of the Company's subsidiary which are maintained in Canadian dollars and transactional gains and losses resulting from transactions denominated in currencies other than U.S. dollars.The net loss for the quarter ended January 31, 2019 was $1.1 million, or $0.18 per share, compared to a net loss of $0.8 million, or $0.14 per share, for the same quarter in the last fiscal year. As of January 31, 2019, the Company had $1.7 million in cash, compared to $2.3 million at April 30, 2018.Forward-Looking StatementsThis news release contains \"forward-looking statements\". Statements in this news release which are not purely historical are forward-looking statements and include any statements regarding beliefs, plans, outlook, expectations or intentions regarding the future, including the statements that the CounterPath solution is intended to displace their legacy BroadSoft solution overtime and that the Company's solution will extend the customer's internally developed PBX to enable a complete unified communications and collaboration offering to their customers powered by Bria softphones and the Stretto Platform. It is important to note that actual outcomes and the Company's actual results could differ materially from those in such forward-looking statements. Actual results could differ from those projected in any forward-looking statements due to numerous factors. Such factors include, among others: (1) the variability in the Company's sales from reporting period to reporting period due to extended sales cycles as a result of selling the Company's products through channel partners or the length of time of deployment of the Company's products by its customers; (2) the Company's ability to manage its operating expenses, which may adversely affect its financial condition and ability to continue to operate as a going concern; (3) the Company's ability to remain competitive as other better financed competitors develop and release competitive products; (4) a decline in the Company's stock price or insufficient investor interest in the Company's securities which may impact the Company's ability to raise additional financing as required or may cause the Company to be delisted from a stock exchange on which its common stock trades; (5) the impact of intellectual property litigation that could materially and adversely affect the Company's business; (6) the success by the Company of the sales of its current and new products; (7) the impact of technology changes on the Company's products and industry; (8) the failure to develop new and innovative products using the Company's technologies including the refresh of our Software-as-a Service (SaaS) solution; and (9) the potential dilution to shareholders or overhang on the Company's share price of its outstanding stock options. Readers should also refer to the risk disclosures outlined in the Company's quarterly reports on Form 10-Q, the Company's annual reports on Form 10-K, and the Company's other disclosure documents filed from time-to-time with the Securities and Exchange Commission at http://www.sec.gov and the Company's interim and annual filings and other disclosure documents filed from time-to-time on SEDAR at www.sedar.com.About CounterPathCounterPath Unified Communications solutions are changing the face of telecommunications. An industry and user favorite, Bria softphones for desktop, tablet and mobile devices, together with Stretto Platform™ server solutions, enable service providers, OEMs and enterprises large and small around the globe to offer a seamless and unified communications experience across any network. The Bria and Stretto combination enables an improved user experience as an overlay to the most popular UC and IMS telephony and applications servers on the market today. Standards-based, cost-effective and reliable, CounterPath's award-winning solutions deliver high-quality voice and video calling, messaging, and presence offerings to our customers such as AT&T, Avaya, Bell Canada, BT, Liberty Global, Ribbon Communications, Uber and Vonex. Visit counterpath.com and follow @counterpath.Contacts:David KarpInterim Chief Executive Officer and Chief Financial Officer, CounterPathdkarp@counterpath.comCOUNTERPATH CORPORATIONCONDENSED CONSOLIDATED BALANCE SHEETS(Stated in U.S. Dollars)\n  \n\n  \n    \n      January 31,\n                  April 30,\n              \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                  \n                      \n                      (Unaudited)\n                      \n                      \n                      \n                      \n                      \n                      \n                  Assets\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Current assets:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cash\n                      \n                      $\n                      1,744,859\n                      \n                      \n                      $\n                      2,348,883\n                      \n                  Accounts receivable (net of allowance for doubtful accounts of $1,124,161 (2018 - $322,638))\n                      \n                      \n                      2,230,742\n                      \n                      \n                      \n                      3,509,010\n                      \n                  Deferred sales commission costs - current\n                      \n                      \n                      110,561\n                      \n                      \n                      \n                      -\n                      \n                  Derivative assets\n                      \n                      \n                      12,007\n                      \n                      \n                      \n                      -\n                      \n                  Prepaid expenses and other current assets\n                      \n                      \n                      271,687\n                      \n                      \n                      \n                      191,245\n                      \n                  Total current assets\n                      \n                      \n                      4,369,856\n                      \n                      \n                      \n                      6,049,138\n                      \n                  Deposits\n                      \n                      \n                      96,701\n                      \n                      \n                      \n                      98,633\n                      \n                  Deferred sales commission costs - non-current\n                      \n                      \n                      61,812\n                      \n                      \n                      \n                      -\n                      \n                  Equipment\n                      \n                      \n                      80,644\n                      \n                      \n                      \n                      121,819\n                      \n                  Goodwill\n                      \n                      \n                      6,690,043\n                      \n                      \n                      \n                      6,843,575\n                      \n                  Intangibles and other assets\n                      \n                      \n                      225,656\n                      \n                      \n                      \n                      221,062\n                      \n                  Total Assets\n                      \n                      $\n                      11,524,712\n                      \n                      \n                      $\n                      13,334,227\n                      \n                  Liabilities and Stockholders' Equity\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Current liabilities:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Accounts payable and accrued liabilities\n                      \n                      $\n                      2,411,854\n                      \n                      \n                      $\n                      2,437,733\n                      \n                  Derivative liability\n                      \n                      \n                      18,052\n                      \n                      \n                      \n                      -\n                      \n                  Unearned revenue\n                      \n                      \n                      2,680,073\n                      \n                      \n                      \n                      2,565,876\n                      \n                  Customer deposits\n                      \n                      \n                      3,137\n                      \n                      \n                      \n                      2,200\n                      \n                  Accrued warranty\n                      \n                      \n                      49,305\n                      \n                      \n                      \n                      63,130\n                      \n                  Total current liabilities\n                      \n                      \n                      5,162,421\n                      \n                      \n                      \n                      5,068,939\n                      \n                  Deferred lease inducements\n                      \n                      \n                      6,596\n                      \n                      \n                      \n                      14,339\n                      \n                  Loan payable\n                      \n                      \n                      2,000,000\n                      \n                      \n                      \n                      -\n                      \n                  Unrecognized tax liability\n                      \n                      \n                      9,763\n                      \n                      \n                      \n                      9,763\n                      \n                  Total liabilities\n                      \n                      \n                      7,178,780\n                      \n                      \n                      \n                      5,093,041\n                      \n                  Stockholders' equity:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Preferred stock, $0.001 par value\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Authorized: 100,000,000\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Issued and outstanding: January 31, 2019 - nil; April 30, 2018 - nil\n                      \n                      \n                      -\n                      \n                      \n                      \n                      -\n                      \n                  Common stock, $0.001 par value\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Authorized: 100,000,000\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Issued:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  January 31, 2019 - 5,946,832; April 30, 2018 - 5,930,468\n                      \n                      \n                      5,947\n                      \n                      \n                      \n                      5,931\n                      \n                  Additional paid-in capital\n                      \n                      \n                      75,591,318\n                      \n                      \n                      \n                      75,170,181\n                      \n                  Accumulated deficit\n                      \n                      \n                      (67,701,736\n                      )\n                      \n                      \n                      (63,701,685\n                      )\n                  Accumulated other comprehensive loss - currency translation adjustment\n                      \n                      \n                      (3,549,597\n                      )\n                      \n                      \n                      (3,233,241\n                      )\n                  Total stockholders' equity\n                      \n                      \n                      4,345,932\n                      \n                      \n                      \n                      8,241,186\n                      \n                  Liabilities and Stockholders' Equity\n                      \n                      $\n                      11,524,712\n                      \n                      \n                      $\n                      13,334,227\n                      \n                  \n  \n  COUNTERPATH CORPORATIONCONDENSED CONSOLIDATED STATEMENTS OFOPERATIONS(Stated in U.S. Dollars)(Unaudited)\n  \n\n  \n    \n      Three Months Ended\n                  Nine Months Ended\n              \n                      \n                      January 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      January 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                  Revenue:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Software\n                      \n                      $\n                      1,119,311\n                      \n                      \n                      $\n                      1,791,165\n                      \n                      \n                      $\n                      3,398,729\n                      \n                      \n                      $\n                      5,306,925\n                      \n                  Subscription, support and maintenance\n                      \n                      \n                      1,367,387\n                      \n                      \n                      \n                      1,120,690\n                      \n                      \n                      \n                      3,938,247\n                      \n                      \n                      \n                      3,069,371\n                      \n                  Professional services and other\n                      \n                      \n                      101,060\n                      \n                      \n                      \n                      172,048\n                      \n                      \n                      \n                      579,873\n                      \n                      \n                      \n                      1,230,978\n                      \n                  Total revenue\n                      \n                      \n                      2,587,758\n                      \n                      \n                      \n                      3,083,903\n                      \n                      \n                      \n                      7,916,849\n                      \n                      \n                      \n                      9,607,274\n                      \n                  Operating expenses:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cost of sales (includes depreciation of $528 (2018 - $4,753))\n                      \n                      \n                      563,236\n                      \n                      \n                      \n                      362,057\n                      \n                      \n                      \n                      1,782,603\n                      \n                      \n                      \n                      1,131,122\n                      \n                  Sales and marketing\n                      \n                      \n                      983,290\n                      \n                      \n                      \n                      996,470\n                      \n                      \n                      \n                      2,945,939\n                      \n                      \n                      \n                      3,031,981\n                      \n                  Research and development\n                      \n                      \n                      1,369,196\n                      \n                      \n                      \n                      1,361,219\n                      \n                      \n                      \n                      4,163,889\n                      \n                      \n                      \n                      4,052,129\n                      \n                  General and administrative\n                      \n                      \n                      699,428\n                      \n                      \n                      \n                      800,049\n                      \n                      \n                      \n                      3,241,167\n                      \n                      \n                      \n                      2,407,234\n                      \n                  Total operating expenses\n                      \n                      \n                      3,615,150\n                      \n                      \n                      \n                      3,519,795\n                      \n                      \n                      \n                      12,133,598\n                      \n                      \n                      \n                      10,622,466\n                      \n                  Loss from operations\n                      \n                      \n                      (1,027,392\n                      )\n                      \n                      \n                      (435,892\n                      )\n                      \n                      \n                      (4,216,749\n                      )\n                      \n                      \n                      (1,015,192\n                      )\n                  Interest and other income (expense), net:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Interest and other income\n                      \n                      \n                      2,145\n                      \n                      \n                      \n                      -\n                      \n                      \n                      \n                      2,145\n                      \n                      \n                      \n                      -\n                      \n                  Interest expense\n                      \n                      \n                      (22,122\n                      )\n                      \n                      \n                      (123\n                      )\n                      \n                      \n                      (26,788\n                      )\n                      \n                      \n                      (338\n                      )\n                  Foreign exchange gain (loss)\n                      \n                      \n                      (16,266\n                      )\n                      \n                      \n                      (342,328\n                      )\n                      \n                      \n                      108,205\n                      \n                      \n                      \n                      (756,512\n                      )\n                  Change in fair value of derivative instruments\n                      \n                      \n                      4,255\n                      \n                      \n                      \n                      -\n                      \n                      \n                      \n                      (897\n                      )\n                      \n                      \n                      -\n                      \n                  Total interest and other income (expense), net\n                      \n                      \n                      (31,988\n                      )\n                      \n                      \n                      (342,451\n                      )\n                      \n                      \n                      82,665\n                      \n                      \n                      \n                      (756,850\n                      )\n                  Net loss for the period\n                      \n                      $\n                      (1,059,380\n                      )\n                      \n                      $\n                      (778,343\n                      )\n                      \n                      $\n                      (4,134,084\n                      )\n                      \n                      $\n                      (1,772,042\n                      )\n                  Net loss per share:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic and diluted\n                      \n                      $\n                      (0.18\n                      )\n                      \n                      $\n                      (0.14\n                      )\n                      \n                      $\n                      (0.70\n                      )\n                      \n                      $\n                      (0.33\n                      )\n                  Weighted average common shares outstanding:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic and diluted\n                      \n                      \n                      5,945,181\n                      \n                      \n                      \n                      5,539,352\n                      \n                      \n                      \n                      5,939,803\n                      \n                      \n                      \n                      5,354,690\n                      \n                  \n  \n  Non-GAAP Financial MeasuresThis news release contains ''non-GAAP financial measures''. The non-GAAP financial measures in this news release consist of non-GAAP loss from operations which excludes non-cash stock-based compensation relative to loss from operations calculated in accordance with GAAP. The non-GAAP financial measures also include non-GAAP net loss which excludes non-cash stock-based compensation, foreign exchange gain (loss) and gain (loss) on change in fair value of derivative instruments relative to net loss calculated in accordance with GAAP. Non-GAAP financial measures should not be considered as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP. CounterPath utilizes both GAAP and non-GAAP financial measures to assess what it believes to be its core operating performance and to evaluate and manage its internal business and assist in making financial operating decisions. CounterPath believes that the inclusion of non-GAAP financial measures, together with GAAP measures, provides investors with an alternative presentation useful to investors' understanding of CounterPath's core operating results and trends.Reconciliation to GAAP(Unaudited)\n  \n\n  \n    \n      Three Months Ended\n                  Nine Months Ended\n              \n                      \n                      January 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      January 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                  Non-GAAP loss from operations:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  GAAP loss from operations\n                      \n                      $\n                      (1,027,392\n                      )\n                      \n                      $\n                      (435,892\n                      )\n                      \n                      $\n                      (4,216,749\n                      )\n                      \n                      $\n                      (1,015,192\n                      )\n                  Plus:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Stock-based compensation\n                      \n                      \n                      64,817\n                      \n                      \n                      \n                      87,924\n                      \n                      \n                      \n                      404,414\n                      \n                      \n                      \n                      494,883\n                      \n                  Non-GAAP loss from operations\n                      \n                      $\n                      (962,575\n                      )\n                      \n                      $\n                      (347,968\n                      )\n                      \n                      $\n                      (3,812,335\n                      )\n                      \n                      $\n                      (520,309\n                      )\n                  \n  \n  \n  \n\n  \n    \n      Three Months Ended\n                  Nine Months Ended\n              \n                      \n                      January 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      January 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                      \n                      2019\n                      \n                      \n                      \n                      2018\n                      \n                      \n                  Non-GAAP net loss:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  GAAP net loss\n                      \n                      $\n                      (1,059,380\n                      )\n                      \n                      $\n                      (778,343\n                      )\n                      \n                      $\n                      (4,134,084\n                      )\n                      \n                      $\n                      (1,772,042\n                      )\n                  Plus:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Stock-based compensation\n                      \n                      \n                      64,817\n                      \n                      \n                      \n                      87,924\n                      \n                      \n                      \n                      404,414\n                      \n                      \n                      \n                      494,883\n                      \n                  Foreign exchange (gain) loss\n                      \n                      \n                      16,266\n                      \n                      \n                      \n                      342,328\n                      \n                      \n                      \n                      (108,205\n                      )\n                      \n                      \n                      756,512\n                      \n                  Loss (gain) on change in fair value of derivative instruments\n                      \n                      \n                      (4,255\n                      )\n                      \n                      \n                      -\n                      \n                      \n                      \n                      897\n                      \n                      \n                      \n                      -\n                      \n                  Non-GAAP net loss\n                      \n                      $\n                      (982,552\n                      )\n                      \n                      $\n                      (348,091\n                      )\n                      \n                      $\n                      (3,836,978\n                      )\n                      \n                      $\n                      (520,647\n                      )\n                  GAAP net loss per share:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic and diluted\n                      \n                      $\n                      (0.18\n                      )\n                      \n                      $\n                      (0.14\n                      )\n                      \n                      $\n                      (0.70\n                      )\n                      \n                      $\n                      (0.33\n                      )\n                  Non-GAAP net loss per share:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic and diluted\n                      \n                      $\n                      (0.17\n                      )\n                      \n                      $\n                      (0.06\n                      )\n                      \n                      $\n                      (0.65\n                      )\n                      \n                      $\n                      (0.10\n                      )\n                  \n  \n  SOURCE: CounterPath Corporation"
    },
    {
        "title": "CounterPath Announces Major Updates to Bria Teams Unified Communications Solution",
        "subtitle": "",
        "date": "Mar 12, 2019 8:00AM EDT",
        "content": "New Bria Teams Pro offering provides each user with a high-definition dedicated virtual meeting room for a fraction of the cost of competitive offeringsVANCOUVER, BC / ACCESSWIRE / March 12, 2019 / CounterPath Corporation (NASDAQ:CPAH) (TSX: PATH), a global provider of award-winning Unified Communications solutions for enterprises and service providers, today announced the launch of Bria Teams Pro, a new addition to the Bria Teams family, which adds a dedicated high-definition (HD) virtual meeting room for each user to facilitate voice and video conferencing for multiple participants. Additionally, Chat Rooms have also been introduced for all Bria Teams users -- both Standard and Pro -- to better streamline team conversations and track chat history across devices. These new updates will be demonstrated in booth #1205 at Enterprise Connect in Orlando, Florida from March 18-20th.The new Bria Teams Pro cloud-based service seamlessly integrates a dedicated virtual meeting room with secure HD audio and video conferencing, in-room messaging and screen sharing, within the Bria Teams softphone experience for desktop and mobile users. With each user assigned a unique conference room, there is no need to pre-book a meeting space, eliminating the risk of overlapping sessions with other users. To enable users to communicate with users outside of their organization's ''team'', including customers, clients and colleagues, Bria Teams Pro allows participants to join via the Bria Teams application or web browser.Similar to Bria Teams Standard, the Pro offering includes CounterPath-hosted Team Voice and Messaging services, as well as the ability to integrate call server (PBX) or hosted VoIP services.''As a follow-on to our initial launch of Bria Teams last fall, we are excited to introduce a meeting room feature as part of the new Bria Teams Pro offering,'' said Todd Carothers, EVP of Sales, Marketing and Product at CounterPath. ''This new virtual conference capability delivers a robust unified communications and collaboration solution that is easy to use and deploy for SMBs and teams within large enterprises. Bria Teams Pro is highly disruptive as it brings 1080p HD video collaboration, screen sharing, team messaging and voice all into a single offering that interoperates with your current voice service at an incredibly low price point. You would need multiple solutions to cover what Bria Teams Pro offers.''''Prior to deploying Bria Teams from CounterPath, we had seven different ways of communicating. Many were through personal channels like Slack, Skype, and mobile phones, so a lot can fall through the cracks,'' said Josh Loewen, Co-founder and Strategist at The Status Bureau. ''Now with Bria Teams Pro, we can stay in touch via phone, chat, screen share, and video conferencing all from the same application ''Bria Teams improved our ability to collaborate internally and externally. I would highly recommend it to not only small business owners but any organization looking to increase the productivity and efficiency of their teams.''Bria Teams Pro meeting room features include:Bria Teams Pro is available for a free 30-day trial at www.softphone.com. Introductory pricing plans are available as monthly subscriptions for $14.95 USD per user or as annual subscriptions of $119.40 USD per user ($9.95 USD per user per month).For more information about Bria Teams and Bria Teams Pro, please visit www.softphone.com.About Bria TeamsBria Teams is a powerful, easy to use Unified Communications service that provides secure team messaging and presence, HD voice and video calling, and screen sharing on up to three devices per user. Packaged as a subscription-based cloud service, Bria Teams unifies team communications and collaboration across desktop and mobile devices, and enables organizations to enhance team productivity and improve business processes. SMBs and enterprises can easily integrate Bria Teams with existing call server (PBX) or VoIP services, allowing users to take their business number with them as their single identity. Bria Teams can be deployed as a stand-alone communication solution or overlay an organization's infrastructure to leverage their existing investments, reducing both costs and complexity.About CounterPathCounterPath Unified Communications solutions are changing the face of telecommunications. An industry and user favorite, Bria® softphones for desktop, tablet and mobile devices, together with Stretto Platform™ server solutions, enable service providers, OEMs and enterprises large and small around the globe to offer a seamless and unified communications experience across any networks. The Bria and Stretto combination enables an improved user experience as an overlay to the most popular UC and IMS telephony and applications servers on the market today. Standards-based, cost-effective and reliable, CounterPath's award-winning solutions deliver high-quality voice and video calling, messaging, and presence offerings to our customers such as AT&T, Avaya, Bell Canada, BT, Liberty Global, Ribbon Communications, Uber, and Vonex. Visit counterpath.com and follow @counterpath.###ContactsMabel LouieVice President, Marketinge-mail: mlouie@counterpath.comInvestor Relationse-mail: ir@counterpath.comSOURCE:CounterPath Corporation"
    },
    {
        "title": "CallSprout Deploys White Label Bria Softphones and Hosted Stretto Platform from CounterPath to Provide Superior Experience for SMB Customers",
        "subtitle": "",
        "date": "Mar 7, 2019 8:55AM EST",
        "content": "New Solution Provides High-Quality Voice and Video Calls, IM and Presence, File Sharing, Integration with Salesforce, and SMS And Collaboration Capabilities, Resulting in a Differentiated Service Offering for VoIP Provider's CustomersVANCOUVER, BC / ACCESSWIRE / March 7, 2019 / CounterPath Corporation (NASDAQ:CPAH) (TSX: PATH), a global provider of award-winning Unified Communications solutions for enterprises and solution providers, today announced CallSprout, a Florida-based VoIP service and equipment provider to small and medium-sized business and call centers, selected CounterPath to provide a custom, white label Bria® softphone solution to solve quality and usability issues with their existing softphone clients, and add differentiated services using the CounterPath StrettoTM Platform.During a migration to a new PBX platform, CallSprout, recognized a need to replace its existing desktop and mobile softphones that were, due to varied interfaces between desktop and mobile applications and a lack of modern UC features, providing inconsistent call quality and a disjointed, less than optimal user experience. After evaluating multiple softphone solution providers, CallSprout selected CounterPath based on its reputation as a market leader with robust, high-quality solutions and the ability to customize solutions.''We pride ourselves on delivering top of the line services and solutions, and our existing softphones just weren't cutting it,'' said Eric Bucher, CEO of CallSprout. ''We needed a solution that would be dependable and easy to manage and provide a consistent user experience. CounterPath delivered it all.''CounterPath's solution for CallSprout includes customized white-labeled mobile and desktop applications, branded with CallSprout logo and colors, with a consistent interface across platforms for better usability. CallSprout is also leveraging the Stretto Platform to streamline and automate deployment to customers and enhance provisioning and management. Complementing its commitment to provide communication tools that make running a business easier, the VoIP provider can, with Stretto, send customers welcome emails and include helpful ''How To'' videos to get them up and running quickly. Further, the softphone clients automatically configure themselves when users log in. Additionally, Stretto allows CallSprout to add new, differentiating services such as messaging, collaboration, and virtual meeting rooms.''The CounterPath solution gives us the ability to transition to a carrier-grade softphone solution, while still being commercially viable for our business and customers,'' continued Bucher. ''By layering on collaboration and additional services, CallSprout has a differentiated offering beyond traditional Unified Communication offerings that will help grow our business with existing and new customers.''''We're proud to provide CallSprout with a game-changing UCC solution,'' said Todd Carothers, EVP of Sales, Marketing and Product at CounterPath. ''Our robust provisioning and management software, which ensures positive user adoption and enhanced customer experiences, was a key factor in their decision-making process. With these new capabilities, CallSprout can expand their addressable market with an exceptional, distinctive offering.''For more information on the CallSprout customer story, please visit www.counterpath.com/case-study-callsprout.About CallSproutInitially, CallSprout offered straightforward VoIP services to clients in the United States and around the world in various industries, and we still do. However, over the last few years, we have watched the needs of our clients change as their businesses continue to grow. As a result, we completely revamped our offering and now provide cloud-based communications, which utilize CRM, phone, ad word and marketing data to provide predictive analytics to companies. In addition, we also offer SMS, ringless voicemail drop, local presence calling, and cutting-edge business intelligence tools to create customized wallboards with any KPI imaginable.About CounterPathCounterPath Unified Communications solutions are changing the face of telecommunications. An industry and user favorite, Bria softphones for desktop, tablet and mobile devices, together with Stretto PlatformTM server solutions, enable operators, OEMs and enterprises large and small around the globe to offer a seamless and unified communications experience across any network. The Bria and Stretto combination enables an improved user experience as an overlay to the most popular UC and IMS telephony and applications servers on the market today. Standards-based, cost-effective and reliable, CounterPath's award-winning solutions deliver high-quality voice and video calling, messaging, and presence offerings to our customers such as AT&T, Avaya, Bell Canada, BT, Liberty Global, Ribbon Communications, Uber and Vonex. Visit counterpath.com and follow @counterpath.ContactsMabel LouieVice President, Marketinge-mail: mlouie@counterpath.comInvestor Relationse-mail: ir@counterpath.comForward-Looking StatementsThis news release contains \"forward-looking statements\". Statements in this news release which are not purely historical are forward-looking statements and include any statements regarding beliefs, plans, outlook, expectations or intentions regarding the future, including (1) the statement that the Company's UCC solution is game-changing for CallSprout; (2) that statement that the Company's robust provisioning and management software ensures positive user adoption; and (3) the expectation that CallSprout can expand their addressable market with CounterPath's offering. It is important to note that actual outcomes and the Company's actual results could differ materially from those in such forward-looking statements. Actual results could differ from those projected in any forward-looking statements due to numerous factors. Such factors include, among others: (1) the variability in the Company's sales from reporting period to reporting period due to extended sales cycles as a result of selling the Company's products through channel partners or the length of time of deployment of the Company's products by its customers; (2) the Company's ability to manage its operating expenses, which may adversely affect its financial condition and ability to continue to operate as a going concern; (3) the Company's ability to remain competitive as other better financed competitors develop and release competitive products; (4) a decline in the Company's stock price or insufficient investor interest in the Company's securities which may impact the Company's ability to raise additional financing as required or may cause the Company to be delisted from a stock exchange on which its common stock trades; (5) the impact of intellectual property litigation that could materially and adversely affect the Company's business; (6) the success by the Company of the sales of its current and new products; (7) the impact of technology changes on the Company's products and industry; (8) the failure to develop new and innovative products using the Company's technologies including the refresh of our Software-as-a Service (SaaS) solution; and (9) the potential dilution to shareholders or overhang on the Company's share price of its outstanding stock options. Readers should also refer to the risk disclosures outlined in the Company's quarterly reports on Form 10-Q, the Company's annual reports on Form 10-K, and the Company's other disclosure documents filed from time-to-time with the Securities and Exchange Commission at http://www.sec.gov and the Company's interim and annual filings and other disclosure documents filed from time-to-time on SEDAR at www.sedar.com.SOURCE: CounterPath Corporation"
    },
    {
        "title": "Driving Efficiency for Your Small Business in 2019 Begins with Attending this Webinar",
        "subtitle": "",
        "date": "Jan 22, 2019 8:45AM EST",
        "content": "Featuring industry expert Irwin Lazar, the February 6th event will explore emerging collaboration needs and solutions for small businessesVANCOUVER, BC / ACCESSWIRE / January 22, 2019 /CounterPath Corporation (NASDAQ:CPAH) (TSX: PATH), a global provider of award-winning Unified Communications solutions for enterprises and service providers, will host a global webinar featuring Nemertes Research and their leading analyst Irwin Lazar to discuss how small businesses can leverage new, next-generation collaboration tools to drive efficiencies and boost productivity.The February 6th webinar - \"Accelerating Collaboration For Small Businesses\" - will feature Irwin Lazar, VP and Service Director for Nemertes Research, who will be joined by unified communications expert Todd Carothers, EVP of Sales, Marketing and Product at CounterPath. During this 60-minute event, Irwin and Todd will discuss recent developments in collaboration technology, today's must-have feature sets and strategies to better facilitate team communications in small enterprises.Not only will the attendees hear about the latest trends in collaboration technology, they will also have an opportunity for a live Q&A with Irwin and Todd.WhatWebinar: Accelerating Collaboration for Small BusinessesWhenFebruary 6, 201911:00 am - 12:00 pm Pacific Standard TimeSpeakersIrwin Lazar - Vice President and Service Director, Nemertes ResearchTodd Carothers - EVP of Sales, Marketing and Product, CounterPathDescriptionThe collaboration needs of small businesses have similarities, but often many differences, compared to those of larger organizations. Small businesses require the flexibility to support distributed and mobile workers, and to rapidly respond to customer opportunities and needs. To succeed, small businesses must employ a broad set of collaborative technologies that quickly and easily enable both internal and customer communications, regardless of device and location. This informative webinar will provide insights into the collaborative needs of small businesses and how solutions - including team collaboration and unified communications - provide competitive advantages by improving agility, speeding decision-making, and enhancing customer and employee engagement.Key Topics- Key statistics on the Collaboration market for Small Business- Emerging technologies for customer and employee engagement- Characteristics of a successful collaboration and communications strategy- RecommendationsRegisterClick here to register for the live webinar on February 6th, 2019 at 11:00 am Pacific Standard Time (2:00 pm Eastern Standard Time). The recorded session will be available immediately after the webinar for all registrants including audiences in Europe, Asia-Pacific, Australia and Latin America to watch on-demand.About NemertesNemertes is a global research-based advisory and consulting firm that analyzes the business value of emerging technologies. Since 2002, we have provided strategic recommendations based on data-driven operational and business metrics to help enterprise organizations deliver successful technology transformation to employees and customers. Simply put: Nemertes' better data helps clients make better decisions. www.Nemertes.comAbout CounterPathCounterPath Unified Communications solutions are changing the face of telecommunications. An industry and user favorite, Bria softphones for desktop, tablet and mobile devices, together with Stretto Platform™ server solutions, enable service providers, OEMs and enterprises large and small around the globe to offer a seamless and unified communications experience across any networks. The Bria and Stretto combination enables an improved user experience as an overlay to the most popular UC and IMS telephony and applications servers on the market today. Standards-based, cost-effective and reliable, CounterPath's award-winning solutions deliver high-quality voice and video calling, messaging, and presence offerings of customers such asAT&T, Avaya, Bell Canada, BroadSoft, BT, Cisco Systems, inContact, Liberty Global, Metaswitch Networks, Ribbon Communications, Rogers, Uber, and Vonex. Visit counterpath.com and follow @counterpath.ContactsMabel LouieVice President, Marketinge-mail: mlouie@counterpath.comInvestor Relationse-mail: ir@counterpath.comSOURCE:CounterPath Corporation"
    }
]