[
    {
        "title": "Lam Research Breaks New Ground in Etch Technology and Productivity for Chipmaking Processes",
        "subtitle": "",
        "date": "Mar 3, 2020 11:30AM EST",
        "content": "FREMONT, Calif., March  03, 2020  (GLOBE NEWSWIRE) -- Lam Research Corp. (Nasdaq: LRCX) today announced the launch of a completely transformed plasma etch technology and system solution, designed to provide chipmakers with advanced functionality and extendibility required for future innovation. Lam’s groundbreaking Sense.i™ platform offers unparalleled system intelligence in a compact, high-density architecture to deliver process performance at the highest productivity, supporting logic and memory device roadmaps through the coming decade.With core technology evolved from Lam’s industry-leading Kiyo® and Flex® process modules, the Sense.i platform enables the critical etch capabilities required to continue advancing uniformity and etch profile control for maximizing yield and lowering wafer costs. As dimensions shrink and aspect ratios increase, the Sense.i platform is designed to support future technology inflections.Powered by Lam’s Equipment Intelligence® technology, the self-aware Sense.i platform enables semiconductor manufacturers to capture and analyze data, identify patterns and trends, and specify actions for improvement. Sense.i also features autonomous calibration and maintenance capabilities that reduce downtime and labor costs, and delivers machine learning algorithms that allow the tool to self-adapt to minimize process variations and maximize wafer output.The Sense.i platform has a revolutionary space-saving architecture that will help customers meet their future wafer output targets by producing more than a 50% improvement in etch output density. As semiconductor manufacturers develop smarter, faster, and denser chips, processes are rapidly growing in complexity and number of steps. This requires a greater number of process chambers in a fab and reduces total output for a given floor space. The Sense.i platform’s smaller footprint benefits either a new fab build or a fab undergoing a node-to-node technology conversion.“Lam is introducing the most innovative etch product that has been developed in the last 20 years,” said Vahid Vahedi, senior vice president and general manager of the Etch product group at Lam Research. “Sense.i extends our technology roadmap to meet our customers’ next-generation requirements while solving the critical cost scaling challenges they’re facing in their business. With more than four million wafers processed on Lam etch systems every month, Lam has an installed-base that provides extraordinary learning to innovate, design, and produce the best tools for semiconductor manufacturing.”For more information about Sense.i visit the product page. Watch this video for an overview of the new etch system.About Lam ResearchLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.  (LRCX-P)Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited: the performance of the tools we sell or service; the requirements of our customers for future innovation and the ability of our tools to meet the customers’ future requirements; future process requirements in the semiconductor industry; the cost effectiveness of our tool offerings; the learning that we may obtain from our installed base and our ability to increase etch output density and wafer output per area, and hence increase efficiency and output for customers. These statements are based on current expectations and are subject to risks, uncertainties, and changes in condition, significance, value and effect including those risks and uncertainties that are described in the documents filed or furnished by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019 and our quarterly reports on Form 10-Q for the fiscal quarters ended December 29, 2019 and September 29, 2019. These uncertainties and changes could materially affect the forward-looking statements and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.Company Contacts: Libra White Media Relations (510) 572-7725 publicrelations@lamresearch.com  Ram Ganesh Investor Relations (510) 572-1615 investor.relations@lamresearch.comA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/6e39eb23-7c15-4100-a31f-795546f25c90"
    },
    {
        "title": "Lam Research Unveils Technology Breakthrough for EUV Lithography",
        "subtitle": "",
        "date": "Feb 26, 2020 9:30AM EST",
        "content": "FREMONT, Calif., Feb.  26, 2020  (GLOBE NEWSWIRE) -- Lam Research Corp. (Nasdaq: LRCX) today announced a dry resist technology for extreme ultraviolet (EUV) patterning. By combining Lam’s deposition and etch process leadership with strategic partnerships with ASML and imec, Lam is developing a new dry resist technology that will help to extend the resolution, productivity, and yield of EUV lithography. Lam’s dry resist solutions offer significant EUV sensitivity and resolution advantages and thus an improved overall cost for each EUV wafer pass.As EUV lithography systems are now being used in high volume manufacturing by leading-edge chipmakers, further improvements to productivity and resolution will help extend affordable scaling to future process nodes. Lam’s new dry resist application and development technologies will enable lower dose and increased resolution, thereby increasing productivity and enlarging the exposure process window. Additionally, by utilizing five to ten times less raw materials, Lam’s dry resist approach provides significant running cost savings to customers while also delivering a more sustainable solution for environmental, social, and governance (ESG) measures.“After more than twenty years of sustained R&D by ASML and its partners, EUV is now being used in high volume chip manufacturing,” said Peter Wennink, president and CEO of ASML. “We are committed to maturing and extending this technology further through close collaboration with Lam Research and imec. This strategic partnership on dry resist technology supports chipmakers to innovate higher performance chips at lower cost, unlocking the potential of technology for society.”“This technology breakthrough is a perfect example of innovation through collaboration and how our valued partnerships with ASML and imec continue to bring new benefits to customers and the industry,” said Tim Archer, president and CEO of Lam Research. “Lam continues to lead in deposition and etch, and we are excited by this new opportunity to expand our patterning solutions directly into photosensitive lithographic materials. This new capability demonstrates Lam’s comprehensive patterning strategy, first enabling the industry to scale with multiple patterning solutions and now by enhancing the productivity and performance of EUV.”Lam is engaged with multiple chipmakers in solving key challenges of EUV lithography using this dry resist technology. The new dry resist technology enables continued scaling for advanced logic and memory devices.“Optimizing a patterning process requires a lot of diverse skills, and for many years, imec has been pioneering the patterning process development in collaboration with key industry partners,” said Luc Van den hove, president and CEO of imec. “Dry resist can be a key enabling technology for further adoption of EUV lithography and acceleration of the technology roadmap. Together with Lam and ASML, we aim to optimize the dry resist technology to get the best possible performance.”Lam will present its new technology development at the SPIE Advanced Lithography conference in San Jose at 9:40 a.m. PST on February 26, 2020.About Lam ResearchLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.  (LRCX-T)Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to: the performance of Lam’s tools and processes and, specifically, the performance and advantages obtained through the use of Lam’s new dry resist technology; the effect of that new technology on the cost and productivity of EUV lithography; the need for improvements to the productivity and resolution of EUV lithography; the amount of raw material saved by use of the new technology; and the benefits of industry collaborations. These statements are based on current expectations and are subject to risks, uncertainties, and changes in condition, significance, value and effect including those risks and uncertainties that are described in the documents filed or furnished by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019 and our quarterly reports on Form 10-Q for the fiscal quarters ended December 29, 2019 and September 29, 2019. These uncertainties and changes could materially affect the forward-looking statements and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.Company Contacts: Libra White Media Relations (510) 572-7725 publicrelations@lamresearch.com  Ram Ganesh Investor Relations (510) 572-1615 investor.relations@lamresearch.com"
    },
    {
        "title": "Lam Research Corporation Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Feb 21, 2020 4:05PM EST",
        "content": "FREMONT, Calif., Feb.  21, 2020  (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq: LRCX) today announced that its Board of Directors has approved a quarterly dividend of $1.15 per share of common stock. The dividend payment will be made April 8, 2020 to holders of record on March 25, 2020.  Future dividend payments are subject to review and approval by the Board of Directors.About Lam Research:Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Caution Regarding Forward-Looking Statements:Statements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to, our plans to declare dividends, our engineering capabilities, our technology leadership, our commitment to customer success, and our continued ability to accelerate innovation and enhance device performance. These forward-looking statements are based on current expectations and are subject to uncertainties and changes in condition, significance, value and effect, our continued financial health and ability to pay dividends, and other risks detailed in documents filed by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019 and quarterly reports on Form 10-Q for the quarters ended September 29, 2019 and December 29, 2019. These uncertainties and changes could cause actual results to vary from expectations. The Company undertakes no obligation to update the information or statements made in this press release.Company Contact:Ram GaneshInvestor Relations(510) 572 – 1615 Email: investor.relations@lamresearch.com Source: Lam Research Corporation### "
    },
    {
        "title": "Lam Research Corporation to Host Upcoming Investor Meeting",
        "subtitle": "",
        "date": "Feb 4, 2020 6:00PM EST",
        "content": "FREMONT, Calif., Feb.  04, 2020  (GLOBE NEWSWIRE) -- Lam Research Corporation (NASDAQ: LRCX) announced it will host the following event:The meeting will serve as a general update for investors and analysts on Lam’s strategy and operations. A live webcast and replay of the meeting will be available to the public on the Investors section of the company's website.If you are an institutional investor or financial analyst interested in attending the event in person, please direct your questions to investor.relations@lamresearch.com.About Lam Research:Lam Research Corp. is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Lam Research Corporation Contact: Ram Ganesh Investor Relations Phone: 510-572-1615 e-mail: investor.relations@lamresearch.comSource: Lam Research Corporation"
    },
    {
        "title": "Lam Research to Expand Global Footprint",
        "subtitle": "",
        "date": "Feb 3, 2020 10:36PM EST",
        "content": "KUALA LUMPUR, Malaysia, Feb.  03, 2020  (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq: LRCX), in collaboration with the Malaysian Investment Development Authority (MIDA) today announced that Lam has selected Batu Kawan Industrial Park in Penang, Malaysia as the location for a new advanced technology production facility.“MITI and MIDA have been hard at work to entice more quality investments globally, particularly in the areas of technology and innovation to propel Malaysia to greater heights. This project, in particular, will ultimately create new opportunities for local businesses and vendors as well as high-value jobs for Malaysians.” said YB Datuk Darell Leiking, Minister of International Trade and Industry (MITI).The new facility will be 700,000 square feet at the initial phase with the opportunity to expand in the future.  Construction is expected to begin in early 2020, with the first shipment by 2021.  With the new facility, it is projected that there will be up to approximately 350 jobs added over the next three years, including roles in manufacturing, facilities and on-site shipping and receiving.The Minister of Finance, YB Mr Lim Guan Eng, said, “The establishment of Lam Research’s new advanced technology production facility in Batu Kawan is a mark of confidence in the capacity and promise of sustainable growth of the Malaysian economy, especially in the manufacturing sector. We are confident that Malaysia’s attractive talent pool, facilitative investment environment, as well as its deep integration with the international supply chain, offers the right mix for the high-tech sectors.”Lam’s global operations are essential to its success in quickly delivering innovative technologies to its customers worldwide. This expansion adds to Lam’s existing global production footprint with locations in the United States, South Korea, and Austria.“We are excited to partner with the Government of Malaysia, specifically with the state of Penang, as we add to our global footprint,” said Kevin Jennings, Senior Vice President, Global Operations of Lam Research. “This facility is additive to Lam’s global operations and enables us to provide additional capacity, ensure business continuity for critical activities, and most importantly, improve our speed to solutions by being closer to customers and suppliers in the region.”*****About Lam ResearchLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.  (LRCX-B)About MIDAMIDA is the government's principal promotion agency under the Ministry of International Trade and Industry (MITI) to oversee and drive investments into the manufacturing and services sectors in Malaysia. Headquartered in Kuala Lumpur Sentral, MIDA has 12 regional and 20 overseas offices. MIDA continues to be the strategic partner to businesses in seizing the opportunities arising from the technology revolution of this era. For more information, please visit www.mida.gov.my and follow us on Twitter, Instagram and Facebook.Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited: timing of construction and commencement of operations of the new facility, number and timing of new job opportunities, and benefits to Lam’s operations, business continuity and speed to solutions that may result from the new facility. These statements are based on current expectations and are subject to risks, uncertainties, and changes in condition, significance, value and effect, such as construction delays, regulatory requirements, risks related to recruiting and hiring, and other risks and uncertainties that are described in the documents filed or furnished by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019 and our quarterly report on Form 10-Q for the fiscal quarter ended September 29, 2019. These uncertainties and changes could materially affect the forward-looking statements and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.For media queries, please contact:Malaysian Investment Development Authority (MIDA)Mr. Jeyasigan Narayanan NairDirector, Machinery and Metals Division03-2267 6711| jeyasigan@mida.gov.my"
    },
    {
        "title": "Lam Research Corporation Reports Financial Results for the Quarter Ended December 29, 2019",
        "subtitle": "",
        "date": "Jan 29, 2020 4:05PM EST",
        "content": "FREMONT, Calif., Jan.  29, 2020  (GLOBE NEWSWIRE) -- Lam Research Corporation (the \"Company,\" \"Lam,\" \"Lam Research\") today announced financial results for the quarter ended December 29, 2019 (the “December 2019 quarter”).Highlights for the December 2019 quarter were as follows:Key Financial Data for the Quarters EndedDecember 29, 2019 and September 29, 2019(in thousands, except per-share data, percentages, and basis points)U.S. GAAP Financial ResultsFor the December 2019 quarter, revenue was $2,584 million, gross margin was $1,180 million, or 45.7% of revenue, operating expenses were $493 million, operating income was 26.6% of revenue, and net income was $515 million, or $3.43 per diluted share on a U.S. GAAP basis. This compares to revenue of $2,166 million, gross margin of $982 million, or 45.3% of revenue, operating expenses of $444 million, operating income of 24.8% of revenue, and net income of $466 million, or $3.09 per diluted share, for the quarter ended September 29, 2019 (the “September 2019 quarter”).Non-GAAP Financial ResultsFor the December 2019 quarter, non-GAAP gross margin was $1,181 million or 45.7% of revenue, non-GAAP operating expenses were $481 million, non-GAAP operating income was 27.1% of revenue, and non-GAAP net income was $602 million, or $4.01 per diluted share. This compares to non-GAAP gross margin of $983 million or 45.4% of revenue, non-GAAP operating expenses of $431 million, non-GAAP operating income of 25.5% of revenue, and non-GAAP net income of $480 million, or $3.18 per diluted share for the September 2019 quarter.“Lam closed out calendar 2019 with strong December quarter results,” said Tim Archer, Lam Research’s President and Chief Executive Officer. “We are executing at a high level in an improving wafer fabrication equipment environment and building a powerful pipeline of new products to fuel future growth.”Balance Sheet and Cash Flow ResultsCash and cash equivalents, short-term investments, and restricted cash and investments balances decreased to $4.9 billion at the end of the December 2019 quarter compared to $5.8 billion at the end of the September 2019 quarter. This decrease was primarily the result of $1.0 billion of share repurchases, including net share settlement on employee stock-based compensation, $166.7 million of dividends paid to stockholders, and $62.1 million of capital expenditures, partially offset by $307.9 million of cash generated from operating activities.Deferred revenue and deferred profit at the end of the December 2019 quarter decreased to $411 million and $366 million, respectively, as compared to $481 million and $407 million, respectively, at the end of the September 2019 quarter. Lam’s deferred revenue balance does not include shipments to customers in Japan, to whom title does not transfer until customer acceptance. Shipments to customers in Japan are classified as inventory at cost until the time of acceptance. The estimated future revenue from shipments to customers in Japan was approximately $91 million as of December 29, 2019 and $47 million as of September 29, 2019.Geographic DistributionThe geographic distribution of revenue during the December 2019 quarter is shown in the following table:OutlookFor the quarter ended March 29, 2020, Lam is providing the following guidance:The information provided above is only an estimate of what the Company believes is realizable as of the date of this release and does not incorporate the potential impact of any business combinations, asset acquisitions, divestitures, restructuring, balance sheet valuation adjustments, financing arrangements, other investments, or other significant arrangements that may be completed after the date of this release. U.S. GAAP to non-GAAP reconciling items provided include only those items that are known and can be estimated as of the date of this release. Actual results will vary from this model and the variations may be material. Reconciling items included above are as follows:Use of Non-GAAP Financial ResultsIn addition to U.S. GAAP results, this press release also contains non-GAAP financial results. The Company’s non-GAAP results for both the December 2019 and September 2019 quarters exclude amortization related to intangible assets acquired through business combinations, amortization of note discounts, and income tax benefit of non-GAAP items. Additionally, the December 2019 quarter non-GAAP results exclude the cumulative income tax benefit reversal due to the Ninth Circuit decision to deny a rehearing of the Altera stock-based compensation case and the September 2019 quarter non-GAAP results exclude restructuring charges.Management uses non-GAAP gross margin, operating expense, operating income, operating income as a percentage of revenue, net income, and net income per diluted share to evaluate the Company’s operating and financial results. The Company believes the presentation of non-GAAP results is useful to investors for analyzing business trends and comparing performance to prior periods, along with enhancing investors’ ability to view the Company’s results from management’s perspective. Tables presenting reconciliations of non-GAAP results to U.S. GAAP results are included at the end of this press release and on the Company’s website at http://investor.lamresearch.com.Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to: the estimated future revenue from shipments to customers in Japan; the timing and amount of revenue and profit earned from any booked deferred revenue and profit; our continuing ability to execute; improvement in the wafer fabrication equipment environment; our ability to develop successful new products and the potential for those products to fuel future growth; the legal and business factors that may affect our future tax rate; and our guidance for revenue, gross margin (both as a dollar value and a percentage of revenue), operating income (both as a dollar value and a percentage of revenue), net income or earnings per diluted share, on either a GAAP or non-GAAP basis and diluted share count. Some factors that may affect these forward-looking statements include: business, political and/or regulatory conditions in the consumer electronics industry, the semiconductor industry and the overall economy may deteriorate or change; the actions of our customers and competitors may be inconsistent with our expectations; and widespread outbreaks of illness may impact our operations and revenue in affected areas; as well as the other risks and uncertainties that are described in the documents filed or furnished by us with the Securities and Exchange Commission, including specifically the Risk Factors described in our annual report on Form 10-K for the fiscal year ended June 30, 2019 and our quarterly report on Form 10-Q for the fiscal quarter ended September 29, 2019. These uncertainties and changes could materially affect the forward-looking statements and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.About Lam ResearchLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Consolidated Financial Tables Follow.LAM RESEARCH CORPORATIONCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS(in thousands, except per share data and percentages)(unaudited) LAM RESEARCH CORPORATIONCONDENSED CONSOLIDATED BALANCE SHEETS(in thousands)LAM RESEARCH CORPORATIONCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS(in thousands, unaudited)Non-GAAP Financial Summary(in thousands, except percentages and per share data)(unaudited)Reconciliation of U.S. GAAP Net Income to Non-GAAP Net Income(in thousands, except per share data)(unaudited)Reconciliation of U.S. GAAP Gross Margin, Operating Expenses and Operating Income to Non-GAAP Gross Margin, Operating Expenses and Operating Income(in thousands, except percentages)(unaudited)Lam Research Corporation Contact:Tina Correia, Investor Relations, phone: 510-572-1615, e-mail: investor.relations@lamresearch.com"
    },
    {
        "title": "Thinking about trading options or stock in Applied Materials, Amazon.com, Baidu, Lam Research, or NVIDIA?",
        "subtitle": "",
        "date": "Jan 10, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 10, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMAT, AMZN, BIDU, LRCX, and NVDA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast. (Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-applied-materials-amazoncom-baidu-lam-research-or-nvidia-300984887.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Lam Research Corporation Announces December 2019 Quarter Financial Conference Call",
        "subtitle": "",
        "date": "Jan 8, 2020 4:05PM EST",
        "content": "FREMONT, Calif., Jan.  08, 2020  (GLOBE NEWSWIRE) -- Lam Research Corp. (NASDAQ: LRCX) today announced that the company will host its quarterly financial conference call and webcast on Wednesday, January 29, 2020, beginning at 2:00 p.m. Pacific Time.About Lam ResearchLam Research Corp. is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world's leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Ram GaneshInvestor Relations(510) 572-1615Email:  investor.relations@lamresearch.com "
    },
    {
        "title": "Lam Research Offers New Capabilities in its Edge Yield Product Portfolio",
        "subtitle": "",
        "date": "Dec 3, 2019 7:00AM EST",
        "content": "FREMONT, Calif., Dec.  03, 2019  (GLOBE NEWSWIRE) -- Lam Research Corp. (Nasdaq: LRCX) is offering new capabilities in its semiconductor manufacturing systems portfolio to further improve device yield at the edge of the wafer, which is essential to delivering greater productivity for customers.During the semiconductor production process, device manufacturers want to build integrated circuits on the entire surface of the wafer. On the edge of the wafer, where chemical, physical and thermal discontinuities are harder to control, the risk of yield loss increases. Controlling etch non-uniformity and preventing defects at the wafer’s edge is key to semiconductor device manufacturing cost reduction.Lam offers edge yield solutions for high volume manufacturing with the Corvus® etch and Coronus® plasma bevel clean systems. These solutions can be found in leading-edge node manufacturing facilities around the world and are extensively used by advanced foundry, logic, DRAM, and NAND customers.Corvus enhances edge yield on the Kiyo® and Versys® Metal systems by smoothing out extreme edge discontinuities. With Corvus, every die on the wafer sees the same conditions for optimal yield, reducing previously seen systematic die-to-die variability. Lam’s Corvus technology also minimizes deviation at the edge using its tunability features.Coronus improves device yield by removing defect sources from the bevel region or depositing encapsulating layers for bevel protection. Coronus’ versatility manages bevel challenges such as eliminating defects from film/polymer residues and roughened surfaces, as well as depositing layers for bevel protection during long otherwise damaging etch processes. The Coronus product family demonstrates excellent repeatability enabled by proprietary wafer placement and plasma confinement technologies.“Substantially increasing yield at the edge of a wafer is a significant factor in terms of reducing costs at advanced nodes,” said Vahid Vahedi, senior vice president and general manager of the Etch product group at Lam Research. “Lam collaborates with customers very early in the development process, which allows us to identify and solve the unique technical challenges they face at the edge of the wafer. Lam has extended our capabilities for improved productivity and greater yield that is critical for cost-effective device scaling.”About Lam ResearchLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.  (LRCX-P)Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited: the performance of the tools we sell; the requirements of our customers for edge yield management; the cost effectiveness of our tool offerings; our ability to enable greater yield, and hence higher profitability for manufacturing advanced devices; and the benefits that we achieve from our customer collaborations. These statements are based on current expectations and are subject to risks, uncertainties, and changes in condition, significance, value and effect including those risks and uncertainties that are described in the documents filed or furnished by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019 and our quarterly report on Form 10-Q for the fiscal quarter ended September 29, 2019. These uncertainties and changes could materially affect the forward-looking statements and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.Company Contacts: Libra White Media Relations 510-572-7725 publicrelations@lamresearch.com  Ram Ganesh Investor Relations (510) 572-1615 investor.relations@lamresearch.com"
    },
    {
        "title": "Lam Research Corporation Announces Participation at Upcoming Conference",
        "subtitle": "",
        "date": "Nov 19, 2019 4:05PM EST",
        "content": "FREMONT, Calif., Nov.  19, 2019  (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq: LRCX) today announced its participation at an upcoming investor event:A live webcast of the presentation will be available to the public and can be accessed from the Investors’ section of Lam’s website at www.lamresearch.com.  A replay of the webcast will be available for two weeks after the presentation date.About Lam Research:Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.Lam Research Corporation Contact:Ram GaneshInvestor RelationsPhone: 510-572-1615e-mail: investor.relations@lamresearch.com"
    },
    {
        "title": "Lam Research Corporation Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Nov 7, 2019 4:05PM EST",
        "content": "FREMONT, Calif., Nov.  07, 2019  (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq: LRCX) today announced that its Board of Directors has approved a quarterly dividend of $1.15 per share of common stock. The dividend payment will be made January 8, 2020 to holders of record on December 11, 2019. Future dividend payments are subject to review and approval by the Board of Directors.About Lam Research:Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Caution Regarding Forward-Looking Statements:Statements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to, our plans to declare dividends, our engineering capabilities, our technology leadership, our commitment to customer success, and our continued ability to accelerate innovation and enhance device performance. These forward-looking statements are based on current expectations and are subject to uncertainties and changes in condition, significance, value and effect, our continued financial health and ability to pay dividends, and other risks detailed in documents filed by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019 and quarterly report on Form 10-Q for the quarter ended September 29, 2019. These uncertainties and changes could cause actual results to vary from expectations. The Company undertakes no obligation to update the information or statements made in this press release.Company Contacts:Ram GaneshInvestor Relations(510) 572 – 1615Email: investor.relations@lamresearch.com Source: Lam Research Corporation###"
    },
    {
        "title": "Lam Research Corporation Reports Financial Results for the Quarter Ended September 29, 2019",
        "subtitle": "",
        "date": "Oct 23, 2019 4:05PM EDT",
        "content": "FREMONT, Calif., Oct.  23, 2019  (GLOBE NEWSWIRE) -- Lam Research Corporation (the \"Company,\" \"Lam,\" \"Lam Research\") today announced financial results for the quarter ended September 29, 2019 (the “September 2019 quarter”).Highlights for the September 2019 quarter were as follows:Key Financial Data for the Quarters EndedSeptember 29, 2019 and June 30, 2019(in thousands, except per-share data, percentages, and basis points)U.S. GAAP Financial ResultsFor the September 2019 quarter, revenue was $2,166 million, gross margin was $982 million, or 45.3% of revenue, operating expenses were $444 million, operating income was 24.8% of revenue, and net income was $466 million, or $3.09 per diluted share on a U.S. GAAP basis. This compares to revenue of $2,361 million, gross margin of $1,081 million, or 45.8% of revenue, operating expenses of $464 million, operating income of 26.1% of revenue, and net income of $542 million, or $3.51 per diluted share, for the quarter ended June 30, 2019 (the “June 2019 quarter”).Non-GAAP Financial ResultsFor the September 2019 quarter, non-GAAP gross margin was $983 million or 45.4% of revenue, non-GAAP operating expenses were $431 million, non-GAAP operating income was 25.5% of revenue, and non-GAAP net income was $480 million, or $3.18 per diluted share. This compares to non-GAAP gross margin of $1,085 million or 45.9% of revenue, non-GAAP operating expenses of $450 million, non-GAAP operating income of 26.9% of revenue, and non-GAAP net income of $559 million, or $3.62 per diluted share for the June 2019 quarter.“Lam delivered solid results in the September quarter, highlighted by strong profitability,” said Tim Archer, Lam Research’s President and Chief Executive Officer. “Through our unwavering commitment to customer collaboration and technology innovation, Lam has laid a foundation for long-term growth and outperformance.”Balance Sheet and Cash Flow ResultsCash and cash equivalents, short-term investments, and restricted cash and investments balances increased slightly to $5.8 billion at the end of the September 2019 quarter compared to $5.7 billion at the end of the June 2019 quarter. This increase was primarily the result of $464.0 million of cash generated from operating activities, partially offset by approximately $158.9 million of dividends paid to shareholders, $78.1 million of share repurchases, including net share settlement on employee stock-based compensation, $39.3 million of capital expenditures, and $29.0 million of debt reductions.Deferred revenue and deferred profit at the end of the September 2019 quarter increased to $481 million and $407 million, respectively, as compared to $449 million and $381 million, respectively, at the end of the June 2019 quarter. Lam’s deferred revenue balance does not include shipments to customers in Japan, to whom title does not transfer until customer acceptance. Shipments to customers in Japan are classified as inventory at cost until the time of acceptance. The estimated future revenue from shipments to customers in Japan was approximately $47 million as of September 29, 2019 and $78 million as of June 30, 2019.Geographic DistributionThe geographic distribution of revenue during the September 2019 quarter is shown in the following table:OutlookFor the December 2019 quarter, Lam is providing the following guidance:The information provided above is only an estimate of what the Company believes is realizable as of the date of this release and does not incorporate the potential impact of any business combinations, asset acquisitions, divestitures, restructuring, balance sheet valuation adjustments, financing arrangements, other investments, or other significant arrangements that may be completed after the date of this release. U.S. GAAP to non-GAAP reconciling items provided include only those items that are known and can be estimated as of the date of this release. Actual results will vary from this model and the variations may be material. Reconciling items included above are as follows:Use of Non-GAAP Financial ResultsIn addition to U.S. GAAP results, this press release also contains non-GAAP financial results. The Company’s non-GAAP results for both the September 2019 and June 2019 quarters exclude amortization related to intangible assets acquired through business combinations, restructuring charges, amortization of note discounts, and income tax benefit of non-GAAP items. Additionally, the June 2019 quarter non-GAAP results exclude income tax impacts associated with U.S. tax reform and income tax benefit on the conclusion of tax matters related to a prior business combination.Management uses non-GAAP gross margin, operating expense, operating income, operating income as a percentage of revenue, net income, and net income per diluted share to evaluate the Company’s operating and financial results. The Company believes the presentation of non-GAAP results is useful to investors for analyzing business trends and comparing performance to prior periods, along with enhancing investors’ ability to view the Company’s results from management’s perspective. Tables presenting reconciliations of non-GAAP results to U.S. GAAP results are included at the end of this press release and on the Company’s website at http://investor.lamresearch.com.Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to: the estimated future revenue from shipments to customers in Japan; the timing and amount of revenue and profit earned from any booked deferred revenue and profit; the success or outcome of our collaboration and innovation efforts; our long term growth and performance, including outperformance of the market, the industry or our competitors; the legal and business factors that may affect our future tax rate; and our guidance for revenue, gross margin (both as a dollar value and a percentage of revenue), operating income (both as a dollar value and a percentage of revenue), net income or earnings per diluted share, on either a GAAP or non-GAAP basis and diluted share count. Some factors that may affect these forward-looking statements include: business, political and/or regulatory conditions in the consumer electronics industry, the semiconductor industry and the overall economy may deteriorate or change; and the actions of our customers and competitors may be inconsistent with our expectations, as well as the other risks and uncertainties that are described in the documents filed or furnished by us with the Securities and Exchange Commission, including specifically the Risk Factors described in our annual report on Form 10-K for the fiscal year ended June 30, 2019. These uncertainties and changes could materially affect the forward-looking statements and cause actual results to vary from expectations in a material way. The Company undertakes no obligation to update the information or statements made in this release.About Lam ResearchLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Consolidated Financial Tables Follow.LAM RESEARCH CORPORATIONCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS(in thousands, except per share data and percentages)(unaudited) LAM RESEARCH CORPORATIONCONDENSED CONSOLIDATED BALANCE SHEETS(in thousands)LAM RESEARCH CORPORATIONCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS(in thousands, unaudited)Non-GAAP Financial Summary(in thousands, except percentages and per share data)(unaudited)Reconciliation of U.S. GAAP Net Income to Non-GAAP Net Income(in thousands, except per share data)(unaudited)Reconciliation of U.S. GAAP Gross Margin, Operating Expenses and Operating Income to Non-GAAP Gross Margin, Operating Expenses and Operating Income(in thousands, except percentages)(unaudited)Lam Research Corporation Contact:Tina Correia, Investor Relations, phone: 510-572-1615, e-mail: investor.relations@lamresearch.com"
    },
    {
        "title": "Lam Research Corporation Announces September 2019 Quarter Financial Conference Call",
        "subtitle": "",
        "date": "Oct 2, 2019 4:05PM EDT",
        "content": "FREMONT, Calif., Oct.  02, 2019  (GLOBE NEWSWIRE) -- Lam Research Corp. (NASDAQ: LRCX) today announced that the company will host its quarterly financial conference call and webcast on Wednesday, October 23, 2019, beginning at 2:00 p.m. Pacific Time.About Lam ResearchLam Research Corp. is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world's leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Ram GaneshInvestor Relations(510) 572-1615Email:  investor.relations@lamresearch.com"
    },
    {
        "title": "Lam Research Announces New Technology Center in Gyeonggi-do, South Korea",
        "subtitle": "",
        "date": "Sep 27, 2019 4:19AM EDT",
        "content": "\nCenter to reposition South Korea as a tech powerhouse \n    FREMONT, Calif. & GYEONGGI-DO, South Korea--(BUSINESS WIRE)--\nKorean government officials from the Gyeonggi-do province and executives at Lam Research Corporation (Nasdaq: LRCX), a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry, both signed a memo of understanding (MOU) to establish the Korea Technology Center (KTC), a research and development facility with a focus on key equipment for semiconductor manufacturing processes.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190927005117/en/Gov. Lee and Timothy M. Archer, president of Lam Research (Photo: Business Wire)\nThe initial investment of $50 million from Lam Research will provide engineers with premium equipment for semiconductor manufacturing processes. The KTC will join Samsung Electronics, located in the cities of Giheung, Hwaseong, and Pyoengtaek and SK Hynix, located in Icheon and Yongin are all in the Gyeonggi-do province and the addition of the KTC will help form the world’s largest semiconductor cluster.\n\n“The success of Lam Research in Gyeonggi-do is a success for our business and economy, and it’s a great help for our citizens. Therefore, I will organize a ‘dedicated department’ to do our best to support them. They will experience the promptness of the Gyeonggi-do administration. I hope for the success of Lam Research for the local economy of Gyeonggi-do,” said Gyeonggi-do Gov. Lee Jae-myung.\n\nTheir new technology center will create over 300 new engineering jobs while providing a localized space to support necessary equipment.\n\n“One of the biggest issues in the Korean economy is speeding up the localization of equipment and materials. In this respect, Lam Research’s investment decision will be greatly welcomed by not only Gyeonggi-do but also from all of Korea. I hope we can host manufacturing facilities in addition to the Korea Technology Center in the near future,” said Gov. Lee.\n\nGyeonggi Gov. Lee Jae-myung and Timothy M. Archer, president of Lam Research Corporation signed the MOU for the Gyeonggi-do and Lam Research investment. Inhak Suh, Chairman of Lam Research Korea, and his team, were among the 20 people who participated.\n\n\"This MOU agreement between Lam Research and Gyeonggi-do is part of our ongoing effort to provide better service to our customers worldwide,\" said Timothy M. Archer, Lam Research Corporation President. \"We will be able to shorten the learning cycle for Lam and provide faster service to our customers by narrowing the geographic distance between our suppliers and our suppliers' facilities.\"\n\nUnder this agreement, Lam Research will work to support various licenses and make efforts to resolve any difficulties that may arise in order to successfully implement the investment plan. Lam Research’s global equipment manufacturing facility called Lam Research Manufacturing Korea, is also based in Osan, Gyeonggi-do.\n\nAbout Lam Research \n\nLam Research Corp. is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190927005117/en/\nKent Barrett, kbarrett@hoytorg.com\nThe Hoyt Organization, 310-373-0103\nSource: Lam Research Corporation"
    },
    {
        "title": "Lam Research Announces 2019 Supplier Excellence Award Recipients",
        "subtitle": "",
        "date": "Sep 11, 2019 4:05PM EDT",
        "content": "FREMONT, Calif., Sept.  11, 2019  (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq: LRCX) today announced it has presented six companies with 2019 Supplier Excellence Awards. The recipients were selected from Lam’s preferred global suppliers and were acknowledged for their outstanding service, superior performance, and commitment to quality in their collaboration with Lam.The awards were given to the following companies for “Overall Supplier Excellence” on September 10 during the company’s Supplier Day event.Lam’s joint venture partner, TALUS Inc., was also recognized during the event for “Manufacturing Supplier Excellence.”“Our suppliers are critical to the success of Lam, and we are pleased to recognize each of the award recipients who were the top performers amongst a distinguished partner ecosystem,” said Tim Archer, president and chief executive officer of Lam Research. “By building partnerships that enable collaboration and transparency with our top suppliers, we continue to deliver industry-leading products and services that meet the quality and performance expectations of our customers.”About Lam Research Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world’s leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq: LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-B)Caution Regarding Forward-Looking StatementsStatements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to, the value of the relationships we have with our suppliers and our ability to provide products and services that meet the expectations of our customers. These forward-looking statements are based on current expectations and are subject to uncertainties and changes in condition, significance, value and effect, and other risks detailed in documents filed by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 30, 2019. These uncertainties and changes could cause actual results to vary from expectations. The Company undertakes no obligation to update the information or statements made in this press release.Media Inquiries:Libra Whitepublicrelations@lamresearch.com510-572-7725"
    },
    {
        "title": "Lam Research Corporation Announces March Quarter Financial Conference Call",
        "subtitle": "",
        "date": "Apr 3, 2019 4:05PM EDT",
        "content": "FREMONT, Calif., April 03, 2019 (GLOBE NEWSWIRE) -- Lam Research Corp. (NASDAQ:LRCX) today announced that the company will host its quarterly financial conference call and webcast on Wednesday, April 24, 2019, beginning at 2:00 p.m. Pacific Time.\n  \n\n  \n    \n      Webcast:\n                  To access the webcast, visit the Investors section of Lam's web site at http://www.lamresearch.com and click on the Investors/Investors Overview/Events & Presentations section to view the details.\n              Replay Information: \n                      A webcast replay will be available on the Lam Research website approximately three hours after the conference call concludes.\n                  Contact Information: \n                      Lam Research Investor Relations Department. Investor.relations@lamresarch.com, 510-572-1615.\n                  \n  \n  About Lam ResearchLam Research Corp. is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world's leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq:LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Ram GaneshInvestor Relations(510) 572-1615Email: investor.relations@lamresearch.com   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Lam Research Corporation"
    },
    {
        "title": "Lam Research Corporation Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Feb 13, 2019 4:05PM EST",
        "content": "FREMONT, Calif., Feb. 13, 2019 (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq:LRCX) today announced that its Board of Directors has approved a quarterly dividend of $1.10 per share of common stock. The dividend payment will be made April 10, 2019 to holders of record on March 20, 2019. Future dividend payments are subject to review and approval by the Board of Directors.About Lam Research:Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world's leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq:LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com. (LRCX-F)Caution Regarding Forward-Looking Statements:Statements made in this press release that are not of historical fact are forward-looking statements and are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements relate to, but are not limited to, our plans to declare dividends, our engineering capabilities, our technology leadership, our commitment to customer success, and our continued ability to accelerate innovation and enhance device performance. These forward-looking statements are based on current expectations and are subject to uncertainties and changes in condition, significance, value and effect, our continued financial health and ability to pay dividends, and other risks detailed in documents filed by us with the Securities and Exchange Commission, including specifically our annual report on Form 10-K for the fiscal year ended June 24, 2018 and Form 10-Q for the quarters ended December 23, 2018 and September 23, 2018. These uncertainties and changes could cause actual results to vary from expectations. The Company undertakes no obligation to update the information or statements made in this press release.Company Contacts:Ram GaneshInvestor Relations(510) 572 - 1615Email: investor.relations@lamresearch.comSource: Lam Research Corporation   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Lam Research Corporation"
    },
    {
        "title": "Lam Research Corporation Announces Participation at Upcoming Conference",
        "subtitle": "",
        "date": "Jan 31, 2019 4:52PM EST",
        "content": "FREMONT, Calif., Jan. 31, 2019 (GLOBE NEWSWIRE) -- Lam Research Corporation (Nasdaq:LRCX) today announced its upcoming investor conference schedule:A live webcast of the presentation will be available to the public and can be accessed from the Investors' section of Lam's website at www.lamresearch.com. A replay of the webcast will be available for two weeks after the presentation date.About Lam Research:Lam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. As a trusted, collaborative partner to the world's leading semiconductor companies, we combine superior systems engineering capability, technology leadership, and unwavering commitment to customer success to accelerate innovation through enhanced device performance. In fact, today, nearly every advanced chip is built with Lam technology. Lam Research (Nasdaq:LRCX) is a FORTUNE 500® company headquartered in Fremont, Calif., with operations around the globe. Learn more at www.lamresearch.com.Lam Research Corporation Contact:Ram GaneshInvestor RelationsPhone: 510-572-1615e-mail: investor.relations@lamresearch.com   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Lam Research Corporation"
    },
    {
        "title": "Investor Expectations to Drive Momentum within Discovery Communications, Radian Group, Lam Research, Juniper Networks, EMCORE, and Ciner Resources LP — Discovering Underlying Factors of Influence",
        "subtitle": "",
        "date": "Jan 31, 2019 7:50AM EST",
        "content": "NEW YORK, Jan. 31, 2019 (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Market Source Research released its latest key findings for all current investors, traders, and shareholders of Discovery Communications, Inc. (NASDAQ:DISCK), Radian Group Inc. (NYSE:RDN), Lam Research Corporation (NASDAQ:LRCX), Juniper Networks, Inc. (NYSE:JNPR), EMCORE Corporation (NASDAQ:EMKR), and Ciner Resources LP (NYSE:CINR), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.Complimentary Access: Research ReportsFull copies of recently published reports are available to readers at the links below.DISCK DOWNLOAD: http://MarketSourceResearch.com/register/?so=DISCKRDN DOWNLOAD: http://MarketSourceResearch.com/register/?so=RDNLRCX DOWNLOAD: http://MarketSourceResearch.com/register/?so=LRCXJNPR DOWNLOAD: http://MarketSourceResearch.com/register/?so=JNPREMKR DOWNLOAD: http://MarketSourceResearch.com/register/?so=EMKRCINR DOWNLOAD: http://MarketSourceResearch.com/register/?so=CINR(You may have to copy and paste the link into your browser and hit the [ENTER] key)The new research reports from Market Source Research, available for free download at the links above, examine Discovery Communications, Inc. (NASDAQ:DISCK), Radian Group Inc. (NYSE:RDN), Lam Research Corporation (NASDAQ:LRCX), Juniper Networks, Inc. (NYSE:JNPR), EMCORE Corporation (NASDAQ:EMKR), and Ciner Resources LP (NYSE:CINR) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.-----------------------------------------Important Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed January 29th, 2019. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.-----------------------------------------DISCOVERY COMMUNICATIONS, INC. ( DISCK ) REPORT OVERVIEWDiscovery Communications' Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Discovery Communications reported revenue of $2,592.00MM vs $1,651.00MM (up 57.00%) and analysts estimated basic earnings per share $0.16 vs $0.38 (down 57.89%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Discovery Communications reported revenue of $6,873.00MM vs $6,497.00MM (up 5.79%) and analysts estimated basic earnings per share -$0.59 vs $1.97. Analysts expect earnings to be released on February 26th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.47. The estimated EPS forecast for the next fiscal year is $3.74 and is expected to report on February 26th, 2019.To read the full Discovery Communications, Inc. ( DISCK ) report, download it here: http://MarketSourceResearch.com/register/?so=DISCK-----------------------------------------RADIAN GROUP INC. (RDN) REPORT OVERVIEWRadian Group's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Radian Group reported revenue of $330.69MM vs $312.05MM (up 5.97%) and analysts estimated basic earnings per share $0.67 vs $0.30 (up 123.33%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Radian Group reported revenue of $1,221.63MM vs $1,238.45MM (down 1.36%) and analysts estimated basic earnings per share $0.56 vs $1.46 (down 61.64%). Analysts expect earnings to be released on February 8th, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $0.51. The estimated EPS forecast for the next fiscal year is $2.75 and is expected to report on February 8th, 2019.To read the full Radian Group Inc. (RDN) report, download it here: http://MarketSourceResearch.com/register/?so=RDN-----------------------------------------LAM RESEARCH CORPORATION ( LRCX ) REPORT OVERVIEWLam Research's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Lam Research reported revenue of $2,330.69MM vs $2,478.14MM (down 5.95%) and analysts estimated basic earnings per share $3.43 vs $3.64 (down 5.77%). For the twelve months ended June 30th, 2018 vs June 30th, 2017, Lam Research reported revenue of $11,077.00MM vs $8,013.62MM (up 38.23%) and analysts estimated basic earnings per share $14.73 vs $10.47 (up 40.69%). Analysts expect earnings to be released on April 16th, 2019. The report will be for the fiscal period ending March 31st, 2019. Reported EPS for the same quarter last year was $4.79. The estimated EPS forecast for the next fiscal year is $14.70 and is expected to report on July 25th, 2019.To read the full Lam Research Corporation ( LRCX ) report, download it here: http://MarketSourceResearch.com/register/?so=LRCX-----------------------------------------JUNIPER NETWORKS, INC. ( JNPR ) REPORT OVERVIEWJuniper Networks' Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Juniper Networks reported revenue of $1,179.80MM vs $1,257.80MM (down 6.20%) and basic earnings per share $0.65 vs $0.44 (up 47.73%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Juniper Networks reported revenue of $5,027.20MM vs $4,990.10MM (up 0.74%) and analysts estimated basic earnings per share $0.81 vs $1.55 (down 47.74%). Analysts expect earnings to be released on May 7th, 2019. The report will be for the fiscal period ending March 31st, 2019. The reported EPS for the same quarter last year was $0.10. The estimated EPS forecast for the next fiscal year is $1.65 and is expected to report on February 4th, 2020.To read the full Juniper Networks, Inc. ( JNPR ) report, download it here: http://MarketSourceResearch.com/register/?so=JNPR-----------------------------------------EMCORE CORPORATION ( EMKR ) REPORT OVERVIEWEMCORE's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, EMCORE reported revenue of $25.24MM vs $29.18MM (down 13.49%) and analysts estimated basic earnings per share -$0.22 vs $0.08. For the twelve months ended September 30th, 2018 vs September 30th, 2017, EMCORE reported revenue of $85.62MM vs $122.90MM (down 30.33%) and analysts estimated basic earnings per share -$0.64 vs $0.31. Analysts expect earnings to be released on February 5th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.00.To read the full EMCORE Corporation ( EMKR ) report, download it here: http://MarketSourceResearch.com/register/?so=EMKR-----------------------------------------CINER RESOURCES LP ( CINR ) REPORT OVERVIEWCiner Resources LP's Recent Financial PerformanceFor the three months ended September 30th, 2018 vs September 30th, 2017, Ciner Resources LP reported revenue of $123.40MM vs $122.50MM (up 0.73%) and analysts estimated basic earnings per share $0.44 vs $0.46 (down 4.35%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Ciner Resources LP reported revenue of $497.30MM vs $475.20MM (up 4.65%) and analysts estimated basic earnings per share $2.08 vs $2.08 (unchanged). Analysts expect earnings to be released on February 21st, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was $0.66. The estimated EPS forecast for the next fiscal year is $2.19 and is expected to report on February 21st, 2019.To read the full Ciner Resources LP ( CINR ) report, download it here: http://MarketSourceResearch.com/register/?so=CINR-----------------------------------------ABOUT MARKET SOURCE RESEARCHMarket Source Research delivers the key research reports that helps serious investors, registered brokers, professional traders, and personal investment advisers find reliable information in today's markets. Market Source Research's team is comprised of financial professionals, many of which hold Chartered Financial Analyst® (CFA®) designations and FINRA® BrokerCheck® certifications. Whether identifying emerging trends, or discovering new opportunity, the team at Market Source Research is dedicated to providing accurate, informative, and objective content that's ahead of the curve. With insights on individual companies as well as sectors, readers get the industry's best available combination of big-picture perspective as well as granular detail.REGISTERED MEMBER STATUSMarket Source Research's oversight and audit staff are registered analysts, brokers, and/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Market Source Research's roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Market Source Research have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Market Source Research's Compliance department by Phone, at +1 (704) 343-6361, or by E-mail at compliance@MarketSourceResearch.com.LEGAL NOTICESInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Market Source Research, Market Source Research members, and/or Market Source Research affiliates are not responsible for any gains or losses that result from the opinions expressed. Market Source Research makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Market Source Research has not been compensated for the publication of this press release by any of the above mentioned companies. Market Source Research is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.Media Contact:Hugo Moreau, Media DepartmentOffice: +1 (704) 343-6361E-mail: media@MarketSourceResearch.com© 2019 Market Source Research. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@MarketSourceResearch.com.CFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.FINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.Source: Market Source Research"
    }
]