[
    {
        "title": "lululemon athletica inc. Provides Update on China Operations",
        "subtitle": "",
        "date": "Feb 21, 2020 6:30AM EST",
        "content": "    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nWith the evolving dynamics related to the coronavirus outbreak in China, lululemon athletica inc. (NASDAQ:LULU) continues to work closely with local authorities to prioritize the safety of its people and guests in the region.\n\nFollowing guidance from local authorities, the majority of lululemon’s 38 stores in China have been closed for a period of time since February 3, 2020, with some now operating on a reduced schedule. The company’s online business has continued to operate.\n\n“We’re inspired by the resilience and commitment of our team in China as we navigate the emerging impacts of the coronavirus. The safety of our people is our highest priority, and we are adjusting store operations based upon the recommendations of local authorities,” said Calvin McDonald, Chief Executive Officer.\n\n“Despite the current disruption to our growing business in China, we remain confident in the long-term opportunities this market holds for lululemon,” McDonald added.\n\nThe company continues to monitor the situation and will provide an update on the financial and operational impact on its fourth quarter fiscal 2019 earnings call, to be held in late March.\n\nAbout lululemon athletica inc.\n\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\n\nForward-looking Statements \n\nThis press release includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. In many cases, you can identify forward-looking statements by terms such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"outlook,\" \"believes,\" \"intends,\" \"estimates,\" \"predicts,\" \"potential\" or the negative of these terms or other comparable terminology. These forward-looking statements also include our guidance and outlook statements. These statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation: our ability to maintain the value and reputation of our brand; the acceptability of our products to our guests; our highly competitive market and increasing competition; our reliance on and limited control over third-party suppliers to provide fabrics for and to produce our products; suppliers or manufacturers not complying with our Vendor Code of Ethics or applicable laws; an economic downturn or economic uncertainty in our key markets; increasing product costs and decreasing selling prices; our ability to anticipate consumer preferences and successfully develop and introduce new, innovative and updated products; our ability to accurately forecast guest demand for our products; our ability to safeguard against security breaches with respect to our information technology systems; any material disruption of our information systems; our ability to have technology-based systems function effectively and grow our e-commerce business globally; changes in consumer shopping preferences and shifts in distribution channels; the fluctuating costs of raw materials; our ability to expand internationally in light of our limited operating experience and limited brand recognition in new international markets; global economic and political conditions and global events such as health pandemics; our ability to deliver our products to the market and to meet guest expectations if we have problems with our distribution system; imitation by our competitors; our ability to protect our intellectual property rights; our ability to source and sell our merchandise profitably or at all if new trade restrictions are imposed or existing trade restrictions become more burdensome; changes in tax laws or unanticipated tax liabilities; our ability to manage our growth and the increased complexity of our business effectively; our ability to cancel store leases if an existing or new store is not profitable; increasing labor costs and other factors associated with the production of our products in South and South East Asia; the operations of many of our suppliers are subject to international and other risks; our ability to successfully open new store locations in a timely manner; our ability to comply with trade and other regulations; the service of our senior management; seasonality; fluctuations in foreign currency exchange rates; conflicting trademarks and the prevention of sale of certain products; our exposure to various types of litigation; actions of activist stockholders; anti-takeover provisions in our certificate of incorporation and bylaws; and other risks and uncertainties set out in filings made from time to time with the United States Securities and Exchange Commission and available at www.sec.gov, including, without limitation, our most recent reports on Form 10-K and Form 10-Q. You are urged to consider these factors carefully in evaluating the forward-looking statements contained herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by these cautionary statements. The forward-looking statements made herein speak only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200221005085/en/\nInvestors: \nlululemon athletica inc. \nHoward Tubin \n1-604-732-6124 \nor \nICR, Inc. \nJoseph Teklits/Caitlin Morahan \n1-203-682-8200\n\nMedia: \nlululemon athletica inc. \nErin Hankinson \n1-604-732-6124 \nor \nBrunswick Group \nEleanor French \n1-415-671-7676\nSource: lululemon athletica inc."
    },
    {
        "title": "Thinking about buying stock in Apple, Axsome Therapeutics, Crocs, Lululemon Athletica, or Tilray?",
        "subtitle": "",
        "date": "Jan 13, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 13, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, AXSM, CROX, LULU, and TLRY.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-axsome-therapeutics-crocs-lululemon-athletica-or-tilray-300985635.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "lululemon athletica inc. Updates Guidance for the Fourth Quarter of Fiscal 2019 Ahead of the ICR Conference",
        "subtitle": "",
        "date": "Jan 13, 2020 6:00AM EST",
        "content": "    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon athletica inc. (NASDAQ:LULU) today announced that the Company is updating its net revenue and earnings guidance for the fourth quarter of fiscal 2019 ending February 2, 2020.\n\nCalvin McDonald, Chief Executive Officer, commented: \"We're excited by the momentum in our business over the holiday period with guests responding well to our innovative merchandise offerings. The connection we have with our guests remains strong, and I want to thank our teams across the globe for their hard work and dedication throughout 2019.\"\n\nFor the fourth quarter of fiscal 2019, we now anticipate that net revenue will be in the range of $1.370 billion to $1.380 billion based on a total comparable sales increase in the mid to high teens on a constant dollar basis. This compares to our previous guidance of net revenue of $1.315 billion to $1.330 billion based on a total comparable sales increase in the low double digits on a constant dollar basis.\n\nWe now expect diluted earnings per share will be in the range of $2.22 to $2.25 for the fourth quarter. This compares to our previous diluted earnings per share guidance of $2.10 to $2.13.\n\nOur revised guidance for the fourth quarter continues to assume 131 million diluted weighted-average shares outstanding and a 28.5% tax rate.\n\nMembers of the management team will be meeting with analysts and investors at the ICR Conference in Orlando, Florida on January 13-15, 2020.\n\nAbout lululemon athletica inc.\n\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\n\nForward-Looking Statements:\n\nThis press release includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. In many cases, you can identify forward-looking statements by terms such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"outlook,\" \"believes,\" \"intends,\" \"estimates,\" \"predicts,\" \"potential\" or the negative of these terms or other comparable terminology. These forward-looking statements also include our guidance and outlook statements. These statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation: our ability to maintain the value and reputation of our brand; the acceptability of our products to our guests; our highly competitive market and increasing competition; our reliance on and limited control over third-party suppliers to provide fabrics for and to produce our products; suppliers or manufacturers not complying with our Vendor Code of Ethics or applicable laws; an economic downturn or economic uncertainty in our key markets; increasing product costs and decreasing selling prices; our ability to anticipate consumer preferences and successfully develop and introduce new, innovative and updated products; our ability to accurately forecast guest demand for our products; our ability to safeguard against security breaches with respect to our information technology systems; any material disruption of our information systems; our ability to have technology-based systems function effectively and grow our e-commerce business globally; changes in consumer shopping preferences and shifts in distribution channels; the fluctuating costs of raw materials; our ability to expand internationally in light of our limited operating experience and limited brand recognition in new international markets; our ability to deliver our products to the market and to meet guest expectations if we have problems with our distribution system; imitation by our competitors; our ability to protect our intellectual property rights; our ability to source and sell our merchandise profitably or at all if new trade restrictions are imposed or existing trade restrictions become more burdensome; changes in tax laws or unanticipated tax liabilities; our ability to manage our growth and the increased complexity of our business effectively; our ability to cancel store leases if an existing or new store is not profitable; increasing labor costs and other factors associated with the production of our products in South and South East Asia; the operations of many of our suppliers are subject to international and other risks; our ability to successfully open new store locations in a timely manner; our ability to comply with trade and other regulations; the service of our senior management; seasonality; fluctuations in foreign currency exchange rates; conflicting trademarks and the prevention of sale of certain products; our exposure to various types of litigation; actions of activist stockholders; anti-takeover provisions in our certificate of incorporation and bylaws; and other risks and uncertainties set out in filings made from time to time with the United States Securities and Exchange Commission and available at www.sec.gov, including, without limitation, our most recent reports on Form 10-K and Form 10-Q. You are urged to consider these factors carefully in evaluating the forward-looking statements contained herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by these cautionary statements. The forward-looking statements made herein speak only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005315/en/\nInvestors:\nlululemon athletica inc.\nHoward Tubin\n1-604-732-6124\nor\nICR, Inc.\nJoseph Teklits/Caitlin Morahan\n1-203-682-8200\n\nMedia:\nlululemon athletica inc.\nErin Hankinson\n1-604-732-6124\nor\nBrunswick Group\nEleanor French\n1-415-671-7676\nSource: lululemon athletica inc."
    },
    {
        "title": "lululemon Appoints Nikki Neuburger Chief Brand Officer",
        "subtitle": "",
        "date": "Jan 8, 2020 4:05PM EST",
        "content": "\nInnovative executive from Nike and Uber appointed to lead company’s marketing and brand creative strategies\n    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon athletica inc. (NASDAQ:LULU) today announced that it has appointed Nikki Neuburger as Chief Brand Officer, effective January 20. In this role, Ms. Neuburger will be responsible for elevating the lululemon brand and leading the marketing, creative, communications and sustainability functions to drive the company’s global brand and storytelling initiatives. She joins the company’s Senior Leadership Team, and will report to Chief Executive Officer, Calvin McDonald.\n\n“Nikki is an innovative marketing leader with a proven track record of building and scaling global brands, making her the ideal person to become lululemon’s first Chief Brand Officer,” said Mr. McDonald. “Her years of experience in the athletic industry, paired with her deep expertise in digital marketing, consumer insights and brand creative, will be instrumental as we build upon our momentum and deliver on our Power of Three growth strategy.”\n\nMs. Neuburger joins lululemon from Uber, where she served as Global Head of Marketing for Uber Eats for the past two years and led the introduction and expansion of the brand across five regions in 36 countries. Previously, Ms. Neuburger spent 14 years at Nike, most recently serving as the company’s Global Vice President of Nike Running. In this role, she led teams around the world and reset the brand position to focus on product innovation, digital services, and community building. She also oversaw the direction of the Nike Membership division.\n\n“I am thrilled to join lululemon at this exciting time in the company’s growth story,” said Ms. Neuburger. “I have long admired the company and deeply connect with its core values. I look forward to working with the senior leadership team and the lululemon teams across the globe as we continue to elevate the brand and build deeper connections with new and existing guests around the world.”\n\nA lifelong athlete, Ms. Neuburger graduated from Oregon State University with a Bachelor of Science in Business Administration and served as team captain of the University’s NCAA Division I volleyball team.\n\nAbout lululemon athletica inc.\n\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\n\nForward-Looking Statements:\n\nThis press release includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. In many cases, you can identify forward-looking statements by terms such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"outlook,\" \"believes,\" \"intends,\" \"estimates,\" \"predicts,\" \"potential\" or the negative of these terms or other comparable terminology. These forward-looking statements also include our guidance and outlook statements. These statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation: our ability to maintain the value and reputation of our brand; the acceptability of our products to our guests; our highly competitive market and increasing competition; our reliance on and limited control over third-party suppliers to provide fabrics for and to produce our products; suppliers or manufacturers not complying with our Vendor Code of Ethics or applicable laws; an economic downturn or economic uncertainty in our key markets; increasing product costs and decreasing selling prices; our ability to anticipate consumer preferences and successfully develop and introduce new, innovative and updated products; our ability to accurately forecast guest demand for our products; our ability to safeguard against security breaches with respect to our information technology systems; any material disruption of our information systems; our ability to have technology-based systems function effectively and grow our e-commerce business globally; changes in consumer shopping preferences and shifts in distribution channels; the fluctuating costs of raw materials; our ability to expand internationally in light of our limited operating experience and limited brand recognition in new international markets; our ability to deliver our products to the market and to meet guest expectations if we have problems with our distribution system; imitation by our competitors; our ability to protect our intellectual property rights; our ability to source and sell our merchandise profitably or at all if new trade restrictions are imposed or existing trade restrictions become more burdensome; changes in tax laws or unanticipated tax liabilities; our ability to manage our growth and the increased complexity of our business effectively; our ability to cancel store leases if an existing or new store is not profitable; increasing labor costs and other factors associated with the production of our products in South and South East Asia; the operations of many of our suppliers are subject to international and other risks; our ability to successfully open new store locations in a timely manner; our ability to comply with trade and other regulations; the service of our senior management; seasonality; fluctuations in foreign currency exchange rates; conflicting trademarks and the prevention of sale of certain products; our exposure to various types of litigation; actions of activist stockholders; anti-takeover provisions in our certificate of incorporation and bylaws; and other risks and uncertainties set out in filings made from time to time with the United States Securities and Exchange Commission and available at www.sec.gov, including, without limitation, our most recent reports on Form 10-K and Form 10-Q. You are urged to consider these factors carefully in evaluating the forward-looking statements contained herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by these cautionary statements. The forward-looking statements made herein speak only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005790/en/\nInvestors:\nlululemon athletica inc.\nHoward Tubin\n1-604-732-6124\nor\nICR, Inc.\nJoseph Teklits/Caitlin Morahan\n1-203-682-8200\n\nMedia:\nlululemon athletica inc.\nErin Hankinson\n1-604-732-6124\nor\nBrunswick Group\nEleanor French\n1-415-671-7676\nSource: lululemon athletica inc."
    },
    {
        "title": "lululemon athletica inc. Announces Third Quarter Fiscal 2019 Results",
        "subtitle": "",
        "date": "Dec 11, 2019 4:05PM EST",
        "content": "\nRevenue up 23% to $916 million\n\nComparable sales increase 16%, or 17% on a constant dollar basis\n\nDiluted EPS of $0.96 for the third quarter\n    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon athletica inc. (NASDAQ:LULU) today announced financial results for the third quarter of fiscal 2019.\n\nThe summary below provides both GAAP and adjusted non-GAAP financial measures. The adjusted financial measures exclude the tax expense recognized during the third quarter of fiscal 2018 related to the U.S. Tax Cuts and Jobs Act.\n\nFor the third quarter ended November 3, 2019:\n\nThe Company ended the third quarter of fiscal 2019 with $586.2 million in cash and cash equivalents compared to $703.6 million at the end of the third quarter of fiscal 2018. Inventories at the end of the third quarter of fiscal 2019 increased 26% to $627.1 million compared to $496.0 million at the end of the third quarter of fiscal 2018. The Company ended the quarter with 479 stores.\n\nCalvin McDonald, Chief Executive Officer, commented: \"We're proud of the continued momentum in our business as we live into our vision to be an experiential brand. We are successfully executing on our Power of Three growth plan as we create authentic connections with new and existing guests around the world. I'd like to thank our amazing teams for achieving this strong level of performance.\"\n\nUpdated Outlook\n\nFor the fourth quarter of fiscal 2019, we expect net revenue to be in the range of $1.315 billion to $1.330 billion based on a total comparable sales increase in the low double digits on a constant dollar basis. Diluted earnings per share are expected to be in the range of $2.10 to $2.13 for the quarter. This guidance assumes 131 million diluted weighted-average shares outstanding and a 28.5% tax rate. The guidance does not reflect potential future repurchases of the Company's shares.\n\nFor the full fiscal 2019, we now expect net revenue to be in the range of $3.895 billion to $3.910 billion based on a total comparable sales increase in the mid teens on a constant dollar basis. Diluted earnings per share are expected to be in the range of $4.75 to $4.78 for the full year, based on a 28% effective tax rate. The guidance assumes 131 million diluted weighted-average shares outstanding. The guidance does not reflect potential future repurchases of the Company's shares.\n\nThe guidance and outlook forward-looking statements made in this press release are based on management's expectations as of the date of this press release and the Company undertakes no duty to update or to continue to provide information with respect to any forward-looking statements or risk factors, whether as a result of new information or future events or circumstances or otherwise. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of risks and uncertainties, including those stated below.\n\nShifted Calendar for Comparable Sales\n\nDue to the 53rd week in fiscal 2018, comparable sales are calculated on a one week shifted basis in fiscal 2019. For the third quarter of fiscal 2019, the 13 weeks ended November 3, 2019 are compared to the 13 weeks ended November 4, 2018 rather than October 28, 2018.\n\nConference Call Information\n\nA conference call to discuss third quarter results is scheduled for today, December 11, 2019, at 4:30 p.m. Eastern time. Those interested in participating in the call are invited to dial 1-800-319-4610 or 1-604-638-5340, if calling internationally, approximately 10 minutes prior to the start of the call. A live webcast of the conference call will be available online at: http://investor.lululemon.com/events.cfm. A replay will be made available online approximately two hours following the live call for a period of 30 days.\n\nAbout lululemon athletica inc.\n\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\n\nNon-GAAP Financial Measures\n\nConstant dollar changes in net revenue, total comparable sales, comparable store sales, direct to consumer net revenue, and adjusted financial results are non-GAAP financial measures.\n\nA constant dollar basis assumes the average foreign exchange rates for the period remained constant with the average foreign exchange rates for the same period of the prior year. We provide constant dollar changes in net revenue, total comparable sales, comparable store sales, and direct to consumer net revenue because we use these measures to understand the underlying growth rate of net revenue excluding the impact of changes in foreign exchange rates. We believe that disclosing these measures on a constant dollar basis is useful to investors because it enables them to better understand the level of growth of our business.\n\nAdjusted income tax expense, effective tax rates, and diluted earnings per share exclude the amounts recognized in connection with the U.S. tax reform. We believe these adjusted financial measures are useful to investors as the adjustments do not directly relate to our ongoing business operations and therefore do not contribute to a meaningful evaluation of the trend in our operating performance. Furthermore, we do not believe the adjustments are reflective of our expectations of our future operating performance and believe these non-GAAP measures are useful to investors because of their comparability to our historical information.\n\nThe presentation of this financial information is not intended to be considered in isolation or as a substitute for, or with greater prominence to, the financial information prepared and presented in accordance with GAAP. For more information on these non-GAAP financial measures, please see the section captioned \"Reconciliation of Non-GAAP Financial Measures\" included in the accompanying financial tables, which includes more detail on the GAAP financial measure that is most directly comparable to each non-GAAP financial measure, and the related reconciliations between these financial measures.\n\nForward-Looking Statements:\n\nThis press release includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. In many cases, you can identify forward-looking statements by terms such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"outlook,\" \"believes,\" \"intends,\" \"estimates,\" \"predicts,\" \"potential\" or the negative of these terms or other comparable terminology. These forward-looking statements also include our guidance and outlook statements. These statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation: our ability to maintain the value and reputation of our brand; the acceptability of our products to our guests; our highly competitive market and increasing competition; our reliance on and limited control over third-party suppliers to provide fabrics for and to produce our products; suppliers or manufacturers not complying with our Vendor Code of Ethics or applicable laws; an economic downturn or economic uncertainty in our key markets; increasing product costs and decreasing selling prices; our ability to anticipate consumer preferences and successfully develop and introduce new, innovative and updated products; our ability to accurately forecast guest demand for our products; our ability to safeguard against security breaches with respect to our information technology systems; any material disruption of our information systems; our ability to have technology-based systems function effectively and grow our e-commerce business globally; changes in consumer shopping preferences and shifts in distribution channels; the fluctuating costs of raw materials; our ability to expand internationally in light of our limited operating experience and limited brand recognition in new international markets; our ability to deliver our products to the market and to meet guest expectations if we have problems with our distribution system; imitation by our competitors; our ability to protect our intellectual property rights; our ability to source and sell our merchandise profitably or at all if new trade restrictions are imposed or existing trade restrictions become more burdensome; changes in tax laws or unanticipated tax liabilities; our ability to manage our growth and the increased complexity of our business effectively; our ability to cancel store leases if an existing or new store is not profitable; increasing labor costs and other factors associated with the production of our products in South and South East Asia; the operations of many of our suppliers are subject to international and other risks; our ability to successfully open new store locations in a timely manner; our ability to comply with trade and other regulations; the service of our senior management; seasonality; fluctuations in foreign currency exchange rates; conflicting trademarks and the prevention of sale of certain products; our exposure to various types of litigation; actions of activist stockholders; anti-takeover provisions in our certificate of incorporation and bylaws; and other risks and uncertainties set out in filings made from time to time with the United States Securities and Exchange Commission and available at www.sec.gov, including, without limitation, our most recent reports on Form 10-K and Form 10-Q. You are urged to consider these factors carefully in evaluating the forward-looking statements contained herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by these cautionary statements. The forward-looking statements made herein speak only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances, except as may be required by law.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005902/en/\nInvestors:\nlululemon athletica inc.\nHoward Tubin\n1-604-732-6124\n\nor\n\nICR, Inc.\nJoseph Teklits/Caitlin Morahan\n1-203-682-8200\n\nMedia:\nlululemon athletica inc.\nErin Hankinson\n1-604-732-6124\n\nor\n\nBrunswick Group\nEleanor French\n1-415-671-7676\nSource: lululemon athletica inc."
    },
    {
        "title": "lululemon Announces Departure of Chief Operating Officer",
        "subtitle": "",
        "date": "Dec 9, 2019 4:05PM EST",
        "content": "    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon athletica inc. (NASDAQ:LULU) today announced that Stuart Haselden, Chief Operating Officer and EVP, International, will leave the company, effective January 10, 2020, in order to assume a leadership position outside of the apparel industry. Mr. Haselden joined lululemon in 2015 as Chief Financial Officer and was one of three leaders who guided the company during its CEO search last year.\n\n“We’re grateful for Stuart’s leadership and commitment to lululemon, and we appreciate the role he played to build our infrastructure and support our international growth. He’s helped us develop senior leaders across the organization who are ready and able to take on additional responsibilities. We wish Stuart well as he begins his next chapter,” said Calvin McDonald, Chief Executive Officer of lululemon.\n\nThe company announced that Chief Technology Officer, Julie Averill and Chief Supply Chain Officer, Ted Dagnese will join the company’s Senior Leadership Team, reporting to Mr. McDonald effective immediately.\n\nIn support of its long-term growth strategy to quadruple its international business by 2023, the company has begun an external search for the position of EVP, International. While the search is underway, the company’s established leaders in APAC and EMEA will report to Mr. McDonald and Celeste Burgoyne, EVP of Americas and Global Guest Innovation, respectively.\n\nMr. McDonald added, “We’re excited about the momentum in our business as we deliver on our goals and focus on our growth strategies. We look forward to providing details about our third quarter performance during our upcoming earnings call.”\n\nThe company reports third quarter earnings results on Wednesday, December 11, and will hold a conference call with investors at 4:30 p.m. ET.\n\nAbout lululemon athletica inc.\n\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\n\nForward-Looking Statements:\n\nThis press release includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. In many cases, you can identify forward-looking statements by terms such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"outlook,\" \"believes,\" \"intends,\" \"estimates,\" \"predicts,\" \"potential\" or the negative of these terms or other comparable terminology. These forward-looking statements also include our guidance and outlook statements. These statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation: our ability to maintain the value and reputation of our brand; the acceptability of our products to our guests; our highly competitive market and increasing competition; our reliance on and limited control over third-party suppliers to provide fabrics for and to produce our products; suppliers or manufacturers not complying with our Vendor Code of Ethics or applicable laws; an economic downturn or economic uncertainty in our key markets; increasing product costs and decreasing selling prices; our ability to anticipate consumer preferences and successfully develop and introduce new, innovative and updated products; our ability to accurately forecast guest demand for our products; our ability to safeguard against security breaches with respect to our information technology systems; any material disruption of our information systems; our ability to have technology-based systems function effectively and grow our e-commerce business globally; changes in consumer shopping preferences and shifts in distribution channels; the fluctuating costs of raw materials; our ability to expand internationally in light of our limited operating experience and limited brand recognition in new international markets; our ability to deliver our products to the market and to meet guest expectations if we have problems with our distribution system; imitation by our competitors; our ability to protect our intellectual property rights; our ability to source and sell our merchandise profitably or at all if new trade restrictions are imposed or existing trade restrictions become more burdensome; changes in tax laws or unanticipated tax liabilities; our ability to manage our growth and the increased complexity of our business effectively; our ability to cancel store leases if an existing or new store is not profitable; increasing labor costs and other factors associated with the production of our products in South and South East Asia; the operations of many of our suppliers are subject to international and other risks; our ability to successfully open new store locations in a timely manner; our ability to comply with trade and other regulations; the service of our senior management; seasonality; fluctuations in foreign currency exchange rates; conflicting trademarks and the prevention of sale of certain products; our exposure to various types of litigation; actions of activist stockholders; anti-takeover provisions in our certificate of incorporation and bylaws; and other risks and uncertainties set out in filings made from time to time with the United States Securities and Exchange Commission and available at www.sec.gov, including, without limitation, our most recent reports on Form 10-K and Form 10-Q. You are urged to consider these factors carefully in evaluating the forward-looking statements contained herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by these cautionary statements. The forward-looking statements made herein speak only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005746/en/\nInvestors:\nlululemon athletica inc.\nHoward Tubin\n(604) 732-6124\nor\nICR, Inc.\nJoseph Teklits/Caitlin Morahan\n(203) 682-8200\n\nMedia:\nlululemon athletica inc.\nErin Hankinson\n(604) 732-6124\nor\nBrunswick Group\nEleanor French\n(415) 671-7676\nSource: lululemon athletica inc."
    },
    {
        "title": "lululemon athletica inc. Announces Third Quarter Fiscal 2019 Earnings Conference Call",
        "subtitle": "",
        "date": "Nov 27, 2019 6:30AM EST",
        "content": "    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon athletica inc. (NASDAQ:LULU) today announced that its financial results for the third quarter fiscal 2019 will be released Wednesday, December 11, 2019. The company will host a conference call at 4:30 p.m. Eastern time to discuss the financial results.\n\nIf you would like to participate in the call, please dial (800) 319-4610 or (604) 638-5340, if calling internationally, approximately 10 minutes prior to the start of the call.\n\nA live webcast of the conference call will be available online at: http://investor.lululemon.com/events.cfm. A replay will be made available online approximately 2 hours following the live call for a period of 30 days.\n\nAbout lululemon athletica inc.\n\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191127005103/en/\nInvestors:\nlululemon athletica inc.\nHoward Tubin\n(604) 732-6124\nor\nICR, Inc.\nJoseph Teklits/Caitlin Morahan\n(203) 682-8200\n\nMedia:\nlululemon athletica inc.\nErin Hankinson\n(604) 732-6124\nor\nBrunswick Group\nEleanor French\n(415) 671-7676\nSource: lululemon athletica inc."
    },
    {
        "title": "MIRROR Announces Expansion Of Retail Fleet",
        "subtitle": "Fast-growing technology start-up, MIRROR, triples retail fleet, adding locations in Los Angeles and Stanford, California",
        "date": "Nov 19, 2019 12:00PM EST",
        "content": "NEW YORK, Nov. 19, 2019 /PRNewswire/ -- MIRROR, the first nearly invisible, interactive home gym revolutionizing the in-home fitness experience, announced today an expansion of its retail store fleet. Mirror will be adding locations at Westfield Century City in Los Angeles and Stanford Shopping Center in Stanford, California to its existing location in the Flatiron District in New York City.MIRROR has partnered with the renowned creative studio, Mythology, to design a next-generation store concept that allows guests to immersively experience MIRROR.  Prospective members may trial a complementary live or on-demand class in-store or, for a limited time, enjoy a complimentary Personal Training session, the latest feature to launch on MIRROR's revolutionary platform.  The retail store format has proven incredibly helpful to prospective members as they contemplate joining the MIRROR community. The in-store experience offers visitors the opportunity to try out the Mirror, and fifty percent of people who come in opt to experience a demo.Brynn Putnam, Founder and CEO of MIRROR, says, \"We are excited about the expansion of the MIRROR retail fleet--our new store concept offers prospective members a highly immersive experience, combining the opportunity to privately trial MIRROR's vast array of fitness content with an innovative retail environment in which to consider a purchase. For the first time ever, prospective members can walk into a retail environment and take a live, one-on-one, personal training session with a fitness professional 10,000 miles away.\"In addition to the expansion of the retail fleet and the launch of Personal Training, MIRROR recently secured $34 million in Series B-1 financing led by Point72 Ventures.  Other participants in the round include lululemon (NASDAQ:LULU); supermodel, entrepreneur and philanthropist Karlie Kloss; Kevin Huvane, founder of Creative Artists Agency; Steve Lockshin, accomplished angel investor; seasoned media investors, LionTree LLC; as well as return investors, Spark Capital, and Lerer Hippeau. This brings MIRROR's funding to date to $72 million. Along with this investment, Point72 chairman and chief executive officer Steven Cohen will join MIRROR's board of directors.About MIRRORMIRROR is the world's first nearly invisible, interactive home gym featuring live and on-demand fitness classes in a variety of workout genres. MIRROR is creating a new category of in-home fitness with cutting-edge hardware, responsive software, and best-in-class content that transforms any room into a complete home gym. For the first time, the essential components of a great studio workout – variety, personalization, and community – are brought to the most convenient place: the home. MIRROR launched in September 2018 and demand quickly soared.  Shortly after launch, there were Mirrors in homes in every state. MIRROR was founded by Harvard grad Brynn Putnam, creator of Refine Method, named \"New York's Smartest Workout.\" MIRROR is headquartered in New York City. https://mirror.co  View original content:http://www.prnewswire.com/news-releases/mirror-announces-expansion-of-retail-fleet-300960930.htmlSOURCE  MIRROR"
    },
    {
        "title": "lululemon and the United Nations Foundation Launch New Program to Address Mental and Physical Health of UN Humanitarian Aid Workers",
        "subtitle": "",
        "date": "Oct 8, 2019 8:59AM EDT",
        "content": "\nWith funding commitment from lululemon, Peace on Purpose aims to train and equip more than 3,000 aid workers and reach 30,000 UN staff over the next three years with mindfulness and self-care tools\n    VANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon and the United Nations Foundation today announced their partnership around an innovative program to address the mental and physical health of UN development and humanitarian workers who serve on the front lines of urgent global challenges, so they can better support communities around the world. lululemon will commit $1 million USD over the next three years to Peace on Purpose, an evidence-based program, which provides access to mindfulness and self-care tools and resources for UN workers to build resilience in the face of adversity and stressful environments – such as responding to humanitarian emergencies, supporting communities facing poverty, and more. Peace on Purpose's mission is to equip aid workers with the tools to care for themselves so they can effectively care for others.\n\n“lululemon and the UN Foundation share a commitment to building community and developing collaborative solutions for some of the world’s most pressing issues,” said Calvin McDonald, CEO of lululemon. “With increasing need for international humanitarian aid and peacekeeping, we want to cultivate the long-lasting benefits of mindfulness tools and sustain support for those whose mission is to serve others.”\n\n“UN workers are on the front lines of global challenges, helping people in their times of greatest need,” said Kathy Calvin, President and CEO of the UN Foundation. “This work can often be stressful, and the UN has made it a priority to address the well-being of its people. Innovative partnerships like Peace on Purpose can support the UN workers who support the world. With lululemon’s support, we will be able to grow the program to help more UN staff care for themselves and for others.”\n\nPeace on Purpose is a result of a three-year pilot led by lululemon’s Here to Be team and the UN Foundation, developed to address a series of issues, such as burnout, compassion fatigue, and stress-related physical, mental, and relational effects reported by UN staff members. Peace on Purpose has worked with UN agencies to build out trainings and workshops for more than 650 staff in US headquarters and seven additional countries – Jordan, Lebanon, Pakistan, South Sudan, Turkey, Turkmenistan and Zimbabwe.\n\nResearch that followed select trainings found that over half of the participants experienced a more than 40 percent improvement in overall well-being as seen in key psychological risk factors, such as work-related self-compassion, anxiety and depression, symptoms related to trauma, and feelings of distress.\n\nHumanitarian aid workers report experiencing high rates of burnout, stress, and mental health stigmas in difficult global settings. Peace on Purpose’s curriculum introduces mindfulness tools as well-being resources to support current UN mental health programs. These tools – such as mindful breaths, emotion regulation, and yoga – can be implemented to meet the varying needs of UN staff in the diverse environments in which they operate.\n\nWith lululemon’s continued funding commitment and thought partnership, Peace on Purpose will aim to train 3,000 more UN development and humanitarian workers in-person over the next three years, build a hub of digital resources, and develop condensed trainings and curriculum translations to reach an additional 30,000 UN staff.\n\nPeace on Purpose is a key element of lululemon’s commitment to social impact and sustainability. The company’s Impact Agenda is comprised of three elements – Be Human, Be Well and Be Planet – to support and accelerate meaningful positive impact around the world.\n\nTo learn more about Peace on Purpose or lululemon’s Global Impact Agenda, including Here to Be, visit https://shop.lululemon.com/story/sustainability.\n\nAbout lululemon athletica inc.\nlululemon athletica inc. (NASDAQ:LULU) is a healthy lifestyle inspired athletic apparel company for yoga, running, training, and most other sweaty pursuits, creating transformational products and experiences which enable people to live a life they love. Setting the bar in technical fabrics and functional designs, lululemon works with yogis and athletes in local communities for continuous research and product feedback. For more information, visit www.lululemon.com.\n\nAbout the United Nations Foundation\nThe United Nations Foundation acts as a strategic partner to help the United Nations mobilize the ideas, people, and resources it needs to drive global progress and tackle urgent challenges. We focus on issues at the heart of the Sustainable Development Goals, build initiatives across sectors to solve problems at scale, and engage citizens who seek action. Founded in 1998 by entrepreneur and philanthropist Ted Turner, the UN Foundation works with philanthropic, corporate, government, and individual partners. Learn more at www.unfoundation.org.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191008005308/en/\nMedia:\nlululemon\nTatiana Jovic\nDirector, Global PR\nmedia@lululemon.com\n\nSunshine Sachs PR\nlululemon@sunshinesachs.com\nSource: lululemon athletica inc."
    },
    {
        "title": "Thinking about trading options or stock in Docusign, Home Depot, Intel, Lululemon Athletica, or Visa?",
        "subtitle": "",
        "date": "Sep 9, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 9, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for DOCU, HD, INTC, LULU, and V.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-docusign-home-depot-intel-lululemon-athletica-or-visa-300914016.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Salesforce, Chevron, Home Depot, Lululemon Athletica, or NVIDIA?",
        "subtitle": "",
        "date": "Aug 8, 2019 9:31AM EDT",
        "content": "NEW YORK, Aug. 8, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CRM, CVX, HD, LULU, and NVDA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-salesforce-chevron-home-depot-lululemon-athletica-or-nvidia-300898778.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Amazon, Facebook, Lululemon Athletica, or Micron Technology?",
        "subtitle": "",
        "date": "Jul 15, 2019 9:31AM EDT",
        "content": "NEW YORK, July 15, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, AMZN, FB, LULU, and MU.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-amazon-facebook-lululemon-athletica-or-micron-technology-300884668.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Beyond Meat, Dryships, Lululemon Athletica, or Provention Bio?",
        "subtitle": "",
        "date": "Jun 13, 2019 9:31AM EDT",
        "content": "NEW YORK, June 13, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, BYND, DRYS, LULU, and PRVB.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-beyond-meat-dryships-lululemon-athletica-or-provention-bio-300867114.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "FinancialBuzz.com: 'Market Recap' Week Ending March 29th, 2019",
        "subtitle": "",
        "date": "Mar 29, 2019 9:00AM EDT",
        "content": "NEW YORK, March 29, 2019 /PRNewswire/ -- U.S. markets had mixed reactions to start the week on Monday as global economic growth lingered. Markets began strongly on Monday, led by Apple as it announced its new credit card and streaming service, which sent other streaming provider stocks soaring. On Tuesday, stocks opened higher as U.S.-China trade talks resumed again. U.S. trade representative Robert Lighthizer and Treasury Secretary Steven Mnuchin were in China throughout the week to discuss negotiations. Despite the strong pre-market movement, markets quickly retracted as investors were concerns over the falling Treasury yield. The 10-year Treasury yield was at 2.418%, holding near its lowest since 2017. Worries of falling yields and inversion of the yield curve continued into Wednesday as the Dow Jones plunged by as much as 300 points or by 1.1%. Data showed that the Treasury 10-year yield has fallen below that of the three-month bill, which is viewed as an indicator of recessions happening in the next 12 months to 24 months. Markets opened stronger on Thursday after data showed that fourth-quarter gross domestic product in the U.S. grew by 2.9% year-over-year and reports that the U.S. and China have made progress on their negotiations. Beijing officials have made proposals to resolve the tariff dispute between the two countries. The proposal is aiming to end charges that China steals from U.S. intellectual property, according to Reuters, citing U.S. officials. Apple Inc. (NASDAQ:AAPL), Cronos Group Inc. (NASDAQ:CRON), Carnival Corporation (NYSE:CCL), WellCare Health Plans, Inc. (NYSE:WCG), Lululemon Athletica Inc. (NASDAQ:LULU)Although the market had mixed reactions throughout the week, the Dow Jones still posted a 166 points gain or 0.6% leading into Thursday's opening bell. The S&P 500 rose by 10.98 points or 0.3% in the same session, while the Nasdaq Composite climbed by 24.43 points or 0.3%. Despite the optimistic news early on Thursday, markets began to pull back throughout early morning trading sessions. Analysts said that while the growth data and China talks were uplifting for the market, investors may see otherwise and argue that the news has already been priced into the market. \"Trade has stolen the headlines from concerns over the yield curve to drive the market today,\" Ryan Nauman, Market Strategist with Informa Financial Intelligence told MarketWatch. While reports of fresh progress have helped boost stocks Thursday, Nauman said, \"I do believe that a trade deal is mostly baked into the prices, which is a bit scary because the longer this drags on without a concrete deal, it will create growing angst.\"For our latest \"Buzz on the Street\" Show featuring \"Retail Report\" please visit: https://www.youtube.com/watch?v=tKFY09EjAUwApple Inc. (NASDAQ:AAPL) announced a series of new products and service offerings on Monday at its Keynote event held on its Cupertino campus in California. Apple shares gained 1.5% leading into its event. Notably, Apple announced its new Apple Card, Apple News+, and Apple TV+. Apple Card is a credit card that is built into the Apple Pay app on users' iPhones, allowing them to digitally send transactions without fees and less interest on top of stronger security. Apple News+ and AppleTV+ are both subscription-based services that offer customers a variety of content. AppleNews+ includes publications such as The Wall Street Journal, Bon Appétit, GQ, National Geographic, Sports Illustrated, and Time. AppleTV+ allows viewers to watch media content from HBO, SHOWTIME, and Starz.For our latest \"Buzz on the Street\" Show featuring \"Retail Report\" please visit: https://www.youtube.com/watch?v=tKFY09EjAUwCronos Group Inc. (NASDAQ:CRON) reported its fourth quarter financial results before market open on Tuesday and reported weaker than expected results. Shares edged lower by as much as 7.4% leading into Wednesday's opening bell after the cannabis-based Company reported that losses widened year-over-year. For the fourth quarter, Cronos reported an earnings loss of CAD 11.8 Million, or CAD 6 cents per share on revenues of CAD 5.6 Million. Analysts expected earnings loss of CAD 1 cents on revenues of CAD 10.4 Million. Despite the increase in net losses, Cronos reported that net revenues grew by 284% year-over-year primarily due to the legal cannabis market in Canada. Additionally, Cronos saw an increase in growth within its medical client base and growth in its cannabis oil revenues.For our latest \"Buzz on the Street\" Show featuring \"Retail Report\" please visit: https://www.youtube.com/watch?v=tKFY09EjAUwCarnival Corporation(NYSE:CCL) reported its first quarter financial results during Tuesday's pre-market hours and beat estimates. Despite the quarterly beat, Carnival provided a weaker guidance, which sent shares lower by 9.2% throughout the day. For the first quarter, Carnival reported earnings of USD 49 cents per share on revenues of USD 4.67 Billion. Analysts projected earnings of USD 44 cents on revenues of USD 4.31 Billion. As for the next quarter, Carnival expects earnings between USD 56 cents to USD 60 cents per share, representing a USD 8 cents decline year-over-year. For the full year, Carnival expects earnings in the range of USD 4.35 to USD 4.55 per share. Analysts are projecting second-quarter earnings of USD 72 per share and full-year earnings of USD 4.76 per share.For our latest \"Buzz on the Street\" Show featuring \"Retail Report\" please visit: https://www.youtube.com/watch?v=tKFY09EjAUwWellCare Health Plans, Inc.(NYSE:WCG) shares skyrocketed by 12.8% on Wednesday after the Company reached an agreement to be acquired by Centene Corporation (NYSE:CNC). Centene will acquire Wellcare in a cash-and-stock transaction valued at approximately USD 17.3 Billion or USD 305.39 per share. The combined company will serve a total of 22 million members across the U.S. The acquisition is expected to have estimated pro forma 2019 revenues of approximately USD 97 Billion and USD 5 Billion in EBITDA. Centene and WellCare expect the transaction to close in the first half of 2020.For our latest \"Buzz on the Street\" Show featuring \"Retail Report\" please visit: https://www.youtube.com/watch?v=tKFY09EjAUwLululemon Athletica Inc.(NASDAQ:LULU) announced its fourth quarter financial results during extended trading hours on Thursday and surpassed estimates, sending shares 15.6% higher on Friday morning. For the fourth quarter, Lululemon reported earnings of USD 1.85 per share on revenues of USD 1.17 Billion. Analysts projected earnings of USD 1.74 per share on revenues of USD 1.15 Billion. Comparable sales rose by 16%, which fell in-line with estimates. For fiscal 2019, Lululemon expects revenues in the range of USD 740 Million to USD 750 Million, increasing in low-double digits year-over-year. The Company also expects diluted earnings of USD 0.68 to USD 0.70 per share.Subscribe Now! Watch us report LIVE https://www.youtube.com/FinancialBuzzMediaFollow us on Twitter for real time Financial News Updates: https://twitter.com/financialbuzzFollow and talk to us on Instagram: https://www.instagram.com/financialbuzzFacebook Like Us to receive live feeds: https://www.facebook.com/Financialbuzz/About FinancialBuzz.comFinancialBuzz.com, a leading financial news informational web portal designed to provide the latest trends in Market News, Investing News, Personal Finance, Politics, Entertainment, in-depth broadcasts on Stock News, Market Analysis and Company Interviews. A pioneer in the financially driven digital space, video production and integration of social media, FinancialBuzz.com creates 100% unique original content. FinancialBuzz.com also provides financial news PR dissemination, branding, marketing and advertising for third parties for corporate news and original content through our unique media platform that includes Newswire Delivery, Digital Advertising, Social Media Relations, Video Production, Broadcasting, and Financial Publications.Please Note: FinancialBuzz.com is not a financial advisory or advisor, investment advisor or broker-dealer and do not undertake any activities that would require such registration. The information provided on http://www.FinancialBuzz.com (the \"site\") is either original financial news or paid advertisements provided [exclusively] by our affiliates (sponsored content), FinancialBuzz.com, a financial news media and marketing firm enters into media buys or service agreements with the companies which are the subject to the articles posted on the Site or other editorials for advertising such companies. FinancialBuzz.com has not been compensated directly by any of the companies mentioned here in this editorial. We are not an independent news media provider and therefore do not represent or warrant that the information posted on the Site is accurate, unbiased or complete. FinancialBuzz.com receives fees for producing and presenting high quality and sophisticated content on FinancialBuzz.com along with other financial news PR media services. FinancialBuzz.com does not offer any personal opinions or bias commentary as we purely incorporate public market information along with financial and corporate news. FinancialBuzz.com only aggregates or regurgitates financial or corporate news through our unique financial newswire and media platform. For this release, FinancialBuzz.com has not been compensated for financial news dissemination and PR services by any parties. Our fees may be either a flat cash sum or negotiated number of securities of the companies featured on this editorial or site, or a combination thereof. The securities are commonly paid in segments, of which a portion is received upon engagement and the balance is paid on or near the conclusion of the engagement. FinancialBuzz.com will always disclose any compensation in securities or cash payments for financial news PR advertising. FinancialBuzz.com does not undertake to update any of the information on the editorial or Site or continue to post information about any companies the information contained herein is not intended to be used as the basis for investment decisions and should not be considered as investment advice or a recommendation. The information contained herein is not an offer or solicitation to buy, hold or sell any security. FinancialBuzz.com, members and affiliates are not responsible for any gains or losses that result from the opinions expressed on this editorial or Site, company profiles, quotations or in other materials or presentations that it publishes electronically or in print. Investors accept full responsibility for any and all of their investment decisions based on their own independent research and evaluation of their own investment goals, risk tolerance, and financial condition. FinancialBuzz.com. By accessing this editorial and website and any pages thereof, you agree to be bound by the Terms of Use and Privacy Policy, as may be amended from time to time. None of the content issued by FinancialBuzz.com constitutes a recommendation for any investor to purchase, hold or sell any particular security, pursue a particular investment strategy or that any security is suitable for any investor. This publication is provided by FinancialBuzz.com. Each investor is solely responsible for determining whether a particular security or investment strategy is suitable based on their objectives, other securities holdings, financial situation needs, and tax status. You agree to consult with your investment advisor, tax and legal consultant before making any investment decisions. We make no representations as to the completeness, accuracy or timeless of the material provided. All materials are subject to change without notice. Information is obtained from sources believed to be reliable, but its accuracy and completeness are not guaranteed. For our full disclaimer, disclosure and Terms of Use, please visit: http://www.FinancialBuzz.com.For further information:Media Contact:info@financialbuzz.com+1-877-601-1879Url: http://www.FinancialBuzz.com View original content:http://www.prnewswire.com/news-releases/financialbuzzcom-market-recap-week-ending-march-29th-2019-300820888.htmlSOURCE FinancialBuzz.com"
    }
]