[
    {
        "title": "Tribute Portfolio Continues To Grow Its Global Family Of Characterful Hotels With First Outpost In Frankfurt, Germany",
        "subtitle": "",
        "date": "Mar 2, 2020 9:03AM EST",
        "content": "BETHESDA, Md., March 2, 2020 /PRNewswire/ -- Tribute Portfolio, Marriott International's newest collection of characterful independent hotels, continues to expand its European footprint with the opening of Gekko House, the brand's second hotel in Germany and first in Frankfurt. The 128-room urban-designed hotel is situated in the heart of Frankfurt's up-and-coming Gallus district known for its converted warehouses and factories, which is now home to eclectic music venues and theatres. Frankfurt-based Morgen Interiors led the design, creating a captivating urban aesthetic reflective of Frankfurt's open-minded culture whilst inviting spontaneity and fun, inspired by the hotel's motto, 'life is crazy.' \"We're thrilled to welcome this vibrant new hotel within Tribute Portfolio's growing global family of independent hotels that are drawn together by their passion for captivating design and their drive to create vibrant social scenes for travelers. Gekko House is set to be a hot spot for both guests and locals alike with its characterful and cosmopolitan design, sincere service, and lively ambiance at their Chicago Williams restaurant and bar, said John Licence, VP Premium and Select Brands Europe, Marriott International. Guest rooms at Gekko House juxtapose exposed concrete walls with wooden flooring, hand-blown statement glass lighting fixtures, olive green furniture and lavish velvet seating. Each room offers floor-to-ceiling windows with stunning skyline views across Germany's only skyscraper city. In addition, they boast a Marshall Music Box, Nespresso coffee machine, amenities by Australian organic skincare brand Grown Alchemist and a Gekko House curated city guide. On the ground floor, guests are led to the hotel entrance via an intimate passage, where cherry wood panelling meets deep olive furnishings and eye-catching tapestries. In the lobby, guests can shop at The Gekko Späti, where the team have hand-picked a selection of artisanal drinks and snacks, as well as local souvenirs and gadgets.At the heart of Gekko House is the restaurant and bar, Chicago Williams, a Berlin-born BBQ concept established in 2012 by Nawid Samawat. A spacious lounge bar leads to the restaurant with an open kitchen serving up German beer and cured meat specialties like baby back ribs and beef brisket alongside soulful dishes like macaroni and cheese. Designed in deep red tones, the interior features a wooden floor with oak tables and copper detailing. For a more intimate experience, diners can be seated next to the black-tiled smoker room where they can watch the chefs work their creative magic in the kitchen. This Summer, Gekko House will open Chicago Beach Rooftop on the eighth floor – a lounge bar with unbeatable views of the city's skyline.\"The arrival of Gekko House as part of Tribute Portfolio is unlike anything on the German hotel market at present. Gekko House provides a more casual concept without compromising on design, style and comfort. Gekko House is a place where business travellers and tourists alike can come to unwind, let loose and enjoy life,\" said Micky Rosen and Alex Urseanu. For more information about Gekko House, please visit www.tributeportfolio.com. About Tribute PortfolioTribute Portfolio is a growing global family of characterful, independent hotels drawn together by their passion for captivating design and their drive to create vibrant social scenes for guests and locals alike. With 38 hotels open and growing, Tribute Portfolio has struck a chord with those who seek out independent experiences and crave a connection with the community when traveling. From boutique resorts like Inn at Rancho Santa Fe in California and urban hotels such as The Vagabond Club in Singapore, to hotels in indie-spirited locales like Noelle in Nashville and The Slaak in Rotterdam, each Tribute Portfolio hotel celebrates its individuality offering travellers a fresh, often colourful, perspective. Stay with character and stay connected: Instagram, Facebook and twitter. Tribute Portfolio is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.comAbout The Gekko Group Headquartered in Frankfurt, The Gekko Group was founded in 2001 by Micky Rosen and Alex Urseanu. With its pioneering concepts, the constantly expanding company has made a name for itself internationally and has developed into one of the most innovative brands in the hotel and restaurant industry. The recipe: a boundless love of life and an uncompromising passion to share it. The Gekko Group portfolio boasts hotels, restaurants and event spaces all different in terms of concept and design - but equally all places where the highest gastronomic demands are met, where the lightness of being is lived and the right people meet. Friendships for life, encounters of a special kind.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram. View original content to download multimedia:http://www.prnewswire.com/news-releases/tribute-portfolio-continues-to-grow-its-global-family-of-characterful-hotels-with-first-outpost-in-frankfurt-germany-301013854.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Reports Fourth Quarter 2019 Results",
        "subtitle": "",
        "date": "Feb 26, 2020 4:30PM EST",
        "content": "BETHESDA, Md., Feb. 26, 2020 /PRNewswire/ -- HIGHLIGHTSMarriott International, Inc. (NASDAQ: MAR) today reported solid fourth quarter 2019 results.Arne M. Sorenson, president and chief executive officer of Marriott International, said, \"We are pleased with our performance in 2019.  We grew rooms nearly 5 percent, achieved record RevPAR index gains, drove higher guest satisfaction scores, and maintained global hotel profit margins in a low RevPAR growth environment.  Our fee-driven, asset light business model and successful asset recycling continued to generate significant excess cash, allowing us to return a total of $2.9 billion to shareholders during the year. \"Marriott Bonvoy is driving market share at our hotels by leveraging our industry-leading distribution and powerful brand portfolio.  Loyalty members accounted for 52 percent of occupied rooms in 2019, a 250-basis point increase year over year.  Our worldwide systemwide RevPAR index for comparable hotels increased 200 basis points in 2019 and rose 240 basis points in the fourth quarter alone.  We are increasing our market share of rooms as well, with record signings in 2019 taking our development pipeline to approximately 515,000 rooms at year-end.  \"Our thoughts are with everyone impacted by the Coronavirus situation. I am particularly proud of our Asia Pacific team as they assist affected customers and fellow associates.  To date, the crisis has primarily affected our Asia Pacific region. \"Given the fluid nature of the situation, we have not reflected the impact from the outbreak in our base case outlook for this year.  For full year 2020, our base case outlook assumes comparable systemwide RevPAR on a constant dollar basis will be flat to up 2 percent, with RevPAR growth in North America around the middle of that range.  We assume net rooms additions of 5 to 5.25 percent in 2020.  \"Given those assumptions, our base case assumes gross fee revenues in 2020 could total $4 billion, a 5 percent increase compared to 2019.  However, assuming the current low occupancy rates in the Asia Pacific region continue, with no meaningful impact outside the region, we estimate the company could earn roughly $25 million in lower fee revenue per month, compared to our 2020 base case outlook.\"Fourth Quarter 2019 ResultsMarriott's reported operating income totaled $274 million in the 2019 fourth quarter, compared to 2018 fourth quarter reported operating income of $422 million.  Reported net income totaled $279 million in the 2019 fourth quarter, compared to 2018 fourth quarter reported net income of $317 million.  Reported diluted earnings per share (EPS) totaled $0.85 in the quarter, compared to reported diluted EPS of $0.92 in the year-ago quarter.Adjusted operating income in the 2019 fourth quarter totaled $603 million, compared to 2018 fourth quarter adjusted operating income of $680 million.  Adjusted operating income in the 2019 fourth quarter includes impairment charges of $114 million in depreciation, amortization, and other expenses.  Fourth quarter 2019 adjusted net income totaled $517 million, compared to 2018 fourth quarter adjusted net income of $497 million.  Adjusted diluted EPS in the fourth quarter totaled $1.57, compared to adjusted diluted EPS of $1.44 in the year-ago quarter.  Results for the 2019 fourth quarter include the benefit of $134 million pretax ($0.32 per share) of asset sale gains in gains and other income, net, partially offset by $114 million pretax ($0.26 per share) of impairment charges in depreciation, amortization, and other expenses.  Results for the 2018 fourth quarter include a $6 million pretax ($0.02 per share) asset sale gain in gains and other income, net.  Adjusted results exclude merger-related costs and charges, cost reimbursement revenue, and reimbursed expenses.  See page A-3 for the 2019 adjusted diluted EPS calculation.Base management and franchise fees totaled $799 million in the 2019 fourth quarter, an 8 percent increase over base management and franchise fees of $743 million in the year-ago quarter.  The year-over-year increase in these fees is primarily attributable to rooms growth, RevPAR growth, and higher credit card branding fees.Fourth quarter 2019 incentive management fees totaled $175 million, a 5 percent increase compared to incentive management fees of $167 million in the year-ago quarter.  The year-over-year increase largely reflects new units and higher net house profits at managed hotels in North America and Europe, partially offset by lower net house profits in Hong Kong.Depreciation, amortization, and other expenses for the 2019 fourth quarter totaled $179 million, compared to $62 million in the year-ago quarter.  The year-over-year change largely reflects a $99 million impairment charge associated with a leased hotel in North America and a $15 million impairment charge related to the sale of a hotel in North America.General, administrative, and other expenses for the 2019 fourth quarter totaled $267 million, compared to $242 million in the year-ago quarter.  The year-over-year change largely reflects an increase in development and legal costs, higher bad debt expense, and unfavorable foreign exchange.  In the 2019 fourth quarter, the company incurred $14 million of expenses and recognized $7 million of insurance recoveries related to the data security incident it disclosed on November 30, 2018.  The expenses and insurance recoveries are reflected in either the reimbursed expenses or merger-related costs and charges lines of the Income Statement, both of which have been excluded from adjusted net income, adjusted EPS and adjusted EBITDA.  Based on the ongoing proceeding involving the U.K. Information Commissioner's Office (ICO), in the fourth quarter the company also reduced to $65 million the non-tax deductible accrual recorded in the second quarter of 2019 for the fine proposed by ICO in July 2019 in relation to the data security incident.  The reduction of the accrual is reflected in the merger-related costs and charges line of the Income Statement, which has been excluded from adjusted net income, adjusted EPS and adjusted EBITDA.  Gains and other income, net, totaled $138 million, compared to $3 million in the year-ago quarter.  Gains and other income, net, in the 2019 fourth quarter primarily reflects $134 million of gains associated with the sales of two hotels in North America.Fourth Quarter 2019 Results Compared to November 5, 2019 GuidanceOn November 5, 2019, the company estimated gross fee revenues would total $960 million to $970 million in the fourth quarter.  Actual gross fee revenues totaled $974 million in the quarter, largely reflecting higher than expected incentive management fees in North America. The company estimated owned, leased, and other revenue, net of direct expenses, for the fourth quarter would total approximately $85 million.  Actual results of $92 million in the quarter were higher than estimated, largely due to higher termination fees.The company estimated depreciation, amortization, and other expenses for the fourth quarter would total approximately $55 million.  Actual expenses of $179 million in the quarter were higher than estimated, largely due to asset impairments of $114 million and contract write-offs related to terminated hotels.The company estimated general, administrative, and other expenses for the fourth quarter would total $250 million to $255 million.  Actual expenses of $267 million in the quarter were higher than estimated, largely due to legal costs, bad debt expenses, and foreign exchange.Selected Performance InformationThe company added 173 new properties (25,399 rooms) to its worldwide lodging portfolio during the 2019 fourth quarter, including W Ibiza in Spain, JW Marriott Maldives, and North Island, a Luxury Collection Resort, Seychelles.  Twenty-nine properties (6,400 rooms) exited the system during the quarter.  At year-end, Marriott's global lodging system totaled more than 7,300 properties and timeshare resorts, with roughly 1,380,000 rooms.At year-end, the company's worldwide development pipeline totaled 3,039 properties with approximately 515,000 rooms, including 1,207 properties with over 220,000 rooms under construction and 133 properties with roughly 23,000 rooms approved for development, but not yet subject to signed contracts.In the 2019 fourth quarter, worldwide comparable systemwide constant dollar RevPAR increased 1.1 percent (a 0.8 percent increase using actual dollars).  North American comparable systemwide constant dollar RevPAR increased 0.9 percent (a 0.9 percent increase using actual dollars), and international comparable systemwide constant dollar RevPAR increased 1.5 percent (a 0.6 percent increase using actual dollars) for the same period.Worldwide comparable company-operated house profit margins increased 20 basis points in the fourth quarter, reflecting the impact of solid cost controls and synergies from the Starwood acquisition, partially offset by modest RevPAR growth and higher wages.  House profit margins for international comparable company-operated properties increased 30 basis points and North American comparable company-operated house profit margins increased 10 basis points in the fourth quarter.For full year 2019, worldwide comparable systemwide constant dollar RevPAR increased 1.3 percent (a 0.4 percent increase using actual dollars).  North American comparable systemwide constant dollar RevPAR increased 1.0 percent (a 0.9 percent increase using actual dollars), and international comparable systemwide constant dollar RevPAR increased 2.2 percent (a 1.0 percent decrease using actual dollars) for the same period.Worldwide comparable company-operated house profit margins were flat for full year 2019, largely due to solid cost controls and synergies from the Starwood acquisition, offset by modest RevPAR growth and higher wages.  House profit margins for comparable company-operated properties outside North America rose 20 basis points and North American comparable company-operated house profit margins decreased 20 basis points year over year.Balance SheetAt year-end, Marriott's total debt was $10.94 billion and cash balances totaled $225 million, compared to $9.347 billion in debt and $316 million of cash at year-end 2018.Marriott Common StockWeighted average fully diluted shares outstanding used to calculate both reported and adjusted diluted EPS totaled 330.4 million in the 2019 fourth quarter, compared to 345.7 million shares in the year-ago quarter.The company repurchased 3.1 million shares of common stock in the 2019 fourth quarter for $432 million at an average price of $140.00 per share.  For full year 2019, Marriott repurchased 17.3 million shares for $2.3 billion at an average price of $130.79 per share.  Year to date through February 25, the company has repurchased 1.0 million shares for $150 million at an average price of $145.42 per share.CoronavirusDue to the uncertainty regarding the duration and extent of the Coronavirus outbreak, Marriott cannot fully estimate the financial impact from the virus, which could be material to first quarter and full year 2020 results.  As such, the company is providing a base case outlook for the first quarter and full year 2020, which does not reflect any impact from the outbreak.Assuming the current low occupancy rates in the Asia Pacific region continue, with no meaningful impact outside the region, Marriott estimates the company could earn roughly $25 million in lower fee revenue per month, compared to its 2020 base case outlook.  Room additions for the current year could also be delayed as a result of the Coronavirus outbreak.2020 Base Case Outlook, Not Including Impact from the Coronavirus The following base case outlook for first quarter and full year 2020 does not reflect any impact from the Coronavirus outbreak, merger-related costs and charges, cost reimbursement revenue, or reimbursed expenses, each of which the company cannot forecast with sufficient accuracy, and which may be significant.  The base case outlook for first quarter and full year 2020 does not reflect any additional asset sales that may occur during the year.  For the 2020 first quarter, Marriott assumes comparable systemwide RevPAR on a constant dollar basis will increase 1 to 2 percent worldwide and in North America.The company assumes first quarter 2020 gross fee revenues will total $940 million to $950 million, a 5 to 6 percent increase over first quarter 2019 gross fee revenues of $895 million.  The company anticipates first quarter 2020 incentive management fees will decrease slightly compared to first quarter 2019 incentive management fees of $163 million.  The company assumes first quarter 2020 general, administrative, and other expenses could total $230 million to $234 million. Marriott assumes first quarter 2020 adjusted EBITDA could total $853 million to $867 million, a 4 to 6 percent increase over first quarter 2019 adjusted EBITDA of $821 million.  See page A-12 for the adjusted EBITDA calculation.For the full year 2020, Marriott assumes comparable systemwide RevPAR growth on a constant dollar basis will be flat to up 2 percent worldwide, with RevPAR growth in North America around the middle of that range.Marriott assumes global room growth of 5.0 to 5.25 percent, net of 1 to 1.5 percent deletions for full year 2020.The company assumes full year 2020 gross fee revenues will total $3,960 million to $4,040 million, a 4 to 6 percent increase over 2019 gross fee revenues of $3,823 million, including roughly $10 million of unfavorable foreign exchange.  Full year 2020 estimated gross fee revenues include $630 million to $640 million of other franchise fees, a roughly 10 percent increase over other franchise fees for full year 2019.  Other franchise fees include application fees, relicensing fees, timeshare licensing fees, credit card branding fees, and residential and other branding fees.Marriott anticipates full year 2020 owned, leased, and other revenue, net of direct expenses, could total $295 million to $305 million.  The company assumes full year 2020 general, administrative, and other expenses could total $950 million to $960 million, a 1 to 2 percent increase from full year 2019 expenses of $938 million.  The company anticipates full year 2020 diluted EPS could total $6.30 to $6.53.  Full year 2019 adjusted diluted EPS totaled $6.00.  Full year adjusted 2019 results include the benefit of $143 million pre-tax ($0.33 per share) of asset sale gains in gains and other income, net, partially offset by asset impairments of $114 million pre-tax ($0.25 per share) in depreciation, amortization, and other expenses.  See page A-3 for the 2019 adjusted diluted EPS calculation.Marriott assumes full year 2020 adjusted EBITDA could total $3,700 million to $3,800 million, a 3 to 6 percent increase over 2019 adjusted EBITDA of $3,575 million.  See page A-13 for the adjusted EBITDA calculation.The company assumes investment spending in 2020 will total approximately $700 million to $800 million, including approximately $200 million for maintenance capital.  Investment spending also includes other capital expenditures (including property acquisitions), new mezzanine financing and mortgage notes, contract acquisition costs, and equity and other investments.  The company estimates nearly 40 percent of its 2020 investment spending will be reimbursed or recycled over time.  In the first quarter, the company sold a hotel in North America for $268 million subject to a long-term management agreement.  Assuming the level of investment spending noted above, no additional asset sales, and no impact from the Coronavirus, cash returned to shareholders through share repurchases and dividends could total more than $2.4 billion for full year 2020.Marriott International, Inc. (NASDAQ: MAR) will conduct its quarterly earnings review for the investment community and news media on Thursday, February 27, 2020 at 10:00 a.m. Eastern Time (ET).  The conference call will be webcast simultaneously via Marriott's investor relations website at http://www.marriott.com/investor, click on \"Events & Presentations\" and click on the quarterly conference call link.  A replay will be available at that same website until February 27, 2021.The telephone dial-in number for the conference call is 706-679-3455 and the conference ID is 1548644.  A telephone replay of the conference call will be available from 2:00 p.m. ET, Thursday, February 27, 2020 until 8:00 p.m. ET, Thursday, March 5, 2020.  To access the replay, call 404-537-3406.  The conference ID for the recording is 1548644.Note on forward-looking statements:  This press release and accompanying schedules contain \"forward-looking statements\" within the meaning of federal securities laws, including our RevPAR, profit margin and earnings outlook and assumptions; the number of lodging properties we expect to add to or remove from our system in the future; our expectations about investment spending and tax rate; estimates about impact to fee revenue from the Coronavirus outbreak as compared to our 2020 base case outlook; and similar statements concerning anticipated future events and expectations that are not historical facts.  We caution you that these statements are not guarantees of future performance and are subject to numerous risks and uncertainties, including those we identify below and other risk factors that we identify in our most recent quarterly report on Form 10-Q or annual report on Form 10-K.  Risks that could affect forward-looking statements in this press release include changes in market conditions; changes in global and regional economies; supply and demand changes for hotel rooms; the impact of the Coronavirus outbreak, whether in Greater China, elsewhere in our Asia Pacific region or globally; competitive conditions in the lodging industry; relationships with clients and property owners; the availability of capital to finance hotel growth and refurbishment; the extent to which we experience adverse effects from the data security incident; changes in tax laws in countries in which we earn significant income; and changes to our estimates of the impact of new accounting standards.  Any of these factors could cause actual results to differ materially from the expectations we express or imply in this press release.  We make these forward-looking statements as of February 26, 2020.  We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program.  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com.  In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1Tables follow                  View original content:http://www.prnewswire.com/news-releases/marriott-international-reports-fourth-quarter-2019-results-301012015.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "JW Marriott Orlando Bonnet Creek Resort & Spa Set To Debut In March 2020",
        "subtitle": "",
        "date": "Feb 24, 2020 9:00AM EST",
        "content": "ORLANDO, Fla., Feb. 24, 2020 /PRNewswire/ -- JW Marriott, part of Marriott International, Inc., today announced the upcoming opening of JW Marriott Orlando Bonnet Creek Resort & Spa slated for March 2020, marking JW Marriott's second property in Orlando. Just a 30-minute drive from the Orlando International Airport and ideally located on the doorsteps of Walt Disney World, the resort will provide families a luxury experience with unique family-friendly offerings and specially designed Family Suites. The resort's warm, inviting social spaces and amenities include a Spa by JW, resort pool with splash pad, specialty restaurants, as well as a rooftop terrace boasting nightly views of theme park firework displays.  Inspired by its natural surroundings, the expansive 516-room JW Marriott Orlando Bonnet Creek Resort & Spa has been thoughtfully designed to promote a sense of well-being and relaxation. Guests will delight in the details of the sophisticated décor with indigenous woods, wicker, reeds and stone features from the inviting lobby to the airy guest rooms and suites. The new property is the perfect venue for hosting romantic weddings, corporate meetings and special events with over 50,000 square feet of inspiring event space. Guests can rejuvenate at the fully equipped Spa by JW, with its 12-minute mini-spa treatments and nurturing full-day renewals, or seek sanctuary in the privacy of a poolside cabana during their time off. \"We are truly delighted to continue to expand our JW Marriott portfolio in Orlando, Florida,\" said Mitzi Gaskins, Vice President & Global Brand Leader, JW Marriott. \"The new JW Marriott Orlando Bonnet Creek Resort & Spa will bring a modern, luxurious and wellness-focused setting to our guests in Orlando, inviting them on an enriching journey of relaxation with experiences crafted with their holistic well-being in mind. The resort's elevated Family by JW programs and specialty Family Suites will also give families the ability to spend time together and engage in fun, active and creative experiences.\"JW Marriott Orlando Bonnet Creek Resort & Spa will provide guests with warm, uplifting service and experiences designed to deepen their journeys. The new resort will offer a luxury escape for travelers who come to feel present in mind, nourished in body and revitalized through the brand's curated programming. Families will welcome the close proximity to Walt Disney World and Disney Springs with its 110 luxury stores and entertainment options. The Family by JW signature brand program will provide enriching experiences for children, including the 6th Floor Kids Conservatory which will help boost their creativity with games and crafts while cultivating memorable family moments. Additionally, our guests will love the Activity Garden, featuring the Mount Chelonia rock-climbing wall, a nine-hole mini golf course, an open lawn to play giant chess, and other fun games.  Families will also enjoy staying at one of the resort's Family Suites, a brand first, with views of the nightly theme park firework displays, as well as access to the resort's convenient daily shuttle services to the Disney Theme Parks. Featuring lofted beds for an array of sleeping arrangements, spa-like bathrooms, and larger living areas, Family Suites are designed specially to make stays more comfortable and convenient for multi-generational families traveling with young children or any guests looking to come together and foster a true connection.The resort's culinary program will reinvigorate mind and body with indulgent yet thoughtful menus designed by award-winning chefs. Private dining and chef's table experiences at the signature Sear + Sea steakhouse will offer dishes made from wholesome ingredients, handcrafted cocktails and elevated service. Located on the ninth floor, the illume Rooftop lounge takes Japanese inspiration and features a menu of contemporary sushi, eclectic seafood dishes and Asian tapas, along with hand-crafted cocktails and views of the nightly firework displays. UnReserved is a European-inspired, food-hall style restaurant offering all-day dining; while drinks and other grilled favorites can be enjoyed poolside at Palm Cove. Guests can also enjoy illy® coffee, drinks and a curated selection of all-day grab-and-go items at the JW Market, nearby the beautifully designed lobby lounge and bar area. The JW Marriott Bonnet Creek will further highlight its commitment to naturally inspired dining by using wholesome, organic and locally sourced ingredients for authentic farm-to-table dining experiences. For additional information, or to book a stay, please visit: www.jwmarriottorlandobonnetcreek.com. Follow along with the progress and catch an inside look on social media at @jwbonnetcreek on Instagram. About JW Marriott Orlando Bonnet Creek Resort & SpaThe JW Marriott Orlando Bonnet Creek is luxury with a purpose, paired with inspiring architecture, contemporary design and associates who warmly welcome you and anticipate your needs. It's a chance to connect with nature and find amenities and activities that nurture the soul. It is both approachable, and authentic. An elevated experience that's equally uplifting. A location that engages the Walt Disney World action, with pathways to harness your inner energy, find greater clarity, and create mindful moments that make you feel whole. Learn more at jwmarriottorlandobonnetcreek.com.About JW Marriott Hotels & ResortsJW Marriott is part of Marriott International's luxury portfolio of brands and consists of award-winning properties and beautiful resort locations around the world. Inspired by the principles of mindfulness, JW Marriott is a haven designed to allow guests to focus on feeling whole – present in mind, nourished in body, and revitalized in spirit – through programs and offerings that encourage them to come together and experience every moment to the fullest. Today there are over 95 JW Marriott hotels in more than 30 countries and territories worldwide that cater to sophisticated, mindful travelers who come seeking experiences that help them be fully present, foster meaningful connections and feed the soul. Visit JW Marriott online, on Instagram and Facebook. JW Marriott is proud to participate in Marriott Bonvoy™, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.. View original content to download multimedia:http://www.prnewswire.com/news-releases/jw-marriott-orlando-bonnet-creek-resort--spa-set-to-debut-in-march-2020-301009591.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "JW Marriott Debuts In Oman's Historic Capital With Opening Of JW Marriott Muscat",
        "subtitle": "",
        "date": "Feb 18, 2020 10:22AM EST",
        "content": "MUSCAT, Oman, Feb. 18, 2020 /PRNewswire/ -- JW Marriott, part of Marriott International, Inc., announced the opening of JW Marriott Muscat today, setting the stage for distinctive experiences in Oman's historic capital. Located in the heart of Muscat's new business hub, within the Sultanate's largest urban development project Madinat Al-Irfan, the hotel is an integral part of the prestigious Oman Convention & Exhibition Centre (OCEC) precinct. Directly linked to the OCEC, it also provides easy access to key city landmarks including Muscat Old Town, Royal Opera House, Old Souq and Mattrah Corniche.\"The debut of JW Marriott in Muscat marks an exciting milestone for the brand in the Middle East and Africa as we continue to grow our footprint and deliver an elevated and warm luxury experience,\" said Mitzi Gaskins, Vice President & Global Brand Leader, JW Marriott. \"The hotel's extensive offerings encourage guests to live in the present and pursue their best selves while immersing themselves in the culturally authentic experiences of this enchanting city.\"Designed to allow guests to focus on feeling whole, JW Marriott Muscat is a true representation of JW Marriott's mission to providing enriching experiences that enable guests to live with intent. The property offers spaces to be present in mind, nourished in body and revitalized in spirit; including special mindful moments in dedicated areas throughout. Hotel guests can participate in a series of daily rituals that help transport them into a refuge of calm; each of which includes a five to 10-minute activity that enables them to be more aware, present, focused and inspired: Overlooking inspiring surroundings, JW Marriott Muscat features 304 guest rooms and suites, many of them offering views of Oman's wadis, spectacular natural valleys flowing with water. With 2500 square meters of banqueting space flooded with natural daylight and equipped with the latest state-of-the-art technology, the new property is the perfect place to host artfully choreographed meetings and events. Whether it is a small board meeting, a large conference, a social gathering or a wedding, the hotel offers space and choice with two large ballrooms and six meeting rooms. Directly linked to the Oman Convention & Exhibition Centre (OCEC) precinct, JW Marriott Muscat invites business travellers to benefit from the acclaimed 'Events by JW' service, including multi-lingual and experienced event planners and tailored menus. JW Marriott Muscat houses the largest Executive Lounge in the country and is the first hotel to have an exclusive lounge for airline crew.Oman's rich local produce is at the heart of JW Marriott Muscat's food and beverage philosophy, with five restaurants and lounges to ensure the culinary experiences at the hotel fulfil every taste and desire. The all-day dining found at Kitchen 7 offers a tasteful selection of international buffets, Asian woks, Middle Eastern grills and Indian tandoors with an interactive show kitchen. Fire cooking lovers can enjoy sophisticated grills with a sparkling flair at Pink Salt; nature and the crafts of a botanist inspire the refreshing and creative beverages at Tonika; while Butter Buns gastropub houses the city's best burgers, creating exceptional flavors. Guests can also relax and enjoy the Mediterranean vibe and entertainment from sunrise to sunset at the property's CATCH pool bar.A rejuvenating Spa by JW, offers signature treatments organized by four distinct benefits – renewal, calmness, invigoration and indulgence – as well as sauna and steam room facilities. Additional leisure facilities include a state-of-the-art fitness center, three outdoor swimming pools, a floodlit tennis court and a multipurpose court for basketball, volleyball and badminton. JW Marriott Muscat is an LEED gold compliant - a stringent green-building standard set by the US Green Building Council (USGBC) reinforcing the property's sustainable and environmental stewardship.For more information visit www.jwmarriottmuscat.comAbout JW MarriottJW Marriott is part of Marriott International's luxury portfolio of brands and consists of award-winning properties and beautiful resort locations around the world. Inspired by the principles of mindfulness, JW Marriott is a haven designed to allow guests to focus on feeling whole – present in mind, nourished in body, and revitalized in spirit – through programs and offerings that encourage them to come together and experience every moment to the fullest. Today there are over 95 JW Marriott hotels in more than 30 countries and territories worldwide that cater to sophisticated, mindful travelers who come seeking experiences that help them be fully present, foster meaningful connections and feed the soul. Visit JW Marriott online, on Instagram and Facebook. JW Marriott is proud to participate in Marriott Bonvoy™, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram. View original content to download multimedia:http://www.prnewswire.com/news-releases/jw-marriott-debuts-in-omans-historic-capital-with-opening-of-jw-marriott-muscat-301006685.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Appoints Jim Scholefield Chief Information And Digital Officer",
        "subtitle": "",
        "date": "Feb 18, 2020 8:30AM EST",
        "content": "BETHESDA, Md., Feb. 18, 2020 /PRNewswire/ -- Marriott International, Inc. (NASDAQ: MAR) today announced the appointment of Jim Scholefield as Chief Information and Digital Officer (CIDO), effective February 24. In this role, Scholefield will be responsible for leading all aspects of the company's information technology and digital strategies. Scholefield will report to Stephanie Linnartz, Group President, Consumer Operations, Technology & Emerging Businesses. \"Jim will play a pivotal role in driving our technology modernization efforts as we embark on a new chapter in the company's technology journey to support our future growth, both within our core lodging business and new ventures,\" said Linnartz. \"Jim brings incredible experience to Marriott, having led technology transformations at major global corporations for more than 30 years.\"Most recently, Scholefield was Chief Information and Digital Officer at Merck & Co., one of the world's largest pharmaceutical companies. He led Merck's information technology and digital strategy to drive efficiencies, strengthen the security of the infrastructure and support the company's growth. Prior to Merck, Scholefield was Chief Information Officer at Nike, where he led digital transformation and enterprise IT capability improvements for critical infrastructure and state-of-the-art cybersecurity. He also spent five years as Chief Technology Officer at The Coca-Cola Company, leading the company's transformation to cloud technology, and held leadership roles at The Northern Trust Company and Ford Motor Company. He began his career at Procter & Gamble after receiving his Bachelor of Science in Management from Florida State University and an MBA from the Georgia Institute of Technology.In September 2019, Marriott's Chief Information Officer, Bruce Hoffmeister, announced his decision to retire after 30 years with Marriott. Hoffmeister is staying with the company through mid-2020 to help with the transition.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-appoints-jim-scholefield-chief-information-and-digital-officer-301006325.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Declares Quarterly Cash Dividend",
        "subtitle": "",
        "date": "Feb 14, 2020 1:45PM EST",
        "content": "BETHESDA, Md., Feb. 14, 2020 /PRNewswire/ -- Marriott International, Inc. (NASDAQ: MAR) today announced that its board of directors declared a quarterly cash dividend of 48 cents per share of common stock. The dividend is payable on March 31, 2020 to shareholders of record as of February 28, 2020. About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-declares-quarterly-cash-dividend-301005372.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Autograph Collection Hotels Introduces The Ben, The First Waterfront Hotel in Downtown West Palm Beach",
        "subtitle": "",
        "date": "Feb 13, 2020 9:03AM EST",
        "content": "BETHESDA, Md., Feb. 13, 2020 /PRNewswire/ -- Today, Autograph Collection Hotels announced the opening of The Ben, the first hotel on the downtown West Palm Beach, Florida waterfront. The Ben is part of Autograph Collection's diverse and dynamic portfolio of more than 180 independent hotels carefully crafted with vision and passion. Just like The Ben, each distinctive hotel in the Autograph Collection is singular and special: Exactly Like Nothing Else. The Ben joins Autograph Collection's robust portfolio of 18 hotels in Florida including the newly opened Cadillac Hotel & Beach Club in Miami Beach, The Daytona in Daytona Beach and Fenway Hotel in Dunedin.\"We're thrilled to introduce The Ben, an unmistakably original hotel that injects new energy into the traditionally classic city of West Palm Beach,\" said Jennifer Connell, Vice President and Global Brand Leader, Autograph Collection Hotels. \"The Ben reimagines classic South Florida lifestyle for today's travelers by blending elements inspired by the city's early days as an untamed tropical paradise with modern touches, making it a perfect fit for the Autograph Collection.\"The 208-room, new-build hotel features a modern design aesthetic reflecting the spirit of the Ben Trovato Estate, one of West Palm Beach's original homes. Byrd Spilman Dewey, one of Florida's most prolific authors of the pioneer era, gave her 1892 Victorian home the name Ben Trovato, literally meaning \"well invented.\" The name is derived from \"Se non è vero, è ben trovato,\" an Italian phrase which, loosely translated, means \"Even if it isn't true, it's a good story.\" The Estate put West Palm Beach on the cultural map, entertaining luminaries from Henry Phipps Jr. to Woodrow Wilson and the Vanderbilts. Reimagined for today, The Ben creatively channels Dewey's joie de vivre, her love of entertaining, her whimsical interests and personal passions. Much like the Ben Trovato Estate, this new hotel is a place for socialization, lively conversation and enrichment.\"The Ben is a development unlike anything West Palm Beach has seen before. We're redefining what it means to travel to and live in West Palm,\" said Bernardo Neto, General Manager of The Ben. \"We invite guests and locals to experience the essence of this magical waterfront city in an inspired setting fueled by a unique story, thoughtful design and the spirit of socialization.\"Pioneered by South Florida architecture firm EoA and its founder and design director Malcolm Berg, The Ben's heartfelt design beautifully combines vintage Florida with modern elements. The hotels' interiors intrigue guests with a combination of rich textures and earth tones accented with lush greenery evocative of the South Florida setting and climate that enchanted Dewey. Guestrooms feature eclectic elements including sliding bookcases that, when discovered, reveal a window into the shower and whimsical, mod iconic collage portraiture. In the lobby, a book display wall is arranged to manifest the silhouette of hotel muse Dewey's face.Proper Grit debuts as the hotel's signature restaurant, with Executive Chef Andre Sattler at the helm. The contemporary South Florida chophouse is open daily and offers indoor and outdoor seating in a comfortable, yet upscale setting. A communal-style table stretches across the dining room to encourage socialization, with cozy, living-room style nooks along its border where guests can intimately enjoy a cocktail prior to being seated. Menus include fresh, locally sourced fare that combines the property's Old Florida roots interpreted the \"proper\" way and offers staples like whole, fresh caught snapper filleted table-side, and a perfectly cooked ribeye steak, served bone-in. The Ben also features Spruzzo, a stunning rooftop lounge and bar that is accessible via an express elevator directly from the ground floor. This new West Palm hotspot boasts sweeping, 'Byrds-eye' views of the Palm Harbor Marina and beyond, and offers a setting for guests to enjoy poolside cocktails and Mediterranean bites al fresco.Living up to its roots and identity as downtown West Palm's social hub, The Ben features more than 8,000 square feet of meeting and event space, from a sleek boardroom to a unique glass-enclosed gallery, The Studio, which provides a supplementary flex-space that serves as a blank canvas for the most innovative events to come to life.  For weddings and elegant affairs, The Ben's rooftop Blue Heron Ballroom ups the ante on events in the area. The space can host up to 500 guests and is the only rooftop ballroom in all of West Palm Beach with captivating ocean views from Singer Island to Palm Beach Island and beyond.Regular programming will make use of the varied spaces throughout the hotel with offerings including Sunset/Sunrise Yoga on the Rooftop, a Proper Grit Pup Brunch, Gin & Jam Tea Time and more. Owned and operated by Concord Hospitality, an award-winning hotel development and management company, The Ben is located at 251 N. Narcissus Avenue, one block from vibrant Clematis Street, minutes away from the newly reimagined Rosemary Square and a short drive from Palm Beach International Airport (PBI). For more information and bookings, please visit www.marriott.com/PBIAK or call (561) 655-4001.For more information about Autograph Collection Hotels, please visit www.autographhotels.com.  About Autograph Collection HotelsAutograph Collection Hotels advocates for the original, championing the individuality of each of its over 180 independent hotels located in the most desirable destinations across more than 30 countries and territories. Each is a product of passion and a personal realization of its individual founder's vision, making each hotel singular and special: Exactly Like Nothing Else. Hand-selected for their inherent craft and distinct perspectives on design and hospitality, Autograph Collection hotels offer rich immersive moments that leave a lasting imprint. For more information, please visit www.autographhotels.com, and explore our social media channels on Instagram, Twitter, and Facebook or follow along to be inspired by immersive moments that are #ExactlyLikeNothingElse.  Autograph Collection Hotels is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Marriott International Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.About The Ben West PalmBrought to life as the reinvention of a Palm Beach icon, The Ben is West Palm Beach's newest hotel, and the only one on the downtown waterfront. The 208-room property stands tall as the nucleus of Flagler Banyan Square, with carefully curated design and details that go hand in hand with an authentic local experience. The Ben West Palm takes inspiration from the Ben Trovato, one of the city's great homes owned by best-selling writer Byrd Spilman Dewey and her husband Fred Dewey, known as the couple that put West Palm Beach on the map. Their home became known as a sentinel point for socialization, conversation, enjoyment and enrichment, and the hotel channels a similar spirit as a gathering spot for the modern traveler. The one-of-a-kind property is also home to a full service restaurant, a rooftop lounge and pool with breathtaking views of Palm Harbor Marina, the Intracoastal Waterway and beyond, among other amenities. True to Autograph Collection standards, The Ben is \"Exactly Like Nothing Else\" both unique in design and thoughtful in spirit. For more information about The Ben West Palm visit www.thebenwestpalm.comAbout Concord Hospitality Enterprises CompanyAs an award-winning hotel development and management company, Concord Hospitality Enterprises Company has spent the last three decades building relationships with investors, partners, and third-party hotel owners on more than $2.5 billion in premium-branded properties across the United States and Canada. As an operator, Concord Hospitality instills value from the ground up, developing and managing with a sustainable viewpoint, a focus on quality and hands-on involvement to ensure long-term profitability and success. Concord Hospitality believes that its people are its greatest strength. With the brightest talent, the most innovative processes and a commitment to giving back to the communities where associates live and work, Concord Hospitality is committed to be a great place to work for all. Visit www.concordhotels.com for more information. View original content to download multimedia:http://www.prnewswire.com/news-releases/autograph-collection-hotels-introduces-the-ben-the-first-waterfront-hotel-in-downtown-west-palm-beach-301004544.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Renaissance Hotels Grows NYC Footprint With Debut Of Renaissance New York Chelsea Hotel, Inspiring Spontaneous Discoveries At Every Turn",
        "subtitle": "",
        "date": "Feb 10, 2020 9:03AM EST",
        "content": "NEW YORK, Feb. 10, 2020 /PRNewswire/ -- Renaissance New York Chelsea Hotel officially opens its doors today as one of the tallest properties in Manhattan's Chelsea neighborhood. Rising an impressive 39 floors at 430 feet high, the brand's first hotel in Chelsea is crowned with one of the highest rooftop pools in the city, offering unparalleled 360-degree views.Located on the former site of the iconic Antiques Garage flea market, the hotel pays homage to the site's history and the area's charming antique shops with a theatrical design concept by architecture and interior design firm Stonehill Taylor. Drawing inspiration from the surrounding neighborhood, spaces within the hotel aim to surprise and delight guests with unexpected moments, each thoughtfully designed to tell a story.\"Renaissance New York Chelsea Hotel encourages guests to discover this iconic location with a sense of reimagined curiosity,\" said George Fleck, vice president of global brand marketing & management, Renaissance Hotels. \"This new hotel, coupled with our significant growth and renovation strategy in North America, further reinforces our brand's global commitment to ensuring that guests experience the DNA of the neighborhood through our dramatic design and engaging guest experiences – ultimately leaving with a new appreciation of the destination.\" Renaissance New York Chelsea Hotel is the latest hotel to debut under the brand's growing North American portfolio which includes recently opened hotels in Philadelphia, Toledo, Reno, Dallas and Newport Beach, as well as renovated properties in Los Angeles, Minneapolis and Palm Desert, among others. Additionally, the brand is set to grow its New York City footprint two-fold over the next two years with highly anticipated openings in both Flushing and Harlem.\"Every detail of this hotel ties back to Chelsea's renowned artistic and eclectic personality,\" said Chris Rynkar, General Manager of Renaissance New York Chelsea Hotel. \"There is truly no other property like this one. Our guests have access to new, stunningly appointed amenities and accommodations, but also a connection to the neighborhood, which is an integral part of a Renaissance Hotels stay.\"A Hidden Retreat in the Concrete Jungle Underscoring Renaissance Hotels' unexpected design aesthetic, Stonehill Taylor created an escape that plays on the contrasting dichotomy of the hotel's industrial, antique and floral market surroundings to create the illusion of walking through a secret garden. The hotel's top-floor exterior features a sleek, modern glass facade, while the entrance embodies the look and feel of an English manor. Behind a stone-walled arcade entry lays a private, open-air courtyard studded with lush foliage and seating for guests to lounge. Tapped to curate the hotel's collection of artwork, art consultant Indiewalls led a massive two-story installation of antique knobs, locks and keys created by local artist Laura Morrison that takes center stage as the backdrop to the lobby staircase. As guests pass through the space, they are encouraged to touch and interact with these whimsical wares. Indiewalls also oversaw mixed media artist Liam Alexander's creation of various video art moments throughout the hotel, reflecting inspiration from the flower district and flea market concepts in the surrounding locale, eliciting the feeling of a \"living painting.\" Trellage-Ferrill Studio fabricated custom pieces like a collection of upside-down bird cages, as well as a large pendant at the elevator lobby inspired by a bird's nest to pique the curiosity of travelers. Inside the elevator cabs, leather tiles made from vintage belts coat the walls, adding intrigue of the hotel's overall design.Earth tones dominate the color palette of the 341 guest rooms and suites. Interiors are outfitted with wood-paneled printed wallcoverings and unexpected playful touches include gnome desk lamps and rabbit coat hooks. Guest bathrooms evoke a quaint garden shed with concrete sinks, porcelain tiles and mirrors etched with silhouettes of wildflowers. Suites on the fourth and 36th floors are distinguished by their 14-foot high ceilings. A focal point of each suite is a floor-to-ceiling framed wallcovering art installation of a magnified peacock feather, as well as an oversized mural of a woman's silhouette comprised of fuchsia roses by artist Sara Byrne.A Twist on Traditional Italian CuisineChef Fabrizio Facchini brings a bold twist on authentic Italian cuisine in the hotel's restaurant, Cotto, set to open in the early spring. With 10-foot-high, floor-to-ceiling windows, the airy restaurant will feature an indoor family-style dining room and lounge as well as a 14-seat bar surrounded by a framed picture collection of vintage oddities. Exposed wood beams run across the ceiling and down the walls, which are peppered with mason jar sconces, a romantic reference to firefly jars placed in a secret garden. Serving daily breakfast, lunch, dinner and weekend brunch, specialties will include burrata al tartufo with freshly shaved summer truffles and paccheri al pistachio di Bronte with a creamy saffron sauce and pistachio pesto. In addition to an extensive list of wine and spirits offerings, Facchini has developed an innovative mixology experience incorporating a selection of spirits, fruit, and herb-infused ice cubes into the restaurant's cocktail programming. Evenings at Renaissance New York Chelsea HotelIn the lobby area near the bar, the hotel hosts Renaissance's signature bar ritual four times per week, featuring a complimentary, locally inspired punch cocktail prepared by the hotel's resident mixologist. Guests will also be treated to weekly activations and performances by local musicians and artists alike as part of the brand's Evenings at Renaissance programming, providing them with an even deeper connection to the neighborhood.An Urban Oasis, 430 Feet in the AirThe bi-level lounge and rooftop pool, Somewhere Nowhere, welcoming guests in the coming months, will offer an escape from the busy streets of Manhattan. The indoor lounge on the 38th floor will be accessible via a hidden, ground-floor passageway - a repurposed loading dock transformed with spray-painted murals of fireflies and mischievous gnomes, neon signs and old-fashioned lantern sconces - that leads to an elevator transporting guests to the 38th and 39th floors. On the 39th floor rooftop terrace, guests will enjoy one of the highest open-air pools in the city showcasing 360-views of Manhattan's majestic skyline. Somewhere Nowhere will be open seven days a week and is operated by El Grupo SN.Sun-Drenched Meeting & Event SpacesThe hotel boasts 7,326-square-feet of flexible event space, including Somewhere Nowhere. The 2,170-square-foot Cardinal Ballroom, drenched in natural light, features floor-to-ceiling windows that open out to Juliet balconies with city views. The ballroom, with a maximum capacity of 200 people, is ideal for weddings and galas, but can also be split into two separate rooms for smaller conferences. A grand, yet intimate atmosphere, Cotto's private dining room is defined by an arched doorway, playful garden string lights, antique rugs and dried moss encased in antique gilded frames on the walls. The dining room's greenhouse-esque glass wall folds open to provide complete access to the restaurant's rear garden. R.E.N. Meetings, Renaissance Hotels' creative meetings platform, provides planners with a dedicated event team that will bring events and meetings to life using the storied neighborhood of Chelsea and the flexible event space as inspiration – from the styling of each space, incredible locally sourced catering and turnkey social breaks to inspire and motivate networking among guests.Access to the Thriving Chelsea NeighborhoodGuests are encouraged to explore the surrounding area and can engage with Renaissance Hotels' Navigators, the brand's neighborhood ambassadors who are on-hand to share hidden indigenous gems not found in the guidebooks.Located at 112 W. 25th Street between 6th and 7th avenues, the hotel is steps from some of the area's most in-demand spots, such as Chelsea Market and The High Line. The property is within walking distance to the 1, 2, N, Q, R, W, A, C and E MTA subway lines, as well as New York Pennsylvania Station. In celebration of the opening, Renaissance New York Chelsea Hotel is offering travelers special access to their \"Discover this Way\" package, inspired by Renaissance Hotels' celebration of local haunts found in each hotel's surrounding neighborhood. Available through March 4, 2020, the package includes accommodations in double occupancy, two complimentary welcome cocktails, daily breakfast for two and a pair of tickets to tour the hotel's \"This Way\" local partner, Our / New York Vodka distillery.Renaissance New York Chelsea Hotel is owned by Lam Generation, which is also the developer for Renaissance New York Harlem, and managed by Real Hospitality Group. For more information, please visit www.RenaissanceChelsea.com and www.RenHotels.com.About Renaissance HotelsWith over 170+ hotels in more than 35 countries around the world, Renaissance Hotels has hit its stride with the strongest hotel portfolio in its history, doubling down on its commitment to design with dramatic renovations and dynamic global growth on the horizon. Around the world, Renaissance Hotels connects travelers to the spirit of the neighborhood through its unexpected design, entertaining evening bar rituals and engaging Navigators, extending an open invitation to experience the unexpected both inside and out of the hotel. Stay connected with Renaissance Hotels on Facebook, Instagram, YouTube, and twitter @RenHotels.  Renaissance Hotels is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Real Hospitality GroupOcean City, Maryland-based Real Hospitality Group (RHG), with offices in New York City and Ft. Lauderdale, is a full-service hotel management company. Real Hospitality Group's portfolio of over 100 properties, open and in development, spans across 19 states and ranks in the top 15 of U.S. hotel operating companies. Real Hospitality Group is a recognized service provider for leading brands including Marriott International, Hilton Hotels & Resorts, Hyatt Hotels Corporation, InterContinental Hotels Group PLC, Choice Hotels International, Inc., Wyndham Hotels and Resorts and Red Lion Hotels Corporation as well as a growing portfolio of independent luxury boutique hotels including the MADE and Boro Hotel in New York City and Ruschmeyers in Montauk, NY. RHG focuses on comprehensive development management services, revenue performance, guest experience and business development for hotels, resorts and investment ownership groups. For more information about Real Hospitality Group, please visit www.realhospitalitygroup.com.About Lam GenerationLam Generation is a full-service real estate development, investment and management company based in New York City. Founded in 2005, the company has developed ground up over 1.5 million square feet of hospitality assets in Manhattan and Brooklyn. Lam Generation's portfolio also includes residential, office and retail properties.Stonehill TaylorStonehill Taylor is a hospitality-focused architecture and interior design firm based in New York City. The firm's approach to designing destinations is to create an inspired and distinct reflection on the location, space, history and culture for each project. Stonehill Taylor's distinguished portfolio in interior design and architecture includes: TWA Hotel, The Whitby, Renaissance New York Chelsea, Moxy Chelsea, Ace Hotel New York, The Refinery Hotel, InterContinental Barclay, JW Marriott Nashville, and the Eliza Jane Hotel in New Orleans. Stonehill Taylor is at the forefront of sustainable design, developing projects that are conscious of their impact on local communities and the world such as: The Crosby Street Hotel, The NoMad Hotel and Nomad Las Vegas, and Portland's Press Hotel. For more information, visit: www.stonehilltaylor.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/renaissance-hotels-grows-nyc-footprint-with-debut-of-renaissance-new-york-chelsea-hotel-inspiring-spontaneous-discoveries-at-every-turn-301001187.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Expands at Frankfurt Airport Offering More Choice Than Ever Before with Flagship Sheraton and Marriott Brands",
        "subtitle": "",
        "date": "Feb 3, 2020 1:00PM EST",
        "content": "BETHESDA, Md., Feb. 3, 2020 /PRNewswire/ -- Marriott International has unveiled an exciting new offering at Frankfurt Airport following a long-term commitment to upgrade and elevate the existing Sheraton Frankfurt Airport Hotel & Conference Center. The renovation of the property not only delivers a revamped Sheraton hotel to the market but also a brand-new Marriott hotel, bringing two of Marriott International's most well-known brands together in one location for the first time. Each hotel is distinct and retains individual brand characteristics, including guest rooms, executive lounges and lobby experience, but shares expansive facilities including dining, conference and fitness.  \"I am delighted that we can leverage the synergies and appeal of these two popular brands to offer our guests more choice and flexibility,\" said John Licence, VP Premium & Select Brands Europe, Marriott International.  \"Both brands are transforming the guest experience in their own unique way, meaning we will be able to offer the best of both at Germany's largest aviation hub and a key business destination.\" Previously occupying three inter-connected buildings with 1,008 rooms, the Sheraton Frankfurt Airport Hotel & Conference Center has been divided to allow for a 779-room Sheraton hotel and a 233-room Marriott hotel. Over the past five years, all rooms of the Sheraton hotel have been refurbished, offering guests a comfortable experience. Focused on connecting communities in line with the brand vision, the Sheraton hotel will soon offer a new Sheraton Club Lounge, designed to offer the comfort and connectivity that Sheraton guests are looking for.     Reflecting Marriott Hotels' ethos of creating spaces that enable guests to flourish, the new Frankfurt Airport Marriott Hotel delivers the residential design aesthetic with locally-inspired accents the brand is known for.  Led by Hamburg-based JOI-Design, the design is stylish and sophisticated and takes cues from Frankfurt's history of literature, the printing industry and the famous Frankfurt Book Fair with inspiring quotations, a sofa for reading and relaxing, and library elements in the new lobby.  The aim of the design is to promote creativity and productivity.The Frankfurt Airport Marriott Hotel's 233 contemporary guest rooms feature hard-wood flooring, comfortable work zones with sofas and flexible tables, and stylish lighting. The hotel also features the brand's signature M Club, an exclusive 24/7 lounge for relaxing, working and meeting.  The final stage of the renovation will commence shortly with the refurbishment of the Sheraton lobby, Sheraton Conference Center, and shared dining facilities, of which there are two restaurants and two bars. The Sheraton Conference Center, offering 57 meeting spaces across 4,148 square metres, has already been updated with a state-of-the-art lighting concept and will enjoy further refurbishments over the next two years.  The property expects to be fully transformed by the end of 2022.  Marriott International now offers five properties at Frankfurt Airport including Moxy Frankfurt Airport, Moxy Frankfurt Airport Kelsterbach and Element Frankfurt Airport.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program with 141 million members globally. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.  View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-expands-at-frankfurt-airport-offering-more-choice-than-ever-before-with-flagship-sheraton-and-marriott-brands-300997793.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Announces Release Date For Fourth Quarter 2019 Earnings",
        "subtitle": "",
        "date": "Jan 27, 2020 11:15AM EST",
        "content": "BETHESDA, Md., Jan. 27, 2020 /PRNewswire/ -- Marriott International, Inc. (NASDAQ: MAR) will report fourth quarter 2019 earnings results on Wednesday, February 26, 2020, at approximately 5:00 pm Eastern Time (ET).  The company will hold a conference call for the investment community to discuss its fourth quarter 2019 earnings on Thursday, February 27, 2020 at 10:00 am ET.  Mr. Arne Sorenson, Marriott International's president and chief executive officer, and Ms. Leeny Oberg, Marriott International's executive vice president and chief financial officer, will discuss the company's performance.The conference call will be webcast simultaneously via Marriott's investor relations website.  Those wishing to access the call on the web should log on to http://www.marriott.com/investor, and click the link for the fourth quarter earnings call under \"Recent and Upcoming Events\".  A replay will be available at that same website until February 27, 2021.  A transcript of the call will also be available on the company's website.The telephone dial-in number for the conference call is 706-679-3455.  Please use conference ID 1548644 when dialing into the call.  To help ensure you do not miss any of the conference call, please dial-in or link to the call on the web 15 minutes prior to the scheduled start time.  News media will be able to access the conference call in a listen-only mode.  A telephone replay of the conference call will be available from 2:00 pm ET, Thursday, February 27, 2020 until 8:00 pm ET, Thursday, March 5, 2020.  To access the replay, call 404-537-3406.  The conference ID for the recording is 1548644. About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program with 141 million members globally. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-announces-release-date-for-fourth-quarter-2019-earnings-300993612.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "The Ritz-Carlton, South Beach Re-Opens Following $90 Million Renovation",
        "subtitle": "",
        "date": "Jan 27, 2020 9:00AM EST",
        "content": "MIAMI, Jan. 27, 2020 /PRNewswire/ -- The Ritz-Carlton, South Beach is thrilled to have re-opened its doors following a $90 million, multi-year renovation that touched all elements of the property. Ideally located in the heart of South Beach, Miami, the landmark hotel was originally imagined by architect Morris Lapidus, and following its floor-to-ceiling restoration is set to deliver a rare and refined experience marked by timeless design, thoughtful programming, and the anticipatory service of the Ladies and Gentlemen of The Ritz-Carlton. \"Today, The Ritz-Carlton, South Beach – a treasure in the brand's portfolio and in Miami -  returns better than ever with a distinctive design transformation that melds modern touches with the building's beloved Art Deco design,\" said Sase Gjorsovski, General Manager of the resort. \"Given the tremendous thought that has gone into this $90 million renaissance, I'm confident that leisure travelers, business travelers, and groups alike will find our 'big reveal' well worth the wait.\"Perfectly positioned at the intersection of Collins Avenue and Lincoln Road, the historic hotel showcases a design scheme created by Meg Sharpe, who oversaw the lobby, the Lapidus Bar, restaurant, pool, club and spa, and Cristian Rubio, from renowned design-firm HBA, who was charged with reimagining the guestrooms and meeting spaces. Finding inspiration from the gorgeous natural surroundings, the interiors are warm and inviting, reflecting the serene natural beauty of Miami while celebrating the historic roots of the hotel. Upon entering The Ritz-Carlton, South Beach, guests will discover the stunning new lobby that is a celebration of the original design, enhanced by elegant touches that transition the property into a modern era. Steps away, the all-new Lapidus Bar is a classic cocktail lounge honoring a bygone era of Miami with live music, vintage cocktails, and a design that invites visitors to settle in and absorb their magnificent surroundings. \"The design of the public spaces was inspired by the history of the building itself,\" said Meg Sharpe. \"By upholding the integrity of the storied past of the property, we have revealed the architectural base created by the giants of the Art Deco and Mimo styles renowned in Miami. The gentle nod to the past is imbued with modern purpose.\" The vibrant flavors of Latin America take the lead at Fuego y Mar, the hotel's new restaurant with Executive Chef Anthony LePape at the helm. Within this space guests also find a tech lounge, where they work in a sophisticated, convivial setting while ordering coffee and cocktails. DiLido Beach Club and its oceanfront location promise an intimate dining enclave with plush seating and views out across the turquoise water. A true urban oasis in the heart of South Beach, The Ritz-Carlton Spa centers around a holistic approach to wellness that celebrates mindfulness and offers a range of therapies and journeys carefully designed to promote rest and rejuvenation. Home to the only Timeless Capsule in the United States, this one of a kind elliptical space is designed to condense spa treatments and is the ideal offering for time-restricted guests.For club level guests, the Club Lounge offers a dedicated concierge, bespoke experiences and complimentary culinary delights throughout the day. Locally driven signature offerings will also be available to club guests and include empanadas, waffle pastelitos, and more. Each of the 376 guestrooms and suites reflect Cristian Rubio's vision, which is the result of his extensive research into Miami and the many facets of the city that make it so special. Meticulously-designed furnishings and custom millwork blend together to create a space celebrating the city and its culture. Enhanced soundproofing additionally ensures guests a restful night's sleep.\"Culture has been infused into each and every guestroom and meeting space, resulting in an authentic Miami experience,\" said Cristian Rubio. \"A relatively new city, Miami's unique culture has been translated into the hotel with both depth of design and whimsical details that allow guests a feeling of being in the city without having to leave their rooms.\" The ballroom at The Ritz-Carlton, South Beach spans over 10,000-square-feet, and is supplemented by 11 separate meeting and event spaces, all of which showcase a design that is infused with the spirit of Miami's history and rich cultural scene. A vision of the past, present and future of Miami, the ladies and gentlemen of The Ritz-Carlton, South Beach stand ready to play  gracious host to travelers visiting the most exotic place in America. About The Ritz-Carlton, South BeachLocated, in the Art Deco Historic District and steps from the exclusive South of Fifth neighborhood, The Ritz-Carlton, South Beach is a luxury oceanfront property that lies in the heart of South Beach on Lincoln Road and Collins Avenue.  For additional information about The Ritz-Carlton, South Beach, please call (800) 241-3333, the hotel directly at (786) 276-4000, a travel professional or visit The Ritz-Carlton website at www.ritzcarlton.com. About The Ritz-Carlton Hotel Company, LLCThe Ritz-Carlton Hotel Company, L.L.C., of Chevy Chase, MD., part of Marriott International, Inc., currently operates more than 100 hotels and over 45 residential properties in 30 countries and territories. For more information or reservations, visit the company web site at www.ritzcarlton.com, for the latest company updates, visit news.ritzcarlton.com and to join the live conversation, use #RCMemories and follow along on Facebook, Twitter, and Instagram. The Ritz-Carlton Hotel Company, L.L.C. is a wholly owned subsidiary of Marriott International, Inc. (NASDAQ:MAR). The Ritz-Carlton is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/the-ritz-carlton-south-beach-re-opens-following-90-million-renovation-300992584.htmlSOURCE  The Ritz-Carlton Hotel Company, LLC"
    },
    {
        "title": "Marriott International Announces Seventh Consecutive Year of Record Organic Worldwide Rooms Signings in 2019, with Approximately 515,000 Rooms in the Pipeline",
        "subtitle": "",
        "date": "Jan 27, 2020 8:30AM EST",
        "content": "BETHESDA, Md., Jan. 27, 2020 /PRNewswire/ -- Marriott International, Inc. (NASDAQ: MAR) today announced it signed a record number of rooms in 2019, pushing its global pipeline to approximately 515,000 rooms as of year-end 2019 for the first time in the company's history. The company signed 815 agreements, representing more than 136,000 rooms, marking the seventh consecutive year of record-breaking volume of organic rooms signings. Growth was fueled by unprecedented levels of organic rooms signed in each of the company's international regions. During 2019, the company added 516 properties with more than 78,000 rooms in 60 countries and territories – an average of one new property every 17 hours.\"With growth and loyalty as the cornerstones of our company's success, our unrivaled 2019 signings illustrate our winning strategy, which combines leading brands, powerful business platforms and an enduring focus on our associates,\" said Tony Capuano, Group President, Global Development, Design and Operations Services, Marriott International. \"We continue to drive value for our owners with quality branding options for both property conversions and new builds, backed by our leading business support systems and loyalty platform. By staying true to our growth philosophy and continuously responding to the evolving preferences and lifestyles of travelers, we are poised for a successful 2020 and beyond.\"At the end of 2019, Marriott International's worldwide system consisted of more than 7,300 properties and roughly 1.38 million rooms in 134 countries and territories. More than half of the company's record global development pipeline is located outside North America. \"With 141 million Marriott Bonvoy members who increasingly crave travel to new cities and unique experiences around the world, a record-breaking year of deals means new, exciting properties are coming for travelers worldwide,\" said Stephanie Linnartz, Group President, Consumer Operations, Technology & Emerging Businesses, Marriott International. \"Our stellar growth results prove that our broad brand portfolio and platforms are resonating with owners and developers, as well as with customers.\" Record-setting year for growth in valuable international marketsIn 2019, 53 percent of the company's signed rooms were outside North America with record-breaking organic volumes in the company's Asia Pacific (38,000 rooms), Europe (17,000 rooms), Caribbean and Latin America (more than 9,000 rooms), and Middle East and Africa (8,000 rooms) regions. Additionally, in 2019, Marriott International debuted its first hotels in four additional countries – Cyprus, Moldova, Kyrgyzstan and Latvia.Company extends its lead in luxuryMarriott International did a record-breaking number of deals for its global luxury hotel brands, bolstering its lead in this high-value segment. In 2019, the company signed 42 luxury projects in 27 countries and territories, while opening or converting 34 properties such as The St. Regis Venice, W Dubai – The Palm, The West Hollywood EDITION and The Ritz-Carlton, Pune. As the company focuses on expanding its leading luxury footprint, it is revitalizing W Hotels. Last year, the company purchased the W New York – Union Square, with plans to transform the property into a showcase for the brand's future look.Successful all-inclusive launch Last August, Marriott launched its all-inclusive platform to bring its brands, scale and trusted service to this growing, global vacation segment. Less than six months after its launch, the company has signed seven management and franchise agreements for all-inclusive properties representing nearly 3,200 rooms. Among the all-inclusive projects in development are an 800-room Marriott Hotels resort in Jamaica and a 240-room Ritz-Carlton resort in Mexico. The company last year also completed its acquisition of Elegant Hotels Group, which consists of seven hotels and 588 rooms located on the picturesque island of Barbados. Affordable lifestyle hotel brands buoy company growthCatering to the next generation of travelers, the company's AC by Marriott, Aloft and Moxy brands opened nearly 10,000 rooms in 2019.  Combined, these brands represent more than 65,000 open rooms in 44 countries and territories, including new hotels in Greece, Ireland, Jamaica, Latvia, Nepal and Switzerland. The company signed nearly 24,000 rooms across the AC by Marriott, Moxy and Aloft brands during the year – with record room signings for both AC by Marriott and Moxy.Note on Forward-Looking Statements: This news release contains \"forward-looking statements\" within the meaning of federal securities laws, including the number of properties the company may add in the future, the company's growth prospects in future years and similar statements concerning possible future events or expectations that are not historical facts. We caution you that these statements are not guarantees of future performance and are subject to a number of risks and uncertainties, including changes in market conditions; changes in global and regional economies; supply and demand changes for hotel rooms; competitive conditions in the lodging industries; relationships with clients and property owners; the availability of capital to finance  growth and refurbishment; and other risk factors that the company identifies in its most recent annual report on Form 10-K or quarterly report on Form 10-Q; any of which could cause actual results to differ materially from the expectations we express or imply here.  We make these statements as of the date of this press release, and we assume no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,300 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company offers Marriott Bonvoy™, its highly-awarded travel program with 141 million members globally. For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-announces-seventh-consecutive-year-of-record-organic-worldwide-rooms-signings-in-2019--with-approximately-515-000-rooms-in-the-pipeline-300993239.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Courtyard by Marriott Culminates Once-In-A-Century Celebration at Super Bowl LIV with Super Bowl Sleepover and Dream NFL Fan Experiences",
        "subtitle": "",
        "date": "Jan 16, 2020 1:58PM EST",
        "content": "BETHESDA, Md., Jan. 16, 2020 /PRNewswire/ -- Courtyard by Marriott, the Official Hotel of the NFL, announced today the winner of its Super Bowl Sleepover Contest – Denise Ammon. Courtyard by Marriott will host Ammon and a select group of her friends for an experience of a lifetime, including waking up in a Courtyard transformed suite inside the stadium on Super Bowl Sunday. All season long, Courtyard by Marriott and the global travel program Marriott Bonvoy have offered fans unprecedented access to NFL experiences that have created lasting memories, in celebration of the NFL's 100th Season. From the Courtyard Super Bowl Sleepover Contest to hundreds of NFL-related Moments made available exclusively to Marriott Bonvoy members, fans have been delighted all season long with NFL experiences that bring travelers closer to the game they love.Friendship Forged by a Passion to Help For the first time ever, Courtyard by Marriott is celebrating \"game-changing friendship\" by awarding the opportunity of a lifetime to wake up inside the stadium on Super Bowl Sunday. This year's winner, Denise Ammon, exemplifies the impact that an extraordinary friendship can have in pursing both personal and professional passions. Ammon's \"game-changing friendship\" submission featured her former fellow co-residents whom she met during emergency medicine residency at a Level 1 Trauma hospital in Brooklyn, New York. She credits her success to their unrelenting friendship, after she was told by college counselors that she wasn't cut out to be a doctor. Ammon went on to attend medical school in New Orleans and ultimately matched to one of her top choices for residency training. The group supported each other during the most strenuous days in residency and continue to guide each other today while serving as emergency room doctors across the country. \"Courtyard's guests are passionate, energized and disciplined, similar to elite athletes competing to play in the Super Bowl,\" said Janis Milham, Senior Vice President and Global Brand Leader, Classic Select Brands. \"The story of Denise's game-changing friendship is the kind of empowerment that we strive to provide our guests in achieving their personal and professional goals. Courtyard is proud to once again partner with the NFL to recognize her success and provide this opportunity of a lifetime.\"Courtyard by Marriott will host Ammon and her three friends for an overnight stay inside a stadium suite transformed into a Courtyard guest room with a view overlooking the field. In addition to winning tickets to Super Bowl LIV, the group will take part in a night of exciting, in-stadium experiences with access to exclusive events throughout the weekend. In another first, this year's suite will feature the newly designed Courtyard Bistro Bar, providing the winners a taste of Courtyard's new food and beverage menu.The Official Hotel of the NFL is also offering Marriott Bonvoy Visa Card members an opportunity to live out their dreams at the Courtyard House presented by Visa, an exclusive Super Bowl LIV celebration on January 31, featuring a live performance by The Chainsmokers and the chance to mingle with NFL stars in Miami. Marriott Bonvoy Announces 250 NFL Post-Season Moments Exclusively for Members:From brunch with NFL legends to experiencing Super Bowl LIV from a luxury suite and on-field access to watch the Pepsi Super Bowl LIV Halftime Show, the post-season is becoming even more rewarding for members of Marriott Bonvoy now that they can bid their points on more than 250 money-can't-buy experiences.  Earlier this season, Marriott Bonvoy hosted NFL Combine Masterclass Moments in Chicago and San Francisco led by Emmitt Smith where the Hall of Fame running back helped fans see how they would stack up on traditional drills that prospective players compete in before the Draft. Other Marriott Bonvoy Moments included VIP field access to the 2019 London Games at Tottenham and Wembley and luxury suite tickets, amazing seats to the 2019 Mexico Game at Azteca Stadium with VIP reception, meet and greet with an NFL Legend, field passes and more.Over the past two years, Marriott Bonvoy has offered members more than 1,000 exclusive, NFL Moments which have been redeemed for 95 million points. Offering something for every NFL fanatic, Moments have ranged from 10,000 points to a record-breaking 3.2 million points for two guests to sleep over in the Courtyard by Marriott custom suite before Super Bowl LIII.About Courtyard by MarriottCourtyard is the hotel brand of choice for ambitious and enterprising guests who see business travel as a driver of personal fulfillment and professional growth. Courtyard provides opportunities for guests to pursue both their personal and professional passions on the road. With more than 1,200 locations in over 54 countries and territories, Courtyard is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.com. For more information or reservations, visit courtyard.marriott.com, become a fan on Facebook or follow @CourtyardHotels on Twitter and Instagram.About Marriott BonvoyMarriott Bonvoy is the new travel program replacing Marriott Rewards, The Ritz-Carlton Rewards and Starwood Preferred Guest (SPG) starting February 2019. Comprised of a portfolio of 30 hotel brands and home rental offering Homes & Villas by Marriott International, members can earn and redeem points for stays and accelerate the points they earn with co-branded credit cards from Chase and American Express. The program offers 120,000 destination tours and adventures on Marriott Bonvoy Moments. When members book direct on Marriott.com they receive perks including free and enhanced Wi-Fi and exclusive member-only rates, and on the Marriott app they enjoy mobile check-in and checkout, Mobile Requests and, wherever available, Mobile Key. To enroll for free or for more information about Marriott Bonvoy, visit MarriottBonvoy.com. To download the Marriott app, go here. Travelers can also connect with Marriott Bonvoy on Facebook, Twitter and Instagram.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG). For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram. View original content to download multimedia:http://www.prnewswire.com/news-releases/courtyard-by-marriott-culminates-once-in-a-century-celebration-at-super-bowl-liv-with-super-bowl-sleepover-and-dream-nfl-fan-experiences-300988500.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Completes Acquisition of Elegant Hotels Group",
        "subtitle": "",
        "date": "Dec 9, 2019 8:00AM EST",
        "content": " BETHESDA, Md., Dec. 9, 2019 /PRNewswire/ -- Marriott International, Inc. (NASDAQ: MAR) announced that it has completed its acquisition of Elegant Hotels Group plc. The announcement from Elegant and International Hotel Licensing Company S.à r.l. was issued over London's Regulatory News Service earlier today. Full text can be found below:On 18 October 2019, the boards of Elegant Hotels Group plc (\"Elegant\") and International Hotel Licensing Company S.à r.l. (\"IHLC\"), a wholly-owned indirect subsidiary of Marriott International, Inc. (\"Marriott\"), announced that they had reached agreement on the terms of a recommended all cash offer to be made by IHLC for the entire issued and to be issued ordinary share capital of Elegant (the \"Acquisition\").On 6 December 2019, Elegant and Marriott announced that the Court had sanctioned the Scheme.Elegant and Marriott are pleased to announce that the Court Order has been delivered to the Registrar of Companies today and accordingly the Scheme has now become effective, in accordance with its terms. Elegant is now a wholly owned subsidiary of IHLC.Scheme Shareholders on the register of members of the Company at the Scheme Record Time, being 8.00 p.m. on 6 December 2019, will receive 110 pence in cash for each Scheme Share. Settlement of the cash consideration due to Scheme Shareholders will occur within 14 days.Dealings in Elegant Shares on AIM were suspended with effect from 7.30 a.m. today. The cancellation of trading of Elegant Shares on AIM is expected to take place at 7.00 a.m. on 10 December 2019.As a result of the Scheme having become Effective, share certificates in respect of the Elegant Shares have ceased to be valid documents of title and entitlements to Elegant Shares held in uncertificated form in CREST are being cancelled.Capitalised terms used but not defined in this announcement have the meanings given to them in the Scheme Document.Enquiries:Important noticesPricewaterhouseCoopers LLP (''PwC\"), which is authorised and regulated in the United Kingdom by the FCA, is acting as financial adviser to Marriott and IHLC and for no one else in connection with the Acquisition or other matters referred to in this Announcement and will not be responsible to anyone other than Marriott and IHLC for providing the protections afforded to its clients nor for providing advice in relation to the Acquisition, the contents of this Announcement or any other matters set out in this Announcement.Liberum Capital Limited (\"Liberum\"), which is authorised and regulated in the United Kingdom by the FCA, is acting exclusively as financial adviser and broker to Elegant and for no one else in connection with the Acquisition or other matters set out in this Announcement and will not be responsible to anyone other than Elegant for providing the protections afforded to its clients nor for providing advice in relation to the Acquisition or other matters set out in this Announcement.This Announcement is for information purposes only and is not intended to and does not constitute, or form any part of, an offer to sell or subscribe for or any invitation to purchase or subscribe for any securities or the solicitation of any vote or approval in any jurisdiction pursuant to the Acquisition or otherwise. The Acquisition will be made solely on the terms set out in the Scheme Document and the accompanying Forms of Proxy, which contain the full terms and conditions of the Acquisition, including details of how to vote in respect of the Acquisition. Any approval, decision or other response to the Acquisition should be made only on the basis of the information in the Scheme Document. Elegant Shareholders are strongly advised to read the formal documentation in relation to the Acquisition. Each Elegant Shareholder is urged to consult its independent professional adviser immediately regarding the tax consequences to it (or its beneficial owners) of the Acquisition.This Announcement does not constitute a prospectus or prospectus equivalent document.Overseas shareholdersThe release, publication or distribution of this Announcement in or into jurisdictions other than the UK may be restricted by law and therefore any persons who are subject to the law of any jurisdiction other than the UK should inform themselves about, and observe, any applicable legal or regulatory requirements. In particular, the ability of persons who are not resident in the UK to vote their Elegant Shares at the Court Meeting or General Meeting, or to appoint another person as proxy to vote at the Court Meeting or General Meeting on their behalf, may be affected by the laws of the relevant jurisdictions in which they are located. Any failure to comply with the applicable restrictions may constitute a violation of the securities laws of any such jurisdiction. To the fullest extent permitted by applicable law, the companies and persons involved in the Acquisition disclaim any responsibility or liability for the violation of such restrictions by any person. This Announcement has been prepared for the purpose of complying with the laws of England and Wales, Market Abuse Regulation, AIM Rules and the Code and the information disclosed may not be the same as that which would have been disclosed if this Announcement had been prepared in accordance with the laws of jurisdictions outside of England and Wales. Unless otherwise determined by IHLC or required by the Code, and permitted by applicable law and regulation, the Acquisition will not be made available directly or indirectly in, into or from a Restricted Jurisdiction where to do so would violate the laws in that jurisdiction and no person may vote in favour of the Acquisition by use of mail or any other means or instrumentality (including, without limitation, facsimile, email or other electronic transmission, telex or telephone) of interstate or foreign commerce of, or any facility of a national, state or other securities exchange of, any Restricted Jurisdiction.Copies of this Announcement and any formal documentation relating to the Acquisition will not be and must not be, directly or indirectly, mailed or otherwise forwarded, distributed or sent in, into or from any Restricted Jurisdiction or any jurisdiction where to do so would violate the laws of that jurisdiction and persons receiving such documents (including custodians, nominees and trustees) must not mail or otherwise forward, distribute or send them in, into or from any Restricted Jurisdiction. Doing so may render invalid any related purported vote in respect of the Acquisition.Additional information for US investorsThe Acquisition relates to the shares of a UK company and is being made by means of a scheme of arrangement provided for under the laws of England and Wales. A transaction effected by means of a scheme of arrangement is not subject to the proxy solicitation or tender offer rules under the Exchange Act and is exempt from the registration requirements of the Securities Act. Accordingly, the Acquisition will be subject to disclosure requirements and practices applicable in the UK and to schemes of arrangement under the laws of England and Wales, which are different from the disclosure and other requirements of a US tender offer and US Federal securities laws. Neither the SEC, nor any securities commission of any state of the United States, has approved the Acquisition, passed upon the fairness of the Acquisition or passed upon the adequacy or accuracy of this document. Any representation to the contrary is a criminal offence in the United States.Financial information relating to Elegant included in this Announcement and the Scheme Document has been or will have been prepared in accordance with accounting standards applicable in the United Kingdom that may not be comparable to financial information of US companies or companies whose financial statements are prepared in accordance with generally accepted accounting principles in the United States.It may be difficult for US holders of Elegant Shares to enforce their rights and any claims they may have arising under US Federal securities laws in connection with the Acquisition, since Elegant is organised under the laws of a country other than the United States, and some or all of its officers and directors may be residents of countries other than the United States, and most of the assets of Elegant are located outside of the United States. US holders of Elegant Shares may not be able to sue a non-US company or its officers or directors in a non-US court for violations of US Federal securities laws. Further, it may be difficult to compel a non-US company and its affiliates to subject themselves to a US court's jurisdiction or judgment.The Acquisition may, in the circumstances provided for in this Announcement, instead be carried out by way of a Takeover Offer under the laws of England and Wales. If IHLC exercises, with the consent of the Takeover Panel, its right to implement the Acquisition by way of a Takeover Offer, such Takeover Offer will be made in compliance with applicable US tender offer and US Federal securities laws and regulations, including the exemptions therefrom. In accordance with normal UK practice, IHLC or its nominees, or its brokers (acting as agents), may, from time to time, make certain purchases of, or arrangements to purchase, Elegant Shares outside of the United States, other than pursuant to the Acquisition, until the date on which the Acquisition becomes effective, lapses or is otherwise withdrawn. These purchases may occur either in the open market at prevailing prices or in private transactions at negotiated prices. Any information about such purchases will be disclosed, as required in the UK, will be reported to a Regulatory Information Service and will be available on the London Stock Exchange website at www.londonstockexchange.com.Disclosure requirements of the CodeUnder Rule 8.3(a) of the Code, any person who is interested in 1 per cent. or more of any class of relevant securities of an offeree company or of any securities exchange offeror (being any offeror other than an offeror in respect of which it has been announced that its offer is, or is likely to be, solely in cash) must make an Opening Position Disclosure following the commencement of the Offer Period and, if later, following the announcement in which any securities exchange offeror is first identified. An Opening Position Disclosure must contain details of the person's interests and short positions in, and rights to subscribe for, any relevant securities of each of: (i) the offeree company and (ii) any securities exchange offeror(s). An Opening Position Disclosure by a person to whom Rule 8.3(a) applies must be made by no later than 3.30 p.m. (London time) on the 10th Business Day following the commencement of the Offer Period and, if appropriate, by no later than 3.30 p.m. (London time) on the 10th Business Day following the announcement in which any securities exchange offeror is first identified. Relevant persons who deal in the relevant securities of the offeree company or of a securities exchange offeror prior to the deadline for making an Opening Position Disclosure must instead make a Dealing Disclosure.Under Rule 8.3(b) of the Code, any person who is, or becomes, interested in 1 per cent. or more of any class of relevant securities of the offeree company or of any securities exchange offeror must make a Dealing Disclosure if the person deals in any relevant securities of the offeree company or of any securities exchange offeror. A Dealing Disclosure must contain details of the dealing concerned and of the person's interests and short positions in, and rights to subscribe for, any relevant securities of each of: (i) the offeree company and (ii) any securities exchange offeror, save to the extent that these details have previously been disclosed under Rule 8. A Dealing Disclosure by a person to whom Rule 8.3(b) applies must be made by no later than 3.30 p.m. (London time) on the Business Day following the date of the relevant dealing.If two or more persons act together pursuant to an agreement or understanding, whether formal or informal, to acquire or control an interest in relevant securities of an offeree company or a securities exchange offeror, they will be deemed to be a single person for the purpose of Rule 8.3.Opening Position Disclosures must also be made by the offeree company and by any offeror, and Dealing Disclosures must also be made by the offeree company, by any offeror and by any persons acting in concert with any of them (see Rules 8.1, 8.2 and 8.4).Details of the offeree and offeror companies in respect of whose relevant securities Opening Position Disclosures and Dealing Disclosures must be made can be found in the Disclosure Table on the Takeover Panel's website at www.thetakeoverpanel.org.uk, including details of the number of relevant securities in issue, when the Offer Period commenced and when any offeror was first identified. You should contact the Takeover Panel's Market Surveillance Unit on +44 (0)20 7638 0129 if you are in any doubt as to whether you are required to make an Opening Position Disclosure or a Dealing Disclosure.Publication on website and availability of hard copiesIn accordance with Rule 26.1 of the Code, a copy of this announcement will be made available (subject to certain restrictions relating to persons resident in Restricted Jurisdictions), free of charge, on Elegant's website https://www.eleganthotelsgroup.com/investor-information/regulatory-news by no later than 12:00 noon on the Business Day following the date of this Announcement. For the avoidance of doubt, neither the contents of such website nor the content of any other website accessible from hyperlinks on such website is incorporated into, or forms part of, this Announcement.In accordance with Rule 30.3 of the Code, a person so entitled may request a hard copy of this Announcement, free of charge, by contacting Link Asset Services Limited on 0371 664 0321 (from within the UK) or +44 (0)371 664 0321 (from outside the UK) or, in writing, at Link Asset Services, PXS, The Registry, 34 Beckenham Road, Kent, BR3 4TU. A hard copy of this Announcement will not be sent unless so requested. A person so entitled may also request that all future documents, announcements and information to be sent to them in relation to the Acquisition should be in hard copy form.Information relating to Elegant ShareholdersPlease be aware that addresses, electronic addresses and certain information provided by Elegant Shareholders, persons with information rights and other relevant persons for the receipt of communications from Elegant may be provided to IHLC during the Offer Period as required under section 4 of Appendix 4 of the Code.HelplineA shareholder helpline is available for Elegant Shareholders. If you have any questions about the Scheme Document, the Court Meeting, or the General Meeting, or how to complete the Forms of Proxy, please call Link Asset Services on +44 (0) 371 664 0321. Calls are charged at the standard geographical rate and will vary by provider. Calls to this number from outside the UK will be charged at the applicable international rate. Link Asset Services is open from 9.00 a.m. to 5.30 p.m., Monday to Friday, excluding public holidays in England and Wales.Please note that Link Asset Services cannot provide comments on the merits of the Scheme or provide any financial, legal or tax advice and calls may be recorded and monitored for security and training purposes.Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world.  The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG).  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com.  In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-completes-acquisition-of-elegant-hotels-group-300971328.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "The Luxury Collection Unveils Debut Property in the Seychelles",
        "subtitle": "North Island Joins The Luxury Collection as the Portfolio's First Private Island Destination",
        "date": "Dec 5, 2019 10:00AM EST",
        "content": "NEW YORK, Dec. 5, 2019 /PRNewswire/ -- The Luxury Collection today announced the arrival of North Island, Seychelles into their portfolio of world-renowned hotels and resorts. With just 11 villas, Africa's most exclusive private island is located 30 kilometres from the mainland and is accessible by a scenic helicopter flight or an hour boat ride, giving guests an immediate sense of escapism. Following its history as a coconut plantation, the granitic island is now a sanctuary for endangered species; luminous beaches and clear blue seas welcome nesting sea turtles, and the Palm forests are home to giant Aldabra tortoises and rare Seychelles white-eye birds. The island has been expertly designed and with pioneering conservation programs, offers the highest standards of hospitality, earning them status as an award-winning sustainable travel destination. With a mission to demonstrate that luxury with a conscience can co-exist, sustainability lies at the heart of North Island's philosophy and will be further embraced and supported with The Luxury Collection. The operational responsibility of the resort will remain with ASMALLWORLD, the world's leading travel & lifestyle community.  \"North Island has always skilfully combined a sustainable and environmentally conscious management philosophy with the ambition to provide a truly immersive, barefoot-luxury experience. Whilst maintaining our identity and ethos, our work with The Luxury Collection will allow us to maximise our awareness in our continued efforts in pioneering sustainable luxury travel.\" – Jan Luescher, CEO of ASMALLWORLDEleven private guest and family villas line the island; each villa has been created using local materials harvested during the island's rehabilitation process, expertly balancing luxury and simplicity. An haute-couture Robinson Crusoe aesthetic has been applied through interiors celebrating the sheer indulgence of volume and space.\"North Island is one of the most rare and luxurious destinations in the world, making it a natural fit for The Luxury Collection and our global explorers who seek authentic experiences and connections to both pristine nature and elevated personalization,\" said Anthony Ingham, Global Brand Leader, The Luxury Collection. \"This is the first private island within The Luxury Collection portfolio, and we're delighted to be expanding our footprint of captivating destinations with storied pasts and protected futures.\"The island not only offers a calming refuge from the modern world, but also an invigorating, refreshing getaway connected to the island's natural beauty. Aquatic explorers can take part in snorkeling, diving, fishing, sunset cruises, kayaking, paddle boarding and surfing. Bespoke guided excursions for those looking to explore the granite peaks or coral reefs are also available. Whilst on land, forest trails can be explored by foot, bicycle or private buggy, or guests can simply relax on one of the island's four pristine beaches located at each end of the compass. The island is also the ultimate playground for families and children, with a Beach Buddy program tailormade to interests and hobbies. Parents are invited to take part, or can find their own relaxation whilst children remain supervised.  As part of a new culinary concept, Michelin-Star Chef Akira Back, brings his fine dining concept to the Piazza at North Island. The various dining venues lend themselves to a range of outstanding epicurean experiences with menus changing daily according to the latest island harvest. The Piazza is situated on the ocean front and offers candlelit, private dining utilizing the freshest ingredients from both land and sea. The more relaxed Sunset Beach Bar offers tapas and cocktails during sunset. In-villa dining centers on a comfort food menu featuring local Creole curries or classic dishes, complemented by a generously stocked villa pantry.The North Island Spa is dwarfed by giant granite peaks, enjoys an open sea breeze and overlooks turquoise waters. Guests are invited to the spa on arrival where they are immediately immersed in 'island life' with each tailor-made treatment starting with a 'barefoot ritual'. A private consultation to create a bespoke spa experience is then formulated as part of a holistic journey of visual and textural contrasts, arousing the senses and rejuvenating mind, body and soul.With 2020 rates from US$6000 per night, North Island offers an inimitable experience that seeks to offer a contrasted way of life; rough and smooth, old and new, wet and dry, casual and refined, where footprints are the only evidence on the island's vast, untouched beaches.For more information visit https://www.marriott.com/hotels/travel/sezlc-north-island-a-luxury-collection-resort-seychelles/About The Luxury Collection® Hotels & ResortsThe Luxury Collection®, part of Marriott International, Inc., is comprised of world-renowned hotels and resorts offering unique, authentic experiences that evoke lasting, treasured memories. For the global explorer, The Luxury Collection offers a gateway to the world's most exciting and desirable destinations. Each hotel and resort is a unique and cherished expression of its location; a portal to the destination's indigenous charms and treasures. Originated in 1906 under the CIGA® brand as a collection of Europe's most celebrated and iconic properties, today The Luxury Collection brand is a glittering ensemble, recently surpassing 119 of the world's finest hotels and resorts in more than 30 countries and territories. All of these hotels, many of them centuries old, are internationally recognized as being among the world's finest. For more information and new openings, visit theluxurycollection.com or follow Twitter, Instagram and Facebook. The Luxury Collection is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enrol for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG).  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.About ASMALLWORLD ASMALLWORLD is the world's leading travel & lifestyle community, focusing on experiences: the modern-day definition of luxury. Centred around the ASMALLWORLD social network, the company operates a digital travel & lifestyle ecosystem which enables and inspires members to make new connections, travel better, and experience more. Members of the ASMALLWORLD social network connect through our app and website, where they can meet other members, engage in online discussions, receive travel and lifestyle inspiration, and enjoy a wealth of travel privileges. Members also meet in person at over 1'000 global ASMALLWORLD events every year, ranging from casual get-togethers in major cities around the world, access to exclusive launches, shows, galas, soirees, exhibitions, major global sporting events, and larger flagship weekend experiences hosted in iconic destinations such as Saint-Tropez, Marbella, and Gstaad. ASMALLWORLD, through its hotel management company ASMALLWORLD Hospitality, also manages the iconic North Island resort in the Seychelles, one of the world's most prestigious luxury resorts. View original content to download multimedia:http://www.prnewswire.com/news-releases/the-luxury-collection-unveils-debut-property-in-the-seychelles-300969370.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International Expected To Debut More Than 30 Luxury Hotels In Established And Emerging Global Hotspots In 2020",
        "subtitle": "With Planned Openings from Tokyo to Mexico City and Reykjavik to Melbourne, Marriott International Continues to Create Enriching Experiences Through Its Portfolio of Distinct Luxury Brands",
        "date": "Dec 4, 2019 1:30PM EST",
        "content": "BETHESDA, Md., Dec. 4, 2019 /PRNewswire/ -- Marriott International, Inc. (NASDAQ: MAR) today announced it is projecting to open more than 30 luxury properties in 2020 as the company focuses on creating the future of high-end travel through its portfolio of distinct luxury brands. With the world-renowned hospitality hallmarks of The Ritz-Carlton, Ritz-Carlton Reserve, St. Regis Hotels & Resorts, W Hotels, The Luxury Collection, EDITION, JW Marriott and Bvlgari, Marriott International uses the global perspective gained from its boundless network of more than 420 landmark hotels and resorts in nearly 65 countries and territories to provide an unmatched variety of luxury experiences. From the world's most established destinations to the ultimate undiscovered gems, Marriott International has more than 185 luxury properties in its signed development pipeline that could add more than 15 new countries and territories to the company's luxury portfolio, from Iceland to Montenegro and the Philippines. \"Celebrating the distinct nature and individuality of our luxury brands, Marriott International offers a diverse variety of nuanced brand experiences that speak to the needs of the modern luxury traveler,\" said Tina Edmundson, Global Brand Officer and Luxury Portfolio Leader, Marriott International. \"Across our luxury brands portfolio, we will continue to incubate innovation and apply fresh thinking, both at the brand level and across our individual hotels, as we seek to be future forward, push boundaries, and continue to raise the bar by creating new, unexpected, and enriching guest experiences.\"\"Our plan to open more than 30 luxury properties in 2020 – an average of about three exciting new hotels per month – speaks to the remarkable momentum that brands such as St. Regis, The Ritz-Carlton and EDITION have with affluent travelers, our Marriott Bonvoy members and hotel developers around the world,\" said Tony Capuano, EVP and Global Chief Development Officer, Marriott International. \"Each year, our luxury portfolio continues to grow in both quality and quantity in strategic destinations around the world.\"Transformative Travel Gives Rise to The Purposeful Luxurian In looking at the future of luxury hospitality, Marriott International collaborated with a team of trend forecasters at The Future Laboratory to better understand the attitudinal shifts that are creating a new genre of travelers. Edmundson continued: \"The concept of transformative travel – travel motivated and defined by a shift in perspective, self-reflection and development – has become more pronounced and it has given rise to The Purposeful Luxurian, a new breed of traveler that is more progressive, proactive, and looking to affect positive change. This new global explorer views travel as a way to improve physical and mental wellbeing, as well as a means to do good.\" With its scale and breadth of distribution, Marriott International is on the frontlines of the evolving global luxury economy, elevating its approach and inviting globally minded travelers to look at the world through a new lens. \"We are defining the future of luxury travel by creating the real, rare and personal experiences this new Purposeful Luxurian craves,\" said Edmundson. The Ritz-Carlton Elevates Luxury Through Legendary Service Known for leaving indelible marks and creating memories that last a lifetime, The Ritz-Carlton continues to set the standard for luxury. The iconic luxury brand recently celebrated the opening of its 100th property with the debut of The Ritz-Carlton, Perth and expanded the Ritz-Carlton Reserve portfolio to four exceptional properties with the opening of Zadún, a Ritz-Carlton Reserve in Los Cabos, Mexico. In the coming year, the brand is expected to bring its legendary service to Morocco for the first time, with the planned opening of The Ritz-Carlton Rabat, Dar es Salam in the country's dynamic capital. The Ritz-Carlton, Nikko is slated to expand the brand's footprint in Japan, while a highly anticipated property in Mexico City is expected to give guests a unique way to experience the Mexican capital. Overlooking Camelback Mountain in Scottsdale, Arizona, The Ritz-Carlton, Paradise Valley is slated to grow the brand's resort portfolio, while the brand also anticipates an opening in Nanjing, China, expects to see the completion of a major renovation of The Ritz-Carlton, South Beach, and continues to work towards the inaugural voyage of The Ritz-Carlton Yacht Collection expected in June 2020.   St. Regis Debuts the Newest Best Addresses in Extraordinary Destinations Offering modern glamour and sophisticated design, the St. Regis brand recently grew its footprint in Europe with the opening of The St. Regis Venice, boasting a magnificent outdoor garden and one of the most coveted locations along the city's famed Grand Canal. Currently offering 45 hotels in more than 20 countries and territories, the brand in the year ahead expects to introduce St. Regis to Cairo, a destination that has long allured travelers with its enthralling history, and which is quickly reclaiming its place as a global hotspot. Additionally, St. Regis expects to expand its resort portfolio with the anticipated opening of The St. Regis Kanai Resort in Riviera Maya, Mexico. The St. Regis Dubai, The Palm is also slated to open in 2020, bringing highly bespoke service and beloved signature rituals to the most populous city in the United Arab Emirates.Lux Rebel W Hotels Turns Traditional Luxury on its Head This year, W Hotels brought its boundary-breaking approach, bold design and innovative programming to destinations including Dubai, Abu Dhabi, Muscat, Ibiza and Aspen, the brand's first alpine destination in the United States. Multi-million-dollar renovations by owners are underway or completed at more than half the brand's properties in North America, including W Washington D. C. and W San Francisco. In addition, the company recently announced plans to transform W New York – Union Square into a cutting-edge W Hotels showcase, advancing a larger strategy to redefine and reinvigorate the W portfolio in North America. Also underway is the exciting addition of W Nashville to the brand's growing portfolio. The brand continues to trailblaze its way around the globe with 2020 expected openings in Philadelphia, Toronto, Chengdu, and Melbourne. Offering the insider track wherever the iconic W sign lands, the brand is also slated to debut in Italy with the planned openings of W Milan and W Rome, giving locals and visitors alike a distinctly W take on \"la dolce vita.\"  EDITION Matches Sophisticated Style With Global Growth In 2019, the EDITION brand made global news with the debuts of The Times Square EDITION in New York and The West Hollywood EDITION in Los Angeles, proving sustained high demand for its curated mix of modern design and service. Created through a collaboration between boutique hotel creator and innovator Ian Schrager and Marriott International, the lifestyle brand is slated to bring its distinct point of view to the in-demand destination of Reykjavik in 2020. Additionally, with 10 hotels in six countries and territories, the rapidly growing EDITION brand is expected to bring its sophisticated style to the global hotspots of Tokyo and Dubai. The Luxury Collection Continues on its Quest as the Destination Authority With a rapidly growing ensemble of 114 hotels in more than 30 countries and territories around the world, The Luxury Collection takes guests on journeys to the world's most captivating places. In 2019, the brand celebrated the opening of North Island, Seychelles, the portfolio's first private island destination, and welcomed properties in Cyprus, Nanning, Buckinghamshire, Kolkata and Çeşme. Looking to the year ahead, The Luxury Collection anticipates openings in coveted locations spanning the globe, including Nashville and Budapest, Hungary, as well as Hobart, Australia – a destination that signals the future of luxury travel. JW Marriott Inspires Guests to be Mindful and Present through Uplifting ExperiencesJW Marriott offers warm and intentional luxury experiences at nearly 90 properties around the world, including the recent, highly anticipated debut of JW Marriott Maldives Resort & Spa. Inspired by the principles of mindfulness, JW Marriott is a haven designed to let guests focus on feeling whole – present in mind, nourished in body and revitalized in spirit. Expected to reach more than 115 hotels by 2022, the year 2020 is slated to be a period of rapid growth for the brand, with planned U.S. openings in Savannah, Orlando and Anaheim, in addition to global destinations ranging from Istanbul and Danang, Vietnam, to Nara, Japan, Muscat, Oman and Monterrey, Mexico.About Marriott International Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world.  The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG).  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.Note on Forward-Looking Statements: This news release contains \"forward-looking statements\" within the meaning of federal securities laws, including the number of properties the company may add in the future, the number of property renovations planned or underway and similar statements concerning possible future events or expectations that are not historical facts.  We caution you that these statements are not guarantees of future performance and are subject to a number of risks and uncertainties, including changes in market conditions; changes in global and regional economies; supply and demand changes for hotel rooms; competitive conditions in the lodging industry; relationships with clients and property owners; the availability of capital to finance  growth and refurbishment; and other risk factors that the company identifies in its most recent annual report on Form 10-K or quarterly report on Form 10-Q; any of which could cause actual results to differ materially from the expectations we express or imply here.  We make these statements as of the date of this press release, and we assume no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-expected-to-debut-more-than-30-luxury-hotels-in-established-and-emerging-global-hotspots-in-2020-300969347.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Marriott International CFO To Speak At Barclays Gaming, Lodging, Leisure, Restaurant And Food Retail Conference December 4; Remarks To Be Webcast",
        "subtitle": "",
        "date": "Dec 2, 2019 12:04PM EST",
        "content": "BETHESDA, Md., Dec. 2, 2019 /PRNewswire/ -- Leeny Oberg, executive vice president and chief financial officer at Marriott International, Inc. (NASDAQ:MAR), will speak at the Barclays 2019 Gaming, Lodging, Leisure, Restaurant and Food Retail Conference, to be held on Wednesday, December 4.  Ms. Oberg's remarks will be at approximately 3:00 p.m., Eastern Time, and will be webcast live.To access the webcast, please go to http://www.marriott.com/investor, and then click on the link to the \"Barclays Gaming and Lodging Conference\" under \"Recent & Upcoming Events.\" The webcast will be available until March 1, 2020 at the same site.About Marriott International, Inc.Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG). For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.IRPR#1 View original content to download multimedia:http://www.prnewswire.com/news-releases/marriott-international-cfo-to-speak-at-barclays-gaming-lodging-leisure-restaurant-and-food-retail-conference-december-4-remarks-to-be-webcast-300967494.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Hotel Goldener Hirsch, A Luxury Collection Hotel, Salzburg Completes Full-Scale Restoration",
        "subtitle": "Redesign of the 15th Century Storied Guesthouse Blends Salzburg's Artisanal History with Modern Amenities",
        "date": "Dec 2, 2019 9:00AM EST",
        "content": "NEW YORK, Dec. 2, 2019 /PRNewswire/ -- Hotel Goldener Hirsch, a Luxury Collection Hotel, Salzburg today announced the culmination of a full-scale renovation. The completion ushers in a new era of luxury for Salzburg's most storied hotel, which has stood on the city's historic Getreidegasse since 1407. An extensive restoration of all seventy guestrooms and suites was unveiled, along with the hotel's celebrated common areas which houses its' 612-year-old antique collection. Designed with the intention of remaining true to the hotel's country house style, guests can now enjoy the authenticity of historic Salzburg with a subtle modernity.\"With a legacy of more than six centuries of exceptional service, the restoration of Hotel Goldener Hirsch, a Luxury Collection Hotel, Salzburg brings this hospitality icon into the modern day while celebrating its history and heritage,\" said Jenni Benzaquen, Vice President, Luxury Brands – Europe, Marriott International. \"The meticulous renovation of this storied work of art showcases the hotel's individuality while allowing the legendary service and contemporary epicurean offerings to shine through.\"Hotel Goldener Hirsch has long been heralded as an icon of Salzburg, showcasing the very best Austrian hospitality and charm. Located just steps from Mozart's birthplace, Hotel Goldener Hirsch has stood as a cultural landmark from its inception. Today, in the property's famed lobby, contemporary leather accents are complemented by ancient arches and historic artefacts, such as the hand-carved reception desk and an heirloom wooden key case.The hotel's sixty-four guestrooms and six suites have long been characterized by the building's unique architecture, adding a sense of individuality to each space. The renovation however has seamlessly balanced old with new. The solid wood flooring is offset by a palette of cornflower blue and antique white whilst traditional, hand-printed fabrics are used in rugs, curtains and cushion covers, all produced by local designer, Jordis. Guests will find the 15th century guesthouse reimagined with every modern convenience and latest technology integrated seamlessly into each living space. The en-suite bathrooms are generous spaces where deep marble baths and heritage bronze fittings meet rainfall showers and porcelain fixtures.Reimagined Gastronomic Experiences The multiple award-winning Restaurant Goldener Hirsch is a cornerstone of Salzburg's culinary legacy. With its vaulted ceiling and crest-embossed tableware, the restaurant has been fitted with a new state-of-the-art kitchen designed by Lohberger, as well as large reception area that is accessible to guests from both Getreidegasse and Karajanplatz. Executive Chef Martin Bednarik blends epicurean history with contemporary fine dining, offering a unique atmosphere for a discerning community of gourmands. The new menu has been given a modern Austrian twist, made with regional ingredients via avant-garde cooking techniques. The eminent Goldener Hirsch Bar has also been redesigned with contemporary bar furniture and luxury countertops, but the inimitable atmosphere remains. Guests can enjoy the hotel's signature cocktail, Susanne, as well as an extensive selection of fine Austrian wines in the famed inner courtyard.Herzl, with its wood-lined interior and flagstone flooring, is beloved by locals and visitors alike for its homespun, Austrian recipes in an informal setting. The restaurant's low ceilings and rustic wood-panelled walls create an atmosphere reminiscent of the bohemian times enjoyed by its prestigious past patrons. The importance of fresh, seasonal and regional produce is paramount for both restaurants on the property.The culinary team at Hotel Goldener Hirsch, a Luxury Collection Hotel, Salzburg, offer unforgettable dining experiences to both resident and non-resident guests. The opportunities for Epicurean Moments range from unforgettable cooking lessons with the Executive Chef in the hotel's kitchen, to bespoke occasions in the city's most exceptional venues and private residences. A History of Gatherings A distinguished backdrop for gatherings and celebrations, the hotel's storied reputation as an affable host is unsurpassed. Five meeting rooms range in size, from the 55 square metre Pink Salon, to the more intimate Green Salon. Intimate dinners may be hosted in Wine Cabinet, the new private dining room where exceptional vintage pieces line the walls. Larger celebrations are held for up to 100 guests in the Hunting Salon or the Library. For more information or to make a reservation, please visit www.GoldenerHirsch.com.About Hotel Goldener Hirsch, a Luxury Collection Hotel, Salzburg Hotel Goldener Hirsch, a Luxury Collection Hotel, Salzburg is an urban oasis located in the centre of the hustle and bustle of Mozart's city. The historic boutique hotel brings to life the romantic magic of the fifteenth century, enriched by a modern approach to personalised service. Salzburg's most storied hotel has stood on the city's historic Getreidegasse since 1407, and offers sixty-four guestrooms and six suites, each individually reflecting the country house style indigenous to Salzburg. Guests will have no shortage of dining options, with the award-winning Restaurant Goldener Hirsch, the locally beloved Herzl Restaurant, and the eminent Goldener Hirsch Bar.About The Luxury Collection® Hotels & Resorts The Luxury Collection®, part of Marriott International, Inc., is comprised of world-renowned hotels and resorts offering unique, authentic experiences that evoke lasting, treasured memories. For the global explorer, The Luxury Collection offers a gateway to the world's most exciting and desirable destinations. Each hotel and resort is a unique and cherished expression of its location; a portal to the destination's indigenous charms and treasures. Originated in 1906 under the CIGA® brand as a collection of Europe's most celebrated and iconic properties, today The Luxury Collection brand is a glittering ensemble, recently surpassing 119 of the world's finest hotels and resorts in more than 30 countries and territories. All of these hotels, many of them centuries old, are internationally recognized as being among the world's finest. For more information and new openings, visit theluxurycollection.com or follow Twitter, Instagram and Facebook. The Luxury Collection is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enrol for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Marriott International Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG).  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram. View original content to download multimedia:http://www.prnewswire.com/news-releases/hotel-goldener-hirsch-a-luxury-collection-hotel-salzburg-completes-full-scale-restoration-300967361.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Rev Up! W Hotels Arrives In The UAE Capital With W Abu Dhabi - Yas Island",
        "subtitle": "Opening Marks the Only Hotel in the World to be Located on a Grand Prix Racetrack",
        "date": "Nov 21, 2019 9:00AM EST",
        "content": " ABU DHABI, United Arab Emirates, Nov. 21, 2019 /PRNewswire/ -- Buckle up… W Hotels Worldwide, part of Marriott International Inc., today announced the highly anticipated debut of the W brand in the UAE capital with the opening of W Abu Dhabi – Yas Island. Located in the heart of Abu Dhabi's bustling entertainment epicenter, the hotel is the brand's second W Hotel to open this year in the United Arab Emirates after W Dubai – The Palm, and has the bragging rights to be the only hotel in the world located atop a Grand Prix racetrack. Set to galvanize the island with its innovative design and pulsating energy, this architectural marvel sits between the racetrack and local marina.  W Abu Dhabi – Yas Island is surrounded by iconic landmarks, located just 15-minutes from Abu Dhabi International Airport at the doorstep of the famed Yas Marina Circuit and Yas Marina. The hotel is also in close proximity to Ferrari World, Warner Brothers Studios and Abu Dhabi's biggest shopping center, the Yas Mall. W Abu Dhabi – Yas Island is set to provide front row seats to the glitz and glamour of the vibrant metropolis, be it on or off the track.\"W Hotels seeks dynamic destinations that are multi-dimensional and ever-evolving, and Abu Dhabi, with its cultural DNA that honors a millennium of tradition while boldly embracing what's new and next, is an ideal fit for the brand,\" said Anthony Ingham, Global Brand Leader, W Hotels Worldwide. \"The arrival of W in Abu Dhabi marks a new chapter for both the brand and the capital. While paying tribute to the essence and spirit of the city, the hotel creates a modern, energetic and stylish escape unlike anything else.\" Locally LegitW Abu Dhabi – Yas Island reveals the best of the destination's history, heritage and culture while infusing elements of its modern future. From the barren desert to the burgeoning concrete metropolis, Abu Dhabi boasts one of the most unique and diverse landscapes, all celebrated by the hotel's tone-setting vibe. The design draws inspiration from traditional and artistic surroundings complementing the natural landscape of the Emirate. All architectural elements are influenced by symmetry, intricate detail, parallel beams and optical illusions, creating silhouettes and shades inspired by the region's natural lakes, wetlands, salt flats and fossilized sands and dunes – the hidden natural gems of the UAE.Guests are greeted by Bedouin-inspired tents, large columns and seating inspired by local mangroves. Custom-designed Welcome Desks mimic the form of oil droplets and jewel tone furnishings, depicting the colors of liquid gold, a distinctive historic trade in Abu Dhabi. Show-stopping Whatever/Whenever desks are canoe-shaped, a visual reference to the Abu Dhabi waterways and once the mode of movement across the city.  Rev UpFor an exhilarating experience, guests can ignite their senses and catch the action of the racetrack and all that the island has to offer as they live it up and bask in the Arabian sun. The hotel's vibrant 499 guest rooms and suites offer plush amenities and floor-to-ceiling windows with spectacular views of the Grand Prix racetrack or the Yas Marina. The EWOW Suite (the brand's over-the-top take on the traditional Presidential Suite), boasts 409 square meters (about 1,342 square feet) of ultimate luxury spread over two floors. Guests can soak it up in the suite's private lap pool, sauna and enjoy jaw-dropping, 180-degree views of Yas Island. WET The W brand's iconic poolside experience features the stunning scenery of the Yas Marina Circuit as guests  swim, sun and enjoy signature beverages while listening to live DJ performances. WET is sure to become the hottest place to cool off, take a dip and make a splash in the city. W Abu Dhabi – Yas Island will embody the brand's signature work hard, play hard philosophy, with FUEL-focused activities (fitness and wellness programming) including weekly workouts, healthy cuisine and amazing adventures. Sip & SavorW Abu Dhabi – Yas Island showcases eclectic dining with Garage, a one-of-a-kind a la carte food hub with a buzzing, botanical design driven by five unique mini concepts: Steam Table serving up noodles and dumplings, Nikkei House offering Peruvian/ Japanese cuisine, Mezza Bar focusing on Lebanese mezze, Meat Vault offering grilled cuts, and Tart Van which serves - as the name suggests - only scrumptious tarts.Guests can also step into \"Little Italy\" at Amici for an authentic Italian experience or take their taste buds on a flavor-filled journey of India at Angar. Killer views and bold beats await at W Lounge which follows the narrative of the hotel's multicultural B&F philosophy with a variety of drink stations that each focus on a signature beverage alongside a curated menu. With uncompromising entertainment at its core, guests and locals alike can expect high energy experiences with DJs and live music.Those who want full access to what's new and next in the capital city of the UAE can book a special opening offer November 2019 – February 2020. This includes a Wonderful room for two nights or more, buffet breakfast for two plus 250 AED ($68 USD) B&F credit to experience Garage. For more information, visit http://www.wabudhabiyasisland.com For press enquiries – Fiona Wishart, Senior Account Manager, fiona@z7communications.com About W Hotels WorldwideBorn from the bold attitude and 24/7 culture of New York City, W Hotels, part of Marriott International, Inc., has disrupted and redefined the hospitality scene for nearly two decades. Trailblazing its way around the globe, with more than 50 hotels, W is defying expectations and breaking the norms of traditional luxury wherever the iconic W sign lands. With a mission to fuel guests' lust for life, W ignites an obsessive desire to soak it in, live it up and hit repeat. The brand's provocative design, iconic Whatever/Whenever service and buzzing Living Rooms create an experience that is often copied but never matched. Innovative, inspiring and infectious, the brand's super-charged energy celebrates guests' endless appetite to discover what's new/next in each destination, to see more, feel more, go longer, stay later. For more information on W Hotels, visit whotels.com/theangle or follow us on Twitter, Instagram and Facebook. W Hotels Worldwide is proud to participate in Marriott Bonvoy, the new name of Marriott's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.About Marriott InternationalMarriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG).  For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram. View original content to download multimedia:http://www.prnewswire.com/news-releases/rev-up-w-hotels-arrives-in-the-uae-capital-with-w-abu-dhabi--yas-island-300962854.htmlSOURCE  Marriott International, Inc."
    },
    {
        "title": "Curaçao Marriott Beach Resort Reopens After Extensive Renovation",
        "subtitle": "Curaçao Marriott Beach Resort opens today with 336 newly designed rooms reflecting latest design thinking from Marriott Hotels, minutes from historic Willemstad",
        "date": "Nov 20, 2019 9:00AM EST",
        "content": "CURACAO, Curaçao, Nov. 20, 2019 /PRNewswire/ -- Tucked into the coast of Curaçao, Curaçao Marriott Beach Resort reopens today after undergoing a $40 million renovation financed by Piscamar Beach Resort B.V. Managed by Aimbridge Hospitality, the 336-room hotel is positioned on six acres of oceanfront real estate overlooking the Caribbean Sea. The redesigned space, renovated to represent the latest innovative design thinking from the Marriott Hotels brand, is set to become the ultimate Caribbean destination for the active traveler who enjoys diving and swimming, alongside relaxing and enjoying the island's famous tropical weather. \"As we continue to re-invent concepts and grow our portfolio across all product categories, we are grateful to be working with such an established and respected hospitality brand such as Marriott Hotels for a product of this caliber,\" says Rob Smith, Executive Vice President of Aimbridge Hospitality. \"Proud to see that our vision for Curaçao has finally come to fruition, we hope to continue this momentum with Marriott International in the Caribbean. With our consistent regional growth in markets such as Puerto Rico, St. Thomas and St. Croix, Curaçao was a natural next step in our expansion plans and we look forward to seeing the success of this crown jewel in the Antilles region.\"\"At Marriott Hotels, we strive to create spaces where our guests can feel their most inspired,\" says Manny Rappenecker, VP, Marriott Hotels. \"The reimagined Curaçao Marriott Beach Resort more than lives up to that promise – melding our signature clean design aesthetic with local touches inspired by the beautiful Caribbean surroundings to give guests the ultimate space to relax and recharge.\"DesignReflecting Marriott Hotels' ethos of creating inspirational spaces where guests can be their best selves, the design of the hotel is clean and contemporary with hints of Dutch naval and nautical inspiration throughout the property. This includes Dutch Colonial Architecture combined with Plantation-style elements – welcoming guests to an open-air modern lobby with incredible views of the turquoise Caribbean Sea. The color palette consists of soothing neutrals, accessorized with blues and turquoise to reflect the local Caribbean waters. Pops of orange and brown wood tones are woven throughout the property to mimic Earthy tones. Each guest room is equipped with private balconies, ocean or pool views, large flat-screen TVs, plush bedding and spa-grade bathrooms. Each room is adorned with artwork made from local recycled plastics.Culinary Award-winning Caribbean-born Chef Dino Jagtiani will be responsible for opening and refining all culinary experiences on property including a fine dining restaurant called C-Spice and multiple bars including a craft cocktail bar and pool bar. The C-Spice restaurant features Caribbean fare with hints of European and Latin American flavors. The restaurant will offer guests inside or outside dining adjacent to the courtyard that features a cigar lounge and bar with premium rums and spirits.Meetings Boasting 20,000 square feet of outdoor space, the resort also offers two ballrooms including the 5,000-square-foot Royal Ballroom and 3,000-square-foot Queens Ballroom. Surrounded by lush greenery, a botanical garden can be used for events in addition to a 10,000-square-foot oceanfront space set on the resort's white-sand beach.Amenities + Resort ProgrammingIdeally situated just minutes from the island's historic capital, the hotel has multiple amenities for guests to enjoy including an adult and family-friendly pool, a kids club and a walking path connected to the property. There is also a state-of-the-art gym with daily classes including yoga, Pilates, pool fitness and more. Guests can also take advantage of live entertainment in the lobby on weekends as well as the Reef Club which offers a private lounge setting with food and beverages.\"With an increase in the number of tourism arrivals from North America to Curaçao last year1, we see the demand rising for a top-notch hospitality experience on the island,\" Hal Davis, Director of Sales & Marketing at Curaçao Marriott Beach Resort. \"The reopening of the resort introduces a unique Dutch-Caribbean full-service resort experience, and we look forward to creating memorable moments for guests visiting the island for the first time.\"About Marriott HotelsWith over 570+ hotels and resorts in over 60 countries and territories around the world, Marriott Hotels is evolving travel through every aspect of the guest's stay, helping to relax, clear minds, stimulate new ideas and anticipate travelers' needs, leaving them inspired to reach their full potential. Boldly transforming itself for mobile and global travelers who blend work and play, Marriott leads the industry with innovations, including the Greatroom lobby and Mobile Guest Services that elevates style & design and technology. To learn more, visit www.MarriottHotels.com. Stay connected to Marriott Hotels on Facebook, @marriott on Twitter and @marriotthotels on Instagram. Marriott Hotels is proud to participate in Marriott Bonvoy, the new name of Marriott International's travel program replacing Marriott Rewards®, The Ritz- Carlton Rewards®, and Starwood Preferred Guest® (SPG). The program offers members an extraordinary portfolio of global brands, experiences on Marriott Bonvoy Moments and unparalleled benefits including earning points toward free hotel stays and nights toward Elite status recognition. To enroll for free or for more information about the program, visit MarriottBonvoy.marriott.com.Marriott International, Inc. (NASDAQ: MAR) is based in Bethesda, Maryland, USA, and encompasses a portfolio of more than 7,200 properties under 30 leading brands spanning 134 countries and territories. Marriott operates and franchises hotels and licenses vacation ownership resorts all around the world. The company now offers one travel program, Marriott Bonvoy™, replacing Marriott Rewards®, The Ritz-Carlton Rewards®, and Starwood Preferred Guest®(SPG). For more information, please visit our website at www.marriott.com, and for the latest company news, visit www.marriottnewscenter.com. In addition, connect with us on Facebook and @MarriottIntl on Twitter and Instagram.About Aimbridge HospitalityAimbridge Hospitality is the leading, global, third-party hotel management company operating branded full service, select service, luxury hotels, destination resorts, convention centers and lifestyle hotels. Aimbridge merged with Interstate Hotels & Resorts in 2019, and now represents a premium portfolio of more than 1,400 branded and independent properties in 49 states and 20 countries. Aimbridge is based in Plano, Texas and has additional corporate offices in Atlanta, Calgary, Chicago, Fargo, National Landing, Puerto Rico, San Clemente, Scottsdale and Toronto. Aimbridge's International Division, Interstate Hotels & Resorts, has supporting offices spread across Europe in Amsterdam, Birmingham, Glasgow and Moscow. For more information on Aimbridge Hospitality, please visit www.aimbridgehospitality.com and connect with Aimbridge on LinkedIn. View original content to download multimedia:http://www.prnewswire.com/news-releases/curacao-marriott-beach-resort-reopens-after-extensive-renovation-300961817.htmlSOURCE  Marriott International, Inc."
    }
]