[
    {
        "title": "Microchip Technology Provides Business Update for Fourth Quarter Fiscal 2020",
        "subtitle": "",
        "date": "Mar 2, 2020 4:10PM EST",
        "content": "CHANDLER, Ariz., March  02, 2020  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) – Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, is providing the following business update:As Microchip closely monitors the impact of the COVID-19 virus, our top priority remains the health and safety of our employees and their families.  We have implemented a strict policy on travel to and from affected regions and quarantine procedures for employees returning from such regions.  At this point, none of our over 18,000 employees or their family members have tested positive for COVID-19.On February 4, 2020, as part of our fourth quarter fiscal 2020 earnings call, we issued quarterly net sales guidance of up 2% to 9% sequentially, which was a wider than usual range, to reflect uncertainty related to the public health situation in China.  Our business in the Americas and Europe is trending towards our original expectations.  However, we see very weak demand in Asia, especially in China, driven by the COVID-19 fears, and customers returning to work at a slower pace than anticipated.  Our supply chain is also returning to normal operations at a slower pace than we anticipated when we last spoke publicly about this at the Goldman Sachs Technology and Internet Conference on February 12, 2020.  Based on our current assessment, we expect our net sales for the fourth quarter of fiscal 2020 to be about flat sequentially.  We are not able to provide updated earnings per share (EPS) guidance at the current time and we are withdrawing our prior EPS guidance.As conditions evolve, Microchip will continue to act to help ensure the health and safety of our employees worldwide during this difficult period.  Our employees in China, Hong Kong, Korea and other deeply affected countries are working from home and going to great lengths to keep Microchip’s business running and serving our customers.  We are grateful for the effort of our worldwide employees and their families.Microchip will host a conference call today, March 2, 2020 at 5:00 p.m. (Eastern Time) to discuss this release.  This call will be simulcast over the Internet at www.microchip.com.  A telephonic replay of the conference call will be available at approximately 8:00 p.m. (Eastern Time) on March 2, 2020 and will remain available until 5:00 p.m. (Eastern Time) on March 16, 2020.  Interested parties may listen to the replay by dialing 719-457-0820 and entering access code 2924389.Cautionary Statement:The statements in this release relating to our top priority remaining the health and safety of our employees and their families,  our business in the Americas and Europe trending towards our expectations, very weak demand in Asia, especially in China, driven by COVID-19 fears, customers returning to work at a slower pace than anticipated, our supply chain returning to normal operations at a slower pace than we anticipated, our expectations of net sales to be about flat sequentially flat in the fourth quarter of fiscal 2020, that we are not able to provide updated EPS guidance at the current time, that Microchip will continue to help ensure the health and safety of our employees worldwide, and that employees in deeply affected countries will work from home and go to great lengths to keep our business running and serving our customers are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These statements involve risks and uncertainties that could cause our actual results to differ materially, including, but not limited to: any continued economic uncertainty due to public health issues (including COVID-19), monetary policy, political, geopolitical, trade or other issues in the U.S. or internationally, any unexpected fluctuations or weakness in the U.S. and global economies (including China), changes in demand or market acceptance of our products and the products of our customers; our ability to successfully integrate the operations and employees, retain key employees and customers and otherwise realize the expected synergies and benefits of our acquisitions; the impact of current and future changes in U.S. corporate tax laws (including the Tax Cuts and Jobs Act of 2017), foreign currency effects on our business; the mix of inventory we hold and our ability to satisfy short-term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage and expand our production levels; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the impact of any future significant acquisitions that we may make; our ability to obtain a sufficient supply of wafers from third party wafer foundries and the cost of such wafers, the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi, our actual average stock price in the March 2020 quarter and the impact such price will have on our share count; fluctuations in our stock price and trading volume which could impact the number of shares we acquire under our share repurchase program and the timing of such repurchases; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns (including the Coronavirus) or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q.  You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip's website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made.  Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this March 2, 2020 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries."
    },
    {
        "title": "Microchip Technology to Provide Business Update on Fourth Quarter Fiscal 2020 on March 2, 2020",
        "subtitle": "",
        "date": "Feb 28, 2020 3:00PM EST",
        "content": "CHANDLER, Ariz., Feb.  28, 2020  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) -- Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today announced that it will provide a business update on its March 2020 quarter on Monday, March 2, 2020 after market close. This update will include a conference call and webcast that will begin at 5:00PM (Eastern). Conference call details will be made available on Monday morning and on our website at www.microchip.com/investors.Additionally, the company announced that it will not be attending any investor conferences for the remainder of the quarter, due to company travel restrictions associated with the Coronavirus. These conferences include the Morgan Stanley 2020 Technology, Media & Telecom Conference, the Raymond James 41st Annual Institutional Investor Conference, and the Susquehanna Financial Group Technology Conference.“The safety of our employees worldwide continues to remain paramount and we have taken precautionary steps to help ensure the health and safety of our employees and to control the impact on Microchip’s operations,” said Steve Sanghi, Microchip’s CEO. “We regret the necessary last-minute cancellation of our attendance at these events, and we intend for our business update on March 2, 2020 to be a helpful update on business conditions for investors and analysts.”Cautionary Statement:The statements in this release relating to the Coronavirus situation, that we have taken steps to help ensure the health and safety of our employees and control the impact of the Coronavirus on Microchip’s operations, are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties that could cause our actual results to differ materially, including, but not limited to: any continued economic uncertainty due to monetary policy, political, geopolitical, trade or other issues in the U.S. or internationally, any unexpected fluctuations or weakness in the U.S. and global economies (including China), changes in demand or market acceptance of our products and the products of our customers; our ability to successfully integrate the operations and employees, retain key employees and customers and otherwise realize the expected synergies and benefits of our acquisitions; the impact of current and future changes in U.S. corporate tax laws (including the Tax Cuts and Jobs Act of 2017), foreign currency effects on our business; the mix of inventory we hold and our ability to satisfy short-term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage and expand our production levels; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the impact of any future significant acquisitions that we may make; our ability to obtain a sufficient supply of wafers from third party wafer foundries and the cost of such wafers, the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi, our actual average stock price in the March 2020 quarter and the impact such price will have on our share count; fluctuations in our stock price and trading volume which could impact the number of shares we acquire under our share repurchase program and the timing of such repurchases; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns (including the Coronavirus) or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q. You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip's website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made. Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this February 28, 2020 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market. The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries.INVESTOR RELATIONS CONTACT:J. Eric Bjornholt – CFO........................................ (480) 792-7804"
    },
    {
        "title": "New PIC® MCU Family Moves Software Tasks to Hardware for Faster System Response",
        "subtitle": "",
        "date": "Feb 12, 2020 8:00AM EST",
        "content": "CHANDLER, Ariz., Feb.  12, 2020  (GLOBE NEWSWIRE) -- In microcontroller (MCU) based system design, software is often the bottleneck for both time to market and system performance. By offloading many software tasks to hardware, Microchip Technology Inc.’s (Nasdaq: MCHP) next generation PIC18-Q43 family helps developers bring higher performing solutions to market faster. The family’s combination of peripherals offers users greater versatility and simplicity when creating custom hardware-based functions with easy to use development tools. Configurable peripherals are smartly interconnected to allow near zero latency sharing of data, logic inputs or analog signals without additional code for improved system response. Ideal for a variety of real-time control and connected applications, including home appliances, security systems, motor and industrial control, lighting and Internet of Things (IoT), the PIC18-Q43 family helps reduce board space, Bill of Materials (BoM), overall costs and time to market.Core Independent Peripherals (CIPs) are peripherals that have been designed with additional capabilities to handle a variety of tasks without the need for intervention from the Central Processing Unit (CPU). With CIPs like timers, simplified Pulse Width Modulation (PWM) output, CLCs, Analog to Digital Converter with Computation (ADCC), multiple serial communications and more, the product family is designed to make it easy for developers to customize their specific design configuration. The CLC provides programmable logic that operates outside the speed limitations of software execution, providing customers with the ability to tailor such things as waveform generation, timing measurements and more. CLCs can be the \"glue\" logic to connect on-chip peripherals for hardware customization with unprecedented ease. Its core-independent communication interfaces, including UART, SPI and I2C, offer flexible, easy-to-use building blocks for developers looking to create a customized device, while the addition of multiple DMA channels and interrupt management accelerate real-time control with simplified software loops. With Microchip’s comprehensive development tool suite, users can quickly and easily generate application code and customize combinations of CIPs in a graphical user interface (GUI) environment. Additionally, the family operates up to 5V which increases noise immunity and enables customers to interface to a wide range of sensors.“The PIC18-Q43 family offers CIPs that enable many functions and even whole control loops to be realized in customizable on-chip hardware,” said Greg Robinson, associate vice president of marketing for Microchip’s 8-bit microcontroller business unit. “With the combination of flexible CIPs and high analog integration, users will significantly reduce development time and improve system performance by automating waveform control, timing and measurement operations and logic functions.”Development ToolsThe PIC18-Q43 family is supported by Microchip’s MPLAB® X IDE and MPLAB Xpress IDE development environments, and MPLAB Code Configurator (MCC) — a free software plug-in that provides a graphical interface to configure peripherals and functions specific to an application. It’s also supported by the PIC18F57Q43 Curiosity Nano board — a compact, cost-effective development board with programming and debugging capabilities. Pricing and AvailabilityThe PIC18-Q43 product family offers a range of memory sizes, packages and price points to match a wide range of application needs. All products are available for volume production and sampling in a variety of packages. Volume pricing begins at $0.64 each.For additional information, contact a Microchip sales representative, authorized worldwide distributor or visit Microchip’s website. To purchase products mentioned here, click to order now or contact a Microchip authorized distributor.ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo, the Microchip logo, MPLAB and PIC are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies."
    },
    {
        "title": "Microchip Technology to Present at the Goldman Sachs Technology and Internet Conference",
        "subtitle": "",
        "date": "Feb 11, 2020 4:10PM EST",
        "content": "CHANDLER, Ariz., Feb.  11, 2020  (GLOBE NEWSWIRE) -- (NASDAQ:MCHP) – Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, announced today that the Company will present at the Goldman Sachs Technology and Internet Conference on Wednesday, February 12, 2020, at 3:20 p.m. (Pacific Time).  Presenting for the Company will be Mr. Steve Sanghi, Chief Executive Officer.  A live webcast of the presentation will be made available by Goldman Sachs, and can be accessed on the Microchip website at www.microchip.com.Any forward looking statements made during the presentation are qualified in their entirety by the discussion of risks set forth in the Company's Securities and Exchange Commission filings.  Copies of SEC filings can be obtained for free at the SEC's website (www.sec.gov) or from commercial document retrieval services.Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries.INVESTOR RELATIONS CONTACT:Deborah Wussler ……… (480) 792-7373 "
    },
    {
        "title": "Microchip Technology Declares Quarterly Cash Dividend of 36.70 Cents Per Share",
        "subtitle": "",
        "date": "Feb 4, 2020 4:10PM EST",
        "content": "CHANDLER, Ariz., Feb.  04, 2020  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) – Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today announced that its Board of Directors has declared a quarterly cash dividend on its common stock of 36.70 cents per share.  The dividend is payable on March 6, 2020 to stockholders of record on February 21, 2020.  Microchip initiated quarterly cash dividend payments in the third quarter of fiscal year 2003 and has increased its dividend 62 times since its inception.“Microchip’s financial performance in the December 2019 quarter was excellent in the backdrop of an uncertain economic environment,” said Steve Sanghi, Chief Executive Officer.  “Our Board is pleased to declare an increase in our quarterly dividend to a record 36.70 cents per share, which continues to reflect our ongoing commitment to returning value to our stockholders.”Cautionary Statement:The statement contained in this release relating to our ongoing commitment to returning value to our stockholders is a forward-looking statement made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  This statement involves risks and uncertainties that could cause actual results to differ materially, including, but not limited to: actual cash flows generated from and used in the operation of our business; actual or projected levels of capital expenditures; our balance of cash and investments; changes in the tax rates that our stockholders pay on our dividends or other changes in U.S. tax laws including the Tax Cut and Jobs Act of 2017; our available borrowings under our credit agreement; the impact of any significant acquisitions we may make; our ability to realize the expected benefits of our acquisitions, changes in demand or market acceptance of our products and the products of our customers; the mix of inventory we hold and our ability to satisfy short- term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage our production levels; our ability to control the level of operating expenses relative to our level of revenues; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q.  You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip’s website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made.  Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this February 4, 2020 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.The Microchip logo and name are registered trademarks of Microchip Technology Incorporated.INVESTOR RELATIONS CONTACT:J. Eric Bjornholt – CFO    (480) 792-7804"
    },
    {
        "title": "Microchip Technology Announces Financial Results for Third Quarter of Fiscal Year 2020",
        "subtitle": "",
        "date": "Feb 4, 2020 4:10PM EST",
        "content": "CHANDLER, Ariz., Feb.  04, 2020  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) -- Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today reported results for the three months ended December 31, 2019 as summarized in the following table:        GAAP net sales for the third quarter of fiscal 2020 were $1.287 billion, down 6.4% from net sales of $1.375 billion in the prior year's third fiscal quarter.GAAP net income for the third quarter of fiscal 2020 was $311.1 million, or $1.20 per diluted share, up from GAAP net income of $49.2 million, or $0.20 per diluted share, in the prior year's third fiscal quarter.  For the third quarters of fiscal 2020 and fiscal 2019, GAAP net income was significantly adversely impacted by purchase accounting adjustments associated with our acquisitions.  In the third quarter of fiscal 2020, GAAP net income was significantly positively impacted by the tax benefit related to the intra-group transfer of certain intellectual property rights.Non-GAAP net income for the third quarter of fiscal 2020 was $340.8 million, or $1.32 per diluted share, down from non-GAAP net income of $381.8 million, or $1.56 per diluted share, in the prior year's third fiscal quarter.  For the third quarters of fiscal 2020 and fiscal 2019, our non-GAAP results exclude the effect of share-based compensation, expenses related to our acquisition activities (including intangible asset amortization, inventory valuation costs, severance and other restructuring costs, and legal and other general and administrative expenses associated with acquisitions including legal fees and expenses for litigation and investigations related to our Microsemi acquisition), IT security remediation costs, non-cash interest expense on our convertible debentures, losses on the settlement of debt, and gains and losses related to available-for-sale investments.  For the third quarters of fiscal 2020 and fiscal 2019, our non-GAAP income tax expense is presented based on projected cash taxes for the fiscal year, excluding transition tax payments under the Tax Cuts and Jobs Act.  A reconciliation of our non-GAAP and GAAP results is included in this press release.Prior to the fourth quarter of fiscal 2019, we reported non-GAAP net sales based on end-market demand, which excluded the effect of our distributors increasing or decreasing their inventory holdings.  Beginning with the fourth quarter of fiscal 2019, we changed the information included in our financial guidance and provide net sales guidance based on sell-in revenue recognition under the new GAAP standard.Microchip announced today that its Board of Directors has declared a record quarterly cash dividend on its common stock of 36.70 cents per share.  The quarterly dividend is payable on March 6, 2020 to stockholders of record on February 21, 2020.\"We experienced strong bookings activity throughout the December 2019 quarter and upwardly revised our quarterly financial guidance twice after our original guidance on November 5, 2019,\" said Steve Sanghi, Chief Executive Officer.  \"Our December 2019 quarterly net sales were near the high end of our most recent guidance from January 6, 2020 at $1.287 billion, which was down 3.76% sequentially.  Our non-GAAP gross margins were 61.5% and our non-GAAP operating margin were 35.1%, both of which were above the high-end of our most recent guidance range.  We delivered $1.32 of non-GAAP diluted earnings per share, which was also above the high-end of our most recent guidance.\"Mr. Sanghi added, \"End-market demand, which reflects sell-through activities in the distribution channel, was $36.1 million higher than GAAP (sell-in) revenue in the December 2019 quarter, the seventh consecutive quarter that end-market demand has exceeded sell-in revenue.  As a result, distribution inventory days declined during the quarter and are at very low levels.\"\"The end-market demand for our microcontroller business was down 1.1%, for our analog business was down 3.6% and for our FPGA business was flat compared to the September 2019 quarter.  Microcontrollers represented 53.6%, analog represented 28.1% and FPGA represented 6.9% of our end-market demand in the December quarter.  We continue to introduce a steady stream of new and innovative microcontroller, analog and FPGA solutions that we believe position us well for future growth,\" said Ganesh Moorthy, President and Chief Operating Officer.Mr. Moorthy added, \"While our bookings and backlog trends have not changed since our business update press release on January 6, the Coronavirus situation is rapidly evolving and most Chinese provinces have extended the Chinese New Year holidays in response to the spread of the virus. We have taken preventive measures to help ensure the safety of our employees and have completed a first pass assessment of our supply chain and currently believe our risk is low. However, it is too early to determine the impact to our customers as many of them are still not back from their holidays. We continue to actively monitor the progression of the Coronavirus events and plan to take additional actions as needed.\"Eric Bjornholt, Microchip's Chief Financial Officer, said, \"We paid down $257.0 million of total debt during the December quarter, reflecting a cumulative pay down of almost $2 billion over the past six quarters, as we have actively managed the working capital requirements for the business.  We will continue to use substantially all of our excess cash generation after dividends to reduce the amount of debt on our balance sheet as quickly as possible.\"Mr. Sanghi concluded, \"Our March quarter backlog is significantly higher than the December quarter backlog was at the same point in the quarter.  We are experiencing an increased level of customer requested expedited shipments and we are calling the December 2019 quarter as the bottom of the cycle for Microchip barring any negative developments on the US/China trade front, or the impact of Coronavirus .  Based on our analysis for our business and the current economic backdrop, we estimate our net sales in the March 2020 quarter to be up between 2% and 9% sequentially.  The midpoint of our guidance for the March 2020 quarter reflects what we believe our business can deliver assuming no extraordinary events.  However, the wider than normal guidance range is to help account for the uncertainty associated with the evolving Coronavirus situation.  We are still in the early days of how this situation is playing out.  We have no way to model how the rest of the quarter will play out for the Coronavirus situation, and what the consequent business impact may be, but we believe that our guidance range incorporates our best judgment for the possible scenarios.\"Microchip's Highlights for the Quarter Ended December 31, 2019:Fourth Quarter Fiscal Year 2020 Outlook:Beginning with the fiscal quarter ending March 31, 2019, we changed the information included in our financial guidance in response to comments from and discussions with the Staff of the Securities and Exchange Commission.  We are now providing net sales guidance based on sell-in revenue recognition under the new GAAP standard.  We are also providing guidance and reporting non-GAAP gross margin percentage, operating expense percentage, operating profit percentages and diluted earnings per share based on sell-in GAAP revenue.  We are also providing information on end-market demand so that investors will have information on the consumption in the marketplace of our products by our customers or our distributors.  We do not use end-market demand for any of our non-GAAP income statement calculations.  Please see \"Use of End-Market Demand Metric\" below for information on how we calculate end-market demand.The following statements are based on current expectations.  These statements are forward-looking, and actual results may differ materially.  We are not able to predict whether inventory at our distributors will increase or decrease and are therefore providing a range of GAAP net sales guidance.  In recent years, we have seen net inventory at our distributors increase or decrease by a significant amount in a single quarter.Use of End-Market Demand Metric:  End-market demand is the net dollar amount of our products, licensing revenue and other services delivered to our direct (non-distributor) customers and by our distributors to their customers.  We are able to calculate end-market demand based on information that our distributors provide us about their product shipments to their customers and inventory holdings.  The value of end-market demand from our distributors is calculated as the net transaction value of these shipments.  We believe that our end-market demand metric reflects true end-market demand based on when product is sold to direct customers or by our distributors to an end customer.Under the new GAAP revenue recognition standard, we are required to recognize revenue when control of the product changes from us to a customer or distributor.  We focus our sales and marketing efforts on creating demand for our products in the end markets we serve and not on moving inventory into our distribution network.  Therefore, the elements of our internal performance and executive and employee compensation metrics that are based on sales and operating results are measured using the value of the end-market demand for our products.  We use end-market demand for these purposes because we do not believe that the underlying value of our business benefits from increases in the value of inventory that is held in the supply chain.  As many of our products are designed into customer applications with relatively long lives, such value is only realized when the end-market demand is created and the supply chain sells the inventory to the end customer.  We believe the use of end-market demand is also important to investors and users of our financial statements as it reflects the final outcome of our sales activities whereas our GAAP net sales are based on estimates made earlier in (or before the end of) the process of creating and fulfilling demand is complete.  We also manage our manufacturing and supply chain operations, including our distributor relationships, towards the goal of having our products available at the time and location the end customer desires.  Management uses end-market demand to manage and assess the profitability of our business and when developing and monitoring our budgets and spending.  Many of our investors have requested that we disclose end-market demand metric because they believe it is useful in understanding our performance as it provides better information regarding end-market demand for our products.  Therefore, we believe that it is useful to investors for us to disclose end-market demand.  Our determination of end-market demand metric might not be the same as similarly titled measures used by other companies.Use of Non-GAAP Financial Measures:  Our non-GAAP adjustments, where applicable, include the effect of share-based compensation, expenses related to our acquisition activities (including intangible asset amortization, inventory valuation costs, severance and other restructuring costs, and legal and other general and administrative expenses associated with acquisitions including legal fees and expenses for litigation and investigations related to our Microsemi acquisition), IT security remediation costs, non-cash interest expense on our convertible debentures, losses on the settlement of debt, and gains and losses on available-for-sale investments.  For the third quarters of fiscal 2020 and 2019, our non-GAAP income tax expense is presented based on projected cash taxes for the fiscal year, excluding transition tax payments under the Tax Cuts and Jobs Act.We are required to estimate the cost of certain forms of share-based compensation, including employee stock options, restricted stock units and our employee stock purchase plan, and to record a commensurate expense in our income statement.  Share-based compensation expense is a non-cash expense that varies in amount from period to period and is affected by the price of our stock at the date of grant.  The price of our stock is affected by market forces that are difficult to predict and are not within the control of management.  Our other non-GAAP adjustments are either non-cash expenses, unusual or infrequent items or other expenses related to transactions.  Management excludes all of these items from its internal operating forecasts and models.We are using non-GAAP operating expenses in dollars including non-GAAP research and development expenses and non-GAAP selling, general and administrative expenses, non-GAAP other expense, net, and non-GAAP income tax rate, which exclude the items noted above, as applicable, to permit additional analysis of our performance.Management believes these non-GAAP measures are useful to investors because they enhance the understanding of our historical financial performance and comparability between periods.  Many of our investors have requested that we disclose this non-GAAP information because they believe it is useful in understanding our performance as it excludes non-cash and other charges that many investors feel may obscure our underlying operating results.  Management uses these non-GAAP measures to manage and assess the profitability of our business and for compensation purposes.  We also use our non-GAAP results when developing and monitoring our budgets and spending.  Our determination of these non-GAAP measures might not be the same as similarly titled measures used by other companies, and it should not be construed as a substitute for amounts determined in accordance with GAAP.  There are limitations associated with using these non-GAAP measures, including that they exclude financial information that some may consider important in evaluating our performance.  Management compensates for this by presenting information on both a GAAP and non-GAAP basis for investors and providing reconciliations of the GAAP and non-GAAP results.Generally, gross margin fluctuates over time, driven primarily by the mix of products sold and licensing revenue; variances in manufacturing yields; fixed cost absorption; wafer fab loading levels; costs of wafers from foundries; inventory reserves; pricing pressures in our non-proprietary product lines; and competitive and economic conditions.  Operating expenses fluctuate over time, primarily due to net sales and profit levels.Diluted Common Shares Outstanding can vary for, among other things, the trading price of our common stock, the exercise of options or vesting of restricted stock units, the potential for incremental dilutive shares from our convertible debentures (additional information regarding our share count is available in the investor relations section of our website under the heading \"Supplemental Financial Information\"), and repurchases or issuances of shares of our common stock.  The diluted common shares outstanding presented in the guidance table above assumes an average Microchip stock price in the March 2020 quarter between $100 and $110 per share (however, we make no prediction as to what our actual share price will be for such period or any other period and we cannot estimate what our stock option exercise activity will be during the quarter). MICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIESRECONCILIATION OF GAAP TO NON-GAAP MEASURES(in millions except per share amounts and percentages)(unaudited)The non-GAAP results for the three and nine months ended December 31, 2018 in the following reconciliation tables have been adjusted from previously reported amounts.  The percentages are now calculated based on GAAP net sales whereas the previously reported percentages were calculated based on non-GAAP net sales, which included the impact of changes in distributor inventory levels (sell-through).  Please refer to our prior year earnings releases for the previously reported non-GAAP figures.RECONCILIATION OF GAAP GROSS PROFIT TO NON-GAAP GROSS PROFITRECONCILIATION OF GAAP RESEARCH AND DEVELOPMENT EXPENSES TO NON-GAAP RESEARCH AND DEVELOPMENT EXPENSESRECONCILIATION OF GAAP SELLING, GENERAL AND ADMINISTRATIVE EXPENSES TO NON-GAAP SELLING, GENERAL AND ADMINISTRATIVE EXPENSESRECONCILIATION OF GAAP OPERATING EXPENSES TO NON-GAAP OPERATING EXPENSESRECONCILIATION OF GAAP OPERATING INCOME TO NON-GAAP OPERATING INCOMERECONCILIATION OF GAAP OTHER EXPENSE, NET TO NON-GAAP OTHER EXPENSE, NETRECONCILIATION OF GAAP INCOME TAX BENEFIT TO NON-GAAP INCOME TAX PROVISIONRECONCILIATION OF GAAP NET INCOME AND GAAP DILUTED NET INCOME PER COMMON SHARE TO NON-GAAP NET INCOME AND NON-GAAP DILUTED NET INCOME PER COMMON SHAREMicrochip will host a conference call today, February 4, 2020 at 5:00 p.m. (Eastern Time) to discuss this release.  This call will be simulcast over the Internet at www.microchip.com.  The webcast will be available for replay until February 18, 2020.A telephonic replay of the conference call will be available at approximately 8:00 p.m. (Eastern Time) on February 4, 2020 and will remain available until 5:00 p.m. (Eastern Time) on February 18, 2020.  Interested parties may listen to the replay by dialing 719-457-0820 and entering access code 9230509.Cautionary Statement:          The statements in this release relating to continuing to introduce a steady stream of new and innovative microcontroller, analog and FPGA solutions that we believe position us well for future growth, that the Coronavirus situation is rapidly evolving, that we have taken preventive measures to help ensure the safety of our employees and have completed a first pass assessment of our supply chain and currently believe our risk is low, that it is too early to determine the impact to our customers as many of them are still not back from their holidays, that we continue to actively monitor the progression of the Coronavirus events and plan to take additional actions as needed, that we will continue to use substantially all of our excess cash generation after dividends to reduce the amount of debt on our balance sheet as quickly as possible, experiencing an increased level of customer requested expedited shipments, calling the December 2019 quarter as the bottom of the cycle for Microchip, that we estimate our net sales in the March 2020 quarter to be up between 2% and 9% sequentially, that the midpoint of our guidance for the March 2020 quarter reflects what we believe our business can deliver, assuming no extraordinary events, that the wider than normal guidance range is to help account for the uncertainty associated with the evolving Coronavirus situation, that we are still in the early days of how this situation is playing out, that we have no way to model how the rest of the quarter will play out for the Coronavirus situation, and what the consequent business impact may be, that we believe that our guidance range incorporates our best judgment for the possible scenarios, our fourth quarter fiscal 2020 guidance for net sales and GAAP and non-GAAP gross margin, operating expenses, operating income, other expense, net, income taxes, net (loss) income, diluted common shares outstanding, (loss) earnings per diluted share, expected inventory days in the March 2020 quarter, capital expenditures for the March 2020 quarter and for all of fiscal 2020, continuing to invest to support the growth of our production capabilities for fast-growing new products and technologies and to bring in-house more of the assembly and test operations that are currently outsourced, our belief that our end-market demand metric reflects true end-market demand based on when product is sold to direct customers or by our distributors to an end customer and our assumed average stock price in the March 2020 quarter are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These statements involve risks and uncertainties that could cause our actual results to differ materially, including, but not limited to: any continued economic uncertainty due to monetary policy, political, geopolitical, trade or other issues in the U.S. or internationally, any unexpected fluctuations or weakness in the U.S. and global economies (including China), changes in demand or market acceptance of our products and the products of our customers; our ability to successfully integrate the operations and employees, retain key employees and customers and otherwise realize the expected synergies and benefits of our acquisitions; the impact of current and future changes in U.S. corporate tax laws (including the Tax Cuts and Jobs Act of 2017), foreign currency effects on our business; the mix of inventory we hold and our ability to satisfy short-term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage and expand our production levels; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the impact of any future significant acquisitions that we may make; our ability to obtain a sufficient supply of wafers from third party wafer foundries and the cost of such wafers, the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi, our actual average stock price in the March 2020 quarter and the impact such price will have on our share count; fluctuations in our stock price and trading volume which could impact the number of shares we acquire under our share repurchase program and the timing of such repurchases; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns (including the Coronavirus) or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q.  You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip's website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made.  Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this February 4, 2020 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note:  The Microchip name and logo, the Microchip logo, PolarFire ad Adapttec are  registered trademarks of Microchip Technology Inc. in the USA and other countries. All other trademarks mentioned herein are the property of their respective companies.INVESTOR RELATIONS CONTACT:J. Eric Bjornholt - CFO (480) 792-7804"
    },
    {
        "title": "Next-Generation Miniaturized Rubidium Atomic Clock Improves Performance and adds Features without Increasing Size",
        "subtitle": "",
        "date": "Jan 22, 2020 8:09AM EST",
        "content": "CHANDLER, Ariz., Jan.  22, 2020  (GLOBE NEWSWIRE) -- As reliance on precise frequency and timing increases due to the Global Navigation Satellite System (GNSS) enabling 5G communication networks, data centers and other mission critical infrastructure, smaller size and high-performance atomic clock technology has become essential to support both military and commercial applications. To meet demand for a small footprint atomic clock, Microchip Technology Inc. (Nasdaq: MCHP) today announced the industry’s highest performance atomic clock for its size and power. The new device also delivers a wider thermal range, critical performance improvements and other enhancements over previously available technology.Microchip’s next-generation MAC-SA5X miniaturized rubidium atomic clock produces a stable time and frequency reference that maintains a high degree of synchronization to a reference clock, such as a GNSS-derived signal. Its combination of low monthly drift rate, short-term stability and stability during temperature changes allow the device to maintain precise frequency and timing requirements during extended periods of holdover during GNSS outages or for applications where large rack-mount clocks are not possible. Operating over a wider temperature range of -40 to +75 Celsius, the MAC-SA5X was designed to quickly achieve atomic stability performance by taking less time to lock compared to some of the existing clock technology available in the market. In an aircraft application, for example, these attributes enable faster power up of critical communication and navigation systems in extreme climates.The MAC-SA5X allows system developers to avoid the need for extra circuitry by integrating a one pulse per second (1PPS) input pin for fast frequency calibration, saving time and development cost. In addition, the MAC-SA5X is designed with the same footprint as previous generation miniature atomic clock technology, reducing the development time to transition to the newer, higher performance device. “As an industry leader, Microchip continues to invest in next-generation atomic clock technology for Department of Defense programs, mission-critical infrastructure and networks that require a high degree of accuracy in timekeeping and synchronization,” said Randy Brudzinski, vice president and general manager of Microchip's frequency and time business unit. “The MAC-SA5X adds several performance and feature enhancements while retaining the same footprint as the previous generation MAC – SA.3X products, enabling customers to easily transition to the new technology.”Designed and manufactured in the U.S., the MAC-SA5X operates to the following additional specifications: "
    },
    {
        "title": "Microchip Joins Responsible Business Alliance (RBA) – the Global Industry Coalition Dedicated to Corporate Social Responsibility",
        "subtitle": "",
        "date": "Jan 16, 2020 8:09AM EST",
        "content": "CHANDLER, Ariz., Jan.  16, 2020  (GLOBE NEWSWIRE) -- Microchip Technology Inc. (Nasdaq: MCHP) today announced it has joined the Responsible Business Alliance (RBA), a nonprofit coalition of companies dedicated to the improvement of social, environmental and ethical conditions in their global supply chains.The RBA Code of Conduct is a set of social, environmental and ethical industry standards. The standards set out in the Code of Conduct reference international norms and standards including but not limited to the Universal Declaration of Human Rights, ILO International Labor Standards, OECD Guidelines for Multinational Enterprises plus ISO and SA standards.“With the principles of corporate social responsibility as a fundamental part of Microchip’s DNA, we remain committed in every aspect of our business and operations to advancing human rights, ethics and health and safety worldwide,” said Ganesh Moorthy, president and chief operating officer. “Along with RBA member companies, we align under a set of common values that send a clear message of commitment to the global supply base and to our customers.” Founded in 2004, the RBA and its initiatives have nearly 400 company members committed to improving conditions in global supply chains; including safe working conditions and ethical labor practices. Microchip’s values and operating principles including its Code of Business Conduct and Ethics, certifications, sustainability reporting and other standards are reflected in the company’s practices and actions of employees worldwide. Microchip is committed to aligning with organizations and companies worldwide to advocate for principals regarding workforce and labor standards, human rights, sustainability and anti-corruption. About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo and the Microchip logo are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies. "
    },
    {
        "title": "Microchip Simplifies Functional Safety Requirements with MPLAB® TÜV SÜD-certified Tools",
        "subtitle": "",
        "date": "Jan 15, 2020 8:09AM EST",
        "content": "CHANDLER, Ariz., Jan.  15, 2020  (GLOBE NEWSWIRE) -- Functional safety certifications are required in many industries, but it is often a time-consuming and expensive process. Certifications can also require extensive justification for using specific development tools, unless the tool is already certified for compliance by functional safety experts such as TÜV SÜD, a Munich-based certification organization. To this end, Microchip Technology Inc. (Nasdaq: MCHP) announced TÜV SÜD certification of its MPLAB® XC compilers for functional safety, significantly simplifying the functional safety qualification process for Microchip’s PIC®, AVR® and SAM microcontrollers (MCUs) and dsPIC® Digital Signal Controllers (DSCs). To further simplify testing and diagnostics, Microchip also introduced MPLAB Code Coverage license, which determines parts of software that have or have not been executed with minimal impact to the application.  The MPLAB XC functional compilers certified by TÜV SÜD aid in satisfying the verification and validation requirements specified in the ISO 26262 standard for automotive safety, IEC 61508 for industrial applications, IEC 62304 for medical software and IEC60730 for automatic electric controls. The MPLAB XC Compilers for Functional Safety will be packaged with additional documentation for qualification of the MPLAB X Integrated Development Environment (IDE) and MPLAB debuggers and programmers. With no annual renewal fees, the licenses are the lowest-cost solution on the market. Using Microchip’s MCUs with the functional safety licenses will reduce application costs and time to market. Ensuring high test coverage of embedded software using code coverage tools often requires a large amount of hardware modification, expensive software and significant effort searching large data files for pertinent information. The MPLAB Code Coverage product avoids this with less than one percent impact to test time. Through a patented process, code can be tested in a single pass without breaking the code into blocks. This saves time and eliminates sifting through large data files. As certified applications often require code testing data, this new code coverage license can further assist with the certification process. “Functional safety tools for many MCU products today can be quite costly,\" said Rodger Richey, Microchip's senior director of development systems. “Microchip supplies our functional safety products for one-third of the price of some competitive solutions and provides unparalleled worldwide technical support to speed time to market and further simplify the development cycle.” The combination of devices designed with functional safety in mind along with MPLAB XC compilers that are certified by TÜV SÜD plus MPLAB Code Coverage simplifies functional safety certification for applications in automotive, consumer, aerospace, medical and industrial applications.In addition to offering development tools that make it easier, faster and more affordable to comply to functional safety standards, Microchip also offers many PIC, AVR, dsPIC and SAM MCUs that are Functional Safety Ready. For all Functional Safety Ready microcontrollers, Microchip provides Failure Mode Effect and Diagnostics Analysis (FMEDA) reports and safety manuals targeting ISO 26262 up to ASIL-B safety levels, with some products achieving ASIL-D.“As a long-term supplier into automotive applications, we understand and respond to our customers need to reduce development time and optimize cost of safety critical products,” said Steve Drehobl, senior vice president of Microchip’s 8- and 16-bit microcontroller business units. “We continue to expand our portfolio of microcontrollers targeting safety applications to offer the perfect match of features and value.”Pricing and AvailabilityMPLAB X IDE version 5.25 is available for free on Microchip’s website. The MPLAB Code Coverage workstation license is available today for $799. The MPLAB XC8, XC16 and XC32++ functional safety workstation licenses are available today for $2,995 each.For additional information, contact a Microchip sales representative, authorized worldwide distributor or visit Microchip’s website. To purchase products mentioned here, click to order now or contact a Microchip authorized distributor. For information about Microchip’s Functional Safety Ready PIC, AVR, dsPIC and SAM microcontrollers please visit Microchip’s Functional Safety Design Center web page.ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):• Application image: www.flickr.com/photos/microchiptechnology/48291491977/sizes/l About Microchip TechnologyMicrochip Technology Inc. is a leading semiconductor provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo, the Microchip logo, PIC, dsPIC, AVR and MPLAB are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies. "
    },
    {
        "title": "Microchip Announces Industry’s First Space-Qualified COTS-Based Radiation-Tolerant Ethernet Transceiver and Embedded Microcontroller",
        "subtitle": "",
        "date": "Jan 14, 2020 8:09AM EST",
        "content": "CHANDLER, Ariz., Jan.  14, 2020  (GLOBE NEWSWIRE) -- Ethernet is becoming more common in spacecraft to enable hardwired communication speed, support higher data rates, and facilitate interoperability between satellites and other spacecraft. As Ethernet in space applications continues to expand, Microchip Technology Inc. (Nasdaq: MCHP) today announced the industry’s first space-qualified Ethernet transceiver – a radiation-tolerant device based on a Commercial Off-the-Shelf (COTS) solution widely deployed in other industries now offering reliable performance for applications ranging from launch vehicles to satellite constellations and space stations. In addition to Microchip’s new VSC8541RT radiation-tolerant Ethernet transceiver sampling, the company received final qualification for the new SAM3X8ERT radiation-tolerant microcontroller, its latest Arm® Cortex®-M3 core processor and embedded Ethernet controller. These are designed to support space industry demand for radiation tolerant devices separately or in combination.Both devices are COTS-based parts with enhanced characterized levels of radiation performance and high reliability quality flow, available in plastic and ceramic packages. They share the same pin-out distribution, allowing designers to begin implementation with COTS devices before moving to space-grade components. This significantly reduces development time and cost.“As the first to provide both a rad-tolerant transceiver and an enhanced rad-tolerant microcontroller for the rapidly-expanding, high-reliability Ethernet market, Microchip continues to support space industry developments and evolution with qualified and proven solutions,” said Bob Vampola, associate vice president of Microchip’s aerospace and defense group. “Microchip’s COTS-based space-grade processing provides the right performance and the right level of qualification to meet evolving requirements from Low-Earth Orbit constellations to deep space missions.”These latest devices are among Microchip’s broad suite of COTS-based radiation tolerant microelectronics supporting Ethernet connectivity to be used aboard satellite platforms, payloads for data and sensor bus control, remote terminal communication, space vehicle networks, and module connectivity in space stations.The VSC8541RT transceiver is a single-port Gigabit Ethernet copper PHY with GMII, RGMII, MII and RMII interfaces. Radiation performances have been verified and documented in detailed reporting. The VSC8541RT is latch-up immune up to 78 Mev; TID has been tested up to 100 Krad. With the same rad-tolerant die and package, a 100 MB limited bitrate performance VSC8540RT is also available in plastic and ceramic qualified versions, which provides performance and cost scalability for targeted missions.The SAM3X8ERT radiation-tolerant MCU implements on a System on Chip (SoC) with the widely-deployed Arm® Cortex®-M3 core processor, delivering 100 DMIPS benefits from the same ecosystem as the industrial variant. The SAM3X8ERT contributes to the system integration trend helping to drive the space industry toward more advanced technologies. This microcontroller embeds up to 512 Kbytes Dual Bank Flash, 100 Kbytes SRAM, ADC & DAC and dual CAN controller on top of Ethernet capability. These latest devices complement Microchip’s suite of radiation-tolerant and radiation-hardened hardware processing solutions. With the SAMV71Q21RT Arm® M7 MCU up 600DMIPS and ATmegaS128/64M1 8-bit MCU series, all share the same development tools.Development ToolsTo support the design process and accelerate time to market, developers can use the Arduino Due commercial kit for the SAM3X8ERT along with the VSC8541EV evaluation boards for the VSC8541RT. The SAM3X8ERT device is supported by Atmel Studio Integrated Development Environment for developing, debugging and software libraries.AvailabilityThe VSC8541RT in plastic or ceramic package is sampling today, and the SAM3X8ERT qualified devices are available today in production quantities. The SAM3X8ERT comes in ceramic prototype to space grade ceramic and high reliability plastic packages. The VSC8541RT comes in ceramic prototype to space grade ceramic and high reliability plastic packages. These range from QFP144 packages for SAM3X8ERT to CQFP68 packages for VSC854xRT. Complete product information is at www.microchip.com.ResourcesHigh-res image available through Flickr or editorial contact (feel free to publish):About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo, the Microchip logo and MPLAB are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. VeriPHY is a trademark of Microchip Technology Inc. in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies. "
    },
    {
        "title": "Microchip Technology Provides Update on Business Environment",
        "subtitle": "",
        "date": "Jan 6, 2020 4:15PM EST",
        "content": "CHANDLER, Ariz., Jan.  06, 2020  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) – Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today provided an update on the business environment it is experiencing.  Microchip has continued to experience strong bookings since October 2019.  Microchip now expects consolidated net sales for the December 2019 quarter to be $1.281 billion to $1.288 billion, or down between 3.75% and 4.25% sequentially with a mid-point of down 4%.  Microchip previously provided revised guidance on December 3, 2019 for consolidated net sales to be $1.244 billion to $1.298 billion, or down between 3% and 7% sequentially with a mid-point of down 5%.“We continued to experience strong bookings in December 2019 that resulted in better than expected billings for the December 2019 quarter and improved backlog for the March 2020 quarter” said Steve Sanghi, Microchip’s CEO.  “The December 2019 quarter book-to-bill ratio was above 1.0 after several quarters of the book-to-bill ratio being below 1.0.  The opening backlog for the March 2020 quarter is currently significantly higher than the opening backlog was for the December 2019 quarter.  Microchip is seeing strength coming from all major geographies including the U.S., Europe and Asia, as well as several major end markets including data center, industrial and automotive.”“Based on several inflexion points we are seeing in the business, we believe that the December 2019 quarter was the bottom of this cycle for Microchip, barring any negative developments on the U.S./China trade front or unexpected fallout from geopolitical events.  We are preparing our factories and subcontractors to be able to deliver better than mid-single digit percentage sequential revenue growth in the March 2020 quarter.  We will provide sales and earnings guidance for the March 2020 quarter on February 4, 2020 via our quarterly earnings release and conference call,” concluded Mr. Sanghi.There will be no conference call associated with this press release.  Microchip is presenting at J.P. Morgan Tech/Auto Forum at the Consumer Electronics Show in Las Vegas on January 7, 2019 at 8:25 AM (Pacific Standard Time). There will be a live webcast and replay of this presentation which will be available at www.microchip.com.Cautionary Statement:The statements in this release relating to expecting consolidated net sales for the December 2019 quarter to be $1.281 billion to $1.288 billion, or down between 3.75% and 4.25% sequentially with a mid-point of down 4%, that we continued to experience strong bookings, improved backlog for the March 2020 quarter, that we are seeing strength coming from all major geographies including the U.S., Europe and Asia as well as several major end markets including data center, industrial and automotive, our belief that the December 2019 quarter was the bottom of this cycle for Microchip, barring any negative developments on the U.S./China trade front or unexpected fallout from geopolitical events, and that we are preparing our factories and subcontractors to be able to deliver better than mid-single digit percentage sequential revenue growth in the March 2020 quarter are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These statements involve risks and uncertainties that could cause our actual results to differ materially, including, but not limited to: any continued economic uncertainty due to monetary policy, political, trade or other issues in the U.S. or internationally (including with respect to trade and other matters involving China), any unexpected fluctuations or weakness in the U.S. and global economies (including China), changes in demand or market acceptance of our products and the products of our customers; our ability to successfully integrate the operations and employees, retain key employees and customers and otherwise realize the expected synergies and benefits of our acquisitions (including our acquisition of Microsemi Corporation); the impact of current and future changes in U.S. corporate tax laws (including the Tax Cuts and Jobs Act of 2017), foreign currency effects on our business; the mix of inventory we hold and our ability to satisfy short-term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage and expand our production levels; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the impact of any future significant acquisitions that we may make; our ability to obtain a sufficient supply of wafers from third party wafer foundries and the cost of such wafers, the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi, our actual average stock price in the December 2019 quarter and the impact such price will have on our share count; fluctuations in our stock price and trading volume which could impact the number of shares we acquire under our share repurchase program and the timing of such repurchases; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q.  You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip's website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made.  Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this January 6, 2020 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries.INVESTOR RELATIONS CONTACT:J. Eric Bjornholt – CFO      (480) 792-7804 "
    },
    {
        "title": "Microchip Technology to Present at the J.P. Morgan 18th Annual Tech/Auto Forum",
        "subtitle": "",
        "date": "Jan 6, 2020 4:15PM EST",
        "content": "CHANDLER, Ariz., Jan.  06, 2020  (GLOBE NEWSWIRE) -- (NASDAQ:MCHP) – Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, announced today that the Company will present at the J.P. Morgan 18th Annual Tech/Auto Forum on Tuesday, January 7, 2020, at 8:45 a.m. (Pacific Time).  Presenting for the Company will be Mr. Steve Sanghi, Chief Executive Officer.  A live webcast of the presentation will be made available by J.P. Morgan, and can be accessed on the Microchip website at www.microchip.com.Any forward looking statements made during the presentation are qualified in their entirety by the discussion of risks set forth in the Company's Securities and Exchange Commission filings.  Copies of SEC filings can be obtained for free at the SEC's website (www.sec.gov) or from commercial document retrieval services.Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries.INVESTOR RELATIONS CONTACT:Deborah Wussler ……… (480) 792-7373 "
    },
    {
        "title": "Microchip Unveils Family Details and Opens Early Access Program for RISC-V Enabled Low-Power PolarFire SoC FPGA Family",
        "subtitle": "Early access program starts for PolarFire SoC, which delivers simultaneous support of real-time applications and rich operating systems with unparalleled power efficiency",
        "date": "Dec 11, 2019 9:27PM EST",
        "content": "BANGKOK, Dec. 12, 2019 /PRNewswire/ -- RISC-V Summit -- The trend towards compute intensive gateways and edge devices is driving the integration of traditional deterministic control applications with additional embedded processing capabilities needed for smart and secure connected systems. In response, Microchip Technology Inc. (Nasdaq: MCHP) is opening the Early Access Program (EAP) for the PolarFire® system-on-chip (SoC) field programmable gate array (FPGA). The platform offers the world's first hardened real-time, Linux® capable, RISC-V-based microprocessor subsystem on the award-winning, mid-range PolarFire FPGA family, bringing class-leading low power consumption, thermal efficiency and defense grade security to embedded systems.Qualified EAP customers can start designing now with Microchip's Libero® SoC 12.3 FPGA design suite and SoftConsole 6.2 integrated development environment for the embedded developer. Customers can also debug their embedded applications today using Renode, a virtual model of the microprocessor subsystem. \"Delivering the industry's first RISC-V based SoC FPGA along with our Mi-V ecosystem, Microchip and its Mi-V partners are driving innovation in the embedded space, giving designers the ability to develop a whole new class of power-efficient applications,\" said Bruce Weyer, vice president of the Field Programmable Gate Array business unit at Microchip. \"This in turn will allow our clients to add unprecedented capabilities at the edge of the network for communications, defense, medical and industrial automation.\"PolarFire SoC delivers power efficiency that is up to 50 percent lower power than competitive devices in the industry. This provides numerous customer benefits including reduced bill of materials by eliminating the need for fans and heat sinks. It's the first SoC FPGA with a deterministic, coherent RISC-V CPU cluster and a deterministic L2 memory subsystem enabling Linux plus real-time applications. The support of real-time and rich operating systems like Linux is part of Microchip's growing Mi-V RISC-V ecosystem, a comprehensive suite of tools and design resources developed by Microchip and numerous third parties to fully support RISC-V designs. Ecosystem partners ready to support PolarFire SoC include WindRiver, Mentor Graphics, WolfSSL, ExpressLogic, Veridify, Hex-Five, and FreeRTOS as well as development tools from IAR systems and AdaCore.\"For developers endeavoring to incorporate technologies like AI while also meeting the challenges of building real-time systems whose behaviors can be predicted, VxWorks® support for PolarFire SoC is critical for advancing the industry,\" said Michel Genard, vice president of Product Management at Wind River. \"Given the deterministic, safety-critical nature of PolarFire target applications and support for RISC-V, we anticipate Microchip's new SoC FPGA will generate a great deal of interest amongst our vast customer base.\" \"Low power is a key design consideration for the vast majority of Nucleus RTOS users, making PolarFire SoC an obvious embedded computing platform for Mentor to support,\" said Scot Morrison, general manager, Embedded Platform Solutions business unit, Mentor, a Siemens business. \"By porting Nucleus to PolarFire SoC, we are helping enable developers to take Nucleus into a broader set of deterministic applications that require scalability and exceptional reliability.\" PolarFire SoC includes extensive debug capabilities including instruction trace and passive run-time configurable Advanced eXtensible Interface (AXI) bus monitors from Mi-V partner UltraSoC, 50 breakpoints, FPGA fabric monitors, and Microchip's built-in two-channel logic analyzer SmartDebug. The PolarFire SoC architecture includes reliability and security features such as single error correction and double error detection (SEC-DED) on all memories, physical memory protection, a differential power analysis (DPA) resistant crypto core, defense-grade secure boot and 128 Kb of flash boot memory.RISC-V SummitMi-V partners Wind River, Mentor Graphics, WolfSSL, HexFive, Veridify, Digital Core and AdaCore will be demonstrating at the RISC-V Summit their solutions running on PolarFire SoC development platforms. AvailabilityTo qualify for the early access program, customers can contact PolarFireSoC@microchip.com. The MPFS250T is expected to be available for sampling CQ3 2020. Customers can start designs now with the development tools provided. Public documentation and collateral are also available today. For more information, visit the PolarFire SoC page or contact sales.support@microsemi.com.ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo, the Microchip logo, PolarFire and Libero are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies.Photo - https://photos.prnasia.com/prnh/20191127/2655428-1SOURCE  Microchip Technology"
    },
    {
        "title": "Microchip Unveils Family Details and Opens Early Access Program for RISC-V Enabled Low-Power PolarFire SoC FPGA Family",
        "subtitle": "",
        "date": "Dec 10, 2019 8:09AM EST",
        "content": "CHANDLER, Ariz., Dec.  10, 2019  (GLOBE NEWSWIRE) -- RISC-V Summit — The trend towards compute intensive gateways and edge devices is driving the integration of traditional deterministic control applications with additional embedded processing capabilities needed for smart and secure connected systems. In response, Microchip Technology Inc. (Nasdaq: MCHP) is opening the Early Access Program (EAP) for the PolarFire® system-on-chip (SoC) field programmable gate array (FPGA). The platform offers the world’s first hardened real-time, Linux® capable, RISC-V-based microprocessor subsystem on the award-winning, mid-range PolarFire FPGA family, bringing class-leading low power consumption, thermal efficiency and defense grade security to embedded systems.  Qualified EAP customers can start designing now with Microchip’s Libero® SoC 12.3 FPGA design suite and SoftConsole 6.2 integrated development environment for the embedded developer. Customers can also debug their embedded applications today using Renode, a virtual model of the microprocessor subsystem.  “Delivering the industry’s first RISC-V based SoC FPGA along with our Mi-V ecosystem, Microchip and its Mi-V partners are driving innovation in the embedded space, giving designers the ability to develop a whole new class of power-efficient applications,” said Bruce Weyer, vice president of the Field Programmable Gate Array business unit at Microchip. “This in turn will allow our clients to add unprecedented capabilities at the edge of the network for communications, defense, medical and industrial automation.”PolarFire SoC delivers power efficiency that is up to 50 percent lower power than competitive devices in the industry. This provides numerous customer benefits including reduced bill of materials by eliminating the need for fans and heat sinks. It’s the first SoC FPGA with a deterministic, coherent RISC-V CPU cluster and a deterministic L2 memory subsystem enabling Linux plus real-time applications. The support of real-time and rich operating systems like Linux is part of Microchip’s growing Mi-V RISC-V ecosystem, a comprehensive suite of tools and design resources developed by Microchip and numerous third parties to fully support RISC-V designs. Ecosystem partners ready to support PolarFire SoC include WindRiver, Mentor Graphics, WolfSSL, ExpressLogic, Veridify, Hex Five, and FreeRTOS as well as development tools from IAR systems and AdaCore.“For developers endeavoring to incorporate technologies like AI while also meeting the challenges of building real-time systems whose behaviors can be predicted, VxWorks® support for PolarFire SoC is critical for advancing the industry,” said Michel Genard, vice president of Product Management at Wind River. “Given the deterministic, safety-critical nature of PolarFire target applications and support for RISC-V, we anticipate Microchip’s new SoC FPGA will generate a great deal of interest amongst our vast customer base.” “Low power is a key design consideration for the vast majority of Nucleus RTOS users, making PolarFire SoC an obvious embedded computing platform for Mentor to support,” said Scot Morrison, general manager, Embedded Platform Solutions business unit, Mentor, a Siemens business. “By porting Nucleus to PolarFire SoC, we are helping enable developers to take Nucleus into a broader set of deterministic applications that require scalability and exceptional reliability.” PolarFire SoC includes extensive debug capabilities including instruction trace and passive run-time configurable Advanced eXtensible Interface (AXI) bus monitors from Mi-V partner UltraSoC, 50 breakpoints, FPGA fabric monitors, and Microchip's built-in two-channel logic analyzer SmartDebug. The PolarFire SoC architecture includes reliability and security features such as single error correction and double error detection (SEC-DED) on all memories, physical memory protection, a differential power analysis (DPA) resistant crypto core, defense-grade secure boot and 128 Kb of flash boot memory.RISC-V SummitMi-V partners Wind River, Mentor Graphics, WolfSSL, Hex Five, Veridify, Digital Core and AdaCore will be demonstrating at the RISC-V Summit their solutions running on PolarFire SoC development platforms.AvailabilityTo qualify for the early access program, customers can contact PolarFireSoC@microchip.com. The MPFS250T is expected to be available for sampling CQ3 2020. Customers can start designs now with the development tools provided. Public documentation and collateral are also available today. For more information, visit the PolarFire SoC page or contact sales.support@microsemi.com.ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):• Application image: www.flickr.com/photos/microchiptechnology/49124293796/sizes/l/About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo, the Microchip logo, PolarFire and Libero are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies."
    },
    {
        "title": "Microchip Technology to Present at the Credit Suisse 23rd Annual Technology Conference",
        "subtitle": "",
        "date": "Dec 3, 2019 4:15PM EST",
        "content": "CHANDLER, Ariz., Dec.  03, 2019  (GLOBE NEWSWIRE) -- (NASDAQ:MCHP) -- Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, announced today that the Company will present at the Credit Suisse 23rd Annual Technology Conference on Wednesday, December 4, 2019, at 8:00 a.m. (Mountain Time).  Presenting for the Company will be Mr. Steve Sanghi, Chief Executive Officer.  A live webcast of the presentation will be made available by Credit Suisse, and can be accessed on the Microchip website at www.microchip.com.  In conjunction with this conference, Microchip will be posting the presentation to its website at www.microchip.com/investors in the Supplemental Financial Information section.Any forward looking statements made during the presentation are qualified in their entirety by the discussion of risks set forth in the Company's Securities and Exchange Commission filings.  Copies of SEC filings can be obtained for free at the SEC's website (www.sec.gov) or from commercial document retrieval services.Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries.INVESTOR RELATIONS CONTACT:Deborah Wussler ……… (480) 792-7373"
    },
    {
        "title": "Microchip Technology Updates Financial Guidance for Third Quarter Fiscal 2020",
        "subtitle": "",
        "date": "Dec 3, 2019 4:15PM EST",
        "content": "CHANDLER, Ariz., Dec.  03, 2019  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) – Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today updated the range of its prior guidance for net sales and GAAP and non-GAAP earnings per share for its fiscal third quarter of 2020 ending December 31, 2019.  Microchip now expects consolidated net sales for the December quarter to be $1.244 billion to $1.298 billion, or down between 3% and 7% sequentially with a mid-point of down 5%. Microchip previously provided guidance on November 5, 2019 for consolidated net sales to be $1.204 billion to $1.311 billion or down between 2% and 10% sequentially, with a midpoint of down 6%.   GAAP earnings (loss) per share is now expected to be between ($0.03) and $0.04 and non-GAAP earnings per share is expected to be between $1.19 and $1.30.  The original guidance for GAAP earnings (loss) per share was ($0.11) to $0.17 and the original guidance for non-GAAP earnings per share was between $1.12 and $1.32.   Consistent with our November 5, 2019 guidance, we are not able to estimate the amount of Special Charges and Other, and therefore our estimate of GAAP earnings per share excludes any such amounts.“We had previously reported strong bookings in the month of October 2019 in our November 5, 2019 earnings release,” said Steve Sanghi, Microchip’s CEO.  “We continued to experience strong bookings in the month of November.  Quarter-to-date bookings that have been requested for delivery in the December 2019 quarter have also been strong.  Based on the first two months of the December 2019 quarter being behind us, we are narrowing our quarterly net sales and non-GAAP earnings guidance range and increasing the midpoint.”There will be no conference call associated with this press release.  Microchip is presenting at the Credit Suisse 23rd Annual Technology Conference on Wednesday, December 4, 2019 at 8:00 a.m. (Mountain).  The investor slides that will be presented at the conference will be posted to Microchip’s website today, and a live webcast and replay of this presentation will be available at www.microchip.com.Cautionary Statement:The statements in this release relating to expecting consolidated net sales for the December quarter to be $1.244 billion to $1.298 billion, or down between 3% and 7% sequentially with a mid-point of down 5%, GAAP earnings (loss) per share expected to be between ($0.03) and $0.04 and non-GAAP earnings per share is expected to be between $1.19 and $1.30, not being able to estimate the amount of Special Charges and Other, and that quarter-to-date bookings that have been requested for delivery in the December 2019 quarter have also been strong are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These statements involve risks and uncertainties that could cause our actual results to differ materially, including, but not limited to: any continued economic uncertainty due to monetary policy, political, trade or other issues in the U.S. or internationally (including with respect to trade and other matters involving China), any unexpected fluctuations or weakness in the U.S. and global economies (including China), changes in demand or market acceptance of our products and the products of our customers; our ability to successfully integrate the operations and employees, retain key employees and customers and otherwise realize the expected synergies and benefits of our acquisitions (including our acquisition of Microsemi Corporation); the impact of current and future changes in U.S. corporate tax laws (including the Tax Cuts and Jobs Act of 2017), foreign currency effects on our business; the mix of inventory we hold and our ability to satisfy short-term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage and expand our production levels; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the impact of any future significant acquisitions that we may make; our ability to obtain a sufficient supply of wafers from third party wafer foundries and the cost of such wafers, the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi, our actual average stock price in the December 2019 quarter and the impact such price will have on our share count; fluctuations in our stock price and trading volume which could impact the number of shares we acquire under our share repurchase program and the timing of such repurchases; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q.  You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip's website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made.  Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this December 3, 2019 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo are registered trademarks of Microchip Technology Inc. in the USA and other countries.INVESTOR RELATIONS CONTACT:J. Eric Bjornholt – CFO      (480) 792-7804"
    },
    {
        "title": "Reduce Memory Costs and Retain Data at Power Loss with Microchip's EERAM Memory Solutions",
        "subtitle": "New family introduces high density SPI EERAMs, extending up to 1 Mb",
        "date": "Dec 2, 2019 10:00PM EST",
        "content": "BANGKOK, Dec. 3, 2019 /PRNewswire/ -- From smart meters to manufacturing lines, applications that require repetitive task data logging must be able to automatically restore content if power is disrupted during processing. Current low density (64 Kb to 1Mb) nonvolatile serial RAM (NVRAM) solutions used for these datalogs are typically the highest price-per-bit memory in the resulting end products. Microchip Technology Inc. (NASDAQ: MCHP) today announced a new family of Serial Peripheral Interface (SPI) EERAM memory products that offers system designers up to 25 percent cost savings over the current serial NVRAM alternatives. The family introduces four reliable SPI densities to Microchip's EERAM portfolio, ranging from 64 Kb up to 1 Mb.EERAM is a standalone nonvolatile RAM memory that uses the same SPI and I2C protocols as serial SRAM, enabling devices to retain SRAM content during power loss without using an external battery. All nonvolatile aspects of the part are essentially invisible to the user. When the device detects power going away, it automatically transfers the SRAM data to nonvolatile storage and moves it back to the SRAM once power returns to the part. In manufacturing lines, for example, stations handle up to millions of tasks over their lifetimes, and lost data during a task can require overhauling or discarding items. EERAMs automatically store SRAM content in these settings, allowing the manufacturing line to resume where the task was disrupted.The primary reason EERAM is available at a lower price point is the use of standard Complementary Metal-oxide-semiconductor (CMOS) and Flash processes. Because these are the highest volume and most widely used processes, they offer the best reliability and lowest cost in the industry. Alternative solutions such as Ferroelectric RAM (FRAM) uses a specialty process, resulting in much higher costs and unstable long-term supply. The new EERAM family comes with Microchip's customer-driven obsolescence practice, which helps ensure availability to customers for as long as needed. \"EERAM gives system designers the reliable, cost-effective nonvolatile RAM solutions their systems require. We received a great response to our initial launch of 4 Kb and 16 Kb densities a few years ago,\" said Randy Drwinga, vice president of Microchip's memory products division. \"This new family offers our first SPI interface products and extends to one megabit, giving customers more options to meet their system design needs.\" Pricing and AvailabilityThe following devices are available in 8-pin SOIC, SOIJ and DFN packages in volume production. Pricing is in 10,000-unit quantities:For additional information, contact any Microchip sales representative or authorized worldwide distributor, or visit Microchip's website. To purchase products mentioned in this press release, go to Microchip's full-service channel microchipDIRECT or contact one of Microchip's authorized distribution partners.ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):Video available through YouTube or editorial contact (feel free to post): About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at http://www.microchip.com.Note: The Microchip name and logo, and the Microchip logo, are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies.Photo - https://photos.prnasia.com/prnh/20191121/2650437-1 SOURCE  Microchip Technology"
    },
    {
        "title": "Reduce Memory Costs and Retain Data at Power Loss with Microchip’s EERAM Memory Solutions",
        "subtitle": "",
        "date": "Dec 2, 2019 8:00AM EST",
        "content": "CHANDLER, Ariz., Dec.  02, 2019  (GLOBE NEWSWIRE) -- From smart meters to manufacturing lines, applications that require repetitive task data logging must be able to automatically restore content if power is disrupted during processing. Current low density (64 Kb to 1Mb) nonvolatile serial RAM (NVRAM) solutions used for these datalogs are typically the highest price-per-bit memory in the resulting end products. Microchip Technology Inc. (NASDAQ: MCHP) today announced a new family of Serial Peripheral Interface (SPI) EERAM memory products that offer system designers up to 25 percent cost savings over the current serial NVRAM alternatives. The family introduces four reliable SPI densities to Microchip’s EERAM portfolio, ranging from 64 Kb up to 1 Mb.EERAM is a standalone nonvolatile RAM memory that uses the same SPI and I2C protocols as serial SRAM, enabling devices to retain SRAM content during power loss without using an external battery. All nonvolatile aspects of the part are essentially invisible to the user. When the device detects power going away, it automatically transfers the SRAM data to nonvolatile storage and moves it back to the SRAM once power returns to the part. In manufacturing lines, for example, stations handle up to millions of tasks over their lifetimes, and lost data during a task can require overhauling or discarding items. EERAMs automatically store SRAM content in these settings, allowing the manufacturing line to resume where the task was disrupted.The primary reason EERAM is available at a lower price point is the use of standard Complementary Metal-oxide-semiconductor (CMOS) and Flash processes. Because these are the highest volume and most widely used processes, they offer the best reliability and lowest cost in the industry. Alternative solutions such as Ferroelectric RAM (FRAM) use a specialty process, resulting in much higher costs and unstable long-term supply. The new EERAM family comes with Microchip’s customer-driven obsolescence practice, which helps ensure availability to customers for as long as needed. “EERAM gives system designers the reliable, cost-effective nonvolatile RAM solutions their systems require. We received a great response to our initial launch of 4 Kb and 16 Kb densities a few years ago,” said Randy Drwinga, vice president of Microchip’s memory products division. “This new family offers our first SPI interface products and extends to one megabit, giving customers more options to meet their system design needs.”Pricing and AvailabilityThe following devices are available in 8-pin SOIC, SOIJ and DFN packages in volume production. Pricing is in 10,000-unit quantities:For additional information, contact any Microchip sales representative or authorized worldwide distributor, or visit Microchip’s website. To purchase products mentioned in this press release, go to Microchip’s full-service channel microchipDIRECT or contact one of Microchip’s authorized distribution partners.ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):• Application image: https://www.flickr.com/photos/microchiptechnology/49030471461Video available through YouTube or editorial contact (feel free to post):• https://vimeo.com/287480707About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company’s solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at http://www.microchip.com.Note: The Microchip name and logo, and the Microchip logo, are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. All other trademarks mentioned herein are the property of their respective companies."
    },
    {
        "title": "Microchip Smart Storage Adapters Now Interoperate Seamlessly with MegaRAC® SP-X Management Firmware from AMI for At-Scale Secure Storage Management",
        "subtitle": "Microchip and AMI interoperability simplify development of out-of-band remote storage management solutions that reduce data center operational costs",
        "date": "Nov 13, 2019 8:00AM EST",
        "content": "CHANDLER, Ariz., Nov. 13, 2019 /PRNewswire/ -- Data center administrators and IT managers want the ability to securely manage and trouble-shoot platforms and devices remotely, which requires that additional software, hardware and firmware be interfaced with storage adapters and other server components. Microchip Technology Inc. (Nasdaq: MCHP) today announced it has added this capability to its Adaptec Smart Storage adapters, which now seamlessly interoperate with MegaRAC® SP-X remote monitoring and diagnostics firmware from American Megatrends (AMI) and are supported in its MegaRAC solution development framework.\"Our Adaptec Smart Storage adapters are now easily combined with AMI's widely adopted MegaRAC SP-X remote storage management firmware solutions that enable server component monitoring, auto-discovery of system issues and other diagnostics from anywhere in the world,\" said Pete Hazen, vice president of Microchip's Data Center Solutions business unit. \"Support for our adapters in the MegaRAC development framework speeds time to market for solutions that provide baseline remote management functionality and allows for easy customization to support additional features.\"Interoperability between Adaptec Smart Storage adapters and MegaRAC SP-X manageability firmware powering embedded base management controllers (BMCs) reduces data center operational costs by enabling remote management capabilities including platform status monitoring and problem notifications, diagnosis and recovery. Out-of-band management enables the adapters to be reached directly over a network connection if the server is powered off or unresponsive and improves security by eliminating the need for proprietary software or host tools on either the server or storage system. AMI has leveraged a combination of the widely adopted management component transport protocol (MCTP) protocol and Microchip's StorageCore application programming interface (API) to add basic support for the Adaptec Smart Storage adapters in its MegaRAC development framework's Storage Adapter management tool.\"Combining Microchip's Adaptec Smart Storage adapters with MegaRAC SP-X BMC management firmware greatly simplifies the development of remote secure storage management solutions,\" said Stephen Bignault, director of business development with AMI. \"We are proud to have worked closely with Microchip to add support for its adapters in our MegaRAC development framework and will deliver the required code packages, tools and development expertise to our mutual valued customers, enabling them to speed TTM and enhance their platform management capabilities.\"AvailabilityAdaptec Smart Storage Adapters with MegaRAC support are available now. For more information, visit https://www.microchip.com/smartstorage or contact sales.support@microsemi.com. ResourcesHigh-res images available through Flickr or editorial contact (feel free to publish):About Microchip TechnologyMicrochip Technology Inc. is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs which reduce risk while lowering total system cost and time to market. The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.About AMI:Founded in 1985 and known worldwide for AMIBIOS®, American Megatrends (AMI) supplies state-of-the-art hardware, software, and utilities to top-tier manufacturers of desktop, server, mobile and embedded systems. AMI's industry leading Aptio® V UEFI BIOS firmware, and MegaRAC® BMC and remote server management solutions continue to garner industry acclaim and awards around the world. In line with the diversity of its technology and product line, AMI is a member of numerous industry associations and standards groups, such as the Unified EFI Forum (UEFI) and the Trusted Computing Group (TCG). Headquartered in Norcross, Georgia, AMI has locations in the U.S., China, Germany, India, Japan, Korea and Taiwan to better serve its customers. For more information on AMI, its products or services, call 1-800-828-9264 or visit ami.com.Note: The Microchip name and logo and the Microchip logo are registered trademarks of Microchip Technology Incorporated in the U.S.A. and other countries. MegaRAC® is a registered trademark of American Megatrends. All other trademarks mentioned herein are the property of their respective companies. View original content to download multimedia:http://www.prnewswire.com/news-releases/microchip-smart-storage-adapters-now-interoperate-seamlessly-with-megarac-sp-x-management-firmware-from-ami-for-at-scale-secure-storage-management-300955137.htmlSOURCE  Microchip Technology Inc."
    },
    {
        "title": "Microchip Technology Announces Financial Results for Second Quarter of Fiscal Year 2020",
        "subtitle": "",
        "date": "Nov 5, 2019 4:10PM EST",
        "content": "CHANDLER, Ariz., Nov.  05, 2019  (GLOBE NEWSWIRE) -- (NASDAQ: MCHP) - Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today reported results for the three months ended September 30, 2019 as summarized in the following table:       (1) See the \"Use of Non-GAAP Financial Measures\" section of this release.GAAP net sales for the second quarter of fiscal 2020 were $1.338 billion, down 6.6% from net sales of $1.433 billion in the prior year's second fiscal quarter.GAAP net income for the second quarter of fiscal 2020 was $108.9 million, or $0.43 per diluted share, up from GAAP net income of $96.3 million, or $0.38 per diluted share, in the prior year's second fiscal quarter.  For the second quarters of fiscal 2020 and fiscal 2019, GAAP net income was significantly adversely impacted by purchase accounting adjustments associated with our acquisitions.Non-GAAP net income for the second quarter of fiscal 2020 was $365.7 million, or $1.43 per diluted share, down from non-GAAP net income of $398.5 million, or $1.58 per diluted share, in the prior year's second fiscal quarter.  For the second quarters of fiscal 2020 and fiscal 2019, our non-GAAP results exclude the effect of share-based compensation, expenses related to our acquisition activities (including intangible asset amortization, inventory valuation costs, severance and other restructuring costs, and legal and other general and administrative expenses associated with acquisitions including legal fees and expenses for litigation and investigations related to our Microsemi acquisition), IT security remediation costs, non-cash interest expense on our convertible debentures, losses on the settlement of debt, and gains and losses related to available-for-sale investments.  For the second quarters of fiscal 2020 and fiscal 2019, our non-GAAP income tax expense is presented based on projected cash taxes for the fiscal year, excluding transition tax payments under the Tax Cuts and Jobs Act.  A reconciliation of our non-GAAP and GAAP results is included in this press release.Prior to the fourth quarter of fiscal 2019, we reported non-GAAP net sales based on end-market demand, which excluded the effect of our distributors increasing or decreasing their inventory holdings.  Beginning with the fourth quarter of fiscal 2019, we changed the information included in our financial guidance and provide net sales guidance based on sell-in revenue recognition under the new GAAP standard.Microchip announced today that its Board of Directors has declared a record quarterly cash dividend on its common stock of 36.65 cents per share.  The quarterly dividend is payable on December 5, 2019 to stockholders of record on November 21, 2019.\"Our September quarter financial results were reasonably good despite a challenging economic environment,\" said Steve Sanghi, Chief Executive Officer.  \"Our net sales were slightly below the midpoint of our guidance provided on August 6, 2019.  Our non-GAAP gross margins were up to 62.2% in the September quarter, and very close to a record high.  Our non-GAAP operating margin was also up to 36.7%, above the midpoint of our guidance.  We delivered $1.43 of non-GAAP diluted earnings per share, which was at the midpoint of our guidance.\"Mr. Sanghi added, \"End-market demand, which reflects sell-through activities in the distribution channel, was $8.6 million higher than GAAP (sell-in) revenue in the September 2019 quarter.  As a result, distribution inventory days declined from 32 to 30 days.  We have only had one quarter in the past fifteen years where our days of inventory at our distributors have been lower than the levels at the end of the September 2019 quarter.\"\"The end-market demand for our microcontroller business was down 1.3% and for our analog business was up 0.2% compared to the June 2019 quarter.  Microcontrollers represented 53.3% and analog represented 28.7% of our end-market demand in the September quarter.  We continue to introduce a steady stream of new and innovative products in both microcontroller and analog that we believe position us well for future growth,\"said Ganesh Moorthy, President and Chief Operating Officer.Mr. Moorthy added, \"The integration of Microsemi with Microchip continues to progress well.  On the business systems front, we went live with a few more systems on November 1, 2019.  We are pleased with the synergies we have achieved since we closed the acquisition despite the weaker macro-economic environment over the past several quarters.\"Eric Bjornholt, Microchip's Chief Financial Officer, said, \"We paid down $315.5 million of total debt during the September quarter, reflecting a cumulative pay down of $1.729 billion over the past five quarters, as we continued to manage our working capital requirements for the business.  We will continue to use substantially all of our excess cash generation after dividends to reduce the amount of debt on our balance sheet as quickly as possible.\"Mr. Sanghi concluded, \"There is continued uncertainty in the economic environment, specifically as it relates to the U.S. and China trade dispute and hence we had limited backlog visibility from our customers and distributors to start the quarter.  However, although we started the December quarter with much lower backlog than the September quarter, October bookings were the highest since June 2018, and the backlog for the quarter is filling at a much steeper rate.  While we estimate our net sales in the December 2019 quarter to be down between 2% and 10% sequentially, there are early signs that we may be at a positive inflexion point.\"Microchip's Highlights for the Quarter Ended September 30, 2019:Third Quarter Fiscal Year 2020 Outlook:Beginning with the fiscal quarter ending March 31, 2019, we changed the information included in our financial guidance in response to comments from and discussions with the Staff of the Securities and Exchange Commission.  We are now providing net sales guidance based on sell-in revenue recognition under the new GAAP standard.  We are also providing guidance and reporting non-GAAP gross margin percentage, operating expense percentage, operating profit percentages and diluted earnings per share based on sell-in GAAP revenue.  We are also providing information on end-market demand so that investors will have information on the consumption in the marketplace of our products by our customers or our distributors.  We do not use end-market demand for any of our non-GAAP income statement calculations.  Please see \"Use of End-Market Demand Metric\" below for information on how we calculate end-market demand.The following statements are based on current expectations.  These statements are forward-looking, and actual results may differ materially.  We are not able to predict whether inventory at our distributors will increase or decrease and are therefore providing a range of GAAP net sales guidance.  In recent years, we have seen net inventory at our distributors increase or decrease by a significant amount in a single quarter.1 See the \"Use of Non-GAAP Financial Measures\" section of this release for information regarding our non-GAAP guidance.2 We are not able to estimate the amount of Special Charges and Other, net that may be incurred during the quarter ending December 31, 2019.  Therefore, our estimate of GAAP operating expenses excludes any amount that may be recognized as Special Charges and Other, net in the quarter ending December 31, 2019.3 The forecast for GAAP tax expense excludes any unexpected tax events that may occur during the quarter, as these amounts cannot be forecasted.4 Represents expected cash tax rate for fiscal 2020 excluding any transition tax payments associated with the Tax Cuts and Jobs Act.5 In the case of a net loss, diluted common shares outstanding exclude potentially dilutive common shares from employee equity incentive plans and common shares issuable upon the exchange of our convertible debentures as the related impact would have been anti-dilutive.Use of End-Market Demand Metric:  End-market demand is the net dollar amount of our products, licensing revenue and other services delivered to our direct (non-distributor) customers and by our distributors to their customers.  We are able to calculate end-market demand based on information that our distributors provide us about their product shipments to their customers and inventory holdings.  The value of end-market demand from our distributors is calculated as the net transaction value of these shipments.  We believe that our end-market demand metric reflects true end-market demand based on when product is sold to direct customers or by our distributors to an end customer.Under the new GAAP revenue recognition standard, we are required to recognize revenue when control of the product changes from us to a customer or distributor.  We focus our sales and marketing efforts on creating demand for our products in the end markets we serve and not on moving inventory into our distribution network.  Therefore, the elements of our internal performance and executive and employee compensation metrics that are based on sales and operating results are measured using the value of the end-market demand for our products.  We use end-market demand for these purposes because we do not believe that the underlying value of our business benefits from increases in the value of inventory that is held in the supply chain.  As many of our products are designed into customer applications with relatively long lives, such value is only realized when the end-market demand is created and the supply chain sells the inventory to the end customer.  We believe the use of end-market demand is also important to investors and users of our financial statements as it reflects the final outcome of our sales activities whereas our GAAP net sales are based on estimates made earlier in (or before the end of) the process of creating and fulfilling demand is complete.  We also manage our manufacturing and supply chain operations, including our distributor relationships, towards the goal of having our products available at the time and location the end customer desires.  Management uses end-market demand to manage and assess the profitability of our business and when developing and monitoring our budgets and spending.  Many of our investors have requested that we disclose end-market demand metric because they believe it is useful in understanding our performance as it provides better information regarding end-market demand for our products.  Therefore, we believe that it is useful to investors for us to disclose end-market demand.  Our determination of end-market demand metric might not be the same as similarly titled measures used by other companies.Use of Non-GAAP Financial Measures:  Our non-GAAP adjustments, where applicable, include the effect of share-based compensation, expenses related to our acquisition activities (including intangible asset amortization, inventory valuation costs, severance and other restructuring costs, and legal and other general and administrative expenses associated with acquisitions including legal fees and expenses for litigation and investigations related to our Microsemi acquisition), IT security remediation costs, non-cash interest expense on our convertible debentures, losses on the settlement of debt, and gains and losses on available-for-sale investments.  For the second quarters of fiscal 2020 and 2019, our non-GAAP income tax expense is presented based on projected cash taxes for the fiscal year, excluding transition tax payments under the Tax Cuts and Jobs Act.We are required to estimate the cost of certain forms of share-based compensation, including employee stock options, restricted stock units and our employee stock purchase plan, and to record a commensurate expense in our income statement.  Share-based compensation expense is a non-cash expense that varies in amount from period to period and is affected by the price of our stock at the date of grant.  The price of our stock is affected by market forces that are difficult to predict and are not within the control of management.  Our other non-GAAP adjustments are either non-cash expenses, unusual or infrequent items or other expenses related to transactions.  Management excludes all of these items from its internal operating forecasts and models.We are using non-GAAP operating expenses in dollars including non-GAAP research and development expenses and non-GAAP selling, general and administrative expenses, non-GAAP other expense, net, and non-GAAP income tax rate, which exclude the items noted above, as applicable, to permit additional analysis of our performance.Management believes these non-GAAP measures are useful to investors because they enhance the understanding of our historical financial performance and comparability between periods.  Many of our investors have requested that we disclose this non-GAAP information because they believe it is useful in understanding our performance as it excludes non-cash and other charges that many investors feel may obscure our underlying operating results.  Management uses these non-GAAP measures to manage and assess the profitability of our business and for compensation purposes.  We also use our non-GAAP results when developing and monitoring our budgets and spending.  Our determination of these non-GAAP measures might not be the same as similarly titled measures used by other companies, and it should not be construed as a substitute for amounts determined in accordance with GAAP.  There are limitations associated with using these non-GAAP measures, including that they exclude financial information that some may consider important in evaluating our performance.  Management compensates for this by presenting information on both a GAAP and non-GAAP basis for investors and providing reconciliations of the GAAP and non-GAAP results.Generally, gross margin fluctuates over time, driven primarily by the mix of products sold and licensing revenue; variances in manufacturing yields; fixed cost absorption; wafer fab loading levels; costs of wafers from foundries; inventory reserves; pricing pressures in our non-proprietary product lines; and competitive and economic conditions.  Operating expenses fluctuate over time, primarily due to net sales and profit levels.Diluted Common Shares Outstanding can vary for, among other things, the trading price of our common stock, the exercise of options or vesting of restricted stock units, the potential for incremental dilutive shares from our convertible debentures (additional information regarding our share count is available in the investor relations section of our website under the heading \"Supplemental Financial Information\"), and repurchases or issuances of shares of our common stock.  The diluted common shares outstanding presented in the guidance table above assumes an average Microchip stock price in the December 2019 quarter between $94 and $104 per share (however, we make no prediction as to what our actual share price will be for such period or any other period and we cannot estimate what our stock option exercise activity will be during the quarter).MICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIESRECONCILIATION OF GAAP TO NON-GAAP MEASURES(in millions except per share amounts and percentages)(unaudited)The non-GAAP results for the three and six months ended September 30, 2018 in the following reconciliation tables have been adjusted from previously reported amounts.  The percentages are now calculated based on GAAP net sales whereas the previously reported percentages were calculated based on non-GAAP net sales, which included the impact of changes in distributor inventory levels (sell-through).  Please refer to our prior year earnings releases for the previously reported non-GAAP figures.RECONCILIATION OF GAAP GROSS PROFIT TO NON-GAAP GROSS PROFITRECONCILIATION OF GAAP RESEARCH AND DEVELOPMENT EXPENSES TO NON-GAAP RESEARCH AND DEVELOPMENT EXPENSESRECONCILIATION OF GAAP SELLING, GENERAL AND ADMINISTRATIVE EXPENSES TO NON-GAAP SELLING, GENERAL AND ADMINISTRATIVE EXPENSESRECONCILIATION OF GAAP OPERATING EXPENSES TO NON-GAAP OPERATING EXPENSESRECONCILIATION OF GAAP OPERATING INCOME TO NON-GAAP OPERATING INCOMERECONCILIATION OF GAAP OTHER EXPENSE, NET TO NON-GAAP OTHER EXPENSE, NETRECONCILIATION OF GAAP INCOME TAX BENEFIT TO NON-GAAP INCOME TAX PROVISIONRECONCILIATION OF GAAP NET INCOME AND GAAP DILUTED NET INCOME PER COMMON SHARE TO NON-GAAP NET INCOME AND NON-GAAP DILUTED NET INCOME PER COMMON SHAREMicrochip will host a conference call today, November 5, 2019 at 5:00 p.m. (Eastern Time) to discuss this release.  This call will be simulcast over the Internet at www.microchip.com.  The webcast will be available for replay until November 19, 2019.A telephonic replay of the conference call will be available at approximately 8:00 p.m. (Eastern Time) on November 5, 2019 and will remain available until 5:00 p.m. (Eastern Time) on November 19, 2019.  Interested parties may listen to the replay by dialing 719-457-0820 and entering access code 6550607.Cautionary Statement:          The statements in this release relating to continuing to introduce a steady stream of new and innovative products in both microcontroller and analog that we believe position us well for future growth, the integration of Microsemi with Microchip progressing well, that we will continue to use substantially all of our excess cash generation after dividends to reduce the amount of debt on our balance sheet as quickly as possible, continued uncertainty in the economic environment, that backlog for the quarter is filling at a much steeper rate, that we estimate our net sales in the December 2019 quarter to be down between 2% and 10% sequentially, that there are early signs that we may be at a positive inflexion point, our third quarter fiscal 2020 guidance for net sales and GAAP and non-GAAP gross margin, operating expenses, operating income, other expense, net, income taxes, net (loss) income, diluted common shares outstanding, (loss) earnings per diluted share, inventory days in the December 2019 quarter expected to be in the range of 131 to 144  days, capital expenditures for the December 2019 quarter and for all of fiscal 2020, continuing to invest to support the growth of our production capabilities for fast-growing new products and technologies and to bring in-house more of the assembly and test operations that are currently outsourced, our belief that our end-market demand metric reflects true end-market demand based on when product is sold to direct customers or by our distributors to an end customer and our assumed average stock price in the December 2019 quarter are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These statements involve risks and uncertainties that could cause our actual results to differ materially, including, but not limited to: any continued economic uncertainty due to monetary policy, political, trade or other issues in the U.S. or internationally, any unexpected fluctuations or weakness in the U.S. and global economies (including China), changes in demand or market acceptance of our products and the products of our customers; our ability to successfully integrate the operations and employees, retain key employees and customers and otherwise realize the expected synergies and benefits of our acquisitions (including our acquisition of Microsemi Corporation); the impact of current and future changes in U.S. corporate tax laws (including the Tax Cuts and Jobs Act of 2017), foreign currency effects on our business; the mix of inventory we hold and our ability to satisfy short-term orders from our inventory; changes in utilization of our manufacturing capacity and our ability to effectively manage and expand our production levels; competitive developments including pricing pressures; the level of orders that are received and can be shipped in a quarter; changes or fluctuations in customer order patterns and seasonality; the impact of any future significant acquisitions that we may make; our ability to obtain a sufficient supply of wafers from third party wafer foundries and the cost of such wafers, the costs and outcome of any current or future litigation or other matters involving our Microsemi acquisition, the Microsemi business, intellectual property, customers, or other issues; the costs and outcome of any current or future tax audit or investigation regarding our business or the business of Microsemi, our actual average stock price in the December 2019 quarter and the impact such price will have on our share count; fluctuations in our stock price and trading volume which could impact the number of shares we acquire under our share repurchase program and the timing of such repurchases; disruptions in our business or the businesses of our customers or suppliers due to natural disasters (including any floods in Thailand), terrorist activity, armed conflict, war, worldwide oil prices and supply, public health concerns or disruptions in the transportation system; and general economic, industry or political conditions in the United States or internationally.For a detailed discussion of these and other risk factors, please refer to Microchip's filings on Forms 10-K and 10-Q.  You can obtain copies of Forms 10-K and 10-Q and other relevant documents for free at Microchip's website (www.microchip.com) or the SEC's website (www.sec.gov) or from commercial document retrieval services.Stockholders of Microchip are cautioned not to place undue reliance on our forward-looking statements, which speak only as of the date such statements are made.  Microchip does not undertake any obligation to publicly update any forward-looking statements to reflect events, circumstances or new information after this November 5, 2019 press release, or to reflect the occurrence of unanticipated events.About Microchip:Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions.  Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market.  The company's solutions serve more than 120,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets.  Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality.  For more information, visit the Microchip website at www.microchip.com.Note: The Microchip name and logo, the Microchip logo, PCIe, MaXTouch and TimeProvider are registered trademarks of Microchip Technology Inc. in the USA and other countries.  All other trademarks mentioned herein are the property of their respective companies.INVESTOR RELATIONS CONTACT:J. Eric Bjornholt -- CFO..... (480) 792-7804"
    }
]