[
    {
        "title": "Mondelēz International Sets Science-Based Targets to Reduce Emissions and Create Sustainable Future for Snacking",
        "subtitle": "",
        "date": "Feb 26, 2020 9:00AM EST",
        "content": "DEERFIELD, Ill., Feb.  26, 2020  (GLOBE NEWSWIRE) -- Mondelēz International, Inc., a global leader in snacking, today announced a renewed commitment to reduce environmental impact and drive sustainable growth at scale, by joining the Science Based Targets initiative (SBTi) and setting greenhouse gas emissions reduction targets consistent with requirements to keep global warming well below 2 degrees Celsius.Already on track to reduce emissions across its manufacturing operations by 15 percent by the end of 2020, this expanded commitment will result in a further 10 percent emissions reduction across Mondelēz International’s value chain, over and above the impact of business growth – from farm to shelf – by 2025, compared to a 2018 baseline. The announcement follows Mondelēz International Chairman and Chief Executive Officer Dirk Van de Put’s signing of the United for Paris Agreement in December 2019.“We take climate change very seriously because of the negative impact it has on people and planet, including within our own value chain. Our sustainable snacking strategy puts us at the forefront of sustainable ingredient sourcing and continues our contribution to addressing climate change by reducing emissions,” said Van de Put.  “Setting science-based targets is an important step forward in further reducing our environmental impact, an imperative for sustainable growth as we live our purpose to empower people to snack right.”Mondelēz International’s 2025 sustainability goals are focused on making snacks with less energy, water and waste.  These goals are designed to address climate change in a meaningful way and are based on an end-to-end, science-based approach to reducing the company’s carbon footprint, including reducing absolute CO2 emissions from manufacturing and addressing deforestation in key raw material supply chains.  The science-based approach goes beyond the company’s owned operations (Scopes 1 and 2) and now includes the end-to-end carbon footprint (Scope 3) including operations outside of the company’s direct control such as farms producing raw materials and the production, use and disposal of packaging materials.The announcement furthers the company’s commitment to sharing progress regularly against its sustainability goals. Mondelēz International will issue its 2019 Snacking Made Right report, which will include progress toward its sustainability goals, later this year.“To date, Mondelēz International has focused on reducing emissions from company-owned operations and is on track to deliver against the commitment of reducing 15 percent absolute manufacturing emissions by the end of 2020 compared to a baseline of 2013,” said Christine Montenegro McGrath, Vice President of Sustainability and Global Impact at Mondelēz International.  “This new commitment addresses end-to-end greenhouse gas emissions reductions which include indirect emissions across the value chain and beyond the company’s direct control.  This announcement is another indication of our company’s commitment to sustainable growth at scale alongside enhanced disclosure and reporting of progress in an effort to deliver meaningful change.”Company recognized by Dow Jones Sustainability IndexMondelēz International continues to be recognized for its economic, environmental and social contributions. Each year since the company was created in 2012, Mondelēz International has been listed on the Dow Jones Sustainability Index (“DJSI”) – World and North American Indices. The DJSI selects the top 10% of global companies and top 20% of North American companies based on an extensive review of financial and sustainability programs within each industry. Mondelēz International is in the 95th percentile of its industry and achieved perfect scores in the areas of health & nutrition and addressing water-related risks. The company remains committed to continue this, and other related work in the areas of sustainable resources and agriculture, well-being snacks, community partnerships and safety of its products and people.About Science Based Targets initiative (SBTi)The Science Based Targets initiative mobilizes companies to set science-based targets and boost their competitive advantage in the transition to the low-carbon economy. It is a collaboration between CDP (Carbon Disclosure Project), the United Nations Global Compact, World Resources Institute (WRI), the World Wide Fund for Nature (WWF) and We Mean Business.The initiative defines and promotes best practice in science-based target setting, offers resources and guidance to reduce barriers to adoption, and independently assesses and approves companies’ targets. For more information, follow @sciencetargets and visit sciencebasedtargets.orgAbout Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as OREO, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ."
    },
    {
        "title": "Mondelēz International to Acquire Leading In-store Bakery Company, Give & Go",
        "subtitle": "",
        "date": "Feb 25, 2020 8:05AM EST",
        "content": "DEERFIELD, Ill., Feb.  25, 2020  (GLOBE NEWSWIRE) -- Mondelēz International today announced an agreement to acquire a significant majority interest in Give & Go, a North American leader in fully-finished sweet baked goods and owners of the famous “two-bite”® brand and the “Create-A-Treat”® brand known for cookie and gingerbread house decorating kits. Give & Go is being sold by funds affiliated with Thomas H. Lee Partners, L.P. (THL).With a leading position in brownies, cupcakes, pastries and muffins, as well as access to the fast-growing in-store bakery channel, the acquisition of Give & Go expands Mondelēz International’s leadership in broader snacking. Founded in 1989, Give & Go’s delicious and on-trend products are a complementary addition to Mondelēz International’s portfolio of global and local brands such as Oreo, Cadbury, Milka and belVita, as well as Tate’s Bake Shop and Perfect Snacks. The company has delivered attractive growth over the past several years with net revenues of approximately $500 million in 2019.“Our ambition is to lead the future of snacking by offering consumers a broad range of snacks in key growth channels and categories,” said Glen Walter, Executive Vice President and President, North America, for Mondelēz International. “Give & Go’s leading position in the large and fast-growing in-store bakery channel gives us a unique opportunity to expand into new, on-trend consumer spaces. Similar to our recent acquisitions of Perfect Snacks and Tate’s Bake Shop, this is yet another great example of our bolt-on acquisition strategy to establish foundations in faster growing snacking adjacencies. We look forward to working with Joel Flatt and the entire Give & Go management team to build upon their strong success.”“Our previous owner, THL, has been a great partner and invested significantly to grow our business. We are now very excited to be joining the Mondelēz International family and this amazing portfolio of iconic snack brands,” said Joel Flatt, President and CEO of Give & Go. “There are significant opportunities for us to accelerate the growth of our business by utilizing Mondelēz International’s unique capabilities, and our shared desire to invest in innovation that drives consumer engagement and deeper strategic retail partnerships.”As with other recent acquisitions such as Perfect Snacks, Mondelēz International will operate Give & Go separately in order to nurture its innovative and entrepreneurial spirit while providing access to consumer and channel insights, procurement and marketing resources to accelerate growth. After the deal closes, Give & Go’s senior leadership team will retain a minority interest in the company and continue to run the business from their existing headquarters. All Give & Go products will continue to be made at their current manufacturing locations.The transaction is subject to customary closing conditions and expected to close in the second quarter of 2020.  About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as OREO, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ. About Give & GoGive & Go Prepared Foods Corp is the leader in portion control, mini treats within the in-store bakery of retailers across North America. Give & Go produces fully-finished, sweet baked goods for every key season across four key consumer consumption occasions: Celebration Solutions, Breakfast Solutions, Everyday Treats and Better For You Snacking. Give & Go operates under our proprietary brands: two-bite®, Create-A-Treat®, Mason St. Bakehouse®, and The Worthy Crumb Pastry Co.®. The Company strives to remain at the forefront of innovation, both in product development and retailer solutions, based on consumer research and a deep understanding of our retail partners’ needs. Learn more at www.giveandgo.com and follow us on LinkedIn.Forward-Looking Statements This press release contains forward-looking statements. Words, and variations of words, such as “will,” “expect” and similar expressions are intended to identify these forward-looking statements, including, but not limited to, statements about the transaction, the expected results of the transaction and the timing for closing the transaction. These forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond Mondelēz International’s control, which could cause Mondelēz International’s actual results to differ materially from those indicated in these forward-looking statements. Please also see Mondelēz International’s risk factors, as they may be amended from time to time, set forth in its filings with the SEC, including its most recently filed Annual Report on Form 10-K. Mondelēz International disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation. "
    },
    {
        "title": "Mondelēz International Highlights Strategic Initiatives and Reaffirms Outlook at 2020 CAGNY Conference",
        "subtitle": "",
        "date": "Feb 18, 2020 12:55PM EST",
        "content": "BOCA RATON, Fla., Feb.  18, 2020  (GLOBE NEWSWIRE) -- Mondelēz International will today discuss the company’s strategic initiatives to deliver sustainable top- and bottom-line growth at the 2020 Consumer Analyst Group of New York (CAGNY) Conference. The company will also reiterate its 2020 financial outlook and long-term growth targets. Chairman and Chief Executive Officer Dirk Van de Put, together with Chief Financial Officer Luca Zaramella, will provide an overview of the company’s strong financial results and plans to drive long-term sales, earnings and free cash flow growth.“In the first full year following the launch of our strategic plan, Mondelēz International delivered accelerated top-line growth, robust earnings growth and improved free cash flow generation, demonstrating the power of our portfolio and that our strategy is working,” said Van de Put. “We are a fundamentally different company now after the changes we’ve made to drive sustainable growth. Increased investments in our global and local brands and capabilities, combined with improved execution, position us for continued performance.”Building a Consumer-Centric, Growth-Focused OrganizationAt the conference, Van de Put will highlight the company's progress on building a consumer-centric, growth-focused organization and culture.Over the past 18 months Mondelēz International has increased and rebalanced its investments in global and local brands, transitioned to a focus on volume-driven, profitable growth and moved from a centralized decision-making structure to a local-first approach with clear accountability and aligned incentives.  Local leaders are now empowered to capitalize on consumer insights, increasing the company’s agility and improving speed-to-market, with employees throughout the organization focused on generating profitable growth.Van de Put will outline how these changes have supported increasing brand relevance with consumers, share gains in core categories and a sustainable improvement in financial results.Van de Put will also provide an update on specific initiatives the company is executing in 2020 within each strategic focus area, as well as compelling growth opportunities the company sees ahead.Reiterating 2020 Outlook and Long-Term Growth TargetsMondelēz International reiterates its 2020 outlook, as well as long-term growth targets for:“We are pleased with our performance in 2019, including meeting or exceeding all of our financial targets,” said Zaramella. “Going forward, we will continue to focus on driving improved free-cash flow generation, an area where we already made significant progress in 2019. Continued execution against our strategy will enable us to consistently deliver results in line with our long-term growth algorithm.”Additional information on guidance, including any impact of coronavirus, will be discussed at the 2020 CAGNY Conference.Webcast and MaterialsA live audio webcast of today's presentation will be available in the investors section of the company's website (www.mondelezinternational.com), and an archived replay of the presentation with accompanying slides will be available on the website following the webcast. The company is live tweeting from the event at www.twitter.com/MDLZ.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.End NoteOrganic Net Revenue, Adjusted EPS, Free Cash Flow and presentation of amounts at constant currency are non-GAAP financial measures. For definitions of these non-GAAP financial measures and how the company uses them to evaluate performance, as well as why the company is not able to reconcile these forward-looking measures to their most directly comparable GAAP financial measures, please refer to \"Definitions of the Company's Non-GAAP Financial Measures\" and “Outlook” in Exhibit 99.1 to the company's Form 8-K furnished with the Securities and Exchange Commission on January 29, 2020.Forward-Looking StatementsThis press release contains a number of forward-looking statements. Words, and variations of words, such as “will,” “expect,” “plan,” “deliver,” “target,” “outlook” and similar expressions are intended to identify the company’s forward-looking statements, including, but not limited to, statements about: the company’s future performance, including its future revenue growth, earnings per share and cash flow; the company's strategic initiatives and growth opportunities; the company’s investments and execution; dividends; the company’s long-term financial targets; and the company’s outlook, including 2020 Organic Net Revenue growth, Adjusted EPS growth and Free Cash Flow. These forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the company’s control, which could cause the company’s actual results to differ materially from those indicated in the company’s forward-looking statements. Such factors include, but are not limited to, risks from operating globally including in emerging markets; changes in currency exchange rates, controls and restrictions; continued volatility of commodity and other input costs; weakness in economic conditions; weakness in consumer spending; pricing actions; tax matters including changes in tax rates and laws, disagreements with taxing authorities and imposition of new taxes; use of information technology and third party service providers; unanticipated disruptions to the company’s business, such as the malware incident, cyberattacks or other security breaches; competition; protection of the company's reputation and brand image; the company's ability to innovate and differentiate its products; legal, regulatory, tax or benefit law changes, claims or actions; the restructuring program and the company’s other transformation initiatives not yielding the anticipated benefits; and changes in the assumptions on which the restructuring program is based. Please also see the company’s risk factors, as they may be amended from time to time, set forth in its filings with the SEC, including the company’s most recently filed Annual Report on Form 10-K. Mondelēz International disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation."
    },
    {
        "title": "Mondelēz International to Present at CAGNY Conference on February 18",
        "subtitle": "",
        "date": "Feb 10, 2020 4:50PM EST",
        "content": "DEERFIELD, Ill., Feb.  10, 2020  (GLOBE NEWSWIRE) -- Mondelēz International, Inc. announced that Dirk Van de Put, Chairman and CEO, and Luca Zaramella, Chief Financial Officer, will present at the annual Consumer Analyst Group of New York (CAGNY) Conference in Boca Raton, Fla., on February 18 at 1 p.m. ET.A listen-only webcast will be provided at www.mondelezinternational.com and a replay of the event will also be available on the company's website.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as OREO, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.  "
    },
    {
        "title": "Mondelēz International Declares Regular Quarterly Dividend of $0.285 per Share",
        "subtitle": "",
        "date": "Feb 6, 2020 1:10PM EST",
        "content": "DEERFIELD, Ill., Feb.  06, 2020  (GLOBE NEWSWIRE) -- The Board of Directors of Mondelēz International, Inc. today declared a regular quarterly dividend of $0.285 per share of Class A common stock. This dividend is payable on April 14, 2020, to shareholders of record as of March 31, 2020.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as OREO, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ."
    },
    {
        "title": "Twist, Lick, Dunk! Mondelēz International Sets GUINNESS WORLD RECORDS Title for Most People Dunking Cookies to Celebrate $3 Billion OREO Sales Milestone",
        "subtitle": "",
        "date": "Jan 30, 2020 4:40PM EST",
        "content": "DEERFIELD, Ill., Jan.  30, 2020  (GLOBE NEWSWIRE) -- Mondelēz International, Inc. (NASDAQ:MDLZ) is taking playful cookie moments to the next level with a GUINNESS WORLD RECORDS title-attempt! Mondelēz International today announced the company set a GUINNESS WORLD RECORDS title for the most people dunking cookies across multiple venues.  The fun record attempt was coordinated to celebrate the OREO cookie brand reaching a major milestone of $3.1 billion in annual net revenues by end of 2019.  The record attempt began January 30 at 8:30AM CST when the Mondelēz International team across the world was invited to twist, lick and dunk OREO cookies simultaneously as part of a live streaming event. Employees from 55 locations representing 32 countries around the globe participated in the attempt, setting a new GUINNESS WORLD RECORDS title with 5,066 people dunking cookies. “We’re incredibly proud to be celebrating this sales milestone with the OREO brand, and taking a playful moment to recognize this achievement with the full Mondelēz International family around the world,” said Dirk Van de Put, Chairman and CEO, Mondelēz International. “We’re looking forward to the continued growth of the brand, and hopefully to many more records to come!” OREO is the world’s favorite cookie, available in more than 100 countries around the globe. Approximately 34 billion OREO cookies are sold each year – 92 million cookies per day – with 10 billion of those cookies sold in the U.S. annually. An estimated 500 billion OREO cookies have been sold since the first OREO biscuit was developed in 1912. OREO most recently announced the limited edition return of OREO “Most Stuf” cookies in the U.S., as well as new limited-edition flavors Caramel Coconut, Chocolate Marshmallow, and Tiramisu.  OREO is the largest brand owned by Mondelēz International, and one of six billion-dollar brands owned by the company, including Milka, Cadbury Dairy Milk, Ritz, Trident, and Halls. For more information about Mondelēz International, visit www.mondelezinternational.com.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as OREO, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/32bf6b3b-0779-42d6-b7e9-d24a300625f0"
    },
    {
        "title": "Mondelēz International Reports Q4 and FY 2019 Results",
        "subtitle": "",
        "date": "Jan 29, 2020 4:05PM EST",
        "content": "Full Year HighlightsFourth Quarter HighlightsDEERFIELD, Ill., Jan.  29, 2020  (GLOBE NEWSWIRE) --  Mondelēz International, Inc. (NASDAQ: MDLZ) today reported its fourth quarter 2019 results.  \"2019 was a major step forward for the company: Execution of our strategy, including investments in global and local brands, enabled us to deliver strong top-line performance and to meet or exceed all of our financial targets. We are increasingly confident that our incremental investments in brands and capabilities, emphasis on volume leverage and profit dollar growth will create a virtuous cycle that consistently delivers attractive top- and bottom- line growth and sustained free cash flow generation,\" said Dirk Van de Put, Chairman and CEO.Management ChangesGustavo Valle joins the company as President, Latin America, effective February 1, 2020. Gustavo has more than three decades of leadership experience across Latin America, North America and Europe. In more than 20 years at Danone, he held a breadth of positions and most recently led the global dairy division, having previously delivered business turnaround and managed through volatility as CEO Brazil and CEO Argentina.Key Strategic InitiativesThe company made strong progress against the strategies of accelerating consumer-centric growth, driving operational excellence and building a winning growth culture in 2019. Some highlights included:Net RevenueOperating Income and Diluted EPSFull Year CommentaryFourth Quarter Commentary2020 OutlookMondelēz International provides guidance on a non-GAAP basis, as the company cannot predict some elements that are included in reported GAAP results, including the impact of foreign exchange. Refer to the Outlook section in the discussion of non-GAAP financial measures below for more details.For 2020, the company expects performance in line with its long-term growth algorithm of 3+ percent Organic Net Revenue growth, high-single-digit percent Adjusted EPS growth on a constant-currency basis and Free Cash Flow of approximately $3 billion. For 2020, the company estimates currency translation would decrease net revenue growth by approximately 1 percent4 with no material impact to Adjusted EPS4.Conference CallMondelēz International will host a conference call for investors with accompanying slides to review its results at 5 p.m. ET today. A listen-only webcast will be provided at www.mondelezinternational.com. An archive of the webcast will be available on the company’s web site. The company will be live tweeting the event at www.twitter.com/MDLZ.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2019 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.End NotesAdditional DefinitionsEmerging markets consist of the Latin America region in its entirety; the Asia, Middle East and Africa region excluding Australia, New Zealand and Japan; and the following countries from the Europe region: Russia, Ukraine, Turkey, Kazakhstan, Belarus, Georgia, Poland, Czech Republic, Slovak Republic, Hungary, Bulgaria, Romania, the Baltics and the East Adriatic countries.Developed markets include the entire North America region, the Europe region excluding the countries included in the emerging markets definition, and Australia, New Zealand and Japan from the Asia, Middle East and Africa region.Forward-Looking StatementsThis press release contains a number of forward-looking statements. Words, and variations of words, such as “will,” “expect,” “may,” “would,” “could,” “should,” “estimate,” “guidance,” “outlook” and similar expressions are intended to identify the company’s forward-looking statements, including, but not limited to, statements about: the company’s future performance, including its future revenue growth, earnings per share and cash flow; currency and the effect of currency translation on the company’s results of operations; the company's strategy; the company's liability related to its withdrawal from the Bakery and Confectionery Union and Industry International Pension Fund; the company's ownership interest in Keurig Dr Pepper; and the company’s outlook, including 2020 Organic Net Revenue growth, Adjusted EPS growth and Free Cash Flow. These forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the company’s control, which could cause the company’s actual results to differ materially from those indicated in the company’s forward-looking statements. Such factors include, but are not limited to, risks from operating globally including in emerging markets; changes in currency exchange rates, controls and restrictions; continued volatility of commodity and other input costs; weakness in economic conditions; weakness in consumer spending; pricing actions; tax matters including changes in tax rates and laws, disagreements with taxing authorities and imposition of new taxes; use of information technology and third party service providers; unanticipated disruptions to the company’s business, such as the malware incident, cyberattacks or other security breaches; competition; protection of the company's reputation and brand image; the company's ability to innovate and differentiate its products; legal, regulatory, tax or benefit law changes, claims or actions; the restructuring program and the company’s other transformation initiatives not yielding the anticipated benefits; and changes in the assumptions on which the restructuring program is based. Please also see the company’s risk factors, as they may be amended from time to time, set forth in its filings with the SEC, including the company’s most recently filed Annual Report on Form 10-K. Mondelēz International disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.  Mondelēz International, Inc. and SubsidiariesReconciliation of GAAP and Non-GAAP Financial Measures(Unaudited)The company reports its financial results in accordance with accounting principles generally accepted in the United States (“GAAP”). However, management believes that also presenting certain non-GAAP financial measures provides additional information to facilitate the comparison of the company’s historical operating results and trends in its underlying operating results, and provides additional transparency on how the company evaluates its business. Management uses these non-GAAP financial measures in making financial, operating and planning decisions and in evaluating the company’s performance. The company also believes that presenting these measures allows investors to view its performance using the same measures that the company uses in evaluating its financial and business performance and trends.The company considers quantitative and qualitative factors in assessing whether to adjust for the impact of items that may be significant or that could affect an understanding of its ongoing financial and business performance and trends. The adjustments generally fall within the following categories: acquisition & divestiture activities, gains and losses on intangible asset sales and non-cash impairments, major program restructuring activities, constant currency and related adjustments, major program financing and hedging activities and other major items affecting comparability of operating results. See below for a description of adjustments to the company’s U.S. GAAP financial measures included herein.Non-GAAP information should be considered as supplemental in nature and is not meant to be considered in isolation or as a substitute for the related financial information prepared in accordance with U.S. GAAP. In addition, the company’s non-GAAP financial measures may not be the same as or comparable to similar non-GAAP measures presented by other companies.Because GAAP financial measures on a forward-looking basis are not accessible and reconciling information is not available without unreasonable effort, the company has not provided that information with regard to the non-GAAP financial measures in the company’s outlook. Refer to the Outlook section below for more details.DEFINITIONS OF THE COMPANY’S NON-GAAP FINANCIAL MEASURESThe company’s non-GAAP financial measures and corresponding metrics reflect how the company evaluates its operating results currently and provide improved comparability of operating results. As new events or circumstances arise, these definitions could change. When these definitions change, the company provides the updated definitions and presents the related non-GAAP historical results on a comparable basis. When items no longer impact the company’s current or future presentation of non-GAAP operating results, the company removes these items from its non-GAAP definitions. During the third quarter of 2019, the company added to the non-GAAP definitions the exclusion of the impact from Swiss tax reform.See the attached schedules for supplemental financial data and corresponding reconciliations of the non-GAAP financial measures referred to above to the most comparable GAAP financial measures for the three months and year ended December 31, 2019. See Items Impacting Comparability of Operating Results below for more information about the items referenced in these definitions.SEGMENT OPERATING INCOMEThe company uses segment operating income to evaluate segment performance and allocate resources. The company believes it is appropriate to disclose this measure to help investors analyze segment performance and trends. Segment operating income excludes unrealized gains and losses on hedging activities (which are a component of cost of sales), general corporate expenses (which are a component of selling, general and administrative expenses), amortization of intangibles, gains and losses on divestitures and acquisition-related costs (which are a component of selling, general and administrative expenses) in all periods presented. The company excludes these items from segment operating income in order to provide better transparency of its segment operating results. Furthermore, the company centrally manages benefit plan non-service income and interest and other expense, net. Accordingly, the company does not present these items by segment because they are excluded from the segment profitability measure that management reviews.ITEMS IMPACTING COMPARABILITY OF OPERATING RESULTSThe following information is provided to give qualitative and quantitative information related to items impacting comparability of operating results. The company identifies these based on how management views the company’s business; makes financial, operating and planning decisions; and evaluates the company’s ongoing performance. In addition, the company discloses the impact of changes in currency exchange rates on the company’s financial results in order to reflect results on a constant currency basis.Divestitures, Divestiture-related costs and Gains/(losses) on DivestituresDivestitures include completed sales of businesses and exits of major product lines upon completion of a sale or licensing agreement.Acquisitions, Acquisition-related costs and Acquisition integration costsOn July 16, 2019, the company acquired a majority interest in a U.S. refrigerated nutrition bar company, Perfect Snacks, within its North America segment. The acquisition added incremental net revenues of $27 million in the three months and $53 million in the year ended December 31, 2019.  In connection with this transaction, the company incurred acquisition-related costs of $1 million in the three months and $3 million in the year ended December 31, 2019.On June 7, 2018, the company acquired a U.S. premium biscuit company, Tate’s Bake Shop, within its North America segment and extended its premium biscuit offerings. Through the one-year anniversary of the acquisition, Tate's added incremental net revenues of $35 million in 2019. In addition, the company reversed accrued acquisition-related costs of $1 million in the three months and incurred $13 million of acquisition-related costs in the year ended December 31, 2018.Within the company’s AMEA segment, in connection with the acquisition of a biscuit operation in Vietnam in 2015, the company recorded integration costs of $4 million in the year ended December 31, 2018.Simplify to Grow ProgramOn September 6, 2018, the company's Board of Directors approved an extension of the restructuring program through 2022, an increase of $1.3 billion in the program charges and an increase of $700 million in capital expenditures. The current restructuring program, as increased and extended by these actions, is now called the Simplify to Grow Program. The primary objective of the Simplify to Grow Program is to reduce the company’s operating cost structure in both its supply chain and overhead costs. The program covers severance as well as asset disposals and other manufacturing and procurement-related one-time costs.Restructuring costsThe company recorded restructuring charges of $59 million in the three months and $176 million in the year ended December 31, 2019 and $96 million in the three months and $316 million in the year ended December 31, 2018 within asset impairment and exit costs and benefit plan non-service income. These charges were for non-cash asset write-downs (including accelerated depreciation and asset impairments), severance and other related costs.Implementation costsImplementation costs primarily relate to reorganizing the company’s operations and facilities in connection with its supply chain reinvention program and other identified productivity and cost saving initiatives. The costs include incremental expenses related to the closure of facilities, costs to terminate certain contracts and the simplification of the company’s information systems. The company recorded implementation costs of $79 million in the three months and $272 million in the year ended December 31, 2019 and $100 million in the three months and $315 million in the year ended December 31, 2018.Intangible asset impairment chargesDuring the company's 2019 annual testing of non-amortizable intangible assets, the company recorded $57 million of impairment charges in the third quarter of 2019 related to nine trademarks. The impairments arose due to lower than expected brand earnings growth. The company recorded charges related to gum, chocolate, biscuits and candy brands of $39 million in Europe, $15 million in AMEA and $3 million in Latin America. The impairment charges were recorded within asset impairment and exit costs.During the company's 2018 annual testing of non-amortizable intangible assets, the company recorded $68 million of impairment charges in the third quarter of 2018 related to five trademarks. The impairments arose due to lower than expected brand earnings growth. The company recorded charges related to gum, chocolate, biscuits and candy trademarks of $45 million in Europe, $14 million in North America and $9 million in AMEA. The impairment charges were recorded within asset impairment and exit costs.Mark-to-market impacts from commodity and currency derivative contractsThe company excludes unrealized gains and losses (mark-to-market impacts) from outstanding commodity and forecasted currency transaction derivatives from its non-GAAP earnings measures until such time that the related exposures impact its operating results. The company recorded net unrealized gains on commodity and forecasted currency transaction derivatives of $23 million in the three months and $90 million in the year ended December 31, 2019 and recorded net unrealized losses of $38 million in the three months and net unrealized gains of $142 million in the year ended December 31, 2018.Remeasurement of net monetary positionDuring the second quarter of 2018, primarily based on published estimates which indicated that Argentina's three-year cumulative inflation rate exceeded 100%, the company concluded that Argentina became a highly inflationary economy for accounting purposes. As of July 1, 2018, the company began to apply highly inflationary accounting for its Argentinian subsidiaries and changed their functional currency from the Argentinian peso to the U.S. dollar. On July 1, 2018, both monetary and non-monetary assets and liabilities denominated in Argentinian pesos were remeasured into U.S. dollars. As of each subsequent balance sheet date, Argentinian peso denominated monetary assets and liabilities were remeasured into U.S. dollars using the exchange rate as of the balance sheet date, with remeasurement and other transaction gains and losses recorded in net earnings. Within selling, general and administrative expenses, the company recorded a remeasurement gain of $6 million in the three months and $4 million in the year ended December 31, 2019, and a remeasurement gain of $2 million in the three months and a remeasurement loss of $11 million in the year ended December 31, 2018, within selling, general and administrative expenses related to the valuation of the Argentinian peso denominated net monetary assets over these periods.Impact from pension participation changesThe impact from pension participation changes represent the charges incurred when employee groups are withdrawn from multiemployer pension plans and other changes in employee group pension plan participation. The company excludes these charges from its non-GAAP results because those amounts do not reflect the company’s ongoing pension obligations.During 2018, the company executed a complete withdrawal from the Bakery and Confectionery Union and Industry International Pension Fund (\"Fund\") and recorded a $429 million estimate of the withdrawal liability. On July 11, 2019, the company received an undiscounted withdrawal liability assessment from the Fund totaling $526 million and requiring pro-rata monthly payments over 20 years and it recorded a $35 million final adjustment as of June 30, 2019. The company began making monthly payments during the third quarter. As of December 31, 2019, the remaining discounted withdrawal liability was $391 million, with $14 million recorded in other current liabilities and $377 million recorded in long-term other liabilities.Impact from resolution of tax mattersDuring the fourth quarter of 2019, in connection with a tax amnesty program in India, the company resolved several indirect tax matters and recorded $85 million of net indirect tax expenses within selling, general and administrative expenses.During the fourth quarter of 2018, the company resolved an indirect tax matter in Brazil and recorded a net benefit of $26 million in selling, general and administrative expenses.A tax indemnification matter related to the company's 2007 acquisition of the LU biscuit business was closed during the quarter ended June 30, 2018. The closure had no impact on net earnings; however, it did result in a $15 million tax benefit that was fully offset by an $11 million expense in selling, general and administrative expenses and a $4 million expense in interest and other expense, net.CEO transition remunerationOn November 20, 2017, Dirk Van de Put succeeded Irene Rosenfeld as CEO of Mondelēz International. In order to incent Mr. Van de Put to join the company, the company provided him compensation to make him whole for incentive awards he forfeited or grants that were not made to him when he left his former employer. In connection with Irene Rosenfeld’s retirement, the company made her outstanding grants of performance share units for the 2016-2018 and 2017-2019 performance cycles eligible for continued vesting and paid $0.5 million salary for her service as Chairman from January through March 2018. The company refers to these elements of Mr. Van de Put’s and Ms. Rosenfeld’s compensation arrangements together as “CEO transition remuneration.”The company is excluding amounts it expenses as CEO transition remuneration from its non-GAAP results because those amounts are not part of the company’s regular compensation program and are incremental to amounts the company would have incurred as ongoing CEO compensation. The company incurred CEO transition remuneration of $3 million in the three months and $12 million in the year ended December 31, 2019 and $4 million in the three months and $22 million in the year ended December 31, 2018.Gains/losses related to interest rate swapsWithin interest and other expense, net, the company recognized a loss of $111 million in the year ended December 31, 2019, and gains of $10 million in the year ended December 31, 2018, related to certain forward-starting interest rate swaps for which the planned timing and currency of the related forecasted debt was changed.Loss on debt extinguishmentOn April 17, 2018, the company completed a cash tender offer and retired $570 million of long-term U.S. dollar debt. The company recorded a loss on debt extinguishment of $140 million within interest and other expense, net related to the amount the company paid to retire the debt in excess of its carrying value and from recognizing unamortized discounts, deferred financing and other cash costs in earnings at the time of the debt extinguishment.U.S. tax reform discrete impactsOn December 22, 2017, new U.S. tax reform legislation was enacted that included a broad range of complex provisions impacting the taxation of businesses. In connection with implementing U.S. tax reform, the company recorded a discrete net tax expense of $5 million in 2019 and $19 million in 2018.Swiss tax reform impactsOn August 6, 2019, Switzerland published changes to its Federal tax law in the Official Federal Collection of Laws. On September 27, 2019, the Zurich Canton published their decision on the September 1, 2019 Zurich Canton public vote regarding the Cantonal changes associated with the Swiss Federal tax law change. The intent of these tax law changes was to replace certain preferential tax regimes with a new set of internationally accepted measures that are hereafter referred to as \"Swiss tax reform.\" Based on these Federal/Cantonal events, it is the company's position that enactment of Swiss tax reform for U.S. GAAP purposes has been met as of September 30, 2019, and the company recorded the impacts in the third quarter 2019. The net impact is a benefit of $767 million, which consists of a $769 million reduction in deferred tax expense primarily from an allowed step-up of intangible assets for tax purposes (recorded net of valuation allowance) and remeasurement of the company's deferred tax balances, partially offset by a $2 million indirect tax impact in selling, general and administrative expenses. The future rate impacts of these Swiss tax reform law changes are effective starting January 1, 2020.Gains and losses on equity method investment transactionsOn July 9, 2018, Keurig Green Mountain, Inc. (\"Keurig\") closed on its definitive merger agreement with Dr Pepper Snapple Group, Inc., and formed Keurig Dr Pepper Inc. (NYSE: \"KDP\"), a publicly traded company. Following the close of the transaction, the company's 24.2% investment in Keurig together with its shareholder loan receivable became a 13.8% investment in KDP. During the third quarter of 2018, the company recorded a preliminary pre-tax gain of $757 million reported as a gain on equity method transaction and $184 million of deferred tax expense reported in the provision for income taxes (or $573 million after-tax gain) related to the change in the company's ownership interest while KDP finalized the valuation for the transaction. During the company's fourth quarter of 2018, KDP finalized its opening balance sheet and the company increased its pre-tax gain by $21 million (or $13 million after-tax) to $778 million (or $586 million after-tax) while recording $8 million of deferred tax expense related to the increase for a total deferred tax expense of $192 million for 2018.As of December 31, 2019, the company held a 13.6% ownership interest in KDP valued at approximately $5.5 billion (based on KDP's closing stock price), which exceeded the carrying value of the company's KDP investment. The company's KDP ownership interest could change over time due to stock-based compensation arrangements and other KDP transactions. During the first quarter of 2019, due to the impact of a KDP acquisition that decreased the company's ownership from 13.8% to 13.6%, the company recognized a $23 million pre-tax gain.On March 7, 2016, the company exchanged a portion of its JDE equity interest for a new equity interest in Keurig. As a result of the exchange, the company recorded the difference between the $2 billion fair value of Keurig and the company's basis in the exchanged JDE shares as a gain of $43 million. In the second quarter of 2019, the company determined that an adjustment to accumulated other comprehensive losses related to its JDE investment was required, which reduced the company's previously reported gain by $29 million. The company recorded the adjustment as a loss on equity method transactions.During the second quarter of 2019, the company also recorded an additional pre-tax gain of $4 million related to the 2018 sale of one of its equity method investments. This additional gain relates to the release of funds previously held in escrow.Equity method investee adjustmentsWithin Adjusted EPS, the company’s equity method investment net earnings exclude its proportionate share of its investees’ unusual or infrequent items, such as acquisition and divestiture-related costs, restructuring program costs and discrete U.S. tax reform impacts recorded by the company's JDE and KDP equity method investees.Constant currencyManagement evaluates the operating performance of the company and its international subsidiaries on a constant currency basis. The company determines its constant currency operating results by dividing or multiplying, as appropriate, the current period local currency operating results by the currency exchange rates used to translate the company’s financial statements in the comparable prior-year period to determine what the current-period U.S. dollar operating results would have been if the currency exchange rate had not changed from the comparable prior-year period.OUTLOOKThe company’s outlook for 2020 Organic Net Revenue growth, Adjusted EPS growth on a constant currency basis and Free Cash Flow are non-GAAP financial measures that exclude or otherwise adjust for items impacting comparability of financial results such as the impact of changes in currency exchange rates, restructuring activities, acquisitions and divestitures. The company is not able to reconcile its projected Organic Net Revenue growth to its projected reported net revenue growth for the full-year 2020 because the company is unable to predict during this period the impact from potential acquisitions or divestitures, as well as the impact of currency translation due to the unpredictability of future changes in currency exchange rates, which could be material as a significant portion of the company’s operations are outside the U.S. The company is not able to reconcile its projected Adjusted EPS growth on a constant currency basis to its projected reported diluted EPS growth for the full-year 2020 because the company is unable to predict during this period the timing of its restructuring program costs, mark-to-market impacts from commodity and forecasted currency transaction derivative contracts and impacts from potential acquisitions or divestitures well as the impact of currency translation due to the unpredictability of future changes in currency exchange rates, which could be material as a significant portion of the company’s operations are outside the U.S. The company is not able to reconcile its projected Free Cash Flow to its projected net cash from operating activities for the full-year 2020 because the company is unable to predict during this period the timing and amount of capital expenditures impacting cash flow. Therefore, because of the uncertainty and variability of the nature and amount of future adjustments, which could be significant, the company is unable to provide a reconciliation of these measures without unreasonable effort.          "
    },
    {
        "title": "Mondelēz International to Report Q4 and Full-Year 2019 Financial Results on January 29, 2020",
        "subtitle": "",
        "date": "Jan 16, 2020 10:44AM EST",
        "content": "DEERFIELD, Ill., Jan.  16, 2020  (GLOBE NEWSWIRE) -- Mondelēz International, Inc. will release its fourth quarter and full-year 2019 financial results on Wednesday, Jan. 29, 2020 at 4:05 p.m. ET and will host a conference call at 5:00 p.m. ET that day.Investors and analysts may participate via phone by calling 1-800-322-9079 from the United States and 1-973-582-2717 from other locations. To ensure timely access, participants should dial in approximately 10 minutes before the call starts. A listen-only webcast will be provided at www.mondelezinternational.com.A replay of the conference call will be available until Feb. 08, 2020 by calling 1-855-859-2056 from the United States and 1-404-537-3406 from other locations. The access code for both the conference call and its rebroadcast is 9492979. An archive of the webcast will be available on the company's web site.The company will be live tweeting the event at www.twitter.com/MDLZ.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ. "
    },
    {
        "title": "Mondelēz International Appoints  Minsok Pak as Executive Vice President, Chief Strategy and Transformation Officer",
        "subtitle": "",
        "date": "Dec 17, 2019 4:05PM EST",
        "content": "DEERFIELD, Ill., Dec.  17, 2019  (GLOBE NEWSWIRE) -- Mondelēz International today announced that it has named Minsok Pak as Executive Vice President, Chief Strategy and Transformation Officer. In this role, he will be responsible for enterprise strategy as well as strategic growth opportunities, including M&A, new business and digital transformation initiatives. He will also lead SnackFutures, the company’s innovation and venture hub. Pak will report directly to Dirk Van de Put, Chairman and Chief Executive Officer, and will be a member of the Mondelēz International Leadership Team effective January 13, 2020.“Minsok brings extensive international experience developing and implementing enterprise strategies and growth initiatives in the consumer and retail sectors,” said Van de Put.  “His track record of accelerating growth and driving transformation, together with his detailed understanding of the global consumer landscape, will be an asset to Mondelēz International as we continue to lead the future of snacking. We are pleased to welcome him and look forward to his contributions to our future growth.” Pak joins from Target Corporation, where he was Executive Vice President and Chief Strategy and Innovation Officer. In this role, he had oversight of Target’s enterprise strategy and innovation efforts and helped lead the development and implementation of the company’s growth strategy. Prior to Target, he served as Senior Vice President, LEGO Retail/Shopper Marketing and Channel Development at The LEGO Group, based in London, where he led the company’s branded omnichannel retail business including e-commerce in more than 20 markets, and its shopper marketing and channel development efforts. He began his career at McKinsey & Company, where he spent nearly two decades in various roles, including Head of the Asia-Pacific Sales and Marketing, and other leadership positions in North American Supply Chain and Asia Consumer & Retail practices. “This is an exciting time for me to join Mondelēz International as the company continues to execute on its consumer-focused strategy and grow its strong portfolio of brands around the world,” said Pak. “I look forward to working with the team to identify new opportunities for growth and innovation.” Pak is a member of the Minnesota Orchestral Association Board and the Board of Trustees of Oberlin College. He received his B.A. degree, with honors, in Economics from Oberlin College and his MBA from Stanford University.  About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ."
    },
    {
        "title": "Mondelēz International Declares Regular Quarterly Dividend of $0.285 per Share",
        "subtitle": "",
        "date": "Dec 5, 2019 12:51PM EST",
        "content": "DEERFIELD, Ill., Dec.  05, 2019  (GLOBE NEWSWIRE) -- The Board of Directors of Mondelēz International, Inc. today declared a regular quarterly dividend of $0.285 per share of Class A common stock. This dividend is payable on January 14, 2020, to shareholders of record as of December 31, 2019.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.  "
    },
    {
        "title": "Mondelēz Global LLC Conducts Voluntary Recall of Limited Quantity of Cheese Nips (11 oz. Box) Product in the U.S. Due to Potential Presence of Foreign Material",
        "subtitle": "",
        "date": "Nov 15, 2019 2:47PM EST",
        "content": "EAST HANOVER, N.J., Nov.  15, 2019  (GLOBE NEWSWIRE) -- Mondelēz Global LLC announced today a voluntary recall of a limited quantity of Cheese Nips (11 oz. Box) product in the United States due to the potential presence of small food-grade yellow plastic pieces from a dough scraper that was incorporated into the production process of a small amount of product.  The company became aware of this issue when yellow plastic pieces were noticed on the manufacturing equipment. This recall is limited exclusively to the Cheese Nips product listed in the grid, available at retail stores nationwide.  No other Mondelēz Global LLC products nor any other geographies are included in or affected by this recall.There have been no reports of injury or illness reported to Mondelēz Global to date related to this product.Consumers who have this product should not eat it, and should discard any product they may have.  Consumers can contact the company at 1-844-366-1171, 24 hours a day to get more information about the recall, and Consumer Relations specialists are available Monday-Friday, 9am to 6pm EST.This recall is being conducted with the knowledge of the U.S. Food and Drug Administration.A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/1eb2907a-1b7a-44c9-8345-20c5f805e1ee "
    },
    {
        "title": "Mondelēz International Releases First-Ever State of Snacking™ Report Exploring Evolving Global Consumer Snacking Trends",
        "subtitle": "",
        "date": "Nov 11, 2019 11:00AM EST",
        "content": "DEERFIELD, Ill., Nov.  11, 2019  (GLOBE NEWSWIRE) -- Mondelēz International today announced the launch of its first-ever State of Snacking™ report, a global consumer trends study examining the role snacking plays across the world in meeting consumers’ evolving needs: busy modern lifestyles, the growing desire for community connection and a more holistic sense of wellbeing. The study reveals the rise of global snacking, underscored by regional parallels demonstrating how snacks are helping lead the future of food by delivering on the spectrum of needs that exists in our day-to-day lives.The State of Snacking report, developed in partnership with consumer polling specialist, The Harris Poll, complements Mondelēz International’s global snacking knowledge estate with new research conducted among thousands of consumers across twelve countries. The report sheds light on snacking as a growing behavior worldwide. Notably 6 in 10 adults worldwide (59%) say they prefer to eat many small meals throughout the day, as opposed to a few larger ones, with younger consumers especially leaning into snacks over meals as that number rises to 7 in 10 among Millennials (70%).Key findings from the 2019 State of Snacking report, which is available for download at www.stateofsnacking.com, includeOur relationship with food is fundamentally changing.Snacking is about so much more than what we eat.“As the snacking market continues to grow globally, we’re living our purpose to empower people to snack right by constantly learning about the many different ways consumers around the world are snacking and evolving their relationship with food,” said Dirk Van de Put, Chairman and CEO of Mondelēz International. “We see that the average global adult now eats more snacks than meals on a given day, driven by a number of evolving demands largely associated with how we live today, including a growing need for convenience, yearning to share nostalgic and cultural experiences, expanded wellbeing preferences and the desire for choices that range from wholesome to indulgent.”  Mondelēz International launches the State of Snacking report a year after it announced a new business strategy and purpose. Over the last year, the company made strong progress on its mission to offer consumers the right snack, for the right moment, made the right way. This includes developing an ever-deeper knowledge estate of the demands that motivate people to reach for snacks while continuing to meet people’s more holistic understanding of wellbeing by focusing on sustainably sourced essential ingredients, evolving its product portfolio to a broader range of options and inspiring mindful snacking habits.“We embrace the fact that snacking habits around the world are as diverse as the consumers who enjoy them,” continued Van de Put. “However people snack, they should not have to choose between snacking and eating right, or to worry about the impact their choices have on the world and their communities. That’s why we’re committed to empowering people to snack right.”About the research methodology This survey was conducted online by The Harris Poll on behalf of Mondelēz International from September 16 - 27, 2019, among 6,068 global adults ages 18 and older. The research spanned 12 markets, including: The United States (n=504), Canada (n=506), Mexico (n=505), Brazil (n=515), France (n=501), Germany (n=503), The United Kingdom (n=501), Russia (n=515), China (n=503), India (n=508), Indonesia (n=504), and Australia (n=504). Other key groups analyzed include: Centennials ages 18-22 (n=602), Millennials ages 23-38 (n=2404), Gen Xers ages 39-54 (n=1702), Boomers ages 55-73 (n=1236), and the Silent Generation ages 75+ (n=124). Data are weighted where necessary to bring them in line with their actual proportions in the population. A global post-weight was applied to ensure equal weight of each country in the global total.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ and https://twitter.com/dirkvandeput."
    },
    {
        "title": "Mondelēz International Reports Q3 Results and Raises Full-Year Outlook",
        "subtitle": "",
        "date": "Oct 29, 2019 4:05PM EDT",
        "content": "DEERFIELD, Ill., Oct.  29, 2019  (GLOBE NEWSWIRE) -- Mondelēz International, Inc. (NASDAQ: MDLZ) today reported its third quarter 2019 results.\"We are pleased to report another quarter of strong top-line growth, continuing the momentum of the first half, enabling us to further increase our outlook for the year. Our strategy to accelerate growth by focusing on the consumer, driving operational excellence and unlocking the potential of our local business units is delivering good results from both local and global brands,\" said Dirk Van de Put, Chairman and CEO.Key Strategic InitiativesThe company continued to make good progress against the strategies of accelerating consumer-centric growth, driving operational excellence and building a winning growth culture. Examples from the quarter included:Net RevenueOperating Income and Diluted EPSThird Quarter Commentary2019 OutlookMondelēz International provides guidance on a non-GAAP basis, as the company cannot predict some elements that are included in reported GAAP results, including the impact of foreign exchange. Refer to the Outlook section in the discussion of non-GAAP financial measures below for more details.After strong year-to-date performance, the company now expects Organic Net Revenue growth of 3.5+ percent. The company now expects Adjusted EPS growth of 5 to 7 percent on a constant-currency basis. The company estimates currency translation would decrease net revenue growth by approximately 4 percent3 with a negative $0.14 impact to Adjusted EPS3. In addition, the company continues to expect Free Cash Flow of approximately $2.8 billion.Conference CallMondelēz International will host a conference call for investors with accompanying slides to review its results at 5 p.m. ET today. A listen-only webcast will be provided at www.mondelezinternational.com. An archive of the webcast will be available on the company’s web site. The company will be live tweeting the event at www.twitter.com/MDLZ.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.End NotesAdditional DefinitionsEmerging markets consist of the Latin America region in its entirety; the Asia, Middle East and Africa region excluding Australia, New Zealand and Japan; and the following countries from the Europe region: Russia, Ukraine, Turkey, Kazakhstan, Belarus, Georgia, Poland, Czech Republic, Slovak Republic, Hungary, Bulgaria, Romania, the Baltics and the East Adriatic countries.Developed markets include the entire North America region, the Europe region excluding the countries included in the emerging markets definition, and Australia, New Zealand and Japan from the Asia, Middle East and Africa region.Forward-Looking StatementsThis press release contains a number of forward-looking statements. Words, and variations of words, such as “will,” “expect,” “may,” “would,” “could,” “estimate,” \"potential,\" “guidance,” “outlook” and similar expressions are intended to identify the company’s forward-looking statements, including, but not limited to, statements about: the company’s future performance, including its future revenue growth, earnings per share and cash flow; currency and the effect of currency translation on the company’s results of operations; the company's strategy; the company’s accounting for and the impact of U.S. and Swiss tax reform; the company's liability related to its withdrawal from the Bakery and Confectionery Union and Industry International Pension Fund; the company's ownership interest in Keurig Dr Pepper; and the company’s outlook, including 2019 Organic Net Revenue growth, Adjusted EPS growth and Free Cash Flow. These forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the company’s control, which could cause the company’s actual results to differ materially from those indicated in the company’s forward-looking statements. Such factors include, but are not limited to, risks from operating globally including in emerging markets; changes in currency exchange rates, controls and restrictions; continued volatility of commodity and other input costs; weakness in economic conditions; weakness in consumer spending; pricing actions; tax matters including changes in tax rates and laws, disagreements with taxing authorities and imposition of new taxes; use of information technology and third party service providers; unanticipated disruptions to the company’s business, such as the malware incident, cyberattacks or other security breaches; competition; protection of the company's reputation and brand image; the company's ability to innovate and differentiate its products; legal, regulatory, tax or benefit law changes, claims or actions; the restructuring program and the company’s other transformation initiatives not yielding the anticipated benefits; and changes in the assumptions on which the restructuring program is based. Please also see the company’s risk factors, as they may be amended from time to time, set forth in its filings with the SEC, including the company’s most recently filed Annual Report on Form 10-K. Mondelēz International disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.  Mondelēz International, Inc. and SubsidiariesReconciliation of GAAP and Non-GAAP Financial Measures(Unaudited)The company reports its financial results in accordance with accounting principles generally accepted in the United States (“GAAP”). However, management believes that also presenting certain non-GAAP financial measures provides additional information to facilitate the comparison of the company’s historical operating results and trends in its underlying operating results, and provides additional transparency on how the company evaluates its business. Management uses these non-GAAP financial measures in making financial, operating and planning decisions and in evaluating the company’s performance. The company also believes that presenting these measures allows investors to view its performance using the same measures that the company uses in evaluating its financial and business performance and trends.The company considers quantitative and qualitative factors in assessing whether to adjust for the impact of items that may be significant or that could affect an understanding of its ongoing financial and business performance and trends. The adjustments generally fall within the following categories: acquisition & divestiture activities, gains and losses on intangible asset sales and non-cash impairments, major program restructuring activities, constant currency and related adjustments, major program financing and hedging activities and other major items affecting comparability of operating results. See below for a description of adjustments to the company’s U.S. GAAP financial measures included herein.Non-GAAP information should be considered as supplemental in nature and is not meant to be considered in isolation or as a substitute for the related financial information prepared in accordance with U.S. GAAP. In addition, the company’s non-GAAP financial measures may not be the same as or comparable to similar non-GAAP measures presented by other companies.Because GAAP financial measures on a forward-looking basis are not accessible and reconciling information is not available without unreasonable effort, the company has not provided that information with regard to the non-GAAP financial measures in the company’s outlook. Refer to the Outlook section below for more details.DEFINITIONS OF THE COMPANY’S NON-GAAP FINANCIAL MEASURESThe company’s non-GAAP financial measures and corresponding metrics reflect how the company evaluates its operating results currently and provide improved comparability of operating results. As new events or circumstances arise, these definitions could change. When these definitions change, the company provides the updated definitions and presents the related non-GAAP historical results on a comparable basis. When items no longer impact the company’s current or future presentation of non-GAAP operating results, the company removes these items from its non-GAAP definitions. During the third quarter of 2019, the company added to the non-GAAP definitions the exclusion of the impact from Swiss tax reform.See the attached schedules for supplemental financial data and corresponding reconciliations of the non-GAAP financial measures referred to above to the most comparable GAAP financial measures for the three months and nine months ended September 30, 2019. See Items Impacting Comparability of Operating Results below for more information about the items referenced in these definitions.SEGMENT OPERATING INCOMEThe company uses segment operating income to evaluate segment performance and allocate resources. The company believes it is appropriate to disclose this measure to help investors analyze segment performance and trends. Segment operating income excludes unrealized gains and losses on hedging activities (which are a component of cost of sales), general corporate expenses (which are a component of selling, general and administrative expenses), amortization of intangibles, gains and losses on divestitures and acquisition-related costs (which are a component of selling, general and administrative expenses) in all periods presented. The company excludes these items from segment operating income in order to provide better transparency of its segment operating results. Furthermore, the company centrally manages benefit plan non-service income and interest and other expense, net. Accordingly, the company does not present these items by segment because they are excluded from the segment profitability measure that management reviews.ITEMS IMPACTING COMPARABILITY OF OPERATING RESULTSThe following information is provided to give qualitative and quantitative information related to items impacting comparability of operating results. The company identifies these based on how management views the company’s business; makes financial, operating and planning decisions; and evaluates the company’s ongoing performance. In addition, the company discloses the impact of changes in currency exchange rates on the company’s financial results in order to reflect results on a constant currency basis.Divestitures, Divestiture-related costs and Gains/(losses) on DivestituresDivestitures include completed sales of businesses and exits of major product lines upon completion of a sale or licensing agreement.Acquisitions, Acquisition-related costs and Acquisition integration costsOn July 16, 2019, the company acquired a majority interest in a U.S. refrigerated nutrition bar company, Perfect Snacks, within its North America segment. The acquisition added incremental net revenues of $26 million in the three and nine months ended September 30, 2019.  In connection with this transaction, the company incurred acquisition-related costs of $1 million in the three months and $2 million in the nine months ended September 30, 2019.On June 7, 2018, the company acquired a U.S. premium biscuit company, Tate’s Bake Shop, within its North America segment and extended its premium biscuit offerings. Through the one-year anniversary of the acquisition, Tate's added incremental net revenues of $35 million. In addition, the company incurred acquisition-related costs of $1 million in the three months and $14 million in the nine months ended September 30, 2018.Within the company’s AMEA segment, in connection with the acquisition of a biscuit operation in Vietnam in 2015, the company recorded integration costs of $1 million in the three months and incurred $4 million in the nine months ended September 30, 2018.Simplify to Grow ProgramOn September 6, 2018, the company's Board of Directors approved an extension of the restructuring program through 2022, an increase of $1.3 billion in the program charges and an increase of $700 million in capital expenditures. The current restructuring program, as increased and extended by these actions, is now called the Simplify to Grow Program. The primary objective of the Simplify to Grow Program is to reduce the company’s operating cost structure in both its supply chain and overhead costs. The program covers severance as well as asset disposals and other manufacturing and procurement-related one-time costs.Restructuring costsThe company recorded restructuring charges of $77 million in the three months and $117 million in the nine months ended September 30, 2019 and $56 million in the three months and $220 million in the nine months ended September 30, 2018 within asset impairment and exit costs and benefit plan non-service income. These charges were for non-cash asset write-downs (including accelerated depreciation and asset impairments), severance and other related costs.Implementation costsImplementation costs primarily relate to reorganizing the company’s operations and facilities in connection with its supply chain reinvention program and other identified productivity and cost saving initiatives. The costs include incremental expenses related to the closure of facilities, costs to terminate certain contracts and the simplification of the company’s information systems. The company recorded implementation costs of $75 million in the three months and $193 million in the nine months ended September 30, 2019 and $83 million in the three months and $215 million in the nine months ended September 30, 2018.Intangible asset impairment chargesDuring the company's 2019 annual testing of non-amortizable intangible assets, the company recorded $57 million of impairment charges in the third quarter of 2019 related to nine trademarks. The impairments arose due to lower than expected brand earnings growth. The company recorded charges related to gum, chocolate, biscuits and candy brands of $39 million in Europe, $15 million in AMEA and $3 million in Latin America. The impairment charges were recorded within asset impairment and exit costs.During the company's 2018 annual testing of non-amortizable intangible assets, the company recorded $68 million of impairment charges in the third quarter of 2018 related to five trademarks. The impairments arose due to lower than expected brand earnings growth. The company recorded charges related to gum, chocolate, biscuits and candy trademarks of $45 million in Europe, $14 million in North America and $9 million in AMEA. The impairment charges were recorded within asset impairment and exit costs.Mark-to-market impacts from commodity and currency derivative contractsThe company excludes unrealized gains and losses (mark-to-market impacts) from outstanding commodity and forecasted currency transaction derivatives from its non-GAAP earnings measures until such time that the related exposures impact its operating results. The company recorded net unrealized gains on commodity and forecasted currency transaction derivatives of $18 million in the three months and $67 million in the nine months ended September 30, 2019 and recorded net unrealized losses of $113 million in the three months and net unrealized gains of $180 million in the nine months ended September 30, 2018.Remeasurement of net monetary positionDuring the second quarter of 2018, primarily based on published estimates which indicated that Argentina's three-year cumulative inflation rate exceeded 100%, the company concluded that Argentina became a highly inflationary economy for accounting purposes. As of July 1, 2018, the company began to apply highly inflationary accounting for its Argentinian subsidiaries and changed their functional currency from the Argentinian peso to the U.S. dollar. On July 1, 2018, both monetary and non-monetary assets and liabilities denominated in Argentinian pesos were remeasured into U.S. dollars. As of each subsequent balance sheet date, Argentinian peso denominated monetary assets and liabilities were remeasured into U.S. dollars using the exchange rate as of the balance sheet date, with remeasurement and other transaction gains and losses recorded in net earnings. Within selling, general and administrative expenses, the company recorded a remeasurement loss of $1 million in the three months and $2 million in the nine months ended September 30, 2019 as well as a remeasurement loss of $13 million in the three and nine months ended September 30, 2018, within selling, general and administrative expenses related to the valuation of the Argentinian peso denominated net monetary assets over these periods.Impact from pension participation changesThe impact from pension participation changes represent the charges incurred when employee groups are withdrawn from multiemployer pension plans and other changes in employee group pension plan participation. The company excludes these charges from its non-GAAP results because those amounts do not reflect the company’s ongoing pension obligations.During 2018, the company executed a complete withdrawal from the Bakery and Confectionery Union and Industry International Pension Fund (\"Fund\") and recorded a $429 million estimate of the withdrawal liability. On July 11, 2019, the company received an undiscounted withdrawal liability assessment from the Fund totaling $526 million and requiring pro-rata monthly payments over 20 years and we recorded a $35 million final adjustment as of June 30,2019. The company began making monthly payments during the third quarter. As of September 30, 2019, the remaining discounted withdrawal liability was $394 million, with $14 million recorded in other current liabilities and $380 million recorded in long-term other liabilities.Impact from resolution of tax mattersA tax indemnification matter related to the company's 2007 acquisition of the LU biscuit business was closed during the three months ended June 30, 2018. The closure had no impact on net earnings; however, it did result in a $15 million tax benefit that was fully offset by an $11 million expense in selling, general and administrative expenses and a $4 million expense in interest and other expense, net.CEO transition remunerationOn November 20, 2017, Dirk Van de Put succeeded Irene Rosenfeld as CEO of Mondelēz International. In order to incent Mr. Van de Put to join the company, the company provided him compensation to make him whole for incentive awards he forfeited or grants that were not made to him when he left his former employer. In connection with Irene Rosenfeld’s retirement, the company made her outstanding grants of performance share units for the 2016-2018 and 2017-2019 performance cycles eligible for continued vesting and paid $0.5 million salary for her service as Chairman from January through March 2018. The company refers to these elements of Mr. Van de Put’s and Ms. Rosenfeld’s compensation arrangements together as “CEO transition remuneration.”The company is excluding amounts it expenses as CEO transition remuneration from its non-GAAP results because those amounts are not part of the company’s regular compensation program and are incremental to amounts the company would have incurred as ongoing CEO compensation. The company incurred CEO transition remuneration of $3 million in the three months and $9 million in the nine months ended September 30, 2019 and $4 million in the three months and $18 million in the nine months ended September 30, 2018.Gains/losses related to interest rate swapsWithin interest and other expense, net, the company recognized a loss of $111 million in the three and nine months ended September 30, 2019, and gains of $1 million in the three months and $10 million in the nine months ended September 30, 2018, related to certain forward-starting interest rate swaps for which the planned timing and currency of the related forecasted debt was changed.Loss on debt extinguishmentOn April 17, 2018, the company completed a cash tender offer and retired $570 million of long-term U.S. dollar debt. The company recorded a loss on debt extinguishment of $140 million within interest and other expense, net related to the amount the company paid to retire the debt in excess of its carrying value and from recognizing unamortized discounts, deferred financing and other cash costs in earnings at the time of the debt extinguishment.U.S. tax reform discrete impactsOn December 22, 2017, the United States enacted tax reform legislation that included a broad range of business tax provisions, including but not limited to a reduction in the U.S. federal tax rate from 35% to 21%, as well as provisions that limit or eliminate various deductions or credits. The legislation also causes U.S. allocated expenses (e.g. interest and general administrative expense) to be taxed and imposes a new tax on U.S. cross-border payments. Furthermore, the legislation includes a one-time transition tax on accumulated foreign earnings and profits. While clarifying guidance was issued by the Internal Revenue Service (\"IRS\") during 2018, further tax legislative guidance is expected during 2019.During the nine months ended September 30, 2018, the company recorded $96 million in discrete net tax costs primarily comprised of an increase to its transition tax liability of $89 million as a result of additional guidance issued by the IRS and various state taxing authorities, new state legislation enacted during the period and further refinement of various components of the underlying calculations.Swiss tax reform impactsOn August 6, 2019, Switzerland published changes to its Federal tax law in the Official Federal Collection of Laws. On September 27, 2019, the Zurich Canton published their decision on the September 1, 2019 Zurich Canton public vote regarding the Cantonal changes associated with the Swiss Federal tax law change. The intent of these tax law changes was to replace certain preferential tax regimes with a new set of internationally accepted measures that are hereafter referred to as \"Swiss tax reform.\" Based on these Federal/Cantonal events, it is the company's position that enactment of Swiss tax reform for U.S. GAAP purposes has been met as of September 30, 2019, and the company recorded the impacts in the third quarter 2019. The net impact is a benefit of $767 million, which consists of a $769 million reduction in deferred tax expense primarily from an allowed step-up of intangible assets for tax purposes (recorded net of valuation allowance) and remeasurement of the company's deferred tax balances, partially offset by a $2 million indirect tax impact in selling, general and administrative expenses. The future rate impacts of these Swiss tax reform law changes are effective starting January 1, 2020.Gains and losses on equity method investment transactionsOn July 9, 2018, Keurig Green Mountain, Inc. (\"Keurig\") closed on its definitive merger agreement with Dr Pepper Snapple Group, Inc., and formed Keurig Dr Pepper Inc. (NYSE: \"KDP\"), a publicly traded company. Following the close of the transaction, the company's 24.2% investment in Keurig together with its shareholder loan receivable became a 13.8% investment in KDP. During the third quarter of 2018, the company recorded a preliminary pre-tax gain of $757 million reported as a gain on equity method transaction and $184 million of deferred tax expense reported in the provision for income taxes (or $573 million after-tax gain) related to the change in the company's ownership interest while KDP finalized the valuation for the transaction. During the company's fourth quarter of 2018, KDP finalized its opening balance sheet and the company increased its pre-tax gain by $21 million (or $13 million after-tax) to $778 million (or $586 million after-tax) while recording $8 million of deferred tax expense related to the increase for a total deferred tax expense of $192 million for 2018.As of September 30, 2019, the company held a 13.6% ownership interest in KDP. The company's ownership interest in KDP may change over time due to stock-based compensation arrangements and other transactions by KDP. During the first quarter of 2019, the company recognized a $23 million pre-tax gain related to the impact of a KDP acquisition that decreased the company's ownership interest from 13.8% to 13.6%.On March 7, 2016, the company exchanged a portion of its 43.5% JDE equity interest for a new equity interest in Keurig. Following the transaction, the company's JDE equity interest became 26.5% and the company's new Keurig equity interest was 24.2%. During the first quarter of 2016, the company recorded the difference between the $2 billion fair value of Keurig and the company's basis in the exchanged JDE shares as a gain of $43 million. In the second quarter of 2019, the company determined that an adjustment to accumulated other comprehensive losses related to its JDE investment was required, which reduced the company's previously reported gain by $29 million. The company recorded the adjustment as a loss on equity method transactions in the second quarter.During the second quarter of 2019, the company also recorded an additional pre-tax gain of $4 million related to the 2018 sale of one of its equity method investments. This additional gain relates to the release of funds previously held in escrow.Equity method investee adjustmentsWithin Adjusted EPS, the company’s equity method investment net earnings exclude its proportionate share of its investees’ unusual or infrequent items, such as acquisition and divestiture-related costs, restructuring program costs and discrete U.S. tax reform impacts recorded by the company's JDE and KDP equity method investees.Constant currencyManagement evaluates the operating performance of the company and its international subsidiaries on a constant currency basis. The company determines its constant currency operating results by dividing or multiplying, as appropriate, the current period local currency operating results by the currency exchange rates used to translate the company’s financial statements in the comparable prior-year period to determine what the current-period U.S. dollar operating results would have been if the currency exchange rate had not changed from the comparable prior-year period.OUTLOOKThe company’s outlook for 2019 Organic Net Revenue growth, Adjusted EPS growth on a constant currency basis and Free Cash Flow are non-GAAP financial measures that exclude or otherwise adjust for items impacting comparability of financial results such as the impact of changes in currency exchange rates, restructuring activities, acquisitions and divestitures. The company is not able to reconcile its projected Organic Net Revenue growth to its projected reported net revenue growth for the full-year 2019 because the company is unable to predict during this period the impact from potential acquisitions or divestitures, as well as the impact of currency translation due to the unpredictability of future changes in currency exchange rates, which could be material as a significant portion of the company’s operations are outside the U.S. The company is not able to reconcile its projected Adjusted EPS growth on a constant currency basis to its projected reported diluted EPS growth for the full-year 2019 because the company is unable to predict during this period the timing of its restructuring program costs, mark-to-market impacts from commodity and forecasted currency transaction derivative contracts and impacts from potential acquisitions or divestitures well as the impact of currency translation due to the unpredictability of future changes in currency exchange rates, which could be material as a significant portion of the company’s operations are outside the U.S. The company is not able to reconcile its projected Free Cash Flow to its projected net cash from operating activities for the full-year 2019 because the company is unable to predict during this period the timing and amount of capital expenditures impacting cash flow. Therefore, because of the uncertainty and variability of the nature and amount of future adjustments, which could be significant, the company is unable to provide a reconciliation of these measures without unreasonable effort.             "
    },
    {
        "title": "Mondelēz International to Report Q3 Earnings on October 29, 2019",
        "subtitle": "",
        "date": "Oct 10, 2019 9:00AM EDT",
        "content": "DEERFIELD, Ill., Oct.  10, 2019  (GLOBE NEWSWIRE) -- Mondelēz International, Inc. will release its third quarter 2019 financial results on Tuesday, October 29, 2019 at 4:05 p.m. ET and will host a conference call at 5:00 p.m. ET that day.Investors and analysts may participate via phone by calling 1-800-322-9079 from the United States and 1-973-582-2717 from other locations. To ensure timely access, participants should dial in approximately 10 minutes before the call starts. A listen-only webcast will be provided at www.mondelezinternational.com.A replay of the conference call will be available until November 8, 2019 by calling 1-855-859-2056 from the United States and 1-404-537-3406 from other locations. The access code for both the conference call and its rebroadcast is 3587907. An archive of the webcast will be available on the company's web site.The company will be live tweeting the event at http://www.twitter.com/MDLZ.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in over 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor’s 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ."
    },
    {
        "title": "A 'Nutter' Big Birthday Celebration at 7-Eleven",
        "subtitle": "Retailer Commemorates NUTTER BUTTER Sandwich Cookies' 50<sup>th</sup> Anniversary with Exclusive Peanut Butter Cookie-flavored Lattes, Filled Donuts, Plus Free Cookies on National Peanut Butter Cookie Day",
        "date": "Jun 12, 2019 9:30AM EDT",
        "content": "IRVING, Texas, June 12, 2019 /PRNewswire/ -- This year marks the 50th anniversary of America's favorite peanut butter cookie, and 7-Eleven® customers can \"Go Nuts!\" Participating stores are celebrating with an exclusive NUTTER BUTTER Cookie-flavored latte and free cookies on National Peanut Butter Cookie Day, which is Wednesday, June 12. Real cookie crumbles are incorporated into the NUTTER BUTTER lattes. 7-Eleven also worked with Mondelēz International to develop a special fresh bakery item for the NUTTER BUTTER \"Go Nuts!\" 50th anniversary celebration. The delicious result is a long john donut with peanut butter filling, chocolate icing and topped with a full-size NUTTER BUTTER cookie.Billed as \"The Peanut Butter Lovers' Cookie,\" NUTTER BUTTER sandwich cookies with peanut butter filling were introduced to the public in 1969. \"Some of our most popular hot beverages are ones that incorporate an established and much-loved cookie or candy flavor,\" said Michelle Cram, 7-Eleven senior category manager for hot beverages. \"NUTTER BUTTER is the peanut butter cookie brand in the U.S. and the only one we considered when we created our first peanut butter cookie latte.\"Free NUTTER BUTTER sandwich cookies will be available June 12, on National Peanut Butter Cookie Day. The single-serving packages will be given out free at participating stores while supplies last. The round fudge-covered version was created as part of the Go Nuts! Year-long promotion. The special offer is only available to registered members of the retailer's 7Rewards® loyalty program. Customers can scan their 7‑Eleven app or member card or enter their linked phone number at time of purchase.\"Peanut butter-lovers can celebrate NUTTER BUTTER Cookie's 50th birthday all day long at 7-Eleven with a latte and donut in the morning, and cookies in the afternoon,\" Cram said. \"It's a delicious way to go nuts!\" Suggested retail price for a NUTTER BUTTER latte is the same as other 7-Eleven hot beverages and determined by the size of the cup.About 7-Eleven, Inc.7‑Eleven, Inc. is the premier name and largest chain in the convenience-retailing industry. Based in Irving, Texas, 7‑Eleven operates, franchises and/or licenses more than 68,000 stores in 17 countries, including 11,800 in North America. Known for its iconic brands such as Slurpee®, Big Bite® and Big Gulp®, 7‑Eleven has expanded into high-quality sandwiches, salads, side dishes, cut fruit and protein boxes, as well as pizza, chicken wings and mini beef tacos. 7‑Eleven offers customers industry-leading private brand products under the 7-Select® brand including healthy options, decadent treats and everyday favorites, at an outstanding value. Customers can earn and redeem points on various items in stores nationwide through its 7Rewards® loyalty program, place an order in the 7NOW® delivery app in 27 participating markets, or rely on 7-Eleven for bill payments, self-service lockers and other convenient services. Find out more online at www.7-Eleven.com, via the 7Rewards customer loyalty platform on the 7-Eleven mobile app, or on social media at Facebook, Twitter and Instagram.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in approximately 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor's 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.  View original content to download multimedia:http://www.prnewswire.com/news-releases/a-nutter-big-birthday-celebration-at-7-eleven-300866330.htmlSOURCE  7-Eleven, Inc."
    },
    {
        "title": "NUTTER BUTTER Cookie Celebrates 50   Birthday with a Summer-Long Celebration Paying Tribute to the Last Five \"Nutty Decades\"",
        "subtitle": "Brand invites consumers to join in their birthday celebration with Nostalgic Pack Designs, Creative Content, Consumer Sweepstakes and Nutty Collaboration",
        "date": "Jun 12, 2019 8:00AM EDT",
        "content": "EAST HANOVER, N.J., June 12, 2019 /PRNewswire/ -- Today, the NUTTER BUTTER brand is celebrating its favorite holiday, National Peanut Butter Cookie Day, and kicking off a summer full of birthday activities that pay tribute to the last 50 years of American cultural moments and trends. Since its launch in 1969, the NUTTER BUTTER cookie has become America's favorite peanut butter sandwich cookie, pleasing fans with its signature look, shape and taste through the 70s, 80s, 90s and into the new millennium. As each of the decades were nutty in their own way, the cookie is paying tribute to all 50 years through limited-edition packaging designs, creative digital content, consumer sweepstakes, sampling events and a quirky brand collaboration.\"A lot has changed in the last fifty years, but one thing has remained a classic: the nutty taste of our iconic peanut butter sandwich cookie,\" shared Tracey Benitz, NUTTER BUTTER Associate Director. \"NUTTER BUTTER has seen it all! In celebration of our milestone birthday, we are excited to take peanut butter lovers on a journey back in time reliving their nuttiest memories over last five decades through imaginative digital memes and videos, retro package designs, custom apparel and more.\" This month NUTTER BUTTER is unveiling unique limited-edition package designs for NUTTER BUTTER Creme Patties, Rounds, and Peanut-Shaped Family Size Cookies. The six nostalgic designs celebrate the brand's 50-year history and nutty personality, with prints ranging from 60s tie-dye to today's emoji craze. The limited-edition packs will be available nationwide wherever NUTTER BUTTER cookies are sold, while supplies last.As part of the nostalgic celebrations, NUTTER BUTTER collaborated with Johnny Cupcakes, a quirky clothing brand, to create a line of nutty limited-edition anniversary t-shirts. The apparel features pop culture references from the last 50 years and fans will have a chance to snag a t-shirt at two upcoming NUTTER BUTTER birthday party consumer sampling events.\"Collaborating and adding our signature quirky vision with a special brand from my childhood has been a blast!\" shared Johnny Earle aka Johnny Cupcakes. \"I'm excited to sandwich our worlds together by creating a fun experience for both of our customers!\" The first event will take place on National Peanut Butter Cookie Day (June 12, 2019) at the 7-Eleven Flatiron store, located on 182 5th Ave, New York, NY, from 12-4pm EST. The second will take place at the Johnny Cupcakes store, located on 279 Newbury St, in Boston, MA, on July 13, 2019 from 1-4pm EST.  Both birthday parties will include meet and greets with Johnny himself, as he personally hands out the special edition Johnny Cupcakes x NUTTER BUTTER T-shirts and NUTTER BUTTER cookie samples. T-shirts and cookies will be available free of charge at the two celebrations, while supplies last. At 7-Eleven, Krispy Kreme NUTTER BUTTER Cookie Twist Donuts and NUTTER BUTTER Lattes will also be available for purchase. To keep the nuttiness going all summer long, the brand created digital videos and images that cleverly portray the iconic peanut-shaped cookie in character traveling back in time through the decades. The creative content showcases the brand's longevity and reminds us of the notable moments, catch phrases that became vernacular, and decade-defining hair styles that made the last fifty years memorable. Lastly, the brand is inviting fans to join in the birthday festivities by introducing the NUTTER BUTTER Cookie's 5 Nutty Decades Sweepstakes. Beginning June 12th through August 31st, 2019, the promotion encourages fans to showcase how they are celebrating the brand's birthday for the chance to win a trip to one of the iconic destinations that defined the decades! Winning fans will dance their way to New York City to revive 70s era disco or jet to the California zip code that defined the 90s. To enter, fans must take a nutty photo with NUTTER BUTTER cookies and upload it to www.NUTTERBUTTER.com. Fans can enter once per day throughout the span of the sweepstakes. For more information on the upcoming sampling events and 5 Nutty Decades Sweepstakes, fans can visit www.NUTTERBUTTER.com.NO PURCHASE NECESSARY TO ENTER THE CELEBRATE 5 NUTTY DECADES. Sweepstakes starts 12:00 am ET on 6/12/19 and ends 11:59 pm ET on 8/31/19. Open to residents of the 50 U.S. (& D.C.) and Puerto Rico, 18 and older. Enter online at nutterbutter.com See Official Rules for free method of entry.6 Prizes: VIP trips to Woodstock, NY; New York, NY; Daytona Beach, FL; Beverly Hills, CA; Orlando, FL or Austin, TX. Trip prizes, see Official Rules for details. ARV: from $8,200 - $10,100 ea. Odds of winning depend on number of eligible entries received during Sweepstakes period. Void where prohibited.Sponsor: Mondelēz Global, LLC, 100 Deforest Ave., East Hanover, NJ 07936-2813.About NUTTER BUTTERNUTTER BUTTER is a classic sandwich cookie with a peanut butter filling, which was introduced in the U.S. in 1969. NUTTER BUTTER cookies are made with real peanut butter, and are a favorite of peanut butter lovers across the country. NUTTER BUTTER is the #1-selling cookie in the peanut butter sandwich category. For more information, visit www.NUTTERBUTTER.comAbout Mondelēz InternationalMondelēz International, Inc. (NASDAQ: MDLZ) empowers people to snack right in approximately 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, and Tate's Bake Shop biscuits; Enjoy Life snacks; Cadbury Dairy Milk, Toblerone and Green & Black's chocolate. Mondelēz International is a proud member of the Standard and Poor's 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.About Johnny CupcakesFounded in 2001 by Johnny Earle, Johnny Cupcakes is known as \"the world's first shirt bakery.\" Johnny Cupcakes is a clothing company largely focused on graphic t-shirts that playfully address pop-culture with a culinary twist. Johnny's frosting-scented retail stores resemble vintage bakeries, displaying limited edition graphic t-shirts inside of refrigerators. Over the past 18 years, Johnny Cupcakes has amassed an international following of customers and die-hard collectors who have Johnny Cupcakes tattoos and who have camped outside the stores for up to two weeks in anticipation for exclusive product. For more information, visit www.johnnycupcakes.com or follow Johnny on Instagram at www.Instagram.com/johnnycupcakes and on Twitter at www.twitter.com/johnnycupcakes.Media ContactDanielle DexterWeber Shandwickddexter@webershandwick.com212-546-7818Mondelez Internationalnews@mdlz.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/nutter-butter-cookie-celebrates-50th-birthday-with-a-summer-long-celebration-paying-tribute-to-the-last-five-nutty-decades-300865832.htmlSOURCE  Mondelez International"
    },
    {
        "title": "Mondelez International Makes Minority Investment in Hu, a Healthy-Lifestyle Snacking Company",
        "subtitle": "",
        "date": "Apr 18, 2019 9:00AM EDT",
        "content": "DEERFIELD, Ill., April 18, 2019 (GLOBE NEWSWIRE) -- Mondelēz International announced today it has made a minority investment in Hu (as in \"Human\") Master Holdings, the parent company of both Hu Products and Hu Kitchen, a fast-growing US-based snacking company offering minimally processed, high-quality snacks. This is the second venture investment Mondelēz International is making as part of SnackFutures, its innovation and venture hub aimed at unlocking snacking growth opportunities around the world. This investment falls into two of SnackFutures' high-growth strategic priorities: well-being and premium.Founded in 2012 as a family business by Jason H. Karp and siblings Jordan Brown and Jessica (Brown) Karp, Hu began as Hu Kitchen in New York City, a high-end kitchen and market focused on delicious, paleo-inspired foods with simple, real ingredients. The Hu Kitchen market section quickly became a proof-of-concept CPG testing ground, prompting the company to expand its medal-winning, vegan and paleo-friendly chocolate products (free of refined sugar, soy, dairy and gluten). Today, Hu has developed into a premium, multi-SKU brand portfolio of wellness-focused, vegan/paleo-friendly snacking products with a devoted following.\"As the global snacking leader, we're on a mission to lead the future of snacking and push the boundaries of what's possible. Investing in Hu offers our company an opportunity to do exactly that,\" said Tim Cofer, Executive Vice President and Chief Growth Officer of Mondelēz International. \"The Hu brand sits at the convergence of key growing consumer trends. Building on its initial success in chocolate, we believe there's an exciting opportunity to continue expanding the Hu proposition into a broad health-focused snacking platform across categories. And, with an in-house test kitchen and insights lab, they have a unique ability to quickly test and learn.\"\"Jordan, Jessica and I started Hu because we wanted a place where we could trust and understand every ingredient in our food,\" said Jason H. Karp, Chairman and Co-Founder of Hu. We chose Mondelēz International as a minority investor because we believe their resources, strengths and progressive vision of SnackFutures can help us accelerate positive change within snacking. This partnership should allow the Hu platform to grow and reach more people in a better and broader way than on our own.\"Co-founder Jordan Brown added: \"Hu is our passion, and we're thrilled to fuel its growth with Mondelēz International as our partner. Our perpetual goal is to marry great taste with no weird ingredients, and we're big believers that using these simpler ingredients can make people feel and perform better than they thought possible. Our new partnership will help us advance this ‘Get Back To Human' concept to a global audience.\"About Mondelēz InternationalMondelēz International, Inc. (NASDAQ:MDLZ) empowers people to snack right in approximately 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, and Tate's Bake Shop biscuits; Enjoy Life snacks; Cadbury Dairy Milk, Toblerone and Green & Black's chocolate. Mondelēz International is a proud member of the Standard and Poor's 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.About SnackFuturesSupported by an unconventional ecosystem of best-in-class internal experts and external partners around the globe, SnackFutures is designed as an independent hub that brings three core tenets of growth under one umbrella to accelerate innovation: invention of new brands and businesses; reinvention of small-scale brands with large-scale potential, and venture investments with start-up entrepreneurs. Check https://www.snackfutures.com/ for more information on how entrepreneurs and partners can submit innovative ideas.About Hu Products and Hu KitchenHu Products (pronounced \"hue\" as in Human) is one of the fastest-growing snacking companies in the U.S. with a fanatical focus on combining delicious taste with strictly-vetted simple, understandable ingredients. Hu Chocolate is vegan, paleo, soy-free, refined sugar-free and has won various medals for best Vegan Chocolate. Hu Kitchen is a high-end, fast-casual restaurant and market in NYC, serving over 1,000 people per day, focused strictly on delicious, unprocessed foods. At Hu Kitchen, you can find all of Hu's products and experience the authentic lifestyle of \"Get Back to Human.\"\n  \n\n  \n    \n      Contacts:\n                  Valerie Moens\n              \n                      +1-847-943-5678\n                  \n                      news@mdlz.com\n                  \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Mondelez International, Inc."
    },
    {
        "title": "Mondelez Global LLC Conducts Voluntary Recall of Certain Chewy Chips Ahoy 13oz Due to Unexpected Solidified Ingredient in Product in the US",
        "subtitle": "",
        "date": "Apr 13, 2019 7:02PM EDT",
        "content": "EAST HANOVER, N.J., April 13, 2019 (GLOBE NEWSWIRE) -- Mondelēz Global LLC announced today a limited voluntary recall in the United States of certain Chewy Chips Ahoy 13oz cookies. This voluntary recall is being conducted because of the potential for certain product to contain an unexpected solidified ingredient. Some reports of potential adverse health effects have been received.\n  \n\n  \n    \n      Description\n                  Retail UPC\n                  Best When Used By Dates\n              CHIPS AHOY CHEWY COOKIE (13 OZ)\n                       0 44000 03223 4\n                      07SEP201908SEP201914SEP201915SEP2019(Located on left top side of package by lift tab)\n                      \n                  \n  \n  This recall is being conducted in the US.Consumers who have this product should not eat it. Consumers can contact the company at 1-844-366-1171, 24 hours a day to get more information about the recall. Consumer Relations specialists are available Monday-Friday, 9am to 6pm EDT.\n  \n\n  \n    \n      Contact:\n                  Elisabeth Wenner\n              \n                      847-943-5678\n                  \n                      news@mdlz.com\n                  \n  \n  A photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/d9cc2460-175c-4172-831b-df748b8f0e7cSource: Mondelez International, Inc."
    },
    {
        "title": "Mondelez International to Report Q1 Earnings on April 30, 2019",
        "subtitle": "",
        "date": "Apr 11, 2019 9:00AM EDT",
        "content": "DEERFIELD, Ill., April 11, 2019 (GLOBE NEWSWIRE) -- Mondelēz International, Inc. will release its first quarter 2019 financial results on Tuesday, April 30, 2019 at 4:05 p.m. ET and will host a conference call at 5:00 p.m. ET that day.Investors and analysts may participate via phone by calling 1-800-322-9079 from the United States and 1-973-582-2717 from other locations. To ensure timely access, participants should dial in approximately 10 minutes before the call starts. A listen-only webcast will be provided at www.mondelezinternational.com.A replay of the conference call will be available until May 10, 2019 by calling 1-855-859-2056 from the United States and 1-404-537-3406 from other locations. The access code for both the conference call and its rebroadcast is 2827059. An archive of the webcast will be available on the company's web site.The company will be live tweeting the event at www.twitter.com/MDLZ.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ:MDLZ) empowers people to snack right in approximately 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor's 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.\n  \n\n  \n    \n      Contact:\n                  Tom Armitage (Media)\n                  Shep Dunlap (Investors)\n              \n                      +1 847 943 5678\n                      +1 847 943 5454\n                  \n                      news@mdlz.com\n                      ir@mdlz.com\n                  \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Mondelez International, Inc."
    },
    {
        "title": "Mondelez International Partners with Food Business Incubator, The Hatchery Chicago",
        "subtitle": "",
        "date": "Mar 21, 2019 9:00AM EDT",
        "content": "DEERFIELD, Ill., March 21, 2019 (GLOBE NEWSWIRE) -- Mondelēz International announced today a partnership with The Hatchery Chicago, a non-profit food business incubator, as it ramps up its innovation efforts to lead the future of snacking. The partnership is one of several investments the company is making as part of SnackFutures, the company's innovation and venture hub aimed at unlocking snacking growth opportunities around the world.Through the new partnership, Mondelēz International and the SnackFutures team will be able to connect with the local food and beverage start-up community and work together to accelerate and scale innovation. Mondelēz International will work with The Hatchery Chicago to offer educational opportunities and mentorship to entrepreneurs active in Chicago's thriving food and drink scene.\"We are truly impressed with the talented start-ups coming out of The Hatchery and are excited to be part of this journey. As the world's snacking leader, it is increasingly important for us to collaborate with the best and brightest talent in advancing the future of snacking,\" said Tim Cofer, Executive Vice President and Chief Growth Officer of Mondelēz International. \"With SnackFutures, we want to disrupt the food industry by testing new ideas and scaling what works. Working with The Hatchery food entrepreneurs will help us push the boundaries of what is possible in snacking as we continue to build our ecosystem of partners while also giving back and offering guidance to new companies.\"As one of the largest food incubation spaces in the U.S., The Hatchery helps local entrepreneurs build and grow successful food and beverage businesses through three major areas of need: access to production space, financing and resources. Housed in 67,000-square-foot facility in the East Garfield Park neighborhood in Chicago, it provides job training and placement programs, creating sustainable economic growth and new job opportunities.\"At The Hatchery Chicago, we believe collaboration accelerates innovation and increases the rate of success for companies - big and small,\" says Natalie Shmulik, CEO of The Hatchery Chicago.\"Through this partnership with Mondelēz International, we're creating even more opportunities for our entrepreneurs and community members to access the mentorship and industry expertise that will help them take their business to the next level.\"A key pillar of the company's consumer-centric growth strategy, SnackFutures is designed as an independent hub that brings three core tenets of growth under one umbrella to accelerate innovation: invention of new brands and businesses; reinvention of small-scale brands with large-scale potential, and venture investments with start-up entrepreneurs to bring emerging brands and strategic capabilities.Supported by an unconventional ecosystem of best-in-class internal experts and external partners around the globe, SnackFutures seeks to collaborate in three key strategic areas: well-being snacks, premium snacks, digital platforms and capabilities. Check https://www.snackfutures.com/ for more information on how entrepreneurs and partners can submit innovative ideas.About Mondelēz InternationalMondelēz International, Inc. (NASDAQ:MDLZ) empowers people to snack right in approximately 150 countries around the world. With 2018 net revenues of approximately $26 billion, MDLZ is leading the future of snacking with iconic global and local brands such as Oreo, belVita and LU biscuits; Cadbury Dairy Milk, Milka and Toblerone chocolate; Sour Patch Kids candy and Trident gum. Mondelēz International is a proud member of the Standard and Poor's 500, Nasdaq 100 and Dow Jones Sustainability Index. Visit www.mondelezinternational.com or follow the company on Twitter at www.twitter.com/MDLZ.About The Hatchery ChicagoThe Hatchery Chicago is non-profit food and beverage incubator dedicated to helping local entrepreneurs build & grow successful businesses. Through cutting-edge kitchen facilities, robust entrepreneurship curriculum, and partnerships with generous corporate sponsors and foundations, The Hatchery Chicago supports local food and beverage entrepreneurs, cultivates local job opportunities, and accelerates local economic growth. Visit www.thehatcherychicago.org to learn more.\n  \n\n  \n    \n      Contacts:\n                  Valerie Moens\n              \n                      +1-847-943-5678\n                  \n                      news@mdlz.com\n                  \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Mondelez International, Inc."
    }
]