[
    {
        "title": "MercadoLibre, Inc. Reports Fourth Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Feb 10, 2020 4:01PM EST",
        "content": "Net Revenues of $674.3 million, up 84.4% YoY on an FX neutral basis $8.7 billion Total Payment Volume, up 98.5% YoY on an FX neutral basis$3.9 billion Gross Merchandise Volume, up 39.7% YoY on an FX neutral basisBUENOS AIRES, Argentina, Feb.  10, 2020  (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (Nasdaq: MELI) (http://www.mercadolibre.com), Latin America’s leading e-commerce technology company, today reported financial results for the quarter ended December 31, 2019.Pedro Arnt, Chief Financial Officer of MercadoLibre, Inc., commented, “We are proud to announce the fourth quarter 2019 with a sustained momentum that gives us the confidence to move on to a phase of continuing to prioritize growth, but with a greater focus on driving cost efficiencies and scale benefits through the P&Ls of our larger more consolidated businesses. This will be one of our objectives for the upcoming year. We believe we are investing appropriately behind growth, building superior experiences and products for our consumers and merchants, and continuing committed to our long term goal of disrupting both commerce and finance in Latin America. We are also proud to invite you to check our sustainability report, also available for the first time along with the annual report.”Fourth Quarter 2019 Business HighlightsThe tables below present our gross billings, amounts paid by us in connection with our free shipping service and net revenues.The Company presents net revenues net of amounts paid in connection with the Company’s free shipping initiative, when the Company acts as an agent. For the three-month period ended December 31st, 2019 the Company incurred $56.8 million of shipping subsidies that have been netted from revenues. *The tables above may not total due to rounding.Fourth Quarter 2019 Financial Highlights       The following table summarizes certain key performance metrics for the twelve and three months periods ended December 31, 2019 and 2018.(*) Figures have been calculated using rounded amounts. Growth calculations based on this table may not total due to rounding.Year-over-year USD Revenue Growth Rates by QuarterYear-over-year Local Currency Revenue Growth Rates by Quarter Conference Call and WebcastThe Company will host a conference call and audio webcast on February 10th, 2020 at 4:30 p.m. Eastern Time. The conference call may be accessed by dialing (877) 303-7209 / (970) 315-0420 (Conference ID –5176529–) and requesting inclusion in the call for MercadoLibre. The live conference call can be accessed via audio webcast at the investor relations section of the Company's website, at http://investor.mercadolibre.com. An archive of the webcast will be available for one week following the conclusion of the conference call.Definition of Selected Operational MetricsGross Billings - Total accrued fees, commissions, interest, and other sales received from users.Foreign Exchange (“FX”) Neutral – Calculated by using the average monthly exchange rate of each month of 2018 and applying it to the corresponding months in the current year, so as to calculate what the results would have been had exchange rates remained constant. Intercompany allocations are excluded from this calculation. These calculations do not include any other macroeconomic effect such as local currency inflation effects or any price adjustment to compensate local currency inflation or devaluations.Gross merchandise volume – Measure of the total U.S. dollar sum of all transactions completed through the Mercado Libre Marketplace, excluding Classifieds transactions.Total payment transactions – Measure of the number of all transactions paid for using Mercado Pago.Total volume of payments on marketplace - Measure of the total U.S. dollar sum of all marketplace transactions paid for using Mercado Pago, excluding shipping and financing fees.Total payment volume– Measure of total U.S. dollar sum of all transactions paid for using Mercado Pago, including marketplace and non-marketplace transactions.Enhanced Marketplace - Revenues from the Enhanced Marketplace service, include the final value fees and shipping fees charged to the Company’s customers.Items sold – Measure of the number of items that were sold/purchased through the Mercado Libre Marketplace, excluding Classifieds items.Items shipped – Measure of the number of items that were shipped through our shipping service.Local Currency Growth Rates – Refer to FX Neutral definition.Net income margin – Defined as net income as a percentage of net revenues.New confirmed registered users – Measure of the number of new users who have registered on the Mercado Libre Marketplace and confirmed their registration, excluding Classifieds users.Operating margin – Defined as income from operations as a percentage of net revenues.Total confirmed registered users – Measure of the cumulative number of users who have registered on the Mercado Libre Marketplace and confirmed their registration, excluding Classifieds users.Unique Buyers – New or existing users with at least one purchase made in the period, including Classifieds users.Unique Sellers – New or existing users with at least one new listing in the period, including Classifieds users.About MercadoLibreFounded in 1999, MercadoLibre is the largest online commerce ecosystem in Latin America, serving as an integrated regional platform and as a provider of the necessary online and technology- based tools that allow businesses and individuals to trade products and services in the region. The Company enables commerce through its marketplace platform (including online classifieds for motor vehicles, vessels, aircraft, services and real estate), which allows users to buy and sell in most of Latin America.The Company is listed on NASDAQ (Nasdaq: MELI) following its initial public offering in 2007.For more information about the Company visit: http://investor.mercadolibre.com.The MercadoLibre, Inc. logo is available at https://resource.globenewswire.com/Resource/Download/6ab227b7-693f-4b17-b80c-552ae45c76bf?size=0 Forward-Looking StatementsAny statements herein regarding MercadoLibre, Inc. that are not historical or current facts are forward-looking statements. These forward-looking statements convey MercadoLibre, Inc.’s current expectations or forecasts of future events. Forward-looking statements regarding MercadoLibre, Inc. involve known and unknown risks, uncertainties and other factors that may cause MercadoLibre, Inc.’s actual results, performance or achievements to be materially different from any future results, performances or achievements expressed or implied by the forward-looking statements. Certain of these risks and uncertainties are described in the “Risk Factors,” “Forward-Looking Statements” and “Cautionary Note Regarding Forward-Looking Statements” sections of MercadoLibre, Inc.’s annual report on Form 10-K for the year ended December 31, 2019, and any of MercadoLibre, Inc.’s other applicable filings with the Securities and Exchange Commission. Unless required by law, MercadoLibre, Inc. undertakes no obligation to publicly update or revise any forward-looking statements to reflect circumstances or events after the date hereof.MercadoLibre, Inc.Consolidated Balance Sheets(In thousands of U.S. dollars, except par value)MercadoLibre, Inc.Consolidated Statements of IncomeFor the twelve and three-month periods ended December 31, 2019 and 2018(In thousands of U.S. dollars, except for share data) MercadoLibre, Inc.Consolidated Statement of Cash FlowsFor the years ended December 31, 2019 and 2018 Financial results of reporting segmentsNon-GAAP Financial MeasuresTo supplement our consolidated financial statements presented in accordance with U.S. GAAP, we use foreign exchange (“FX”) neutral measures.This non-GAAP measure should not be considered in isolation or as a substitute for measures of performance prepared in accordance with U.S. GAAP and may be different from non-GAAP measures used by other companies. In addition, this non-GAAP measure is not based on any comprehensive set of accounting rules or principles. Non-GAAP measures have limitations in that they do not reflect all of the amounts associated with our results of operations as determined in accordance with U.S. GAAP. This non-GAAP financial measure should only be used to evaluate our results of operations in conjunction with the most comparable U.S. GAAP financial measures.Reconciliation of this non-GAAP financial measure to the most comparable U.S. GAAP financial measures can be found in the tables included in this quarterly report.The Company believes that reconciliation of FX neutral measures to the most directly comparable GAAP measure provides investors an overall understanding of our current financial performance and its prospects for the future. Specifically, we believe this non-GAAP measure provide useful information to both management and investors by excluding the foreign currency exchange rate impact that may not be indicative of our core operating results and business outlook.The FX neutral measures were calculated by using the average monthly exchange rates for each month during 2018 and applying them to the corresponding months in 2019, so as to calculate what our results would have been had exchange rates remained stable from one year to the next. The table below excludes intercompany allocation FX effects. Finally, this measure does not include any other macroeconomic effect such as local currency inflation effects, the impact on impairment calculations or any price adjustment to compensate local currency inflation or devaluations.The following table sets forth the FX neutral measures related to our reported results of the operations for the three-month period ended December 31, 2019:(*) The table above may not total due to rounding.CONTACT: MercadoLibre, Inc.Investor Relationsinvestor@mercadolibre.com http://investor.mercadolibre.com "
    },
    {
        "title": "MercadoLibre, Inc. to Report Fourth Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Feb 3, 2020 3:00PM EST",
        "content": "BUENOS AIRES, Argentina, Feb.  03, 2020  (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (Nasdaq:MELI) (http://www.mercadolibre.com) intends to release financial results for its fourth fiscal quarter ended December 31st, 2019 on February 10th, 2020 after the close of the day's trading.The Company will host a conference call and audio webcast on February 10th, at 4:30 p.m. Eastern Time.The conference call may be accessed by dialing (877) 303-7209 / (970) 315-0420 (Conference ID 5176529) and requesting inclusion in the call for MercadoLibre. The live conference call can be accessed via audio webcast at the investor relations section of the Company's website, at http://investor.mercadolibre.com. An archive of the webcast will be available for one week following the conclusion of the conference call.About MercadoLibreMercadoLibre hosts the largest online commerce and payments ecosystem in Latin America. Our efforts are centered on enabling e-commerce and digital and mobile payments on behalf of its customers by delivering a suite of technology solutions across the complete value chain of commerce. The company is present in 18 countries including: Argentina, Brazil, Mexico, Colombia, Chile, Venezuela and Peru. Based on unique visitors and page views we are market leaders in each of the major countries were we are present.Through its online commerce platform and related services, MercadoLibre provides its users with robust online commerce and payments tools that not only contribute to the development of a large and growing e-commerce community in Latin America (a region with a population of over 605 million people and one of the fastest-growing Internet penetration rates in the world), but also foster entrepreneurship and social mobility. Its main focus is to deliver compelling technological and commercial solutions that address the distinctive cultural and geographic challenges of operating an online commerce and payments platform in Latin America.For more information about MercadoLibre.com, visit: http://investor.mercadolibre.comInvestor Relations Contact:investor@mercadolibre.comhttp://investor.mercadolibre.comMedia Relations Contact. valeria.bazzi@mercadolibre.com "
    },
    {
        "title": "Thinking about trading options or stock in Boeing, Mercadolibre, Monster Beverage, Roku, or Tesla?",
        "subtitle": "",
        "date": "Jan 13, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 13, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, MELI, MNST, ROKU, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-boeing-mercadolibre-monster-beverage-roku-or-tesla-300985637.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "MercadoLibre, Inc. Reports Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 31, 2019 4:01PM EDT",
        "content": "Net Revenues of $603.0 million, up 90.5% YoY on an FX neutral basis$7.6 billion Total Payment Volume, up 94.5% YoY on an FX neutral basis$3.6 billion Gross Merchandise Volume, up 36.8% YoY on an FX neutral basisBUENOS AIRES, Argentina, Oct.  31, 2019  (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (Nasdaq: MELI) (http://www.mercadolibre.com), Latin America’s leading e-commerce technology company, today reported financial results for the quarter ended September 30, 2019.Pedro Arnt, Chief Financial Officer of MercadoLibre, Inc., commented, “We continue to make significant inroads in our key strategic initiatives and reached important milestones this quarter both in FinTech and logistics. As we move into the fourth quarter and 2020, we will continue to focus on delivering an ever-improving user experience, adding functionalities to our user base and leveraging our ecosystem’s unique competitive advantages.”Third Quarter 2019 Business Highlights1             1 Percentages have been calculated using whole amounts rather than rounded amounts.The tables below present our gross billings and amounts paid by us in connection with our free shipping service.The Company presents net revenues net of amounts paid in connection with the Company’s free shipping initiative, when the Company acts as an agent, rather than including these amounts in the cost of net sales, as previously recorded. For the three-month period ended September 30, 2019 the Company incurred $69.9 million of shipping subsidies that have been netted from revenues. *The tables above may not total due to rounding.Third Quarter 2019 Financial HighlightsThe following table summarizes certain key performance metrics for the nine and three months periods ended September 30, 2019 and 2018.(*) Figures have been calculated using rounded amounts. Growth calculations based on this table may not total due to rounding.Year-over-year USD Revenue Growth Rates by QuarterYear-over-year Local Currency Revenue Growth Rates by Quarter Conference Call and WebcastThe Company will host a conference call and audio webcast on October 31st, 2019 at 4:30 p.m. Eastern Time. The conference call may be accessed by dialing (877) 303-7209 / (970) 315-0420 (Conference ID –1183947–) and requesting inclusion in the call for MercadoLibre. The live conference call can be accessed via audio webcast at the investor relations section of the Company's website, at http://investor.mercadolibre.com. An archive of the webcast will be available for one week following the conclusion of the conference call.Definition of Selected Operational MetricsGross Billings - Total accrued fees, commissions, interest, and other sales received from users.Foreign Exchange (“FX”) Neutral – Calculated by using the average monthly exchange rate of each month of 2018 and applying it to the corresponding months in the current year, so as to calculate what the results would have been had exchange rates remained constant. Intercompany allocations are excluded from this calculation. These calculations do not include any other macroeconomic effect such as local currency inflation effects or any price adjustment to compensate local currency inflation or devaluations.Gross merchandise volume – Measure of the total U.S. dollar sum of all transactions completed through the MercadoLibre Marketplace, excluding Classifieds transactions.Total payment transactions – Measure of the number of all transactions paid for using Mercado Pago.Total volume of payments on marketplace - Measure of the total U.S. dollar sum of all marketplace transactions paid for using Mercado Pago, excluding shipping and financing fees.Total payment volume– Measure of total U.S. dollar sum of all transactions paid for using Mercado Pago, including marketplace and non-marketplace transactions.Enhanced Marketplace - Revenues from the Enhanced Marketplace service, include the final value fees and shipping fees charged to the Company’s customers.Items sold – Measure of the number of items that were sold/purchased through the MercadoLibre Marketplace, excluding Classifieds items.Items shipped – Measure of the number of items that were shipped through our shipping service.Local Currency Growth Rates – Refer to FX Neutral definition.Net income margin – Defined as net income as a percentage of net revenues.New confirmed registered users – Measure of the number of new users who have registered on the MercadoLibre Marketplace and confirmed their registration, excluding Classifieds users.Operating margin – Defined as income from operations as a percentage of net revenues.Total confirmed registered users – Measure of the cumulative number of users who have registered on the MercadoLibre Marketplace and confirmed their registration, excluding Classifieds users.Unique Buyers – New or existing users with at least one purchase made in the period, including Classifieds users.Unique Sellers – New or existing users with at least one new listing in the period, including Classifieds users.About MercadoLibreFounded in 1999, MercadoLibre is the largest online commerce ecosystem in Latin America, serving as an integrated regional platform and as a provider of the necessary online and technology- based tools that allow businesses and individuals to trade products and services in the region. The Company enables commerce through its marketplace platform (including online classifieds for motor vehicles, vessels, aircraft, services and real estate), which allows users to buy and sell in most of Latin America.The Company is listed on NASDAQ (Nasdaq: MELI) following its initial public offering in 2007.For more information about the Company visit: http://investor.mercadolibre.com.The MercadoLibre, Inc. logo is available at https://resource.globenewswire.com/Resource/Download/6ab227b7-693f-4b17-b80c-552ae45c76bf?size=0Forward-Looking StatementsAny statements herein regarding MercadoLibre, Inc. that are not historical or current facts are forward-looking statements. These forward-looking statements convey MercadoLibre, Inc.’s current expectations or forecasts of future events. Forward-looking statements regarding MercadoLibre, Inc. involve known and unknown risks, uncertainties and other factors that may cause MercadoLibre, Inc.’s actual results, performance or achievements to be materially different from any future results, performances or achievements expressed or implied by the forward-looking statements. Certain of these risks and uncertainties are described in the “Risk Factors,” “Forward-Looking Statements” and “Cautionary Note Regarding Forward-Looking Statements” sections of MercadoLibre, Inc.’s annual report on Form 10-K for the year ended December 31, 2018, and any of MercadoLibre, Inc.’s other applicable filings with the Securities and Exchange Commission. Unless required by law, MercadoLibre, Inc. undertakes no obligation to publicly update or revise any forward-looking statements to reflect circumstances or events after the date hereof.MercadoLibre, Inc.Consolidated Balance Sheets(In thousands of U.S. dollars, except par value)MercadoLibre, Inc.Consolidated Statements of IncomeFor the nine and three-month periods ended September 30, 2019 and 2018(In thousands of U.S. dollars, except for share data) MercadoLibre, Inc.Consolidated Statement of Cash FlowsFor the nine-month periods ended September 30, 2019 and 2018 Financial results of reporting segmentsNon-GAAP Financial MeasuresTo supplement our consolidated financial statements presented in accordance with U.S. GAAP, we use foreign exchange (“FX”) neutral measures.This non-GAAP measure should not be considered in isolation or as a substitute for measures of performance prepared in accordance with U.S. GAAP and may be different from non-GAAP measures used by other companies. In addition, this non-GAAP measure is not based on any comprehensive set of accounting rules or principles. Non-GAAP measures have limitations in that they do not reflect all of the amounts associated with our results of operations as determined in accordance with U.S. GAAP. This non-GAAP financial measure should only be used to evaluate our results of operations in conjunction with the most comparable U.S. GAAP financial measures.Reconciliation of this non-GAAP financial measure to the most comparable U.S. GAAP financial measures can be found in the tables included in this quarterly report.The Company believes that reconciliation of FX neutral measures to the most directly comparable GAAP measure provides investors an overall understanding of our current financial performance and its prospects for the future. Specifically, we believe this non-GAAP measure provide useful information to both management and investors by excluding the foreign currency exchange rate impact that may not be indicative of our core operating results and business outlook.The FX neutral measures were calculated by using the average monthly exchange rates for each month during 2018 and applying them to the corresponding months in 2019, so as to calculate what our results would have been had exchange rates remained stable from one year to the next. The table below excludes intercompany allocation FX effects. Finally, this measure does not include any other macroeconomic effect such as local currency inflation effects, the impact on impairment calculations or any price adjustment to compensate local currency inflation or devaluations.The following table sets forth the FX neutral measures related to our reported results of the operations for the three-month period ended September 30, 2019:(*) The table above may not total due to rounding.CONTACT: MercadoLibre, Inc.Investor Relationsinvestor@mercadolibre.comhttp://investor.mercadolibre.com "
    },
    {
        "title": "MercadoLibre, Inc. to Report Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 24, 2019 3:30PM EDT",
        "content": "BUENOS AIRES, Argentina, Oct.  24, 2019  (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (Nasdaq:MELI) (http://www.mercadolibre.com) intends to release financial results for its third fiscal quarter ended September 30th, 2019 on October 31th, 2019 after the close of the day's trading.The Company will host a conference call and audio webcast on October 31st, at 4:30 p.m. Eastern Time.The conference call may be accessed by dialing (877) 303-7209 / (970) 315-0420 (Conference ID 1183947) and requesting inclusion in the call for Mercado Libre. The live conference call can be accessed via audio webcast at the investor relations section of the Company's website, at http://investor.mercadolibre.com. An archive of the webcast will be available for one week following the conclusion of the conference call.About Mercado LibreMercado Libre hosts the largest online commerce and payments ecosystem in Latin America. Our efforts are centered on enabling e-commerce and digital and mobile payments on behalf of its customers by delivering a suite of technology solutions across the complete value chain of commerce. The company is present in 18 countries including: Argentina, Brazil, Mexico, Colombia, Chile, Venezuela and Peru. Based on unique visitors and page views we are market leaders in each of the major countries were we are present.Through its online commerce platform and related services, Mercado Libre provides its users with robust online commerce and payments tools that not only contribute to the development of a large and growing ecommerce community in Latin America (a region with a population of over 605 million people and one of the fastest-growing Internet penetration rates in the world), but also foster entrepreneurship and social mobility. Its main focus is to deliver compelling technological and commercial solutions that address the distinctive cultural and geographic challenges of operating an online commerce and payments platform in Latin America.For more information about MercadoLibre.com, visit: http://investor.mercadolibre.comInvestor Relations Contact:investor@mercadolibre.comhttp://investor.mercadolibre.comMedia Relations Contact: valeria.bazzi@mercadolibre.com "
    },
    {
        "title": "Mercado Libre, Uniko partner to capture Latin America's USD$12B gift registry industry from traditional retailers",
        "subtitle": "Mercado Libre Powered by Uniko enables newlyweds, new parents to finally get the gifts they truly want",
        "date": "Aug 27, 2019 11:56AM EDT",
        "content": "MEXICO CITY, Aug. 27, 2019 /PRNewswire/ -- Uniko and Mercado Libre (NASDAQ: MELI) have partnered to transform wedding gift registries, starting in Mexico, with the Mercado Libre powered by Uniko platform. Founded in Mexico City, Mexico, in 2015 Uniko is a technology company that provides newlyweds an easy-to-use online tool to register for gifts, experiences and cash. Through its partnership with Mercado Libre, Latin America's largest e-commerce platform, Uniko now also enables its customers to buy goods sold via Mercado Libre, using its secure-payment system Mercado Pago. Statistics say guests are more interested in buying gifts online, rather than department stores, and prefer to have the flexibility to choose products from a variety of vendors. Uniko found more than 60% of newlyweds would exchange gifts received for alternative goods, while at least 10% of all wedding gifts in the U.S. go to waste because they do not satisfy couples' wants or needs. Mercado Libre powered by Uniko solves these problems. The joint platform offers products made by more than a dozen brands, at the best prices, and with direct home shopping. The integration combines Uniko's superior mastery of the gift registry space with Mercado Libre's regional e-commerce leadership, giving customers the one-stop-shop experience they've long yearned for. Evidence of this is the exponential growth of new registries via Mercado Libre powered by Uniko since the partnership launched this month. \"Uniko helped us notice that people have changed, and more and more, they want new ways to receive gifts, without relying on department stores,\" said Alonso Cedeño, Director of Mercado Libre's Consumer & Electronics division. \"The immediacy of the Uniko online gift registry in Mercado Libre will give couples the option to fulfill three key objectives: take advantage of technology; choose from endless gift options; and, of course, democratize gifts in Mexico.\"Users of Mercado Libre powered by Uniko platform enjoy exclusive discounts on top brands; preferred shipping; and interest-free payments, among other perks. \"Thanks to our technology and knowledge of the wedding gifts industry, we are empowering Mercado Libre to democratize the gift industry in Latin America,\" said Tere Cremona, co-founder and CEO of Uniko. \"We're thrilled to be partnering with such an experienced and impactful company to improve the gift experience for newlyweds and their family and friends alike.\"Uniko is one of more than 50 #PoweredByRokk3r companies, created within the with Rokk3r Inc. ecosystem (OTC: ROKK), a Miami, Florida-based company cobuilder that provides startups with services such as consulting, recruiting, software engineering to ensure their success in today's highly competitive global startup landscape. \"Uniko is shaping the next generation of gift-giving, and it couldn't have been done without robust technology, which enables a great user experience, secure purchasing and high-tech supply chain management systems,\" said Rokk3r Chief Growth Officer Lorenzo de Leo. \"The whole team at Rokk3r and I are very happy to see how Uniko is impacting the business trajectory of a company as well established and mature as Mercado Libre,  which dates back roughly 20 years.\"About Uniko Uniko is an innovative concept designed to give couples a better wedding registry experience. Founded in Mexico City, Mexico, in 2015, Uniko provides newlyweds an easy-to-use online tool to register for gifts, experiences and cash, in addition to other features designed to make weddings as blissful as they are intended to be. CB Insights named Uniko among startups \"transforming the wedding industry.\" For more information about Uniko, a #PoweredByRokk3r venture, visit uniko.co/About Rokk3r Inc.Rokk3r (OTC: ROKK) is a company builder headquartered in Miami, Florida, that enables aspiring entrepreneurs and established companies to successfully launch exponential, tech-driven businesses. By leveraging Rokk3r's extended ecosystem and global network of engineers, designers and educators, such groundbreaking companies as AdMobilize, SoStereo Uniko, and HotSwitch have been #PoweredByRokk3r. To learn how Rokk3r transforms businesses from traditional to exponential, visit rokk3r.com and follow Rokk3r on Twitter, LinkedIn, Instagram and Facebook. For inquiries, contact: Debora Lima | debora@TheTagExperience.com View original content:http://www.prnewswire.com/news-releases/mercado-libre-uniko-partner-to-capture-latin-americas-usd12b-gift-registry-industry-from-traditional-retailers-300907809.htmlSOURCE  Uniko"
    },
    {
        "title": "MercadoLibre, Inc. Announces Closing of Follow-on Offering",
        "subtitle": "",
        "date": "Mar 15, 2019 4:30PM EDT",
        "content": "BUENOS AIRES, March 15, 2019 (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (NASDAQ:MELI), Latin America's leading e-commerce technology company, today announced the closing of its previously announced underwritten public offering of approximately US$1.15 billion of common stock at a public offering price of $480 per share, which includes the exercise in full of the underwriters' option to purchase $150 million of additional shares of common stock.The Company today also announced the closing of its $750 million concurrent private offering of common stock to PayPal, and expects to close its previously announced offering of $100 million Preferred Stock to Dragoneer on or prior to March 29, 2019, resulting in a total offering of $2 billion.Goldman Sachs, J.P. Morgan and Morgan Stanley are acting as joint bookrunners for the public offering.An automatically effective registration statement relating to these securities was filed with the Securities and Exchange Commission on March 11, 2019. The offering was made only by means of an effective shelf registration statement, including a prospectus supplement and the accompanying prospectus, copies of which may be obtained from Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, telephone: (866) 471-2526 or email: prospectusny@ny.email.gs.com, J.P. Morgan Securities LLC, Attention: Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, email: prospectus-eq_fi@jpmchase.com or Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014.This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.About MercadoLibreMercadoLibre hosts the largest online commerce and payments ecosystem in Latin America. Its efforts are centered on enabling e-commerce and digital and mobile payments on behalf of its customers by delivering a suite of technology solutions across the complete value chain of commerce. The company is present in 18 countries, including: Argentina, Brazil, Mexico, Colombia, Chile, Venezuela and Peru. Based on unique visitors and page views, MercadoLibre is the market leader in each of the major countries where it is present.Forward-Looking StatementsThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and other federal securities laws. Any statements contained herein, which do not describe historical facts, including, but not limited to, statements regarding the anticipated use of proceeds of the offering are forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from those discussed in such forward-looking statements. Unless required by law, MercadoLibre, Inc. undertakes no obligation to publicly update or revise any forward-looking statements to reflect circumstances or events after the date hereof.Contact:MercadoLibre, Inc.Investor Relationsinvestor@mercadolibre.comhttp://investor.mercadolibre.com   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: MercadoLibre, Inc."
    },
    {
        "title": "MercadoLibre, Inc. Announces Pricing of Follow-on Offering",
        "subtitle": "",
        "date": "Mar 13, 2019 1:20AM EDT",
        "content": "BUENOS AIRES, Argentina, March 13, 2019 (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (NASDAQ:MELI), Latin America's leading e-commerce technology company, today announced the pricing of an underwritten public offering of approximately US$1 billion of common stock at a public offering price of $480 per share. In addition, the underwriters have a 30-day option to purchase up to $150 million of additional shares of common stock.Goldman Sachs, J.P. Morgan and Morgan Stanley are acting as joint bookrunners for the offering.An automatically effective registration statement relating to these securities was filed with the Securities and Exchange Commission on March 11, 2019. The offering is being made only by means of an effective shelf registration statement, including a prospectus supplement and the accompanying prospectus, copies of which may be obtained, when available, from Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, telephone: (866) 471-2526 or email: prospectusny@ny.email.gs.com, J.P. Morgan Securities LLC, Attention: Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, email: prospectus-eq_fi@jpmchase.com or Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014.This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.CONTACT:MercadoLibre, Inc.Investor Relationsinvestor@mercadolibre.comhttp://investor.mercadolibre.com   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: MercadoLibre, Inc."
    },
    {
        "title": "MercadoLibre to Raise $1.85 Billion in Equity Offerings",
        "subtitle": "",
        "date": "Mar 11, 2019 4:25PM EDT",
        "content": "BUENOS AIRES, Argentina, March 11, 2019 (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (NASDAQ:MELI), Latin America's leading e-commerce technology company, today announced that it intends to offer approximately US$1 billion of common stock. MercadoLibre also intends to grant the underwriters a 30-day option to purchase up to $150 million of additional shares of common stock. In addition, MercadoLibre has entered into an agreement pursuant to which PayPal has committed to make a $750 million strategic investment through the purchase of common stock. In a separate agreement, an affiliate of Dragoneer Investment Group has agreed to purchase $100 million of Series A perpetual convertible preferred stock. The PayPal and Dragoneer investments are contingent upon the closing of the public offering and are expected to close at the same time or shortly after the public offering.\"Over the past 20 years, we have heavily invested in developing the preeminent e-commerce and FinTech ecosystem in Latin America,\" said Marcos Galperin, CEO of Mercado Libre. \"We are excited to welcome these investments which will allow us to significantly accelerate our growth. We look forward to accelerating our leadership in ecommerce and payments and foster financial inclusion in Latin America as a result of our alliance with a global leader in the industry such as PayPal.\"The company intends to use the proceeds to continue expanding its e-commerce platform, to strengthen its logistics infrastructure, and to invest in solutions that further solidify the company's position as a powerful provider of inclusive end-to-end financial technology and payments solutions.\"Digital commerce in Latin America is experiencing tremendous growth and MercadoLibre is well-positioned for continued leadership,\" said Dan Schulman, President and CEO, PayPal. \"We've been impressed with the digital commerce and payments ecosystem Marcos and his team have built. We see great opportunities to integrate our respective capabilities to create unique and valuable payment experiences for our combined 500 million customers throughout the region and around the world.\"\"Through its investments in FinTech, logistics, and customer experience, MercadoLibre is solidifying its leading market position in e-commerce and digital payments across Latin America, and we believe we are witnessing a major tipping point in the region,\" said Marc Stad, Founder and Managing Partner of Dragoneer Investment Group, \"We've known Marcos and his team for over a decade and are thrilled to partner with them through this high growth and transformative period.\" During 2018, MercadoLibre sold more than 334 million items, amounting to over US$12 billion of gross merchandise volume (GMV). Payment transactions on MercadoPago, its payments business unit, increased by 70% during 2018, totaling 389 million transactions and US$18 billion of total payment volume (TPV).Goldman Sachs is acting as sole financial advisor to MercadoLibre on the PayPal and Dragoneer investments, and Cleary Gottlieb is serving as MercadoLibre's legal advisor. Goldman Sachs, J.P. Morgan and Morgan Stanley are acting as joint bookrunners on the public equity offering.About MercadoLibreFounded in 1999, MercadoLibre is the leading e-commerce company in Latin America. Through its six integrated ecommerce platforms including MercadoLibre, MercadoPago and MercadoEnvíos, it offers technology solutions that enable companies and individuals to buy, sell, announce, send and pay for goods and services over the internet. MercadoLibre serves millions of users, providing compelling technology-based solutions that democratize commerce and money, thus contributing to the development of a large and growing digital economy MercadoLibre is among the top 50 most visited websites in the world in terms of page views, and it is the ecommerce platform with the most unique visitors in each country where it operates.CONTACT:MercadoLibre, Inc.Investor Relationsinvestor@mercadolibre.comhttp://investor.mercadolibre.comMercadoLibre, Inc. has filed a registration statement (including a prospectus) with the Securities and Exchange Commission (\"SEC\") for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement and other documents the issuer has filed with the SEC for more complete information about the issuer and this offering. You may get these documents for free by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, the issuer, any underwriter or any dealer participating in the offering will arrange to send you the prospectus if you request it from Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, telephone: (866) 471-2526 or email: prospectusny@ny.email.gs.com, J.P. Morgan Securities LLC, Attention: Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, email: prospectus-eq_fi@jpmchase.com or Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014.Forward-Looking Statements Any statements herein regarding MercadoLibre, Inc. that are not historical or current facts are forward-looking statements. These forward-looking statements convey MercadoLibre, Inc.'s current expectations or forecasts of future events. Forward-looking statements regarding MercadoLibre, Inc. involve known and unknown risks, uncertainties and other factors that may cause MercadoLibre, Inc.'s actual results, performance or achievements to be materially different from any future results, performances or achievements expressed or implied by the forward-looking statements. Certain of these risks and uncertainties are described in the \"Risk Factors,\" \"Forward-Looking Statements\" and \"Cautionary Note Regarding Forward-Looking Statements\" sections of MercadoLibre, Inc.'s annual report on Form 10-K for the year ended December 31, 2018, and any of MercadoLibre, Inc.'s other applicable filings with the Securities and Exchange Commission. Unless required by law, MercadoLibre, Inc. undertakes no obligation to publicly update or revise any forward-looking statements to reflect circumstances or events after the date hereof.   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: MercadoLibre, Inc."
    },
    {
        "title": "MercadoLibre, Inc. to Report Fourth Quarter 2018 Financial Results",
        "subtitle": "",
        "date": "Feb 18, 2019 11:00AM EST",
        "content": "BUENOS AIRES, Argentina, Feb. 18, 2019 (GLOBE NEWSWIRE) -- MercadoLibre, Inc. (Nasdaq:MELI) (http://www.mercadolibre.com) intends to release financial results for its fourth fiscal quarter ended December 31th, 2018 on February 26th, 2018 after the close of the day's trading.The Company will host a conference call and audio webcast on February 26th, at 4:30 p.m. Eastern Time.The conference call may be accessed by dialing (877) 303-7209 / (970) 315-0420 (Conference ID 3497822) and requesting inclusion in the call for Mercado Libre. The live conference call can be accessed via audio webcast at the investor relations section of the Company's website, at http://investor.mercadolibre.com. An archive of the webcast will be available for one week following the conclusion of the conference call.About Mercado LibreMercado Libre hosts the largest online commerce and payments ecosystem in Latin America. Our efforts are centered on enabling e-commerce and digital and mobile payments on behalf of its customers by delivering a suite of technology solutions across the complete value chain of commerce. The company is present in 18 countries including: Argentina, Brazil, Mexico, Colombia, Chile, Venezuela and Peru. Based on unique visitors and page views we are market leaders in each of the major countries where we are present.Through its online commerce platform and related services, Mercado Libre provides its users with robust online commerce and payments tools that not only contribute to the development of a large and growing ecommerce community in Latin America (a region with a population of over 605 million people and one of the fastest-growing Internet penetration rates in the world), but also foster entrepreneurship and social mobility. Its main focus is to deliver compelling technological and commercial solutions that address the distinctive cultural and geographic challenges of operating an online commerce and payments platform in Latin America.For more information about MercadoLibre.com, visit: http://investor.mercadolibre.comInvestor Relations Contact: investor@mercadolibre.comhttp://investor.mercadolibre.com Media Relations Contact. valeria.bazzi@mercadolibre.com    \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: MercadoLibre, Inc."
    }
]