[
    {
        "title": "Monster Beverage Reports 2019 Fourth Quarter and Full Year Financial Results",
        "subtitle": "",
        "date": "Feb 27, 2020 4:05PM EST",
        "content": "-- Fourth Quarter Net Sales rise 10.1 percent to $1.02 billion ---- Fourth Quarter Net Income increases 6.6 percent to $255.0 million ---- Fourth Quarter Net Income per diluted share increases 9.7 percent to $0.47 per share --CORONA, Calif., Feb.  27, 2020  (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ: MNST) today reported financial results for the three- and twelve-months ended December 31, 2019.Fourth Quarter ResultsNet sales for the 2019 fourth quarter increased 10.1 percent to $1.02 billion from $924.2 million in the same period last year.  Gross sales for the 2019 fourth quarter increased 10.3 percent to $1.17 billion from $1.06 billion in the same period last year. The comparative net and gross sales for the 2018 fourth quarter were negatively impacted by approximately $16.0 million and $18.0 million, respectively, due to advance purchases made by our customers in anticipation of a price increase effective November 1, 2018 in the United States. Net changes in foreign currency exchange rates had an unfavorable impact on net and gross sales for the 2019 fourth quarter of $9.1 million and $10.9 million, respectively.Net sales for the Company’s Monster Energy® Drinks segment, which primarily includes the Company’s Monster Energy® drinks and Reign Total Body Fuel™ high performance energy drinks, increased 11.7 percent to $953.2 million for the 2019 fourth quarter, from $853.3 million for the 2018 fourth quarter.  Net changes in foreign currency exchange rates had an unfavorable impact on net sales for the Monster Energy® Drinks segment of approximately $8.5 million for the 2019 fourth quarter. Net sales for the Company’s Strategic Brands segment, which primarily includes the various energy drink brands acquired from The Coca-Cola Company, as well as the Company’s affordable energy brands, decreased 10.1 percent to $59.2 million for the 2019 fourth quarter, from $65.8 million in the 2018 fourth quarter.  Net changes in foreign currency exchange rates had an unfavorable impact on net sales for the Strategic Brands segment of $0.6 million for the 2019 fourth quarter. Net sales for the Company’s Other segment, which includes certain products of American Fruits and Flavors, LLC, a wholly-owned subsidiary of the Company, sold to independent third parties (the “AFF Third-Party Products”), were $4.9 million for the 2019 fourth quarter, compared with $5.1 million in the 2018 fourth quarter.Net sales to customers outside the United States increased 16.5 percent to $319.5 million in the 2019 fourth quarter, from $274.3 million in the 2018 fourth quarter. Such sales were approximately 31 percent of total net sales in the 2019 fourth quarter, compared with 30 percent in the 2018 fourth quarter.Gross profit, as a percentage of net sales, for the 2019 fourth quarter was 60.0 percent, compared with 59.7 percent in the 2018 fourth quarter.Operating expenses for the 2019 fourth quarter were $293.7 million, compared with $245.7 million in the 2018 fourth quarter. Operating expenses for the 2019 fourth quarter included a $13.5 million provision in connection with an intellectual property claim brought by the descendants of Hubert Hansen, in relation to the Company’s use of the Hubert Hansen name prior to the transaction with The Coca-Cola Company, that closed in 2015.Distribution costs as a percentage of net sales were 3.5 percent for the 2019 fourth quarter, compared with 3.7 percent in the 2018 fourth quarter.Selling expenses as a percentage of net sales for the 2019 fourth quarter were 12.3 percent, compared with 11.3 percent in the 2018 fourth quarter.General and administrative expenses for the 2019 fourth quarter were $133.0 million, or 13.1 percent of net sales, compared with $106.6 million, or 11.5 percent of net sales, for the 2018 fourth quarter.  General and administrative expenses for the 2019 fourth quarter include the provision in connection with the intellectual property claim referred to above.  Stock-based compensation (a non-cash item) was $16.5 million for the fourth quarter of 2019, compared with $14.7 million in the 2018 fourth quarter.  Operating income for the 2019 fourth quarter increased to $317.0 million from $306.5 million in the 2018 fourth quarter.The effective tax rate for the 2019 fourth quarter was 20.6 percent, compared with 23.1 percent in the 2018 fourth quarter. The decrease in the effective tax rate was primarily the result of a decrease in state income taxes. In addition, the provision for income taxes for the 2019 fourth quarter included a non-recurring tax benefit of $8.0 million as a result of a change in the estimated effective state income tax rates. The decrease in the effective tax rate was partially offset by increased income taxes in certain foreign jurisdictions.Net income for the 2019 fourth quarter increased 6.6 percent to $255.0 million from $239.1 million in the 2018 fourth quarter.  Net income per diluted share for the 2019 fourth quarter increased 9.7 percent to $0.47 from $0.43 in the fourth quarter of 2018.Rodney C. Sacks, Chairman and Chief Executive Officer, said: “We are pleased to report record gross and net sales for the 2019 fourth quarter and for the 2019 fiscal year, driven by growth in our Monster Energy® brand energy drinks internationally, as well as from sales of our Reign Total Body Fuel™ high performance energy drinks, which we launched in the first quarter of 2019.“Net sales for the 2019 fourth quarter exceeded $1 billion for the first time, and for the full year exceeded $4 billion for the first time. Net income for the 2019 year exceeded $1 billion, also for the first time.“During the fourth quarter, we launched Java Monster® Farmer’s Oats and two new Reign Total Body Fuel™ high performance energy drinks in the United States.  Internationally, we added various Monster Energy® brand energy drinks, as well as Espresso Monster® to our portfolio in certain countries and launched Monster HydroSport Super Fuel® in Germany, the Republic of Ireland and the United Kingdom during the fourth quarter.  Also during the fourth quarter, we launched our Reign Total Body Fuel™ high performance energy drinks in Puerto Rico, the Republic of Ireland and the United Kingdom and are planning further introductions in other international markets in 2020.“We also launched Predator®, our affordable energy brand in additional international markets during the fourth quarter, with plans for further launches of Predator® this year. “We have a robust plan for new product introductions in 2020, and most recently launched our Monster Energy® brand energy drinks in Israel, with further country launches and transitions planned for later this year,” Sacks added.2019 Full-Year ResultsNet sales for the twelve-months ended December 31, 2019 increased 10.3 percent to $4.20 billion from $3.81 billion in the comparable period last year.  Gross sales for the twelve-months ended December 31, 2019 increased 9.9 percent to $4.87 billion from $4.43 billion in the comparable period last year.Net changes in foreign currency exchange rates had an unfavorable impact on net and gross sales for the twelve-months ended December 31, 2019 of $69.2 million and $82.5 million, respectively.Gross profit, as a percentage of net sales, for the twelve-months ended December 31, 2019 was 60.0 percent, compared with 60.3 percent in the comparable period last year.Operating expenses for the twelve-months ended December 31, 2019 were $1.12 billion, compared with $1.01 billion in the comparable period last year.Operating income for the twelve-months ended December 31, 2019 increased to $1.40 billion from $1.28 billion in the comparable period last year.Net income for the twelve-months ended December 31, 2019 increased 11.6 percent to $1.11 billion from $993.0 million in the comparable period last year.  Net income per diluted share for the twelve-months ended December 31, 2019 increased 15.2 percent to $2.03 from $1.76 in the comparable period last year. The effective tax rate was 21.8 percent for the twelve-months ended December 31, 2019, versus 23.2 percent for the comparable period last year.Share Repurchase ProgramDuring the 2019 fourth quarter, the Company purchased approximately 4.1 million shares of its common stock at an average purchase price of $55.75 per share, for a total amount of $229.6 million (excluding broker commissions).As of February 27, 2020, approximately $536.6 million remained available for repurchase under the Company’s previously authorized repurchase programs. Investor Conference CallThe Company will host an investor conference call today, February 27, 2020, at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time).  The conference call will be open to all interested investors through a live audio web broadcast via the internet at www.monsterbevcorp.com in the “Events & Presentations” section.  For those who are not able to listen to the live broadcast, the call will be archived for approximately one year on the website.Monster Beverage CorporationBased in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company’s subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated tea + energy drinks, Muscle Monster® non-carbonated energy shakes, Monster Hydro® non-carbonated refreshment + energy drinks, Monster HydroSport Super Fuel® non-carbonated advanced hydration + energy drinks, Monster Dragon Tea® non-carbonated energy teas, Reign Total Body Fuel™ high performance energy drinks, Reign Inferno™ thermogenic fuel high performance energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Play® and Power Play® (stylized) energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks, Live+® energy drinks and Predator® energy drinks.  For more information, visit www.monsterbevcorp.com.   Note Regarding Use of Non-GAAP MeasuresGross sales is used internally by management as an indicator of and to monitor operating performance, including sales performance of particular products, salesperson performance, product growth or declines and overall Company performance. The use of gross sales allows evaluation of sales performance before the effect of any promotional items, which can mask certain performance issues. We therefore believe that the presentation of gross sales provides a useful measure of our operating performance. Gross sales is not a measure that is recognized under accounting principles generally accepted in the United States of America (“GAAP”) and should not be considered as an alternative to net sales, which is determined in accordance with GAAP, and should not be used alone as an indicator of operating performance in place of net sales. Additionally, gross sales may not be comparable to similarly titled measures used by other companies, as gross sales has been defined by our internal reporting practices. In addition, gross sales may not be realized in the form of cash receipts as promotional payments and allowances may be deducted from payments received from certain customers.The following table reconciles the non-GAAP financial measure of gross sales with the most directly comparable GAAP financial measure of net sales (in thousands):Caution Concerning Forward-Looking StatementsCertain statements made in this announcement may constitute “forward-looking statements” within the meaning of the U.S. federal securities laws, as amended, regarding the expectations of management with respect to our future operating results and other future events including revenues and profitability.  The Company cautions that these statements are based on management’s current knowledge and expectations and are subject to certain risks and uncertainties, many of which are outside of the control of the Company, that could cause actual results and events to differ materially from the statements made herein.  Such risks and uncertainties include, but are not limited to, the following: our ability to recognize benefits from The Coca-Cola Company (TCCC) transaction; our extensive commercial arrangements with TCCC and, as a result, our future performance’s substantial dependence on the success of our relationship with TCCC; the impact of TCCC bottlers/distributors distributing Coca-Cola brand energy drinks; the impact on our business of trademark and trade dress infringement proceedings brought against us relating to our Reign Total Body Fuel™ high performance energy drinks; exposure to significant liabilities due to litigation, legal or regulatory proceedings; intellectual property injunctions; our ability to introduce and increase sales of both existing and new products; our ability to implement the share repurchase programs; unanticipated litigation concerning the Company’s products; the current uncertainty and volatility in the national and global economy; changes in consumer preferences; adverse publicity surrounding obesity and health concerns related to our products, water usage, environmental impact, human rights and labor and workplace laws; changes in demand due to both domestic and international economic conditions; the impact on our global supply chain and our operations due to the recent coronavirus (or COVID-19) outbreak; activities and strategies of competitors, including the introduction of new products and competitive pricing and/or marketing of similar products; actual performance of the parties under the new distribution agreements; potential disruptions arising out of the transition of certain territories to new distributors; changes in sales levels by existing distributors; unanticipated costs incurred in connection with the termination of existing distribution agreements or the transition to new distributors; changes in the price and/or availability of raw materials; other supply issues, including the availability of products and/or suitable production facilities including limitations on co-packing availability and retort production; product distribution and placement decisions by retailers; the effects of retailer consolidation on our business and our ability to successfully adapt to the rapidly changing retail landscape; changes in governmental regulation; the imposition of new and/or increased excise sales and/or other taxes on our products; criticism of energy drinks and/or the energy drink market generally; our ability to satisfy all criteria set forth in any U.S. model energy drink guidelines; the impact of proposals to limit or restrict the sale of energy drinks to minors and/or persons below a specified age and/or restrict the venues and/or the size of containers in which energy drinks can be sold; or political, legislative or other governmental actions or events, including the outcome of any state attorney general, government and/or quasi-government agency inquiries, in one or more regions in which we operate.  For a more detailed discussion of these and other risks that could affect our operating results, see the Company’s reports filed with the Securities and Exchange Commission, including our annual report on Form 10-K for the year ended December 31, 2018 and our subsequently filed quarterly reports on Form 10-Q. The Company’s actual results could differ materially from those contained in the forward-looking statements.  The Company assumes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.(tables below)MONSTER BEVERAGE CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED STATEMENTS OF INCOME AND OTHER INFORMATIONFOR THE THREE- AND TWELVE-MONTHS ENDED DECEMBER 31, 2019 AND 2018(In Thousands, Except Per Share Amounts) (Unaudited)                                                                                     ¹ Includes $10.7 million and $11.0 million for the three-months ended December 31, 2019 and 2018, respectively, related to the recognition of deferred revenue. Includes $46.3 million and $44.3 million for the twelve-months ended December 31, 2019 and 2018, respectively, related to the recognition of deferred revenue.² Includes $0.3 million and $0.02 million for the three-months ended December 31, 2019 and 2018, respectively, related to distributor termination costs. Includes $11.3 million and $26.6 million for the twelve-months ended December 31, 2019 and 2018, respectively, related to distributor termination costs.3 Excludes Other segment net sales of $4.9 million and $5.1 million for the three-months ended December 31, 2019 and 2018, respectively, comprised of net sales of AFF Third-Party Products to independent third-party customers, as these sales do not have unit case equivalents. Excludes Other segment net sales of $21.9 million and $22.9 million for the twelve-months ended December 31, 2019 and 2018, respectively, comprised of net sales of AFF Third-Party Products to independent third-party customers, as these sales do not have unit case equivalents.MONSTER BEVERAGE CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED BALANCE SHEETSAS OF DECEMBER 31, 2019 AND DECEMBER 31, 2018(In Thousands, Except Par Value) (Unaudited)     "
    },
    {
        "title": "Monster Beverage to Report 2019 Fourth Quarter Financial  Results on February 27, 2020",
        "subtitle": "",
        "date": "Feb 20, 2020 8:05AM EST",
        "content": "CORONA, Calif., Feb.  20, 2020  (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ:MNST) announced today that results for its fourth quarter ended December 31, 2019 will be released on Thursday, February 27, 2020 after the close of the market.  The company also said that chairman and chief executive officer, Rodney Sacks, and vice chairman and president, Hilton Schlosberg, will host an investor conference call that same day at 2:00 p.m. Pacific Time to review the company’s financial results and operations.The call will be open to all interested investors through a live audio webcast via the Internet at www.monsterbevcorp.com.  For those who are not able to listen to the live broadcast, the call will be archived for approximately one year on the website.Monster Beverage CorporationBased in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company’s subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated energy drinks, Muscle Monster® energy shakes, Monster Hydro® energy drinks, Reign Total Body Fuel™ high performance energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Power Play® energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks and Predator® energy drinks.  For more information, visit www.monsterbevcorp.com. "
    },
    {
        "title": "Thinking about trading options or stock in Boeing, Mercadolibre, Monster Beverage, Roku, or Tesla?",
        "subtitle": "",
        "date": "Jan 13, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 13, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, MELI, MNST, ROKU, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-boeing-mercadolibre-monster-beverage-roku-or-tesla-300985637.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Monster Beverage Announces Webcast Details for Investor Meeting/Business Update January 9, 2020",
        "subtitle": "",
        "date": "Jan 2, 2020 8:15AM EST",
        "content": "CORONA, Calif., Jan.  02, 2020  (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ:MNST) announced today that its Chairman and Chief Executive Officer, Rodney Sacks, and Vice Chairman and President, Hilton Schlosberg, will host an investor meeting on Thursday, January 9, 2020 to provide an update on the Company’s business and operations.  The Company’s presentation will be open to all interested parties as a live webcast at www.monsterbevcorp.com, under the “Events & Presentations” section, at approximately 4:15 p.m. Eastern Time.  The event will be archived on the website for approximately one year.Monster Beverage Corporation Based in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company’s subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated energy drinks, Muscle Monster® energy shakes, Monster Hydro® energy drinks, Reign Total Body Fuel™ high performance energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Power Play® energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks and Predator® energy drinks.  For more information, visit www.monsterbevcorp.com.CONTACTS:   Rodney C. SacksChairman and Chief Executive Officer(951) 739-6200Hilton H. SchlosbergVice Chairman (951) 739-6200Roger S. Pondel / Judy Lin SfetcuPondelWilkinson Inc.(310) 279-5980 "
    },
    {
        "title": "Monster Beverage Reports 2019 Third Quarter Financial Results",
        "subtitle": "",
        "date": "Nov 7, 2019 4:05PM EST",
        "content": "         -- Third Quarter Net Sales rise 11.6 percent to $1.13 billion ---- Third Quarter Net Income increases 11.6 percent to $298.9 million ---- Third Quarter Net Income per diluted share increases 14.0 percent to $0.55 per share ---- Board authorizes new $500.0 million share repurchase program --CORONA, Calif., Nov.  07, 2019  (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ: MNST) today reported financial results for the three- and nine-months ended September 30, 2019.Third Quarter ResultsNet sales for the 2019 third quarter increased 11.6 percent to $1.13 billion from $1.02 billion in the same period last year.  Gross sales for the 2019 third quarter increased 11.3 percent to $1.32 billion from $1.18 billion in the same period last year.  The comparative net and gross sales for the 2018 third quarter were positively impacted by approximately $16.0 million and $18.0 million, respectively, due to advance purchases made by our customers in anticipation of a price increase effective November 1, 2018 in the United States.Net changes in foreign currency exchange rates had an unfavorable impact on net and gross sales for the 2019 third quarter of $12.2 million and $15.1 million, respectively.Net sales for the Company’s Monster Energy® Drinks segment, which primarily includes the Company’s Monster Energy® drinks and Reign Total Body Fuel™ high performance energy drinks, increased 13.5 percent to $1.06 billion for the 2019 third quarter, from $935.1 million for the 2018 third quarter.  Net changes in foreign currency exchange rates had an unfavorable impact on net sales for the Monster Energy® Drinks segment of approximately $10.8 million for the 2019 third quarter.Net sales for the Company’s Strategic Brands segment, which primarily includes the various energy drink brands acquired from The Coca-Cola Company, as well as the Company’s affordable energy brands, decreased 10.9 percent to $66.3 million for the 2019 third quarter, from $74.4 million in the 2018 third quarter.  Net changes in foreign currency exchange rates had an unfavorable impact on net sales for the Strategic Brands segment of $1.4 million for the 2019 third quarter.Net sales for the Company’s Other segment, which includes certain products of American Fruits and Flavors sold to independent third parties (the “AFF Third-Party Products”), were $5.9 million for the 2019 third quarter, compared with $6.6 million in the 2018 third quarter.Net sales to customers outside the United States increased 34.2 percent to $379.8 million in the 2019 third quarter, from $283.0 million in the 2018 third quarter. Such sales were approximately 34 percent of total net sales in the 2019 third quarter, compared with 28 percent in the 2018 third quarter.Gross profit, as a percentage of net sales, for the 2019 third quarter was 59.4 percent, compared with 59.8 percent in the 2018 third quarter.  The decrease in gross profit as a percentage of net sales for the 2019 third quarter was primarily the result of geographical and product sales mix. Such decrease was partially offset by price increases as well as reduced input costs.Operating expenses for the 2019 third quarter were $277.6 million, compared with $268.1 million in the 2018 third quarter. There were no distributor termination expenses for the 2019 third quarter. In the 2018 third quarter, operating expenses included $14.1 million of distributor termination expenses.Distribution costs as a percentage of net sales were 3.3 percent for the 2019 third quarter, compared with 4.1 percent in the 2018 third quarter.Selling expenses as a percentage of net sales for the 2019 third quarter were 11.1 percent, compared with 11.2 percent in the 2018 third quarter.General and administrative expenses for the 2019 third quarter were $114.2 million, or 10.1 percent of net sales, compared with $112.7 million, or 11.1 percent of net sales, for the 2018 third quarter.  Stock-based compensation (a non-cash item) was $16.0 million for the third quarter of 2019, compared with $14.1 million in the 2018 third quarter.Operating income for the 2019 third quarter increased to $395.4 million from $339.6 million in the 2018 third quarter.The effective tax rate for the 2019 third quarter was 25.0 percent, compared with 21.8 percent in the 2018 third quarter. The increase in the effective tax rate was primarily due to increased income taxes in certain foreign jurisdictions as well as a decrease in the equity compensation deduction. Net income for the 2019 third quarter increased 11.6 percent to $298.9 million from $267.7 million in the 2018 third quarter.  Net income per diluted share for the 2019 third quarter increased 14.0 percent to $0.55 from $0.48 in the third quarter of 2018.Rodney C. Sacks, Chairman and Chief Executive Officer, said: “We are pleased to report record gross and net sales in the 2019 third quarter, driven by our Reign Total Body Fuel™ high performance energy drinks, which we launched in the first quarter, as well as growth in our Monster Energy® brand energy drinks internationally.“In the third quarter we launched or transitioned our Monster Energy® brand energy drinks to the Coca-Cola bottlers in the Dominican Republic, El Salvador and Honduras. Further country launches and transitions are planned for the fourth quarter. “We launched a number of new Monster Energy® brand energy drinks and three new Reign Total Body Fuel™ high performance energy drinks during the third quarter and in October, in the United States.  Internationally, we added various Monster Energy® brand energy drinks to our portfolio in certain countries in the third quarter. We launched our Reign Total Body Fuel™ high performance energy drinks in Sweden in the third quarter and are planning further introductions in other international markets.“We also launched Predator®, our affordable energy brand in additional international markets during the third quarter, with plans for further launches of Predator® later this year and into 2020,” Sacks added.2019 Nine-Months ResultsNet sales for the nine-months ended September 30, 2019 increased 10.4 percent to $3.18 billion from $2.88 billion in the comparable period last year.  Gross sales for the nine-months ended September 30, 2019 increased 9.8 percent to $3.70 billion from $3.37 billion in the comparable period last year.Net changes in foreign currency exchange rates had an unfavorable impact on net and gross sales for the nine-months ended September 30, 2019 of $60.1 million and $71.7 million, respectively.Gross profit, as a percentage of net sales, for the nine-months ended September 30, 2019 was 59.9 percent, compared with 60.5 percent in the comparable period last year.Operating expenses for the nine-months ended September 30, 2019 were $821.9 million, compared with $766.1 million in the comparable period last year.Operating income for the nine-months ended September 30, 2019 increased to $1.09 billion from $977.1 million in the comparable period last year.Net income for the nine-months ended September 30, 2019 increased 13.1 percent to $852.9 million from $753.9 million in the comparable period last year. Net income per diluted share for the nine-months ended September 30, 2019 increased 16.9 percent to $1.56 from $1.33 in the comparable period last year. The effective tax rate was 22.1 percent for the nine-months ended September 30, 2019, versus 23.3 percent for the comparable period last year.Share Repurchase ProgramDuring the 2019 third quarter, the Company purchased approximately 4.3 million shares of its common stock at an average purchase price of $58.60 per share, for a total amount of $254.3 million (excluding broker commissions).As of November 6, 2019, approximately $36.6 million remained available for repurchase under the February 2019 repurchase program. On November 6, 2019, the Company’s Board of Directors authorized a new repurchase program for the repurchase of up to an additional $500.0 million of the Company’s outstanding common stock.  The Company expects to make the share repurchases from time to time in the open market or through privately-negotiated transactions, or otherwise, subject to applicable laws, regulations and approvals.  The timing of the share repurchases will depend on a variety of factors, including market conditions, and the share repurchases may be suspended or discontinued at any time.Investor Conference CallThe Company will host an investor conference call today, November 7, 2019, at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time).  The conference call will be open to all interested investors through a live audio web broadcast via the internet at www.monsterbevcorp.com in the “Events & Presentations” section.  For those who are not able to listen to the live broadcast, the call will be archived for approximately one year on the website.Monster Beverage CorporationBased in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company’s subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated energy drinks, Muscle Monster® energy shakes, Monster Hydro® energy drinks, Reign Total Body Fuel™ high performance energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Power Play® energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks and Predator® energy drinks.  For more information, visit www.monsterbevcorp.com.   Note Regarding Use of Non-GAAP MeasuresGross sales is used internally by management as an indicator of and to monitor operating performance, including sales performance of particular products, salesperson performance, product growth or declines and overall Company performance. The use of gross sales allows evaluation of sales performance before the effect of any promotional items, which can mask certain performance issues. We therefore believe that the presentation of gross sales provides a useful measure of our operating performance. Gross sales is not a measure that is recognized under accounting principles generally accepted in the United States of America (“GAAP”) and should not be considered as an alternative to net sales, which is determined in accordance with GAAP, and should not be used alone as an indicator of operating performance in place of net sales. Additionally, gross sales may not be comparable to similarly titled measures used by other companies, as gross sales has been defined by our internal reporting practices. In addition, gross sales may not be realized in the form of cash receipts as promotional payments and allowances may be deducted from payments received from certain customers.The following table reconciles the non-GAAP financial measure of gross sales with the most directly comparable GAAP financial measure of net sales (in thousands):Caution Concerning Forward-Looking StatementsCertain statements made in this announcement may constitute “forward-looking statements” within the meaning of the U.S. federal securities laws, as amended, regarding the expectations of management with respect to our future operating results and other future events including revenues and profitability.  The Company cautions that these statements are based on management’s current knowledge and expectations and are subject to certain risks and uncertainties, many of which are outside of the control of the Company, that could cause actual results and events to differ materially from the statements made herein.  Such risks and uncertainties include, but are not limited to, the following: our ability to recognize benefits from The Coca-Cola Company (TCCC) transaction and the American Fruits and Flavors transaction; our extensive commercial arrangements with TCCC and, as a result, our future performance’s substantial dependence on the success of our relationship with TCCC; the impact of TCCC bottlers distributing Coca-Cola brand energy drinks; the impact on our business of trademark and trade dress infringement proceedings brought against us relating to our Reign Total Body Fuel™ high performance energy drinks; our ability to introduce and increase sales of both existing and new products; our ability to implement the share repurchase programs; unanticipated litigation concerning the Company’s products; the current uncertainty and volatility in the national and global economy; changes in consumer preferences; adverse publicity surrounding obesity and health concerns related to our products, water usage, environmental impact, human rights and labor and workplace laws; changes in demand due to both domestic and international economic conditions; activities and strategies of competitors, including the introduction of new products and competitive pricing and/or marketing of similar products; actual performance of the parties under the new distribution agreements; potential disruptions arising out of the transition of certain territories to new distributors; changes in sales levels by existing distributors; unanticipated costs incurred in connection with the termination of existing distribution agreements or the transition to new distributors; changes in the price and/or availability of raw materials; other supply issues, including the availability of products and/or suitable production facilities including limitations on co-packing availability and retort production; product distribution and placement decisions by retailers; changes in governmental regulation; the imposition of new and/or increased excise sales and/or other taxes on our products; criticism of energy drinks and/or the energy drink market generally; our ability to satisfy all criteria set forth in any U.S. model energy drink guidelines; the impact of proposals to limit or restrict the sale of energy drinks to minors and/or persons below a specified age and/or restrict the venues and/or the size of containers in which energy drinks can be sold; or political, legislative or other governmental actions or events, including the outcome of any state attorney general, government and/or quasi-government agency inquiries, in one or more regions in which we operate.  For a more detailed discussion of these and other risks that could affect our operating results, see the Company’s reports filed with the Securities and Exchange Commission, including our annual report on Form 10-K for the year ended December 31, 2018. The Company’s actual results could differ materially from those contained in the forward-looking statements.  The Company assumes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.(tables below) MONSTER BEVERAGE CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED STATEMENTS OF INCOME AND OTHER INFORMATIONFOR THE THREE- AND NINE-MONTHS ENDED SEPTEMBER 30, 2019 AND 2018(In Thousands, Except Per Share Amounts) (Unaudited)                                                                                     ¹Includes $10.7 million and $11.1 million for the three-months ended September 30, 2019 and 2018, respectively, related to the recognition of deferred revenue. Includes $35.6 million and $33.3 million for the nine-months ended September 30, 2019 and 2018, respectively, related to the recognition of deferred revenue.² Includes no amounts for the three-months ended September 30, 2019 related to distributor termination costs. Includes $14.1 million for the three-months ended September 30, 2018 related to distributor termination costs. Includes $11.0 million and $26.6 million for the nine-months ended September 30, 2019 and 2018, respectively, related to distributor termination costs.3Excludes Other segment net sales of $5.9 million and $6.6 million for the three-months ended September 30, 2019 and 2018, respectively, comprised of net sales of AFF Third-Party Products to independent third-party customers, as these sales do not have unit case equivalents. Excludes Other segment net sales of $17.0 million and $17.9 million for the nine-months ended September 30, 2019 and 2018, respectively, comprised of net sales of AFF Third-Party Products to independent third-party customers, as these sales do not have unit case equivalents. MONSTER BEVERAGE CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED BALANCE SHEETSAS OF SEPTEMBER 30, 2019 AND DECEMBER 31, 2018(In Thousands, Except Par Value) (Unaudited)     "
    },
    {
        "title": "BetterInvesting Magazine Releases January Stock To Study And Undervalued Stock Choices For Investors' Informational And Educational Use",
        "subtitle": "",
        "date": "Oct 31, 2019 4:15PM EDT",
        "content": "MADISON HEIGHTS, Mich., Oct. 31, 2019 /PRNewswire/ -- The Editorial Advisory and Securities Review Committee of BetterInvesting Magazine today announced Monster Beverage Corporation (NDQ: MNST) as its January 2020 \"Stock to Study\" and Wells Fargo & Company (NYSE: WFC) as its January 2020 \"Undervalued Stock\" for investors' informational and educational use.\"The committee selected Monster Beverage for its proven growth story, advantageous distribution relationship with Coca-Cola and forecast for continued industry growth,\" said Adam Ritt, editor in chief of BetterInvesting Magazine. \"For the Undervalued selection, the committee believes the new CEO at Wells Fargo could be a catalyst in improving the company's performance over the next 18 months.\" Check BetterInvesting's January/February issue for more details about these selections. Go to the trial version of BetterInvesting's online tools to study the investment potential of Monster Beverage and Wells Fargo by viewing their fundamental data and applying judgments.Committee members are Robert M. Bilkie, Jr., CFA; Daniel J. Boyle, CFA; Marisa Bradbury, CFA; Philip S. Dano, CFA; Walter J. Kirchberger, CFA; and Adam Ritt.As stated, the BetterInvesting committee's Stock to Study and Undervalued Stock choices are for the informational and educational uses of investors and are not intended as investment recommendations. BetterInvesting urges investors to educate themselves about the stock market so they can make informed decisions about stock purchases. About BetterInvestingBetterInvesting is a national nonprofit organization that has been empowering individual investors since 1951. Founded in Detroit, the association (formerly known as National Association of Investors Corporation) was borne of the conviction that anyone can become a successful long-term investor by following common-sense investing practices. BetterInvesting has helped more than 5 million people become better, more informed investors by providing webinars, in-person events, easy-to-use online tools for analyzing stocks, a monthly magazine and a community of volunteers and like-minded investors. For more information about BetterInvesting, visit its website at www.betterinvesting.org or call toll free (877) 275-6242.Follow us on Twitter and Facebook.  View original content:http://www.prnewswire.com/news-releases/betterinvesting-magazine-releases-january-stock-to-study-and-undervalued-stock-choices-for-investors-informational-and-educational-use-300949436.htmlSOURCE  BetterInvesting"
    },
    {
        "title": "Monster Beverage to Report 2019 Third Quarter Financial Results on November 7, 2019",
        "subtitle": "",
        "date": "Oct 31, 2019 8:00AM EDT",
        "content": "--Company to Conduct Conference Call at 2:00 p.m. Pacific Time--CORONA, Calif., Oct.  31, 2019  (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ:MNST) announced today that results for its third quarter ended September 30, 2019 will be released on Thursday, November 7, 2019 after the close of the market.  The company also said that chairman and chief executive officer, Rodney Sacks, and vice chairman and president, Hilton Schlosberg, will host an investor conference call that same day at 2:00 p.m. Pacific Time to review the company’s financial results and operations.The call will be open to all interested investors through a live audio webcast via the Internet at www.monsterbevcorp.com. For those who are not able to listen to the live broadcast, the call will be archived for approximately one year on the website.Monster Beverage CorporationBased in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company’s subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated energy drinks, Muscle Monster® energy shakes, Monster Hydro® energy drinks, Reign Total Body Fuel™ high performance energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Power Play® energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks and Predator® energy drinks. For more information, visit www.monsterbevcorp.com."
    },
    {
        "title": "Monster Statement Regarding Denial of VPX’s Preliminary Injunction Motion",
        "subtitle": "",
        "date": "Oct 17, 2019 4:33PM EDT",
        "content": "CORONA, Calif., Oct.  17, 2019  (GLOBE NEWSWIRE) -- Monster Energy Company (“Monster”) and Reign Beverage Company, LLC (“Reign”) reported that the US District Court for the Southern District of Florida yesterday issued its decision denying the baseless motion for a preliminary injunction filed by Vital Pharmaceuticals, Inc., d/b/a VPX Sports (“VPX”) against Monster and Reign’s REIGN TOTAL BODY FUEL performance energy drinks.In denying VPX’s motion, the Court ruled that “VPX has failed to meet any of the elements of a preliminary injunction” and that “VPX has failed to establish that it is likely to succeed on the merits [of its claims against Monster and Reign]—and, therefore, a preliminary injunction is unwarranted.” In view of the Court’s Order, VPX cannot interrupt distributors’ and retailers’ right to sell REIGN TOTAL BODY FUEL performance energy drinks.  The Court’s ruling also strongly supports Monster’s and Reign’s previously stated belief that they will ultimately prevail against VPX’s frivolous claims in this lawsuit. "
    },
    {
        "title": "Monster Statement Regarding Unmeritorious Trademark Lawsuit",
        "subtitle": "",
        "date": "Mar 29, 2019 7:09PM EDT",
        "content": "CORONA, Calif., March 29, 2019 (GLOBE NEWSWIRE) -- Monster Energy Company (\"Monster\") today issued the following statement in response to media and other inquiries related to the unmeritorious trademark lawsuit filed yesterday against Monster by Vital Pharmaceuticals, Inc., d/b/a VPX Sports (\"VPX\"), a Florida corporation, the maker of Bang energy drinks:Monster is confident that VPX's lawsuit will ultimately be dismissed. VPX's purported acquisition of an unrelated \"Reign\" trademark two weeks ago is both improper and ineffective.VPX's lawsuit is nothing more than a frivolous and bad faith attempt to slow the national release of \"Reign Total Body Fuel.\" The fact is, this meritless lawsuit will not impede the launch of \"Reign Total Body Fuel\" in any way. The facts are straightforward:VPX's lawsuit is also an attempt to shift attention away from the lawsuit filed by Monster against VPX in September 2018 for false advertising, including false and unsupported claims that Bang contains ingredients that it does not have and provides benefits that it does not generate. Particularly telling is the fact that VPX's alleged Patent on so-called Super Creatine has been cancelled despite Bang continuing to feature such Patent on its Bang drinks. VPX also faces numerous consumer class action lawsuits for its untrue claims related to Bang.VPX's attempt to continually delay Monster's federal lawsuit against VPX was rejected today. In addressing VPX's latest desperate, delay tactics, the district court judge ruled against VPX and observed that VPX \"walked into a mess of their own making.\"\n  \n\n  \n    \n      Media Contact:Tamara TaylorSitrick & Company310-788-2850ttaylor@sitrick.com\n                  Investor Contact:Judy Lin Sfetcu / Roger PondelPondelWilkinson Inc.310-279-5966jsfetcu@pondel.com\n              \n  \n  Source: Monster Beverage Corporation"
    },
    {
        "title": "Monster Beverage Reports 2018 Fourth Quarter and Full Year Financial Results",
        "subtitle": "",
        "date": "Feb 27, 2019 4:05PM EST",
        "content": "-- Fourth Quarter Net Sales rise 14.1 percent; 15.1 percent without adoption of ASC 606 ---- Fourth Quarter Net Income increases 18.8 percent to $239.1 million ---- Fourth Quarter Net Income per diluted share increases 22.7 percent to $0.43 per share ---- Board authorizes new $500.0 million share repurchase program --CORONA, Calif., Feb. 27, 2019 (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ:MNST) today reported financial results for the three- and twelve-months ended December 31, 2018.Fourth Quarter ResultsNet sales for the 2018 fourth quarter increased 14.1 percent to $924.2 million from $810.4 million in the same period last year. Gross sales for the 2018 fourth quarter increased 13.7 percent to $1.06 billion from $934.8 million in the same period last year. Net sales for the 2018 fourth quarter were negatively impacted by $8.5 million, due to the adoption of Accounting Standards Codification (\"ASC\") 606. Under ASC 606, commissions paid to The Coca-Cola Company (\"TCCC\"), based on sales to certain of the Company's customers which TCCC accounts for under the equity method (the \"TCCC Related Parties\"), or consolidates, are included as a reduction to net sales. Prior to January 1, 2018, commissions based on sales to the TCCC Related Parties were included in operating expenses. Net and gross sales for the three-months ended December 31, 2018 were negatively impacted by advance purchases made by customers in the third quarter of 2018, due to a pre-announced price increase effective November 1, 2018 on certain Monster Energy® brand energy drinks. The Company estimates that net and gross sales for the three-months ended December 31, 2018 decreased by approximately $16.0 million and $18.0 million respectively, as a result of such advance purchases. Net changes in foreign currency exchange rates had an unfavorable impact on net and gross sales for the 2018 fourth quarter of $14.4 million and $16.2 million, respectively.Net sales for the Company's Monster Energy® Drinks segment, which primarily includes the Company's Monster Energy® drinks, increased 15.9 percent to $853.3 million for the 2018 fourth quarter, from $736.1 million for the 2017 fourth quarter. Net sales for the Company's Monster Energy® Drinks segment for the 2018 fourth quarter were negatively impacted by $3.2 million, due to the adoption of ASC 606. Net changes in foreign currency exchange rates had an unfavorable impact on net sales for the Monster Energy® Drinks segment of approximately $12.4 million for the 2018 fourth quarter.Net sales for the Company's Strategic Brands segment, which includes the various energy drink brands acquired from TCCC, decreased 5.4 percent to $65.8 million for the 2018 fourth quarter, from $69.6 million in the 2017 fourth quarter. Net sales for the Company's Strategic Brands segment for the 2018 fourth quarter were negatively impacted by $5.3 million, due to the adoption of ASC 606. Net changes in foreign currency exchange rates had an unfavorable impact on net sales for the Strategic Brands segment of $2.0 million for the three-months ended December 31, 2018.Net sales for the Company's Other segment, which includes certain products of American Fruits & Flavors sold to independent third parties (the \"AFF Third-Party Products\"), were $5.1 million for the 2018 fourth quarter, compared with $4.7 million in the 2017 fourth quarter.Net sales to customers outside the United States increased 30.4 percent to $274.3 million in the 2018 fourth quarter, from $210.4 million in the 2017 fourth quarter.Gross profit, as a percentage of net sales, for the 2018 fourth quarter was 59.7 percent, compared with 62.1 percent in the 2017 fourth quarter. Gross profit as a percentage of net sales, excluding the impact of ASC 606, was 60.1 percent for the 2018 fourth quarter. The decrease in gross profit as a percentage of net sales was primarily attributable to (i) increases in certain input costs such as aluminum cans, freight in and other input costs; (ii) geographical mix; (iii) domestic product sales mix; and (iv) the $8.5 million of commissions accounted for as a reduction to net sales due to the adoption of ASC 606. The decrease in gross profit as a percentage of net sales was partially offset by increases in domestic sales prices, as well as the decrease of promotional allowances as a percentage of gross sales.Operating expenses for the 2018 fourth quarter were $245.7 million, compared with $236.5 million in the 2017 fourth quarter. As a result of the adoption of ASC 606, commissions included in operating expenses decreased.The impact to net sales, gross profit and operating expenses from the adoption of ASC 606 is included in the table below.Distribution costs as a percentage of net sales were 3.7 percent for the 2018 fourth quarter, compared with 3.6 percent in the 2017 fourth quarter.Selling expenses as a percentage of net sales for the 2018 fourth quarter were 11.3 percent, compared with 13.6 percent in the 2017 fourth quarter.General and administrative expenses for the 2018 fourth quarter were $106.6 million, or 11.5 percent of net sales, compared with $96.7 million, or 11.9 percent of net sales, for the 2017 fourth quarter. Stock-based compensation (a non-cash item) was $14.7 million for the fourth quarter of 2018, compared with $13.0 million in the 2017 fourth quarter.Operating income for the 2018 fourth quarter increased to $306.5 million from $267.1 million in the 2017 fourth quarter.The effective tax rate for the 2018 fourth quarter was 23.1 percent, compared with 24.8 percent in the 2017 fourth quarter. The decrease in the effective tax rate was primarily due to the reduction in the U.S. federal statutory tax rate as a result of the Tax Cuts and Jobs Act (the \"Tax Reform Act\") signed into law on December 22, 2017, as well as a reduction in certain foreign income that is subject to U.S. taxation. In addition, the comparative 2017 fourth quarter effective tax rate included a one-time provisional charge related to the revaluation of the Company's deferred tax assets at December 31, 2017, and a one-time charge for the deemed mandatory repatriation of post-1986 earnings and profits, as a result of the Tax Reform Act. The decrease in the provision for income taxes was partially offset by a decrease in the stock-based compensation tax deduction.Net income for the 2018 fourth quarter increased 18.8 percent to $239.1 million from $201.3 million in the 2017 fourth quarter. Net income per diluted share for the 2018 fourth quarter increased 22.7 percent to $0.43 from $0.35 in the fourth quarter of 2017.The following table illustrates the impact of the adoption of ASC 606 for the 2018 fourth quarter as described above (in thousands):\n  \n\n  \n    \n      Three-MonthsEnded December31, 2018, asReported\n                  PercentChange2018 vs2017\n                  Three-MonthsEnded December31, 2018, Withoutthe Adoption ofASC 606\n                  PercentChange2018 vs2017\n              Net Sales by Segment:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Monster Energy® Drinks\n                      $\n                      853,338\n                      \n                      \n                      15.9\n                      %\n                      \n                      $\n                      856,493\n                      \n                      \n                      16.4\n                      %\n                  Strategic Brands\n                      \n                      65,824\n                      \n                      \n                      (5.4\n                      %)\n                      \n                      \n                      71,160\n                      \n                      \n                      2.3\n                      %\n                  Other\n                      \n                      5,067\n                      \n                      \n                      8.0\n                      %\n                      \n                      \n                      5,067\n                      \n                      \n                      8.0\n                      %\n                  Total Net Sales\n                      $\n                      924,229\n                      \n                      \n                      14.1\n                      %\n                      \n                      $\n                      932,720\n                      \n                      \n                      15.1\n                      %\n                  Cost of Sales\n                      \n                      372,028\n                      \n                      \n                      21.3\n                      %\n                      \n                      \n                      372,029\n                      \n                      \n                      21.3\n                      %\n                  Gross Profit\n                      $\n                      552,201\n                      \n                      \n                      9.6\n                      %\n                      \n                      $\n                      560,691\n                      \n                      \n                      11.3\n                      %\n                  Gross Profit as a percentage of net sales\n                      \n                      59.7\n                      %\n                      \n                      \n                      \n                      \n                      \n                      60.1\n                      %\n                      \n                      \n                      \n                  Operating Expenses\n                      $\n                      245,691\n                      \n                      \n                      3.9\n                      %\n                      \n                      $\n                      254,182\n                      \n                      \n                      7.5\n                      %\n                  Average Net Sales Per Case\n                      $\n                      9.43\n                      \n                      \n                      1.3\n                      %\n                      \n                      $\n                      9.52\n                      \n                      \n                      2.2\n                      %\n                  \n  \n  Rodney C. Sacks, Chairman and Chief Executive Officer, said: \"We are pleased to report record net sales for both our 2018 fiscal fourth quarter and 2018 full year, driven by growth in our Monster Energy® brand energy drinks and new energy drink introductions.\"Our strategic alignment with the Coca-Cola system bottlers worldwide continues to progress well.\"In the United States, we are in the process of launching nationally Monster Energy Ultra Paradise® and Java Monster® Swiss Chocolate. In March, we plan to launch our Reign Total Body Fuel™ line of performance energy drinks as well as our Monster Dragon TeaTM line.\"We successfully launched additional Monster Energy® and Strategic Brands energy drinks in a number of our existing geographies in the fourth quarter of 2018. One or more of our energy drinks are now distributed in approximately 155 countries and territories worldwide.\"During 2019, we will continue to launch our Monster Energy® brand of energy drinks in new geographical markets, and plan to launch Predator®, our strategically preferred affordable energy brand, in additional markets internationally,\" Sacks added.2018 Twelve-MonthsNet sales for the year ended December 31, 2018 increased 13.0 percent to $3.81 billion from $3.37 billion in the comparable period last year. Gross sales for the year ended December 31, 2018 increased 14.7 percent to $4.43 billion from $3.86 billion in the comparable period last year.Net sales for the year ended December 31, 2018 were negatively impacted by $42.2 million due to the adoption of ASC 606. Net changes in foreign currency exchange rates had a favorable impact on net and gross sales for the year ended December 31, 2018 of $14.8 million and $21.8 million, respectively.Gross profit, as a percentage of net sales, for the year ended December 31, 2018 was 60.3 percent, compared with 63.5 percent in the comparable period last year.Operating expenses for the year ended December 31, 2018 were $1.01 billion, compared with $938.9 million in the comparable period last year.Operating income for the year ended December 31, 2018 increased to $1.28 billion from $1.20 billion in the comparable period last year.Net income for the year ended December 31, 2018 increased 21.0 percent to $993.0 million from $820.7 million in the comparable period last year. Net income per diluted share for the year ended December 31, 2018 increased 23.8 percent to $1.76 from $1.42 in the comparable period last year. The effective tax rate was 23.2 percent for the year ended December 31, 2018, versus 31.7 percent for the comparable period last year.Share Repurchase ProgramDuring the 2018 fourth quarter, the Company purchased approximately 9.4 million shares of its common stock at an average purchase price of $56.99 per share, for a total amount of $536.9 million (excluding broker commissions). The following table summarizes the Company's share repurchase activity during the 2018 fourth quarter (dollars in thousands, except per share amounts):\n  \n\n  \n    \n      SharesPurchased\n                  Avg.PurchasePrice\n                  Amount\n                  AuthorizationRemaining\n              May 2018 Repurchase Program\n                      3,462,109\n                      \n                      $\n                      56.79\n                      \n                      $\n                      196,618\n                      \n                      $\n                      -\n                  August 2018 Repurchase Program\n                      5,958,417\n                      \n                      $\n                      57.11\n                      \n                      $\n                      340,298\n                      \n                      $\n                      159,612\n                  Total\n                      9,420,526\n                      \n                      $\n                      56.99\n                      \n                      $\n                      536,916\n                      \n                      \n                      \n                  \n  \n  As of February 26, 2019, approximately $20.6 million remained available for repurchase under the August 2018 repurchase program. On February 26, 2019, the Company's Board of Directors authorized a new repurchase program for the repurchase of up to an additional $500.0 million of the Company's outstanding common stock. The Company expects to make the share repurchases from time to time in the open market or through privately-negotiated transactions, or otherwise, subject to applicable laws, regulations and approvals. The timing of the share repurchases will depend on a variety of factors, including market conditions, and the share repurchases may be suspended or discontinued at any time.Investor Conference CallThe Company will host an investor conference call today, February 27, 2019, at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time). The conference call will be open to all interested investors through a live audio web broadcast via the internet at www.monsterbevcorp.com in the \"Events & Presentations\" section. For those who are not able to listen to the live broadcast, the call will be archived for approximately one year on the website.Monster Beverage CorporationBased in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company's subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated energy drinks, Muscle Monster® energy shakes, Monster Hydro® energy drinks, Reign Total Body Fuel™ performance energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Power Play® energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks, Mutant® energy drinks and Predator® energy drinks. For more information, visit www.monsterbevcorp.com.Note Regarding Use of Non-GAAP MeasuresGross sales is used internally by management as an indicator of and to monitor operating performance, including sales performance of particular products, salesperson performance, product growth or declines and overall Company performance. The use of gross sales allows evaluation of sales performance before the effect of any promotional items, which can mask certain performance issues. We therefore believe that the presentation of gross sales provides a useful measure of our operating performance. Gross sales is not a measure that is recognized under accounting principles generally accepted in the United States of America (\"GAAP\") and should not be considered as an alternative to net sales, which is determined in accordance with GAAP, and should not be used alone as an indicator of operating performance in place of net sales. Additionally, gross sales may not be comparable to similarly titled measures used by other companies, as gross sales has been defined by our internal reporting practices. In addition, gross sales may not be realized in the form of cash receipts as promotional payments and allowances may be deducted from payments received from certain customers.The following table reconciles the non-GAAP financial measure of gross sales with the most directly comparable GAAP financial measure of net sales (in thousands):\n  \n\n  \n    \n      Three-Months EndedDecember 31,\n                  Twelve-Months EndedDecember 31,\n              \n                      \n                      2018\n                      \n                      \n                      2017\n                      \n                      \n                      2018\n                      \n                      \n                      2017\n                      \n                  Gross sales, net of discounts and returns\n                      \n                      $\n                      1,063,187\n                      \n                      $\n                      934,804\n                      \n                      $\n                      4,429,522\n                      \n                      $\n                      3,861,368\n                  Less: Promotional and other allowances\n                      \n                      \n                      138,958\n                      \n                      \n                      124,449\n                      \n                      \n                      622,339\n                      \n                      \n                      492,323\n                  Net Sales\n                      \n                      $\n                      924,229\n                      \n                      $\n                      810,355\n                      \n                      $\n                      3,807,183\n                      \n                      $\n                      3,369,045\n                  \n  \n  Caution Concerning Forward-Looking StatementsCertain statements made in this announcement may constitute \"forward-looking statements\" within the meaning of the U.S. federal securities laws, as amended, regarding the expectations of management with respect to our future operating results and other future events including revenues and profitability. The Company cautions that these statements are based on management's current knowledge and expectations and are subject to certain risks and uncertainties, many of which are outside of the control of the Company, that could cause actual results and events to differ materially from the statements made herein. Such risks and uncertainties include, but are not limited to, the following: our ability to recognize benefits from The Coca-Cola Company transaction and the American Fruits & Flavors transaction; effects of our arbitration with TCCC regarding energy products developed by TCCC; our ability to introduce and increase sales of both existing and new products; our ability to implement the share repurchase programs; unanticipated litigation concerning the Company's products; the current uncertainty and volatility in the national and global economy; changes in consumer preferences; changes in demand due to both domestic and international economic conditions; activities and strategies of competitors, including the introduction of new products and competitive pricing and/or marketing of similar products; actual performance of the parties under the new distribution agreements; potential disruptions arising out of the transition of certain territories to new distributors; changes in sales levels by existing distributors; unanticipated costs incurred in connection with the termination of existing distribution agreements or the transition to new distributors; changes in the price and/or availability of raw materials; other supply issues, including the availability of products and/or suitable production facilities including limitations on co-packing availability and retort production; product distribution and placement decisions by retailers; changes in governmental regulation; the imposition of new and/or increased excise sales and/or other taxes on our products; criticism of energy drinks and/or the energy drink market generally; our ability to satisfy all criteria set forth in any U.S. model energy drink guidelines; the impact of proposals to limit or restrict the sale of energy drinks to minors and/or persons below a specified age and/or restrict the venues and/or the size of containers in which energy drinks can be sold; or political, legislative or other governmental actions or events, including the outcome of any state attorney general, government and/or quasi-government agency inquiries, in one or more regions in which we operate. For a more detailed discussion of these and other risks that could affect our operating results, see the Company's reports filed with the Securities and Exchange Commission, including our annual report on Form 10-K for the year ended December 31, 2017 and our subsequent filed quarterly report on Form 10-Q. The Company's actual results could differ materially from those contained in the forward-looking statements. The Company assumes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.(tables below)\n  \n\n  \n    \n      MONSTER BEVERAGE CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED STATEMENTS OF INCOME AND OTHER INFORMATIONFOR THE THREE- AND TWELVE-MONTHS ENDED DECEMBER 31, 2018 AND 2017(In Thousands, Except Per Share Amounts) (Unaudited)\n              \n                      Three-Months Ended\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      Twelve-Months Ended\n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      December 31,\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      December 31, \n                      \n                      \n                      \n                      \n                      \n                      \n                  \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                      \n                      \n                      2018\n                      \n                      \n                      \n                      2017\n                      \n                      \n                  Net sales¹\n                      $\n                      924,229\n                      \n                      \n                      $\n                      810,355\n                      \n                      \n                      $\n                      3,807,183\n                      \n                      \n                      $\n                      3,369,045\n                      \n                  Cost of sales\n                      \n                      372,028\n                      \n                      \n                      \n                      306,745\n                      \n                      \n                      \n                      1,511,808\n                      \n                      \n                      \n                      1,231,355\n                      \n                  Gross profit¹\n                      \n                      552,201\n                      \n                      \n                      \n                      503,610\n                      \n                      \n                      \n                      2,295,375\n                      \n                      \n                      \n                      2,137,690\n                      \n                  Gross profit as a percentage of net sales\n                      \n                      59.7\n                      %\n                      \n                      \n                      62.1\n                      %\n                      \n                      \n                      60.3\n                      %\n                      \n                      \n                      63.5\n                      %\n                  Operating expenses²\n                      \n                      245,691\n                      \n                      \n                      \n                      236,498\n                      \n                      \n                      \n                      1,011,756\n                      \n                      \n                      \n                      938,903\n                      \n                  Operating expenses as a percentage of net sales\n                      \n                      26.6\n                      %\n                      \n                      \n                      29.2\n                      %\n                      \n                      \n                      26.6\n                      %\n                      \n                      \n                      27.9\n                      %\n                  Operating income¹,²\n                      \n                      306,510\n                      \n                      \n                      \n                      267,112\n                      \n                      \n                      \n                      1,283,619\n                      \n                      \n                      \n                      1,198,787\n                      \n                  Operating income as a percentage of net sales\n                      \n                      33.2\n                      %\n                      \n                      \n                      33.0\n                      %\n                      \n                      \n                      33.7\n                      %\n                      \n                      \n                      35.6\n                      %\n                  Interest and other income, net\n                      \n                      4,384\n                      \n                      \n                      \n                      733\n                      \n                      \n                      \n                      9,653\n                      \n                      \n                      \n                      2,836\n                      \n                  Income before provision for income taxes¹,²\n                      \n                      310,894\n                      \n                      \n                      \n                      267,845\n                      \n                      \n                      \n                      1,293,272\n                      \n                      \n                      \n                      1,201,623\n                      \n                  Provision for income taxes\n                      \n                      71,789\n                      \n                      \n                      \n                      66,524\n                      \n                      \n                      \n                      300,268\n                      \n                      \n                      \n                      380,945\n                      \n                  Income taxes as a percentage of income before taxes\n                      \n                      23.1\n                      %\n                      \n                      \n                      24.8\n                      %\n                      \n                      \n                      23.2\n                      %\n                      \n                      \n                      31.7\n                      %\n                  Net income¹,²\n                      $\n                      239,105\n                      \n                      \n                      $\n                      201,321\n                      \n                      \n                      $\n                      993,004\n                      \n                      \n                      $\n                      820,678\n                      \n                  Net income as a percentage of net sales\n                      \n                      25.9\n                      %\n                      \n                      \n                      24.8\n                      %\n                      \n                      \n                      26.1\n                      %\n                      \n                      \n                      24.4\n                      %\n                  Net income per common share:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      $\n                      0.43\n                      \n                      \n                      $\n                      0.36\n                      \n                      \n                      $\n                      1.78\n                      \n                      \n                      $\n                      1.45\n                      \n                  Diluted\n                      $\n                      0.43\n                      \n                      \n                      $\n                      0.35\n                      \n                      \n                      $\n                      1.76\n                      \n                      \n                      $\n                      1.42\n                      \n                  Weighted average number of shares of common stock and common stock equivalents:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Basic\n                      \n                      550,324\n                      \n                      \n                      \n                      564,500\n                      \n                      \n                      \n                      557,166\n                      \n                      \n                      \n                      566,782\n                      \n                  Diluted\n                      \n                      556,666\n                      \n                      \n                      \n                      575,036\n                      \n                      \n                      \n                      564,254\n                      \n                      \n                      \n                      577,141\n                      \n                  Case sales (in thousands) (in 192-ounce case equivalents)\n                      \n                      97,476\n                      \n                      \n                      \n                      86,548\n                      \n                      \n                      \n                      410,886\n                      \n                      \n                      \n                      359,957\n                      \n                  Average net sales per case3\n                      $\n                      9.43\n                      \n                      \n                      $\n                      9.31\n                      \n                      \n                      $\n                      9.21\n                      \n                      \n                      $\n                      9.30\n                      \n                  \n  \n   1 Includes $11.0 million and $11.8 million for the three-months ended December 31, 2018 and 2017, respectively, related to the recognition of deferred revenue. Includes $44.3 million and $43.4 million for the years ended December 31, 2018 and 2017, respectively, related to the recognition of deferred revenue. 2 Includes $0.02 million and ($0.5) million for the three-months ended December 31, 2018 and 2017, respectively, related to distributor termination costs. Includes $26.6 million and $35.4 million for the years ended December 31, 2018 and 2017, respectively, related to distributor termination costs. 3 Excludes Other segment net sales of $5.1 million and $4.7 million for the three-months ended December 31, 2018 and 2017, respectively, comprised of net sales of AFF Third-Party Products to independent third-party customers, as these sales do not have unit case equivalents. Excludes Other segment net sales of $22.9 million and $21.6 million for the years ended December 31, 2018 and 2017, respectively, comprised of net sales of AFF Third-Party Products to independent third-party customers, as these sales do not have unit case equivalents.\n  \n\n  \n    \n      MONSTER BEVERAGE CORPORATION AND SUBSIDIARIESCONDENSED CONSOLIDATED BALANCE SHEETSAS OF DECEMBER 31, 2018 AND DECEMBER 31, 2017(In Thousands, Except Par Value) (Unaudited)\n              \n                      \n                      December 31,2018\n                      \n                      \n                      \n                      December 31,2017\n                      \n                      \n                  ASSETS\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  CURRENT ASSETS:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Cash and cash equivalents\n                      \n                      $\n                      637,513\n                      \n                      \n                      $\n                      528,622\n                      \n                  Short-term investments\n                      \n                      \n                      320,650\n                      \n                      \n                      \n                      672,933\n                      \n                  Accounts receivable, net\n                      \n                      \n                      484,562\n                      \n                      \n                      \n                      449,476\n                      \n                  Inventories\n                      \n                      \n                      277,705\n                      \n                      \n                      \n                      255,745\n                      \n                  Prepaid expenses and other current assets\n                      \n                      \n                      44,909\n                      \n                      \n                      \n                      40,877\n                      \n                  Prepaid income taxes\n                      \n                      \n                      38,831\n                      \n                      \n                      \n                      138,724\n                      \n                  Total current assets\n                      \n                      \n                      1,804,170\n                      \n                      \n                      \n                      2,086,377\n                      \n                  INVESTMENTS\n                      \n                      \n                      -\n                      \n                      \n                      \n                      2,366\n                      \n                  PROPERTY AND EQUIPMENT, net\n                      \n                      \n                      243,051\n                      \n                      \n                      \n                      230,276\n                      \n                  DEFERRED INCOME TAXES\n                      \n                      \n                      85,687\n                      \n                      \n                      \n                      92,333\n                      \n                  GOODWILL\n                      \n                      \n                      1,331,643\n                      \n                      \n                      \n                      1,331,643\n                      \n                  OTHER INTANGIBLE ASSETS, net\n                      \n                      \n                      1,045,878\n                      \n                      \n                      \n                      1,034,085\n                      \n                  OTHER ASSETS\n                      \n                      \n                      16,462\n                      \n                      \n                      \n                      13,932\n                      \n                  Total Assets\n                      \n                      $\n                      4,526,891\n                      \n                      \n                      $\n                      4,791,012\n                      \n                  LIABILITIES AND STOCKHOLDERS' EQUITY\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  CURRENT LIABILITIES:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Accounts payable\n                      \n                      $\n                      248,760\n                      \n                      \n                      $\n                      245,910\n                      \n                  Accrued liabilities\n                      \n                      \n                      112,507\n                      \n                      \n                      \n                      87,475\n                      \n                  Accrued promotional allowances\n                      \n                      \n                      145,741\n                      \n                      \n                      \n                      137,998\n                      \n                  Accrued distributor terminations\n                      \n                      \n                      -\n                      \n                      \n                      \n                      91\n                      \n                  Deferred revenue\n                      \n                      \n                      44,045\n                      \n                      \n                      \n                      43,236\n                      \n                  Accrued compensation\n                      \n                      \n                      39,903\n                      \n                      \n                      \n                      34,996\n                      \n                  Income taxes payable\n                      \n                      \n                      10,189\n                      \n                      \n                      \n                      10,645\n                      \n                  Total current liabilities\n                      \n                      \n                      601,145\n                      \n                      \n                      \n                      560,351\n                      \n                  DEFERRED REVENUE\n                      \n                      \n                      312,224\n                      \n                      \n                      \n                      334,354\n                      \n                  OTHER LIABILITIES\n                      \n                      \n                      2,621\n                      \n                      \n                      \n                      1,095\n                      \n                  STOCKHOLDERS' EQUITY:\n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                      \n                  Common stock - $0.005 par value; 1,250,000 shares authorized;630,970 shares issued and 543,676 shares outstanding as of December 31, 2018;629,255 shares issued and 566,298 shares outstanding as of December 31, 2017\n                      \n                      \n                      3,155\n                      \n                      \n                      \n                      3,146\n                      \n                  Additional paid-in-capital\n                      \n                      \n                      4,238,170\n                      \n                      \n                      \n                      4,150,628\n                      \n                  Retained earnings\n                      \n                      \n                      3,914,645\n                      \n                      \n                      \n                      2,928,226\n                      \n                  Accumulated other comprehensive loss\n                      \n                      \n                      (32,864\n                      )\n                      \n                      \n                      (16,659\n                      )\n                  Common stock in treasury, at cost; 87,294 and 62,957 shares as ofDecember 31, 2018 and December 31, 2017, respectively\n                      \n                      \n                      (4,512,205\n                      )\n                      \n                      \n                      (3,170,129\n                      )\n                  Total stockholders' equity\n                      \n                      \n                      3,610,901\n                      \n                      \n                      \n                      3,895,212\n                      \n                  Total Liabilities and Stockholders' Equity\n                      \n                      $\n                      4,526,891\n                      \n                      \n                      $\n                      4,791,012\n                      \n                  \n  \n  CONTACTS:Rodney C. SacksChairman and Chief Executive Officer(951) 739-6200Hilton H. SchlosbergVice Chairman(951) 739-6200Roger S. Pondel / Judy Lin SfetcuPondelWilkinson Inc.(310) 279-5980   \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Monster Beverage Corporation"
    },
    {
        "title": "Monster Beverage to Report 2018 Fourth Quarter and Full Year Financial Results on February 27, 2019",
        "subtitle": "",
        "date": "Feb 19, 2019 11:00AM EST",
        "content": "CORONA, Calif., Feb. 19, 2019 (GLOBE NEWSWIRE) -- Monster Beverage Corporation (NASDAQ:MNST) announced today that results for its fourth quarter and year-ended December 31, 2018 will be released on Wednesday, February 27, 2019 after the close of the market. The company also said that chairman and chief executive officer, Rodney Sacks, and vice chairman and president, Hilton Schlosberg, will host an investor conference call that same day at 2:00 p.m. Pacific Time to review the company's financial results and operations.The call will be open to all interested investors through a live audio webcast via the Internet at www.monsterbevcorp.com. For those who are not able to listen to the live broadcast, the call will be archived for approximately one year on the website.Monster Beverage CorporationBased in Corona, California, Monster Beverage Corporation is a holding company and conducts no operating business except through its consolidated subsidiaries. The Company's subsidiaries develop and market energy drinks, including Monster Energy® energy drinks, Monster Energy Ultra® energy drinks, Monster MAXX® maximum strength energy drinks, Java Monster® non-carbonated coffee + energy drinks, Espresso Monster® non-carbonated espresso + energy drinks, Caffé Monster® non-carbonated energy coffee drinks, Monster Rehab® non-carbonated energy drinks, Muscle Monster® energy shakes, Übermonster® energy drinks, Monster Hydro® energy drinks, NOS® energy drinks, Full Throttle® energy drinks, Burn® energy drinks, Samurai® energy drinks, Relentless® energy drinks, Mother® energy drinks, Power Play® energy drinks, BU® energy drinks, Nalu® energy drinks, BPM® energy drinks, Gladiator® energy drinks, Ultra Energy® energy drinks, Mutant® energy drinks and Predator® energy drinks. For more information, visit www.monsterbevcorp.com.\n  \n\n  \n    \n      CONTACTS: \n                  Rodney C. Sacks\n              \n                      \n                      Chairman and Chief Executive Officer\n                  \n                      \n                      (951) 739-6200\n                  \n                      \n                      Hilton H. Schlosberg\n                  \n                      \n                      Vice Chairman\n                  \n                      \n                      (951) 739-6200\n                  \n                      \n                      Roger S. Pondel / Judy Lin Sfetcu\n                  \n                      \n                      PondelWilkinson Inc.\n                  \n                      \n                      (310) 279-5980\n                  \n  \n     \n    \n    \n  \n\n\n\n                            \n\n  \n\n\n\n\nSource: Monster Beverage Corporation"
    }
]