[
    {
        "title": "Microsoft and the NFL expand partnership to accelerate digital transformation across the League",
        "subtitle": "",
        "date": "Mar 3, 2020 12:00PM EST",
        "content": "REDMOND, Wash., March 3, 2020 /PRNewswire/ -- Microsoft Corp. and the National Football League on Tuesday announced an expansion of their deep technology partnership. The multiyear expansion aims to help the entire NFL, including its coaches and players, be more efficient through enhanced communication and collaboration via Microsoft Surface devices and Microsoft Teams, the hub for teamwork in Office 365.\"Since 2013, Microsoft has helped transform the NFL through technology around our game,\" said Renie Anderson, chief revenue officer and executive vice president of NFL Partnerships. \"Microsoft Surface has quickly become an authentic tool to the game of football and is vital during all NFL games for coaches, players and NFL Officials. And now by working together to integrate Microsoft Teams across the League, together we aim to improve on communications and collaboration in a modern way.\"\"We're inspired to continue to help the NFL accelerate its digital transformation,\" said Yusuf Mehdi, corporate vice president, Modern Life, Search and Devices, Microsoft. \"We've worked together to innovate the way the game is played with Surface devices to power Instant Replay and in-game play review for players and coaches on the sidelines. And by combining Surface and Microsoft Teams deeper into the fast-paced workflow of the League, we have an incredible opportunity to bring together the power of hardware and software to help everyone be more productive.\" As part of the partnership expansion, Microsoft and the NFL will now work together on modern collaboration technology to further empower the League using the new Microsoft Teams platform. Designed to work seamlessly across Windows, iOS and Android devices, Microsoft Teams brings together chat, calling, meetings, files, document collaboration and workflow into a single app. Rather than use separate apps for those experiences, NFL teams and the entire organization can collaborate and stay constantly and securely connected on Microsoft Teams.Clubs across the NFL are already taking advantage of the Microsoft Teams platform. The New York Jets use Microsoft Teams to ensure key messages such as the team's draft selection are being transmitted accurately in real time. Super Bowl Champions, the Kansas City Chiefs, use Microsoft Teams to coordinate travel schedules among the club's on-the-road scouts. And the Miami Dolphins used Microsoft Teams to plan Super Bowl LIV at Hard Rock Stadium.\"The Miami Dolphins rely on Teams for all cross-functional strategic projects. In Teams we can easily collaborate on files, manage shared calendars, host meetings, and use existing integrations. Teams made cooperation with the NFL possible throughout the regular season and with Super Bowl planning,\" said Kim Rometo, vice president and chief information officer for the Miami Dolphins.Microsoft continues to deliver exceptional performance to the NFL with the Microsoft Surface Sideline Viewing System (SVS), bringing near-real-time images and game data, such as down, distance and yard line information, to the players and coaches on the sidelines and to the coaches in the coach's booth. In addition, Microsoft Surface Instant Replay (MSIR) brings mobile instant replay to the officials on the field, helping improve pace of play. With more than 2,000 Surface devices and 170 Windows Servers deployed across 35 global stadiums, Microsoft technology powers 333 events each year for the NFL on game day. Beyond the sideline integration, Microsoft works with every NFL team and their partners to develop unique business and consumer-facing integrations to deliver real-world productivity solutions. Ranging from Surface devices serving as playbooks, to film reviews being conducted on the Surface family of devices, to in-stadium usage on gamedays, to business operations teams using Surface devices in their front office, it is clear that NFL teams have embraced Microsoft as a true technology partner.Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.   View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-and-the-nfl-expand-partnership-to-accelerate-digital-transformation-across-the-league-301015552.htmlSOURCE  Microsoft Corporation"
    },
    {
        "title": "/C O R R E C T I O N -- Microsoft Corporation/",
        "subtitle": "",
        "date": "Feb 26, 2020 4:09PM EST",
        "content": "In the news release, Microsoft update on Q3 FY20 guidance, issued 26-Feb-2020 by Microsoft Corporation over PR Newswire, we are advised by the company that the first paragraph, last sentence, should read \"Microsoft also continues to make donations to relief and containment efforts, including directly providing technology to help hospitals and medical workers.\" rather than \"Microsoft also continues to make donations to relief and contamination efforts, including directly providing technology to help hospitals and medical workers.\" as originally issued inadvertently. The complete, corrected release follows:REDMOND, Wash., Feb. 26, 2020 /PRNewswire/ -- As Microsoft closely monitors the impact of the COVID-19 health emergency, our top priority remains the health and safety of our employees, customers, partners, and communities. Our global health response team is acting to help protect our employees in accordance with global health authorities' guidance. Worldwide, Microsoft employees are working to support organizations addressing the challenges on the ground. Microsoft also continues to make donations to relief and containment efforts, including directly providing technology to help hospitals and medical workers.On Jan. 29, as part of our second quarter of fiscal year 2020 earnings call, we issued quarterly revenue guidance for our More Personal Computing segment between $10.75 and $11.15 billion, which included a wider than usual range to reflect uncertainty related to the public health situation in China. Although we see strong Windows demand in line with our expectations, the supply chain is returning to normal operations at a slower pace than anticipated at the time of our Q2 earnings call. As a result, for the third quarter of fiscal year 2020, we do not expect to meet our More Personal Computing segment guidance as Windows OEM and Surface are more negatively impacted than previously anticipated. All other components of our Q3 guidance remain unchanged. As the conditions evolve, Microsoft will act to ensure the health and safety of our employees, customers, and partners during this difficult period. We will also continue to partner with local and global health authorities to provide additional assistance. We deeply appreciate the commitment of the people and organizations that have united to address this health emergency; our thoughts are with all those affected across the world.About MicrosoftMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.Forward-Looking StatementsStatements in this release are \"forward-looking statements\" based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors described above as well as: For more information about risks and uncertainties associated with Microsoft's business, please refer to the \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Risk Factors\" sections of Microsoft's SEC filings, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q, copies of which may be obtained by contacting Microsoft's Investor Relations department at (800) 285-7772 or at Microsoft's Investor Relations website at http://www.microsoft.com/en-us/investor.All information in this release is as of Feb. 26, 2020. The company undertakes no duty to update any forward-looking statement to conform the statement to actual results or changes in the company's expectations. View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-update-on-q3-fy20-guidance-301012053.htmlSOURCE  Microsoft Corporation"
    },
    {
        "title": "Open Manufacturing Platform expands: Anheuser-Busch InBev, BMW Group, Bosch, Microsoft and ZF team up to accelerate manufacturing innovation at scale",
        "subtitle": "",
        "date": "Feb 19, 2020 12:19PM EST",
        "content": "BERLIN and REDMOND, Wash., Feb. 19, 2020 /PRNewswire/ -- The Open Manufacturing Platform (OMP) has expanded, with new steering committee members and new working groups established. OMP is an alliance founded in 2019 to help manufacturing companies accelerate innovation at scale through cross-industry collaboration, knowledge and data sharing as well as access to new technologies. The OMP was founded under the umbrella of the Joint Development Foundation, which is part of the Linux Foundation. Original members The BMW Group and Microsoft welcome Anheuser-Busch InBev (AbInBev), Bosch Group and ZF Friedrichshafen AG as steering committee members. The OMP steering committee has approved a number of working groups to focus on core areas important to the industry, including IoT Connectivity, semantic data models, Industrial IoT reference architecture, and core services for ATS (autonomous transport systems).  Common approach to industry challenges The expansion of intelligent manufacturing is driving new efficiencies and increased productivity, as well as revealing new challenges. Within the industry, legacy and proprietary systems have resulted in data silos, making operationwide insight and transformation daunting. As common challenges across the industry, they often require a high degree of investment for modest returns within any one organization. The OMP has been developed to address this, where manufacturers and their value chains come together to identify and develop solutions that address these nondifferentiating problems. It brings together experts across the manufacturing sector — including discrete and process manufacturing, transportation and consumer goods, industrial equipment, and more.\"Our goal is to drive manufacturing innovation at scale, accelerate time-to-value and drive production efficiencies by jointly solving mutual challenges, based on an open community approach. The OMP helps manufacturing companies unlock the potential of their data, implement industrial solutions faster and more securely, and benefit from industrial contributions while preserving their intellectual property (IP) and competitive advantages, mitigating operational risks and reducing financial investments,\" said Jürgen Maidl, Senior Vice President Production Network and Supply Chain Management at the BMW Group.Scale innovation through common data models and open technology standardsThe OMP operates under the umbrella of the Joint Development Foundation (JDF). The JDF is part of the Linux Foundation and provides the OMP with infrastructure and an organizational framework to create technical specifications and support open industry standards. The OMP supports other alliances, including the OPC Foundation and Plattform Industrie 4.0, and leverages existing industry standards, open source reference architectures and common data models.\"Through the open collaboration approach that is the cornerstone of OMP, manufacturing companies will be able to bring offerings to market faster, with increased scale and greater efficiency,\" said Scott Guthrie, Executive Vice President Cloud & AI at Microsoft. \"Solutions will be published and shared across the community, regardless of technology, solution provider or cloud platform.\"The heart of OMP: working groups to address common manufacturing challenges \"Comprised of members from across the manufacturing industry, the collaboration framework and heart of the OMP are its working groups. We are very excited to join in a moment where our manufacturing facilities are becoming increasingly connected, and we are looking for innovative ways to make use of the treasure trove of data that is being generated,\" said Tassilo Festetics, Global Vice President of Solutions at AB InBev. The OMP initial first working groups will focus on topics such as IoT Connectivity, Semantic Data Model, IIoT Reference Architecture and Core Services for ATS (autonomous transport systems). Initial focus areas include: IoT Connectivity: The OMP steering committee will support industry efforts to connect IoT devices and machines to the cloud. It is one of the first steps to digitize production lines and leverage cloud-connected Industrial IoT applications. \"Today, it is all about analytics and predictions but without data no analytics and without connectivity no data. Modern devices can easily be connected via the OPC Unified Architecture (OPC UA). Connecting machines and applications to the cloud that have been in production for decades comes with bigger interoperability challenges as various standards and interfaces must be addressed to interconnect these historically developed legacy systems ('brownfield approach'). The working group IoT Connectivity will focus on providing industrial-grade edge and cloud functionalities for the integration and management of OPC UA devices in brownfield environments,\" said Werner Balandat, Head of Production Management, ZF Friedrichshafen AG. Semantic Data Model: Another OMP working group focuses on semantic data modelling: Machine and manufacturing data are crucial for industrial companies to optimize production with artificial intelligence (AI). However, managing data in a common format across multiple sources with constantly evolving semantics is a real challenge. \"Data is the raw material for Industry 4.0 and a prerequisite for optimizing production with the help of artificial intelligence. At OMP, we are developing a semantic model that makes data understandable and illustrates its relations and dependencies. Users no longer receive cryptic, incomprehensible numbers and characters, but production-relevant information including their context. This semantic data structure ensures improvements along the entire value chain and makes AI-based business models possible on a large scale,\" said Dr.-Ing. Michael Bolle, Member of the Board of Management, Robert Bosch GmbH. OMP will continue to expand as new organizations come on board. The steering committee encourages manufacturers and suppliers of all types to join the community. About Open Manufacturing Platform (OMP):OMP is a non-profit alliance to help manufacturing companies accelerate innovation at scale through cross-industry collaboration, knowledge and data sharing as well as access to new technologies. The OMP has been founded under the umbrella of the Joint Development Foundation. The OMP helps businesses unlock the potential of their data and integrate industrial solutions faster and more securely while owning their intellectual property, mitigating operational risks and reducing financial investments by leveraging industry standards, open source reference architectures, common data models, and more. About the BMW GroupWith its four brands BMW, MINI, Rolls-Royce and BMW Motorrad, the BMW Group is the world's leading premium manufacturer of automobiles and motorcycles and also provides premium financial and mobility services. The BMW Group production network comprises 31 production and assembly facilities in 15 countries; the company has a global sales network in more than 140 countries. In 2019, the BMW Group sold over 2,520,000 passenger vehicles and more than 175,000 motorcycles worldwide. The profit before tax in the financial year 2018 was € 9.815 billion on revenues amounting to € 97.480 billion. As of 31 December 2018, the BMW Group had a workforce of 134,682 employees. The success of the BMW Group has always been based on long-term thinking and responsible action. The company has therefore established ecological and social sustainability throughout the value chain, comprehensive product responsibility and a clear commitment to conserving resources as an integral part of its strategy. www.bmwgroup.comAbout BoschThe Bosch Group is a leading global supplier of technology and services. It employs roughly 403,000 associates worldwide (as of December 31, 2019). According to preliminary figures, the company generated sales of 77.9 billion euros in 2019. Its operations are divided into four business sectors: Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. As a leading IoT company, Bosch offers innovative solutions for smart homes, smart cities, connected mobility, and connected manufacturing. It uses its expertise in sensor technology, software, and services, as well as its own IoT cloud, to offer its customers connected, cross-domain solutions from a single source. The Bosch Group's strategic objective is to deliver innovations for a connected life. Bosch improves quality of life worldwide with products and services that are innovative and spark enthusiasm. In short, Bosch creates technology that is \"Invented for life.\" The Bosch Group comprises Robert Bosch GmbH and its roughly 440 subsidiary and regional companies in 60 countries. Including sales and service partners, Bosch's global manufacturing, engineering, and sales network covers nearly every country in the world. The basis for the company's future growth is its innovative strength. At 125 locations across the globe, Bosch employs some 72,000 associates in research and development. The company was set up in Stuttgart in 1886 by Robert Bosch (1861–1942) as \"Workshop for Precision Mechanics and Electrical Engineering.\" The special ownership structure of Robert Bosch GmbH guarantees the entrepreneurial freedom of the Bosch Group, making it possible for the company to plan over the long term and to undertake significant upfront investments in the safeguarding of its future. Ninety-two percent of the share capital of Robert Bosch GmbH is held by Robert Bosch Stiftung GmbH, a charitable foundation. The majority of voting rights are held by Robert Bosch Industrietreuhand KG, an industrial trust. The entrepreneurial ownership functions are carried out by the trust. The remaining shares are held by the Bosch family and by Robert Bosch GmbH. Additional information is available online at www.bosch.com, www.iot.bosch.com, www.bosch-press.com, www.twitter.com/BoschPresse.About MicrosoftMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.ZF Friedrichshafen AG ZF is a global technology company and supplies systems for passenger cars, commercial vehicles and industrial technology, enabling the next generation of mobility. With its comprehensive technology portfolio, the company offers integrated solutions for established vehicle manufacturers, mobility providers and start-up companies in the fields of transportation and mobility. ZF continually enhances its systems in the areas of digital connectivity and automation in order to allow vehicles to see, think and act. In 2018, ZF achieved sales of €36.9 billion. The company has a global workforce of 149,000 with approximately 230 locations in 40 countries. ZF invests over six percent of its sales in research and development annually. For further press information and photos please visit: www.zf.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/open-manufacturing-platform-expands-anheuser-busch-inbev-bmw-group-bosch-microsoft-and-zf-team-up-to-accelerate-manufacturing-innovation-at-scale-301007682.htmlSOURCE  Microsoft Corporation"
    },
    {
        "title": "Microsoft earnings press release available on Investor Relations website",
        "subtitle": "",
        "date": "Jan 29, 2020 4:20PM EST",
        "content": "REDMOND, Wash., Jan. 29, 2020 /PRNewswire/ -- Microsoft Corp. on Wednesday announced that fiscal year 2020 second-quarter financial results are available on its Investor Relations website.The direct link to the earnings press release is https://www.microsoft.com/en-us/Investor/earnings/FY-2020-Q2/press-release-webcast.As previously announced, the company will host a conference call at 2:30 p.m. Pacific Time. A live webcast of the call can be accessed on Microsoft's Investor Relations website at https://www.microsoft.com/en-us/Investor/.   Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more. View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-earnings-press-release-available-on-investor-relations-website-300995637.htmlSOURCE  Microsoft Corporation"
    },
    {
        "title": "/C O R R E C T I O N -- Microsoft Corporation/",
        "subtitle": "",
        "date": "Jan 29, 2020 12:30PM EST",
        "content": "In the news release, Microsoft launches new AI for Good program, AI for Health, to accelerate global health initiatives, issued 29-Jan-2020 by Microsoft Corporation over PR Newswire, the AI for Health Link has been replaced in the 13th paragraph. The complete, corrected release follows:REDMOND, Wash., Jan. 29, 2020 /PRNewswire/ -- On Wednesday, Microsoft Corp. announced AI for Health, a new $40 million, five-year program and part of the AI for Good initiative, that will leverage artificial intelligence (AI) technology to empower researchers and organizations addressing some of the world's toughest challenges in health.\"Artificial intelligence has the potential to solve some of humanity's greatest challenges, like improving the health of communities around the world,\" said Brad Smith, president, Microsoft. \"We know that putting this powerful technology into the hands of experts tackling this problem can accelerate new solutions and improve access for underserved populations. That's why we created AI for Health.\" In a new era of tech intensity, in which technology is reshaping every organization and becoming embedded in the fabric of every aspect of our lives, digital advances will continue to reshape our world in profound ways. AI represents one of technology's most important priorities, and healthcare is perhaps AI's most urgent application. However, the talent and resources required to equip health researchers with tools to deploy AI and data science is unevenly distributed. Less than 5% of the world's AI professionals today work in health and nonprofit organizations. It is crucial to provide these mission-driven researchers with the tools they need to accelerate and expand their work.Through AI for Health, Microsoft will work to ensure that nonprofits, academia and research organizations have access to the latest technology, resources and technical experts to help implement AI to accelerate research, generate insights and improve access to care. The AI for Health initiative will focus on three key areas:Microsoft's efforts will build on existing collaborations with organizations to help solve pressing issues, like discovering the cause of Sudden Infant Death Syndrome (SIDS), eliminating leprosy, detecting diabetic retinopathy to prevent blindness, and building an ecosystem that allows safe and secure sharing of biomedical data. We are honored to announce several grantees, including BRAC, Fred Hutchinson Cancer Research Center, Intelligent Retinal Imaging Systems (IRIS), Novartis Foundation, PATH, and Seattle Children's Research Institute.\"Countries like Bangladesh, where BRAC was founded, have made enormous strides in health equity in the last three decades. Unfortunately, at least half the world's population still lacks access to essential health services,\" said Asif Saleh, executive director, BRAC. \"Across our outreach areas in Asia and Africa, we see massive potential in using advanced data analytics and AI to bridge the gap between 'health for some' and 'health for all,' and we welcome Microsoft's commitment in making this happen.\"\"Unlocking and sharing data is critical to discovering new ways to treat and ultimately cure cancer,\" said Dr. Raphael Gottardo, scientific director, Translational Data Science Integrated Research Center, Fred Hutch. \"Working in close collaboration with Microsoft, we will be able to harness new advances in AI, machine learning and cloud computing to spur innovation and open up new avenues for preventing and treating cancer and related diseases.\"\"Diabetes is the leading cause of adult-onset blindness in the U.S.; however, 95% of vision loss is preventable due to modern therapies such as the diabetic retinal exam (DRE),\" said Dr. Sunil Gupta, founder and chief medical officer, Intelligent Retinal Imaging Systems (IRIS). \"We can make a huge impact on people's lives through the early detection of sight-threatening disease, and advanced technologies can accelerate these efforts,\" said Steve Martin, CEO of IRIS. \"Through the use of AI, we can scale our diagnostic software to reach underserved communities and help end preventable blindness.\"\"Leprosy is one of the oldest diseases known to humans, but today an estimated 2 to 3 million people are still living with the disease,\" said Dr. Ann Aerts, head, Novartis Foundation. \"Around the world, we are working to accelerate efforts to eliminate leprosy by focusing on interventions that aim to interrupt transmission. The use of AI is transformative and a game changer in how we can accelerate progress and scale our work to reach the people in need.\"\"At PATH we're focused on using innovation to remove barriers so that everyone can receive the healthcare they need to thrive. Along with Microsoft, we believe there is tremendous power in using AI to help us see all communities, identify the diseases that affect them, and ultimately improve the way they deliver care. Only when every community has the opportunity to transform their health can all of humanity advance,\" said Jeff Bernson, MPA, MPH, chief data officer, vice president, Technology, Analytics, and Marketing Innovation, PATH. \"Recent collaborations with the Microsoft data science team have already showcased how AI can bring a deeper quality of research by helping us uncover important answers about breathing disorders and causes of infant mortality like sudden infant death syndrome (SIDS),\" said Dr. Nino Ramirez, director of the Center for Integrative Brain Research at Seattle Children's Research Institute. \"We are excited by the opportunity to continue our work together, combining our shared talents with cutting-edge computing tools that have the power to transform our field and ultimately save lives.\"The new program is part of Microsoft's broader AI for Good initiative, a $165 million commitment to empower people and organizations working to create a positive impact on society that address the world's toughest issues. The initiative includes AI for Accessibility, AI for Cultural Heritage, AI for Earth, AI for Health and AI for Humanitarian Action. More information on the AI for Health program can be found at Microsoft On the Issues, https://blogs.microsoft.com/on-the-issues/2020/01/29/ai-for-health-child-mortality/. More information about AI for Good can be found at https://www.microsoft.com/aiforgood.Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.  View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-launches-new-ai-for-good-program-ai-for-health-to-accelerate-global-health-initiatives-300995143.htmlSOURCE  Microsoft Corporation"
    },
    {
        "title": "Microsoft and Genesys expand partnership to help enterprises seize the power of the cloud for better customer experiences",
        "subtitle": "",
        "date": "Jan 23, 2020 9:00AM EST",
        "content": "REDMOND, Wash. and SAN FRANCISCO, Jan. 23, 2020 /PRNewswire/ -- Microsoft Corp. and Genesys have expanded their partnership to provide enterprises with a new cloud service for contact centers that enables them to deliver superior interactions for customers. With the omnichannel customer experience solution Genesys Engage™ running on Microsoft Azure, enterprises have the security and scalability they need to manage the complexities involved with connecting every touchpoint throughout the customer journey. Genesys Engage on Microsoft Azure will be available in late 2020. To accelerate adoption, the companies are providing Genesys Engage on Microsoft Azure through a joint co-selling and go-to-market strategy. Customers will benefit from a streamlined buying process that puts them on a clear path to the cloud. The power of Genesys Engage on Microsoft AzureWith its multitenant architecture, Genesys Engage on Microsoft Azure gives customers the ability to innovate faster and improve their business agility. In addition, by running the Genesys customer experience solution on this dependable cloud environment, enterprises will be able to maximize their investment in Microsoft Azure through simplified management and maintenance requirements, centralized IT expertise, reduced costs, and more. These solutions make it easier for enterprises to leverage cloud and artificial intelligence (AI) technologies so they can gain deeper insights and provide tailor-made experiences for their customers.Nemo Verbist, senior vice president of Intelligent Business and Intelligent Workplace at NTT Ltd., one of the top five global technology and services providers for the world's largest enterprises and a partner of both Microsoft and Genesys, sees great value in the partnership. Verbist said, \"Many of our customers have standardized on Microsoft solutions, and Genesys Engage on Microsoft Azure gives them an additional opportunity to take advantage of their investment. Together, these solutions provide enterprises a secure and powerful foundation to communicate with their customers in creative and meaningful ways.\"\"Large contact centers receive an exceptionally high volume of inquiries across a growing list of channels and platforms. One of the biggest challenges is connecting the details of every interaction across all channels to ensure each customer has a seamless experience,\" said Kate Johnson, president, Microsoft U.S. \"By leveraging Microsoft's Azure cloud and AI technologies, Genesys is helping enterprises create a seamless customer journey with Microsoft's trusted, secure and scalable platform.\" \"We are thrilled to give large enterprises the opportunity to run their mission-critical customer experience platform in the cloud environment they already know and trust — Microsoft Azure,\" said Peter Graf, chief strategy officer of Genesys. \"Together, we're making it simpler for even the most complex organizations to transition to the cloud, enabling them to unlock efficiencies and accelerate innovation so they can build deeper connections with customers.\" The companies are also exploring and developing new integrations for Genesys and Microsoft Teams, Microsoft Dynamics 365 and Azure Cognitive Services to streamline collaboration and communications for employees and customers. More information will be released about these upcoming integrations later this year.Register for the upcoming webinar, Genesys Engage + Microsoft Azure: Transform Your Customer Experience in the Cloud, to learn more on March 4.About GenesysEvery year, Genesys® delivers more than 70 billion remarkable customer experiences for organizations in over 100 countries. Through the power of the cloud and AI, our technology connects every customer moment across marketing, sales and service on any channel, while also improving employee experiences. Genesys pioneered Experience as a ServiceSM so organizations of any size can provide true personalization at scale, interact with empathy, and foster customer trust and loyalty. This is enabled by Genesys CloudTM, an all-in-one solution and the world's leading public cloud contact center platform, designed for rapid innovation, scalability and flexibility. Visit www.genesys.com.  About MicrosoftMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.©2020 Genesys Telecommunications Laboratories, Inc. All rights reserved. Genesys and the Genesys logo are trademarks and/or registered trademarks of Genesys. All other company names and logos may be registered trademarks or trademarks of their respective companies.  View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-and-genesys-expand-partnership-to-help-enterprises-seize-the-power-of-the-cloud-for-better-customer-experiences-300992001.htmlSOURCE  Microsoft Corporation"
    },
    {
        "title": "Microsoft announces it will be carbon negative by 2030",
        "subtitle": "",
        "date": "Jan 16, 2020 12:30PM EST",
        "content": "REDMOND, Wash., Jan. 16, 2020 /PRNewswire/ -- Microsoft Corp. on Thursday announced an ambitious goal and a new plan to reduce and ultimately remove its carbon footprint. By 2030 Microsoft will be carbon negative, and by 2050 Microsoft will remove from the environment all the carbon the company has emitted either directly or by electrical consumption since it was founded in 1975.At an event at its Redmond campus, Microsoft Chief Executive Officer Satya Nadella, President Brad Smith, Chief Financial Officer Amy Hood, and Chief Environmental Officer Lucas Joppa announced the company's new goals and a detailed plan to become carbon negative. \"While the world will need to reach net zero, those of us who can afford to move faster and go further should do so. That's why today we are announcing an ambitious goal and a new plan to reduce and ultimately remove Microsoft's carbon footprint,\" said Microsoft President Brad Smith. \"By 2030 Microsoft will be carbon negative, and by 2050 Microsoft will remove from the environment all the carbon the company has emitted either directly or by electrical consumption since it was founded in 1975.\"The Official Microsoft Blog has more information about the company's bold goal and detailed plan to remove its carbon footprint: https://blogs.microsoft.com/?p=52558785. The company announced an aggressive program to cut carbon emissions by more than half by 2030, both for our direct emissions and for our entire supply and value chain. This includes driving down our own direct emissions and emissions related to the energy we use to near zero by the middle of this decade. It also announced a new initiative to use Microsoft technology to help our suppliers and customers around the world reduce their own carbon footprints and a new $1 billion climate innovation fund to accelerate the global development of carbon reduction, capture and removal technologies. Beginning next year, the company will also make carbon reduction an explicit aspect of our procurement processes for our supply chain. A new annual Environmental Sustainability Report will detail Microsoft's carbon impact and reduction journey. And lastly, the company will use its voice and advocacy to support public policy that will accelerate carbon reduction and removal opportunities. More information can be found at the Microsoft microsite: https://news.microsoft.com/climate.Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.   View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-announces-it-will-be-carbon-negative-by-2030-300988068.htmlSOURCE  Microsoft Corp."
    },
    {
        "title": "Microsoft announces quarterly earnings release date",
        "subtitle": "",
        "date": "Jan 15, 2020 4:05PM EST",
        "content": "REDMOND, Wash., Jan. 15, 2020 /PRNewswire/ -- Microsoft Corp. will publish fiscal year 2020 second-quarter financial results after the close of the market on Wednesday, Jan. 29, 2020, on the Microsoft Investor Relations website at https://www.microsoft.com/en-us/Investor/. A live webcast of the earnings conference call will be made available at 2:30 p.m. Pacific Time.Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.  View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-announces-quarterly-earnings-release-date-300987084.htmlSOURCE  Microsoft Corp."
    },
    {
        "title": "Thinking about buying stock in Bilibili, Microsoft, Nio, Nektar Therapeutics, or NVIDIA?",
        "subtitle": "",
        "date": "Jan 13, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 13, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BILI, MSFT, NIO, NKTR, and NVDA.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-bilibili-microsoft-nio-nektar-therapeutics-or-nvidia-300985632.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Asia-Pacific Retailers Buy into Intelligent Future but Yet to Realize AI's Full Potential",
        "subtitle": "",
        "date": "Jan 12, 2020 8:00PM EST",
        "content": "SINGAPORE, Jan. 13, 2020 /PRNewswire/ -- Trakomatic, an award-winning Singapore-based video and sensor technology start-up, is investing in AI solutions from Microsoft Asia to deliver intelligent retail experiences. With consumers increasingly demanding seamless online-offline shopping solutions and sustainable business practices, these organizations are selecting Microsoft Azure as the platform of choice to transform inventory management and turn fragmented data into actionable insights. Together with companies like Coles, Harvey Norman and EZR, Trakomatic is using AI to become a leader in its field. According to the latest findings from Microsoft Asia and IDC Asia/Pacific's Future Ready Business: Assessing Asia-Pacific's Retail Sector with AI[1] study, retail organizations that have adopted AI are already seeing improvements of 16 to 19 percent in customer engagement, business intelligence, profit margins, competitiveness and innovation. By 2021, retail organizations in the region expect AI to drive a further improvement of between 37 to 44 percent in these areas.\"Upended by a US$1.5 trillion e-commerce market, retailers in the region must quickly adapt to savvy, connected consumers that generate a trail of digital and omnichannel footprints that can be analyzed,\" said Raj Raguneethan, Regional Business Lead, Retail and Consumer Goods, Microsoft Asia. \"These footprints are generated from consumers combining channels like mobile, app, in-store and desktop throughout the purchasing process.\"\"To stay competitive, a shift to intelligent retail is required to add ease, convenience, customization and automation -- across business processes and operations, customer experiences, and the very products and services offered,\" said Raguneethan. \"This can be done by turning to cloud and AI tools as the underlying, connective tissue for digitization and business transformation.\"Integrating Omnichannel Data to 'Know Your Customer' and Reimagine Retail ExperiencesWith AI and facial recognition technologies built on Microsoft Azure, Trakomatic offers retailers a \"customer service ecosystem\" solution that is integrated with their customer loyalty programs. These solutions have been accredited by the SG:D program – which is part of the Singapore government's Digital Economy growth strategy.Trakomatic's AI technology recognizes a VIP once they enter the mall if they have opted in to the program by signing up for the service and proactively providing an image. It then sends them a personalized message like an SMS recommending a pair of trainers if they are a sports enthusiast, for example, and directs them to the store. Along the way, the mall's digital signage knows when the VIP is near and changes its content to reinforce the sent SMS. When the VIP arrives at the store, the system alerts the service staff via their devices, who can then engage the customer and offer a personalized experience -- or additional discounts.Trakomatic's shopper engagement module was introduced at the Lenovo Flagship Store to address these demands, enabling the on-ground team to recognize, anticipate and serve customers proactively with data and insights.\"Delivering great customer service is never easy for any brick and mortar store, as customers now increasingly demand nothing less than seamless shopper experiences across traditional and digital touch points. Ultimately, this helps staff make more informed business decisions,\" shared Constantia Ang, Sales Director, AddOn, a Lenovo distributor in Singapore.Besides enhancing the customer experience, Trakomatic's tools help retailers measure and improve the effectiveness of marketing campaigns, track sales conversion rates, and discover shoppers' average basket size, as well as forecast which days and locations are likely to experience heavy traffic.\"Even as e-commerce is growing, consumers still want to touch and feel products. Merchants are therefore looking to marry the physical and digital to reduce their stores' footprint, engage omnichannel consumers and grow their sales at the same time,\" said Shaun Kwan, Co-founder and COO, Trakomatic. \"Through the years, we have developed technology to securely collect and anonymize shopper data streams and have partnered with Microsoft to bring to life capabilities that are integrating digital and offline retail experiences.\"Double Down on Building Capabilities and Infrastructure to Maximize AI's PotentialWhile the infusion of AI is proving to be a winning strategy for the likes of Trakomatic, the following findings from Microsoft Asia and IDC Asia/Pacific also reveal that more needs to be done for the region's retail sector to maximize AI's potential:EZR is another example of a retail player that has transformed its capabilities and infrastructure to enable AI. As China's next-generation customer relationship management (CRM) platform, EZR is integrating fragmented information on brands and customers onto its unified commerce platform. Powered by Microsoft Azure Machine Learning Service and Microsoft Dynamics 365, EZR allows retailers to understand customers' digital behavior and deliver tailored interactions in-store and on social channels to shape purchase decision journeys.\"Retail is in the process of being reimagined in the Asia-Pacific region. Through the research commissioned with Microsoft, we are seeing how, across sectors, the convergence of the physical and digital worlds brings the opportunity for data to be responsibly and intelligently utilized with AI. The retail sector continues to show promise in the new year, and enabling investments in AI-enabling capabilities and infrastructure will be necessary for retailers to unlock the full potential of their operations and employees – and ultimately, future-proof their businesses,\" said Victor Lim, Vice President, Consulting Operations, IDC Asia/Pacific. To learn about how AI can make a difference in retail organizations, please visit:To view the appendix, please click here. About Microsoft: Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.Additional Quotes from Customers\"As a proudly Australian retailer for the past 105 years, Coles has constantly evolved to meet the needs of our customers -- from a single general merchandise store in Melbourne to the first supermarkets and now same-day delivery to customers' kitchen benchtops. Our long-standing relationship with Microsoft will enable the Smarter Selling pillar of our strategy through efficiency and pace of change,\" said Roger Sniezek, Chief Information and Digital Officer, Coles.\"Customers must be able to make decisions holistically, especially in a digitally-connected world. This has always guided how we curate our assortment of offerings, and it now shapes how we look at connecting online and offline channels seamlessly for our customers. Synchronized Shopping is a major step in the right direction to help all of us live this 'connected' life,\" said Katie Page, CEO, Harvey Norman.\"China's e-commerce industry is huge and for retail players, their customer data can be spread out across various fragmented sources, platforms, websites, online and offline,\" said Jie Min, CEO, EZR. \"We are working closely with Microsoft to enable retailers to marry the sources, analyze user profiles, provide sales forecasts and present predictions in a visually appealing way on Power BI that is helping managers make important decisions.\" Photo - https://photos.prnasia.com/prnh/20191217/2673717-1 Logo - https://photos.prnasia.com/prnh/20191217/2673717-1LOGO SOURCE  Microsoft"
    },
    {
        "title": "Thinking about trading options or stock in Boeing, Beyond Meat, Lockheed Martin, Lowe's, or Microsoft?",
        "subtitle": "",
        "date": "Jan 8, 2020 10:16AM EST",
        "content": "NEW YORK, Jan. 8, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, BYND, LMT, LOW, and MSFT.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-boeing-beyond-meat-lockheed-martin-lowes-or-microsoft-300983584.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Amazon.com, Boeing, Mastercard, Microsoft, or Verizon?",
        "subtitle": "",
        "date": "Jan 2, 2020 9:31AM EST",
        "content": " NEW YORK, Jan. 2, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMZN, BA, MA, MSFT, and VZ.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amazoncom-boeing-mastercard-microsoft-or-verizon-300980448.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "KPMG expects to invest US$5 billion in digital strategy and expand Microsoft alliance to accelerate professional services transformation",
        "subtitle": "",
        "date": "Dec 5, 2019 6:00AM EST",
        "content": "New innovations built on Microsoft cloud and AI technologies help clients achieve greater accuracy and decision-making capabilities, increased productivity, and cost efficiencies.AMSTELVEEN, Netherlands and REDMOND, WA, Dec. 5, 2019 /PRNewswire/ - KPMG and Microsoft Corp. are strengthening their global relationship through a five-year agreement to accelerate digital transformation for KPMG member firms and mutual clients. As part of its announcement to significantly invest in technology, people and innovation, KPMG is modernizing its workplace using the Microsoft 365 suite of cloud-based collaboration and productivity tools, including Microsoft Teams. KPMG is also utilizing Microsoft Azure and Azure AI as the backbone for a new common, global cloud-based platform. The platform will strengthen KPMG's range of digital offerings with new innovations in cloud-based audit capabilities, tax solutions and risk management. Clients in all sectors, including those in highly regulated industries, benefit from globally consistent and continuous service delivery that enables greater speed of deployment while adhering to industry-leading compliance and security standards.\"Together with KPMG, we're accelerating digital transformation across industries by bringing the latest advances in cloud, AI and security to highly regulated workloads in tax, audit and advisory,\" said Satya Nadella, CEO, Microsoft. \"KPMG's deep industry and process expertise, combined with the power of our trusted cloud — spanning Azure, Dynamics 365 and Microsoft 365 — will bring the best of both organizations together to help customers around the world become more agile in an increasingly complex business environment.\" New business-critical solutions As organizations expand to new geographies, develop new products and recruit new talent, processes can become increasingly complex and harder to scale. Market forces, such as evolving data protection laws, currency fluctuations and geopolitical tensions, increase the complexity and require a greater responsiveness for systems and tools.The strong portfolio of KPMG and Microsoft alliance offerings can help address these challenges more quickly by building applications on demand, automating manual processes, and continuously analyzing information to minimize the risk of errors and increase the ability to make smart decisions.\"Our alliance with Microsoft has become a critical component in helping us deliver industry-leading solutions and services to clients. Our significant multiyear investment continues to empower our people to work more efficiently and collaboratively while maximizing the power of a workforce that blends people and technology,\" said Bill Thomas, Global Chairman, KPMG International. \"By harnessing Microsoft's intelligent and trusted cloud, we aim to help clients be at the forefront of change and better prepared for a digital-first future.\"Combining industry expertise with advanced technology Through a jointly funded incubator, KPMG and Microsoft are co-developing a robust portfolio of solutions and managed services in the areas of cloud business transformation, intelligent business applications and smart workplace solutions.For example, KPMG in the U.S. and Microsoft are working together to bring the power of Azure to the healthcare and life sciences industries. This collaboration is enabling organizations within this highly regulated sector to maximize their clinical, operational and financial performance with an easily scalable solution that helps improve deployment speed, accelerate ROI and increase data-driven insights.In addition, KPMG in the Netherlands has developed risk management, compliance and internal audit solutions that leverage discovery tools to enable the digitization of risk and compliance processes across domains such as finance, legal and IT. Designed by KPMG and built on Microsoft Azure, the solutions provide seamless and cost-efficient policy and controls automation, putting smart analytics directly in the hands of business and IT operators so they can make timely, corrective actions when deviations occur.Smart audit platformKPMG, with the launch of its smart audit platform KPMG Clara in 2017, became the first of the Big Four to take its audit workflow to the cloud. Based on Microsoft Azure, KPMG Clara is an automated, agile, intelligent and scalable platform that allows KPMG professionals to work smarter, bringing powerful data and analytics capabilities into one interface, while allowing clients to interact on a real-time basis with the audit process. By enriching the audit mandate with AI, KPMG enables its professionals to make decisions based on real-time data. This further reinforces KPMG's commitment to maintaining and enhancing audit quality and building a future where technology continually enriches the audit through the introduction of new digital advancements.KPMG Clara will integrate with Microsoft Teams, providing a platform for audit professionals to centrally manage and securely share audit files, track audit-related activities, and communicate using chat, voice and video meetings. This helps simplify the auditors' workflow, enabling them to stay in sync throughout the entire process and drive continuous communication with the client.Empowering workforce transformation Through its common, global cloud platform, KPMG will create a set of cloud-based capabilities ranging from hosting infrastructure based on Microsoft Azure to more than 50 advanced solutions, such as AI, cyber and robotic process automation (RPA). KPMG will further empower its global workforce of over 207,000 employees across 153 countries with Microsoft 365, including Teams, to better meet the needs of clients through increased collaboration, improved productivity and data-driven insights. In addition, more than 30,000 KPMG professionals across 17 member firms have been equipped with Dynamics 365, a suite of powerful customer relationship applications.About KPMG International KPMG is a global network of professional services firms providing Audit, Tax and Advisory services. We operate in 153 countries and territories and have 207,000 people working in member firms around the world. The independent member firms of the KPMG network are affiliated with KPMG International Cooperative (\"KPMG International\"), a Swiss entity. Each KPMG firm is a legally distinct and separate entity and describes itself as such. About MicrosoftMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.Note to editors: For more information, news and perspectives from Microsoft, please visit the Microsoft News Center at http://news.microsoft.com. Web links, telephone numbers and titles were correct at time of publication but may have changed. For additional assistance, journalists and analysts may contact Microsoft's Rapid Response Team or other appropriate contacts listed at http://news.microsoft.com/microsoft-public-relations-contacts.  View original content:http://www.prnewswire.com/news-releases/kpmg-expects-to-invest-us5-billion-in-digital-strategy-and-expand-microsoft-alliance-to-accelerate-professional-services-transformation-300969609.htmlSOURCE  KPMG International"
    },
    {
        "title": "Microsoft announces quarterly dividend",
        "subtitle": "",
        "date": "Dec 4, 2019 4:05PM EST",
        "content": "REDMOND, Wash., Dec. 4, 2019 /PRNewswire/ -- Microsoft Corp. on Wednesday announced that its board of directors declared a quarterly dividend of $0.51 per share. The dividend is payable March 12, 2020, to shareholders of record on Feb. 20, 2020. The ex-dividend date will be Feb. 19, 2020.Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.  View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-announces-quarterly-dividend-300969457.htmlSOURCE  Microsoft Corp."
    },
    {
        "title": "Microsoft holds annual shareholders meeting",
        "subtitle": "",
        "date": "Dec 4, 2019 12:52PM EST",
        "content": "REDMOND, Wash., Dec. 4, 2019 /PRNewswire/ -- Speaking to shareholders at Microsoft Corp.'s annual meeting on Wednesday, Chief Executive Officer Satya Nadella outlined Microsoft's opportunity and responsibility: to help its customers and partners thrive in a world where every company is a technology company and to create technology that benefits everyone on the planet, including the planet itself. \"I am proud of how we are helping organizations across industries innovate and thrive using our platforms and tools,\" Nadella said. \"Every day, we work alongside our customers to help them build their own digital capability — innovating with them, creating new businesses with them, and earning their trust.\"Executive Vice President and Chief Financial Officer, Amy Hood, reported that Microsoft executed well in fiscal year 2019 and reported a strong start to the current fiscal year. Hood noted that Microsoft's innovation road map and ability to capture expanding market opportunities position the company well for continued growth and to deliver shareholder value. The following proposals were acted on by the company's shareholders at the meeting: Microsoft's board of directors consists of John W. Thompson, Microsoft independent board chair; William H. Gates III, Microsoft co-founder and technology advisor; Reid G. Hoffman, partner at Greylock Partners; Hugh F. Johnston, vice chairman and chief financial officer of PepsiCo; Teri L. List-Stoll, executive vice president and chief financial officer of Gap Inc.; Satya Nadella, chief executive officer of Microsoft; Sandra E. Peterson, operating partner at Clayton, Dubilier & Rice; Penny S. Pritzker, founder and chairman of PSP Partners; Charles W. Scharf, president and chief executive officer of Wells Fargo & Company; Arne M. Sorenson, president and CEO of Marriott International Inc.; John W. Stanton, chairman of Trilogy Partnerships;  Emma N. Walmsley, chief executive officer of GlaxoSmithKline; and Padmasree Warrior, founder, president and CEO, Fable Group Inc.Microsoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.  View original content to download multimedia:http://www.prnewswire.com/news-releases/microsoft-holds-annual-shareholders-meeting-300969320.htmlSOURCE  Microsoft Corp."
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Ford, Fitbit, General Electric, or Microsoft?",
        "subtitle": "",
        "date": "Dec 4, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 4, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, F, FIT, GE, and MSFT.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-ford-fitbit-general-electric-or-microsoft-300969159.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Alibaba, Bank of America, Microsoft, Roku, or UnitedHealth Group?",
        "subtitle": "",
        "date": "Dec 2, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 2, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, BAC, MSFT, ROKU, and UNH.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alibaba-bank-of-america-microsoft-roku-or-unitedhealth-group-300967359.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "AT&T Integrating 5G with Microsoft Cloud to Enable Next-Generation Solutions on the Edge",
        "subtitle": "",
        "date": "Nov 26, 2019 9:00AM EST",
        "content": " DALLAS and REDMOND, Wash., Nov. 26, 2019 /PRNewswire/ -- Microsoft and AT&T are ramping up innovation in the early days of their strategic alliance announced in July. One area of focus is aimed at enabling new 5G, cloud and edge computing solutions to drive enterprise capabilities for companies around the world. The companies are opening select preview availability for Network Edge Compute (NEC) technology, which weaves Microsoft Azure cloud services into AT&T network edge locations closer to customers. This means AT&T's software-defined and virtualized 5G core – what the company calls the Network Cloud – is now capable of delivering Azure services. NEC will initially be available for a limited set of select customers in Dallas. Next year, Los Angeles and Atlanta are targeted for select customer availability. From making the world's first 5G millimeter wave browsing session on a commercial 5G device to groundbreaking commercial installations in healthcare, manufacturing and entertainment, AT&T has proved itself to be a leader in 5G. The company recently activated an industry-first 400-gigabit connection between Dallas and Atlanta to support video, gaming and other 5G needs. AT&T serves parts of 21 cities with its 5G network using millimeter wave spectrum (5G+) and plans to offer nationwide 5G in the first half of 2020.\"The first smartphones on 3G networks introduced the idea of mobile apps over a decade ago. A few years later, 4G LTE made it feasible to connect those devices faster to cloud applications to stream videos, hail rides, and broadcast content to the world,\" said Mo Katibeh, EVP and chief marketing officer, AT&T Business. \"With our 5G and edge computing, AT&T is collaborating uniquely with Microsoft to marry their cloud capabilities with our network to create lower latency between the device and the cloud that will unlock new, future scenarios for consumers and businesses. We've said all year developers and businesses will be the early 5G adopters, and this puts both at the forefront of this revolution.\"This innovation points to a future where high-end augmented reality glasses are as thin and stylish as a standard pair of eyeglasses, lightweight drones can track themselves and thousands of nearby companions in near-real time, and autonomous cars have access to nearly-instant data processing capabilities without having to install a mini data center in the trunk. \"We are helping AT&T light up a wide range of unique solutions powered by Microsoft's cloud, both for its business and our mutual customers in a secure and trusted way,\" said Corey Sanders, corporate vice president, Microsoft Solutions. \"The collaboration reaches across AT&T, bringing the hyperscale of Microsoft Azure together with AT&T's network to innovate with 5G and edge computing across every industry.\"5G and edge for gaming, drones, and moreOne example of how edge computing can unlock new scenarios and experiences is in mobile gaming, where gaming company Game Cloud Network has created a unique 5G game that's hosted on the network edge with Microsoft Azure. Game Cloud Network is a pioneer in developing game-based brand engagement and a customer of AT&T. The company is now showcasing its new \"Tap & Field\" game, which utilizes Microsoft's Azure PlayFab services. In the game, users race each other in near-real time via this track-and-field-style game, enabled by the speed of 5G-connected devices.\"5G gaming provides consumers with the best of both worlds: highly-immersive experiences on lightweight mobile devices,\" said Aaron Baker, chief executive officer, Game Cloud Network. \"AT&T and Microsoft are building the perfect environment for game developers to create amazing new possibilities for gamers. 5G and edge computing have the potential to radically change how we play together and launch new business opportunities for brands and game publishers.\"Through AT&T Foundry, AT&T and Microsoft are exploring proofs-of-concept including augmented and virtual reality scenarios and drones. For example, both companies continue to work with Israeli startup Vorpal, helping its VigilAir product track drones in commercial zones, airports, and other areas with near-instant positioning. The companies also recently demoed using Microsoft HoloLens to provide 3D schematic overlays for technicians making repairs to airplanes and other industrial equipment.Progress toward a \"public-cloud first company\" and moreMicrosoft is also helping AT&T Communications become a \"public-cloud first\" company by migrating most non-network workloads to the public cloud by 2024, and this migration to Azure is already underway. Another important part of AT&T's strategy is to empower much of its workforce with Microsoft 365. This includes cloud-connected Office apps on Windows 10, and modern collaboration with Microsoft Teams, SharePoint and OneDrive. AT&T has begun rolling out these solutions to tens of thousands of employees to help drive a culture of modern work.AT&T and Microsoft will have more to share over the coming months and years as this unique alliance continues to evolve and expand. The two companies will both create and adopt new technologies to develop tools, commercial services and consumer applications that benefit everyone.  About AT&TAT&T Inc. (NYSE: T) is a diversified, global leader in telecommunications, media and entertainment, and technology. It executes in the market under four operating units. WarnerMedia is a leading media and entertainment company that creates and distributes premium and popular content to global audiences through its consumer brands including: HBO, Warner Bros., TNT, TBS, truTV, CNN, DC Entertainment, New Line, Cartoon Network, Adult Swim, Turner Classic Movies and others. AT&T Communications provides more than 100 million U.S. consumers with entertainment and communications experiences across TV, mobile and broadband services. Plus, it serves nearly 3 million business customers with high-speed, highly secure connectivity and smart solutions. AT&T Latin America provides pay-TV services across 11 countries and territories in Latin America and the Caribbean, and is the fastest growing wireless provider in Mexico, serving consumers and businesses. Xandr provides marketers with innovative and relevant advertising solutions for consumers around premium video content and digital advertising through its AppNexus platform.AT&T products and services are provided or offered by subsidiaries and affiliates of AT&T Inc. under the AT&T brand and not by AT&T Inc. Additional information is available at about.att.com. © 2019 AT&T Intellectual Property. All rights reserved. AT&T, the Globe logo and other marks are trademarks and service marks of AT&T Intellectual Property and/or AT&T affiliated companies. All other marks contained herein are the property of their respective owners.Cautionary Language Concerning Forward-Looking StatementsInformation set forth in this news release contains financial estimates and other forward-looking statements that are subject to risks and uncertainties, and actual results might differ materially. A discussion of factors that may affect future results is contained in AT&T's filings with the Securities and Exchange Commission. AT&T disclaims any obligation to update and revise statements contained in this news release based on new information or otherwise.This news release may contain certain non-GAAP financial measures. Reconciliations between the non-GAAP financial measures and the GAAP financial measures are available on the company's website at https://investors.att.com. About MicrosoftMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.  View original content to download multimedia:http://www.prnewswire.com/news-releases/att-integrating-5g-with-microsoft-cloud-to-enable-next-generation-solutions-on-the-edge-300965162.htmlSOURCE  AT&T"
    },
    {
        "title": "Thinking about trading options or stock in Intel, Microsoft, Roku, Tiffany, or Tesla?",
        "subtitle": "",
        "date": "Nov 25, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 25, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for INTC, MSFT, ROKU, TIF, and TSLA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-intel-microsoft-roku-tiffany-or-tesla-300964567.htmlSOURCE  InvestorsObserver"
    }
]