[
    {
        "title": "Micron and Continental Accelerate Machine Learning at the Edge",
        "subtitle": "",
        "date": "Feb 25, 2020 8:00AM EST",
        "content": "BOISE, Idaho, Feb.  25, 2020  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU), a leading memory and storage solutions provider, together with technology company Continental, today announced plans to enter into a collaboration agreement to explore and adapt Micron’s deep learning accelerator for next-generation machine learning automotive applications. This agreement brings together two world leaders in the automotive and memory markets to advance machine learning to meet the extreme memory requirements of modern vehicles.Automobile infotainment, communications, advanced driver-assistance systems (ADAS) and powertrain control systems are becoming increasingly sophisticated. Continental and Micron will work together to develop an application-specific version of Micron’s deep learning accelerator (DLA) technology designed to be flexible and scalable while delivering the low power and high performance needed to support industry-standard programming models.“Micron’s market leadership is driven by a long track record of product innovation and close collaboration with customers,” said Dirk Remde, vice president of Innovation Center Silicon Valley at Continental. “Working together with Micron to build a scalable and flexible solution for edge inference that supports multiple networks and frameworks, will enable us to efficiently deploy machine learning across our platforms and deliver intelligent mobility technologies for our customers.”Continental is known for its long history of bringing innovative technologies to the automotive market. The company envisions deploying deep learning solutions in areas such as ADAS advanced development, in-cabin monitoring and other connected and autonomous mobility solutions.“Machine learning is a critical component to ADAS, making it imperative to understand the requirements and use cases for this market,” said Steve Pawlowski, corporate vice president of Advanced Computing Solutions at Micron. “One of our key goals in collaborating with Continental is to create an agile edge-inference solution that uses machine learning and delivers the ease of use, scalability, low power and high performance the automotive sector requires.”Building on its memory and storage leadership, Micron integrates compute, memory, tools and software into a comprehensive artificial intelligence (AI) development platform with its DLA technology. Micron and Continental will leverage this platform to explore innovative memory optimized for AI workloads, including deep learning solutions for data analytics, particularly targeted toward the internet of things (IoT) and edge computing.ResourcesAbout Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron® and Crucial® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.About Continental Continental develops pioneering technologies and services for sustainable and connected mobility of people and their goods. Founded in 1871, the technology company offers safe, efficient, intelligent and affordable solutions for vehicles, machines, traffic and transportation. In 2018, Continental generated sales of 44.4 billion euros and currently employs more than 240,000 people in 60 countries and markets.© 2020 Micron and the Micron orbit logo are trademarks of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Micron Partners With Seven Industrial Companies to Deliver Robust and Innovative Solutions",
        "subtitle": "",
        "date": "Feb 25, 2020 3:05AM EST",
        "content": "SAN JOSE, Calif., Feb.  25, 2020  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU), today reaffirmed its three-decade commitment to the industrial market with the introduction of its Industrial Quotient (IQ) Partner Program.Backed by Micron and other founding members such as Advantech, ATP Electronics, Greenliant, Innodisk, Kontron, Mercury Systems and Viking Technology, Micron’s IQ Partner Program promotes design solutions that deliver high-quality, robust and long-lasting products across a breadth of industrial applications such as factory automation, transportation and defense systems.The industrial internet of things (IIoT) continues to transform the world of manufacturing at a rapid pace. This change extends automation and connectivity beyond traditional factory walls and drives demand for more data acquisition, communication, real-time analytics and data-driven decisions across a wide range of industrial verticals. The IQ Partner Program addresses the need for greater coordination and collaboration across the supply chain, which is required for designing today’s industrial solutions.Five Tenets of Micron’s IQ Matters Program:With more than three decades of leadership in developing memory solutions for the industrial market, Micron launched the IQ Matters Program in 2017, which forms the basis for the new IQ Partner Program. Micron’s program is built around five key tenets of design support that facilitate the creation of industrial products and deliver sustainable lower total cost of ownership (TCO) to Micron’s customers and the industry as a whole:“The broad and growing deployment of IIoT applications makes choosing the right industrial memory and storage solutions more critical for embedded applications,” said Kris Baxter, vice president of marketing for the Embedded Business Unit at Micron. “The IQ Partner Program gives our industrial customers confidence that they are choosing the best products and minimizing the total cost of ownership for their IIoT designs. These selections not only help meet the functional requirements of tomorrow’s industrial solutions, but they also ensure long-term reliability and quality with simplified product lifecycle management.”Micron memory and storage solutions remain the industry’s top choice across a variety of IIoT applications including industrial PCs (IPC), factory automation, surveillance, machine-to-machine (M2M), retail, digital signage, smart grid, fleet management and health care, as well as aerospace and defense. Members of Micron’s IQ Partner Program are committed to the development and delivery of robust industrial solutions that are optimized for the increasing demands and expectations for these critical applications.Quotes From Micron’s Industrial Quotient PartnersAdvantech: “Advantech is glad to be a part of Micron’s IQ Partner Program,” said Linda Tsai, president of Industrial IoT at Advantech. “Micron shares the same Industrial Quotient values with Advantech; therefore, having a partner like Micron that offers industry longevity, quality and reliable solutions enables us to better support factory automation, medical and transportation applications where these values are of paramount interest for our end customers.”ATP Electronics: “As long-time partners and fellow innovators, Micron and ATP Electronics are on a common mission to reshape the market’s concept of what it means to be industrial and ensure our customers get the best value out of their total cost of ownership,” said Marco Mezger, vice president of global marketing at ATP Electronics. “Micron’s (IQ) Partner Program echoes and complements our own ‘industrial only’ commitment and identity by considering factors far beyond a product’s temperature support.”Greenliant: “Micron’s industrial temperature 3D MLC NAND with advanced single-pass programming and power loss protection helps us address applications with enhanced data integrity requirements, such as train brake management systems,” said Ralph Thomson, director of field applications engineering at Greenliant. “Operating in extreme conditions with shock, vibration and power interruptions, train brake management equipment relies on Greenliant’s NANDrive BGA SSDs to store the operating system and critical maintenance data. Combined with Greenliant’s SSD controller know-how, Micron's 3D NAND flash technology has been advantageous in meeting reliability, safety and security needs for data storage in transportation systems.”Innodisk: “Innodisk is excited to partner with Micron because we share the same commitment to bringing industry-leading integrated solutions to the most demanding environments,” said C.C. Wu, vice president of Innodisk. “This collaboration helps move the industry into the future of artificial intelligence of things (AIoT).”Kontron: “We are pleased to cooperate with Micron, one of the leading chip manufacturers of innovative NVMe flash technologies. Micron allows Kontron to offer higher-capacity flash memory in a smaller footprint with faster access times, “said Peter Mueller, vice president of Product Center Boards & Modules at Kontron. “Micron’s focus on the embedded and industrial markets supports reliable and rugged products, which is important for Kontron and its customers.”Mercury Systems: “Combining Micron’s high-performance memory technology with Mercury Systems’ advanced miniaturization and packaging expertise, we enable the smallest aerospace and defense embedded systems with the most dense and high-reliability DRAM and SSD devices,” said Iain Mackie, vice president and general manager of Microelectronics Secure Solutions at Mercury Systems. “Our collaboration with Micron reinforces our commitment to making commercial technology profoundly more accessible to aerospace and defense.”Viking Technology: “Viking Technology has a strong legacy in developing industrial and embedded DRAM memory and flash storage products,” said Hamid Shokrgozar, president of Viking Technology. “In recent years, we have expanded those solutions to include specialized multichip package products such as our ParallelCell MCP solution. This solution is designed, developed and optimized for the stringent requirements of the military and aerospace market, and as such, we need a partner that can deliver NAND flash and DRAM memory enabled for these requirements. The Industrial Quotient partnership with Micron solidifies a long-term roadmap for those markets and further supports us as we move into the space market where endurance and temperature requirements are tested to their fullest potential.\"To learn more about Micron’s (IQ) Partner Program, visit www.micron.com/IQ.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron® and Crucial® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit www.micron.com.© 2020 Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Micron Technology to Report Fiscal Second Quarter Results on March 25, 2020",
        "subtitle": "",
        "date": "Feb 7, 2020 4:01PM EST",
        "content": "BOISE, Idaho, Feb.  07, 2020  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU), announced today that it will hold its fiscal second quarter earnings conference call on Wednesday, March 25, 2020 at 2:30 p.m. Mountain time. A live webcast of the call will be available via Micron’s Investor Relations website at investors.micron.com. A webcast replay will be available for approximately one year after the call.As a reminder, Micron Technology Chief Business Officer Sumit Sadana and Chief Financial Officer David Zinsner will participate in a fireside chat at the Goldman Sachs Technology and Internet Conference 2020 in San Francisco, California. The event will now be webcast live at 10:20 a.m. Pacific time on Tuesday, Feb. 11.Live webcasts and subsequent replays of presentations can be accessed from Micron’s Investor Relations website at http://investors.micron.com/.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.© 2020 Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners. "
    },
    {
        "title": "Micron Delivers World’s First Mass-Produced, Low-Power DDR5 DRAM for High-Performance Smartphones",
        "subtitle": "",
        "date": "Feb 6, 2020 8:00AM EST",
        "content": "BEIJING, Feb.  06, 2020  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU), today announced it has delivered the world’s first low-power DDR5 DRAM in mass production to be used in the soon-to-be-released Xiaomi Mi 10 smartphone. As Xiaomi’s memory technology partner, Micron provides LPDDR5 DRAM with superior power efficiency and faster data access speeds to meet growing consumer demand for artificial intelligence (AI) and 5G functionality in smartphones.“Micron’s leadership in delivering the industry’s first low-power DDR5 DRAM for use in a smartphone will accelerate enablement of 5G and AI applications,” said Dr. Raj Talluri, senior vice president and general manager of the Mobile Business Unit at Micron. “Our customers and partners require next-generation memory solutions, based on the latest process technology, that drive unmatched power and performance to support 5G and AI systems. Micron’s LPDDR5 DRAM addresses those requirements with a 50% increase in data access speeds and more than 20% power efficiency compared to previous generations.”\"We value Micron's long-standing leadership and innovation in memory,” said Chang Cheng, vice president at Xiaomi Group. “Micron's LPDDR5 DRAM market-leading features ensure our Xiaomi Mi 10 smartphone will remain power-efficient while still offering incredible performance and greater stability. We believe LPDDR5 will be the standard configuration for all flagship devices in 2020.\"Micron designed LPDDR5 DRAM to address the growing demand for higher memory performance and lower energy consumption across a wide array of markets, including automotive, client PCs and networking systems built for 5G and AI applications. LPDDR5 can provide more than a 20% reduction in power use compared to LPDDR4x memory.The emergence of AI in more applications is driving the need for advanced memory solutions that enable faster and more efficient access to data. Micron LPDDR5 delivers the speed and capacity needed to feed AI engines built directly into mobile processors. These processors rely on high data rates from Micron’s internal LPDDR5 memory to power their machine learning capabilities.Micron’s next-generation LPDDR5 memory is designed to meet the demands of 5G networks, which will start deploying globally at scale in 2020. Micron LPDDR5 allows 5G smartphones to process data at peak speeds of up to 6.4Gbps, which is critical for preventing 5G data bottlenecks. This capability addresses other emerging technology needs, such as those in autonomous vehicles that require a memory subsystem with a larger bandwidth to support real-time computing and data processing.Micron is shipping LPDDR5 to customers in capacities of 6GB, 8GB and 12GB and at data speeds of 5.5Gbps and 6.4Gbps. In the first half of calendar 2020, Micron LPDDR5 will also be available in a UFS-based multichip package (uMCP5) for use in mid- and high-tier smartphones.  The LPDDR5 in a multichip package will also provide longer battery life and higher bandwidth to enable high-performance image processing that was previously reserved for flagship smartphones.To learn more about Micron’s low-power DRAM portfolio, including LPDDR5, visit www.micron.com/products/dram/lpdram.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron® and Crucial® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit www.micron.com.© 2020 Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Micron Technology Announces Upcoming Investor Event",
        "subtitle": "",
        "date": "Feb 4, 2020 4:00PM EST",
        "content": "BOISE, Idaho, Feb.  04, 2020  (GLOBE NEWSWIRE) -- Micron Technology Chief Business Officer Sumit Sadana and Chief Financial Officer David Zinsner will participate in a fireside chat at the Goldman Sachs Technology and Internet Conference 2020 in San Francisco, California. The event will be webcast live at 10:30 a.m. Pacific time on Tuesday, Feb. 11.Live webcasts and subsequent replays of presentations can be accessed from Micron’s Investor Relations website at http://investors.micron.com/.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.Micron and the Micron orbit logo are trademarks of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Thinking about buying stock in Canopy Growth Corp, Micron Technology, Petmed Express, Sorrento Therapeutics, or Target?",
        "subtitle": "",
        "date": "Jan 15, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 15, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CGC, MU, PETS, SRNE, and TGT.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-canopy-growth-corp-micron-technology-petmed-express-sorrento-therapeutics-or-target-300987472.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Micron and Valens Demonstrate Industry’s First In-Vehicle Remote, Centralized Storage Solution",
        "subtitle": "",
        "date": "Jan 7, 2020 4:01PM EST",
        "content": "LAS VEGAS, Jan.  07, 2020  (GLOBE NEWSWIRE) -- CES -- Micron Technology, Inc. (Nasdaq: MU), and Valens, the leader in ultra-high-speed in-vehicle connectivity, today are demonstrating the automotive industry’s first 1TB remote, centralized storage solution at the Consumer Electronics Show in Las Vegas. Based on Micron’s recently announced automotive-compliant ball grid array (BGA) solid-state drive and Valens’ advanced automotive connectivity technology, the combined solution is capable of tunneling PCIe over long distances on a single cable supporting up to 16Gbps of data transfer over low-cost, unshielded wiring. Through this collaboration, Micron and Valens are enabling next-generation automotive platforms that will help fulfill the promise of autonomous, advanced driver-assistance systems (ADAS) as well as tomorrow’s in-vehicle infotainment (IVI).“As the automotive industry embraces higher levels of autonomous driving capabilities, OEMs and Tier 1s are actively adopting domain-based architectures,” said Reinhard Weigl, Micron’s senior director of Automotive Marketing at Micron. “Remote, centralized storage provides significant benefits over traditional local, distributed storage in automotive applications to enable better data protection and version control, while ensuring the highest levels of integration at a lower cost.”The MIPI® Alliance, a collaborative global standardization organization serving industries that develop mobile and mobile-influenced devices, recently selected Valens’ technology as the baseline for its long-reach, high-speed connectivity A-PHY automotive application standard. Valens’ automotive technology provides resilient, ultra-high-speed in-vehicle connectivity to meet the needs of today’s and tomorrow’s connected cars. Micron was the first to introduce 1TB automotive- and industrial-grade PCIe NVMe™ SSDs, which are designed for next-generation autonomous cars and the industrial internet of things (IIoT). Taken together, these solutions address growing data and connectivity requirements in next-generation autonomous vehicles, delivering faster, more reliable and cost-effective storage.“Optimized in-vehicle connectivity and storage solutions are essential to guarantee high performance, safety and security as we move toward increasingly connected and autonomous vehicles,” said Daniel Adler, vice president of the Automotive Business Unit at Valens. “Valens’ ability to transmit PCIe for up to 15m/50ft considerably simplifies the infrastructure and, along with Micron’s remote, centralized storage solution, brings substantial benefits to the sector.”“In-vehicle architectures, along with the storage strategies that are used, need to change,” said Ian Riches, vice president of Global Automotive Practice at Strategy Analytics. “This will be necessary not only to support automated driving in future robotaxi-style vehicles, but also to offer advanced safety and driver-support features in more mainstream models. Micron’s 1TB remote, centralized storage solution and Valens’ long-reach, ultra-high-bandwidth data transmission address these market challenges, providing more flexibility and better performance, and ultimately reducing total cost.”Micron and Valens’ new storage solution allows architects and designers to locate storage anywhere within the vehicle for optimal use and fit, which will ultimately enrich the driving experience. Micron and Valens will demonstrate this technology at CES 2020 (LVCC, North Hall, Booth 9005).About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron® and Crucial® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.About Valens  Valens Automotive, a division of Valens, was established in 2015 with the singular goal of delivering the world’s most advanced audio/video chipset technology to the automotive world. Valens Automotive chipset technology enables resilient ultra-high-speed in-vehicle connectivity to support the needs of the connected and autonomous car. Valens’ patented HDBaseT technology is used by the world’s largest audio/video component manufacturers, enabling the highest quality of connectivity without the limitations of legacy infrastructure. Valens is a private company headquartered in Israel. For more information: https://www.valens.com/automotive-solutions, or follow @ValensAuto.© 2020 Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "The Next Leap in Data Center Performance Arrives With Micron DDR5",
        "subtitle": "",
        "date": "Jan 6, 2020 4:01PM EST",
        "content": "LAS VEGAS, Jan.  06, 2020  (GLOBE NEWSWIRE) -- CES -- Micron Technology, Inc. (Nasdaq: MU) today announced that it has begun sampling DDR5 Registered DIMMs (RDIMM), based on its industry-leading 1znm process technology. DDR5, the most technologically advanced DRAM to date, will enable the next generation of server workloads by delivering more than an 85% increase in memory performance. DDR5 doubles memory density while improving reliability at a time when data center system architects seek to supply rapidly growing processor core counts with increased memory bandwidth and capacity.“Data center workloads will be increasingly challenged to extract value from the accelerating growth of data across virtually all applications,” said Tom Eby, senior vice president and general manager of the Compute & Networking Business Unit at Micron. “The key to enabling these workloads is higher-performance, denser, higher-quality memory. Micron’s sampling of DDR5 RDIMMs represents a significant milestone, bringing the industry one step closer to unlocking the value in next-generation data-centric applications.”Advanced workloads resulting from rapidly expanding datasets and compute-intensive applications have fueled processor core count growth which will be bandwidth-starved by current DRAM technology. DDR5 will deliver more than a 1.85 times increase in performance compared to DDR4. DDR5 also enables the increased reliability, availability and serviceability (RAS) that modern data centers require.As a global leader in memory technology, Micron brings more than 40 years of expertise in design, manufacturing, delivery and support to its global list of partners and customers. Micron’s portfolio of DDR5 SDRAM products sets the bar higher than ever before. To learn more visit https://www.micron.com/products/dram/ddr5-sdram.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron® and Crucial® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.© 2020 Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Micron Technology Announces Upcoming Investor Event",
        "subtitle": "",
        "date": "Jan 3, 2020 4:01PM EST",
        "content": "BOISE, Idaho, Jan.  03, 2020  (GLOBE NEWSWIRE) -- Micron Technology (Nasdaq:MU) Executive Vice President and Chief Business Officer Sumit Sadana will participate in a fireside chat at the J.P. Morgan Tech/Auto Forum at CES 2020 in Las Vegas, Nevada. The event will be webcast live at 10:30 a.m. Pacific time on Tuesday, Jan. 7.Live webcasts and subsequent replays of presentations can be accessed from Micron’s Investor Relations website at http://investors.micron.com/.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.Micron and the Micron orbit logo are trademarks of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Micron Technology, Inc. Reports Results for the First Quarter of Fiscal 2020",
        "subtitle": "",
        "date": "Dec 18, 2019 4:01PM EST",
        "content": "BOISE, Idaho, Dec.  18, 2019  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU) today announced results for its first quarter of fiscal 2020, which ended November 28, 2019.Fiscal Q1 2020 highlights\"Micron posted solid first quarter results, delivering good profitability and positive free cash flow. With our strong execution and improving industry conditions, we are optimistic that Micron's fiscal second quarter will be the cyclical bottom for our financial performance,\" said Micron Technology President and CEO Sanjay Mehrotra. \"Our significantly improved competitive position, dramatically stronger product portfolio, structurally higher profitability and investment-grade balance sheet position Micron very well to drive long-term shareholder value.\"Investments in capital expenditures, net of amounts funded by partners, were $1.93 billion for the first quarter of fiscal 2020, which resulted in adjusted free cash flows(3) of $79 million. Micron repurchased an aggregate of 1 million shares of its common stock for $50 million during the first quarter of fiscal 2020 and ended the quarter with cash, marketable investments, and restricted cash of $8.31 billion, for a net cash(4) position of $2.66 billion.Business OutlookThe following table presents Micron’s guidance for the second quarter of fiscal 2020:Further information regarding Micron’s business outlook is included in the prepared remarks and slides, which have been posted at investors.micron.com.Investor WebcastMicron will host a conference call on Wednesday, December 18, 2019 at 2:30 p.m. MT to discuss its first fiscal quarter financial results and provide forward-looking guidance for its second fiscal quarter. A live webcast of the call will be available online at investors.micron.com. A webcast replay will be available for one year after the call. For Investor Relations and other company updates, follow @MicronTech on Twitter at twitter.com/MicronTech.About Micron Technology, Inc.We are an industry leader in innovative memory and storage solutions. Through our global brands —  Micron®, Crucial®, and Ballistix® —  our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory, and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning, and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.Micron and the Micron orbit logo are trademarks of Micron Technology, Inc. All other trademarks are the property of their respective owners.Forward-Looking StatementsThis press release contains forward-looking statements regarding the industry, our strategic position, and financial and operating results. These forward-looking statements are subject to a number of risks and uncertainties that could cause actual results to differ materially. Please refer to the documents we file with the Securities and Exchange Commission, specifically our most recent Form 10-K. These documents contain and identify important factors that could cause our actual results to differ materially from those contained in these forward-looking statements. These certain factors can be found at www.micron.com/certainfactors. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance, or achievements. We are under no duty to update any of the forward-looking statements after the date of this release to conform these statements to actual results.Further information regarding Micron’s use of non-GAAP measures and reconciliations between GAAP and non-GAAP measures are included within this press release.MICRON TECHNOLOGY, INC.CONSOLIDATED STATEMENTS OF OPERATIONS(In millions, except per share amounts)(Unaudited)MICRON TECHNOLOGY, INC.CONSOLIDATED BALANCE SHEETS(In millions)(Unaudited)MICRON TECHNOLOGY, INC.CONSOLIDATED STATEMENTS OF CASH FLOWS(In millions)(Unaudited)MICRON TECHNOLOGY, INC.NOTES (Unaudited)Property, Plant, and EquipmentWe periodically assess the estimated useful lives of our property, plant, and equipment. Based on our assessment of planned technology node transitions, capital spending, and re-use rates, we revised the estimated useful lives of equipment in our NAND wafer fabrication facilities and our research and development facilities from five years to seven years as of the beginning in the first quarter of fiscal 2020. As a result, we estimate the reduction in non-cash depreciation expense benefited operating income and net income by approximately $74 million and diluted earnings per share by approximately $0.07 for the first quarter of fiscal 2020.Acquisition of Intel's Interests in IMFTOn October 31, 2019, we purchased Intel’s noncontrolling interests in IMFT and IMFT member debt for $1.25 billion. We recognized a non-operating gain of $72 million for the difference between the $505 million of cash consideration allocated to the extinguishment of IMFT member debt and its $577 million carrying value, and a $160 million adjustment to equity for the difference between the $744 million of cash consideration allocated to the purchase of Intel’s noncontrolling interest and its $904 million carrying value.Adoption of Lease Accounting StandardIn the first quarter of fiscal 2020, we adopted ASU 2016-02 – Leases (as amended, “ASC 842”), which amends a number of aspects of lease accounting, including requiring lessees to recognize operating leases with a term greater than one year on their balance sheet as a right-of-use asset and corresponding lease liability, measured at the present value of lease payments. In adoption, we applied the modified retrospective method and elected to not recast prior periods. As a result, we recognized $567 million for operating lease liabilities and right-of-use assets and reclassified an additional $66 million of other balances to right-of-use assets to conform to the new presentation requirements of ASC 842.Debt ActivityOn November 18, 2019, we prepaid $519 million of our 2025 Notes and recognized a loss of $18 million in other non-operating income (expense), net. On October 30, 2019, we drew all of the $1.25 billion available under our term loan credit facility. Prior to our acquisition of Intel's interests in IMFT, IMFT repaid Intel $116 million of IMFT member debt in the first quarter of fiscal 2020.MICRON TECHNOLOGY, INC.RECONCILIATION OF GAAP TO NON-GAAP MEASURES(In millions, except per share amounts)RECONCILIATION OF GAAP TO NON-GAAP MEASURES, ContinuedThe tables above reconcile GAAP to non-GAAP measures of gross margin, operating income, net income attributable to Micron, diluted shares, diluted earnings per share, adjusted free cash flow, and net cash. The non-GAAP adjustments above may or may not be infrequent or nonrecurring in nature, but are a result of periodic or non-core operating activities. We believe this non-GAAP information is helpful in understanding trends and in analyzing our operating results and earnings. We are providing this information to investors to assist in performing analysis of our operating results. When evaluating performance and making decisions on how to allocate our resources, management uses this non-GAAP information and believes investors should have access to similar data when making their investment decisions. We believe these non-GAAP financial measures increase transparency by providing investors with useful supplemental information about the financial performance of our business, enabling enhanced comparison of our operating results between periods and with peer companies. The presentation of these adjusted amounts varies from numbers presented in accordance with U.S. GAAP and therefore may not be comparable to amounts reported by other companies. Our management excludes the following items in analyzing our operating results and understanding trends in our earnings:Our outstanding capped call transactions are anti-dilutive in GAAP earnings per share but are expected to mitigate the dilutive effect of our convertible notes. In periods with non-GAAP income attributable to Micron, non-GAAP diluted shares include the impact of capped calls based on the average share price for the period the capped calls are outstanding. Non-GAAP diluted shares are also adjusted for the impact of additional shares resulting from the exclusion of stock-based compensation from non-GAAP income.MICRON TECHNOLOGY, INC.RECONCILIATION OF GAAP TO NON-GAAP OUTLOOK(In millions, except per share amounts)(1)   GAAP earnings per share based on approximately 1.13 billion diluted shares and non-GAAP earnings per share based on approximately 1.14 billion diluted shares.The tables above reconcile our GAAP to non-GAAP guidance based on the current outlook. The guidance does not incorporate the impact of any potential business combinations, divestitures, restructuring activities, balance sheet valuation adjustments, strategic investments, financing transactions, and other significant transactions. The timing and impact of such items are dependent on future events that may be uncertain or outside of our control."
    },
    {
        "title": "Micron Publishes Fiscal 2019  Diversity, Equality and Inclusion Report",
        "subtitle": "",
        "date": "Dec 4, 2019 5:00PM EST",
        "content": "BOISE, Idaho, Dec.  04, 2019  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU), today announced the publication of its second annual diversity, equality and inclusion report. The report is part of the company’s continued efforts to build a diverse workforce and inclusive culture. It demonstrates Micron’s progress in several key areas, including women’s representation, pay equity and growth of employee resource groups (ERGs).“Micron is pleased to announce the publication of our Diversity, Equality and Inclusion FY19 Annual Report, demonstrating our commitment to creating an environment where all team members can bring their authentic selves to work and contribute ideas that drive business success,” said Micron Vice President of Diversity, Equality and Inclusion Sharawn Connors. “Micron believes that collaboration across our diverse workforce is the key to unlocking strength and innovation, and we are passionate about building a culture of inclusion where all team members are seen, heard, valued and respected.”The Micron Diversity, Equality and Inclusion FY19 Annual Report provides a baseline for tracking the company’s progress, examining a variety of factors, including race/ethnicity, gender, job roles, philanthropy and compensation.The report contains a number of highlights:Micron is pleased to be recognized as one of Forbes Best Employers for Diversity in 2019. Forbes’ anonymous survey asked over 50,000 participants to rank their organizations on fair and equal treatment of workers across the following categories: age, gender, ethnicity, disability and sexual orientation.Micron’s approach to diversity, equality and inclusion aims to create an environment where all Micron team members have opportunities to grow, contribute and advance. The full Micron Diversity, Equality and Inclusion FY19 Annual Report can be found at http://www.micron.com/dei.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, NOR Flash and 3D XPoint™ memory, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, machine learning and autonomous vehicles, in key market segments like data center, networking, automotive, industrial, mobile, graphics and client. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.© 2019 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Thinking about buying stock in E*TRADE, Kodiak Sciences, Micron Technology, Nio, or Wells Fargo?",
        "subtitle": "",
        "date": "Dec 3, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 3, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ETFC, KOD, MU, NIO, and WFC.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-etrade-kodiak-sciences-micron-technology-nio-or-wells-fargo-300968229.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Micron Technology Announces Upcoming Investor Event",
        "subtitle": "",
        "date": "Nov 26, 2019 4:01PM EST",
        "content": "BOISE, Idaho, Nov.  26, 2019  (GLOBE NEWSWIRE) -- Micron Technology (Nasdaq:MU) Chief Executive Officer Sanjay Mehrotra will participate in a fireside chat at the Credit Suisse Annual Technology Conference in Phoenix, Arizona. The event will be webcast live at 1:10 p.m. Mountain time on Tuesday, Dec. 3.Live webcasts and subsequent replays of presentations can be accessed from Micron’s Investor Relations website at http://investors.micron.com/.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com."
    },
    {
        "title": "Micron Technology to Report Fiscal First Quarter Results on December 18, 2019",
        "subtitle": "",
        "date": "Nov 19, 2019 4:01PM EST",
        "content": "BOISE, Idaho, Nov.  19, 2019  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU) announced today that it will hold its fiscal first quarter earnings conference call on Wednesday, December 18, 2019 at 2:30 p.m. MST. A live webcast of the call will be available via Micron’s Investor Relations website at investors.micron.com. A webcast replay will be available for approximately one year after the call.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com."
    },
    {
        "title": "Micron Eliminates Need for Network Video Recorders With Launch of World’s First 1TB Industrial-Grade microSD Card for Cloud-Managed Video Surveillance",
        "subtitle": "",
        "date": "Nov 12, 2019 9:00AM EST",
        "content": "News Highlights BOISE, Idaho, Nov.  12, 2019  (GLOBE NEWSWIRE) -- Micron Technology, Inc. (Nasdaq: MU), today unveiled the world’s highest-capacity industrial microSD card — Micron® i300 1TB3 microSDXC UHS-I — to address the edge storage needs of the video surveillance market and other industrial applications. The new Micron® i300 1TB microSD card is based on Micron’s advanced 96-layer 3D quad-level cell (QLC) NAND technology, now making it cheaper for small- to medium-sized deployments to have primary storage in the camera compared to a centralized storage architecture. The i300 microSD card enables users of video surveillance systems to capture and store more than three months of high-quality video footage on-device and at the edge.“Micron’s i300 industrial-grade microSD cards for edge storage open the possibility for a broad range of video surveillance as a service deployments that no longer require local network video recorders,” said Amit Gattani, senior director of Segment Marketing in Micron’s Embedded Business Unit. “Micron’s 96-layer 3D QLC NAND is instrumental in helping us deliver 1TB of storage in a microSD form factor and at a breakthrough price point to accelerate edge storage and cloud-based service models.”Intelligence at the EdgeVSaaS systems are increasingly integrating artificial intelligence-based and higher-resolution cameras that require more storage at the edge. The Micron i300 1TB microSDXC card allows 24/7 continuous capture and storage of up to 1TB of high-quality video in the camera. Users of video surveillance systems can now store large amounts of video footage on-device, opening a broader set of uses for cloud-managed solutions.“Demand for commercial surveillance cameras continues to grow at a rapid pace,” said Jeff Janukowicz, research vice president at International Data Corporation (IDC). “Smart cameras, artificial intelligence, machine learning and threat detection are being driven to the edge for real-time responsiveness, making Micron’s 1TB microSD card an invaluable solution for differentiation and innovation.”The VSaaS market is projected to reach $6 billion in 2022, corresponding to a growth of 22% compound annual growth rate between 2017 and 2022.4 The rising adoption of VSaaS by small to medium businesses and enterprises is attributed to lower overhead costs achieved through ease of installation and elimination of the need for on-site NVRs and DVRs. The ability to store large video footage files in the camera and at the edge reduces the demand for network bandwidth and expenditure associated with continuous cloud storage. These savings contribute to lowering the overall cost of ownership for businesses while bringing flexibility and scalability associated with cloud-based implementation models.\"The video surveillance market is quickly shifting toward hybrid cloud architectures that store video footage on-camera, allowing secure access via cloud-based software,” said Raj Misra, director of Hardware Engineering at Verkada. “Enterprise customers are choosing hybrid cloud offerings to reduce operational costs, simplify installation and management, and gain from powerful video analytics. Micron extending its range of reliable industrial-grade microSD cards to 1TB enables us to provide our customers with industry-leading data retention, security and video resolution options at very cost-effective price points.\"Micron’s industrial-grade microSD portfolio is designed to endure the harsh environments in which surveillance systems are deployed. The Micron i300 1TB microSDXC card minimizes frame drops in a 24/7, 30 frames per second (FPS) recording environment, offering twice the reliability of hard disk drives at 2 million hours mean time to failure. The card features a smart tool for monitoring the health of devices.“VIVOTEK has launched a series of edge-computing network cameras and successfully deployed Micron’s high-quality industrial-grade microSD cards,” said Shengfu Cheng, director of Marketing and Product Development Division, VIVOTEK Inc. “Micron’s portfolio of industrial microSD cards up to 1TB equips us to deliver greater flexibility, scalability and maintenance efficiency to our customers, all of which contribute to a better return on investment.”AvailabilityThe Micron i300 microSDXC UHS-I card is offered in 128GB to 1TB capacities, which are available for ordering. The entire industrial-grade portfolio includes capacities ranging from 32GB to 1TB. For more information, visit https://www.micron.com/campaigns/video-surveillance.Additional information on the Micron i300 1TB microSDXC UHS-I card, including product availability and product specifications, is available here.ResourcesBlog: https://www.micron.com/about/blog Twitter: https://twitter.com/MicronTechLinkedIn: https://www.linkedin.com/company/micron-technology/YouTube™: http://www.youtube.com/user/MicronTechnologyAbout Micron Technology, Inc.We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix®— our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.References and Sources© 2019 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology Inc. All other trademarks are the property of their respective owners."
    },
    {
        "title": "Thinking about trading options or stock in Apple, Baidu, JPMorgan Chase, Micron Technology, or Yum! Brands?",
        "subtitle": "",
        "date": "Nov 7, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 7, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BIDU, JPM, MU, and YUM.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-baidu-jpmorgan-chase-micron-technology-or-yum-brands-300953924.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Micron Technology Announces Upcoming Investor Event",
        "subtitle": "",
        "date": "Oct 29, 2019 4:01PM EDT",
        "content": "BOISE, Idaho, Oct.  29, 2019  (GLOBE NEWSWIRE) -- Micron Technology Chief Financial Officer David Zinsner will participate in a fireside chat at the Bernstein Technology Innovation Summit in New York, New York. The event will be webcast live at 10 a.m. Eastern time on Wednesday, Nov. 6.Live webcasts and subsequent replays of presentations can be accessed from Micron’s Investor Relations website at http://investors.micron.com/.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com."
    },
    {
        "title": "Micron Ventures Invests in Urban Air Mobility Pioneer Volocopter",
        "subtitle": "",
        "date": "Oct 24, 2019 6:55PM EDT",
        "content": "SAN FRANCISCO, Oct.  24, 2019  (GLOBE NEWSWIRE) -- MICRON INSIGHT -- Micron Technology, Inc. (Nasdaq: MU), today announced that its strategic investment entity, Micron Ventures, is taking part in a Series C investment round in urban air mobility pioneer Volocopter. A builder of electrically powered vertical take-off and landing aircraft that meet the safety standards of today’s aviation vehicles and exceed those of helicopters, Volocopter seeks to commercialize autonomous, on-demand air taxi services.Expanding Mobility to the SkiesThe growing migration of people to cities is pushing current models of mobility to their limits. The need to find solutions is sparking an explosion of innovation and disruption from private companies like Volocopter. With nearly a decade of experience testing its air taxi technology, the German-based startup’s electrically powered vertical take-off and landing (eVTOL) aircraft address the increasing need to transform megacity transportation systems and provide people with new commuting options.“Volocopter is an exciting company that’s well-positioned to revolutionize the mobility and transportation market and contribute to building a sustainable and environmentally friendly transportation infrastructure,” said René Hartner, vice president of Corporate Business Development at Micron Technology. “Micron’s investment in Volocopter aligns with our view of the critical role that memory and storage solutions play in enabling the breakthrough capabilities needed for autonomous vehicles and edge computing.”Micron is the largest memory supplier for the automotive industry, with high-performance solutions that facilitate advancements in autonomous driving, virtual reality and air travel. Micron Venture’s investment in Volocopter reflects the company’s constant scouting for new, innovative solutions.“We’re proud to have Micron partner with us as we execute on our bold vision to bring urban air mobility to life,” said Volocopter CEO Florian Reuter. “Volocopter helps megacities transform their mobility infrastructure toward a more sustainable future. We aim to offer affordable, autonomous, on-demand air taxi services to transport people in megacities — all for the price of a taxi ride and with significant time savings.”In addition to air taxis, Volocopter is also developing the ecosystem around urban air mobility while working with the European Union Aviation Safety Agency on securing Type I certification to transport people commercially. This effort includes VoloPorts that connect VoloCity aircraft with key inner-city traffic hubs, such as airports and business districts.The Memory and Storage EdgeAs Micron’s customers demand greater performance and energy efficiency, memory and storage solutions are becoming strategic differentiators for its customers and partners. New sources of data in this ecosystem include embedded systems, sensors in everything, RFID tags, and advanced compute systems in cars, planes and supercomputers.Micron Ventures identifies and directs Micron’s investments in technology-first startups, creating value from new computing architectures and applied artificial intelligence and machine learning solutions. As a leading global semiconductor company working across industry verticals, Micron is uniquely positioned to accelerate portfolio companies into global markets through research and development support, productization and collaborative market entry.The new investment round was led by Zhejiang Geely Holding Group (Geely Holding), a privately owned automotive group from China with a portfolio of global brands including Geely Auto, Volvo Cars, Lotus and other automotive companies. Geely has also partnered with Daimler to bring smart and premium ride-hailing services to market.About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions. Through our global brands – Micron®, Crucial®, and Ballistix® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.About VolocopterVolocopter is building the world’s first sustainable and scalable urban air mobility business to bring affordable air taxi services to megacities worldwide. With the VoloCity, the company is developing the first fully electric, safe, and low-noise “eVTOL” aircraft in certification to safely and quietly transport passengers within cities. Volocopter leads and cooperates with partners in infrastructure, operations, and air traffic management to build the ecosystem necessary to ‘Bring Urban Air Mobility to Life’. In 2011, Volocopter performed the first-ever manned flight of a purely electric multicopter and has since showcased numerous public flights with its full-scale aircraft. The most notable have been the public test flights at Singapore’s Marina Bay in October 2019 and the world’s first autonomous eVTOL flight in Dubai 2017. Founded in 2011 by Stephan Wolf and Alexander Zosel, Volocopter has 150 employees in offices in Bruchsal, Munich, and Singapore. The company is managed by CEO Florian Reuter, CTO Jan-Hendrik Boelens, and CFO Rene Griemens, and has raised a total of 85 million euro in equity. Volocopter‘s investors include Daimler, Geely, Intel Capital, Micron, BtoV, and Manta Ray Ventures. Find out more at: www.volocopter.com.© 2019 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners. "
    },
    {
        "title": "Micron Broadens Choices for Storing the World’s Data With Announcement of New Enterprise and Consumer SSDs",
        "subtitle": "",
        "date": "Oct 24, 2019 2:45PM EDT",
        "content": "News HighlightsMicron® 7300 Series of NVMe™ SSDsMicron® 5300 Series of SATA SSDsCrucial® X8 Portable SSDSAN FRANCISCO, Oct.  24, 2019  (GLOBE NEWSWIRE) -- MICRON INSIGHT — Micron Technology, Inc. (Nasdaq: MU), today unveiled new solid-state drives (SSDs) that expand Micron’s broad portfolio of drives available to both consumer and enterprise customers for storing the world’s data. The new Micron® 7300 NVMe series and Micron® 5300 SATA series of SSDs enable enterprises to modernize, economize and maximize return on their data center investments.Addressing consumers’ need for mobility, Micron also announced its entry into the consumer portable SSD market with the launch of its Crucial® X8 Portable SSD.“We are excited to introduce these new products that significantly expand our addressable market — with mainstream NVMe SSDs for the datacenter and portable SSDs for consumers — while building on our leadership in enterprise SATA SSDs,” said Sumit Sadana, executive vice president and chief business officer of Micron. “Micron’s growing portfolio of high-value storage solutions is built on industry-leading 3D NAND technology and provides customers a broad set of options to address their increasing data storage needs.”Analyst firm IDC forecasts that the world’s data will grow from 33ZB in 2018 to 175ZB in 2025.2 Data centers will require higher-performance enterprise-class drives that can sustain heavy workloads to ensure that organizations have faster access to their data. In parallel, growing volumes of data are increasing average capacities in enterprise and consumer drives. The new SSDs deliver on Micron’s commitment to provide differentiated solutions that store data across all market segments and needs, from consumer to cloud.Micron 7300 NVMe Series SSDsThe Micron 7300 NVMe series of SSDs are designed for workloads that demand high throughput and low latency. They are ideal for commonly used mixed read-write, compute and virtualized tasks such as SQL and NoSQL, for hyperconverged infrastructures, and for compute-centric cloud platforms. The use of 96-layer 3D TLC NAND technology brings cost and power efficiencies while the drives offer end-to-end data path protection, power-loss protection, secure firmware and instant secure erase capability.The 7300 NVMe series come in a wide variety of form factors, capacities and endurance levels. The drives will be available for ordering starting in December 2019. The 7300 series of drives complement Micron’s existing data center portfolio, which includes the high-performance 9300 NVMe SSDs announced earlier this year.For more information on the Micron 7300 series of NVMe SSDs, including capacity ranges and specifications, visit: https://www.micron.com/products/solid-state-drives/product-lines/7300Micron 5300 SATA Series SSDsThe new Micron 5300 SATA SSDs allow enterprises to extend their infrastructure investment by enabling an upgrade of their data centers with next-generation SATA drives. The Micron 5300 SSDs are the industry’s first 96-layer 3D TLC enterprise SATA drives with enhanced security. The new SSDs are optimized for read-intensive and mixed-use workloads while offering reliability that is 50% higher than the industry average for SATA drives.The 5300 SATA series of SSDs are available in a range of capacities, from 240GB to 7.68TB. To learn more about the Micron 5300 SATA series of SSDs, visit: https://www.micron.com/products/solid-state-drives/product-lines/5300Crucial X8 Portable SSD for ConsumersThe Crucial X8 Portable SSD, introduced by Micron’s industry-leading consumer brand for memory and storage upgrades, caters to the ever-expanding need for more storage by consumers, who are capturing more photos and playing larger console and PC games than ever before.The Crucial X8 portable drive delivers impressive performance in a sleek case. With read speeds up to 1,050MB/s,3 the drive performs 1.8 times faster than similar portable SSDs within the same price category and up to 7.5 times faster than portable hard drives. The Crucial X8 is compatible with a variety of devices, including PCs, Macs, PS4s, XBOX Ones, iPad Pros, Chromebooks and select Android devices.Crucial’s award-winning SSDs undergo thousands of hours of Micron prerelease validation and extensive SSD qualification testing before market release. The drive is drop-proof up to 7.5 feet.4 Crucial X8 is backed by a three-year limited warranty and available for ordering in capacities up to 1TB at crucial.com and through select global partners. For more information, visit: crucial.com/X8Micron Storage Resources:Blog: https://www.micron.com/about/blogTwitter: www.twitter.com/MicronStorageLinkedIn: www.linkedin.com/company/micron-storageYouTube™: www.youtube.com/microntechnologyCrucial Resources:Facebook: www.facebook.com/crucialmemoryTwitter: www.twitter.com/crucialmemoryYouTube: www.youtube.com/crucialmemoryAbout CrucialCrucial is a global brand of Micron Technology, Inc. Crucial solid-state drives (SSDs) and memory (DRAM) upgrades are compatible with over 100,000 new and old desktops, laptops, workstations, and servers. Available worldwide at leading retail and e-tail stores, commercial resellers, and system integrators, Crucial products enhance system performance and user productivity. Learn more at crucial.com.About Micron Technology, Inc.We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.© 2019 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners._______________________________________1 Per public data sheet specifications, the Micron 5300 SSD has a mean time to failure (MTTF) of 3 million device hours, compared to 2 million hours for SATA enterprise SSDs.2 Source: IDC. The Digitization of the World From Edge to Core, Nov. 2018.3 MB/s speed measured as maximum sequential performance of device as measured by Crucial on a high-performance desktop computer with Crystal Disk Mark (version 6.0.2 for x64). Your performance may vary. Comparative speed claims measured as maximum sequential performance of similarly situated portable SSD’s, mainstream portable HDD’s and mainstream USB flash drives from vertically-integrated manufacturers selling under their own brands as of June 2019.4 Up to 7.5 ft/2 m on a carpeted floor without damage to data on drive. "
    },
    {
        "title": "Micron Introduces Industry’s First Silicon-Based Security-as-a-Service Platform for IoT Edge Devices",
        "subtitle": "",
        "date": "Oct 24, 2019 2:45PM EDT",
        "content": "Authenta™ Key Management Service Enables Cloud Activation of Installed Authenta-Enabled DevicesNews Highlights SAN FRANCISCO, Oct.  24, 2019  (GLOBE NEWSWIRE) -- MICRON INSIGHT — Micron Technology, Inc. (Nasdaq: MU), today introduced the industry’s first silicon-based security-as-a-service platform for protecting internet of things (IoT) edge devices. The new Micron® Authenta™ Key Management Service (KMS) platform enables a cloud-first deployment model for a broad set of industrial and automotive applications. It allows installed Authenta-enabled devices to be switched on through a cloud-based service, mitigating some of the biggest challenges and complexities related to securing devices in an “everything connected” environment.The number of connected IoT devices deployed across markets such as automotive, enterprise, industrial control and connected home is expected to grow from 23 billion in 2019 to 30 billion by 2020.1 Securing these diverse devices remains a concern for system OEMs who want a simple solution that is cost-effective and independent of their choice of system-on-a-chip (SoC) hardware. Authenta KMS, along with its hardware root of trust embedded in NAND and NOR flash devices, equips OEMs to safeguard device functionality at the silicon level.Current methods adopted by the industry for protecting connected devices have their limitations and typically center on one of three common practices: adding secure elements, which is costly and difficult to scale; leveraging secure key injection in the SoC, which creates a fragmented architecture; or simply doing nothing, which puts devices below market and compliance standards.“Securing a diverse set of IoT edge devices through the complete product lifecycle — from the supply chain to in-field management — requires a novel, simple, scalable and cost-effective approach,” said Amit Gattani, senior director of embedded segment marketing for Micron’s Embedded Business Unit. “Authenta KMS provides a trusted and unique silicon-to-cloud service for all ‘connected things’ using Authenta-enabled flash devices.”Micron’s Authenta KMS complements existing efforts to protect IoT networks through secure element functions in Authenta-enabled standard flash devices. Authenta KMS security-as-a-service platform allows installed secure flash devices to be activated and managed at the edge through a cloud-based service. This capability enables platform-hardening and device protection through the entire lifecycle, extending from the manufacturing supply chain to in-field installation and management.“The electronics industry needs to mitigate the growing security concerns from today's fragmented and vulnerable IoT supply chain,” said Tom Katsioulas, board member of the GSA Trusted Supply Chain working group and head of TrustChain operations at Mentor, a Siemens business. “We are pleased to see Micron's introduction of Authenta Key Management Service, which promises to provide a strong foundation of early provenance and traceability in the supply chain and in the enablement of trusted device services.”Authenta KMS and applicable software development kits are available to customers today. To learn more about how Micron Authenta and its security-as-a-service KMS platform can protect IoT devices, visit https://www.micron.com/products/advanced-solutions/authentaTo join us and our partners for a live security workshop on Tuesday, Nov. 5, in San Jose, California, register here.ResourcesBlog: https://www.micron.com/about/blog Twitter: https://twitter.com/MicronTechLinkedIn: https://www.linkedin.com/company/micron-technology/YouTube™: http://www.youtube.com/user/MicronTechnologyAbout Micron Technology, Inc.We are an industry leader in innovative memory and storage solutions. Through our global brands — Micron®, Crucial®, and Ballistix® — our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more about Micron Technology, Inc., visit micron.com.1.     Source: Statista 2019© 2019 Micron Technology, Inc. All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of Micron Technology, Inc. All other trademarks are the property of their respective owners."
    }
]