[
    {
        "title": "Maxim's Analog PAM4 Chipset Delivers DSP-Level Performance Without Cost, Power and Latency Barriers",
        "subtitle": "",
        "date": "Mar 5, 2020 8:30AM EST",
        "content": "SAN JOSE, Calif., March 5, 2020 /PRNewswire/ -- Manufacturers of advanced modules for hyperscale data center applications can reduce power, latency and cost with the industry's first analog PAM4 chipset to target full standards-based performance. PAM4 is a technically challenging coding scheme, especially for optical transmissions, caused by dramatic reduction in signal strength and new requirements for linearity. Technology demonstrations have been shared for many years; however, to date, real-world deployment has been negligible. While engineers are working towards implementing PAM4 using expensive 7nm DSP solutions, the 100G CWDM4 modules continue to be shipped in large volumes at a highly optimized price point. Given this backdrop, large-scale deployment of PAM4 modules will be gated by a few key considerations.\n                        \n                    \n                Can PAM4 technology deliver bandwidth at a lower cost and lower power than 100G CWDM4? Can it be produced in high volume with robust system performance?Maxim's 40G and 100G solutions have led the industry for many years. The 100G ramp was enabled by the introduction of a packaged 25Gbps quad laser driver and CDR that is surface-mounted on the PCB rather than mounted as a die inside the transmit optical sub-assembly. This technically challenging breakthrough has enabled high-volume production of 100G CWDM4. Around 10 million modules are now deployed in data centers around the world using this product. Now, Maxim has taken up the task of solving difficult analog challenges in order to also enable standards-based PAM4 modules with the lowest bill of materials (BOM).The first products in Maxim's PAM4 family target the 2km FR market and cover both IEEE and Open Eye applications. The transmitter IC includes four channels of electrical input equalizer, PAM4 clock and data recovery (CDR) and integrated externally modulated laser (EML) driver. The matching quad receiver includes integrated transimpedance amplifier (TIA), PAM4 CDR and electrical output driver. Avoiding the 7nm development costs of DSP removes the BOM cost barrier. Using a traditional transmitter and receiver architecture enables a quick ramp to volume using simple manufacturing techniques. The power consumption for a 200G module using the Maxim chipset is similar to that of a 100G CWDM4 module. Therefore, the cost, power and manufacturability barriers to adoption of PAM4 are resolved. However, this is only meaningful if the solution has robust technical performance. What does that mean? Showing post forward error correction (FEC) error-free operation with a fixed optical input, fixed temperature and days of lab adjustment may make for a good demo, but it does not prove that the technology is robust. Maxim has utilized a highly optimized signal chain and implemented advanced internal control loops to enable the Maxim receiver to match DSP-based receiver performance. It can operate with the lowest pre-FEC BER over the full range of optical input signals from either the matching transmitter or from DSP-based modules. A bonus of using an analog solution is that latency is reduced from hundreds of nanoseconds down to hundreds of picoseconds, which can be critical in some data center applications.Maxim's PAM4 chipset paves the road to $1/Gbps (200G QSFP56 2km FR), which is key to enabling adoption of 200G CWDM4 over 100G CWDM4. To recap, here are other key advantages of the chipset:Interested in getting more involved in this advanced PAM4 technology? Maxim is hiring technical experts for our optical team. Learn more at our Optical Career Opportunites page.  View original content to download multimedia:http://www.prnewswire.com/news-releases/maxims-analog-pam4-chipset-delivers-dsp-level-performance-without-cost-power-and-latency-barriers-301015854.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Industry's Smallest LiDAR ICs by Maxim Integrated Offer More Than 2x Higher Bandwidth for Faster Self-Driving Cars",
        "subtitle": "",
        "date": "Feb 25, 2020 9:00AM EST",
        "content": "SAN JOSE, Calif., Feb. 25, 2020 /PRNewswire/ -- Designers of automotive self-driving systems can now enable higher-speed autonomous driving through the industry's fastest and smallest Light Detection and Ranging (LiDAR) ICs from Maxim Integrated Products, Inc. (NASDAQ: MXIM). Compared to the closest competitive solution, the MAX40026 high-speed comparator and the MAX40660/MAX40661 high-bandwidth transimpedance amplifiers enable 10mph (15km/h) faster autonomous driving at highway speeds by providing more than 2x higher bandwidth and accommodating 32 additional channels (128 vs. 96) to a LiDAR module within the same module size. With automotive self-driving systems evolving from 35mph to 65mph and beyond, LiDAR sensors are playing an increasing role in the fusion of vehicle sensors for their ability to provide accurate distance measurement of objects. With more than twice the bandwidth and the ability to accommodate 33 percent more channels within the same LiDAR module size compared to the closest competitor, the MAX40660/MAX40661 transimpedance amplifiers (TIAs) provide optical receiver designers with higher-resolution images that enable faster autonomous driving systems. The system size of the MAX40026 high-speed comparator plus the MAX40660/MAX40661 TIAs is 5mm2 smaller than the closest competitive solution, which allows developers to fit far more channels into space-constrained vehicle platforms. These ICs meet the stringent safety requirements of the automotive industry with AEC-Q100 qualification, enhanced electrostatic discharge (ESD) performance and failure modes, effects and diagnostic analysis (FMEDA) to support ISO 26262 certification at the system level.Key AdvantagesCommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/industrys-smallest-lidar-ics-by-maxim-integrated-offer-more-than-2x-higher-bandwidth-for-faster-self-driving-cars-301010254.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim's ChipDNA PUF Key Protection Technology Enables Market's Most Secure IoT Microcontroller",
        "subtitle": "",
        "date": "Feb 25, 2020 9:00AM EST",
        "content": "SAN JOSE, Calif., Feb. 25, 2020 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ: MXIM) introduces the MAX32520 ChipDNATM secure Arm® Cortex®-M4 microcontroller, the first secure microcontroller with built-in physically unclonable function (PUF) technology for financial- and government-grade security. Maxim's PUF technology allows for multiple layers of protection to provide the most advanced key-protection technology in a cost-effective format for use in IoT, healthcare, industrial and computing systems.As IoT applications continue to proliferate, large numbers of devices are being deployed in uncontrolled and hostile areas that make them more vulnerable to physical attacks. These are more sophisticated than software threats like poor crypto implementations or default password attacks. Designers want enhanced system defenses for their mission-critical applications where exposing secret encryption keys can bring down networks, ruin reputations, end companies and even negatively affect people's lives. The MAX32520 with ChipDNA offers multiple layers of protection through its PUF technology, the industry's most advanced key-protection technology for safeguarding secrets used in cryptographic operations. It uses a tamper-proof PUF key for flash encryption, secure boot for root-of-trust and serial flash emulation. Additionally, the physical security inherent in the PUF key eliminates the need for a battery to actively destroy secret-key materials when under attack. Until now, the most-sensitive applications have always required a battery to provide this highest level of secret-key protection.Key AdvantagesCommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxims-chipdna-puf-key-protection-technology-enables-markets-most-secure-iot-microcontroller-301010032.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated Accelerates Innovation in Europe with $25M Investment for New Design Center in Dublin, Ireland",
        "subtitle": "",
        "date": "Feb 19, 2020 8:00AM EST",
        "content": "SAN JOSE, Calif. and DUBLIN, Feb. 19, 2020 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ: MXIM) today announced the opening of a new design center in Dublin, Ireland. The design center will focus on product development and conducting research and development in the areas of analog semiconductor design to deliver Maxim's innovative solutions across many end markets. To make this vision a reality, the company will recruit a strong team of mixed-signal and analog design engineers at this facility. The $25M investment will be primarily geared towards recruiting talent, equipment and building costs, as well as research and development. Located on the south side of Dublin, this is Maxim's seventh design center located in Europe. \"With our rich history and depth of talent, I'm thrilled that Maxim Integrated has chosen Dublin for this important investment,\" said John Kirwan, vice president of Global Customer Operations at Maxim Integrated. \"We encourage collaboration between employees representing a wealth of diverse, global experiences, from recent graduates of local universities to veteran designers who have been in the industry for many years.\"\"Maxim's innovative IC designers create products that truly excite their design engineering customers and change everyday lives,\" said David Dwelley, chief technology officer at Maxim Integrated. \"With this new facility, we plan to reinvent the way we develop technology and push innovation even further, giving our customers the products they need to succeed.\"\"I am delighted that Maxim Integrated has chosen to establish their new design center in Ireland,\" said Martin Shanahan, CEO of IDA Ireland. \"Tech talent and investment are integral to the country's continued growth, and this investment will enhance the technology offering in the engineering and design space in Ireland. I wish the company every success and offer the continued support of IDA Ireland in the future.\"About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-accelerates-innovation-in-europe-with-25m-investment-for-new-design-center-in-dublin-ireland-301007002.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated Inspires Embedded Innovations at embedded world 2020",
        "subtitle": "",
        "date": "Feb 5, 2020 9:00AM EST",
        "content": "SAN JOSE, Calif. and MUNICH, Feb. 5, 2020 /PRNewswire/ -- At the embedded world 2020 Exhibition and Conference in Nuremberg, Germany (Feb. 25-27, 2020), Maxim Integrated Products, Inc. (NASDAQ: MXIM) will demonstrate how it is inspiring embedded innovations by showcasing its latest leading-edge analog technology for automotive, healthcare, industrial and security applications. Maxim will have demos as well as experts available to discuss ways to enhance designs with these innovative technologies.Visitors can register at http://bit.ly/Maxim_giveaway_ew2020 for a chance to take home a MAXAUTHDEMO DeepCover® secure authenticator demonstration kit, a featherboard featuring a low-power micro with ChipDNA™ physically unclonable function (PUF) technology, or an Essential Analog Toolkit containing a collection of Maxim's high-performance, analog building block products. Please bring a printed copy of the registration form to the Maxim demo stand to claim a board. Maxim will showcase demos in a variety of end markets:Demos at Maxim's Booth (Hall 4A, Stand 606)Maxim will also showcase its demos at the booths of two of its distribution partners, Avnet Silica and EBV:Demos at Avnet Silica's Booth (Hall 3A, Stand 221)Demos at EBV's Booth (Hall 3A, Stand 221)Maxim Speaking Sessions and WorkshopsAll trademarks are the property of their respective owners.About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-inspires-embedded-innovations-at-embedded-world-2020-300999085.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Highlights Techniques to Derive Reliable Sensor Data from Healthcare Wearables",
        "subtitle": "",
        "date": "Jan 22, 2020 9:15AM EST",
        "content": "SAN JOSE, Calif., Jan. 22, 2020 /PRNewswire/ -- Getting reliable sensor data from wearables is complex, yet critical in order for users to trust the efficacy of their health trackers. Consider, as an example, an optical heart-rate sensor, which is actually sensing the changes in an electric current. Heartbeats cause the volume of arterial blood to change synchronously with each pulse. The change in volume changes the amount of light absorbed and reflected as it travels through live tissue. When that light exits the tissue and enters a photodetector, it changes the output current. By creating a sensing system that carefully sets up a proper series of \"dominos,\" a current sensor becomes a heart-rate sensor.This is how most sensors work. Sensors generally make esoteric electrical measurements (capacitance, impedance, current, voltage). But through an elaborate system construct, a physical event of interest (acceleration, pressure, footsteps, distance) is made to change that measurement. Knowing the system construct, we could then interpret the change into a physical parameter, all the while assuming everything else in the sensing system stays constant or at least is well controlled. But what if the dominos aren't all under the designer's control?Optical Path of Light The path that light travels from the source (emitter) to the detector (receiver) is known as the optical path. This path spans across one or more media and any change in those media could interact and affect the light characteristics at the detector. As such, the received light encapsulates all changes in the media along the entire optical path.For an optical heart-rate sensor, light comes from one or more LEDs and is aimed at live tissue. Before arriving at the tissue, the light has to travel through air and sometimes a layer of cover glass. Air, cover glass, and the surface of the tissue are three different optical media. Similarly, the tissue is not homogenous and could be modeled as successive layers of optical media with different refractive indices. At the interface of any two media with different optical properties, light could be absorbed (attenuated), reflected (scattered) into the first medium, or transmitted into the second medium. Heart-rate sensing works because one of these media, the capillaries, changes volume over time synchronous to heart rate. The change affects the amount of light absorbed and reflected. Optical system design must make sure that the path most light takes to go from the LED to the photodetector also interacts with the capillaries. Data reliability is compromised when light can reach the photodetector without interacting with the capillaries or when something along the optical path changes unexpectedly. Light-Attenuating Factors Outside the Designer's ControlDirt and grime on the cover glass, hair, skin pigment, and color changes of the cover glass are all factors outside of a designer's control. Each medium serves to attenuate light passing through it, in both directions, and each may affect some wavelength of light more than others.For heart-rate sensing, the important information is carried in the periodicity and not the overall amplitude of the signal. So, as long as the emitter is strong enough, some attenuation should not result in any loss of information. However, if the sensing configuration uses more than one LED or multiple wavelengths, it is possible that light intensity for each LED and/or wavelength would not be affected by the same proportion.The air gap, or the distance between the skin surface and the optical components, is also outside of a designer's control and can impact the reliability of sensor data. Now, in many wearable applications, water (in the form of, say, sweat or rain) could be present in the \"air gap.\" The resulting combinations and variations are numerous, but we could consider some generalities. When the sensing target is live tissue, which is mostly comprised of water, having water in the air gap actually narrows the difference in refractive index between the air gap and the target. This should allow a proportionately greater amount of light to be transmitted into the tissue, strengthening the sensing mechanism.Maximizing Signal Path PerformanceWith everything that could affect the optical signal, it becomes increasingly important that the part of the optical data path that is under the designer's control gives the best signal-to-noise performance. A high-performance design makes discerning the reliability of the sensor data easier.For example, any light which makes its way to the photodetector but did not enter the target tissue, not just the light emitted from the LED source, adds to the noise of the biosensing signal. Some integrated analog front-end (AFE) devices, like the MAX86140 and the MAX86171, sample any ambient current on the photodetector asynchronous to the LED light source and subtract them from the photodetector current. Indeed these AFEs even anticipate how ambient light conditions could change in typical use cases so that designers can trust that their effects will have little impact on the biosensing signals.To learn more about the key considerations affecting reliability of sensor data, read this article from Maxim's Ian Chen: \"Getting to Reliable Sensor Data: Interaction Between Electronics, Optics, and Mechanic Design.\"  View original content:http://www.prnewswire.com/news-releases/maxim-highlights-techniques-to-derive-reliable-sensor-data-from-healthcare-wearables-300987909.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated Files Patent Infringement Lawsuit Against Monolithic Power Systems",
        "subtitle": "",
        "date": "Jan 7, 2020 6:35PM EST",
        "content": "SAN JOSE, Calif., Jan. 7, 2020 /PRNewswire/ -- Volterra Semiconductor LLC (\"Volterra\"), a wholly owned subsidiary of Maxim Integrated Products, Inc. (\"Maxim\") (NASDAQ: MXIM), today announced that it has filed a complaint in the U.S. District Court for the District of Delaware against Monolithic Power Systems, Inc. (\"MPS\"). The complaint asserts that MPS DC-to-DC power converter products infringe multiple Volterra patents related to coupled inductor technology, including U.S. patent numbers 6,362,986, 7,525,408 and 7,772,955. Volterra is seeking damages from MPS and an order prohibiting MPS from selling the infringing products.      For many years, Volterra has been at the forefront in the design and development of silicon solutions for low-voltage power delivery. The company's product portfolio, both prior to acquisition and as part of Maxim, includes advanced switching regulators for the computer, datacom, storage and portable markets. Volterra has consistently focused on creating products with high intellectual property content that match specific customer needs. The company has been an industry leader in high-current, high-performance and high-density power converter solutions, and has developed highly integrated products primarily for the enterprise, cloud computing, communications and networking markets.  By leveraging these Volterra solutions, Maxim's portfolio of products offers better performance, smaller form factors, enhanced scalability, improved system management and lower total cost of ownership. Many electronics manufacturers and their suppliers have incorporated Maxim's products into their systems to ensure high-performance power management. \"Maxim acquired Volterra in order to offer best-in-class technology and has made significant investments in that area,\" said Achyut Shah, Maxim's vice president of the Cloud and Data Center Business Unit. \"Maxim highly values this investment and is taking action to protect its legally recognized patent rights. Maxim will not permit companies, such as MPS, to engage in the unauthorized use of its patented technology.\"About Maxim IntegratedMaxim develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at http://www.maximintegrated.com.Maxim Investor Relations Contact:Kathy Ta408-601-5697 Kathy.Ta@maximintegrated.com Maxim Media Contact:  Ferda Millan408-601-5429 Ferda.Millan@maximintegrated.com View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-files-patent-infringement-lawsuit-against-monolithic-power-systems-300978560.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Shrink Power and Communication Footprint by Up to 80 Percent in True Wireless Earbuds",
        "subtitle": "MAX20340 reduces form factor and cost while improving reliability by enabling simultaneous charging and communication over a single contact",
        "date": "Jan 7, 2020 9:00AM EST",
        "content": " SAN JOSE, Calif., Jan. 7, 2020 /PRNewswire/ -- Designers of ultra-low-power portables and wearables can shrink the size of a power and communication interface to the charging dock by up to 80 percent with the MAX20340, the industry's smallest 2-pin bi-directional DC powerline communications (PLC) device from Maxim Integrated Products, Inc. (NASDAQ: MXIM). With power and communication on a single line, the MAX20340 eliminates pins and discrete devices needed to communicate between a charging dock and a low-voltage end product such as true wireless earbuds, rings and other small wearables. This simplifies the design process and saves up to 13mm2 per earbud compared to the closest competitive solution. Customers are demanding smaller consumer products, especially for wearables, for comfort and convenience in their daily lives. This ultra-small PLC chip minimizes the number of mechanical contact points for the charging and communication interface, which reduces cost, limits points of failure and increases reliability. In addition, the MAX20340 incorporates automatic presence detection, enabling flexible design and eliminating unreliable and costly alternative methods such as mechanical pogo pins or hall effect sensors. The device is configured as either a communication master or slave by a single external resistor. Multiple modes of operation offer designers the opportunity to minimize power consumption based on their application needs. Finally, the communication protocol is as simple as reading and writing via I2C with the MAX20340 managing all communication across the interface.Key AdvantagesCommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/shrink-power-and-communication-footprint-by-up-to-80-percent-in-true-wireless-earbuds-300981006.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Automotive Display Power Management IC Shrinks Solution Size Up to 50 Percent and Reduces Design Complexity",
        "subtitle": "Highly integrated power solution enables OEMs to increase the number of electronic screens per vehicle",
        "date": "Jan 6, 2020 9:00AM EST",
        "content": " SAN JOSE, Calif., Jan. 6, 2020 /PRNewswire/ -- Designers of automotive electronic systems can now increase the number of displays per vehicle while reducing design complexity by using the MAX16923 4-output display power IC with watchdog timer from Maxim Integrated Products, Inc. (NASDAQ: MXIM). By replacing four or five discrete ICs with a single power management solution, the MAX16923 significantly shrinks solution size and makes it easier for automotive designers to increase the number of displays  from two to five per vehicle, or even more.The number of automotive displays per vehicle continues to grow as OEMs seek to make cars more attractive with advanced instrument clusters, infotainment, heads-up displays, center displays, rear-seat entertainment and smart mirror applications. Designers struggle with the complexity of adding these screens because the required power supply circuitry competes for space with a myriad of other electronic systems inside the car.The MAX16923 offers high integration with four power rails, featuring both a high-voltage and low-voltage buck converter, a high-voltage and low-voltage low-dropout (LDO) regulator, electromagnetic interference (EMI) mitigation and a watchdog timer in a single IC. Its high level of integration can reduce an automotive power solution from four or five ICs down to one chip, without making the temperature rise significantly. This also helps ease design complexity and reduces the power solution size up to 50 percent compared to the closest competitive solution. Additionally, EMI mitigation and the watchdog timer improve reliability of each display. Key AdvantagesCommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-automotive-display-power-management-ic-shrinks-solution-size-up-to-50-percent-and-reduces-design-complexity-300980964.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated To Announce Fiscal Second Quarter 2020 Results",
        "subtitle": "",
        "date": "Jan 2, 2020 4:03PM EST",
        "content": "SAN JOSE, Calif., Jan. 2, 2020 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ: MXIM) will announce fiscal second quarter 2020 results after market close on Tuesday, January 28, 2020. The full release will be available at investor.maximintegrated.com.The conference call and live webcast will be held at 2:00 p.m. Pacific Time, which may be accessed at investor.maximintegrated.com. A replay of the webcast will be available at the same location, beginning at 6:00 p.m. Pacific Time on January 28.About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at http://www.maximintegrated.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-to-announce-fiscal-second-quarter-2020-results-300980642.htmlSOURCE  Maxim Integrated Investor Relations"
    },
    {
        "title": "Maxim's Isolated Silicon Carbide Gate Driver Provides Best-in-Class Power Efficiency and Increased System Uptime",
        "subtitle": "MAX22701E reduces overall system energy loss by 30 percent and improves system uptime with up to 3x higher CMTI performance",
        "date": "Dec 17, 2019 9:00AM EST",
        "content": " SAN JOSE, Calif., Dec. 17, 2019 /PRNewswire/ -- With the MAX22701E isolated gate driver from Maxim Integrated Products, Inc. (NASDAQ: MXIM), designers of high-voltage/high-power systems can improve power supply efficiency by up to 4 percentage points over competitive solutions, reducing power loss and the resulting carbon footprint by 30 percent. The driver IC is intended for use in switch-mode power supplies within industrial communication systems for solar power inverters, motor drives, electric cars, energy storage systems, uninterrupted power supplies, data farms and high-power/high-efficiency power supplies.Many switch-mode power supply applications are adopting wide-bandgap silicon carbide (SiC) transistors to improve power efficiency and transistor reliability. However, the high switching frequency incurs transients that generate noise, which either disrupts operations or requires extensive mitigation. The MAX22701E offers the industry's highest common-mode transient immunity (CMTI) of 300kV/µs typical to deliver industry-leading reliability. CMTI is up to 3x higher than the closest competitor, which results in increased system uptime. Best-in-class driver propagation specs (35ns typical which is 2x lower propagation delay than the closest competitor) and propagation delay matching between the high-side and low-side gate drivers (5ns maximum which is 5x lower than the closest competitor) helps to reduce the transistor's dead time. This, in turn, improves power efficiency up to 4 percentage points. In the 90 percent efficiency range, every 1 percentage point in efficiency results in about a 10 percent improvement in power loss. For example, improving efficiency from 90 to 94 percent results in an approximately 30 to 40 percent reduction in wasted power (6 versus 10 points of wasted power.) The MAX22701E is available in an 8-pin narrow body SOIC package (3.90mm x 4.90mm) with an extended temperature range of -40-degree to +125-degree Celsius.Key AdvantagesCommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxims-isolated-silicon-carbide-gate-driver-provides-best-in-class-power-efficiency-and-increased-system-uptime-300975674.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 22, 2019 4:04PM EST",
        "content": "SAN JOSE, Calif., Nov. 22, 2019 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ:MXIM) announced today that Tunç Doluca, Chief Executive Officer and Brian White, Chief Financial Officer will be presenting at the Credit Suisse 23rd Annual Technology Conference in Scottsdale, AZ. The presentation is scheduled to begin at 3:30 p.m. Mountain Time/5:30 p.m. Eastern Time on Tuesday, December 3, 2019. Interested parties can listen to a live audio webcast at http://investor.maximintegrated.com/CreditSuisseTech2019. A replay of the audio webcast will be available for 180 days at the same location.The company also announced that Brian White, Chief Financial Officer will be presenting at the Barclays 2019 Global Technology, Media and Telecommunications Conference in San Francisco. The presentation is scheduled to begin at 1:30 p.m. Pacific Time/4:30 p.m. Eastern Time on Wednesday, December 11, 2019. Interested parties can listen to a live audio webcast at https://investor.maximintegrated.com/home/Barclays2019. A replay of the audio webcast will be available for 180 days at the same location.Lastly, the company announced that Brian White, Chief Financial Officer and Randall Wollschlager, Vice President and General Manager of Maxim's Automotive Business Unit will be presenting at the J.P. Morgan 18th Annual Tech/Auto Forum at CES in Las Vegas. The presentation is scheduled to begin at 9:55 a.m. Pacific Time/12:55 p.m. Eastern Time on Tuesday, January 7, 2020. Interested parties can listen to a live audio webcast at https://investor.maximintegrated.com/home/JPMorganTechAuto2020. A replay of the audio webcast will be available for 180 days at the same location.About Maxim Integrated Maxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at http://www.maximintegrated.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-to-present-at-upcoming-investor-conferences-300963996.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Unveils Cuffless Blood-Pressure Measurement Solution Meeting Class-II Regulatory Accuracy Limits",
        "subtitle": "MAXREFDES220# reference design enables convenient optical blood-pressure monitoring without requiring bulky, expensive mechanical cuffs",
        "date": "Nov 20, 2019 9:00AM EST",
        "content": " SAN JOSE, Calif., Nov. 20, 2019 /PRNewswire/ -- Until now, accurate blood-pressure monitoring could only be achieved with bulky and mechanical cuff-based medical devices. Now, Maxim Integrated Products, Inc. (NASDAQ: MXIM) has introduced a solid-state blood-pressure monitoring solution to more conveniently track this critical health indicator. Design engineers can develop blood-pressure trending solutions with the MAXREFDES220# reference design from Maxim. Comprised of a complete integrated optical sensor module, a microcontroller sensor hub and a sensing algorithm, the MAXREFDES220# optical blood-pressure trending solution can be embedded into smartphones or wearables. It enables users to place their finger on a device for 30-45 seconds while resting to measure blood pressure anywhere and anytime. The reference design includes the MAX30101 or MAX30102 high-sensitivity optical sensor, as well as the MAX32664D sensor hub IC with built-in algorithms. The MAX30101 (using two LEDs) and MAX30102 (using three LEDs) pulse-oximeter and heart-rate optical sensor modules combine photodetectors, LEDs and analog front-end (AFE) electronics with an integrated cover glass. This integrated optical design and lenses-on-top approach enables optimal signal-to-noise ratio (SNR) for a small, lower cost and power-efficient module. It comes in a tiny 5.6mm x 3.3mm 14-pin optical package with an I2C interface to the sensor hub IC.The MAX32664D sensor hub IC includes firmware which controls the sensor and executes the algorithms which measure cuffless blood pressure, heart rate and blood-oxygen levels. Its ultra-small size (1.6mm x 1.6mm) can easily fit into small devices to seamlessly and effortlessly connect to a device's host microcontroller. The MAXREFDES220# provides industry-best accuracy that meets Class-II regulatory limits. For example, under resting-only measurement conditions, the solution provides the following accuracies:This solution requires calibration every four weeks to maintain above accuracies. This is based on independent testing and a limited number of subjects at resting condition.Key AdvantagesCommentaryAvailability and PricingMaxim develops innovative analog and mixed-signal ICs as components for medical or wellness devices. The company's ICs are components, not finished goods. Maxim's reference designs are only for research, development and initial guidance for Maxim's customers who make medical devices and other products, and obtain the required licenses and regulatory approvals. None of Maxim's products and reference designs are intended or licensed for diagnostic, medical treatment or other healthcare usage.About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-unveils-cuffless-blood-pressure-measurement-solution-meeting-class-ii-regulatory-accuracy-limits-300960328.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "New Products in Essential Analog Portfolio by Maxim Shatter Industry Benchmarks in Power, Solution Size and Accuracy",
        "subtitle": "MAX6078A, MAX16155 and MAX16160 deliver precision measurement and reliable protection for consumer, communications, industrial and medical applications",
        "date": "Nov 1, 2019 6:00AM EDT",
        "content": "SAN JOSE, Calif., Nov. 1, 2019 /PRNewswire/ -- Designers can further reduce power consumption and solution size, while improving measurement accuracy, with three new industry-leading analog products from Maxim Integrated Products, Inc. (NASDAQ: MXIM). The MAX6078A voltage reference IC, the MAX16155 nanoPower supervisor and the MAX16160 voltage monitor and reset IC achieve best-in-class performance for cloud infrastructure, IoT, intelligence-at-the-edge, on-device AI, as well as smart and emerging applications in consumer, communications, industrial and medical markets. As designers develop new and next-generation systems for greater performance, smaller size and innovative capabilities, they demand reliable analog solutions to provide essential performance functions such as precision measurement and reliable protection. Maxim leverages world-class circuit design expertise and unique advanced process technology to provide high-quality building block ICs that support system advances in multiple applications. Maxim has added three new solutions to its Essential Analog portfolio of high-performance, single-function analog ICs which provide efficient power, precision measurement, rugged connectivity and reliable protection. Maxim's New Solutions in Essential Analog Portfolio:CommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/new-products-in-essential-analog-portfolio-by-maxim-shatter-industry-benchmarks-in-power-solution-size-and-accuracy-300949614.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Provides Industry's First and Only Automotive-Grade Secure Authenticator to Enhance Vehicle Safety",
        "subtitle": "DS28C40 improves automotive reliability and data integrity by verifying genuine component use in ADAS, EV batteries and other electronic systems",
        "date": "Oct 31, 2019 6:00AM EDT",
        "content": "SAN JOSE, Calif., Oct. 31, 2019 /PRNewswire/ -- Designers can now enhance safety, security and data integrity for connected vehicle systems while also reducing both complexity and code development time with the DS28C40 DeepCover® automotive secure authenticator from Maxim Integrated Products, Inc. (NASDAQ: MXIM). As the industry's first and only AEC-Q100 Grade 1 solution for automotive systems, this authenticator IC reduces the design complexity and software vulnerability of current approaches to ensure only genuine components are used for many electronic systems, such as advanced driver assistance systems (ADAS) and electric vehicle (EV) batteries.As cars become more sophisticated with the features they offer, safety and security risks grow as well. Automotive manufacturers use authentication to ensure only OEM-certified components are safely connected to vehicle systems, as well as reduce the growing threat of malware attacks. However, full-blown secure microcontrollers usually have a relatively big footprint and require software development teams to create, rigorously test and debug their code. The bigger the code base is, the higher the risk of bugs or malware adversely affecting performance.The DS28C40 DeepCover authenticator is the only authenticator that meets the AEC-Q100 standard with Grade 1 performance. It replaces microcontroller-based approaches and reduces both system design complexity and associated code development efforts. The authenticator deters theft of high-value components such as front-light modules. It also offers public/private key asymmetric ECDSA (ECC-P256 curve) and other key authentication algorithms built into the IC, allowing OEMs to skip development of proprietary device-level code. This and other algorithms in the authenticator IC provide the strongest defense against unauthorized components that could compromise performance, safety and data integrity. The DS28C40 comes in a compact, 4mm-x-3mm TDFN package and operates over the -40-degree to +125-degree Celsius temperature range. Key AdvantagesCommentaryAvailability and PricingAll trademarks are the property of their respective owners.About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-provides-industrys-first-and-only-automotive-grade-secure-authenticator-to-enhance-vehicle-safety-300939235.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated Reports Results For The First Quarter Of Fiscal 2020",
        "subtitle": "- Revenue: $533 million",
        "date": "Oct 29, 2019 4:03PM EDT",
        "content": "SAN JOSE, Calif., Oct. 29, 2019 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ:MXIM) reported net revenue of $533 million for its first quarter of fiscal 2020 ended September 28, 2019, a 4% decrease from the $557 million revenue recorded in the prior quarter, and a 17% decrease from the same quarter of last year. \"Our September quarter results met our expectations, while also maintaining lean inventory levels,\" said Tunc Doluca, President and Chief Executive Officer. \"Looking forward to the December quarter, we expect sequential growth in Communications and Data Center, Automotive and Industrial, partially offset by smartphone-related headwinds and holiday seasonality in Consumer.\"Fiscal Year 2020 First Quarter Results Based on Generally Accepted Accounting Principles (GAAP), diluted earnings per share in the September quarter was $0.51. The results were affected by $5 million in pre-tax special items which primarily consisted of charges related to acquisitions. GAAP earnings per share, excluding special items was $0.52. An analysis of GAAP versus GAAP excluding special items is provided in this press release. Cash Flow Items At the end of the first quarter of fiscal 2020, total cash, cash equivalents and short-term investments were $1.8 billion, down $105 million from the prior quarter. Notable items included:Trailing twelve months free cash flow was $725 million. Free cash flow is a non-GAAP measure and is defined by cash flow from operations less capital expenditures.Business Outlook The Company's 90-day backlog at the beginning of the December 2019 quarter was $402 million. Based on the beginning backlog and expected turns, our results for the December 2019 quarter are forecasted to be as follows: Maxim Integrated's business outlook does not include the potential impact of any special items related to restructuring activity, acquisitions, or other business combinations that may be completed during the quarter.Dividend A cash dividend of $0.48 per share will be paid on December 13, 2019, to stockholders of record on November 27, 2019. Conference Call Maxim Integrated has scheduled a conference call on October 29 at 2:00 p.m. Pacific Time to discuss its financial results for the first quarter of fiscal 2020 and its business outlook. This call will be webcast by Shareholder.com and can be accessed at the Company's website at investor.maximintegrated.com. A presentation summarizing financial information to be discussed on the conference call is posted at investor.maximintegrated.com.    Non-GAAP Measures To supplement the consolidated financial results prepared under GAAP, Maxim Integrated uses non-GAAP measures which are adjusted from the most directly comparable GAAP results to exclude special items related to intangible asset amortization; severance and restructuring; other operating expenses (income), net; interest and other expense (income), net; and other income tax effects and adjustments. We defined free cash flow as net cash provided from operations less gross capital expenditures. Management uses these non-GAAP measures internally to make strategic decisions, forecast future results and evaluate Maxim Integrated's current performance. Many analysts covering Maxim Integrated use the non-GAAP measures as well. Given management's use of these non-GAAP measures, Maxim Integrated believes these measures are important to investors in understanding Maxim Integrated's current and future operating results as seen through the eyes of management. In addition, management believes these non-GAAP measures are useful to investors in enabling them to better assess changes in Maxim Integrated's core business across different time periods. These non-GAAP measures are not in accordance with or an alternative to GAAP financial data and may be different from non-GAAP measures used by other companies. Because non-GAAP financial measures are not standardized it may not be possible to compare these financial measures with other companies' non-GAAP financial measures, even if they have similar names. The non-GAAP measures displayed in the table above include the following:GAAP Gross Profit Excluding Special Items The use of GAAP gross profit excluding special items allows management to evaluate the gross margin of the Company's core businesses and trends across different reporting periods on a consistent basis, independent of special items including intangible asset amortization. In addition, it is an important component of management's internal performance measurement and reward process as it is used to assess the current and historical financial results of the business, for strategic decision making, preparing budgets and forecasting future results. Management presents GAAP gross profit excluding special items to enable investors and analysts to evaluate our revenue generation performance relative to the direct costs of revenue of Maxim Integrated's core businesses.GAAP Operating Expenses Excluding Special Items The use of GAAP operating expenses excluding special items allows management to evaluate the operating expenses of the Company's core businesses and trends across different reporting periods on a consistent basis, independent of special items including intangible asset amortization; severance and restructuring, and other operating expenses (income), net. In addition, it is an important component of management's internal performance measurement and reward process as it is used to assess the current and historical financial results of the business, for strategic decision making, preparing budgets and forecasting future results. Management presents GAAP operating expenses excluding special items to enable investors and analysts to evaluate our core business and its direct operating expenses.GAAP Provision for Income Taxes Excluding Special Items The use of a GAAP provision for income taxes excluding special items allows management to evaluate the provision for income taxes across different reporting periods on a consistent basis, independent of special items.  Special items include the tax impact of pre-tax special items, significant tax audit settlements, significant prior year tax reserve adjustments, significant tax legislation, and significant non-recurring and period specific tax items, which vary in size and frequency.GAAP Net Income and GAAP Net Income per Share Excluding Special Items The use of GAAP net income and GAAP net income per share excluding special items allow management to evaluate the operating results of Maxim Integrated's core businesses and trends across different reporting periods on a consistent basis, independent of special items including intangible asset amortization; severance and restructuring; other operating expenses (income), net; interest and other expense (income), net; and other income tax effects and adjustments. In addition, they are important components of management's internal performance measurement and reward process as it is used to assess the current and historical financial results of the business, for strategic decision making, preparing budgets and forecasting future results. Management presents GAAP net income and GAAP net income per share excluding special items to enable investors and analysts to understand the results of operations of Maxim Integrated's core businesses and to compare our results of operations on a more consistent basis against that of other companies in our industry.\"Safe Harbor\" Statement This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements include the Company's business outlook and financial projections for its second quarter of fiscal 2020 ending December 2019, which includes revenue, gross margin and earnings per share, as well as the Company's expectation of sequential growth in the second fiscal quarter in Communications and Data Center, Automotive and Industrial, partially offset by smartphone-related headwinds and holiday seasonality in Consumer.  These statements involve risk and uncertainty. Actual results could differ materially from those forecasted, based upon, among other things, general market and economic conditions, market developments that could adversely affect the growth of the mixed-signal analog market, product mix shifts, the loss of all or a substantial portion of our sales to one or more of our large customers, customer cancellations and price competition, as well as other risks described in the Company's Annual Report on Form 10-K for the fiscal year ended June 29, 2019 (the \"Form 10-K\"). The Form 10-K may be found at https://www.sec.gov/Archives/edgar/data/743316/000074331619000024/0000743316-19-000024-index.htm.All forward-looking statements included in this news release are made as of the date hereof and based on the information available to the Company as of the date hereof. The Company assumes no obligation to update any forward-looking statement except as required by law.About Maxim Integrated Maxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer, and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at http://www.maximintegrated.com.Contact Kathy Ta Vice President, Investor Relations  (408) 601-5697 View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-reports-results-for-the-first-quarter-of-fiscal-2020-300947517.htmlSOURCE  Maxim Integrated Investor Relations"
    },
    {
        "title": "Maxim's Battery Monitor IC is the Industry's Only Single-Chip ASIL-D-Compliant IC for Mid-to-Large Cell Count Configurations",
        "subtitle": "The MAX17853 leverages the same board for multiple pack sizes, cutting design time by up to 50 percent for automotive applications",
        "date": "Oct 16, 2019 9:00AM EDT",
        "content": "SAN JOSE, Calif., Oct. 16, 2019 /PRNewswire/ -- Designers can now achieve ASIL-D compliance for automotive applications using just a single chip for a safer, more cost-effective battery management system with the MAX17853 battery monitor IC from Maxim Integrated Products, Inc. (NASDAQ: MXIM). Targeting mid-to-large cell count configurations for automotive applications, such as battery packs for electric and hybrid vehicles, MAX17853's unique flexible architecture called Flexpack allows customers to rapidly make changes to their module configurations to quickly respond to market demands.Achieving safety compliance in automotive applications can require adding redundant components to the system. The MAX17853 is the only ASIL-D-compliant IC for mid-to-large cell count configurations, enabling customers to create a system that meets the highest level of safety for voltage, temperature and communication. Also contributing to higher safety is the device's advanced battery cell balancing system, which automatically balances each cell by time and voltage to minimize risk of overcharging. Customers can achieve all this without adding extra components such as redundant comparators to help achieve smaller form factors. In addition, the MAX17853 reduces system BOM cost by up to 35 percent compared to competitive solutions to allow the customer to achieve lower overall cost for their BMS solution. Flexibility is also important as engineers typically must design and qualify separate boards and bills of materials (BOMs) for each different module configuration. The MAX17853 is the industry's only IC supporting multiple channel configurations (8 to 14 cells) with one board. This enables customers to reduce design time by up to 50 percent through reduced validation and qualification time. For example, customers cut their development time and qualification efforts in half by using the same board for 8s and 14s modules. Key AdvantagesCommentaryAvailability and PricingAbout Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/maxims-battery-monitor-ic-is-the-industrys-only-single-chip-asil-d-compliant-ic-for-mid-to-large-cell-count-configurations-300939234.htmlSOURCE  Maxim Integrated Products, Inc."
    },
    {
        "title": "Maxim Integrated To Announce Fiscal First Quarter 2020 Results",
        "subtitle": "",
        "date": "Oct 3, 2019 4:05PM EDT",
        "content": "SAN JOSE, Calif., Oct. 3, 2019 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ: MXIM) will announce fiscal first quarter 2020 results after market close on Tuesday, October 29, 2019. The full release will be available at investor.maximintegrated.com.The conference call and live webcast will be held at 2:00 p.m. Pacific Time, which may be accessed at investor.maximintegrated.com. A replay of the webcast will be available at the same location, beginning at 6:00 p.m. Pacific Time on October 29.About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at http://www.maximintegrated.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-integrated-to-announce-fiscal-first-quarter-2020-results-300930913.htmlSOURCE  Maxim Integrated Investor Relations"
    },
    {
        "title": "Jon Imperato Appointed as Maxim's Vice President of Worldwide Sales and Marketing",
        "subtitle": "",
        "date": "Oct 3, 2019 9:00AM EDT",
        "content": "SAN JOSE, Calif., Oct. 3, 2019 /PRNewswire/ -- Maxim Integrated Products, Inc. (NASDAQ: MXIM) today announced it has promoted Jon Imperato to Maxim's vice president of worldwide sales and marketing, effective immediately. In this role, he will be responsible for the company's customer-facing organizations, which include Sales, Customer Operations, Field Applications Engineering, Distribution and Marketing. Most recently, Mr. Imperato was the head of North America Sales at Maxim.\"Jon has an excellent history of sales execution, as well as a proven ability to run a large, successful organization and contribute to top-line growth,\" said Tunç Doluca, president and chief executive officer at Maxim Integrated. \"This, coupled with his deep knowledge of Maxim products, markets and customers, makes him an ideal fit for this leadership role.\" Mr. Imperato has over 20 years of sales experience in the semiconductor industry. His career at Maxim spans roles including sales director for Maxim's large customers and head of North America Sales where he led sales for both direct and distribution channel customers. Mr. Imperato earned his bachelor's degree in Business Administration from Texas Christian University. About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at http://www.maximintegrated.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/jon-imperato-appointed-as-maxims-vice-president-of-worldwide-sales-and-marketing-300930085.htmlSOURCE  Maxim Integrated Investor Relations"
    },
    {
        "title": "Maxim Power Management Solution Sets Industry's Standard with Highest Efficiency of 96% and Lowest Quiescent Current of 6µA to Boost Runtime of Portable Devices",
        "subtitle": "",
        "date": "Oct 2, 2019 9:00AM EDT",
        "content": "MAX77827 1.5A buck-boost converter extends battery life and provides 81% IQ improvement compared to competitor, while enabling system stabilitySAN JOSE, Calif., Oct. 2, 2019 /PRNewswire/ -- With the lowest quiescent current (IQ) in its class of 6µA, as well as the highest peak efficiency of 96 percent in the market, designers can now maximize a portable device's battery life with the MAX77827 buck-boost converter from Maxim Integrated Products, Inc. (NASDAQ: MXIM). This 1.5A high-efficiency, compact converter allows 1.8V to 5.5V input and 2.3V to 5.3V output, while providing the system stability needed to minimize abrupt or unexpected shutdowns. The MAX77827 addresses the power requirements of low-power wide-area network (LPWAN) applications, asset tracking devices and many internet of things (IoT) applications.The growing lithium-ion battery market is largely driven by an increasing inclination towards smart electronic devices with expanding functionalities packed within. Primary cell batteries based on Lithium Thionyl Chloride (Li-SOCl2) chemistry or dual-cell Alkaline (AA or AAA) with operations as low as 1.8V is also gaining popularity in the long-life portable market segment. However, regardless of the types of batteries used, these devices will discharge through a wide range of voltages while sustaining a power rail between 2.8V to 3.8V, specifically for powering MCU, Wi-Fi, BLE and GPS features. The traditional buck or bypass boost plus low dropout (LDO) topologies are not ideal solutions for these sophisticated devices because they are not the most efficient at prolonging battery life. Additionally, a simple buck converter topology may cause earlier system shutdown when battery voltage is high to maintain the required power for the aforementioned applications, leaving underutilized battery capacity.With the lowest quiescent current in the market, highest efficiency gains and small solution size, the MAX77827 buck-boost converter sets the standard for maximizing battery life. It is an ideal solution to support applications with low power requirements because, regardless of the battery voltage variations, it can automatically transition between buck and boost modes to provide a consistent output power supply. Compared with the current means of utilizing a bypass boost converter followed by an LDO, the MAX77827 improves efficiency by up to 12 percent. Compared with utilizing a buck converter, it allows continuous system operation with lower voltage from the battery to further utilize the battery capacity. The MAX77827 is the latest buck-boost converter in Maxim's portfolio.Key AdvantagesCommentaryAvailability and Pricing: About Maxim IntegratedMaxim Integrated develops innovative analog and mixed-signal products and technologies to make systems smaller and smarter, with enhanced security and increased energy efficiency. We are empowering design innovation for our automotive, industrial, healthcare, mobile consumer, and cloud data center customers to deliver industry-leading solutions that help change the world. Learn more at https://www.maximintegrated.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/maxim-power-management-solution-sets-industrys-standard-with-highest-efficiency-of-96-and-lowest-quiescent-current-of-6a-to-boost-runtime-of-portable-devices-300929375.htmlSOURCE  Maxim Integrated Products, Inc."
    }
]