[
    {
        "title": "Mike Berry Joins NetApp as Executive Vice President and Chief Financial Officer",
        "subtitle": "",
        "date": "Mar 2, 2020 4:00PM EST",
        "content": "    SUNNYVALE, Calif.--(BUSINESS WIRE)--\nNetApp® (NASDAQ: NTAP), the leader in cloud data services, today announced the appointment of Mike Berry as executive vice president and chief financial officer effective March 16. Berry joins NetApp from McAfee, LLC, where he was also executive vice president and chief financial officer. Berry brings with him a deep knowledge of the technology and software space and an extensive background in a wide range of financial, strategic, and operational functions.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200302005138/en/Mike Berry, executive vice president and chief financial officer of NetApp. (Photo: Business Wire)\nBerry will succeed Ron Pasek, who served as NetApp’s executive vice president and chief financial officer for four years and announced his intent to retire earlier this year.\n\n“I am delighted to welcome Mike to the NetApp team,” said George Kurian, chief executive officer. “He has a wealth of experience and will drive continued discipline in our operations, as we strengthen our leadership position in the marketplace while driving long-term value for our shareholders. His experience in software subscription and cloud business models will provide a valuable perspective as we execute our strategy to become the leader of data services for hybrid multicloud.”\n\n“I am very excited to join NetApp as it continues the evolution to a leadership position in cloud data services,” said Berry. “I believe NetApp is in a unique position to capitalize on the future technology trends given its market leadership, focus on innovation, and strong financial foundation. I look forward to working with George and the whole NetApp team to further the value creation for our shareholders, customers and employees.”\n\nAbout Mike Berry\n\nBerry is a technology industry veteran with a strong background in finance, operations and general management. In his previous role as executive vice president and chief financial officer at McAfee, he was responsible for all aspects of finance, including financial planning, accounting, tax and treasury, as well as operations and shared services.\n\nBefore he joined McAfee in February 2017, Berry was executive vice president, chief financial officer, and chief operating officer at FireEye. Previous to that position, he was executive vice president and chief financial officer for Informatica. Before his work at Informatica, Berry had led finance and other operations for several technology companies, including SolarWinds and i2 Technologies.\n\nBerry earned a bachelor’s degree in finance from Augsburg University and an MBA in finance from the University of St. Thomas. He is a member of the Rapid7 and FinancialForce boards of directors, where he also serves as their audit committee chair.\n\nAbout NetApp\n\nNetApp is the leader in cloud data services, empowering global organizations to change their world with data. Together with our partners, we are the only ones who can help you build your unique data fabric. Simplify hybrid multicloud and securely deliver the right data, services and applications to the right people at the right time. Learn more at www.netapp.com.\n\nNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005138/en/\nPress Contact:\nAmelia Vierra\nNetApp\n1 (408) 822-6403\namelia.vierra@netapp.com\n\nInvestor Contact:\nLance Berger\nNetApp\n1 (408) 822-6628\nlance.berger@netapp.com\nSource: NetApp, Inc."
    },
    {
        "title": "NetApp to Participate in the Morgan Stanley Technology, Media and Telecom Conference",
        "subtitle": "",
        "date": "Feb 27, 2020 4:01PM EST",
        "content": "    SUNNYVALE, Calif.--(BUSINESS WIRE)--\nNetApp (NASDAQ: NTAP), the leader in cloud data services, today announced that George Kurian, chief executive officer, will participate in a fireside chat at the Morgan Stanley TMT conference on March 5, 2020 at 9:45 a.m. Pacific Time.\n\nA live audio Webcast of the presentation will be available at investors.netapp.com. An audio Webcast archive of the event will be available after the conference.\n\nAbout NetApp\n\nNetApp is the leader in cloud data services, empowering global organizations to change their world with data. Together with our partners, we are the only ones who can help you build your unique data fabric. Simplify hybrid multicloud and securely deliver the right data, services and applications to the right people at the right time. Learn more at www.netapp.com.\n\nNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005785/en/\nPress Contact\nAmelia Vierra\nNetApp\n1 408 822 6403\nng-uspr@netapp.com\n\nInvestor Contact\nBillie Fagenstrom\nNetApp\n1 408 822 6428\nbillie.fagenstrom@netapp.com\nSource: NetApp, Inc."
    },
    {
        "title": "NetApp Appoints Deepak Ahuja to Board of Directors",
        "subtitle": "",
        "date": "Feb 4, 2020 8:00AM EST",
        "content": "    SUNNYVALE, Calif.--(BUSINESS WIRE)--\nNetApp, Inc. (NASDAQ: NTAP) today announced that Deepak Ahuja, CFO of Verily, has joined its Board of Directors. Mr. Ahuja’s appointment brings the number of directors on the NetApp board to eight, seven of whom are independent.\n\n“I am pleased to welcome Deepak to our Board,” said George Kurian, chief executive officer. “His extensive strategic and operational expertise will provide valuable perspectives as we continue to execute our strategy, drive profitability and enhance value for all NetApp’s shareholders. I look forward to benefiting from his experience.”\n\n“As a seasoned CFO, Deepak’s knowledge of complex financial matters at high growth companies will be an excellent resource for our management team,” said NetApp’s Chairman Mike Nevens. “His experience complements the board’s capabilities and we are excited to welcome him on to our board.”\n\n“I am honored to join the board of a leader of data services for hybrid multicloud,” said Deepak Ahuja. “I look forward to working alongside my fellow Board members and company management to advance NetApp’s compelling vision.”\n\nAbout Deepak Ahuja\n\nDeepak Ahuja joined Verily in 2020 as Chief Financial Officer (CFO). Previously, he served as CFO of Tesla from 2008 to 2015 and from 2017 to 2019. One of Tesla’s longest-serving executives, Deepak played a role in the company’s rise from startup to a large cap energy company. Deepak was Tesla’s first finance chief and helped guide it through its IPO in addition to raising several billion dollars of capital to fuel its growth. Prior to Tesla, he was at Ford Motor Company for 15 years, which provided him experiences in manufacturing, marketing & sales, product development, treasury, and acquisitions/divestitures. Deepak was named CFO of the year in 2010 for small public companies by Silicon Valley Business Journal. In 2014, he was named Bay Area CFO of the year for large public companies by San Francisco Business Times. Deepak holds an M.S. in industrial administration from Carnegie Mellon University, an M.S. in materials engineering from Northwestern University and a B. Tech in ceramic engineering from Banaras Hindu University in India.\n\nAbout NetApp \n\nNetApp is the leader in cloud data services, empowering global organizations to change their world with data. Together with our partners, we are the only ones who can help you build your unique data fabric. Simplify hybrid multicloud and securely deliver the right data, services and applications to the right people at the right time. Learn more at www.netapp.com.\n\nNetApp and the NetApp logo are trademarks of NetApp, Inc. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005021/en/\nPress Contact\nAmelia Vierra\nNetApp Inc.\n1 (408) 822-6403\namelia.vierra@netapp.com\n\nInvestor Contact\nLance Berger\nNetApp Inc.\n1 (408) 822-6628\nlance.berger@netapp.com\nSource: NetApp, Inc."
    },
    {
        "title": "NetApp Reinvents the Customer Experience for the Hybrid Multicloud",
        "subtitle": "Company introduces new simplified cloud experience for the enterprise, on and off the premises, with consumption models as easy as 1-2-3",
        "date": "Oct 29, 2019 11:19PM EDT",
        "content": "SINGAPORE, Oct. 30, 2019 /PRNewswire/ -- NetApp (NASDAQ: NTAP), the data authority for hybrid cloud, today announced its reinvention of the customer experience with NetApp® Keystone, a program that offers a range of flexible solutions for customers whether they choose to build or buy their cloud infrastructure.Organizations are digitally transforming to drive competitive advantage. They need to accelerate innovation in today's real-time world while dealing with the complex reality that data and resources live anywhere and everywhere. In order to address this complexity, today's IT environments must transform. While the industry has been focused on addressing these needs from a technology standpoint, the incremental improvements to financial options and to the upgrade process haven't kept pace, until now.\"While the advent of hybrid multicloud brings incredible potential, it has also resulted in increasingly complex environments. At the same time, budgets have contracted this year, creating intense demand to optimize and streamline not only how infrastructures are orchestrated and managed, but also the economics around IT buying,\" said Ashish Nadkarni, vice president of IDC's Infrastructure Systems, Platforms and Technologies Group. \"In introducing flexible consumption models and automation-focused products, NetApp is making it significantly simpler not only to use its own products and services, but for IT leaders to modernize, monitor and manage the entirety of their infrastructure.\"\"In today's environment, cloud sets the benchmark for customer experience,\" said NetApp CEO George Kurian. \"We've built and delivered the data fabric strategy to simplify and modernize our customer's data centers and enable success in the hybrid cloud era. The solutions we are introducing today are an extension of that philosophy -- what data fabric has done to simplify and integrate data infrastructure; our new flexible consumption models do at the business level.\"NetApp's vision is to simplify the business of data services for customers from every perspective: from how they buy and consume products and services to how they run them in their environments and who services them. As a leader in storage systems and software[1] and an innovator in cloud services, with a business that is growing by almost 200% year over year, only NetApp offers the full range of capabilities that customers need to build and manage their unique data fabric to solve the financial, operational, and technical barriers to adopting hybrid multicloud environments.NetApp Keystone: The Customer Experience ReinventedNetApp Keystone is a program that offers a range of flexible solutions for customers, whether they choose to build or buy their cloud infrastructure, on their premises or off. Keystone offers the agility, pay-per-use economics, dynamic scaling, and operational simplicity that customers need to be able to consume cloud on their own terms. Keystone features:Keystone is designed to meet the reality of a hybrid multicloud world where IT teams need to have greater choice, flexibility, and freedom to run and pay for their data services however they want.\"NetApp's data fabric strategy has been a key element in how we help our customers modernize their infrastructures,\" said Ken Farber, President, ePlus Software. \"With Keystone we can help our customers build their data fabric via a consumption model that simplifies the experience and complexity of navigating hybrid multi-cloud.\"Featured Portfolio UpdatesAlong with the new program and simplified customer experience, NetApp announced a number of updates throughout its portfolio, with a range of new product launches, enhancements, and integrations.For more information, refer to the Spotlight Stories and Product Appendix sections in the NetApp Newsroom.Additional ResourcesAbout NetAppNetApp is the data authority for hybrid cloud. We provide a full range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. Together with our partners, we empower global organizations to unleash the full potential of their data to expand customer touchpoints, foster greater innovation, and optimize their operations. For more information, visit www.netapp.com. #DataDrivenNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.SOURCE  NetApp"
    },
    {
        "title": "NetApp Hosts Technology Sessions at 2019 INSIGHT Conference in Las Vegas, Nevada",
        "subtitle": "",
        "date": "Oct 15, 2019 4:01PM EDT",
        "content": "    SUNNYVALE, Calif.--(BUSINESS WIRE)--\nNetApp (NASDAQ: NTAP) will host technology sessions for financial analysts in conjunction with the 2019 NetApp® INSIGHT® conference in Las Vegas, Nevada, on October 29, 2019, from 12:45 p.m. – 3:50 p.m. Pacific Time. NetApp participants include George Kurian, chief executive officer; Brad Anderson, executive vice president, cloud infrastructure business unit and storage, system and software business unit; Anthony Lye, senior vice president and general manager, cloud data services business unit; Octavian Tanase, senior vice president, ONTAP; and Brett Roscoe, vice president, product management. Henri Richard, executive vice president, worldwide field and customer operations, will moderate a customer panel. Audience members will include financial analysts and investors.\n\nHow to Participate \n\nThe live video webcast will be available at http://investors.netapp.com from 12:45 p.m. to 3:50 p.m. Pacific Time (and will include a short break). A webcast replay of the event will be available at http://investors.netapp.com approximately 24 hours after the event.\n\nAbout NetApp\n\nNetApp is the data authority for hybrid cloud. We provide a full range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. Together with our partners, we empower global organizations to unleash the full potential of their data to expand customer touchpoints, foster greater innovation, and optimize their operations. For more information, visit www.netapp.com. #DataDriven\n\nNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191015006069/en/\nPRESS CONTACT:\nAmelia Vierra\nNetApp\n1 408 822 6403\nng-uspr@netapp.com \n\nINVESTOR CONTACT:\nBillie Fagenstrom\nNetApp\n1 408 822-6428\nbillie.fagenstrom@netapp.com\nSource: NetApp, Inc."
    },
    {
        "title": "NetApp named a Leader in 2019 Gartner Magic Quadrant for Primary Storage",
        "subtitle": "Company positioned highest overall for ability to execute",
        "date": "Oct 6, 2019 9:00PM EDT",
        "content": "SINGAPORE, Oct. 7, 2019 /PRNewswire/ -- NetApp (NASDAQ: NTAP), the data authority for hybrid cloud, has been named a Leader in the Gartner 2019 Magic Quadrant for Primary Storage[1] based on its ability to execute and completeness of vision. The report positioned NetApp highest for ability to execute.\"We believe the 2019 Gartner Magic Quadrant for Primary Storage further demonstrates recognition that our solutions deliver data-driven business outcomes across core, edge and cloud,\" commented Sanjay Rohatgi, senior vice president and general manager for Asia Pacific at NetApp. \"We help organizations simplify data management in hybrid multicloud environments, ensuring they deliver their application data to the right place at the right time, so they can make better, data-driven decisions. At NetApp, our teams are constantly innovating to deliver the leading flash systems and data services portfolio with the deepest integration to the cloud.\"The Magic Quadrant for Primary Storage replaces two Magic Quadrants: the Magic Quadrant for Solid-State Arrays and the Magic Quadrant for General-Purpose Storage Arrays.  The complimentary copy of the 2019 Gartner Magic Quadrant for Primary Storage report can be downloaded here. About NetAppNetApp is the data authority for hybrid cloud. We provide a full range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. Together with our partners, we empower global organizations to unleash the full potential of their data to expand customer touchpoints, foster greater innovation, and optimize their operations. For more information, visit www.netapp.com. #DataDrivenNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.SOURCE  NetApp"
    },
    {
        "title": "Lifshitz & Miller LLP Announces Investigation of 2U, Inc., Buford Capital Limited, Evolent Health, Inc., Greenlane Holdings, Inc., International Flavors and Fragrances, Inc., NetApp, Inc., and Valaris PLC",
        "subtitle": "",
        "date": "Sep 17, 2019 5:21PM EDT",
        "content": "NEW YORK, Sept. 17, 2019 /PRNewswire/ --2U, Inc. (TWOU)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that TWOU had an unsustainable business model. Specifically, the Company faced increasing competition in online education and particularly regarding graduate programs; and the Company faced certain program-specific issues that negatively impacted its performance.If you are a TWOU investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Buford Capital Limited (BRFRF, BRFRY)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that Buford has been manipulating its metrics, including ROIC and IRR, to create a misleading picture of investment returns to investors.If you are a BRFRF investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Evolent Health, Inc. (EVH)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that Evolent's partnership model did not align the EVH's interests with those of its partners.If you are a EVH investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Greenlane Holdings, Inc. (GNLN)Lifshitz & Miller announces investigation into possible securities laws violations in connection with Greenlane's stock plummeting to $7.84, less than 50% of its IPO price.If you are a GNLN investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.International Flavors & Fragrances, Inc. (IFF)Lifshitz & Miller announces investigation into possible securities laws violations in connection with IFF's disclosure that it had acquired, Frutom Industries, Ltd. that had \"made improper payments to representatives of a number of customers\" in Russia and Ukraine.If you are an IFF investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.NetApp, Inc. (NTAP)Lifshitz & Miller announces investigation into possible securities laws violations in connection with NetApp's first quarter 2019 ability to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized.If you are an NTAP investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Valaris PLC (VAL)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that Valaris was plagued by a weak ultra-deepwater segment, massive cash usage, and significant negative cash flow.If you are a VAL investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.ATTORNEY ADVERTISING.© 2019 Lifshitz & Miller LLP.  The law firm responsible for this advertisement is Lifshitz & Miller LLP, 821 Franklin Avenue, Suite 209, Garden City, New York 11530, Tel: (516)493-9780.  Prior results do not guarantee or predict a similar outcome with respect to any future matter.Contact:Joshua M. Lifshitz, Esq.Lifshitz & Miller LLPPhone:  516-493-9780Facsimile: 516-280-7376Email: info@jlclasslaw.com View original content:http://www.prnewswire.com/news-releases/lifshitz--miller-llp-announces-investigation-of-2u-inc-buford-capital-limited-evolent-health-inc-greenlane-holdings-inc-international-flavors-and-fragrances-inc-netapp-inc-and-valaris-plc-300920178.htmlSOURCE  Lifshitz & Miller Law Firm"
    },
    {
        "title": "SHAREHOLDER ALERT - NetApp, Inc. (NTAP) - Bronstein, Gewirtz & Grossman, LLC Notifies Shareholders of Class Action and Lead Plaintiff Deadline: October 15, 2019",
        "subtitle": "",
        "date": "Sep 4, 2019 10:00AM EDT",
        "content": "NEW YORK, Sept. 4, 2019 /PRNewswire/ -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC notifies investors that a class action lawsuit has been filed against NetApp, Inc. (\"NetApp\" or \"the Company\") (NASDAQ: NTAP) and certain of its officers, on behalf of shareholders who purchased or otherwise acquired NetApp securities between May 22, 2019 and August 1, 2019, both dates inclusive. Such investors are encouraged to join this case by visiting the firm's site: www.bgandg.com/ntap. This class action seeks to recover damages against Defendants for alleged violations of the federal securities laws under the Securities Exchange Act of 1934.The complaint alleges that throughout the Class Period, defendants made false and/or misleading statements and/or failed to disclose that: (1) the Company was unable to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized; (2) the Company's revenue would be materially impacted; (3) the Company would lower its fiscal 2020 guidance; and (4) as a result, NetApp's public statements were materially false and misleading at all relevant times. When the true details entered the market, the lawsuit claims that investors suffered damages.If you wish to review a copy of the Complaint you can visit the firm's site: www.bgandg.com/ntap or you may contact Peretz Bronstein, Esq. or his Investor Relations Analyst, Yael Hurwitz of Bronstein, Gewirtz & Grossman, LLC at 212-697-6484. If you suffered a loss in NetApp you have until October 15, 2019 to request that the Court appoint you as lead plaintiff.  A lead plaintiff acts on behalf of all other class members in directing the litigation. The lead plaintiff can select a law firm of its choice. Your ability to share in any recovery doesn't require that you serve as a lead plaintiff.Bronstein, Gewirtz & Grossman, LLC is a corporate litigation boutique.  Our primary expertise is the aggressive pursuit of litigation claims on behalf of our clients.  In addition to representing institutions and other investor plaintiffs in class action security litigation, the firm's expertise includes general corporate and commercial litigation, as well as securities arbitration.   Attorney advertising. Prior results do not guarantee similar outcomes.Contact:Bronstein, Gewirtz & Grossman, LLCPeretz Bronstein or Yael Hurwitz 212-697-6484 | info@bgandg.com View original content to download multimedia:http://www.prnewswire.com/news-releases/shareholder-alert---netapp-inc-ntap---bronstein-gewirtz--grossman-llc-notifies-shareholders-of-class-action-and-lead-plaintiff-deadline-october-15-2019-300910637.htmlSOURCE  Bronstein, Gewirtz & Grossman, LLC"
    },
    {
        "title": "LEAD PLAINTIFF DEADLINE: Johnson Fistel, LLP Encourages Investors to Contact the Firm",
        "subtitle": "",
        "date": "Aug 30, 2019 6:00PM EDT",
        "content": "SAN DIEGO, Aug. 30, 2019 /PRNewswire/ -- Johnson Fistel, LLP announces that class action lawsuits have been commenced on behalf of shareholders of the publicly-traded companies listed below. The Private Securities Litigation Reform Act of 1995 permits any investor who purchased a common stock during the Class Period to seek appointment as lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation.  The lead plaintiff can select a law firm of its choice.  An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.  If you wish to serve as lead plaintiff, you must move the Court no later than the dates listed below. If you wish to discuss this action or have any questions concerning this notice or your rights or interests, please contact Jim Baker (jimb@johnsonfistel.com) at 619-814-4471. If emailing, please include a phone number.Additionally, you can Click Here or any of the links below, there is no cost or obligation to you.About Johnson Fistel, LLP:Johnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York, and Georgia. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits. For more information about the firm and its attorneys, please visit https://www.johnsonfistel.com. Attorney advertising. Past results do not guarantee future outcomes.Contact:Johnson Fistel, LLPJim Baker, 619-814-4471jimb@johnsonfistel.com  View original content:http://www.prnewswire.com/news-releases/lead-plaintiff-deadline-johnson-fistel-llp-encourages-investors-to-contact-the-firm-300909929.htmlSOURCE  Johnson Fistel, LLP"
    },
    {
        "title": "Kessler Topaz Meltzer & Check, LLP:  Securities Fraud Class Action Filed Against NetApp, Inc. - NTAP",
        "subtitle": "",
        "date": "Aug 28, 2019 6:48PM EDT",
        "content": "RADNOR, Pa., Aug. 28, 2019 /PRNewswire/ -- The law firm of Kessler Topaz Meltzer & Check, LLP alerts investors that a securities fraud class action lawsuit has been filed against NetApp, Inc. (NASDAQ:  NTAP) (\"NetApp\") on behalf of those who purchased or otherwise acquired NetApp securities between May 22, 2019 and August 1, 2019, inclusive (the \"Class Period\").Investors who purchased NetApp securities during the Class Period may, no later than October 15, 2019, seek to be appointed as a lead plaintiff representative of the class. For additional information or to learn how to participate in this litigation please visit www.ktmc.com/netapp-inc-securities-class-action. According to the complaint, NetApp provides a range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. The Class Period commences on May 22, 2019, when NetApp announced fourth quarter and full year 2019 financial results. According to the complaint, on August 1, 2019, after the market closed, NetApp reported preliminary first quarter 2020 net revenue between $1.22 and $1.23 billion, below previous guidance between $1.315 to $1.465 billion, and earnings per share between $0.30 and $0.35, below previous guidance between $0.56 and $0.64. Additionally, NetApp lowered its 2020 outlook and expected net revenue to decline between 5% and 10% year-over-year. Following this news, NetApp's share price fell as much as $11.67, or over 20%, to close at $46.04 per share on August 2, 2019. The complaint alleges that, throughout the Class Period, the defendants failed to disclose to investors that: (1) NetApp was unable to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized; (2) as a result, NetApp's revenue would be materially impacted; (3) as a result, NetApp would lower its fiscal 2020 guidance; and (4) as a result of the foregoing, the defendants' positive statements about NetApp's business, operations, and prospects were materially misleading and/or lacked a reasonable basis.NetApp investors who wish to discuss this securities fraud class action lawsuit and their legal options are encouraged to contact Kessler Topaz Meltzer & Check, LLP (James Maro, Jr., Esq. or Adrienne Bell, Esq.) at (844) 887-9500 (toll free) or at info@ktmc.com.NetApp investors may, no later than October 15, 2019, seek to be appointed as a lead plaintiff representative of the class through Kessler Topaz Meltzer & Check, or other counsel, or may choose to do nothing and remain an absent class member.  A lead plaintiff is a representative party who acts on behalf of all class members in directing the litigation.  In order to be appointed as a lead plaintiff, the Court must determine that the class member's claim is typical of the claims of other class members, and that the class member will adequately represent the class.  Your ability to share in any recovery is not affected by the decision of whether or not to serve as a lead plaintiff.Kessler Topaz Meltzer & Check prosecutes class actions in state and federal courts throughout the country involving securities fraud, breaches of fiduciary duties and other violations of state and federal law. Kessler Topaz Meltzer & Check is a driving force behind corporate governance reform, and has recovered billions of dollars on behalf of institutional and individual investors from the United States and around the world.  The firm represents investors, consumers and whistleblowers (private citizens who report fraudulent practices against the government and share in the recovery of government dollars).  The complaint in this action was not filed by Kessler Topaz Meltzer & Check. For more information about Kessler Topaz Meltzer & Check, please visit www.ktmc.com.CONTACT:Kessler Topaz Meltzer & Check, LLPJames Maro, Jr., Esq.Adrienne Bell, Esq.280 King of Prussia RoadRadnor, PA 19087(844) 887-9500  (toll free)(610) 667-7706info@ktmc.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/kessler-topaz-meltzer--check-llp--securities-fraud-class-action-filed-against-netapp-inc--ntap-300908804.htmlSOURCE  Kessler Topaz Meltzer & Check, LLP"
    },
    {
        "title": "NetApp Appoints Sanjay Rohatgi to Drive Growth in Asia Pacific",
        "subtitle": "Rohatgi will empower organizations in the region to unleash the full potential of their data",
        "date": "Aug 22, 2019 1:41AM EDT",
        "content": "SINGAPORE, Aug. 22, 2019 /PRNewswire/ --  NetApp (NASDAQ: NTAP), the data authority for hybrid cloud, today announced the appointment of Sanjay Rohatgi as senior vice president and general manager for Asia Pacific (APAC). Based in Singapore, Rohatgi is responsible for leading NetApp's business and operations for the region, with a focus on driving customer and business growth. He will also be responsible for strengthening engagement with channel partners to help deepen customer engagement and success. Rohatgi reports to Henri Richard, executive vice president, Worldwide Field and Customer Operations.Rohatgi brings more than two decades of experience in helping enterprise and commercial customers with their digital transformation efforts to drive business growth. Prior to joining NetApp, he served as senior vice president and general manager for Asia Pacific and Japan at Symantec. Before that, he was managing director for Cisco's telecom business in India. He has also held various senior leadership roles with Nortel Networks in Hong Kong, Telstra and BHP Billiton in Australia, and British Telecom in the UK.Data is the lifeblood of organizations and economies around the globe. According to IDC, organizations that use data aggressively to disrupt their industries -- Data Thrivers -- achieve six times the improvement in operational efficiency and three times increased profitability and new customer acquisition.[1]\"Sanjay is a proven leader who aligns market delivery with business strategy, especially in companies experiencing rapid growth and transformation in the complex APAC region,\" said Henri Richard, executive vice president, Worldwide Field and Customer Operations. \"His skills in partnering with APAC teams and understanding the APAC business landscape will be key to driving our continued growth. We are excited to have Sanjay as part of the NetApp team.\"Sanjay Rohatgi, senior vice president and general manager for Asia Pacific at NetApp, said, \"The speed and scale with which enterprises in this diverse market and region modernize and innovate digitally is astonishing. Connecting their data to any cloud, anywhere, is crucial to leapfrog the competition, and there is no better partner for that than NetApp. I'm excited about the opportunity to expand NetApp's business and, thanks to our data fabric vision, I believe we can bring NetApp to even greater heights.\" NetApp has been supporting a hybrid approach since 2015 to ensure that companies have access to critical business data. Its data fabric was acknowledged by Gartner and the wider industry as a strategic trend[2], offering a powerful out-of-the-box hybrid multicloud platform, which helps companies like Ducati and DreamWorks manage their data.About NetAppNetApp is the data authority for hybrid cloud. We provide a full range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. Together with our partners, we empower global organizations to unleash the full potential of their data to expand customer touchpoints, foster greater innovation, and optimize their operations. For more information, visit www.netapp.com. #DataDrivenNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective ownersPhoto - https://photos.prnasia.com/prnh/20190822/2558923-1SOURCE  NetApp"
    },
    {
        "title": "NTAP LOSS NOTICE: ROSEN, A LEADING LAW FIRM, Announces Filing of Securities Class Action Lawsuit Against NetApp, Inc. - NTAP",
        "subtitle": "",
        "date": "Aug 20, 2019 4:27PM EDT",
        "content": "NEW YORK, Aug. 20, 2019 /PRNewswire/ -- Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of the securities of NetApp, Inc. (NASDAQ: NTAP) from May 22, 2019 through August 1, 2019, inclusive (the \"Class Period\"). The lawsuit seeks to recover damages for NetApp investors under the federal securities laws.To join the NetApp class action, go to http://www.rosenlegal.com/cases-register-1656.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. NO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR'S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFF.According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) the Company was unable to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized; (2) the Company's revenue would be materially impacted; (3) the Company would lower its fiscal 2020 guidance; and (4) as a result, NetApp's public statements were materially false and misleading at all relevant times. When the true details entered the market, the lawsuit claims that investors suffered damages. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than October 15, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to http://www.rosenlegal.com/cases-register-1656.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at pkim@rosenlegal.com or cases@rosenlegal.com.Follow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/. Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013.   Rosen Law Firm has secured hundreds of millions of dollars for investors.  Contact Information:      Laurence Rosen, Esq.      Phillip Kim, Esq.      The Rosen Law Firm, P.A.      275 Madison Avenue, 34th Floor      New York, NY 10016      Tel: (212) 686-1060      Toll Free: (866) 767-3653      Fax: (212) 202-3827      lrosen@rosenlegal.com      pkim@rosenlegal.com      cases@rosenlegal.com      www.rosenlegal.com View original content to download multimedia:http://www.prnewswire.com/news-releases/ntap-loss-notice-rosen-a-leading-law-firm-announces-filing-of-securities-class-action-lawsuit-against-netapp-inc--ntap-300904567.htmlSOURCE  Rosen Law Firm, P.A."
    },
    {
        "title": "LEAD PLAINTIFF DEADLINE ALERT: Faruqi & Faruqi, LLP Encourages Investors Who Suffered Losses Exceeding $50,000 In NetApp, Inc. To Contact The Firm",
        "subtitle": "",
        "date": "Aug 16, 2019 4:00PM EDT",
        "content": "NEW YORK, Aug. 16, 2019 /PRNewswire/ -- Faruqi & Faruqi, LLP, a leading national securities law firm, reminds investors in NetApp, Inc. (\"NetApp\" or the \"Company\") (NASDAQ:NTAP) of the October 15, 2019 deadline to seek the role of lead plaintiff in a federal securities class action that has been filed against the Company. If you invested in NetApp stock or options between May 22, 2019 and August 1, 2019 and would like to discuss your legal rights, click here: www.faruqilaw.com/NTAP.  There is no cost or obligation to you.You can also contact us by calling Richard Gonnello toll free at 877-247-4292 or at 212-983-9330 or by sending an e-mail to rgonnello@faruqilaw.com.   CONTACT:FARUQI & FARUQI, LLP685 Third Avenue, 26th FloorNew York, NY 10017Attn:  Richard Gonnello, Esq.rgonnello@faruqilaw.comTelephone: (877) 247-4292 or (212) 983-9330The lawsuit has been filed in the U.S. District Court for the Northern District of California on behalf of all those who purchased NetApp securities between May 22, 2019 and August 1, 2019 (the \"Class Period\").  The case, Smith v. NetApp, Inc., No. 19-cv-04801 was filed on August 14, 2019 and has been assigned to Judge Jon S. Tigar.The lawsuit focuses on whether the Company and its executives violated federal securities laws by making materially false and/or misleading statements, as well as failing to disclose material adverse facts about the Company's business, operations, and prospects.Specifically, Defendants failed to disclose to investors: (1) that the Company was unable to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized; (2) that, as a result, the Company's revenue would be materially impacted; (3) that, as a result, the Company would lower its fiscal 2020 guidance; and (4) that, as a result of the foregoing, Defendants' positive statements about the Company's business, operations, and prospects were materially misleading and/or lacked a reasonable basis.On August 1, 2019, after the market closed, the Company reported preliminary first quarter 2019 adjusted earnings per share of $0.55 to $0.60, below the average estimate of $0.83, and net revenue of $1.22 billion to $1.23 billion, below the average estimate of $1.39 billion. Additionally, the Company lowered its 2020 outlook and expected net revenue to decline between 5% and 10% year-over-year.On this news, the Company's stock fell from $57.71 on August 1, 2019 to $46.04 on August 2, 2019— a $11.67 or 20.22% drop.The court-appointed lead plaintiff is the investor with the largest financial interest in the relief sought by the class who is adequate and typical of class members who directs and oversees the litigation on behalf of the putative class. Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member. Your ability to share in any recovery is not affected by the decision to serve as a lead plaintiff or not.  Faruqi & Faruqi, LLP also encourages anyone with information regarding NetApp's conduct to contact the firm, including whistleblowers, former employees, shareholders and others.Attorney Advertising. The law firm responsible for this advertisement is Faruqi & Faruqi, LLP (www.faruqilaw.com). Prior results do not guarantee or predict a similar outcome with respect to any future matter. We welcome the opportunity to discuss your particular case. All communications will be treated in a confidential manner. View original content to download multimedia:http://www.prnewswire.com/news-releases/lead-plaintiff-deadline-alert-faruqi--faruqi-llp-encourages-investors-who-suffered-losses-exceeding-50-000-in-netapp-inc-to-contact-the-firm-300903113.htmlSOURCE  Faruqi & Faruqi, LLP"
    },
    {
        "title": "Bragar Eagel & Squire, P.C. Announces That a Class Action Lawsuit Has Been Filed Against NetApp, Inc. (NASDAQ: NTAP) and Encourages NetApp Investors to Contact the Firm",
        "subtitle": "",
        "date": "Aug 15, 2019 8:49PM EDT",
        "content": "NEW YORK, Aug. 15, 2019 /PRNewswire/ -- Bragar Eagel & Squire, P.C. announces that a class action lawsuit has been filed in the United States District Court for the Northern District of California on behalf of all investors that purchased NetApp, Inc. (NASDAQ: NTAP) securities between May 22, 2019 and August 1, 2019 (the \"Class Period\").  Investors have until October 15, 2019 to apply to the Court to be appointed as lead plaintiff in the lawsuit.Click here to participate in the action.On August 1, 2019, the company reported preliminary first quarter 2019 adjusted earnings per share of $0.55 to $0.60, below the average estimate of $0.83, and net revenue of $1.22 billion to $1.23 billion, below the average estimate of $1.39 billion. Moreover, the company lowered its 2020 outlook and expected net revenue to decline between 5% and 10% year-over-year.On this news, the company's share price fell $11.67 per share, to close at $46.04 per share on August 2, 2019.The complaint, filed on August 14, 2019, alleges that throughout the Class Period defendants made materially false and/or misleading statements, as well as failed to disclose material adverse facts about the Company's business, operations, and prospects. Specifically, defendants made false and/or misleading statements and/or failed to disclose: (1) that the company was unable to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized; (2) that, as a result, the company's revenue would be materially impacted; (3) that, as a result, the company would lower its fiscal 2020 guidance; and (4) that, as a result of the foregoing, defendants' positive statements about the company's business, operations, and prospects were materially misleading and/or lacked a reasonable basis.If you purchased NetApp shares during the Class Period, are a long-term stockholder, have information, would like to learn more about these claims, or have any questions concerning this announcement or your rights or interests with respect to these matters, please contact Brandon Walker or Melissa Fortunato by email at investigations@bespc.com, or telephone at (212) 355-4648, or by filling out this contact form.  There is no cost or obligation to you.Bragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation.  For additional information concerning the NetApp class action please go to https://bespc.com/NTAP. For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com.  Attorney advertising.  Prior results do not guarantee similar outcomes. View original content to download multimedia:http://www.prnewswire.com/news-releases/bragar-eagel--squire-pc-announces-that-a-class-action-lawsuit-has-been-filed-against-netapp-inc-nasdaq-ntap-and-encourages-netapp-investors-to-contact-the-firm-300902841.htmlSOURCE  Bragar Eagel & Squire, P.C."
    },
    {
        "title": "NTAP CLASS ACTION DEADLINE: Bernstein Liebhard LLP Announces that a Securities Class Action Has Been Filed Against NetApp, Inc.",
        "subtitle": "",
        "date": "Aug 15, 2019 1:46PM EDT",
        "content": "NEW YORK, Aug. 15, 2019 /PRNewswire/ -- Bernstein Liebhard LLP, a nationally acclaimed investor rights law firm, announces that a securities class action lawsuit has been filed on behalf of shareholders that purchased or acquired shares of NetApp, Inc. (\"NetApp\" or the \"Company\") (NASDAQ: NTAP) between May 22, 2019 and August 1, 2019, inclusive (the \"Class Period\"). The lawsuit filed in the United States District Court for the Northern District of California seeks to recover damages for NetApp investors under the Securities Exchange Act of 1934.If you purchased NetApp securities, and/or would like to discuss your legal rights and options please visit NTAP Shareholder Class Action or contact Matthew E. Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com. If you wish to serve as lead plaintiff, you must move the Court no later than October 15, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. Your ability to share in any recovery doesn't require that you serve as lead plaintiff. If you choose to take no action, you may remain an absent class member.The complaint filed in this class action alleges that throughout the Class Period, Defendants made materially false and/or misleading statements, as well as failed to disclose material adverse facts about the Company's business, operations, and prospects. Specifically, Defendants made false and/or misleading statements and/or failed to disclose: (1) that the Company was unable to close large deals within the quarter and that the deals were pushed out to subsequent quarters or downsized; (2) that, as a result, the Company's revenue would be materially impacted; (3) that, as a result, the Company would lower its fiscal 2020 guidance; and (4) that, as a result of the foregoing, Defendants' positive statements about the Company's business, operations, and prospects were materially misleading and/or lacked a reasonable basis.On August 1, 2019, after the market closed, the Company reported preliminary first quarter 2019 adjusted earnings per share of $0.55 to $0.60, below the average estimate of $0.83, and net revenue of $1.22 billion to $1.23 billion, below the average estimate of $1.39 billion. Additionally, the Company lowered its 2020 outlook and expected net revenue to decline between 5% and 10% year-over-year.On this news, the Company's share price fell as much as $11.67, or over 20%, to close at $46.04 per share on August 2, 2019, on unusually heavy trading volume.If you purchased NetApp securities, and/or would like to discuss your legal rights and options please visit https://www.bernlieb.com/cases/netapp-inc-171/apply or contact Matthew E. Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com. Since 1993, Bernstein Liebhard LLP has recovered over $3.5 billion for its clients. In addition to representing individual investors, the Firm has been retained by some of the largest public and private pension funds in the country to monitor their assets and pursue litigation on their behalf. As a result of its success litigating hundreds of lawsuits and class actions, the Firm has been named to The National Law Journal's \"Plaintiffs' Hot List\" thirteen times and listed in The Legal 500 for ten consecutive years.ATTORNEY ADVERTISING. © 2019 Bernstein Liebhard LLP. The law firm responsible for this advertisement is Bernstein Liebhard LLP, 10 East 40th Street, New York, New York 10016, (212) 779-1414. The lawyer responsible for this advertisement in the State of Connecticut is Michael S. Bigin.  Prior results do not guarantee or predict a similar outcome with respect to any future matter.Contact InformationMatthew E. GuarneroBernstein Liebhard LLPhttps://www.bernlieb.com(877) 779-1414MGuarnero@bernlieb.com View original content to download multimedia:http://www.prnewswire.com/news-releases/ntap-class-action-deadline-bernstein-liebhard-llp-announces-that-a-securities-class-action-has-been-filed-against-netapp-inc-300902545.htmlSOURCE  Bernstein Liebhard LLP"
    },
    {
        "title": "NetApp Revolutionizes Data Fabric to Dominate Hybrid Multicloud",
        "subtitle": "Company gives customers the freedom to choose any cloud with one experience",
        "date": "Jun 27, 2019 10:00PM EDT",
        "content": "TOKYO, June 28, 2019 /PRNewswire/ -- NetApp (NASDAQ: NTAP), the data authority for hybrid cloud, today announced new solutions and services that allow customers to adopt and consume cloud on their terms. With today's announcement, NetApp is delivering a truly seamless hybrid multicloud experience that includes availability of NetApp® Cloud Data Services on NetApp HCI, the ability to expand with persistent storage across the biggest public clouds, and the ability for customers to manage, use, and pay for cloud services the way they want to. The public cloud has created a new standard for IT that all industry leaders must match to provide the experience that users enjoy in the cloud and now demand on their premises. To be successful, organizations must fuel data-driven innovation by leveraging the cloud and modernizing their IT, bringing the power of the cloud to every part of their business through a seamless hybrid multicloud experience. Only NetApp, with its data fabric strategy, has what customers need to build a unique data fabric designed for their business—in any cloud, in one experience. \"NetApp's data fabric offerings enable enterprises to seamlessly manage data across a multitude of IT infrastructures, covering on premises and multiple public cloud service platforms,\" said Deepak Mohan, research director, Infrastructure Systems, Platforms and Technologies, IDC. \"IDC research shows that the gap between businesses that embrace data and those that do not has dramatically widened over the past 3 years. As the c-suite increasingly prioritizes data as a strategic asset, NetApp's new multi-platform offerings empowers IT organizations with the flexibility and consistency needed to maximize the value potential of their data.\"\"Overall speed and flexibility between on-premises and cloud environments has been key to our adoption of NetApp's tech and Data Fabric strategy,\" said Konstantin Kostenarov, Ducati CTO. \"As Ducati becomes a lifestyle brand and further expands our business across the world, our approach to data informs everything from strategy on the racetrack to how we design our products and engage with customers. NetApp is leading the charge in hybrid multicloud, and they are one of the best partners we trust to keep up as Ducati transforms on and off the racetrack.\"\"The way organizations invest in and consume IT resources continues to evolve—hybrid multicloud is clearly now the de facto IT architecture,\" said NetApp CEO George Kurian. \"This is a reality that NetApp has been preparing for many years with our Data Fabric strategy. Our close partnerships with major public cloud providers, historical leadership in storage and data management, and groundbreaking approach to creating hybrid multicloud environments with Kubernetes and advanced data services represent an important milestone. It is an exciting foundation for our customers to drive IT transformation today and for further innovation in the years to come.\"Bring the public cloud experience on the premises to free developers to build anywhereNetApp offers users a true hybrid multicloud experience with a consistent service consumption model across public clouds and on the premises. Now, customers can simplify effective infrastructure-as-a-service delivery on the premises and deliver new services and applications faster with NetApp Cloud Data Services on NetApp HCI, including: Manage your data on any of the world's biggest cloudsNetApp Cloud Data Services help customers transform their businesses by enabling them to take advantage of cloud innovation with enterprise data services that are consistently delivered across their choice of cloud. New enhancements in NetApp Cloud Data Services announced today include: Build your data fabricA data fabric provides a common framework for a seamless hybrid multicloud experience. NetApp helps customers build their unique data fabric to discover, integrate, automate, optimize, protect, and secure their data, applications, and resources. New solutions and services introduced include: Additional ResourcesAbout NetAppNetApp is the data authority for hybrid cloud. We provide a full range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. Together with our partners, we empower global organizations to unleash the full potential of their data to expand customer touchpoints, foster greater innovation, and optimize their operations. For more information, visit www.netapp.com. #DataDrivenNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.SOURCE  NetApp"
    },
    {
        "title": "NetApp Revolutionizes Data Fabric to Dominate Hybrid Multicloud",
        "subtitle": "Company gives customers the freedom to choose any cloud with one experience",
        "date": "Jun 20, 2019 6:49AM EDT",
        "content": "SINGAPORE, June 20, 2019 /PRNewswire/ -- NetApp (NASDAQ: NTAP), the data authority for hybrid cloud, today announced new solutions and services that allow customers to adopt and consume cloud on their terms. With today's announcement, NetApp is delivering a truly seamless hybrid multicloud experience that includes availability of NetApp® Cloud Data Services on NetApp HCI, the ability to expand with persistent storage across the biggest public clouds, and the ability for customers to manage, use, and pay for cloud services the way they want to. The public cloud has created a new standard for IT that all industry leaders must match to provide the experience that users enjoy in the cloud and now demand on their premises. To be successful, organizations must fuel data-driven innovation by leveraging the cloud and modernizing their IT, bringing the power of the cloud to every part of their business through a seamless hybrid multicloud experience. Only NetApp, with its data fabric strategy, has what customers need to build a unique data fabric designed for their business -- in any cloud, in one experience. \"NetApp's data fabric offerings enable enterprises to seamlessly manage data across a multitude of IT infrastructures, covering on premises and multiple public cloud service platforms,\" said Deepak Mohan, research director, Infrastructure Systems, Platforms and Technologies, IDC. \"IDC research shows that the gap between businesses that embrace data and those that do not has dramatically widened over the past 3 years. As the c-suite increasingly prioritizes data as a strategic asset, NetApp's new multi-platform offerings empowers IT organizations with the flexibility and consistency needed to maximize the value potential of their data.\"\"Overall speed and flexibility between on-premises and cloud environments has been key to our adoption of NetApp's tech and Data Fabric strategy,\" said Konstantin Kostenarov, Ducati CTO. \"As Ducati becomes a lifestyle brand and further expands our business across the world, our approach to data informs everything from strategy on the racetrack to how we design our products and engage with customers. NetApp is leading the charge in hybrid multicloud, and they are one of the best partners we trust to keep up as Ducati transforms on and off the racetrack.\"\"The way organizations invest in and consume IT resources continues to evolve -- hybrid multicloud is clearly now the de facto IT architecture,\" said NetApp CEO George Kurian. \"This is a reality that NetApp has been preparing for many years with our Data Fabric strategy. Our close partnerships with major public cloud providers, historical leadership in storage and data management, and groundbreaking approach to creating hybrid multicloud environments with Kubernetes and advanced data services represent an important milestone. It is an exciting foundation for our customers to drive IT transformation today and for further innovation in the years to come.\"Bring the public cloud experience on the premises to free developers to build anywhereNetApp offers users a true hybrid multicloud experience with a consistent service consumption model across public clouds and on the premises. Now, customers can simplify effective infrastructure-as-a-service delivery on the premises and deliver new services and applications faster with NetApp Cloud Data Services on NetApp HCI, including:Manage your data on any of the world's biggest cloudsNetApp Cloud Data Services help customers transform their businesses by enabling them to take advantage of cloud innovation with enterprise data services that are consistently delivered across their choice of cloud. New enhancements in NetApp Cloud Data Services announced today include:Build your data fabricA data fabric provides a common framework for a seamless hybrid multicloud experience. NetApp helps customers build their unique data fabric to discover, integrate, automate, optimize, protect, and secure their data, applications, and resources. New solutions and services introduced include: Additional Resources:About NetAppNetApp is the data authority for hybrid cloud. We provide a full range of hybrid cloud data services that simplify management of applications and data across cloud and on-premises environments to accelerate digital transformation. Together with our partners, we empower global organizations to unleash the full potential of their data to expand customer touchpoints, foster greater innovation, and optimize their operations. For more information, visit www.netapp.com. #DataDrivenNETAPP, the NETAPP logo, and the marks listed at http://www.netapp.com/TM are trademarks of NetApp, Inc. Other company and product names may be trademarks of their respective owners.SOURCE  NetApp"
    }
]