[
    {
        "title": "NetEase Reports Fourth Quarter and Fiscal Year 2019 Unaudited Financial Results",
        "subtitle": "",
        "date": "Feb 26, 2020 6:00PM EST",
        "content": "BEIJING, Feb. 26, 2020 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2019.Fourth Quarter 2019 Financial Highlights[1]  Fourth Quarter 2019 and Recent 2020 Operational Highlights\"We saw strong growth across our primary businesses, increasing our total annual net revenues and net income from continuing operations attributable to the Company's shareholders year-over-year by 16% and 60%, respectively, due to strong performances in our online game services as well as other business segments,\" said Mr. William Ding, Chief Executive Officer and Director of NetEase. \"Our online game services net revenues continued to grow, propelled by the sustained and growing popularity of our existing titles, again demonstrating the longevity of our game franchises. At the end of the year, we launched the long-anticipated Fantasy Westward Journey 3D, which gave us a wonderful start to the first quarter. We will continue to bring more masterpieces to both domestic and global players in 2020.\"Our online education and music businesses also performed remarkably well. Youdao is exploring new approaches to grow its business, replicating successful course experiences to produce premium learning content, products and scale with a positive impact to its margins. Our differentiation in music offerings is also becoming more evident. We are helping hundreds of thousands of independent musicians create and promote their work to Chinese music lovers with our platform's specialized promotion and distribution capabilities in independent music. We believe that NetEase's orientation as a forerunner in these evolving markets positions us well for growth and the ability to create additional value for our stakeholders. Finally, with respect to the COVID-19 outbreak, we currently expect to see some impact to our business lines in the near-term, however, the situation is evolving. NetEase is committed to providing support to affected communities and working together as we move through this challenging time,\" Mr. Ding concluded.Fourth Quarter 2019 Financial ResultsNet RevenuesNet revenues for the fourth quarter of 2019 were RMB15,734.8 million (US$2,260.2 million), compared to RMB14,635.7 million and RMB14,405.3 million for the preceding quarter and the fourth quarter of 2018, respectively.Net revenues from online game services were RMB11,604.3 million (US$1,666.9 million) for the fourth quarter of 2019, compared to RMB11,534.8 million and RMB11,019.6 million for the preceding quarter and the fourth quarter of 2018, respectively. Net revenues from mobile games accounted for approximately 70.4% of net revenues from online games for the fourth quarter of 2019, compared to 71.0% and 69.7% for the preceding quarter and the fourth quarter of 2018, respectively.Net revenues from Youdao were RMB410.4 million (US$59.0 million) for the fourth quarter of 2019, compared to RMB345.9 million and RMB230.1 million for the preceding quarter and the fourth quarter of 2018, respectively.Net revenues from innovative businesses and others were RMB3,720.0 million (US$534.4 million) for the fourth quarter of 2019, compared to RMB2,755.0 million and RMB3,155.6 million for the preceding quarter and the fourth quarter of 2018, respectively.  Gross ProfitGross profit for the fourth quarter of 2019 was RMB8,210.4 million (US$1,179.4 million), compared to RMB7,870.4 million and RMB7,530.5 million for the preceding quarter and the fourth quarter of 2018, respectively. Gross profit for online game services was stable quarter-over-quarter. The year-over-year increase in online game services gross profit was primarily due to increased revenue contribution from mobile games including Life-After, Invincible and Identity V.The quarter-over-quarter and year-over-year increases in Youdao gross profit were primarily due to increased net revenues from its learning services and products.The quarter-over-quarter increase in innovative businesses and others gross profit was primarily contributed from NetEase Cloud Music and NetEase's advertising services. The year-over-year increase in innovative businesses and others gross profit was primarily due to increased net revenues from NetEase Cloud Music.Gross Profit Margin Gross profit margin for online game services for the fourth quarter of 2019 was 63.1%, compared to 63.8% and 62.8% for the preceding quarter and the fourth quarter of 2018, respectively. Gross profit margin for online game services was generally stable, fluctuating within a narrow band based on the revenue mix of mobile and PC-client, as well as self-developed and licensed games. Gross profit margin for Youdao for the fourth quarter of 2019 was 29.8%, compared to 25.8% and 29.7% for the preceding quarter and the fourth quarter of 2018, respectively. The quarter-over-quarter increase in Youdao gross profit margin was mainly due to an improvement from its learning services and products and online marketing services. Gross profit margin for Youdao was stable year-over-year.Gross profit margin for innovative businesses and others for the fourth quarter of 2019 was 20.6%, compared to 15.2% and 17.0% for the preceding quarter and the fourth quarter of 2018, respectively. The quarter-over-quarter increase in innovative businesses and others gross profit margin was primarily contributed from NetEase Cloud Music and NetEase's advertising services. The year-over-year increase in innovative businesses and others gross profit margin was primarily due to increased net revenues from NetEase Cloud Music.Operating ExpensesTotal operating expenses for the fourth quarter of 2019 were RMB5,234.0 million (US$751.8 million), compared to RMB4,535.6 million and RMB4,455.4 million for the preceding quarter and the fourth quarter of 2018, respectively. The quarter-over-quarter and year-over-year increases in total operating expenses were mainly due to increased marketing expenditures related to online game services. Other Income[3]Other income consisted of investment income, interest income, foreign exchange gains and losses and others. The quarter-over-quarter and year-over-year increases in other income for the fourth quarter of 2019 were mainly due to the fair value changes of equity investments in publicly traded companies.Income Taxes[3] The Company recorded a net income tax charge of RMB876.3 million (US$125.9 million) for the fourth quarter of 2019, compared to RMB88.0 million and RMB917.7 million for the preceding quarter and the fourth quarter of 2018, respectively. The effective tax rate for the fourth quarter of 2019 was 22.1%, compared to 2.1% and 25.9% for the preceding quarter and the fourth quarter of 2018, respectively. The effective tax rate represents certain estimates by the Company regarding the tax obligations and benefits applicable to it in each quarter.Net Income and Non-GAAP Net Income[3] Net income from continuing operations attributable to the Company's shareholders for the fourth quarter of 2019 totaled RMB3,053.7 million (US$438.6 million), compared to RMB4,134.2 million and RMB2,536.2 million for the preceding quarter and the fourth quarter of 2018, respectively. Non-GAAP net income from continuing operations attributable to the Company's shareholders for the fourth quarter of 2019 totaled RMB3,662.3 million (US$526.1 million), compared to RMB4,726.0 million and RMB3,181.2 million for the preceding quarter and the fourth quarter of 2018, respectively.NetEase reported basic and diluted net income from continuing operations per ADS of US$3.40 and US$3.36, respectively, for the fourth quarter of 2019. The Company reported basic and diluted net income from continuing operations per ADS of US$4.60 and US$4.56, respectively, for the preceding quarter, and basic and diluted net income from continuing operations per ADS of US$2.85 and US$2.83, respectively, for the fourth quarter of 2018. Non-GAAP basic and diluted net income from continuing operations per ADS were US$4.07 and US$4.03, respectively, for the fourth quarter of 2019, compared to non-GAAP basic and diluted net income from continuing operations per ADS of US$5.26 and US$5.22, respectively, for the preceding quarter, and non-GAAP basic and diluted net income from continuing operations per ADS of US$3.57 and US$3.55, respectively, for the fourth quarter of 2018. Fiscal Year 2019 Financial ResultsNet RevenuesNet revenues for fiscal year 2019 were RMB59,241.1 million (US$8,509.5 million), compared to RMB51,178.6 million for fiscal year 2018. Net revenues from online game services were RMB46,422.6 million (US$6,668.2 million) for fiscal year 2019, compared to RMB40,190.1 million for fiscal year 2018. Mobile games accounted for approximately 71.4% of net revenues from online game services for fiscal year 2019, compared to 71.0% for fiscal year 2018.Net revenues from Youdao were RMB1,304.9 million (US$187.4 million) for fiscal year 2019, compared to RMB731.6 million for fiscal year 2018.Net revenues from innovative businesses and others were RMB11,513.6 million (US$1,653.8 million) for fiscal year 2019, compared to RMB10,256.9 million for fiscal year 2018. Gross ProfitGross profit for fiscal year 2019 was RMB31,555.3 million (US$4,532.6 million), compared to RMB27,346.1 million for fiscal year 2018. The year-over-year increase in online game services gross profit for fiscal year 2019 was primarily attributable to increased revenue contribution from mobile games such as Life-After, Invincible and Identity V. The year-over-year increase in Youdao gross profit for fiscal year 2019 was primarily attributable to the rapid development of its learning services and products.The year-over-year increase in innovative businesses and others gross profit for fiscal year 2019 was primarily due to increased net revenues from NetEase Cloud Music, CC live-streaming and Yanxuan, as well as improved cost control.Operating ExpensesTotal operating expenses for fiscal year 2019 were RMB17,764.6 million (US$2,551.7 million), compared to RMB17,368.8 million for fiscal year 2018. The year-over-year increase in total operating expenses for fiscal year 2019 was primarily due to increased research and development investments and staff-related costs, partially offset by decreased selling and marketing expenditures.Other IncomeOther income consisted of investment income/ (loss), interest income, foreign exchange gains and losses and others. The year-over-year increase in other income for fiscal year 2019 was mainly due to fair value changes of equity investments in publicly traded companies.   Income TaxesThe Company recorded a net income tax charge of RMB2,914.7 million (US$418.7 million) and RMB2,460.7 million for fiscal years 2019 and 2018, respectively. The effective tax rate was 17.8% for fiscal year 2019, compared to 22.2% for fiscal year 2018. The lower effective tax rate for fiscal year 2019 was mainly due to reduced losses from certain subsidiaries of the Company. Net Income and Non-GAAP Net Income Net income from continuing operations attributable to the Company's shareholders for fiscal year 2019 totaled RMB13,275.0 million (US$1,906.8 million), compared to RMB8,291.1 million for fiscal year 2018. Non-GAAP net income from continuing operations attributable to the Company's shareholders for fiscal year 2019 totaled RMB15,662.7 million (US$2,249.8 million), compared to RMB10,761.3 million for fiscal year 2018.NetEase reported basic and diluted net income from continuing operations per ADS of US$14.80 and US$14.67, respectively, for fiscal year 2019, and basic and diluted net income from continuing operations per ADS of US$9.20 and US$9.15, respectively, for fiscal year 2018. Non-GAAP basic and diluted net income from continuing operations per ADS were US$17.46 and US$17.31, respectively, for fiscal year 2019, compared to non-GAAP basic and diluted net income from continuing operations per ADS of US$11.94 and US$11.87, respectively, for fiscal year 2018. Quarterly DividendThe board of directors has approved a dividend of US$1.02 per ADS for the fourth quarter of 2019, which is expected to be paid on March 20, 2020 to shareholders of record as of the close of business on March 13, 2020. NetEase paid a dividend of US$7.59 per ADS for the third quarter of 2019 on December 13, 2019.  Starting in the second quarter of 2019, the Company's policy has been to set quarterly dividends at an amount equivalent to approximately 20%-30% of the Company's anticipated net income after tax in each fiscal quarter. The determination to make dividend distributions and the amount of such distributions in any particular quarter will be made at the discretion of the board of directors and will be based upon the Company's operations and earnings, cash flow, financial condition and other relevant factors. Other InformationAs of December 31, 2019, the Company's total cash and cash equivalents, current and non-current time deposits and short-term investments balance totaled RMB74,406.0 million (US$10,687.8 million), compared to RMB49,652.5 million as of December 31, 2018. Cash flow generated from continuing operating activities was RMB16,911.0 million (US$2,429.1 million) for fiscal year 2019, compared to RMB14,659.8 million for fiscal year 2018.  Share Repurchase/ Purchase ProgramOn November 14, 2018, the Company announced that its board of directors had approved a share repurchase program of up to US$1.0 billion of the Company's outstanding ADSs for a period not to exceed 12 months beginning on November 16, 2018. As of November 15, 2019, the last day of such program, approximately 1,000 ADSs had been repurchased under this program.On November 20, 2019, the Company announced that its board of directors had approved a share purchase program of up to US$20.0 million of Youdao's outstanding ADSs for a period not to exceed 12 months beginning on November 25, 2019. Under the terms of this program, NetEase may purchase Youdao's ADSs in open-market transactions on the New York Stock Exchange. As of December 31, 2019, approximately 50,000 ADSs had been purchased under this program.On February 26, 2020, the Company announced that its board of directors had approved a share repurchase program of up to US$1.0 billion of the Company's outstanding ADSs for a period not to exceed 12 months beginning on March 2, 2020. Under the terms of this program, NetEase may repurchase its issued and outstanding ADSs in open-market transactions on the NASDAQ Global Select Market.For both of the above-mentioned current programs, it is expected that the timing and dollar amount of purchase transactions will be in accordance with the Securities and Exchange Commission (SEC) Rule 10b-18 requirements and such purchases may be affected pursuant to a plan in conformity with SEC Rule 10b5-1. The extent to which NetEase repurchases its ADSs or purchases Youdao's ADSs will depend upon a variety of factors, including market conditions. These programs may be suspended or discontinued at any time.** The United States dollar (US$) amounts disclosed in this press release are presented solely for the convenience of the reader. Translations of amounts from RMB into United States dollars for the convenience of the reader were calculated at the noon buying rate of US$1.00 = RMB 6.9618 on December 31, 2019 as set forth in the H.10 statistical release of the U.S. Federal Reserve Board. No representation is made that the RMB amounts could have been, or could be, converted into US$ at that rate on December 31, 2019, or at any other certain date. The percentages stated are calculated based on RMB.Change in Segment ReportingEffective in the third quarter of 2019, the Company changed its segment disclosure to add the financial results of its certain advertising services and Yanxuan into innovative businesses and others in light of the relatively small revenue contribution from those businesses to the Company's total consolidated net revenues in 2019. The Company sold its Kaola e-commerce business in September 2019. In addition, the Company has commenced separately reporting the results of its majority-controlled subsidiary Youdao, Inc. which completed its initial public offering and listing on the New York Stock Exchange in October 2019. As a result, since the third quarter of 2019 the Company has reported the following segments: online game services, Youdao and innovative businesses and others. The Company retrospectively revised prior period segment information to conform to current period presentation. This change in segment reporting aligns with the manner in which the Company's operating decision maker (\"CODM\") currently receives and uses financial information to allocate resources and evaluate the performance of reporting segments.  Impact of the Recently Adopted Major Accounting PronouncementsIn February 2016, the FASB issued ASU 2016-02 \"Leases\" as amended, which generally requires lessees to recognize operating and financing lease liabilities and corresponding right-of-use assets on the balance sheet and to provide enhanced disclosures surrounding the amount, timing and uncertainty of cash flows arising from leasing arrangements. The Company adopted the new standard effective January 1, 2019 on a modified retrospective basis and did not restate comparative periods. The Company recognized approximately RMB577.0 million as total right-of-use assets as well as total lease liabilities for the operating leases on its consolidated balance sheet as of January 1, 2019, excluding the impact from held-for-sale businesses. The Company recognized RMB463.7 million and RMB471.4 million as total right-of-use assets and total lease liabilities, respectively, for the operating leases on its consolidated balance sheet as of December 31, 2019. Right-of-use assets are included in other long-term assets, and lease liabilities are included in accrual liabilities and other payables and other long-term payables, respectively based on payment terms on the consolidated balance sheet. Other than the foregoing, the Company does not expect the new standard to have a material impact on the net assets of the Company's consolidated financial statements.Notes to Unaudited Financial InformationThe unaudited financial information disclosed in this press release is preliminary. The audit of the financial statements and related notes to be included in the Company's annual report on Form 20-F for the year ended December 31, 2019 is still in progress. In addition, because an audit of the Company's internal controls over financial reporting in connection with section 404 of the Sarbanes-Oxley Act of 2002 has not yet been completed, the Company makes no representation as to the effectiveness of those internal controls as of the end of fiscal year 2019.Adjustments to the financial statements may be identified when the audit work is completed, which could result in significant differences between the Company's audited financial statements and this preliminary unaudited financial information. Conference Call NetEase's management team will host a teleconference call with simultaneous webcast at 9:00 p.m. Eastern Time on Wednesday, February 26, 2020 (Beijing/Hong Kong Time: 10:00 a.m., Thursday, February 27, 2020). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0324 and providing conference ID: 3349954, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 3349954#. The replay will be available through March 11, 2020.This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com. About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also offers other innovative services, including the intelligent learning services of its majority-controlled subsidiary, Youdao, music streaming and its private label e-commerce platform, Yanxuan. For more information, please visit: http://ir.netease.com/.Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including risks related to: the risk that the online game market will not continue to grow or that NetEase will not be able to maintain its leading position in that market within China or globally, which could occur if, for example, its new online games or expansion packs and other improvements to its existing games do not become as popular as management anticipates; the risk that Covid-19 or other health risks in China or globally could adversely affect the Company's operations or financial results; the ability of NetEase to effectively market its games and other services and achieve a positive return on its marketing expenditures; the risk that changes in Chinese government regulation of the market for online games, education products and services and e-commerce may limit future growth of NetEase's revenues or cause revenues to decline; the risk that NetEase may not be able to continuously develop new and creative online services or that NetEase will not be able to set, or follow in a timely manner, trends in the market; the risk that the e-commerce market or the internet advertising market in China will not grow and will remain subject to intense competition; the risk that NetEase will not be able to control its expenses in future periods; competition in NetEase's existing and potential markets; governmental uncertainties (including possible changes in the effective tax rates applicable to NetEase and its subsidiaries and affiliates and the ability of NetEase to receive and maintain approvals of the preferential tax treatments); the risk that fluctuations in the value of the Renminbi with respect to other currencies could adversely affect NetEase's business and financial results; and other risks outlined in NetEase's filings with the Securities and Exchange Commission. NetEase does not undertake any obligation to update this forward-looking information, except as required under the applicable law.Non-GAAP Financial Measures NetEase considers and uses non-GAAP financial measures, such as non-GAAP net income from continuing operations attributable to the Company's shareholders and non-GAAP basic and diluted net income from continuing operations per ADS, as supplemental metrics in reviewing and assessing its operating performance and formulating its business plan. The presentation of non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"). NetEase defines non-GAAP net income from continuing operations attributable to the Company's shareholders as net income from continuing operations attributable to the Company's shareholders excluding share-based compensation expenses. Non-GAAP net income from continuing operations attributable to the Company's shareholders enables NetEase's management to assess its operating results without considering the impact of share-based compensation expenses, which are non-cash charges. NetEase believes that these non-GAAP financial measures provide useful information to investors in understanding and evaluating the Company's current operating performance and prospects in the same manner as management does, if they so choose. NetEase also believes that the use of this non-GAAP financial measure facilitates investors' assessment of its operating performance.Non-GAAP financial measures are not defined under U.S. GAAP and are not presented in accordance with U.S. GAAP. Non-GAAP financial measures have limitations as analytical tools. One of the key limitations of using non-GAAP net income from continuing operations attributable to the Company's shareholders is that it does not reflect all items of expense/ income that affect our operations. Share-based compensation expenses have been and may continue to be incurred in our business and are not reflected in the presentation of non-GAAP net income from continuing operations attributable to the Company's shareholders. In addition, the non-GAAP financial measures NetEase uses may differ from the non-GAAP measures used by other companies, including peer companies, and therefore their comparability may be limited.NetEase compensates for these limitations by reconciling non-GAAP net income from continuing operations attributable to the Company's shareholders to the nearest U.S. GAAP performance measure, all of which should be considered when evaluating the Company's performance. See \"Reconciliation of GAAP and Non-GAAP Results\" at the end of this press release. NetEase encourages you to review its financial information in its entirety and not rely on a single financial measure. Contact for Media and Investors:Margaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsnetease@thepiacentegroup.comTel: (+1) 212-481-2050             NETEASE, INC. NOTES TO UNAUDITED FINANCIAL INFORMATION Note 1: The conversion of Renminbi (RMB) into United States dollars (USD) is based on the noon buying rate of USD1.00 = RMB 6.9618 on the last trading day of December 2019 (December 31, 2019) as set forth in the H.10 statistical release of the U.S. Federal Reserve Board. Note 2: Share-based compensation cost reported in the Company's unaudited condensed consolidated statements of comprehensive income is set out as follows in RMB and USD (in thousands):      View original content:http://www.prnewswire.com/news-releases/netease-reports-fourth-quarter-and-fiscal-year-2019-unaudited-financial-results-301011653.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase to Report Fourth Quarter and Fiscal Year 2019 Financial Results on February 26",
        "subtitle": "",
        "date": "Feb 18, 2020 7:00AM EST",
        "content": "BEIJING, Feb. 18, 2020 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced that it will report financial results for the fourth quarter and fiscal year 2019 on Wednesday, February 26, 2020, after the close of the U.S. markets.The earnings teleconference call with simultaneous webcast will take place at 9:00 p.m. Eastern Time on Wednesday, February 26, 2020 (Beijing/Hong Kong Time: 10:00 a.m., Thursday, February 27, 2020). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0324 and providing conference ID: 3349954, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 3349954#. The replay will be available through March 11, 2020.This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com/.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also offers other innovative services, including the intelligent learning services of its majority-controlled subsidiary, Youdao, music streaming and its private label e-commerce platform, Yanxuan. For more information, please visit: http://ir.netease.com/. Contact for Media and Investors:Margaret Shi NetEase, Inc. ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsnetease@thepiacentegroup.comTel: (+1) 212-481-2050 View original content:http://www.prnewswire.com/news-releases/netease-to-report-fourth-quarter-and-fiscal-year-2019-financial-results-on-february-26-301006346.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Selected for 2020 Bloomberg Gender-Equality Index",
        "subtitle": "",
        "date": "Jan 22, 2020 7:00AM EST",
        "content": "HANGZHOU, China, Jan. 22, 2020 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced that it has been named to the 2020 Bloomberg Gender-Equality Index (GEI), which distinguishes companies committed to transparency in gender reporting and advancing gender equality. The 2020 Gender-Equality Index comprises 325 global companies with a combined market capitalization of US$12 trillion. Headquartered across more than 40 countries and regions, these companies span a variety of industries, including automotive, banking, consumer services, engineering and construction and retail. Only three companies headquartered in Chinese mainland were included in the index. \"We are pleased to have been included in the GEI, which shows that our commitment and practices to promote employee welfare are being recognized globally,\" said William Ding, founder and CEO of NetEase. \"Equality and diversity are highly valued at NetEase. We respect and support every employee's needs for advancement at evolving stages of their lives and careers. We believe recognizing and honoring these human needs supports our sustainable growth and our mission to deliver more innovative and user-oriented products to the market,\" said Mr. Ding. The GEI tracks the financial performance of public companies committed to supporting gender equality and the reference index measures gender equality across different pillars.According to NetEase's standards and policies:Currently, a significant proportion of NetEase's management positions are held by women. \"The 325 companies included in the 2020 GEI have shown their commitment to transparency and demonstrated leadership in gender-related data reporting,\" said Peter T. Grauer, Chairman of Bloomberg. \"Disclosure of company statistics and practices is an important first step in supporting gender equality globally.\"About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also offers other innovative services, including the intelligent learning services of its majority-controlled subsidiary, Youdao, music streaming and its private label e-commerce platform, Yanxuan. For more information, please visit: http://ir.netease.com/.About BloombergBloomberg, the global business and financial information and news leader, gives influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company's strength – delivering data, news and analytics through innovative technology, quickly and accurately – is at the core of the Bloomberg Terminal. Bloomberg's enterprise solutions build on the company's core strength: leveraging technology to allow customers to access, integrate, distribute and manage data and information across organizations more efficiently and effectively. For more information, visit www.bloomberg.com or request a demo.Contact for Investors:Margaret ShiNetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Contact for Media:NetEase, Inc.Li Ruohan Tel: (+86) 571-8985-3378 globalpr@service.netease.com Bloomberg LPVeronika HenzeTel: +1-646-324-1596vhenze@bloomberg.net  View original content:http://www.prnewswire.com/news-releases/netease-selected-for-2020-bloomberg-gender-equality-index-300990888.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Reports Third Quarter 2019 Unaudited Financial Results",
        "subtitle": "",
        "date": "Nov 20, 2019 6:00PM EST",
        "content": "BEIJING, Nov. 20, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced its unaudited financial results for the third quarter ended September 30, 2019.Third Quarter 2019 Financial Highlights[1]Third Quarter 2019 and Recent Operational Highlights\"During our eventful third quarter, we realized value for our shareholders across our business lines. On a year-over-year basis, we achieved solid growth in net revenues of 11% and non-GAAP net income from continuing operations of 74%. In recognition of this success, our board of directors has approved a dividend of US$7.59 per ADS for the third quarter,\" said Mr. William Ding, Chief Executive Officer and Director of NetEase. \"Our main areas of investment are online games, online education, music and private label e-commerce. With the completion of Youdao's IPO, we will continue to invest in knowledge tools, online courses and smart devices to empower even more efficient learning in China.\"Online games remain the cornerstone of our business with steady growth from our existing titles and exciting new titles in China and globally. Our flagship title Fantasy Westward Journey Online reached new record high gross billings this quarter. We also advanced our international brand with more hit titles such as Knives Out, Identity V and Life-After in Japan. Going forward, we will continue to focus on the growth of our robust online games business worldwide, as well as create additional value among our evolving businesses rooted in education, music and e-commerce,\" Mr. Ding concluded.Third Quarter 2019 Financial ResultsNet RevenuesNet revenues for the third quarter of 2019 were RMB14,635.7 million (US$2,047.6 million), compared to RMB14,448.4 million and RMB13,160.2 million for the preceding quarter and the third quarter of 2018, respectively.Net revenues from online game services were RMB11,534.8 million (US$1,613.8 million) for the third quarter of 2019, compared to RMB11,433.4 million and RMB10,348.4 million for the preceding quarter and the third quarter of 2018, respectively. Net revenues from mobile games accounted for approximately 71.0% of net revenues from online game services for the third quarter of 2019, compared to 72.2% and 68.0% for the preceding quarter and the third quarter of 2018, respectively.Net revenues from Youdao were RMB345.9 million (US$48.4 million) for the third quarter of 2019, compared to RMB322.8 million and RMB174.4 million for the preceding quarter and the third quarter of 2018, respectively. Net revenues from innovative businesses and others were RMB2,755.0 million (US$385.4 million) for the third quarter of 2019, compared to RMB2,692.3 million and RMB2,637.4 million for the preceding quarter and the third quarter of 2018, respectively. Gross ProfitGross profit for the third quarter of 2019 was RMB7,870.4 million (US$1,101.1 million), compared to RMB7,736.8 million and RMB7,224.1 million for the preceding quarter and the third quarter of 2018, respectively. The quarter-over-quarter increase in online game services gross profit was primarily due to increased net revenues from certain PC-client games. The year-over-year increase in online game services gross profit was primarily due to increased net revenues from mobile games such as Life-After, Invincible and Identity V. The year-over-year increase in Youdao gross profit was primarily due to increased net revenues from its learning services and products, which in turn was driven by an increased number of paid student enrollments.The year-over-year decrease in innovative businesses and others gross profit was primarily due to decreased net revenues from certain advertising services which were affected by the macro-environment and increased expenses related to staff cost and content purchases.Gross Profit Margin Gross profit margin for online game services for the third quarter of 2019 was 63.8%, compared to 63.1% and 65.1% for the preceding quarter and the third quarter of 2018, respectively. The year-over-year decrease in gross profit margin was mainly due to higher revenue contribution from mobile games with comparatively lower margin. Gross profit margin for Youdao for the third quarter of 2019 was 25.8%, compared to 32.9% and 23.3% for the preceding quarter and the third quarter of 2018, respectively. The quarter-over-quarter decrease in Youdao gross profit margin was mainly driven by a lower gross margin for its online marketing services.Gross profit margin for innovative businesses and others for the third quarter of 2019 was 15.2%, compared to 15.5% and 17.0% for the preceding quarter and the third quarter of 2018, respectively. The year-over-year decrease in innovative businesses and others gross profit margin was primarily due to decreased net revenues from certain advertising services which were affected by the macro-environment and increased expenses related to staff cost and content purchases.Operating ExpensesTotal operating expenses for the third quarter of 2019 were RMB4,535.6 million (US$634.6 million), compared to RMB4,012.5 million and RMB4,688.6 million for the preceding quarter and the third quarter of 2018, respectively. The quarter-over-quarter increase in operating expenses was mainly due to increased marketing expenditures related to online game services and Youdao, as well as increased staff-related costs. The year-over-year decrease in operating expenses was mainly due to decreased marketing expenditures related to online games. Other IncomeOther income consisted of investment (loss)/ income, interest income, foreign exchange gains and others. The quarter-over-quarter and year-over-year increases in other income were mainly due to the gain from the disposal of Kaola and investment income.  Income TaxesThe Company recorded a net income tax charge of RMB1,116.7 million (US$156.2 million) for the third quarter of 2019, compared to RMB683.8 million and RMB842.9 million for the preceding quarter and the third quarter of 2018, respectively. The effective tax rate for the third quarter of 2019 was 8.0%, compared to 16.7% and 28.8% for the preceding quarter and the third quarter of 2018, respectively. The effective tax rate represents certain estimates by the Company regarding the tax obligations and benefits applicable to it in each quarter, and the rate for the third quarter was affected by a number of factors including certain tax credits received and recognized in the quarter.Net Income and Non-GAAP Net IncomeNet income from continuing operations attributable to the Company's shareholders for the third quarter of 2019 totaled RMB12,885.4 million (US$1,802.7 million), compared to RMB3,354.2 million and RMB2,062.7 million for the preceding quarter and the third quarter of 2018, respectively. Non-GAAP net income from continuing operations attributable to the Company's shareholders for the third quarter of 2019 totaled RMB4,726.0 million (US$661.2 million), compared to RMB3,921.1 million and RMB2,712.3 million for the preceding quarter and the third quarter of 2018, respectively. NetEase reported basic and diluted net income from continuing operations per ADS of US$13.97 and US$13.85, respectively, for the third quarter of 2019. The Company reported basic and diluted net income from continuing operations per ADS of US$3.64 and US$3.61, respectively, for the preceding quarter, and basic and diluted net income from continuing operations per ADS of US$2.25 and US$2.24 for the third quarter of 2018. Non-GAAP basic and diluted net income from continuing operations per ADS were US$5.12 and US$5.08, respectively, for the third quarter of 2019, compared to non-GAAP basic and diluted net income from continuing operations per ADS of US$4.26 and US$4.22, respectively, for the preceding quarter, and non-GAAP basic and diluted net income from continuing operations per ADS of US$2.95 and US$2.94, respectively, for the third quarter of 2018.       Quarterly DividendThe basic net income per ADS was US$13.80 for the third quarter of 2019. The board of directors has approved a dividend of US$7.59 per ADS for the third quarter of 2019. Such amount includes a regular quarterly dividend of US$4.14 per ADS (equivalent to approximately 30% of the Company's net income attributable to the Company's shareholders), plus a special dividend of US$3.45 per ADS. The total dividend of approximately US$1.0 billion is expected to be paid on December 13, 2019 to shareholders of record as of the close of business on December 6, 2019.NetEase paid a dividend of US$1.04 per ADS for the second quarter of 2019 on August 30, 2019.  Starting in the second quarter of 2019, the Company's policy has been to set quarterly dividends at an amount equivalent to approximately 20%-30% of the Company's anticipated net income after tax in each fiscal quarter. The determination to make dividend distributions and the amount of such distributions in any particular quarter will be made at the discretion of the board of directors and will be based upon the Company's operations and earnings, cash flow, financial condition and other relevant factors.Other InformationAs of September 30, 2019, the Company's total cash and cash equivalents, current and non-current time deposits and short-term investments balance totaled RMB61,431.7 million (US$8,594.6 million), compared to RMB49,663.5 million as of December 31, 2018. Cash flow generated from continuing operating activities was RMB3,846.3 million (US$538.1 million) for the third quarter of 2019, compared to RMB4,928.1 million and RMB4,491.9 million for the preceding quarter and the third quarter of 2018, respectively.Share Repurchase/ Purchase ProgramOn November 14, 2018, the Company announced that its board of directors had approved a share repurchase program of up to US$1.0 billion of the Company's outstanding ADSs for a period not to exceed 12 months beginning on November 16, 2018. As of November 15, 2019, the last day of such program, approximately 1,000 ADSs had been repurchased under this program.The Company also announced today that its board of directors has approved a share purchase program of up to US$20.0 million of Youdao's outstanding ADSs for a period not to exceed 12 months beginning on November 25, 2019.Under the terms of this program, NetEase may purchase Youdao's ADSs in open-market transactions on the New York Stock Exchange. It is expected that the timing and dollar amount of purchase transactions will be in accordance with the Securities and Exchange Commission (SEC) Rule 10b-18 requirements and such purchases may be effected pursuant to a plan in conformity with SEC Rule 10b5-1. The extent to which NetEase purchases Youdao's ADSs will depend upon a variety of factors, including market conditions. This purchase program may be suspended or discontinued at any time.** The United States dollar (US$) amounts disclosed in this press release are presented solely for the convenience of the reader. Translations of amounts from RMB into United States dollars for the convenience of the reader were calculated at the noon buying rate of US$1.00 = RMB7.1477 on September 30, 2019 as set forth in the H.10 statistical release of the U.S. Federal Reserve Board. No representation is made that the RMB amounts could have been, or could be, converted into US$ at that rate on September 30, 2019, or at any other certain date. The percentages stated are calculated based on RMB.Change in Segment ReportingEffective in the third quarter of 2019, the Company changed its segment disclosure to add the financial results of its certain advertising services and Yanxuan into innovative businesses and others in light of the relatively small revenue contribution from those businesses to the Company's total consolidated net revenues in 2019. The Company sold its Kaola e-commerce business in September 2019. In addition, the Company has commenced separately reporting the results of its majority-controlled subsidiary Youdao, Inc. which completed its initial public offering and listing on the New York Stock Exchange in October 2019. As a result, the Company now reports segments as online game services, Youdao and innovative businesses and others. This change in segment reporting aligns with the manner in which the Company's operating decision maker (\"CODM\") currently receives and uses financial information to allocate resources and evaluate the performance of reporting segments. The Company retrospectively revised prior period segment information to conform to current period presentation.Impact of the Recently Adopted Major Accounting PronouncementIn February 2016, the FASB issued ASU 2016-02 \"Leases\" as amended, which generally requires lessees to recognize operating and financing lease liabilities and corresponding right-of-use assets on the balance sheet and to provide enhanced disclosures surrounding the amount, timing and uncertainty of cash flows arising from leasing arrangements. The Company adopted the new standard effective January 1, 2019 on a modified retrospective basis and did not restate comparative periods. The Company recognized approximately RMB577.0 million as total right-of-use assets as well as total lease liabilities for the operating leases on its consolidated balance sheet as of January 1, 2019, excluding the impact from disposal of Kaola. The Company recognized RMB441.1 million and RMB449.8 million as total right-of-use assets and total lease liabilities, respectively, for the operating leases on its consolidated balance sheet as of September 30, 2019. Right-of-use assets are included in other long-term assets, and lease liabilities are included in accrual liabilities and other payables and other long-term payables, respectively based on payment terms on the consolidated balance sheet. Other than the foregoing, the Company does not expect the new standard to have a material impact on the net assets of the Company's consolidated financial statements.Conference Call NetEase's management team will host a teleconference call with simultaneous webcast at 9:00 p.m. Eastern Time on Wednesday, November 20, 2019 (Beijing/Hong Kong Time: 10:00 a.m., Thursday, November 21, 2019). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0402 and providing conference ID: 7150397, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 7150397#. The replay will be available through December 4, 2019. This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also offers other innovative services, including the intelligent learning services of its majority-controlled subsidiary, Youdao, music streaming and its private label e-commerce platform, Yanxuan. For more information, please visit: http://ir.netease.com/.  Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including risks related to: the risk that the online game market will not continue to grow or that NetEase will not be able to maintain its leading position in that market within China or globally, which could occur if, for example, its new online games or expansion packs and other improvements to its existing games do not become as popular as management anticipates; the ability of NetEase to effectively market its games and other services and achieve a positive return on its marketing expenditures; the risk that changes in Chinese government regulation of the market for online games, education products and services and e-commerce may limit future growth of NetEase's revenues or cause revenues to decline; the risk that NetEase may not be able to continuously develop new and creative online services or that NetEase will not be able to set, or follow in a timely manner, trends in the market; the risk that the e-commerce market or the internet advertising market in China will not grow and will remain subject to intense competition; the risk that NetEase will not be able to control its expenses in future periods; competition in NetEase's existing and potential markets; governmental uncertainties (including possible changes in the effective tax rates applicable to NetEase and its subsidiaries and affiliates and the ability of NetEase to receive and maintain approvals of the preferential tax treatments); the risk that fluctuations in the value of the Renminbi with respect to other currencies could adversely affect NetEase's business and financial results; and other risks outlined in NetEase's filings with the Securities and Exchange Commission. NetEase does not undertake any obligation to update this forward-looking information, except as required under the applicable law.Non-GAAP Financial Measures NetEase considers and uses non-GAAP financial measures, such as non-GAAP net income from continuing operations attributable to the Company's shareholders and non-GAAP basic and diluted net income from continuing operations per ADS, as supplemental metrics in reviewing and assessing its operating performance and formulating its business plan. The presentation of non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"). NetEase defines non-GAAP net income from continuing operations attributable to the Company's shareholders as net income from continuing operations attributable to the Company's shareholders excluding share-based compensation expenses and net gain from disposal of business due to change in business focus. Non-GAAP net income from continuing operations attributable to the Company's shareholders enables NetEase's management to assess its operating results without considering the impact of share-based compensation expenses and net gain from disposal of business due to change in business focus, which are non-cash charges or non-recurring in nature. NetEase believes that these non-GAAP financial measures provide useful information to investors in understanding and evaluating the Company's current operating performance and prospects in the same manner as management does, if they so choose. NetEase also believes that the use of this non-GAAP financial measure facilitates investors' assessment of its operating performance.Non-GAAP financial measures are not defined under U.S. GAAP and are not presented in accordance with U.S. GAAP. Non-GAAP financial measures have limitations as analytical tools. One of the key limitations of using non-GAAP net income from continuing operations attributable to the Company's shareholders is that it does not reflect all items of expense/ income that affect our operations. Share-based compensation expenses and net gain from disposal of business due to change in business focus have been and may continue to be incurred in our business and are not reflected in the presentation of non-GAAP net income from continuing operations attributable to the Company's shareholders. In addition, the non-GAAP financial measures NetEase uses may differ from the non-GAAP measures used by other companies, including peer companies, and therefore their comparability may be limited.NetEase compensates for these limitations by reconciling non-GAAP net income from continuing operations attributable to the Company's shareholders to the nearest U.S. GAAP performance measure, all of which should be considered when evaluating the Company's performance. See \"Reconciliation of GAAP and Non-GAAP Results\" at the end of this press release. NetEase encourages you to review its financial information in its entirety and not rely on a single financial measure.  Contact for Media and Investors:Margaret ShiNetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsnetease@thepiacentegroup.com Tel: (+1) 212-481-2050           NETEASE, INC.NOTES TO UNAUDITED FINANCIAL INFORMATIONNote 1: The conversion of Renminbi (RMB) into United States dollars (USD) is based on the noon buying rate             of USD1.00 = RMB7.1477 on the last trading day of September (September 30, 2019) as set forth in             the H.10 statistical release of the U.S. Federal Reserve Board.Note 2: Share-based compensation cost reported in the Company's unaudited condensed consolidated             statements of comprehensive income is set out as follows in RMB and USD (in thousands):    View original content:http://www.prnewswire.com/news-releases/netease-reports-third-quarter-2019-unaudited-financial-results-300961986.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase to Report Third Quarter 2019 Financial Results on November 20",
        "subtitle": "",
        "date": "Nov 5, 2019 7:00AM EST",
        "content": "BEIJING, Nov. 5, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced that it will report financial results for the 2019 third quarter on Wednesday, November 20, 2019, after the close of the U.S. markets.The earnings teleconference call with simultaneous webcast will take place at 9:00 p.m. Eastern Time on Wednesday, November 20, 2019 (Beijing/Hong Kong Time: 10:00 a.m., Thursday, November 21, 2019). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0402 and providing conference ID: 7150397, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 7150397#. The replay will be available through December 4, 2019.This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com/.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also offers other innovative services, including the intelligent learning services of its majority-controlled subsidiary, Youdao, music streaming and its private label e-commerce platform, Yanxuan. For more information, please visit: http://ir.netease.com/.Contact for Media and Investors:Margaret Shi NetEase, Inc.ir@service.netease.com Tel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsbrandi@corp.netease.com Tel: (+1) 212-481-2050 View original content:http://www.prnewswire.com/news-releases/netease-to-report-third-quarter-2019-financial-results-on-november-20-300951557.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Announces Pricing of Initial Public Offering of Youdao, Inc.",
        "subtitle": "",
        "date": "Oct 25, 2019 6:45AM EDT",
        "content": "BEIJING, Oct. 25, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced the pricing of the initial public offering (the \"IPO\") by its majority-controlled subsidiary Youdao, Inc. (\"Youdao\") of 5,600,000 American depositary shares (\"ADSs\"), at US$17.0 per ADS. The aggregate offering size of the IPO and the concurrent private placement described below is approximately US$220.2 million (inclusive of approximately US$95.2 million of ADSs sold in the IPO), assuming the underwriters do not exercise their over-allotment option to purchase any additional ADSs, and approximately US$234.5 million (inclusive of approximately US$109.5 million of ADSs sold in the IPO), assuming the underwriters exercise their over-allotment option in full. Each ADS represents one Class A ordinary share of Youdao. The ADSs are expected to begin trading on the New York Stock Exchange today under the ticker symbol \"DAO.\"  Youdao has granted the underwriters an option, exercisable for 30 days from the date of the final prospectus, to purchase up to an aggregate of 840,000 additional ADSs to cover over-allotments. Citigroup Global Markets Inc., Morgan Stanley & Co. LLC and Credit Suisse Securities (USA) LLC are acting as the joint bookrunners of the offering and representatives of the underwriters. China International Capital Corporation Hong Kong Securities Limited, Tiger Brokers (NZ) Limited and HSBC Securities (USA) Inc. are also acting as the joint bookrunners of the offering. Concurrently with and subject to the completion of the IPO, certain investment funds managed by Orbis Investment Management Limited have agreed to purchase from Youdao a total of 7,352,941 Class A ordinary shares at an aggregate investment amount of US$125 million, in a private placement transaction pursuant to exemptions from registration with the U.S. Securities and Exchange Commission (the \"SEC\") under Regulation S of the Securities Act of 1933, as amended.  Youdao's registration statement related to these securities has been filed with, and declared effective by, the SEC. This press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.This offering is being made only by means of a prospectus forming part of the effective registration statement. A copy of the final prospectus relating to the offering may be obtained, when available, by contacting the following underwriters: (1) Citigroup Global Markets Inc., Address: Broadridge, 1155 Long Island Avenue, Bays 4-9, Edgewood, New York, NY 11717, United States, by telephone at +1-800-831-9146; (2) Morgan Stanley & Co. LLC, Attention: Prospectus Department, at Room 214, 180 Varick Street, New York, NY 10014, United States, by telephone at +1-866-718-1649; (3) Credit Suisse Securities (USA) LLC, Attention: Prospectus Department, at 3rd Floor, Eleven Madison Avenue, New York, NY 10010, United States, by telephone at +1-800-221-1037; (4) China International Capital Corporation Hong Kong Securities Limited, Address: 29th Floor, One International Finance Centre, 1 Harbour View Street, Central, Hong Kong, by telephone at +852-2872-2000; (5) Tiger Brokers (NZ) Limited, Address: Level 4, 142 Broadway, Newmarket, Auckland, New Zealand 1023, by telephone at +64-9-393-8128; and (6) HSBC Securities (USA) Inc., Attention: Prospectus Department, at 452 Fifth Avenue, New York, NY 10018, United States, by telephone at +1-212-525-0272.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company in China. Dedicated to providing online services centered around content, community, communication and commerce, NetEase develops and operates some of China's most popular PC-client and mobile games, e-commerce businesses and advertising services, as well as a variety of other innovative businesses. In partnership with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers, NetEase also operates some of the most popular international online games in China. For more information, please visit: http://ir.netease.com/.Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including those risks outlined in NetEase's filings with the Securities and Exchange Commission. NetEase does not undertake any obligation to update this forward-looking information, except as required under the applicable law.Contact for Media and Investors: Margaret Shi NetEase, Inc.ir@service.netease.com Tel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsbrandi@corp.netease.comTel: (+1) 212-481-2050 View original content:http://www.prnewswire.com/news-releases/netease-announces-pricing-of-initial-public-offering-of-youdao-inc-300945485.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "Alibaba Acquires Import E-Commerce Platform Kaola from NetEase for Approximately US$2 Billion",
        "subtitle": "Alibaba also agrees to take a minority stake in NetEase Cloud Music",
        "date": "Sep 5, 2019 8:00PM EDT",
        "content": "HANGZHOU, China, Sept. 5, 2019 /PRNewswire/ -- NetEase, Inc. (\"NetEase\") (NASDAQ: NTES) and Alibaba Group Holding Limited (\"Alibaba\") (NYSE: BABA) today announced Alibaba's acquisition of NetEase's import e-commerce platform Kaola for approximately US$2 billion. The transaction paves the way for the two internet companies with deep roots in Hangzhou to further identify and explore business collaborations.Alibaba plans for Kaola to continue to operate independently under its current brand. Tmall Import and Export General Manager Alvin Liu will serve as Kaola's new CEO. In addition, Alibaba and NetEase have entered into a definitive agreement for Alibaba, together with Yunfeng, to invest approximately US$700 million in NetEase Cloud Music in its latest round of financing. The completion of this transaction is subject to certain closing conditions. NetEase will remain the controlling shareholder of NetEase Cloud Music following the closing of this transaction.\"We are pleased to have found a strategic fit for Kaola within Alibaba's extensive ecosystem, where Kaola will continue to provide Chinese consumers with high-quality import products and services. At the same time, the completion of this strategic transaction will allow NetEase to focus on its growth strategy, investing in markets that allow us to best leverage our competitive advantages. We remain fully committed to offering our users best-in-class and differentiated online content born from our relentless drive for craftsmanship and innovation,\" said William Ding, the Chief Executive Officer of NetEase. \"As the controlling shareholder of NetEase Cloud Music, we will continue to fully support the growth of this business, helping it to realize its strategic goals in the music industry.\"\"Alibaba is confident about the future of China's import e-commerce market, which we believe remains in its infancy with great growth potential. We welcome Kaola to the Alibaba family and value NetEase's contributions in incubating an e-commerce platform with strong import capabilities. With Kaola, we will further elevate import service and experience for Chinese consumers through synergies across the Alibaba ecosystem,\" said Daniel Zhang, Chief Executive Officer of Alibaba Group. \"Alibaba also looks forward to becoming a partner in the future development of NetEase Cloud Music and exploring innovative collaboration in the digital entertainment space.\"About NetEaseNetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also operates Yanxuan, an e-commerce platform that cater to the rising middle-class consumer market in China as well as offering advertising, e-mail and other innovative services including music and online education. For more information, please visit: http://ir.netease.com/.About Alibaba GroupOur mission is to make it easy to do business anywhere. We aim to build the infrastructure of commerce. We envision that our customers will meet, work and live at Alibaba, and that we will be a company that lasts at least 102 years.Media Contacts Alibaba GroupAdam NajbergTel: +852-54743262adam.najberg@alibaba-inc.com NetEase, Inc.Margaret ShiTel: (+86) 571-8985-3378ir@service.netease.com Safe HarbourThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"aim,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"may,\" \"estimates,\" \"potential,\" \"continue,\" \"ongoing,\" \"goal,\" \"targets,\" \"guidance,\" \"commits\" and similar statements. Among other things, statements that are not historical facts, including statements about business plans and projections, the completion of transactions and the strategic goals of transactions, are or contain forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement. All information contained in this announcement is as of the date of this announcement and are based on assumptions believed to be reasonable as of this date. You should not rely upon these forward-looking statements as predictions of future events. The parties do not undertake any obligation to update any forward-looking statement, except as required under applicable law. View original content:http://www.prnewswire.com/news-releases/alibaba-acquires-import-e-commerce-platform-kaola-from-netease-for-approximately-us2-billion-300913004.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Reports Second Quarter 2019 Unaudited Financial Results",
        "subtitle": "",
        "date": "Aug 7, 2019 7:00PM EDT",
        "content": "BEIJING, Aug. 7, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced its unaudited financial results for the second quarter ended June 30, 2019.Second Quarter 2019 Financial HighlightsSecond Quarter 2019 and Recent Operational Highlights\"Our diverse portfolio of games and dedicated focus on our core business lines continued to lead our growth in the second quarter with net revenues and net income attributable to the Company's shareholders increasing by 15% and 46% year-over-year, respectively,\" said Mr. William Ding, Chief Executive Officer and Director of NetEase. \"We launched several new games in China and abroad in the second quarter, further enriching our strong game portfolio that spans a variety of genres. Our global initiatives are well underway. In addition to Knives Out and Identity V, a number of our new games have gained user recognition in Japan, including Life-After and Cyber Hunter. We are pleased with the progress we have made to introduce our games to international audiences and fortify our relationships with other industry leaders in the video games and entertainment markets. We will continue exploring overseas market opportunities and growing our games business on a global scale. \"We are executing well on our strategy to focus on our core business lines and improve operating efficiencies within each of our primary competencies. Best known for our content creation capabilities, we continue to emphasize product enhancement, offering new innovative content and better user experiences to our growing community of users. With the robust growth of our business in mind, our board of directors has approved a dividend of US$1.04 per ADS for the second quarter. We are delighted to be returning value to our investors as our business continues to boast healthy and growing profits,\" Mr. Ding concluded.Second Quarter 2019 Financial ResultsNet RevenuesNet revenues for the second quarter of 2019 were RMB18,769.0 million (US$2,734.0 million), compared to RMB18,356.2 million and RMB16,283.9 million for the preceding quarter and the second quarter of 2018, respectively.Net revenues from online game services were RMB11,433.4 million (US$1,665.5 million) for the second quarter of 2019, compared to RMB11,850.2 million and RMB10,060.8 million for the preceding quarter and the second quarter of 2018, respectively. Net revenues from mobile games accounted for approximately 72.2% of net revenues from online game services for the second quarter of 2019, compared to 72.1% and 74.7% for the preceding quarter and the second quarter of 2018, respectively.Net revenues from e-commerce were RMB5,246.9 million (US$764.3 million) for the second quarter of 2019, compared to RMB4,789.3 million and RMB4,365.5 million for the preceding quarter and the second quarter of 2018, respectively. Net revenues from advertising services were RMB581.6 million (US$84.7 million) for the second quarter of 2019, compared to RMB438.6 million and RMB634.1 million for the preceding quarter and the second quarter of 2018, respectively. The top performing advertising verticals in the second quarter of 2019 were real estate, automobile and internet services sectors.Net revenues from innovative businesses and others were RMB1,507.2 million (US$219.5 million) for the second quarter of 2019, compared to RMB1,278.1 million and RMB1,223.5 million for the preceding quarter and the second quarter of 2018, respectively. Gross Profit/(Loss)Gross profit for the second quarter of 2019 was RMB8,125.8 million (US$1,183.7 million), compared to RMB8,091.0 million and RMB7,245.1 million for the preceding quarter and the second quarter of 2018, respectively. The quarter-over-quarter decrease in online game services gross profit was primarily due to decreased net revenues from mobile games while certain cost of revenues was fixed. The year-over-year increase in online game services gross profit was primarily due to increased net revenues from mobile games such as Life-After, as well as certain PC-client games such as Justice and Fantasy Westward Journey Online. The quarter-over-quarter and year-over-year increases in e-commerce gross profit were primarily due to the increased sales volume of Kaola and Yanxuan, as well as continuously improved procurement and operation processes. The quarter-over-quarter increase in advertising services gross profit was primarily due to seasonality. The year-over-year decrease in advertising services gross profit was primarily due to decreased revenue contribution based on the evolving competitive macro-environment, and increased expenses related to staff and content purchases.The quarter-over-quarter and year-over-year increases in innovative businesses and others gross profit were primarily due to increased net revenues from NetEase Cloud Music, NetEase CC and Youdao Online Education, as well as better cost controls.Gross Profit/ (Loss) Margin Gross profit margin for online game services for the second quarter of 2019 was 63.1%, compared to 63.7% and 64.3% for the preceding quarter and the second quarter of 2018, respectively. The quarter-over-quarter and year-over-year decreases in gross profit margin were mainly due to higher royalty fees and revenue sharing costs recognized for certain mobile games. Gross profit margin for e-commerce for the second quarter of 2019 was 10.9%, compared to 10.2% and 10.1% for the preceding quarter and the second quarter of 2018, respectively. The quarter-over-quarter and year-over-year increases in gross profit margin were primarily due to increased sales volume of Kaola and Yanxuan, as well as continuously improved procurement and operation processes. Gross profit margin for advertising services for the second quarter of 2019 was 55.5%, compared to 49.5% and 67.0% for the preceding quarter and the second quarter of 2018, respectively. The quarter-over-quarter increase in advertising services gross profit margin was primarily due to seasonality. The year-over-year decrease in advertising services gross profit margin was primarily due to decreased revenue contribution resulting from the evolving competitive macro-environment, and increased expenses related to staff and content purchases.Gross profit margin for innovative businesses and others for the second quarter of 2019 was 1.4%, compared to gross loss margin of 13.1% and 7.3% for the preceding quarter and the second quarter of 2018, respectively. The quarter-over-quarter and year-over-year improvements in gross profit margin were primarily due to increased net revenues from NetEase Cloud Music, NetEase CC and Youdao Online Education, as well as better cost controls. Operating ExpensesTotal operating expenses for the second quarter of 2019 were RMB4,639.6 million (US$675.8 million), compared to RMB4,681.6 million and RMB4,911.5 million for the preceding quarter and the second quarter of 2018, respectively. The quarter-over-quarter decrease in operating expenses was mainly due to a slight decrease in staff-related costs, partially offset by increased marketing expenditures related to online game services. The year-over-year decrease in operating expenses was mainly due to decreased marketing expenditures related to NetEase's online game services and e-commerce businesses, partially offset by increased staff-related costs. Shipping and handling costs included in selling and marketing expenses for the second quarter of 2019 were RMB388.2 million (US$56.6 million), compared to RMB404.6 million and RMB386.6 million for the preceding quarter and the second quarter of 2018, respectively.  Income TaxesThe Company recorded a net income tax charge of RMB685.2 million (US$99.8 million) for the second quarter of 2019, compared to RMB1,269.0 million and RMB420.5 million for the preceding quarter and the second quarter of 2018, respectively. The effective tax rate for the second quarter of 2019 was 18.0%, compared to 34.0% and 15.7% for the preceding quarter and the second quarter of 2018, respectively. The lower effective tax rate in the second quarter of 2019 compared to the preceding quarter was mainly due to reduced losses from certain subsidiaries as well as tax credits recognized for certain subsidiaries of the Company. Net Income After TaxNet income attributable to the Company's shareholders for the second quarter of 2019 totaled RMB3,071.4 million (US$447.4 million), compared to RMB2,382.1 million and RMB2,106.5 million for the preceding quarter and the second quarter of 2018, respectively. Non-GAAP net income attributable to the Company's shareholders for the second quarter of 2019 totaled RMB3,645.4 million (US$531.0 million), compared to RMB3,017.0 million and RMB2,724.9 million for the preceding quarter and the second quarter of 2018, respectively. During the second quarter of 2019, the Company had a net foreign exchange gain of RMB24.0 million (US$3.5 million), compared to a net foreign exchange loss of RMB45.4 million and a net foreign exchange gain of RMB232.8 million for the preceding quarter and the second quarter of 2018, respectively. The changes in foreign exchange gains and losses were mainly due to unrealized exchange gains and losses arising from the Company's U.S. dollar-denominated bank deposits and short-term loan balances as the exchange rate of the U.S. dollar against the RMB fluctuated over the periods, as well as certain foreign currency transactions.NetEase reported basic and diluted earnings per ADS of US$3.47 and US$3.44, respectively, for the second quarter of 2019. The Company reported basic and diluted earnings per ADS of US$2.71 and US$2.68, respectively, for the preceding quarter, and basic and diluted earnings per ADS of US$2.36 and US$2.35 for the second quarter of 2018. Non-GAAP basic and diluted earnings per ADS were US$4.12 and US$4.09, respectively, for the second quarter of 2019, compared to non-GAAP basic and diluted earnings per ADS of US$3.43 and US$3.40, respectively, for the preceding quarter, and non-GAAP basic and diluted earnings per ADS of US$3.05 and US$3.04, respectively, for the second quarter of 2018.           Quarterly DividendThe board of directors has approved a dividend of US$1.04 per ADS for the second quarter of 2019, which is expected to be paid on August 30, 2019 to shareholders of record as of the close of business on August 23, 2019.NetEase paid a dividend of US$0.69 per ADS for the first quarter of 2019 on June 7, 2019. The Company's board of directors has determined that, starting in the second quarter of 2019, quarterly dividends will be set at an amount equivalent to approximately 20%-30% of the Company's anticipated net income after tax in each fiscal quarter. The determination to make dividend distributions and the amount of such distributions in any particular quarter will be made at the discretion of the board of directors and will be based upon the Company's operations and earnings, cash flow, financial condition and other relevant factors.Other InformationAs of June 30, 2019, the Company's total cash and cash equivalents, current and non-current time deposits and short-term investments balance totaled RMB55,601.6 million (US$8,099.3 million), compared to RMB50,064.3 million as of December 31, 2018. Cash flow generated from operating activities was RMB4,465.8 million (US$650.5 million) for the second quarter of 2019, compared to RMB3,386.6 million and RMB1,957.9 million for the preceding quarter and the second quarter of 2018, respectively.Share Repurchase ProgramOn November 14, 2018, the Company also announced that its board of directors had approved a new share repurchase program of up to US$1.0 billion of the Company's outstanding ADSs for a period not to exceed 12 months beginning on November 16, 2018. As of June 30, 2019, no ADSs had been repurchased under this program.Under the terms of the current approved program, NetEase may repurchase its issued and outstanding ADSs in open-market transactions on the NASDAQ Global Select Market. The timing and dollar amount of repurchase transactions will be subject to the Securities and Exchange Commission (SEC) Rule 10b-18 requirements. It is also expected that such repurchases will be affected pursuant to a plan in conformity with SEC Rule 10b5-1. The extent to which NetEase repurchases its ADSs will depend upon a variety of factors, including market conditions, regulatory requirements and other corporate considerations, as determined by NetEase's management team. The repurchase program may be suspended or discontinued at any time. ** The United States dollar (US$) amounts disclosed in this press release are presented solely for the convenience of the reader. Translations of amounts from RMB into United States dollars for the convenience of the reader were calculated at the noon buying rate of US$1.00 = RMB6.8650 on June 28, 2019 as set forth in the H.10 statistical release of the U.S. Federal Reserve Board. No representation is made that the RMB amounts could have been, or could be, converted into US$ at that rate on June 28, 2019, or at any other certain date. The percentages stated are calculated based on RMB.Change in Segment ReportingEffective as of December 31, 2018, the Company renamed its \"e-mail and others\" segment to \"innovative businesses and others\" to better articulate the businesses included in this segment, there's no change to the business mix included in this segment. The Company now reports four reporting segments: online game services, e-commerce, advertising services and innovative businesses and others, and retrospectively revised prior period segment information to conform to current period presentation.Impact of the Recently Adopted Major Accounting PronouncementIn February 2016, the FASB issued ASU 2016-02 \"Leases\" as amended, which generally requires lessees to recognize operating and financing lease liabilities and corresponding right-of-use assets on the balance sheet and to provide enhanced disclosures surrounding the amount, timing and uncertainty of cash flows arising from leasing arrangements. The Company adopted the new standard effective January 1, 2019 on a modified retrospective basis and did not restate comparative periods. The Company recognized approximately RMB861.5 million as total right-of-use assets as well as total lease liabilities for the operating leases on its consolidated balance sheet as of January 1, 2019. The Company recognized RMB709.5 million and RMB746.3 million as total right-of-use assets and total lease liabilities, respectively, for the operating leases on its consolidated balance sheet as of June 30, 2019. Right-of-use assets are included in other long-term assets, and lease liabilities are included in accrual liabilities and other payables and other long-term payables, respectively based on payment terms on the consolidated balance sheet. Other than the foregoing, the Company does not expect the new standard to have a material impact on the net assets of the Company's consolidated financial statements.Conference Call NetEase's management team will host a teleconference call with simultaneous webcast at 9:00 p.m. Eastern Time on Wednesday, August 7, 2019 (Beijing/Hong Kong Time: 9:00 a.m., Thursday, August 8, 2019). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0324 and providing conference ID: 8799967, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 8799967#. The replay will be available through August 21, 2019. This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com. About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also operates Kaola and Yanxuan, two e-commerce platforms that cater to the rising middle-class consumer market in China as well as offering advertising, e-mail and other innovative services including music and online education. For more information, please visit: http://ir.netease.com/. Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including risks related to: the risk that the online game market will not continue to grow or that NetEase will not be able to maintain its leading position in that market within China or globally, which could occur if, for example, its new online games or expansion packs and other improvements to its existing games do not become as popular as management anticipates; the ability of NetEase to effectively market its games and other services and achieve a positive return on its marketing expenditures; the risk that changes in Chinese government regulation of the online game market and the market for NetEase's e-commerce businesses may limit future growth of NetEase's revenues or cause revenues to decline; the risk that NetEase may not be able to continuously develop new and creative online services or that NetEase will not be able to set, or follow in a timely manner, trends in the market; the risk that the e-commerce market or the internet advertising market in China will not continue to grow and will remain subject to intense competition and the risk that investments by us in our e-commerce platforms and related services or in our advertising content and services may not increase the appeal of our websites, e-commerce platforms or mobile applications among users or result in increased e-commerce or advertising revenues; the risk that NetEase will not be able to control its expenses in future periods; competition in NetEase's existing and potential markets; governmental uncertainties (including possible changes in the effective tax rates applicable to NetEase and its subsidiaries and affiliates and the ability of NetEase to receive and maintain approvals of the preferential tax treatments); the risk that fluctuations in the value of the Renminbi with respect to other currencies could adversely affect NetEase's business and financial results; and other risks outlined in NetEase's filings with the Securities and Exchange Commission. NetEase does not undertake any obligation to update this forward-looking information, except as required under the applicable law.Non-GAAP Financial Measures NetEase considers and uses non-GAAP financial measures, such as non-GAAP net income attributable to the Company's shareholders and non-GAAP basic and diluted earnings per ADS, as supplemental metrics in reviewing and assessing its operating performance and formulating its business plan. The presentation of non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"). NetEase defines non-GAAP net income attributable to the Company's shareholders as net income attributable to the Company's shareholders excluding share-based compensation expenses. Non-GAAP net income attributable to the Company's shareholders enables NetEase's management to assess its operating results without considering the impact of share-based compensation expenses, which are non-cash charges. NetEase believes that these non-GAAP financial measures provide useful information to investors in understanding and evaluating the Company's current operating performance and future prospects in the same manner as management does, if they so choose. NetEase also believes that the use of this non-GAAP financial measure facilitates investors' assessment of its operating performance.Non-GAAP financial measures are not defined under U.S. GAAP and are not presented in accordance with U.S. GAAP. Non-GAAP financial measures have limitations as analytical tools. One of the key limitations of using non-GAAP net income attributable to the Company's shareholders is that it does not reflect all items of expense that affect our operations. Share-based compensation expenses have been and may continue to be incurred in our business and are not reflected in the presentation of non-GAAP net income attributable to the Company's shareholders. In addition, the non-GAAP financial measures NetEase uses may differ from the non-GAAP measures used by other companies, including peer companies, and therefore their comparability may be limited.NetEase compensates for these limitations by reconciling non-GAAP net income attributable to the Company's shareholders to the nearest U.S. GAAP performance measure, all of which should be considered when evaluating the Company's performance. See \"Reconciliation of GAAP and Non-GAAP Results\" at the end of this press release. NetEase encourages you to review its financial information in its entirety and not rely on a single financial measure.  Contact for Media and Investors:Margaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsbrandi@corp.netease.comTel: (+1) 212-481-2050         NETEASE, INC.NOTES TO UNAUDITED FINANCIAL INFORMATIONNote 1: The conversion of Renminbi (RMB) into United States dollars (USD) is based on the noon buying rate of USD1.00 = RMB6.8650 on the last trading day of June (June 28, 2019) as set forth in the H.10 statistical release of the U.S. Federal Reserve Board.Note 2: Share-based compensation cost reported in the Company's unaudited condensed consolidated statements of comprehensive income is set out as follows in RMB and USD (in thousands):    View original content:http://www.prnewswire.com/news-releases/netease-reports-second-quarter-2019-unaudited-financial-results-300897882.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase to Report Second Quarter 2019 Financial Results on August 7",
        "subtitle": "",
        "date": "Jul 31, 2019 7:00AM EDT",
        "content": "BEIJING, July 31, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced that it will report financial results for the 2019 second quarter on Wednesday, August 7, 2019, after the close of the U.S. markets.The earnings teleconference call with simultaneous webcast will take place at 9:00 p.m. Eastern Time on Wednesday, August 7, 2019 (Beijing/Hong Kong Time: 9:00 a.m., Thursday, August 8, 2019). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0324 and providing conference ID: 8799967, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 8799967#. The replay will be available through August 21, 2019.This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com/.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also operates Kaola and Yanxuan, two e-commerce platforms that cater to the rising middle-class consumer market in China as well as offering advertising, e-mail and other innovative services including music and online education. For more information, please visit: http://ir.netease.com/. Contact for Media and Investors:Margaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsbrandi@corp.netease.comTel: (+1) 212-481-2050 View original content:http://www.prnewswire.com/news-releases/netease-to-report-second-quarter-2019-financial-results-on-august-7-300893795.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Launches Game Studio in Montréal, Canada",
        "subtitle": "",
        "date": "Jul 22, 2019 7:00AM EDT",
        "content": "HANGZHOU, China, July 22, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, has launched a new video games studio in Montréal, Québec, which is considered to be Canada's premier video game production center. NetEase plans to hire local and international talent for this R&D-focused studio in North America.\"Global expansion is of great importance to the strategic growth of NetEase's online games business. We have made considerable progress in recent years, and our new Montréal games studio is another significant milestone for our global market ambitions,\" said William Ding, Chief Executive Officer and Director of NetEase. \"Known for being a world-leading video game and entertainment content production hub, with rich resources in talent and technologies, Montréal offers clear advantages and favorable conditions to international online games companies such as NetEase. We were warmly welcomed by Montréal International and Investissement Québec, and we are thrilled at this remarkable step which can push us forward on realizing our global objectives.\"Montréal International, Greater Montréal's economic promotion agency, has supported the Company with their set-up project. \"We cordially welcome the arrival of NetEase, the first major game publisher and developer from China to establish an office here, which confirms Greater Montréal's enviable position as a world leader in the video game industry,\" stated Hubert Bolduc, President and CEO of Montréal International. \"Since 2015, the Québec video game industry has experienced a phenomenal 42% growth in the number of companies establishing roots or expanding here, with the world's largest video games producers successively choosing the city for its creative, vibrant and artistic culture.\"Investissement Québec, whose mission is to attract new foreign investment to Québec, has also worked with the Company to make its expansion possible. \"We welcome NetEase to set up a studio in Québec. The opening and establishment of the studio speaks volumes about the strength and talent of the local industrial sector, which represents fertile ground for any company wanting to invest here. We are confident that the arrival of this key player in the video game industry will strengthen Montréal's ecosystem and help boost the economy,\" said Guy LeBlanc, President and CEO of Investissement Québec.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company based in China dedicated to providing premium online services centered around content, community, communication and commerce. NetEase develops and operates some of the most popular PC-client and mobile games in China and has been expanding rapidly into other international markets such as Japan and North America in more recent years. In addition to its self-developed game content, NetEase also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers. NetEase also operates Kaola and Yanxuan, two e-commerce platforms that cater to the rising middle-class consumer market in China as well as offering advertising, e-mail and other innovative services including music and online education. For more information, please visit: http://ir.netease.com/.About Montréal International (www.montrealinternational.com)Montréal International is a non-profit organization funded by the private sector, the governments of Canada and Québec, the Communauté métropolitaine de Montréal and the City of Montréal. Its mandate is to attract and retain foreign investment (companies and startups), international organizations, skilled workers and international students to Greater Montréal by providing support services tailored to their needs.About Investissement Québec (www.investquebec.com/quebec/en/)Investissement Québec's mission is to foster the growth of investment in Québec, thereby contributing to economic development and job creation in every region. The Corporation offers businesses a full range of financial solutions, including loans, loan guarantees and equity investments, to support them at all stages of their development. It is also responsible for administering tax measures and prospecting for foreign investment.Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbour\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements, including statements regarding NetEase's establishment in Canada, may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including the risks outlined in NetEase's filings with the U.S. Securities and Exchange Commission. NetEase does not undertake any obligation to update this forward-looking information, except as required under applicable law. For more information and media requests:NetEaseMargaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378 Montréal InternationalAriane LafrenièreCommunications Advisorariane.lafreniere@mtlintl.com Investissement QuébecIsabelle FontaineSenior Director, Public and Government Affairs Tel: (+1) 514-876-9359  View original content:http://www.prnewswire.com/news-releases/netease-launches-game-studio-in-montreal-canada-300888393.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Games Announces Strategic Investment in Behaviour Interactive",
        "subtitle": "",
        "date": "Jul 15, 2019 9:00PM EDT",
        "content": "GUANGZHOU, China, July 15, 2019 /PRNewswire/ -- NetEase Games, the online games division of NetEase, Inc. (NASDAQ: NTES), one of China's leading internet and online game services providers, today announced that it has acquired a strategic minority stake in Behaviour Interactive Inc. (\"Behaviour\"), Canada's largest independent video game developer.Following this investment, Montreal-based Behaviour will continue to operate independently under the leadership of Rémi Racine, its President and Executive Producer, and NetEase Games will nominate a director to Behaviour's Board. \"NetEase is pleased to further develop our relationship with Behaviour, an online games pioneer and a leader of the asymmetrical battle arena genre,\" said Ethan Wang, Vice President of NetEase, Inc. \"We look forward to leveraging Behaviour's deep passion and expertise to enhance our R&D efforts and deliver even more exciting new products to players worldwide.\"Known as a premium content provider for game enthusiasts in China, NetEase Games has established itself on the global scene with successful game launches in multiple geographies in more recent years. By working with other leading international developers, NetEase Games is able to further enhance its advantages in R&D.\"NetEase's investment validates the reputation for excellence and efficiency we have built in the online games sector over the last 27 years,\" said Rémi Racine, President and Executive Producer of Behaviour Interactive. \"At Behaviour, we are continuously looking for opportunities to accelerate growth by investing in R&D for new and innovative games for our players and in the recruitment of exceptional talent. As an industry leader in online games, NetEase brings highly reputable R&D and operational capabilities and experience that we believe will drive sustainable, long-term growth well into the future.\"Privately held Behaviour Interactive develops games that turn players' imagination into reality. The company is the creator of the first globally successful asymmetric multiplayer horror game, Dead by Daylight, and the developer of over 250 titles, which have been delighting players on all major platforms since 1992.About NetEase GamesNetEase Games is the online games division of NetEase, Inc. (NASDAQ: NTES), developing and operating some of the most popular PC-client and mobile games in markets including China and Japan. As one of the world's largest incubators of quality online game content, NetEase Games is dedicated to supporting the growth of innovative studios around the globe and growing an international presence along the way. To complement its self-developed games and world-class R&D capabilities, NetEase Games also partners with other industry leaders including Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers to operate some of the most popular international online games in China. For more information, please visit neteasegames.com.About Behaviour InteractiveFounded in 1992, Montreal-based Behaviour Interactive is one of North America's largest independent game developers with 550 employees and over 70 million games sold on every platform, and 12 million players of its award-winning original IP Dead by DaylightTM. To date, the company's mobile games have reached over 200 million players worldwide. Behaviour counts amongst its partners some of the world's most recognized brands such as Sony, Disney, Activision, Warner Bros, Ubisoft, Microsoft, Google, Bombardier, Wargaming, HBO, NetEase, Gaea, La Capitale, and many more. For more information, visit bhvr.com.Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbour\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements, including statements regarding NetEase and Behaviour's cooperation and partnerships, may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including the risks outlined in NetEase's filings with the Securities and Exchange Commission. NetEase and Behaviour do not undertake any obligation to update this forward-looking information, except as required under applicable law. For more information and media requests:NetEase Contact:Margaret Shi NetEase, Inc.ir@service.netease.com Tel: (+86) 571-8985-3378Behaviour Interactive Contact:Marie-Eve BoisvertVice-President Communications, Behaviour Interactivemeboisvert@bhvr.comTel: (+1) 514-926-3169 View original content:http://www.prnewswire.com/news-releases/netease-games-announces-strategic-investment-in-behaviour-interactive-300884582.htmlSOURCE  NetEase Games"
    },
    {
        "title": "NetEase Unveils Games Pipeline at Fifth Annual Product Launch Event",
        "subtitle": "",
        "date": "May 22, 2019 6:00AM EDT",
        "content": " GUANGZHOU, China, May 22, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, celebrated its diversified portfolio of PC and mobile games and announced partnerships and new products at its Fifth Annual Product Launch event (formerly known as the NetEase Annual \"520 Game Enthusiasts' Day\") on Monday, May 20, 2019. Showcasing strategic layouts and plans for over 50 products, NetEase Games demonstrated its commitment to being a global leader in online games.\"We go through a process of innovation and continuous improvement to maximize the value of our games and bring users around the world premium experiences with our games and rich entertainment content,\" said William Ding, Chief Executive Officer and Director of NetEase. \"Our company has transformed from its modest origin as a Chinese internet company. Today we are realizing our worldwide vision with an exciting pipeline of online games for a global audience.\"Some highlights from the event include:About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company in China dedicated to providing online services centered around content, community, communication and commerce. NetEase develops and operates some of China's most popular PC-client and mobile games, and partners with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers to operate some of the most popular international online games in China. NetEase also operates Kaola and Yanxuan, two e-commerce platforms that cater to the rising middle-class consumer market in China. In addition, NetEase offers advertising, e-mail and other innovative services including music and online education. For more information, please visit: http://ir.netease.com/.Forward Looking StatementsThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbour\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The accuracy of these statements may be impacted by a number of business risks and uncertainties that could cause actual results to differ materially from those projected or anticipated, including risks related to: the risk that the online game market in China or elsewhere will not continue to grow or that NetEase will not be able to maintain its position in such markets, which could occur if, for example, its new online games or expansion packs and other improvements to its existing games do not become as popular as management anticipates; competition in NetEase's existing and potential markets; NetEase's ability to maintain its strategic collaborations with IP owners and effectively implement such collaborations; and other risks outlined in NetEase's filings with the Securities and Exchange Commission. NetEase does not undertake any obligation to update this forward-looking information, except as required under the applicable law.Media ContactMargaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsbrandi@corp.netease.comTel: (+1) 212-481-2050 View original content:http://www.prnewswire.com/news-releases/netease-unveils-games-pipeline-at-fifth-annual-product-launch-event-300854916.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase Announces Rescheduled Time for First Quarter 2019 Earnings Conference Call from 9:00 pm ET to 7:30 pm ET on May 15, 2019",
        "subtitle": "",
        "date": "May 13, 2019 6:00AM EDT",
        "content": "BEIJING, May 13, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced that it has rescheduled the first quarter 2019 earnings conference call to 7:30 p.m. Eastern Time on Wednesday, May 15, 2019 (Beijing/Hong Kong Time: 7:30 a.m., Thursday, May 16, 2019). NetEase's management will be on the call to discuss the quarterly results and answer questions. The financial results for the first quarter 2019 will still be released on Wednesday, May 15, 2019, after the close of the U.S. markets.Interested parties may participate in the conference call by dialing 1-929-477-0448, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 7691549#. The replay will be available through May 29, 2019.This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com/.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company in China. Dedicated to providing online services centered around content, community, communication and commerce, NetEase develops and operates some of China's most popular PC-client and mobile games, e-commerce businesses and advertising services, as well as a variety of other innovative businesses. In partnership with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers, NetEase also operates some of the most popular international online games in China. For more information, please visit: http://ir.netease.com/.Contact for Media and Investors:Margaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378 Brandi PiacenteInvestor Relationsbrandi@corp.netease.comTel: (+1) 212-481-2050  View original content:http://www.prnewswire.com/news-releases/netease-announces-rescheduled-time-for-first-quarter-2019-earnings-conference-call-from-900-pm-et-to-730-pm-et-on-may-15-2019-300848594.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "NetEase to Report First Quarter 2019 Financial Results on May 15",
        "subtitle": "",
        "date": "Apr 24, 2019 7:00AM EDT",
        "content": "BEIJING, April 24, 2019 /PRNewswire/ -- NetEase, Inc. (NASDAQ: NTES) (\"NetEase\" or the \"Company\"), one of China's leading internet and online game services providers, today announced that it will report financial results for the 2019 first quarter on Wednesday, May 15, 2019, after the close of the U.S. markets.The earnings teleconference call with simultaneous webcast will take place at 9:00 p.m. Eastern Time on Wednesday, May 15, 2019 (Beijing/Hong Kong Time: 9:00 a.m., Thursday, May 16, 2019). NetEase's management will be on the call to discuss the quarterly results and answer questions.Interested parties may participate in the conference call by dialing 1-929-477-0448, 10-15 minutes prior to the initiation of the call. A replay of the call will be available by dialing 1-719-457-0820 and entering passcode 7691549#. The replay will be available through May 29, 2019.This call will be webcast live and the replay will be available for 12 months. Both will be available on NetEase's Investor Relations website at http://ir.netease.com/.About NetEase, Inc.NetEase, Inc. (NASDAQ: NTES) is a leading internet technology company in China. Dedicated to providing online services centered around content, community, communication and commerce, NetEase develops and operates some of China's most popular PC-client and mobile games, e-commerce businesses and advertising services, as well as a variety of other innovative businesses. In partnership with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers, NetEase also operates some of the most popular international online games in China. For more information, please visit: http://ir.netease.com/.Contact for Media and Investors:Margaret Shi NetEase, Inc.ir@service.netease.comTel: (+86) 571-8985-3378Brandi PiacenteInvestor Relationsbrandi@corp.netease.com Tel: (+1) 212-481-2050 View original content:http://www.prnewswire.com/news-releases/netease-to-report-first-quarter-2019-financial-results-on-may-15-300837051.htmlSOURCE  NetEase, Inc."
    },
    {
        "title": "Xuke Tech Has Become Governing Member of Trusted Blockchain Initiatives, Promoting the Research and Application of Blockchain Technology",
        "subtitle": "",
        "date": "Mar 14, 2019 5:21AM EDT",
        "content": "NEW YORK, NY / ACCESSWIRE / March 14, 2019 / In January 2019, Xuketianxia (Beijing) Technology Co.,LTD (hereinafter referred to as \"Xuke Tech\") officially joined Trusted Blockchain Initiatives (TBI). As a member of council, together with more than 280 members of enterprise, Xuke Tech is going to drive research of core blockchain technology and implementation of industrial application. It is also aiming to accelerate iteration of the standard for trusted blockchain, in order to support the positive and healthy development of blockchain industry.Trusted Blockchain Initiative (TBI) is the first blockchain organization in China, which initiated by the China Academy of Information and Communications Technology (hereinafter referred to as \"CAICT\"). It is aiming to promote the blockchain research on its core technology and implementation of industrial application. TBI focuses on speeding up the iteration of trusted blockchain standard, which assembled over 280 first class enterprises on technology research and development in China, including CAICT, Baidu, Alibaba, Tencent, JD Finance, Microsoft, Intel, SAP, Huawei, ZTE, etc. Being the world leading provider of distributed database, privacy protection technology and AI technology, Xuke Tech officially joined TBI as a member of council at the beginning of this year.Xuke Tech is founded in January 2013 by an international development team with top technical experts from China and the U.S, and has a number of international patents. It is committed to help leading enterprises in various industries around the world to accelerate the process of informatization and intelligentization. At present, there are nearly 100 engineers in Xuke Tech team, 80% of its development team has a master background which mainly graduated from Carnegie Mellon University, Columbia University, Tsinghua University and other international top universities. Team members who have been working as technical co-contributors in top international technology companies such as Google, Baidu, Netease, Sinusoft, Pintrest and other well-known enterprises.The person in charge of Xuke Tech said that it comes with huge responsibility by joining the TBI. Xuke Tech will help building a platform for government, industries, education and research of blockchain. Together with more than 280 members of enterprise it will promote the research and application of blockchain technology, and build a standardized system of trusted blockchain in China.Jan@globalnews.comSOURCE: Xuke"
    }
]