[
    {
        "title": "NXP Semiconductors Announces Quarterly Dividend",
        "subtitle": "",
        "date": "Mar 5, 2020 8:30AM EST",
        "content": "EINDHOVEN, The Netherlands, March  05, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced that, as part of its Quarterly Dividend Program, its board of directors has approved the payment of an interim dividend for the first quarter of 2020 of $0.375 per ordinary share. The interim dividend will be paid in cash on April 6, 2020 to shareholders of record as of March 16, 2020.Taxation – Cash Dividends Cash dividends will be subject to the deduction of Dutch dividend withholding tax at the rate of 15 percent, which may be reduced in certain circumstances. Non-Dutch resident shareholders, depending on their circumstances, may be entitled to a full or partial refund of Dutch dividend withholding tax. If you are uncertain as to the tax treatment of any dividends, consult your tax advisor.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $8.88 billion in 2019. Find out more at www.nxp.com.Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected.  These factors, risks and uncertainties include the following: market demand and semiconductor industry conditions; the ability to successfully introduce new technologies and products; the end-market demand for the goods into which NXP’s products are incorporated; the ability to generate sufficient cash, raise sufficient capital or refinance corporate debt at or before maturity; the ability to meet the combination of corporate debt service, research and development and capital investment requirements; the ability to accurately estimate demand and match manufacturing production capacity accordingly or obtain supplies from third-party producers; the access to production capacity from third-party outsourcing partners; any events that might affect third-party business partners or NXP’s relationship with them, including the outbreak of COVID-19 or the requirements to suspend activities with customers or suppliers because of changing import and export regulations;  the ability to secure adequate and timely supply of equipment and materials from suppliers; the ability to avoid operational problems and product defects and, if such issues were to arise, to correct them quickly; the ability to form strategic partnerships and joint ventures and to successfully cooperate with alliance partners; the ability to win competitive bid selection processes to develop products for use in customers’ equipment and products; the ability to achieve targeted efficiencies and cost savings;  the ability to successfully hire and retain key management and senior product architects; and, the ability to maintain good relationships with our suppliers.  In addition, this document contains information concerning the semiconductor industry and NXP’s business generally, which is forward-looking in nature and is based on a variety of assumptions regarding the ways in which the semiconductor industry, NXP’s markets and product areas may develop.  NXP has based these assumptions on information currently available, if any one or more of these assumptions turn out to be incorrect, actual results may differ from those predicted.  While NXP does not know what impact any such differences may have on its business, if there are such differences, its future results of operations and its financial condition could be materially adversely affected.  Readers are cautioned not to place undue reliance on these forward-looking statements, which speak to results only as of the date the statements were made.  Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after we distribute this document, whether to reflect any future events or circumstances or otherwise.  For a discussion of potential risks and uncertainties, please refer to the risk factors listed in our SEC filings. Copies of our SEC filings are available on our Investor Relations website, www.nxp.com/investor or from the SEC website, www.sec.govFor further information, please contact:Investors:Jeff Palmerjeff.palmer@nxp.com+1 408 518 5411Media:Jacey Zuniga jacey.zuniga@nxp.com +1 512 895 7398NXP-Corp"
    },
    {
        "title": "NXP Semiconductors Updates First Quarter 2020 Revenue Outlook Due to Potential Impact from the Coronavirus",
        "subtitle": "",
        "date": "Mar 1, 2020 6:00PM EST",
        "content": "EINDHOVEN, The Netherlands, March  01, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today provided an update to its first quarter 2020 revenue guidance due to potential impacts from the novel coronavirus (“COVID 19”).“Subsequent to our earnings call on February 3rd, we now believe that our expectations for total revenue in the first quarter of 2020 will be reduced due to the impact of the coronavirus,” said Richard Clemmer, NXP Chief Executive Officer. “Getting our arms around the actual business impact of the virus has been a challenge given the fluid and dynamic situation, but we want to stress that the most important thing at this stage is the health and safety of all our NXP team members and their families. From a business perspective, the impact is very much an estimate at this time, based on business trends over the last several weeks post the Lunar New Year holiday. What we have seen is lower than expected sell-through and order push outs in both our distribution channel and with direct customers. While we have not seen any material order cancellations, we currently expect the impact to revenue in the first quarter to be in the range of $50 million to $150 million. At the lower end of this range, the $50 million impact is what we’ve actually seen so far, with the weakness most pronounced in the weeks after the Lunar New Year holiday, however, we have now seen more normal order levels in the last two weeks. The $150 million upper range is estimated on a scenario where we would see a return of weakness in the coming weeks, like what we saw right after Lunar New Year. We need to stress that these assumptions are based on less than perfect data, as the situation in China continues to be highly fluid.”Conference Call and Webcast InformationNXP will host a conference call on Monday, March 2, 2020 at 8:00 a.m. U.S. Eastern Time (2:00 p.m. Central European Time) to address questions analyst and investor questions.Interested parties may join the conference call by dialing 1 – 888 – 603 – 7644 (within the U.S.) or 1 – 484 – 747 - 6631 (outside of the U.S.). The participant pass-code is 8352358. To listen to a webcast of the event, please visit the Investor Relations section of the NXP website at https://investors.nxp.com. The webcast will be recorded and available for replay shortly after the call concludes.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $8.88 billion in 2019. Find out more at www.nxp.com.Forward-looking Statements This document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected.  These factors, risks and uncertainties include the following: market demand and semiconductor industry conditions; the ability to successfully introduce new technologies and products; the end-market demand for the goods into which NXP’s products are incorporated; the ability to generate sufficient cash, raise sufficient capital or refinance corporate debt at or before maturity; the ability to meet the combination of corporate debt service, research and development and capital investment requirements; the ability to accurately estimate demand and match manufacturing production capacity accordingly or obtain supplies from third-party producers; the access to production capacity from third-party outsourcing partners; any events that might affect third-party business partners or NXP’s relationship with them, including the outbreak of COVID-19 or the requirements to suspend activities with customers or suppliers because of changing import and export regulations;  the ability to secure adequate and timely supply of equipment and materials from suppliers; the ability to avoid operational problems and product defects and, if such issues were to arise, to correct them quickly; the ability to form strategic partnerships and joint ventures and to successfully cooperate with alliance partners; the ability to win competitive bid selection processes to develop products for use in customers’ equipment and products; the ability to achieve targeted efficiencies and cost savings;  the ability to successfully hire and retain key management and senior product architects; and, the ability to maintain good relationships with our suppliers.  In addition, this document contains information concerning the semiconductor industry and NXP’s business generally, which is forward-looking in nature and is based on a variety of assumptions regarding the ways in which the semiconductor industry, NXP’s markets and product areas may develop.  NXP has based these assumptions on information currently available, if any one or more of these assumptions turn out to be incorrect, actual results may differ from those predicted.  While NXP does not know what impact any such differences may have on its business, if there are such differences, its future results of operations and its financial condition could be materially adversely affected.  Readers are cautioned not to place undue reliance on these forward-looking statements, which speak to results only as of the date the statements were made.  Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after we distribute this document, whether to reflect any future events or circumstances or otherwise.  For a discussion of potential risks and uncertainties, please refer to the risk factors listed in our SEC filings. Copies of our SEC filings are available on our Investor Relations website, www.nxp.com/investor or from the SEC website, www.sec.gov.NXP-Corp"
    },
    {
        "title": "NXP Semiconductors to Present at Upcoming Investor Conference",
        "subtitle": "",
        "date": "Feb 18, 2020 8:00AM EST",
        "content": "EINDHOVEN, The Netherlands, Feb.  18, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced participation at the following event with the financial community:When available, interested parties can listen to live audio webcasts of the presentations from the NXP Investor Relations website https://investors.nxp.com. Webcast replays will be available within 24 hours.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $8.88 billion in 2019. Find out more at www.nxp.com.Forward-looking Statements This document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts. By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. These factors, risks and uncertainties include the following: market demand and semiconductor industry conditions; the ability to successfully introduce new technologies and products; the end-market demand for the goods into which NXP’s products are incorporated; the ability to generate sufficient cash, raise sufficient capital or refinance corporate debt at or before maturity; the ability to meet the combination of corporate debt service, research and development and capital investment requirements; the ability to accurately estimate demand and match manufacturing production capacity accordingly or obtain supplies from third-party producers; the access to production capacity from third-party outsourcing partners; any events that might affect third-party business partners or NXP’s relationship with them; the ability to secure adequate and timely supply of equipment and materials from suppliers; the ability to avoid operational problems and product defects and, if such issues were to arise, to correct them quickly; the ability to form strategic partnerships and joint ventures and to successfully cooperate with alliance partners; the ability to win competitive bid selection processes to develop products for use in customers’ equipment and products; the ability to achieve targeted efficiencies and cost savings; the ability to successfully hire and retain key management and senior product architects; and, the ability to maintain good relationships with our suppliers. In addition, this document contains information concerning the semiconductor industry and NXP’s business generally, which is forward-looking in nature and is based on a variety of assumptions regarding the ways in which the semiconductor industry, NXP’s markets and product areas may develop. NXP has based these assumptions on information currently available, if any one or more of these assumptions turn out to be incorrect, actual results may differ from those predicted. While NXP does not know what impact any such differences may have on its business, if there are such differences, its future results of operations and its financial condition could be materially adversely affected. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak to results only as of the date the statements were made. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after we distribute this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in our SEC filings. Copies of our SEC filings are available on our Investor Relations website, www.nxp.com/investor or from the SEC website, www.sec.gov.For further information, please contact:NXP-Corp "
    },
    {
        "title": "NXP Semiconductors Reports Fourth Quarter and Full-year 2019 Results",
        "subtitle": "",
        "date": "Feb 3, 2020 5:00PM EST",
        "content": "EINDHOVEN, The Netherlands, Feb.  03, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today reported financial results for the fourth quarter and full year 2019, ended December 31, 2019.“NXP delivered full-year revenue of $8.88 billion, a decline of 6 percent year-on-year, against a very challenging semiconductor industry backdrop. As we look forward to 2020, we are increasingly confident that the demand trends within our end markets are beginning to moderately improve.  Notwithstanding the operating environment we experienced in 2019, NXP drove improved profitability, strong free cash flow generation, and continued to successfully execute our strategy within our target markets. During 2019, we returned $1.76 billion to our shareholders.  Over the course of the year, we significantly enhanced our product portfolio. We successfully acquired the Marvell wireless connectivity assets, and introduced new, innovative products and solutions. Our customers have already begun to adopt many of these new solutions, and as they continue to ramp into volume production, we anticipate new products will help to underpin NXP’s long-term growth, financial and capital return targets,” said Richard Clemmer, NXP Chief Executive Officer.Key HighlightsSummary of Reported Fourth Quarter and Full-year 2019 ($ millions, unaudited) (1)1.   Additional Information for the Fourth Quarter and Full-year 2019:Guidance for the First Quarter 2020: ($ millions) (1)Note (1) Additional Information:NXP has based the guidance included in this release on judgments and estimates that management believes are reasonable given its assessment of historical trends and other information reasonably available as of the date of this release. Please note, the guidance included in this release consists of predictions only, and is subject to a wide range of known and unknown risks and uncertainties, many of which are beyond NXP's control. The guidance included in this release should not be regarded as representations by NXP that the estimated results will be achieved. Actual results may vary materially from the guidance we provide today. In relation to the use of non-GAAP financial information see the note regarding \"Non-GAAP Financial Measures\" below. For the factors, risks, and uncertainties to which judgments, estimates and forward-looking statements generally are subject see the note regarding \"Forward-looking Statements.\" We undertake no obligation to publicly update or revise any forward-looking statements, including the guidance set forth herein, to reflect future events or circumstances.Non-GAAP Financial MeasuresIn managing NXP's business on a consolidated basis, management develops an annual operating plan, which is approved by our Board of Directors, using non-GAAP financial measures. In measuring performance against this plan, management considers the actual or potential impacts on these non-GAAP financial measures from actions taken to reduce costs with the goal of increasing our gross margin and operating margin and when assessing appropriate levels of research and development efforts. In addition, management relies upon these non-GAAP financial measures when making decisions about product spending, administrative budgets, and other operating expenses. We believe that these non-GAAP financial measures, when coupled with the GAAP results and the reconciliations to corresponding GAAP financial measures, provide a more complete understanding of the Company’s results of operations and the factors and trends affecting NXP’s business. We believe that they enable investors to perform additional comparisons of our operating results, to assess our liquidity and capital position and to analyze financial performance excluding the effect of expenses unrelated to operations, certain non-cash expenses and share-based compensation expense, which may obscure trends in NXP's underlying performance.  This information also enables investors to compare financial results between periods where certain items may vary independent of business performance,and allow for greater transparency with respect to key metrics used by management.These non-GAAP financial measures are provided in addition to, and not as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP. The presentation of these and other similar items in NXP’s non-GAAP financial results should not be interpreted as implying that these items are non-recurring, infrequent, or unusual.  Reconciliations of these non-GAAP measures to the most comparable measures calculated in accordance with GAAP are provided in the financial statements portion of this release in a schedule entitled “Financial Reconciliation of GAAP to non-GAAP Results (unaudited).” Please refer to the NXP Historic Financial Model file found on the Financial Information page of the Investor Relations section of our website at https://investors.nxp.com for additional information related to our rationale for using these non-GAAP financial measures, as well as the impact of these measures on the presentation of NXP's operations.In addition to providing financial information on a basis consistent with U.S. generally accepted accounting principles (“GAAP”), NXP also provides the following selected financial measures on a non-GAAP basis: (i) Gross profit, (ii) Gross margin, (iii) Research and development, (iv) Selling, general and administrative, (v) Amortization of acquisition-related intangible assets, (vi) Other income, (vii) Operating income (loss), (viii) Operating margin, (ix) Financial Income (expense), (x) adjusted net income, adjusted EBITDA and trailing 12 month adjusted EBITDA, and (xi) free cash flow and free cash flow as a percent of Revenue. The non-GAAP information excludes the amortization of acquisition related intangible assets, the purchase accounting effect on inventory and property, plant and equipment, merger related costs (including integration costs), certain items related to divestitures, share-based compensation expense, restructuring and asset impairment charges, non-cash interest expense on convertible notes, extinguishment of debt, and foreign exchange gains and losses.Conference Call and Webcast InformationNXP will host a conference call on February 4, 2020 at 8:00 a.m. U.S. Eastern Time (2:00 p.m. Central European Time) to discuss its fourth quarter and full-year 2019 results and provide an outlook for the first quarter of 2020.Interested parties may join the conference call by dialing 1 – 888 – 603 – 7644 (within the U.S.) or 1 – 484 – 747 - 6631 (outside of the U.S.). The participant pass-code is 3286469. To listen to a webcast of the event, please visit the Investor Relations section of the NXP website at https://investors.nxp.com. The webcast will be recorded and available for replay shortly after the call concludes.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $8.88 billion in 2019. Find out more at www.nxp.com.Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts. By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. These factors, risks and uncertainties include the following: market demand and semiconductor industry conditions; the ability to successfully introduce new technologies and products; the end-market demand for the goods into which NXP’s products are incorporated; the ability to generate sufficient cash, raise sufficient capital or refinance corporate debt at or before maturity; the ability to meet the combination of corporate debt service, research and development and capital investment requirements; the ability to accurately estimate demand and match manufacturing production capacity accordingly or obtain supplies from third-party producers; the access to production capacity from third-party outsourcing partners; any events that might affect third-party business partners or NXP’s relationship with them; including the requirement to suspend activities with customers or suppliers because of changing import and export regulations; the ability to secure adequate and timely supply of equipment and materials from suppliers; the ability to avoid operational problems and product defects and, if such issues were to arise, to correct them quickly; the ability to form strategic partnerships and joint ventures and to successfully cooperate with alliance partners; the ability to win competitive bid selection processes to develop products for use in customers’ equipment and products; the ability to achieve targeted efficiencies and cost savings; the ability to successfully hire and retain key management and senior product architects; and, the ability to maintain good relationships with our suppliers. In addition, this document contains information concerning the semiconductor industry and NXP’s business generally, which is forward-looking in nature and is based on a variety of assumptions regarding the ways in which the semiconductor industry, NXP’s markets and product areas may develop. NXP has based these assumptions on information currently available, if any one or more of these assumptions turn out to be incorrect, actual results may differ from those predicted. While NXP does not know what impact any such differences may have on its business, if there are such differences, its future results of operations and its financial condition could be materially adversely affected. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak to results only as of the date the statements were made. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after we distribute this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in our SEC filings. Copies of our SEC filings are available on our Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.NXP-CorpNXP SemiconductorsTable 1: Condensed consolidated statement of operations (unaudited)NXP SemiconductorsTable 2: Condensed consolidated balance sheet (unaudited)NXP SemiconductorsTable 3: Condensed consolidated statement of cash flows (unaudited)NXP SemiconductorsTable 4: Financial Reconciliation of GAAP to non-GAAP Results (unaudited) NXP SemiconductorsTable 5: Adjusted EBITDA and Free Cash Flow (unaudited)"
    },
    {
        "title": "NXP Accelerates UWB-based Mobile Payment Innovation with NTT DOCOMO and Sony",
        "subtitle": "",
        "date": "Jan 14, 2020 1:00AM EST",
        "content": "TOKYO, Jan.  14, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced its Ultra-Wideband (UWB) solution will be leveraged for a live mobile payment demonstration by NTT DOCOMO, INC., and Sony Imaging Products and Solutions Inc. (Sony).With the recent announcement of NXP’s chipset for mobile devices, NXP continues to tie out support from ecosystem leaders across mobile, IoT and automotive makers to cultivate the UWB ecosystem and harness the precise real-time localization capabilities augmented by NXP’s unique, secure UWB portfolio.The smart retail demonstration orchestrated by DOCOMO and Sony shows intuitive, effortless connectivity experiences using UWB technology and the possibility of its impact and benefit to FeliCa®-based services which spans transportation, in-store payments, building access and more.“Our demonstration showcases mobile payment, advertisement and smart key applications to present a framework that helps developers, manufacturers and service providers better serve people,” said Takeshi Higuchi, General Manager of Communication Device Development Department at DOCOMO. “We’re excited to collaborate with NXP and Sony to explore more convenient and valuable consumer experiences.”“NXP has always shared the same vision with us to provide global tourists and mobile phone owners in Japan an integrated, rapid, secure and contactless experience for payment, ticketing, and other popular use cases,” said Toyoaki Kobayashi, Deputy Senior General Manager, FeliCa Business Division at Sony Imaging Products & Solutions Inc. “The demonstrated use cases utilizing fine-ranging capabilities can deliver further benefits derived from FeliCa-based services.”“DOCOMO and Sony have long demonstrated their innovative leadership in bringing new forms of payment and value-added services to people,” said Charles Dachs, vice president and general manager of Secure Embedded Transactions at NXP. “We’re excited to work with these leaders to demonstrate sophisticated UWB-based use cases that will blend seamlessly into people’s lives.” The smart retail demonstration tracks user movement and positioning to showcase the versatile benefits of UWB’s 360 degree positioning, location accuracy of a few centimeters, and spatial context awareness that can be purpose-built for personalized advertising and marketing. Additionally it showcases UWB’s complementary and ubiquitous capability to enhance and interoperate with existing wireless technologies on the narrowband spectrum including Bluetooth Low Energy (BLE) and Near Field Communications (NFC). Embedded with end-to-end secure hardware and software for payment, authentication and identification, the UWB-based showcase includes secure, convenient, hands-free check-out for in-store purchase and drive-through payment experiences. SHOWCASE: The demonstration of UWB-based mobile payment and targeted marketing on digital advertising signs will be demonstrated at DOCOMO Open House 2020 on JAN 23 to 24 in 2020.LINKS for further information on UWB: NXP Ultra-Wideband: www.nxp.com/uwbBoth Sony and NXP are members of the FiRa Consortium, working groups dedicated to the development of seamless user experiences using UWB Technology. For more information of the FiRa Consortium: https://www.firaconsortium.org/About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.NXP and the NXP logo are trademarks of NXP B.V. FeliCa is a trademark of Sony Corporation. All other products or service names are the property of their respective owners. All rights reserved. © 2020 NXP B.V.For more information, please contact:                                                         A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/c5752d90-de77-49e4-b3af-921d6470c41e "
    },
    {
        "title": "NXP Semiconductors Announces Conference Call to Review Fourth Quarter and Full-year 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 13, 2020 8:30AM EST",
        "content": "EINDHOVEN, The Netherlands, Jan.  13, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced it will release financial results for the fourth quarter and full-year 2019 after the close of normal trading on the NASDAQ Global Select Market on Monday, February 3, 2020. The company will host a conference call with the financial community on Tuesday, February 4, 2020 at 8:00 a.m. U.S. Eastern Daylight Time (EDT).Earnings Conference Call Details Interested parties may join the conference call by dialing the following numbers:The call will be webcast and can be accessed from the NXP Investor Relations website https://investors.nxp.com. A replay of the call will be available on the NXP Investor Relations website within 24 hours of the actual call. About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts. By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after NXP distributes this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in NXP’s SEC filings. Copies of NXP’s SEC filings are available on NXP’s Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.   For further information, please contact: "
    },
    {
        "title": "NXP Debuts i.MX Applications Processor with Dedicated Neural Processing Unit for Advanced Machine Learning at the Edge",
        "subtitle": "",
        "date": "Jan 6, 2020 12:00PM EST",
        "content": "LAS VEGAS, Jan.  06, 2020  (GLOBE NEWSWIRE) -- (CES 2020) – NXP Semiconductors N.V. (NASDAQ: NXPI) today expanded its industry-leading EdgeVerse portfolio with the i.MX 8M Plus application processor – the first i.MX family to integrate a dedicated Neural Processing Unit (NPU) for advanced machine learning inference at the industrial and IoT (Internet-of-Things) edge. The i.MX 8M Plus combines a high-performance NPU delivering 2.3 TOPS (Tera Operations Per Second) with a Quad-core Arm® Cortex-A53 sub-system running at up to 2GHz, an independent real-time sub-system with an 800MHz Cortex-M7, a high-performance 800 MHz audio DSP for voice and natural language processing, dual camera Image Signal Processors (ISP), and a 3D GPU for rich graphics rendering. With the combination of high-performance Cortex-A53 cores and NPU, edge devices will be able to make intelligent decisions locally by learning and inferring inputs with little or no human intervention. The range of applications made possible with the cost-effective i.MX 8M Plus spans people and object recognition for public safety, industrial machine vision, robotics, hand gesture, and emotion detection with natural language processing for seamless human-to-device interaction with ultra-fast response time and high accuracy.“The edge is the perfect destination to deploy machine learning applications, especially as technology advancements are enabling accurate localized decision-making,” said Martyn Humphries, vice president and general manager of i.MX application processors for consumer and industrial markets at NXP. “With the i.MX 8M Plus we are enabling leading companies to transform the ‘smart’ edge to an ‘intelligent’ edge in the consumer and industrial IoT marketplace, and we look forward with great excitement to the innovative products they will be introducing based on this new trendsetting solution.”Driving an Intelligent Breed of Edge Devices with Immersive Multi-mediaBuilt in advanced 14nm LPC FinFET process technology, the NXP i.MX 8M Plus can execute multiple, highly-complex neural networks simultaneously, such as multi-object identification, speech recognition of 40,000+ English words, and medical imaging. For example, the powerful NPU is capable of processing MobileNet v1, a popular image classification network, at over 500 images per second.Developers can off-load machine learning inference functions to the NPU, allowing the high-performance Cortex-A and Cortex-M cores, DSP, and GPUs to execute other system-level or user applications tasks. The vision pipeline is anchored by dual integrated ISPs that support two high-definition cameras for real-time stereo vision or a single 12 MPixel resolution camera and includes High Dynamic Range (HDR) and fisheye lens correction. These features enable real-time image processing applications such as surveillance, smart retail applications, robot vision, and home health monitors.To enable voice applications, the i.MX 8M Plus integrates a high-performance HiFi 4 DSP that enhances natural language processing with pre- and post-processing of voice streams. The powerful Cortex-M7 domain can be used to run real-time response systems while the applications processor domain executes complex non-real-time applications to reduce the overall system-level power consumption by turning off the application processor domain while keeping only the Cortex-M domain alive for wake word detection. The i.MX 8M Plus extends advanced multimedia, and video processing with a system that can compress multiple video feeds using the H.265 or H.264 HD video encoder and decoder for cloud streaming or local storage and a rich user experience enabled by 3D/2D graphics, and Immersiv3D audio with Dolby Atmos® and DTS:X®.Elevating Intelligence for Industrial IoTThe i.MX 8M Plus advances industrial productivity and automation with machines that can inspect, measure, precisely identify objects, and enable predictive maintenance by accurately detecting anomalies in machine operation. In addition, the factory human-machine interfaces can be made more intuitive and secure by combining accurate face recognition with voice/command recognition and even gesture recognition. Supporting Industry 4.0 IT/OT convergence, the i.MX 8M Plus integrates Gigabit Ethernet with Time-Sensitive Networking (TSN), which combined with Arm Cortex® M7 real-time processing provides deterministic wired network connectivity and processing. NXP also offers tailor-made, optimized Plus Power Management Solutions PMIC (PCA9450C) to support the i.MX 8M Plus.To meet the high quality and reliability standards required for industrial applications, the i.MX 8M Plus features Error Correction Code (ECC) for internal memories and the DDR interface. The family is expected to be qualified to meet the stringent industrial temperature range (-40C to 105C ambient), power-on profile (100 percent power-on), and is planned to be part of NXP’s industry-best longevity commitment (15 years).Product Availability and DemonstrationNXP is sampling the i.MX 8M Plus applications processors to customers now. The company will showcase its i.MX applications processor families at CES 2020 in its booth, CP-18, in Las Vegas between January 8-11.For more information, please contact a local NXP sales representative.NXP CES 2020 Press Kit: https://media.nxp.com/press-kitAbout NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.NXP, EdgeVerse, Immersiv3D, and the NXP logo are trademarks of NXP B.V. All other products or service names are the property of their respective owners. ARM and Cortex are trademarks or registered trademarks of ARM Ltd or its subsidiaries in the EU and/or elsewhere. All rights reserved. © 2020 NXP B.V.For more information, please contact:NXP-Smart CityNXP-IoTNXP-Smart HomeA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a00fdfd5-6f22-4e92-8131-80ead4b1648b"
    },
    {
        "title": "NXP Unlocks the Full Potential of Vehicle Data with the S32G Automotive Network Processors",
        "subtitle": "",
        "date": "Jan 6, 2020 2:36AM EST",
        "content": "LAS VEGAS, Jan.  06, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI), the world’s largest supplier of automotive semiconductors, has announced its new S32G vehicle network processors. These processors mark a significant turning point in the way vehicle architectures are designed and implemented. As the latest offering from NXP’s S32 family of processors, the S32G processors enable the automotive industry shift to high performance domain-based vehicle architectures and provide reduced software complexity and enhanced security and safety. Adopted by top global OEMs, the S32G processors’ primary role will be in service-oriented gateways that will help transform OEMs from carmakers into vehicle data-driven service providers with expanded business opportunities. Forthcoming generations of connected vehicles will require a dramatic shift in performance and security to deliver data-driven opportunities. The S32G processors take automotive networking to a new level by securely managing data transmission around the vehicle and protecting safety critical applications from malicious intent. These processors are the world’s first integration of traditional MCUs with high-performance application processors with ASIL D functional safety support, and network acceleration, providing a significantly greater level of functionality than previously offered in a single device.The evolution to connected, autonomous, electrified vehicles will allow a host of data-based services to emerge. Usage-based insurance, vehicle health monitoring and fleet management services for commercial operators are a few of the opportunities under exploration by OEMs, enabled by NXP’s robust, secure processing capabilities.The S32G is not, however, solely a network processor. Its unique combination of capabilities enables it to support the latest ADAS applications, as well as providing safe and secure communication capabilities that significantly contribute to the total integration of the vehicle’s network. Bernhard Augustin, Director ECU Development Autonomous Driving at Audi said, “We found the unique combination of networking, performance and safety features of the S32G processor to be ideal for use in our next-generation ADAS domain controller.”About the NXP S32 Family of ProcessorsThe NXP S32 architecture addresses the challenges of future car development with a host of architectural innovations designed to allow carmakers to bring rich in-vehicle experiences and automated driving functions to market much faster than before.The NXP S32 family of processors offer a unified architecture with high-performance MCUs and MPUs and application-specific acceleration and interfaces, supported by an identical software environment across application platforms. The software development environment allows developers to reuse costly research and development work and therefore respond quicker to changing vehicle architectures and intense time-to-market demands. The platform is developed to deliver automotive quality, reliability, and ASIL D performance across multiple application spaces throughout vehicles. S32G Processors’ Key AttributesS32G System Solution NXP has announced its multi-gigabit safe and secure automotive Ethernet switch, the SJA1110 which is optimized for integration with S32G processors. The new Ethernet switch is aligned to the latest TSN standards and offers integrated 100BASE-T1 PHYs, hardware-assisted security and safety capabilities and multi-gigabit interfaces. The combination of NXP’s S32G processor, SJA1110 switch and VR5510 power management IC addresses the biggest challenges facing vehicle networking today including scalability, safety, security and high-speed traffic engineering.S32G Availability and Enablement The S32G274A is the first of four devices in the S32G family and is sampling today to lead customers.  Enablement by NXP and a strong partner ecosystem include comprehensive board, software, tools and systems support to accelerate customer designs.  To learn more, visit https://www.nxp.com/S32G.About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.comNXP and the NXP logo are trademarks of NXP B.V. All other product or service names are the property of their respective owners. Arm is a trademark or registered trademark of Arm Limited (or its subsidiaries) in the US and/or elsewhere. The related technology may be protected by any or all of patents, copyrights, designs and trade secrets. All rights reserved.  © 2019 NXP B.V. For more information, please contact:NXP- AutoA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/37f9f66e-162b-4b0a-aa12-4d3c106e8af5 "
    },
    {
        "title": "NXP Announces Safe and Secure Automotive Ethernet Switch for Time Sensitive Networking (TSN)",
        "subtitle": "",
        "date": "Jan 6, 2020 1:55AM EST",
        "content": "LAS VEGAS, Jan.  06, 2020  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI), the world’s largest supplier of automotive semiconductors, has announced a multi-gigabit Ethernet switch designed to help automakers deliver the high-speed networks required for evolving connected vehicles. The NXP SJA1110 is the first automotive Ethernet switch with safety capabilities built in, offering integrated 100BASE-T1 PHYs, hardware-assisted security as well as multi-gigabit interfaces. Optimized for integration with NXP’s S32G vehicle network processor, the SJA1110 switch is also part of an overall networking solution which includes the VR5510 power management IC. Together, this solution addresses the biggest challenges facing vehicle networking today including scalability, safety, security and high-speed traffic engineering.Sophisticated new Service-Oriented Gateways and domain controllers are required to accommodate connected services such as Over-The-Air updates and emerging data-driven applications, while also supporting the underlying Ethernet-based web sensors, actuators and processing unit. These networks must be scalable and move data quickly and securely without posing dangers to the car, the passengers or their personal data. Additionally, these car networks must deliver the functional safety needed to ensure that if vehicles fail, they do it safely.The SJA1110 Ethernet switch helps carmakers obtain the scalability, security and performance with the right mix of hardware features and a balanced number of ports for high and low-port-count ECUs. The SJA1110 is aligned to the latest TSN standards and offers integrated 100BASE-T1 PHYs, hardware-assisted security and safety capabilities along with multi-gigabit interfaces.SafetyThe SJA1110 enables customers to meet their ASIL requirements and enrich the safety capabilities of the vehicle by implementing dedicated failure-detection mechanisms that can enable predictive maintenance solutions. Such approaches can then significantly contribute to the comfort of the final vehicle owner and reduce cost and improve efficiency for large fleet management firms.SecurityNXP’s heritage in bank cards and e-passports has been incorporated into the SJA1110 as part of a layered security approach complete with hardware assisted secure boot, denial-of-service prevention and distributed Intrusion-detection capabilities. The SJA1110 switch processes every Ethernet frame reaching the ECU by validating it against HW-based security rules which in turn collect statistics and can trigger escalations if something is not conformant to specification. Such mechanisms are the basis for building best-in class firewall and intrusion detection systems.ScalabilityAvailable in four hardware (HW) and software (SW) compatible variants, with a rich set of NXP original SW, an open integrated controller, and several BOM optimization options, the SJA1110 switch provides a solid foundation for scalable ECU designs for complex gateways, advanced driving assistance systems and infotainment units.NXP Automotive Network System Solution The SJA1110 multi-gigabit safe and secure automotive Ethernet switch is optimized for integration with S32G vehicle network processors as part of an automotive network system solution that includes the VR5510 PMIC. Together, S32G processors and SJA1110 enable the automotive industry shift to high performance domain-based vehicle architectures and provide reduced software complexity and enhanced security and safety. Adopted by top global OEMs, the S32G processors’ primary role will be in service-oriented gateways that will help transform OEMs from carmakers into vehicle data-driven service providers with expanded business opportunities.  About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.comNXP and the NXP logo are trademarks of NXP B.V. All other product or service names are the property of their respective owners. © 2020 NXP B.V. For more information, please contact:NXP-AutoA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/b57fc370-f325-4806-8bfd-6fa27d9fb7f2 "
    },
    {
        "title": "NXP Semiconductors to Host Investor Open House at Consumer Electronics Show",
        "subtitle": "",
        "date": "Dec 9, 2019 4:30PM EST",
        "content": "EINDHOVEN, The Netherlands, Dec.  09, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced it will host an open house for the investment community at the 2020 Consumer Electronics Show. The event will enable buy-side and sell-side participants to engage with various NXP business leaders and experience product demonstrations to better understand the Company’s initiatives.Specific details:During the open house, NXP will not facilitate private meetings with investors or analysts, nor provide an update to current business conditions as the Company will be in its quiet period ahead of fourth quarter earnings.Pre-registration is not required.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com  Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after NXP distributes this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in NXP’s SEC filings. Copies of NXP’s SEC filings are available on NXP’s Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.NXP-CORP"
    },
    {
        "title": "Marvell Completes Divestiture of Wi-Fi Connectivity Business to NXP",
        "subtitle": "Updates Revenue Guidance to Reflect Recent Transactions",
        "date": "Dec 6, 2019 4:05PM EST",
        "content": "SANTA CLARA, Calif., Dec. 6, 2019 /PRNewswire/ -- Marvell (NASDAQ: MRVL) today announced the completion of the sale of its Wi-Fi Connectivity business to NXP (NASDAQ: NXPI).  The divestiture encompasses Marvell's Wi-Fi and Bluetooth technology portfolios and related assets.  Updated Revenue GuidanceMarvell is updating its current quarter revenue guidance to reflect the Wi-Fi Connectivity business sale to NXP.  The Company now anticipates fourth quarter FY20 revenue of $710 million +/- 3% vs. original guidance for $750 million +/- 3% as provided at the time of the third quarter earnings announcement on December 3, 2019.   About MarvellMarvell first revolutionized the digital storage industry by moving information at speeds never thought possible. Today, that same breakthrough innovation remains at the heart of the company's storage, processing, networking, security and connectivity solutions. With leading intellectual property and deep system-level knowledge, Marvell's semiconductor solutions continue to transform the enterprise, cloud, automotive, industrial and consumer markets. To learn more, visit: https://www.marvell.com. Forward-Looking Statements under the Private Securities Litigation Reform Act of 1995This press release contains forward-looking statements within the meaning of the federal securities laws that involve risks and uncertainties. Words such as \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"seeks,\" \"estimates,\" \"can,\" \"may,\" \"will,\" \"would\" and similar expressions identify such forward-looking statements. These statements are not guarantees of results and should not be considered as an indication of future activity or future performance. Actual events or results may differ materially from those described in this press release due to a number of risks and uncertainties, including, but not limited to: the risk that the company may not realize the anticipated benefits of the acquisitions of Aquantia Corp. and the Application Specific Integrated Circuit (ASIC) business of GLOBALFOUNDRIES and the divestiture of Marvell's Wi-Fi Connectivity business to NXP (collectively, the \"Transactions\"); the effect of the consummation of the Transactions on the company's business relationships, operating results, and business generally; potential difficulties in employee retention as a result of the Transactions; the ability of Marvell to successfully integrate operations and product lines related to the acquisitions; the ability of Marvell to implement its plans, forecasts, and other expectations with respect to the Transactions and realize the anticipated synergies and cost savings in the time frame anticipated or at all; the impact of international conflict and economic volatility in either domestic or foreign markets including risks related to trade conflicts, bans and tariffs; the risks associated with manufacturing and selling products and customers' products outside of the United States; Marvell's ability to define, design and develop products for the 5G market; Marvell's ability to market its 5G products to Tier 1 infrastructure customers; the effects of transitioning to smaller geometry process technologies; the impact of any change in the income tax laws in jurisdictions where Marvell operates and the loss of any beneficial tax treatment that Marvell currently enjoys; the risk of downturns in the highly cyclical semiconductor industry; Marvell's dependence upon the storage and networking markets, which are highly cyclical and intensely competitive; the outcome of pending or future litigation and legal and regulatory proceedings; Marvell's dependence on a small number of customers; the impact and costs associated with changes in international financial and regulatory conditions; Marvell's ability and the ability of its customers to successfully compete in the markets in which it serves; Marvell's reliance on independent foundries and subcontractors for the manufacture, assembly and testing of its products; Marvell's ability and its customers' ability to develop new and enhanced products and the adoption of those products in the market; decreases in gross margin and results of operations in the future due to a number of factors; Marvell's ability to estimate customer demand and future sales accurately; Marvell's ability to scale its operations in response to changes in demand for existing or new products and services; risks associated with acquisition and consolidation activity in the semiconductor industry; the effects of any other potential acquisitions, divestitures or investments by Marvell; Marvell's ability to protect its intellectual property; Marvell's maintenance of an effective system of internal controls; severe financial hardship or bankruptcy of one or more of Marvell's major customers; and other risks detailed in Marvell's SEC filings from time to time. For other factors that could cause Marvell's results to vary from expectations, please see the risk factors identified in Marvell's Quarterly Report on Form 10-Q for the fiscal quarter ended November 2, 2019 as filed with the SEC on December 4, 2019, and other factors detailed from time to time in Marvell's filings with the SEC. Marvell undertakes no obligation to revise or publicly update any forward-looking statements.For further information, contact: Ashish Saran Vice President, Investor Relations 408-222-0777 ir@marvell.com   View original content:http://www.prnewswire.com/news-releases/marvell-completes-divestiture-of-wi-fi-connectivity-business-to-nxp-300970797.htmlSOURCE  Marvell"
    },
    {
        "title": "NXP Completes Acquisition of Marvell’s Wi-Fi and Bluetooth Connectivity Assets",
        "subtitle": "",
        "date": "Dec 6, 2019 2:30PM EST",
        "content": "EINDHOVEN, The Netherlands, Dec.  06, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced the completion of the acquisition of the wireless connectivity assets from Marvell (NASDAQ: MRVL), pursuant to the terms of the previously announced agreement from May 2019.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IOT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.comForward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after NXP distributes this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in NXP’s SEC filings. Copies of NXP’s SEC filings are available on NXP’s Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.   For further information, please contact:NXP-CORP"
    },
    {
        "title": "NXP and Marvell Announce Final Regulatory Approval and Expected Close Date for NXP’s Acquisition of Marvell’s Wi-Fi and Bluetooth Connectivity Assets",
        "subtitle": "",
        "date": "Dec 3, 2019 8:00AM EST",
        "content": "EINDHOVEN, The Netherlands, and SANTA CLARA, Calif., Dec.  03, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) and Marvell (NASDAQ: MRVL) today announced that all necessary regulatory approvals have been received for NXP’s acquisition of the wireless connectivity portfolio from Marvell.The companies expect to close the transaction in the first half of December 2019.“We are pleased that the closing of this deal is upon us, and ahead of schedule,” said Rick Clemmer, NXP Chief Executive Officer. “Marvell’s world-class engineering team and industry-leading connectivity product set, especially the disruptive Wi-Fi 6 portfolio, will immediately complement NXP’s processing, security and connectivity offerings in the Industrial & IoT, as well as in the Automotive and Communication Infrastructure markets. We are very excited to soon be able to offer NXP’s customers one of the broadest portfolios of edge solutions in the industry, truly enabling us to deliver on our vision to provide Secure Connections for the Smarter World.”In May 2019, NXP agreed to acquire Marvell’s wireless connectivity portfolio in an all-cash, asset transaction. The acquisition will enable NXP to deliver complete, scalable processing and connectivity solutions to its customers across its end markets, including tailored security and a full suite of wireless connectivity spanning Wi-Fi, Bluetooth, Bluetooth Low Energy, Zigbee, Thread and Near Field Communications (NFC).The acquisition includes nearly 600 people worldwide and is expected to be accretive to NXP’s non-GAAP operating profit in the first full quarter after the transaction closes.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.About MarvellMarvell first revolutionized the digital storage industry by moving information at speeds never thought possible. Today, that same breakthrough innovation remains at the heart of the company's storage, processing, networking, security and connectivity solutions. With leading intellectual property and deep system-level knowledge, Marvell's semiconductor solutions continue to transform the enterprise, cloud, automotive, industrial and consumer markets. To learn more, visit: https://www.marvell.com.Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after NXP distributes this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in NXP’s SEC filings. Copies of NXP’s SEC filings are available on NXP’s Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.   For further information, please contact:NXP-Corp"
    },
    {
        "title": "NXP, Dongfeng Venucia, and Hangsheng Electronics Collaboration Achieves Milestone: First Global Mass Production of Smart eCockpits",
        "subtitle": "",
        "date": "Nov 21, 2019 9:00AM EST",
        "content": "EINDHOVEN, Netherlands, Nov.  21, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI), Dongfeng Venucia, and Hangsheng Electronics today jointly announced that the Venucia T90 e-cockpit, “Venucia 3.0 PLUS,” marks a mass production milestone in the companies’ joint efforts to bring next-generation eCockpits to drivers.Co-developed by Dongfeng-Nissan Technology Center, Hangsheng Electronics, and NXP, the Venucia 3.0 PLUS leverages NXP’s high-performance i.MX 8QuadMax applications processor to bring a dynamic dashboard with digital clusters for multimedia, extended functionality including vehicle-to-home connectivity, anytime online navigation, and sensor-based climate control. NXP’s unique hardware partitioning architecture and capability to run multiple operating systems, without a hypervisor, ensures that the Venucia 3.0 PLUS subsystems – including safety-critical displays – remain functioning.Yang Hong, President of Shenzhen Hangsheng Electronics, said, “Advanced, reliable, and scalable system solutions are the primary considerations for Hangsheng. NXP’s i.MX 8 QuadMax has attracted a lot of attention in the industry since it was announced, providing a powerful processing platform for in-vehicle infotainment systems. NXP's strong expertise and global partner ecosystem certainly backed the successful development and product launch. We will extend our collaboration to provide solutions that meet the higher requirements of Venucia and other strategic customers.”Ma Lei, General Manager of Dongfeng Venucia, said, “As one of the world's first smart cars with an eCockpit powered by the i.MX 8QuadMax applications processor, the all-new Venucia T90 represents a leap in performance. When it comes to user experience, the next-generation Venucia 3.0 PLUS system can provide real-time multimedia entertainment, taking the performance of in-vehicle devices to a new level. We are very excited to have NXP's latest technology on the all-new Venucia T90. The development of connected vehicles in the future will require technology that keeps pushing the boundaries. We hope to deepen our collaboration in the field of smart vehicles, to provide a more powerful and more intelligent automotive brain for consumers.”“The future of transportation relies on auto and tech industry leaders working together to develop a scalable platform that automakers around the globe can adopt, customize and deploy,” said Ron Martino, vice president and general manager of i.MX application processors for automotive and industrial applications. “We’re happy to work with leaders like Dongfeng-Nissan and Hangsheng to deliver vehicles that are smart, safe, and connected.” NXP’s i.MX 8QuadMax Applications ProcessorsNXP’s i.MX 8QuadMax is a high-end processor platform designed for multimedia infotainment experiences and digital clusters in connected vehicles. The platform’s ‘One Processor, Multiple Systems’ design has dramatically simplified the process of developing, testing, and deploying multiple operating systems. The latest i.MX 8 applications processors incorporate advanced security technologies and standards, including encrypted boot, elliptical curve cryptography, secure key storage, as well as support for AES, SHE and other automotive security standards – all in a single AEC-Q100 Grade 3 qualified device.The i.MX 8QuadMax integrates two Arm® Cortex®-A72 cores, four Cortex-A53 cores, two Cortex-M4F cores, two GC7000XS/VX GPUs and includes a HiFi 4 DSP, LPDDR4 memory support as well as dual Gigabit Ethernet with Audio Video Bridging (AVB) capability. Its GPUs, four Arm cores, and IO options in the i.MX 8QuadMax offers the processing and flexibility for artificial intelligence, machine learning, and processing efficiency needed for future generations of infotainment systems.About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.About Dongfeng VenuciaFounded on September 8, 2010, Venucia is an important self-owned brand of Dongfeng Motor Co., Ltd. Based on the corporate vision of “To become a self-owned mainstream high-value commodity provider” and brand promise of “The joy of mobile experience inspires progress in life,” Dongfeng Venucia (Hereinafter referred to as DFV) has realized the comprehensive evolution from “High Quality” to “Smart” after absorbing advanced technology, integrating worldwide wisdom, continuing to discover and innovate. Under the guidance of “New Modernizations,” DFV takes “Smart Tech” as the core to build “Smart Driving” and “Smart Connectivity” in the field of gasoline vehicles and new energy vehicles, including SUV, Sedan, and MPV. Furthermore, DFV is also building a super lineup of “China Automobile Brain” as to provide Chinese customers with higher value vehicles and fresher smart experience. About Shenzhen Hangsheng Electronic Co., LtdHangsheng Company is deeply engaged in the field of automotive electronics and is committed to researching the leading core technologies in the fields of intelligent connected car infotainment systems, intelligent driving assistance systems, and new energy vehicle control systems, helping China to move from a mega automotive country to a strong automotive power. At present, Hangsheng has grown into the most influential enterprise in China's automotive electronics industry, with an annual production of nearly 6 million sets of automotive electronics products. It has established long-term, friendly, and stable cooperation with many domestic automobile manufacturers. Among the top 20 car manufacturers, 18 are Hangsheng customers with a market coverage of 90%. In the future, Hangsheng is determined to become a world-class, international automotive electronics leader.NXP and the NXP logo are trademarks of NXP B.V. ARM and Cortex are trademarks or registered trademarks of ARM Ltd or its subsidiaries in the EU and/or elsewhere. All rights reserved. All other products or service names are the property of their respective owners. All rights reserved. © 2019 NXP B.V.For more information, please contact:                                             "
    },
    {
        "title": "NXP Semiconductors Announces Quarterly Dividend and Resumption of Share Repurchases",
        "subtitle": "",
        "date": "Nov 19, 2019 4:30PM EST",
        "content": "EINDHOVEN, The Netherlands, Nov.  19, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced that, as part of the Quarterly Dividend Program, its board of directors has approved the payment of an interim dividend for the fourth quarter of 2019 of $0.375 per ordinary share. The interim dividend will be paid on January 6, 2020 to shareholders of record as of December 16, 2019.Additionally, the NXP board of directors has authorized to resume the share buy-back program in 2020, authorizing up to $2 billion of share repurchase to be executed at times and manners determined by the company management.Taxation – Cash Dividends Cash dividends will be subject to the deduction of Dutch dividend withholding tax at the rate of 15 percent, which may be reduced in certain circumstances. Non-Dutch resident shareholders, depending on their circumstances, may be entitled to a full or partial refund of Dutch dividend withholding tax. If you are uncertain as to the tax treatment of any dividends, consult your tax advisor.About NXP SemiconductorsNXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com. Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after NXP distributes this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in NXP’s SEC filings. Copies of NXP’s SEC filings are available on NXP’s Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.    "
    },
    {
        "title": "NXP Semiconductors to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 13, 2019 8:00AM EST",
        "content": "EINDHOVEN, The Netherlands, Nov.  13, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today announced participation at the following events with the financial community:When available, interested parties can listen to live audio webcasts of the presentations from the NXP Investor Relations website https://investors.nxp.com. Webcast replays will be available within 24 hours.About NXP SemiconductorsNXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.Forward-looking Statements This document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts. By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected. These factors, risks and uncertainties include the following: market demand and semiconductor industry conditions; the ability to successfully introduce new technologies and products; the end-market demand for the goods into which NXP’s products are incorporated; the ability to generate sufficient cash, raise sufficient capital or refinance corporate debt at or before maturity; the ability to meet the combination of corporate debt service, research and development and capital investment requirements; the ability to accurately estimate demand and match manufacturing production capacity accordingly or obtain supplies from third-party producers; the access to production capacity from third-party outsourcing partners; any events that might affect third-party business partners or NXP’s relationship with them; the ability to secure adequate and timely supply of equipment and materials from suppliers; the ability to avoid operational problems and product defects and, if such issues were to arise, to correct them quickly; the ability to form strategic partnerships and joint ventures and to successfully cooperate with alliance partners; the ability to win competitive bid selection processes to develop products for use in customers’ equipment and products; the ability to achieve targeted efficiencies and cost savings; the ability to successfully hire and retain key management and senior product architects; and, the ability to maintain good relationships with our suppliers. In addition, this document contains information concerning the semiconductor industry and NXP’s business generally, which is forward-looking in nature and is based on a variety of assumptions regarding the ways in which the semiconductor industry, NXP’s markets and product areas may develop. NXP has based these assumptions on information currently available, if any one or more of these assumptions turn out to be incorrect, actual results may differ from those predicted. While NXP does not know what impact any such differences may have on its business, if there are such differences, its future results of operations and its financial condition could be materially adversely affected. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak to results only as of the date the statements were made. Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after we distribute this document, whether to reflect any future events or circumstances or otherwise. For a discussion of potential risks and uncertainties, please refer to the risk factors listed in our SEC filings. Copies of our SEC filings are available on our Investor Relations website, www.nxp.com/investor or from the SEC website, www.sec.gov.For further information, please contact: "
    },
    {
        "title": "NXP Announces New Automotive Ultra-Wideband Chip Capable of Turning Smartphones into Car Keys",
        "subtitle": "",
        "date": "Nov 12, 2019 2:00AM EST",
        "content": "News HighlightsMUNICH, Germany, Nov.  12, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI), the world’s largest provider of automotive semiconductors, today announced an addition to its UWB portfolio with a new automotive UWB IC. UWB provides precise, secure, real-time localization capabilities unrivaled by other wireless technologies such as Wi-Fi, Bluetooth, and GPS. The technology is designed to give spatial awareness to UWB-equipped cars, mobiles, and other smart devices, to enable cars to know exactly where the users are. For the first time, smartphone-based car access offers the same level of convenience as state-of-the-art key fobs. Users can open and start cars, while leaving their phones in their pockets or bags, and enjoy secure remote parking via smartphone. Furthermore, the new UWB IC brings maximum level of protection against car theft through relay attacks.In conjunction with the launch of the IC, NXP, BMW Group, Continental and others are jointly working on UWB implementations through the Car Connectivity Consortium (CCC) and IEEE to ensure the best customer experiences at the intersection of the vehicle, mobile, and consumer devices. These standardization efforts aim to enable a global standard for handsfree smart access and other automotive localization use cases based on UWB.“Today, the smartphone plays a central role in the digital lifestyle. We are convinced that the smartphone-based comfort access is just the beginning of a series of innovative vehicle-related UWB use cases,” says Dr. Olaf Müller, Head of Development Digital Access Functions, BMW Group.“Continental is at the forefront in delivering secure localization platforms that will create leading applications that catch the imagination of the power user generation,” said Philippe Fournet-Fayat, Director at Continental AG for Car Access Systems. “To deliver new use cases, such as smartphone access and remote parking requires the ultra-precise real-time localization capabilities of UWB.”“The opportunities that exist in the web of mobility and automotive are vast. As a leading semiconductor manufacturer in these segments, we have the ambition to tap these and bring more seamless and secure mobility experiences to users,” said Markus Staeblein, vice president and general manager of Secure Car Access at NXP. “We are pleased to jointly work on the required interoperability and standardization for UWB  with BMW Group, Continental and other CCC members.”The NXP NCJ29D5 is the first of a new generation of UWB ICs designed specifically for the demands of the global automotive industry. Together, with NXP connectivity and security solutions, such as Bluetooth, Near Field Communication, and Secure Element (SE), this technology enables true secure handsfree smart access supporting the car connectivity standardization.Additional Automotive UWB Use CasesBeyond smart access and remote parking, NXP’s automotive UWB targets other exciting use cases such as More information on NXP UWB use cases can be found at www.nxp.com/UWB.About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.For more information, please contact:"
    },
    {
        "title": "NXP Semiconductors Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 28, 2019 5:00PM EDT",
        "content": "EINDHOVEN, The Netherlands, Oct.  28, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI) today reported financial results for the third quarter of 2019, ended September 29, 2019.“NXP delivered revenue of $2.3 billion for the third quarter. With sales near the high-end of our guidance and good expense control, we successfully delivered improved operating profitability above the high-end of our guidance range. Additionally, during the quarter we returned $79 million to our shareholders, for a total of $6.6 billion returned to shareholders since July 2018. Looking forward, we continue to believe that our product portfolio investments are addressing our customers’ long-term requirements, while in the short-term the global demand environment appears to have stabilized, but the intermediate demand environment continues to be uncertain, and has not markedly improved.” said Richard Clemmer, NXP Chief Executive Officer.Key HighlightsSummary of Reported Third Quarter 2019 ($ millions, unaudited) (1)1.     Additional Information for the Third Quarter 2019:Guidance for the Fourth Quarter 2019: ($ millions) (1)Note (1) Additional Information:NXP has based the guidance included in this release on judgments and estimates that management believes are reasonable given its assessment of historical trends and other information reasonably available as of the date of this release. Please note, the guidance included in this release consists of predictions only, and is subject to a wide range of known and unknown risks and uncertainties, many of which are beyond NXP's control. The guidance included in this release should not be regarded as representations by NXP that the estimated results will be achieved. Actual results may vary materially from the guidance we provide today. In relation to the use of non-GAAP financial information see the note regarding \"Non-GAAP Financial Measures\" below. For the factors, risks, and uncertainties to which judgments, estimates and forward-looking statements generally are subject see the note regarding \"Forward-looking Statements.\" We undertake no obligation to publicly update or revise any forward-looking statements, including the guidance set forth herein, to reflect future events or circumstances.Non-GAAP Financial MeasuresIn managing NXP's business on a consolidated basis, management develops an annual operating plan, which is approved by our Board of Directors, using non-GAAP financial measures. In measuring performance against this plan, management considers the actual or potential impacts on these non-GAAP financial measures from actions taken to reduce costs with the goal of increasing our gross margin and operating margin and when assessing appropriate levels of research and development efforts. In addition, management relies upon these non-GAAP financial measures when making decisions about product spending, administrative budgets, and other operating expenses. We believe that these non-GAAP financial measures, when coupled with the GAAP results and the reconciliations to corresponding GAAP financial measures, provide a more complete understanding of the Company’s results of operations and the factors and trends affecting NXP’s business. We believe that they enable investors to perform additional comparisons of our operating results, to assess our liquidity and capital position and to analyze financial performance excluding the effect of expenses unrelated to operations, certain non-cash expenses and share-based compensation expense, which may obscure trends in NXP's underlying performance.  This information also enables investors to compare financial results between periods where certain items may vary independent of business performance,and allow for greater transparency with respect to key metrics used by management.These non-GAAP financial measures are provided in addition to, and not as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP. The presentation of these and other similar items in NXP’s non-GAAP financial results should not be interpreted as implying that these items are non-recurring, infrequent, or unusual.  Reconciliations of these non-GAAP measures to the most comparable measures calculated in accordance with GAAP are provided in the financial statements portion of this release in a schedule entitled “Financial Reconciliation of GAAP to non-GAAP Results (unaudited).” Please refer to the NXP Historic Financial Model file found on the Financial Information page of the Investor Relations section of our website at https://investors.nxp.com for additional information related to our rationale for using these non-GAAP financial measures, as well as the impact of these measures on the presentation of NXP's operations.In addition to providing financial information on a basis consistent with U.S. generally accepted accounting principles (“GAAP”), NXP also provides the following selected financial measures on a non-GAAP basis: (i) Gross profit, (ii) Gross margin, (iii) Research and development, (iv) Selling, general and administrative, (v) Amortization of acquisition-related intangible assets, (vi) Other income, (vii) Operating income (loss), (viii) Operating margin, (ix) Financial Income (expense), (x) adjusted net income, adjusted EBITDA and trailing 12 month adjusted EBITDA, and (xi) free cash flow and free cash flow as a percent of Revenue. The non-GAAP information excludes the amortization of acquisition related intangible assets, the purchase accounting effect on inventory and property, plant and equipment, merger related costs (including integration costs), certain items related to divestitures, share-based compensation expense, restructuring and asset impairment charges, non-cash interest expense on convertible notes, extinguishment of debt, and foreign exchange gains and losses.Conference Call and Webcast InformationNXP will host a conference call on October 29, 2019 at 8:00 a.m. U.S. Eastern Time (2:00 p.m. Central European Time) to discuss its third quarter 2019 results and provide an outlook for the fourth quarter of 2019.Interested parties may join the conference call by dialing 1 – 888 – 603 – 7644 (within the U.S.) or 1 – 484 – 747 - 6631 (outside of the U.S.). The participant pass-code is 8958328. To listen to a webcast of the event, please visit the Investor Relations section of the NXP website at https://investors.nxp.com. The webcast will be recorded and available for replay shortly after the call concludes.About NXP SemiconductorsNXP Semiconductors N.V. (NASDAQ: NXPI) enables secure connections and infrastructure for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the secure connected vehicle, end-to-end security & privacy, and smart connected solutions markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.Forward-looking StatementsThis document includes forward-looking statements which include statements regarding NXP’s business strategy, financial condition, results of operations, and market data, as well as any other statements which are not historical facts.  By their nature, forward-looking statements are subject to numerous factors, risks and uncertainties that could cause actual outcomes and results to be materially different from those projected.  These factors, risks and uncertainties include the following: market demand and semiconductor industry conditions; the ability to successfully introduce new technologies and products; the end-market demand for the goods into which NXP’s products are incorporated; the ability to generate sufficient cash, raise sufficient capital or refinance corporate debt at or before maturity; the ability to meet the combination of corporate debt service, research and development and capital investment requirements; the ability to accurately estimate demand and match manufacturing production capacity accordingly or obtain supplies from third-party producers; the access to production capacity from third-party outsourcing partners; any events that might affect third-party business partners or NXP’s relationship with them;  the ability to secure adequate and timely supply of equipment and materials from suppliers; the ability to avoid operational problems and product defects and, if such issues were to arise, to correct them quickly; the ability to form strategic partnerships and joint ventures and to successfully cooperate with alliance partners; the ability to win competitive bid selection processes to develop products for use in customers’ equipment and products; the ability to achieve targeted efficiencies and cost savings;  the ability to successfully hire and retain key management and senior product architects; and, the ability to maintain good relationships with our suppliers.  In addition, this document contains information concerning the semiconductor industry and NXP’s business generally, which is forward-looking in nature and is based on a variety of assumptions regarding the ways in which the semiconductor industry, NXP’s markets and product areas may develop.  NXP has based these assumptions on information currently available, if any one or more of these assumptions turn out to be incorrect, actual results may differ from those predicted.  While NXP does not know what impact any such differences may have on its business, if there are such differences, its future results of operations and its financial condition could be materially adversely affected.  Readers are cautioned not to place undue reliance on these forward-looking statements, which speak to results only as of the date the statements were made.  Except for any ongoing obligation to disclose material information as required by the United States federal securities laws, NXP does not have any intention or obligation to publicly update or revise any forward-looking statements after we distribute this document, whether to reflect any future events or circumstances or otherwise.  For a discussion of potential risks and uncertainties, please refer to the risk factors listed in our SEC filings. Copies of our SEC filings are available on our Investor Relations website, https://investors.nxp.com or from the SEC website, www.sec.gov.For further information, please contact:NXP SemiconductorsTable 1: Condensed consolidated statement of operations (unaudited)NXP SemiconductorsTable 2: Condensed consolidated balance sheet (unaudited)NXP SemiconductorsTable 3: Condensed consolidated statement of cash flows (unaudited)NXP SemiconductorsTable 4: Financial Reconciliation of GAAP to non-GAAP Results (unaudited)NXP SemiconductorsTable 5: Adjusted EBITDA and Free Cash Flow (unaudited) "
    },
    {
        "title": "Volkswagen and NXP Deliver Safety to European Roads with World’s Largest Rollout of Communicating Car Technology",
        "subtitle": "",
        "date": "Oct 28, 2019 3:00AM EDT",
        "content": "Volkswagen Golf launches with NXP’s secure vehicle-to-everything (V2X) technologyHAMBURG, Germany, Oct.  28, 2019  (GLOBE NEWSWIRE) -- NXP Semiconductors N.V. (NASDAQ: NXPI), the world’s largest provider of automotive semiconductors1, is pleased to announce the rollout of its life-saving RoadLINK® V2X communication solution in the new Volkswagen Golf. The recently released Golf of the 8th generation is the first volume European car model equipped with V2X, offering a major boost to the deployment of the technology on European roads and beyond. The technology can prevent accidents by having cars communicate with each other, independent of car brands and without the support of cellular infrastructure.“Road safety forms the core of VW’s commitment to its customers. As a high-volume manufacturer we aim to be a pioneer in this space,” said Dr. Johannes Neft, Head of Vehicle Body Development for the Volkswagen brand. “The introduction of V2X, together with traffic infrastructure providers and other vehicle manufacturers, is a major milestone in this direction. Volkswagen includes this technology, which doesn’t involve any user fees, as a standard feature to accelerate V2X penetration in Europe.”“Volkswagen has taken a bold step to seize the road safety initiative through the implementation of V2X,” said Torsten Lehman, senior vice president and general manager of Driver Assistance and Infotainment at NXP. “After proving our technology in more than one million test days globally, we are pleased that our RoadLINK technology, developed in cooperation with Cohda Wireless, was chosen to enable new levels of safety in Europe’s most popular car model, the new Golf.”NXP and Volkswagen have closely collaborated for high-reliability and performance, as well as for  standardization of V2X communication that addresses cybersecurity and privacy protection.A Media Snippet accompanying this announcement is available by clicking on the image or link below:SAF 5100: NXP’s RoadLINK® Solution includes NXP SAF 5100 processors, TEF5100  transceivers and SXF1800 secure element.V2X in EuropeWi-Fi based V2X is a mature technology that has been tested for more than 10 years. Presently,1000 km of European roads are equipped with V2X technology based on Wi-Fi with 5000 km planned through the end of 2019. Its research and development, testing and standardization has occurred within a strong global eco-system of suppliers and car manufacturers to ensure reliability in diverse road and traffic conditions. Wi-Fi therefore forms the basis of the European standard that has been chosen for vehicle-to-vehicle and vehicle-to-infrastructure communication. An additional benefit is its availability independent of paid cellular services. Other developing cellular based technologies can be added complementary to Wi-Fi-based V2X.V2X communication is set to become a critical part of advanced driving assistance systems and the migration to autonomous cars that communicate with each other and with traffic infrastructure. The unique benefit of Wi-Fi-based V2X is its robust, low latency, real-time communication – regardless of any car brands.NXP offers the only 5.9 GHz V2X system solution proven in volume production today.Recent V2X Technology NewsNotes:1 Based on Strategy Analytics Sensor Market Growth 2019About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.comNXP and the NXP logo are trademarks of NXP B.V. All other product or service names are the property of their respective owners. All rights reserved. © 2019 NXP B.V.See also the press kit World Premiere for the New Volkswagen GolfFor more information, please contact:EuropeBirgit AhlbornTel: +49 170 57 46 124Email: Birgit.ahlborn@nxp.comEurope/United StatesJason DealTel: +44 771 5228414Email: Jason.Deal@nxp.comGreater China / AsiaMing YueTel: +86 21 2205 2690Email: ming.yue@nxp.com  "
    },
    {
        "title": "NXP Debuts New Series of Programmable Baseband Processors for the 5G Access Edge",
        "subtitle": "",
        "date": "Oct 14, 2019 9:00AM EDT",
        "content": "News Highlights:LOS ANGELES, Oct.  14, 2019  (GLOBE NEWSWIRE) -- (Mobile World Congress 2019) – NXP Semiconductors N.V. (NASDAQ: NXPI) today announced a new series of Layerscape Access processors, designed for 5G Access Edge applications. These new Layerscape Access processors target a variety of deployment scenarios compliant with O-RAN Alliance specifications, including Central Units/Distributed Units (CU/DU), Radio Units (RUs), along with Integrated Small Cells and Customer Premises Equipment (CPE) systems.NXP Layerscape Access processors deliver unprecedented control over 5G-NR software architecture to support different network options. A primary challenge in 5G development is how to build-out the network infrastructure where there are a variety of architectures, spectrum, and evolving standards. With these new programmable, open-architecture, and scalable-Layerscape Access products, NXP helps deliver on the 5G promise.NXP’s 5G End-to-End Communication Infrastructure Portfolio From antenna-to-processor, NXP’s programmability, performance, and security products offer a flexible portfolio of 5G technologies that scale from 2x2 RU systems to mMIMO arrays to 100Gbps CU/DU platforms. These products include the NXP Airfast family of RF cellular multi-chip modules. To learn more visit, www.nxp.com/5G.“NXP’s compelling end-to-end portfolio builds on NXP’s history of wireless solutions and industry leadership,” said Tareq Bustami, senior vice president and general manager of NXP’s Digital Networking Solutions. “We believe the uniquely programmable Layerscape Access baseband and integrated data converters offer the performance and flexibility required to enable rapid 5G deployments.” Key Layerscape Access features: New Layerscape Access Families:The new Layerscape Access processors are scheduled to sample to registered early access customers in Q1 2020. Proof of concept development platforms are available today.See live demonstrations at Mobile World Congress Los Angeles 2019 NXP’s 5G Access Edge solutions will be on display, with NXP ecosystem partners at Mobile World Congress from October 22–October 24 at the Los Angeles Convention Center conference room #1879. For sales inquiries or to reserve time to meet with NXP representatives, please contact us at info.5g@nxp.com.About NXP Semiconductors NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better, and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile, and communication infrastructure markets. Built on more than 60 years of combined experience and expertise, the company has approximately 30,000 employees in more than 30 countries and posted revenue of $9.41 billion in 2018. Find out more at www.nxp.com.NXP, Airfast, Layerscape, EdgeVerse, and the NXP logo are trademarks of NXP B.V. Arm trademarks or registered trademarks of Arm Limited (or its subsidiaries) in the US and/or elsewhere. The related technology may be protected by any or all of patents, copyrights, designs and trade secrets. All rights reserved. All other product or service names are the property of their respective owners. All rights reserved. © 2019 NXP B.V.For more information, please contact:                                                          "
    }
]