[
    {
        "title": "O’Reilly Automotive, Inc. Reports Fourth Quarter and Full-Year 2019 Results and Announces Additional $1.0 Billion Share Repurchase Authorization",
        "subtitle": "",
        "date": "Feb 5, 2020 4:30PM EST",
        "content": "SPRINGFIELD, Mo., Feb.  05, 2020  (GLOBE NEWSWIRE) -- O’Reilly Automotive, Inc. (the “Company” or “O’Reilly”) (Nasdaq: ORLY), a leading retailer in the automotive aftermarket industry, today announced record revenues and earnings for its fourth quarter ended December 31, 2019.  The results represent 27 consecutive years of comparable store sales growth and record revenue and operating income for O’Reilly since becoming a public company in April of 1993.4th Quarter Financial ResultsO’Reilly’s CEO and Co-President, Greg Johnson, commented, “We are pleased to once again report another profitable quarter, highlighted by a 4.4% increase in comparable store sales and a 14.2% increase in diluted earnings per share.  While our comparable store sales results for the fourth quarter were in the top half of our expected range, we continued to see ongoing inflationary pressures in our expense structure, and primarily due to an unexpected surge in health benefit costs, our operating profit for the fourth quarter did not meet our expectations.”Sales for the fourth quarter ended December 31, 2019, increased $168 million, or 7%, to $2.48 billion from $2.31 billion for the same period one year ago.  Gross profit for the fourth quarter increased 7% to $1.32 billion (or 53.3% of sales) from $1.23 billion (or 53.3% of sales) for the same period one year ago.  Selling, general and administrative expenses (“SG&A”) for the fourth quarter increased 10% to $883 million (or 35.6% of sales) from $806 million (or 34.8% of sales) for the same period one year ago.  Operating income for the fourth quarter increased 3% to $442 million (or 17.8% of sales) from $428 million (or 18.5% of sales) for the same period one year ago.Net income for the fourth quarter ended December 31, 2019, increased $25 million to $325 million (or 13.1% of sales) from $300 million (or 13.0% of sales) for the same period one year ago.  Diluted earnings per common share for the fourth quarter increased 14% to $4.25 on 76 million shares versus $3.72 on 81 million shares for the same period one year ago.Full-Year Financial ResultsMr. Johnson continued, “Team O’Reilly’s commitment to providing the highest level of customer service in the industry, along with our relentless focus on profitable growth, resulted in full-year comparable stores sales growth of 4.0%, a 5.8% increase in full-year operating profit and an 11.1% increase in 2019 diluted earnings per share.  I would like to take this opportunity to thank our Team for their continued dedication, hard work and commitment to O’Reilly’s ongoing success, highlighted by 2019 marking our 11th consecutive year of 10% or greater diluted earnings per share growth.”Sales for the year ended December 31, 2019, increased $614 million, or 6%, to $10.15 billion from $9.54 billion for the same period one year ago.  Gross profit for the year ended December 31, 2019, increased 7% to $5.39 billion (or 53.1% of sales) from $5.04 billion (or 52.8% of sales) for the same period one year ago.  SG&A for the year ended December 31, 2019, increased 8% to $3.47 billion (or 34.2% of sales) from $3.22 billion (or 33.8% of sales) for the same period one year ago.  Operating income for the year ended December 31, 2019, increased 6% to $1.92 billion (or 18.9% of sales) from $1.82 billion (or 19.0% of sales) for the same period one year ago.Net income for the year ended December 31, 2019, increased $67 million, or 5%, to $1.39 billion (or 13.7% of sales) from $1.32 billion (or 13.9% of sales) for the same period one year ago.  Diluted earnings per common share for the year ended December 31, 2019, increased 11% to $17.88 on 78 million shares versus $16.10 on 82 million shares for the same period one year ago.Mr. Johnson concluded, “We successfully met our goal of 200 net, new store openings in 2019, in addition to converting 20 acquired Bennett stores to the O’Reilly brand.  Also, we closed on our acquisition of Mayasa Auto Parts on November 29, 2019, and we are very pleased to officially welcome the over 1,100 Mayasa Team Members into the O’Reilly family.  The Mayasa acquisition represents O’Reilly’s first expansion outside the U.S. as an international company, and we are excited to work together with the outstanding Mayasa team to build on their history of profitable growth as we enter the Mexican automotive aftermarket.  We continued to enhance our industry-leading distribution network in 2019, as we successfully opened our 28th distribution center in Twinsburg, Ohio, and have two additional distribution center projects under construction in the Nashville and Memphis markets, which will both open in 2020. ”4th Quarter and Full-Year Comparable Store Sales ResultsComparable store sales are calculated based on the change in sales for U.S. stores open at least one year and exclude sales of specialty machinery, sales to independent parts stores and sales to Team Members.  Online sales, resulting from ship-to-home orders and pick-up-in-store orders, for U.S. stores open at least one year, are included in the comparable store sales calculation.  Comparable store sales increased 4.4% for the fourth quarter ended December 31, 2019, on top of 3.3% for the same period one year ago.  Comparable store sales increased 4.0% for the year ended December 31, 2019, on top of 3.8% for the same period one year ago.Share Repurchase ProgramDuring the fourth quarter ended December 31, 2019, the Company repurchased 0.3 million shares of its common stock, at an average price per share of $427.33, for a total investment of $125 million.  During the year ended December 31, 2019, the Company repurchased 3.9 million shares of its common stock, at an average price per share of $369.55, for a total investment of $1.43 billion.  Subsequent to the end of the fourth quarter and through the date of this release, the Company repurchased an additional 0.2 million shares of its common stock, at an average price per share of $428.29, for a total investment of $88 million.  The Company has repurchased a total of 76.4 million shares of its common stock under its share repurchase program since the inception of the program in January of 2011 and through the date of this release, at an average price of $160.61, for a total aggregate investment of $12.27 billion. Today, the Company also announced that its Board of Directors (the “Board”) approved a resolution to increase the authorization amount under its share repurchase program by an additional $1.0 billion, raising the aggregate authorization under the program to $13.75 billion.  The additional $1.0 billion authorization is effective for a three-year period, beginning on February 5, 2020.  Stock repurchases under the program may be made from time to time, as the Company deems appropriate, solely through open market repurchases effected through a broker dealer at prevailing market prices, based on a variety of factors such as price, corporate requirements and overall market conditions.  There can be no assurance as to the number of shares the Company will purchase, if any.  The share repurchase program may be increased or otherwise modified, renewed, suspended or terminated by the Company at any time, without prior notice.  As of the date of this release, the Company had approximately $1.48 billion remaining under its current share repurchase authorizations.1st Quarter and Full-Year 2020 GuidanceThe table below outlines the Company’s guidance for selected first quarter and full-year 2020 financial data:(1)  Weighted-average shares outstanding, assuming dilution, used in the denominator of this calculation, includes share repurchases made by the Company through the date of this release.(2)  Free cash flow is a non-GAAP financial measure.  The table below reconciles Free cash flow guidance to Net cash provided by operating activities guidance, the most directly comparable GAAP financial measure:Non-GAAP InformationThis release contains certain financial information not derived in accordance with United States generally accepted accounting principles (“GAAP”).  These items include adjusted debt to earnings before interest, taxes, depreciation, amortization, share-based compensation and rent (“EBITDAR”) and free cash flow.  The Company does not, nor does it suggest investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, GAAP financial information.  The Company believes that the presentation of adjusted debt to EBITDAR and free cash flow provide meaningful supplemental information to both management and investors that is indicative of the Company’s core operations.  The Company has included a reconciliation of this additional information to the most comparable GAAP measure in the table above and the selected financial information below.Earnings Conference Call InformationThe Company will host a conference call on Thursday, February 6, 2020, at 10:00 a.m. Central Time to discuss its results as well as future expectations.  Investors may listen to the conference call live on the Company’s website at www.OReillyAuto.com by clicking on “Investor Relations” and then “News Room.”  Interested analysts are invited to join the call.  The dial-in number for the call is (847) 619-6396; the conference call identification number is 49267105.  A replay of the conference call will be available on the Company’s website through Friday, February 5, 2021.About O’Reilly Automotive, Inc.O’Reilly Automotive, Inc. was founded in 1957 by the O’Reilly family and is one of the largest specialty retailers of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States, serving both the do-it-yourself and professional service provider markets.  Visit the Company’s website at www.OReillyAuto.com for additional information about O’Reilly, including access to online shopping and current promotions, store locations, hours and services, employment opportunities and other programs.  As of December 31, 2019, the Company operated 5,439 stores in 47 U.S. states and 21 stores in Mexico.Forward-Looking StatementsThe Company claims the protection of the safe-harbor for forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.  You can identify these statements by forward-looking words such as “estimate,” “may,” “could,” “will,” “believe,” “expect,” “would,” “consider,” “should,” “anticipate,” “project,” “plan,” “intend” or similar words.  In addition, statements contained within this press release that are not historical facts are forward-looking statements, such as statements discussing, among other things, expected growth, store development, integration and expansion strategy, business strategies, future revenues and future performance.  These forward-looking statements are based on estimates, projections, beliefs and assumptions and are not guarantees of future events and results.  Such statements are subject to risks, uncertainties and assumptions, including, but not limited to, the economy in general, inflation, tariffs, product demand, the market for auto parts, competition, weather, risks associated with the performance of acquired businesses, our ability to hire and retain qualified employees, consumer debt levels, our increased debt levels, credit ratings on public debt, governmental regulations, information security and cyber-attacks, terrorist activities, war and the threat of war.  Actual results may materially differ from anticipated results described or implied in these forward-looking statements.  Please refer to the “Risk Factors” section of the annual report on Form 10-K for the year ended December 31, 2018, and subsequent Securities and Exchange Commission filings for additional factors that could materially affect the Company’s financial performance.  Forward-looking statements speak only as of the date they were made and the Company undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law.Note:  The balance sheet at December 31, 2018, has been derived from the audited consolidated financial statements at that date but does not include all of the information and footnotes required by United States generally accepted accounting principles for complete financial statements.(1) The Company adopted Accounting Standard Codification 842 - Leases (“ASC 842”) during the first quarter ended March 31, 2019, using the additional, optional transition method, which does not require prior periods to be restated.(2)  Includes goodwill and other intangible assets related to the acquisition of Mayasa Auto Parts as part of the preliminary purchase price allocation. Note: The income statement for the year ended December 31, 2018, has been derived from the audited consolidated financial statements at that date but does not include all of the information and footnotes required by United States generally accepted accounting principles for complete financial statements.Note: The cash flow statement for the year ended December 31, 2018, has been derived from the audited consolidated financial statements at that date but does not include all of the information and footnotes required by United States generally accepted accounting principles for complete financial statements. (i)        The table below outlines the calculation of Rent expense and reconciles Rent expense to Total lease cost, per ASC 842, the most directly comparable GAAP financial measure, for the year ended December 31, 2019 (in thousands):(1)  Represents O’Reilly’s U.S. operations only.(2)  Calculated as cost of goods sold for the last 12 months divided by average inventory. Average inventory is calculated as the average of inventory for the trailing four quarters used in determining the denominator.(3)  Calculated as inventory divided by store count at the end of the reported period.(4)  Calculated as accounts payable divided by inventory.(5)  O’Reilly acquired 33 Bennett Auto Supply, Inc. (“Bennett”) stores after the close of business on December 31, 2018, which were not included in the December 31, 2018, store count, as they were not operated by the Company for any portion of 2018. During the first quarter ended March 31, 2019, O’Reilly merged eight of the acquired Bennett stores into existing O’Reilly locations, and during the second quarter ended June 30, 2019, O’Reilly merged an additional five acquired Bennett stores into existing O’Reilly locations.(6)  O’Reilly acquired Mayoreo de Autopartes y Aceites, S.A. de C.V. (“Mayasa”), headquartered in Guadalajara, Jalisco, Mexico, after the close of business on November 29, 2019.(7)   Calculated as sales less jobber sales, divided by weighted-average square footage. Weighted-average square footage is determined by weighting store square footage based on the approximate dates of store openings, acquisitions, expansions or closures.(8)  Calculated as sales less jobber sales, divided by weighted-average stores. Weighted-average stores is determined by weighting stores based on their approximate dates of openings, acquisitions or closures."
    },
    {
        "title": "O’Reilly Automotive, Inc. Announces Dates for Its Fourth Quarter and Full-Year 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Jan 2, 2020 4:30PM EST",
        "content": "SPRINGFIELD, Mo., Jan.  02, 2020  (GLOBE NEWSWIRE) -- O’Reilly Automotive, Inc. (the “Company” or “O’Reilly”) (Nasdaq: ORLY), a leading retailer in the automotive aftermarket industry, announces the release date for its fourth quarter and full-year 2019 results as Wednesday, February 5, 2020, with a conference call to follow on Thursday, February 6, 2020.The Company’s fourth quarter and full-year 2019 results will be released after 3:30 p.m. Central Time on Wednesday, February 5, 2020, and can be viewed, at that time, on the Company’s website at www.OReillyAuto.com by clicking on “Investor Relations” and then “News Room.”Investors are invited to listen to the Company’s conference call discussing the financial results for the fourth quarter and full year of 2020, on Thursday, February 6, 2020, at 10:00 a.m. Central Time, via webcast on the Company’s website at www.OReillyAuto.com by clicking on “Investor Relations” and then “News Room.”  Interested analysts are invited to join the call.  The dial-in number for the call is (847) 619-6396 and the conference call identification number is 49267105.  A replay of the conference call will be available on the Company’s website through February 5, 2021.About O’Reilly Automotive, Inc.O’Reilly Automotive, Inc. was founded in 1957 by the O’Reilly family and is one of the largest specialty retailers of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States, serving both the do-it-yourself and professional service provider markets.  Visit the Company’s website at www.OReillyAuto.com for additional information about O’Reilly, including access to online shopping and current promotions, store locations, hours and services, employment opportunities and other programs.  As of September 30, 2019, the Company operated 5,420 stores in 47 states."
    },
    {
        "title": "O’Reilly Automotive, Inc. Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 23, 2019 4:30PM EDT",
        "content": "SPRINGFIELD, Mo., Oct.  23, 2019  (GLOBE NEWSWIRE) -- O’Reilly Automotive, Inc. (the “Company” or “O’Reilly”) (Nasdaq: ORLY), a leading retailer in the automotive aftermarket industry, today announced record revenues and earnings for its third quarter ended September 30, 2019.3rd Quarter Financial ResultsGreg Johnson, O’Reilly’s CEO and Co-President, commented, “We are pleased to report strong results for the third quarter, highlighted by comparable store sales growth of 5.0%, which was at the high end of our guidance and on top of our solid 3.9% comparable store sales growth in the prior year. Our Team is committed to driving profitable growth, and we are pleased with our ability to deliver strong sales growth in the quarter, while also expanding our gross margin by 35 basis points. We capitalized on the top-line results, as our team diligently controlled expenses to leverage SG&A by 22 basis points over last year, resulting in a total increase in operating profit dollars of 11%. Our third quarter performance and ongoing success is the direct result of our Team Members’ continued hard work and dedication, and I would like to thank each of them for their relentless commitment to providing the highest levels of service in the industry.”Sales for the third quarter ended September 30, 2019, increased $184 million, or 7%, to $2.67 billion from $2.48 billion for the same period one year ago. Gross profit for the third quarter increased 8% to $1.42 billion (or 53.3% of sales) from $1.32 billion (or 53.0% of sales) for the same period one year ago. Selling, general and administrative expenses (“SG&A”) for the third quarter increased 7% to $886 million (or 33.2% of sales) from $831 million (or 33.5% of sales) for the same period one year ago. Operating income for the third quarter increased 11% to $536 million (or 20.1% of sales) from $485 million (or 19.5% of sales) for the same period one year ago.Net income for the third quarter ended September 30, 2019, increased $25 million to $391 million (or 14.7% of sales) from $366 million (or 14.7% of sales) for the same period one year ago. Diluted earnings per common share for the third quarter increased 13% to $5.08 on 77 million shares versus $4.50 on 81 million shares for the same period one year ago.Year-to-Date Financial ResultsMr. Johnson continued, “Through the first nine months of 2019, our free cash flow results were stronger than planned, primarily driven by the amount and timing of our quarterly estimated tax payments. We continue to invest in renewable energy projects that generate investment tax credits and the timing of these investments can create unevenness in our cash flows, however, we expect this timing to normalize during the fourth quarter, and for the full-year, we continue to expect free cash flow to finish in the range of $1.0 billion to $1.1 billion.”Sales for the first nine months of 2019 increased $446 million, or 6%, to $7.67 billion from $7.22 billion for the same period one year ago. Gross profit for the first nine months of 2019 increased 7% to $4.07 billion (or 53.1% of sales) from $3.81 billion (or 52.7% of sales) for the same period one year ago. SG&A for the first nine months of 2019 increased 7% to $2.59 billion (or 33.8% of sales) from $2.42 billion (or 33.5% of sales) for the same period one year ago. Operating income for the first nine months of 2019 increased 7% to $1.48 billion (or 19.3% of sales) from $1.39 billion (or 19.2% of sales) for the same period one year ago.Net income for the first nine months of 2019 increased $42 million, or 4%, to $1.07 billion (or 13.9% of sales) from $1.02 billion (or 14.2% of sales) for the same period one year ago. Diluted earnings per common share for the first nine months of 2019 increased 10% to $13.63 on 78 million shares versus $12.36 on 83 million shares for the same period one year ago.Mr. Johnson concluded, “As we discussed in our second quarter earnings release, year-to-date store openings through June 30 fell short of our plan, due to weather related construction delays. We made significant progress with store openings during the third quarter to close that timing gap, and remain on track to open 200 net, new stores by the end of 2019. We continue to view organic store growth to be a strong opportunity to invest capital at robust rates of return and plan to continue to execute our expansion strategy during 2020 with the addition of approximately 180 net, new stores. This target is slightly below our 2019 store opening pace as our Teams will be heavily involved with completing the acquisition of Mayasa Auto Parts, which we announced in August. We are very excited to close on this acquisition in the fourth quarter and begin the process of partnering with the experienced Mayasa leadership team to capitalize on the long-term profitable growth opportunities that exist in the Mexican market.”3rd Quarter Comparable Store Sales ResultsComparable store sales are calculated based on the change in sales for stores open at least one year and exclude sales of specialty machinery, sales to independent parts stores and sales to Team Members. Online sales, resulting from ship-to-home orders and pick-up-in-store orders, for stores open at least one year, are included in the comparable store sales calculation. Comparable store sales increased 5.0% for the third quarter ended September 30, 2019, on top of 3.9% for the same period one year ago. Comparable store sales increased 3.9% for the nine months ended September 30, 2019, on top of 4.0% for the same period one year ago.Share Repurchase ProgramDuring the third quarter ended September 30, 2019, the Company repurchased 1.0 million shares of its common stock, at an average price per share of $377.85, for a total investment of $387 million. During the first nine months ended September 30, 2019, the Company repurchased 3.6 million shares of its common stock, at an average price per share of $364.84, for a total investment of $1.31 billion. Subsequent to the end of the third quarter and through the date of this release, the Company repurchased an additional 0.1 million shares of its common stock, at an average price per share of $393.33, for a total investment of $32 million. The Company has repurchased a total of 76.0 million shares of its common stock under its share repurchase program since the inception of the program in January of 2011 and through the date of this release, at an average price of $159.11, for a total aggregate investment of $12.09 billion. As of the date of this release, the Company had approximately $662 million remaining under its current share repurchase authorization.Non-GAAP InformationThis release contains certain financial information not derived in accordance with United States generally accepted accounting principles (“GAAP”). These items include adjusted debt to earnings before interest, taxes, depreciation, amortization, share-based compensation and rent (“EBITDAR”) and free cash flow. The Company does not, nor does it suggest investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, GAAP financial information. The Company believes that the presentation of adjusted debt to EBITDAR and free cash flow provide meaningful supplemental information to both management and investors that is indicative of the Company’s core operations. The Company has included a reconciliation of this additional information to the most comparable GAAP measure in the table above and the selected financial information below.Earnings Conference Call InformationThe Company will host a conference call on Thursday, October 24, 2019, at 10:00 a.m. Central Time to discuss its results as well as future expectations. Investors may listen to the conference call live on the Company’s website at www.OReillyAuto.com by clicking on “Investor Relations” and then “News Room.” Interested analysts are invited to join the call. The dial-in number for the call is (847) 619-6396 and the conference call identification number is 49053015. A replay of the conference call will be available on the Company’s website through Friday, October 23, 2020.About O’Reilly Automotive, Inc.O’Reilly Automotive, Inc. was founded in 1957 by the O’Reilly family and is one of the largest specialty retailers of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States, serving both the do-it-yourself and professional service provider markets. Visit the Company’s website at www.OReillyAuto.com for additional information about O’Reilly, including access to online shopping and current promotions, store locations, hours and services, employment opportunities and other programs. As of September 30, 2019, the Company operated 5,420 stores in 47 states.Forward-Looking StatementsThe Company claims the protection of the safe-harbor for forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by forward-looking words such as “estimate,” “may,” “could,” “will,” “believe,” “expect,” “would,” “consider,” “should,” “anticipate,” “project,” “plan,” “intend” or similar words. In addition, statements contained within this press release that are not historical facts are forward-looking statements, such as statements discussing, among other things, expected growth, store development, integration and expansion strategy, business strategies, future revenues and future performance. These forward-looking statements are based on estimates, projections, beliefs and assumptions and are not guarantees of future events and results. Such statements are subject to risks, uncertainties and assumptions, including, but not limited to, the economy in general, inflation, tariffs, product demand, the market for auto parts, competition, weather, risks associated with the performance of acquired businesses, our ability to hire and retain qualified employees, consumer debt levels, our increased debt levels, credit ratings on public debt, governmental regulations, information security and cyber-attacks, terrorist activities, war, the threat of war, and the ability to successfully complete the acquisition of Mayasa Auto Parts on a timely basis. Actual results may materially differ from anticipated results described or implied in these forward-looking statements. Please refer to the “Risk Factors” section of the annual report on Form 10-K for the year ended December 31, 2018, and subsequent Securities and Exchange Commission filings for additional factors that could materially affect the Company’s financial performance. Forward-looking statements speak only as of the date they were made and the Company undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law."
    },
    {
        "title": "O’Reilly Automotive, Inc. Announces Dates for Its Third Quarter 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Oct 1, 2019 4:30PM EDT",
        "content": "SPRINGFIELD, Mo., Oct.  01, 2019  (GLOBE NEWSWIRE) -- O’Reilly Automotive, Inc. (the “Company” or “O’Reilly”) (Nasdaq: ORLY), a leading retailer in the automotive aftermarket industry, announces the release date for its third quarter 2019 results as Wednesday, October 23, 2019, with a conference call to follow on Thursday, October 24, 2019.The Company’s third quarter 2019 results will be released after 3:30 p.m. Central Time on Wednesday, October 23, 2019, and can be viewed, at that time, on the Company’s website at www.OReillyAuto.com by clicking on “Investor Relations” and then “News Room.”Investors are invited to listen to the Company’s conference call discussing the financial results for the third quarter of 2019, on Thursday, October 24, 2019, at 10:00 a.m. Central Time, via webcast on the Company’s website at www.OReillyAuto.com by clicking on “Investor Relations” and then “News Room.”  Interested analysts are invited to join the call.  The dial-in number for the call is (847) 619-6396 and the conference call identification number is 49053015.  A replay of the conference call will be available on the Company’s website through October 23, 2020.About O’Reilly Automotive, Inc.O’Reilly Automotive, Inc. was founded in 1957 by the O’Reilly family and is one of the largest specialty retailers of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States, serving both the do-it-yourself and professional service provider markets.  Visit the Company’s website at www.OReillyAuto.com for additional information about O’Reilly, including access to online shopping and current promotions, store locations, hours and services, employment opportunities and other programs.  As of June 30, 2019, the Company operated 5,344 stores in 47 states. "
    }
]