[
    {
        "title": "Small Business Hiring Growth Improves for Third Consecutive Month",
        "subtitle": "",
        "date": "Mar 3, 2020 8:30AM EST",
        "content": "ROCHESTER, N.Y., March 3, 2020 /PRNewswire/ -- The latest Paychex | IHS Markit Small Business Employment Watch shows an upturn in the pace of small business job growth for the third straight month, a trend last seen in early 2017. Though down 0.61 percent from last year, employment growth increased 0.15 percent from the previous month, and 0.22 percent in the past quarter, to 98.32. Hourly earnings growth dipped to 2.74 percent in February. Weekly hours worked also fell for the second consecutive month but remain up 0.41 percent from a year ago. \n                        \n                    \n                Note: Findings are reflective of data through Wednesday, February 19, the cutoff date for the monthly Small Business Employment Watch.\"The national jobs index has turned upward as three monthly increases have recovered the ground lost since June of last year. Wage growth, however, peaked late in 2019 and has begun to decelerate in 2020,\" said James Diffley, chief regional economist at IHS Markit. \"The past three months mark the longest string of job growth increases in nearly three years, indicating a positive start for small business hiring in 2020,\" said Martin Mucci, Paychex president and CEO. \"However, these results have yet to reflect any impact from cases of the COVID-19 (coronavirus), which are expected to increase in the coming months.\"Broken down further, the February report shows: The complete results for February, including interactive charts detailing all data at a national, regional, state, metro, and industry level, are available at www.paychex.com/employment-watch. Highlights are available below.                                                          National Jobs IndexNational Wage Report Regional Jobs Index Note: Percentages displayed in the regional heat map reflect 12-month changes.Regional Wage Report  Note: Percentages displayed in the regional heat map reflect 12-month changes.State Jobs Index Note: Analysis is provided for the 20 largest states based on U.S. population.State Wage Report Note: Analysis is provided for the 20 largest states based on U.S. population. Metropolitan Jobs Index  Note: Analysis is provided for the 20 largest metro areas based on U.S. population. Metropolitan Wage Report Note: Analysis is provided for the 20 largest metro areas based on U.S. population.Industry Jobs Index Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. Industry Wage Report  Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. For more information about the Paychex | IHS Markit Small Business Employment Watch, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts.*Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website. About the Paychex | IHS Markit Small Business Employment WatchThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.About IHS Markit (www.ihsmarkit.com)IHS Markit (NYSE: INFO) is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world's leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.IHS Markit is a registered trademark of IHS Markit Ltd. and/or its affiliates. All other company and product names may be trademarks of their respective owners © 2020 IHS Markit Ltd. All rights reserved. Media ContactsLisa FlemingPaychex, Inc. +1 585-387-6402lfleming@paychex.com @PaychexNews Kate SmithIHS Markit+1 781-301-9311katherine.smith@ihsmarkit.com  Tess Flynn Mower +1 716-880-1488tflynn@mower.com \n                        \n                    \n                \n                        \n                    \n                \n                        \n                    \n                 View original content to download multimedia:http://www.prnewswire.com/news-releases/small-business-hiring-growth-improves-for-third-consecutive-month-301015203.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Flex® Assistant Wins Stevie Award® for Customer Service Excellence",
        "subtitle": "",
        "date": "Mar 2, 2020 10:03AM EST",
        "content": "ROCHESTER, N.Y., March 2, 2020 /PRNewswire/ -- For the fourth consecutive year, Paychex, Inc., a leading provider of human resources, payroll, benefits, and insurance solutions, has won a Stevie Award® for Excellence in Customer Service. This year, a panel of judges selected Paychex Flex® Assistant, the company's customer service chatbot, as a bronze winner for Best Use of Technology in Customer Service. \n                        \n                    \n                Presented annually, this year's Stevie Awards competition yielded more than 2,600 nominations from organizations in 48 nations of all sizes and industries. Winners were evaluated and determined by the average scores of more than 180 professionals worldwide on seven specialized judging committees.\"Stevie Award winners from around the world should be very proud of their achievements,\" said Michael Gallagher, Stevie Awards executive chairman. \"The judges were impressed with the vast range of nominations submitted for 2020 and have agreed that their accomplishments are worthy of public recognition.\" Embedded in its Paychex Flex® application and always accessible, Paychex Flex Assistant debuted in December 2018. Flex Assistant is an NLP-powered (natural language processing) chatbot that is intuitive and familiar to users who are accustomed to Google searching for answers to any given question. The bot answers 200+ questions that cover the breadth and depth of the Paychex HCM suite. Where the bot differentiates from many on the market is that if the user requires additional information or would like a live person, they are seamlessly connected to a specialist in real-time – 24 hours a day, seven days a week, 365 days a year – to get the answer they need. In addition, with customer experience as the top priority, all bot transactions are visible to the live Paychex service specialist, eliminating the need for users to repeat their reason for chatting and avoiding a frustrating user experience. \"With a focus on creating, delivering, and enhancing valuable client-facing services that promote efficiency and self-service for our 670,000+ customers, Paychex has undergone a significant digital transformation over the last decade,\" said Mike Gioja, Paychex SVP of IT and product development. \"Our Paychex Flex Assistant is a strong example of that shift and would not have been possible without a tight and ongoing partnership between the IT and Paychex service teams. Our goal of any chatbot session is that it ends with a successful result and a satisfied customer – through the bot, live agent chat, or phone call – 24/7/365.\"Chatbots can be a powerful customer service tool that empowers customers, aids in discovery, and helps resolve common questions,\" added Gioja. \"However, they should augment the customer experience, not eliminate the human element. Paychex Flex Assistant brings users the perfect blend of customer service how they want it and a real-time human connection when they need it.\"Over the first two quarters of FY20, the Paychex Flex Assistant chatbot is successfully closing conversations more than 50 percent of the time.Details about the Stevie Awards for Sales & Customer Service, as well as the full list of Stevie winners in all categories are available at stevieawards.com.About PaychexPaychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.About The Stevie Awards Stevie Awards are conferred in eight programs: the Asia-Pacific Stevie Awards, the German Stevie Awards, the Middle East Stevie Awards, The American Business Awards®, The International Business Awards®, the Stevie Awards for Great Employers, the Stevie Awards for Women in Business, and the Stevie Awards for Sales & Customer Service. Stevie Awards competitions receive more than 12,000 entries each year from organizations in more than 70 nations. Honoring organizations of all types and sizes and the people behind them, the Stevies recognize outstanding performances in the workplace worldwide. Learn more about the Stevie Awards at http://www.StevieAwards.com.Media Contact Tracy Volkmann Public Relations Program ManagerPaychex, Inc.(585) 387-6705Email @PaychexNews View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-flex-assistant-wins-stevie-award-for-customer-service-excellence-301014452.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "SurePayroll Takes Home Stevie® Award Gold",
        "subtitle": "",
        "date": "Mar 2, 2020 9:00AM EST",
        "content": "GLENVIEW, Ill., March 2, 2020 /PRNewswire/ -- SurePayroll, a leading provider of payroll services to America's small businesses, was awarded Gold in the e-Commerce Customer Service Award category and Bronze for Contact Center of the Year at the 14th annual Stevie® Awards for Sales and Customer Service held in Las Vegas, Nevada. The honors reflect SurePayroll's 20-year legacy of combining the best of customer-powered technology and service.\n                        \n                    \n                As consumer expectations have evolved to keep pace with everyday technologies, it's clear there's no longer a one-size-fits-all solution for small business owners. As the first online payroll service developed for small businesses, SurePayroll is relentlessly focused on its vision to deliver small businesses the most effortless experience in the world. Over the last year a key focus has been on delivering new channels and service strategies that allow each user to find their appropriate experience, whether that be almost entirely self-service and online-only or higher-touch. \"In recent years we have challenged ourselves organizationally to shift our focus from customer-centered to customer-powered,\" said John Cumbee, General Manager at SurePayroll. \"Part of that shift is using our customer (behavioral and demographic) data and insights to move the needle when it comes to customer experience, specifically replacing the concept of a one-size-fits-all 'ideal customer experience' with delivering the appropriate individual user experience at scale.\"In October 2018, SurePayroll bolstered its focus on providing outstanding customer service by creating a Service Systems and Projects Analysis team to drive more proactive use of data and analytics in defining, understanding, and prioritizing customer needs. The team translates these insights into product and service opportunities that deliver the most value back to the customer and support business strategy. \"As the first online payroll provider for small businesses, we've always played at the intersection of technology and customer service,\" said Jamal Ayyad, Vice President of Service at SurePayroll. \"It's really rewarding to see our investments in data, analytics, and automation to optimize both technology and live service recognized by the Stevies. It validates our perspective that 'if you have to call, we've already failed' and our commitment to constantly evolving to meet customer needs and expectations.\"For more information about SurePayroll, please visit www.surepayroll.com About SurePayroll SurePayroll is the trusted provider of easy online payroll services to small businesses nationwide. Whether a business has 1, 10, or 100 employees, SurePayroll delivers peace of mind by combining innovative, industry-leading technology and personalized support from an award-winning, U.S.-based customer care team. SurePayroll also provides private-label and co-branded services for accountants and banking partners as well as offering efficient online solutions for managing 401(k) plans, health insurance, workers' compensation, employee screening and more. SurePayroll is a wholly owned subsidiary of Paychex. For more information, please visit www.SurePayroll.com. About Paychex Paychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.About The Stevie AwardsStevie Awards are conferred in eight programs: the Asia-Pacific Stevie Awards, the German Stevie Awards, the Middle East Stevie Awards, The American Business Awards®, The International Business Awards®, the Stevie Awards for Great Employers, the Stevie Awards for Women in Business, and the Stevie Awards for Sales & Customer Service. Stevie Awards competitions receive more than 12,000 nominations each year from organizations in more than 70 nations. Honoring organizations of all types and sizes and the people behind them, the Stevies recognize outstanding performances in the workplace worldwide. Learn more about the Stevie Awards at www.StevieAwards.com.Victoria Lewis victoria.lewis@walkersands.com312-964-9124  View original content to download multimedia:http://www.prnewswire.com/news-releases/surepayroll-takes-home-stevie-award-gold-301014044.htmlSOURCE  SurePayroll"
    },
    {
        "title": "Paychex Named One of the World's Most Ethical Companies by Ethisphere for the 12th Time",
        "subtitle": "",
        "date": "Feb 26, 2020 10:59AM EST",
        "content": "ROCHESTER, N.Y., Feb. 26, 2020 /PRNewswire/ -- Paychex, Inc. has been recognized by Ethisphere, a global leader in defining and advancing the standards of ethical business practices, as one of the 2020 World's Most Ethical Companies. Paychex has achieved this recognition 12 times, and consecutively since 2012.As a leading provider of human resource, payroll, retirement, and benefit services in the United States, and with a growing presence in Europe, Paychex was founded on principles of integrity nearly 50 years ago. Today, the values-based company continues its work to advance good corporate citizenship, with a focus on four pillars of social responsibility: employees, community, ethics, and environment.\"We've always led with integrity, which is a critical component of our culture and our business model. And today it's as important as ever for companies to provide great value to their clients and shareholders while investing in their employees, communities, and the environment,\" said Paychex president and CEO Martin Mucci. \"We're proud of our focused efforts in these areas, which we feel makes us a better employer, a better investment, and a better partner for our clients.\"Chief ethics officer Stephanie Schaeffer says Paychex has embarked on several initiatives over the past year that are aimed at strengthening its position as a leader in corporate responsibility. \"From establishing a formal cross-functional steering committee, to enhancing our diversity and inclusion initiatives, to a project to map our carbon footprint and greenhouse gas emissions, we're taking action on issues that matter.\"\"Congratulations to everyone at Paychex for earning this recognition,\" said Ethisphere's chief executive officer, Timothy Erblich. \"This is a moment to acknowledge the leaders working to advance corporate cultures defined by integrity and affirm those companies contributing to broader societal imperatives and the greater good.\"Methodology & ScoringGrounded in Ethisphere's proprietary Ethics Quotient®, the World's Most Ethical Companies assessment process includes more than 200 questions on culture, environmental and social practices, ethics and compliance activities, governance, diversity, and initiatives to support a strong value chain. The process serves as an operating framework to capture and codify the leading practices of organizations across industries and around the globe. Best practices and insights from the 2020 honorees will be released in a report and webcast in March and April of this year.All companies that participate in the assessment process receive an Analytical Scorecard providing them a holistic assessment of where their programs stand against the demanding standards of leading companies.Honorees The full list of the 2020 World's Most Ethical Companies can be found at https://worldsmostethicalcompanies.com/honorees.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves over 670,000 payroll clients as of May 31, 2019, across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.About the Ethisphere InstituteThe Ethisphere® Institute is the global leader in defining and advancing the standards of ethical business practices that fuel corporate character, marketplace trust and business success. Ethisphere has deep expertise in measuring and defining core ethics standards using data-driven insights that help companies enhance corporate character and measure and improve culture. Ethisphere honors superior achievement through its World's Most Ethical Companies recognition program and provides a community of industry experts with the Business Ethics Leadership Alliance (BELA). More information about Ethisphere can be found at: https://ethisphere.com.Media ContactsPaychex: Becky CaniaPaychex, Inc. 585-387-6337bcania@paychex.com @PaychexNews Ethisphere:Clea Nabozny480-397-2658clea.nabozny@ethisphere.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-named-one-of-the-worlds-most-ethical-companies-by-ethisphere-for-the-12th-time-301011792.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Weekly Earnings Growth Continues to Increase as Jobs Growth Holds Steady",
        "subtitle": "",
        "date": "Feb 4, 2020 8:30AM EST",
        "content": "ROCHESTER, N.Y., Feb. 4, 2020 /PRNewswire/ -- The latest Paychex | IHS Markit Small Business Employment Watch reflects a continuation of the tight labor market to start 2020. Weekly earnings growth improved for the 13th consecutive month, reaching 3.59 percent in January. Weekly hours worked were up 0.83 percent from last year, contributing to the growth in weekly earnings. The pace of small business employment growth remains consistent, with the national jobs index increasing slightly (0.01 percent) in January to 98.18.\"The national index has been flat since mid-year 2019, signaling a continued tight labor market for small businesses,\" said James Diffley, chief regional economist at IHS Markit. \"With election season heating up and the economy top of mind for business owners, this month's Small Business Employment Watch demonstrates the continuing stability of jobs growth recently, as well as weekly earnings improvement,\" said Martin Mucci, Paychex president and CEO. \"The data shows consistent employment growth and yet another month of encouraging wage growth, two key indicators that the economy is off to a solid start in 2020.\"Broken down further, the January report showed: The complete results for January, including interactive charts detailing all data at a national, regional, state, metro, and industry level, are available at www.paychex.com/employment-watch. Highlights are available below.National Jobs IndexNational Wage Report Regional Jobs Index Regional Wage Report  State Jobs Index Note: Analysis is provided for the 20 largest states based on U.S. population. State Wage Report Note: Analysis is provided for the 20 largest states based on U.S. population. Metropolitan Jobs Index  Note: Analysis is provided for the 20 largest metro areas based on U.S. population. Metropolitan Wage Report  Note: Analysis is provided for the 20 largest metro areas based on U.S. population.Industry Jobs Index Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses.Industry Wage Report  Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. For more information about the Paychex | IHS Markit Small Business Employment Watch, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts.*Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website. About the Paychex | IHS Markit Small Business Employment WatchThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.About IHS Markit (www.ihsmarkit.com)IHS Markit (NYSE: INFO) is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world's leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.IHS Markit is a registered trademark of IHS Markit Ltd. and/or its affiliates. All other company and product names may be trademarks of their respective owners © 2020 IHS Markit Ltd. All rights reserved. Media ContactsLisa FlemingPaychex, Inc. +1 585-387-6402lfleming@paychex.com @PaychexNews Kate SmithIHS Markit+1 781-301-9311katherine.smith@ihsmarkit.com  Tess Flynn Mower +1 716-880-1488tflynn@mower.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/weekly-earnings-growth-continues-to-increase-as-jobs-growth-holds-steady-300998302.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Survey Reveals Most Important Issues for Business Owners This Election Year",
        "subtitle": "",
        "date": "Feb 3, 2020 9:02AM EST",
        "content": "ROCHESTER, N.Y., Feb. 3, 2020 /PRNewswire/ -- Paychex, Inc., a leading provider of human resources, payroll, benefits, and insurance solutions, surveyed 500 business owners with 500 employees or less to better understand what issues are most important to their organizations as they prepare to go to the polls in November. While most business owners surveyed (72 percent) are experiencing growth, having increased their profits since 2018, the economy remains top of mind as Election Day approaches. In order of importance, the top issues for business owners are:\"Every business is unique, but the issues that keep business owners up at night are often universal,\" said Martin Mucci, Paychex president and CEO. \"The economy, taxes, and healthcare have historically been significant areas of focus for legislators and business owners alike and will clearly remain a priority during this election cycle. \"As November approaches, Paychex will continue to remain on top of these issues and how they may affect our 670,000 customers, helping them navigate the impacts they may have now or in the future,\" Mucci added. The most important issue among respondents varies depending on age. Business owners ages 39-54 and 55+ both ranked the economy as their top \"very important\" issue at 77 percent and 63 percent, respectfully. However, business owners ages 18-38 prioritized healthcare with 49 percent saying it's \"very important,\" followed closely by the economy at 46 percent. Ranking fourth overall on the list of issues, tariffs/trade policies are on the minds of many business owners, with 67 percent saying this matter is at least \"somewhat important.\" Businesses in the manufacturing sector, however, placed a higher level of importance on this issue with 80 percent saying it's at least \"somewhat important\" to them heading into the election season. The same can be said for businesses in the Midwest (78 percent).The current survey results align with the issues prioritized by business owners ahead of the 2016 election, as well. Four years ago, the most important issues to this group of voters were also the economy, taxes, and healthcare.For educational resources that can help businesses stay abreast of regulatory issues throughout the 2020 election season, visit paychex.com/WORX. About the Paychex Business SurveyPaychex polled 500 randomly selected business owners with fewer than 500 employees. The survey was fielded and administered online by Bredin, a third-party research firm, between November 11, 2019 and November 27, 2019. Results yielded a +/- 4% margin of error.Disclaimer: The data cited in this news release represents the opinions of the survey respondents and not those of Paychex or its employees.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves over 670,000 payroll clients as of May 31, 2019, across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.Media ContactsLisa FlemingPaychex, Inc. 585-387-6402lfleming@paychex.com  @PaychexNews Colleen BennisMower 585-389-1865cbennis@mower.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-survey-reveals-most-important-issues-for-business-owners-this-election-year-300997623.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Wins 2020 BIG Innovation Award for Retirement Services Participant Portal",
        "subtitle": "",
        "date": "Jan 27, 2020 10:53AM EST",
        "content": "ROCHESTER, N.Y., Jan. 27, 2020 /PRNewswire/ -- Paychex, Inc., one of the nation's leading providers in 401(k) recordkeeping services, announced today that its enhanced Retirement Services Participant Portal was recognized as a winner in the 2020 BIG Innovation Awards presented by the Business Intelligence Group.The participant portal is designed to simplify the complex process of enrolling in and managing a 401(k) plan. With a focus on intuitive design, participants can immediately enroll in a plan from any device – phone, tablet, or desktop – in as few as four clicks and can make the most of their retirement savings potential though a series of enhanced features. \"We're incredibly proud to be recognized by the Business Intelligence Group for our work in helping to alleviate one of the biggest barriers to establishing and administering a 401(k) plan: complexity,\" said Paul Davidson, director of product management at Paychex. \"The retirement crisis has long impacted American employers and employees, but with the recent passage of the SECURE Act – the most significant retirement savings legislation in the past 15 years – coupled with our easy-to-use technology, there has never been a better time to begin the process of confidently preparing for retirement.\"For participants, the new dashboard experience expands retirement plan access, understanding, and investment management through a series of new features, including:   \"Innovation has become a major theme for organizations across virtually all industries, and this year's winners are a testament to the creativity, passion and perseverance of individuals worldwide,\" said Maria Jimenez, chief operating officer of the Business Intelligence Group. \"We are thrilled to be honoring Paychex as they are leading by example and making real progress on improving the daily lives of so many.\"Organizations from across the globe submitted their recent innovations for consideration in the BIG Innovation Awards. Nominations were then judged by a select group of business leaders and executives who volunteer their time and expertise to score submissions.To learn more about Paychex Retirement Services, visit www.paychex.com/retirement-services. For a complete list of the 2020 BIG Innovation Award winners, visit www.bintelligence.com/big-innovation-awards. About Paychex Retirement ServicesPaychex, Inc. is a leading provider of integrated HR technology solutions, including a full suite of retirement services designed to meet the needs of businesses of all sizes. In addition to extensive options for plan sponsors, Paychex Retirement Services also works with financial advisors to help grow retirement plan business through a dedicated team of wholesalers, sales representatives, and advisor support experts.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves over 670,000 payroll clients as of May 31, 2019, across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.About Business Intelligence Group The Business Intelligence Group was founded with the mission of recognizing true talent and superior performance in the business world. Unlike other industry award programs, these programs are judged by business executives having experience and knowledge. The organization's proprietary and unique scoring system selectively measures performance across multiple business domains and then rewards those companies whose achievements stand above those of their peers.Media Contacts Lisa Fleming Paychex, Inc. 585-387-6402 lfleming@paychex.com  @PaychexNewsColleen Bennis Mower 585-389-1865 cbennis@mower.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-wins-2020-big-innovation-award-for-retirement-services-participant-portal-300993619.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Among FORTUNE Magazine's 2020 Most Admired Companies",
        "subtitle": "",
        "date": "Jan 21, 2020 9:25AM EST",
        "content": "ROCHESTER, N.Y., Jan. 21, 2020 /PRNewswire/ -- Paychex, a leading provider of HR, payroll, benefits, and insurance solutions, today was named to FORTUNE® magazine's 2020 list of the World's Most Admired Companies. The annual list is considered a definitive report card on corporate reputation, honoring companies globally for their outstanding financial performance and leadership in key areas of importance in today's business environment.  \"It is a tremendous honor for Paychex to be recognized as one of the World's Most Admired Companies,\" said Martin Mucci, Paychex president and CEO. \"Our focus is on developing and delivering innovative new products and services for our clients, built on our foundation of technology-enabled service. And, we do this thanks to our nearly 16,000 dedicated employees whose commitment to integrity and excellence generates the results that benefit our clients, shareholders, and our employees. Our reputation is the cornerstone of what we do and who we are at Paychex. To be included on this list is a tribute to what our team does every day.\"To develop its Most Admired Companies list, FORTUNE ranks companies based on nine criteria, including innovation, investment value, quality of management, ability to attract talent, and social responsibility.  FORTUNE partners with Korn Ferry to determine the most highly regarded companies in 52 industries. Executives, directors, and analysts are asked to rate companies within their industry based on the criteria. In order to earn recognition as one of the most admired, a company's score must be within the top half of its industry. Paychex was recognized for its leadership in the financial data services category.To read more about the 2020 FORTUNE Most Admired Companies list, click here: https://fortune.com/worlds-most-admired-companies/.To see a list of all recent awards and honors Paychex has received, click here: https://www.paychex.com/newsroom/awards.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.Media ContactLaura Saxby Lynch Director, Corporate Communications Paychex, Inc. (585) 383-3074 lsaxbylynch@paychex.com   @PaychexNews  View original content:http://www.prnewswire.com/news-releases/paychex-among-fortune-magazines-2020-most-admired-companies-300990324.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Jan 17, 2020 8:56AM EST",
        "content": "    ROCHESTER, N.Y.--(BUSINESS WIRE)--\nToday the Board of Directors of Paychex, Inc. (NASDAQ‑PAYX) declared a regular quarterly dividend of $.62 per share payable February 20, 2020 to shareholders of record February 3, 2020.\n\nAbout Paychex\n\nPaychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.\n\nPaychex, Inc.’s news releases, current financial information, Securities and Exchange Commission filings, and investor presentations are accessible at our Investor Relations page.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200117005278/en/\nInvestor Relations:\nEfrain Rivera, CFO\nor\nTerri Allen\n585-383-3406\n\nMedia Inquiries:\nLaura Saxby Lynch\n585-383-3074\nSource: Paychex, Inc."
    },
    {
        "title": "Weekly Earnings Growth Ends the Year at All-Time High",
        "subtitle": "The Paychex ",
        "date": "Dec 31, 2019 8:30AM EST",
        "content": " ROCHESTER, N.Y., Dec. 31, 2019 /PRNewswire/ -- The competitive job market continues to drive wage growth higher, according to the latest Paychex | IHS Markit Small Business Employment Watch. Steady growth in hourly earnings and hours worked – with hours worked in December posting the strongest gains since 2012 – pushed weekly earnings growth to 4.13 percent, a new all-time high for employees of small businesses. The pace of small business employment growth remains consistent, with the national jobs index increasing slightly (0.06 percent) in December to 98.16. \"Small business job gains have flattened in the second half of the year as labor markets prove very tight,\" said James Diffley, chief regional economist at IHS Markit. \"In response, weekly earnings have accelerated, surging from 2.49 percent mid-year to 4.13 percent at year-end.\" \"The new high seen in weekly earnings growth this month is certainly positive news for the employees of small businesses,\" said Martin Mucci, Paychex president and CEO. \"Not only are businesses raising wages, but they're also increasing hours for their current employees, a sure sign employers are responding to the pressures of the tight labor market.\"Broken down further, the December report showed: The complete results for December, including interactive charts detailing all data at a national, regional, state, metro, and industry level, are available at www.paychex.com/employment-watch. Highlights are available below.National Jobs IndexNational Wage Report Regional Jobs Index Regional Wage Report  State Jobs Index Note: Analysis is provided for the 20 largest states based on U.S. population. State Wage Report Note: Analysis is provided for the 20 largest states based on U.S. population. Metropolitan Jobs Index  Note: Analysis is provided for the 20 largest metro areas based on U.S. population. Metropolitan Wage Report Note: Analysis is provided for the 20 largest metro areas based on U.S. population.Industry Jobs Index Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. Industry Wage Report  Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. For more information about the Paychex | IHS Markit Small Business Employment Watch, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts.*Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website. About the Paychex | IHS Markit Small Business Employment WatchThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.About IHS Markit (www.ihsmarkit.com)IHS Markit (NYSE: INFO) is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world's leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.IHS Markit is a registered trademark of IHS Markit Ltd. and/or its affiliates. All other company and product names may be trademarks of their respective owners © 2019 IHS Markit Ltd. All rights reserved. Media ContactsLisa Fleming Paychex, Inc. +1 585-387-6402 lfleming@paychex.com  @PaychexNews Kate SmithIHS Markit+1 781-301-9311 katherine.smith@ihsmarkit.com  Tess Flynn  Mower  +1 716-880-1488 tflynn@mower.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/weekly-earnings-growth-ends-the-year-at-all-time-high-300980038.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex, Inc. Reports Second Quarter Results",
        "subtitle": "",
        "date": "Dec 18, 2019 8:30AM EST",
        "content": "\nSecond Quarter Fiscal 2020 Highlights\n\n(1) Adjusted net income, adjusted diluted earnings per share, and EBITDA are not United States (“U.S.”) generally accepted accounting principles (“GAAP”) measures.  Please refer to the “Non-GAAP Financial Measures” section on page 4 of this press release for a discussion of these non-GAAP measures and a reconciliation to the most comparable U.S. GAAP measures of net income and diluted earnings per share.\n    ROCHESTER, N.Y.--(BUSINESS WIRE)--\nPaychex, Inc. (“Paychex,” “we,” “our,” or “us”) (Nasdaq:PAYX) today announced total revenue of $990.7 million for the three months ended November 30, 2019 (the “second quarter”), an increase of 15% from $858.9 million for the same period last year. Oasis Outsourcing Group Holdings, L.P. (“Oasis”), acquired in December 2018, contributed approximately 9% to the growth in total revenue compared to the same period last year. Net income increased 10% to $258.7 million, and diluted earnings per share increased 11% to $0.72 per share for the second quarter. Adjusted net income and adjusted diluted earnings per share, both non-GAAP measures, each increased 8% to $253.8 million and $0.70 per share, respectively, for the second quarter.\n\nMartin Mucci, President and Chief Executive Officer, commented, “During the second quarter, we delivered solid growth across our major business lines. In particular, our human resource (“HR”) outsourcing services, time and attendance solutions, and retirement services performed well.”\n\nMucci added, “We are heavily focused on continued innovation to meet our customers’ and their employees' evolving needs, simplifying HR complexities and offering solutions to help them thrive and grow. We are investing in innovative technology in the areas of flexible payments, integrations, data analytics, and artificial intelligence, while still maintaining our commitment to personalized service. Our state-of-the-art technology and exceptional service distinguish us in the market as we deliver a more personalized and technology-enhanced experience for our clients and their employees.”\n\nManagement Solutions revenue was $726.7 million for the second quarter, a 6% increase compared to the same period last year. Oasis contributed slightly less than 1% to the growth in Management Solutions revenue compared to the same period last year. The remaining increase was primarily driven by increases in our client base and growth in revenue per client, which improved as a result of higher price realization and increased penetration of our suite of solutions, particularly time and attendance, retirement services, and HR outsourcing. Retirement services revenue also benefited from an increase in asset fee revenue earned on the asset value of participants’ funds.\n\nProfessional employer organization (“PEO”) and Insurance Services revenue was $244.1 million for the second quarter, an increase of 57% compared to the same period last year. Oasis contributed approximately 47% to the growth in PEO and Insurance Services revenue compared to the same period last year. In addition to the acquisition of Oasis, this increase was driven by growth in clients and client worksite employees across our PEO business. Insurance Services revenue benefited from an increase in the number of health and benefit clients and applicants, offset by the impact of softness in the workers’ compensation market as state insurance fund rates declined.\n\nInterest on funds held for clients increased 9% to $19.9 million for the second quarter, compared to the same period last year. The increase resulted from higher realized gains, average investment balances, and average interest rates. Funds held for clients average investment balances were impacted by wage inflation and increases within our client base, offset by changes in client base mix and timing of collections and remittances.\n\nAverage investment balances and interest rates are summarized below:\n\nTotal expenses increased 18% to $649.0 million for the second quarter compared to the same period last year. Increases in compensation-related costs, PEO direct insurance costs, and amortization of intangible assets contributed to total expense growth for the second quarter, primarily driven by the acquisition of Oasis.\n\nOperating income increased 11% to $341.7 million for the second quarter compared to the same period last year. Operating margin was 34.5% for the second quarter, compared to 35.8% for the same period last year. Operating margin for the second quarter was primarily impacted by the continued growth of our PEO business, including the acquisition of Oasis, and by increased investments in technology and certain business initiatives. EBITDA(1) increased 16% to $398.8 million for the second quarter and EBITDA margin(1) was 40% for the second quarter, consistent with the same period last year.\n\nOther expense, net for the second quarter of $4.7 million includes interest expense of $8.3 million related to our long-term borrowings.\n\nOur effective income tax rate was 23.2% for the second quarter compared to 23.8% for the same period last year. The effective income tax rates in both periods were impacted by the recognition of net discrete tax benefits related to employee stock-based compensation payments.\n\nYear-To-Date Fiscal 2020 Highlights\n\nThe highlights for the six months ended November 30, 2019 (the “six months”) are as follows:\n\nFinancial Position and Liquidity\n\nOur financial position as of November 30, 2019 remained strong with cash, restricted cash, and total corporate investments of $707.8 million. Total short-term and long-term borrowings, net of debt issuance costs were $847.9 million as of November 30, 2019. Our positive cash flows have historically allowed us to support our business and to pay substantial dividends (approximately 80% of net income) to our stockholders. We anticipate that cash, restricted cash, and total corporate investments as of November 30, 2019, along with projected operating cash flows and available short-term financing, will support our normal business operations, capital purchases, share repurchases, and dividend payments for the foreseeable future.\n\nCash flows from operations were $564.6 million for the six months, an increase of 14% from the same period last year. The increase in our operating cash flows was the result of higher net income and non-cash adjustments. The increase in non-cash adjustments was primarily due to higher amortization expense of intangible assets related to the acquisition of Oasis, offset by a lower provision for deferred income taxes.\n\nDuring the six months, we repurchased 2.0 million shares of our common stock for a total of $171.9 million. In the respective prior year period, we repurchased 0.5 million shares for a total of $32.8 million.\n\nNon-GAAP Financial Measures\n\nIn addition to reporting net income and diluted earnings per share, which are U.S. GAAP measures, we present adjusted net income, adjusted diluted earnings per share, EBITDA, and EBITDA margin (EBITDA as a percentage of total revenue), which are non-GAAP measures. We believe these additional measures are indicators of our core business operations performance period over period. Adjusted net income, adjusted diluted earnings per share, EBITDA, and EBITDA margin are not calculated through the application of U.S. GAAP and are not required forms of disclosure by the Securities and Exchange Commission (“SEC”). As such, they should not be considered as a substitute for the U.S. GAAP measures of net income and diluted earnings per share, and, therefore, should not be used in isolation, but in conjunction with the U.S. GAAP measures. The use of any non-GAAP measure may produce results that vary from the U.S. GAAP measure and may not be comparable to a similarly defined non-GAAP measure used by other companies.\n\nOutlook \n\nOur outlook for the fiscal year ending May 31, 2020 (“fiscal 2020”), is based upon current market expectations and economic conditions continuing with no significant changes. We have updated our guidance as a result of current business trends. Our updated guidance is as follows:\n\nOther aspects of our guidance for fiscal 2020 remain unchanged from what we provided previously.\n\nQuarterly Report on Form 10-Q\n\nWe anticipate filing our Quarterly Report on Form 10-Q (“Form 10-Q”) for the second quarter within the next few days, and it will be available at our Investor Relations Page. This press release should be read in conjunction with the Form 10-Q and the related Notes to Consolidated Financial Statements and Management's Discussion and Analysis of Financial Condition and Results of Operations contained in that Form 10-Q.\n\nConference Call\n\nInterested parties may access the webcast of our Earnings Release Conference Call, scheduled for December 18, 2019 at 9:30 a.m. Eastern Time, at our Investor Relations Page. The webcast will be archived for approximately one month. Our news releases, current financial information, SEC filings, and investor presentations are also accessible at our Investor Relations Page.\n\nAbout Paychex\n\nPaychex, Inc. (Nasdaq:PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.\n\nCautionary Note Regarding Forward-Looking Statements Pursuant to the U.S. Private Securities Litigation Reform Act of 1995\n\nCertain written and oral statements made by us may constitute “forward-looking statements” within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by such words and phrases as “we expect,” “expected to,” “estimates,” “estimated,” “overview,” “current outlook,” “guidance,” “we look forward to,” “would equate to,” “projects,” “projections,” “projected,” “projected to be,” “anticipates,” “anticipated,” “we believe,” “believes,” “could be,” “targeting,” and other similar words or phrases. Examples of forward-looking statements include, among others, statements we make regarding operating performance, events, or developments that we expect or anticipate will occur in the future, including statements relating to our outlook, revenue growth, earnings, earnings-per-share growth, or similar projections.\n\nForward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on our current beliefs, expectations, and assumptions regarding the future of our business, future plans and strategies, projections, anticipated events and trends, the economy, and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks, and changes in circumstances that are difficult to predict, many of which are outside our control. Our actual results and financial conditions may differ materially from those indicated in the forward-looking statements. Therefore, you should not place undue reliance upon any of these forward-looking statements. Important factors that could cause our actual results and financial condition to differ materially from those indicated in the forward-looking statements include, among others, the following:\n\nAny of these factors, as well as such other factors as discussed in our SEC filings, could cause our actual results to differ materially from our anticipated results. The information provided in this document is based upon the facts and circumstances known as of the date of this press release, and any forward-looking statement made by us in this document speaks only as of the date on which it is made. Except as required by law, we undertake no obligation to update these forward-looking statements after the date of issuance of this press release to reflect events or circumstances after such date, or to reflect the occurrence of unanticipated events.\n\n© 2019 Paychex, Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191218005062/en/\nInvestor Relations:\nEfrain Rivera, CFO, or Terri Allen\n585‑383‑3406\n\nMedia Inquiries:\nLaura Saxby Lynch\n585‑383‑3074\nSource: Paychex, Inc."
    },
    {
        "title": "Paychex Flex® Wins Gold Brandon Hall Group Excellence in Technology Award",
        "subtitle": "Paychex recognized for \"Best Advance in HR or Workforce Management Technology for Small and Medium-Sized Businesses\"",
        "date": "Dec 16, 2019 11:03AM EST",
        "content": "ROCHESTER, N.Y., Dec. 16, 2019 /PRNewswire/ -- Paychex, Inc., a leading provider of human resources, payroll, benefits, and insurance solutions, has won a Brandon Hall Group gold award for Excellence in Technology in the \"Best Advance in HR or Workforce Management Technology for Small and Medium-Sized Businesses\" category. This marks the fourth-straight year Brandon Hall Group has honored Paychex Flex®, the company's cloud-based HR solution, in its annual Technology Excellence Awards program. \"Winners of Excellence in Technology Awards are at the forefront of technology innovation. Our program evaluates not just the solution itself, but the benefit to the human capital management function, the business and the customer. That is the ultimate differentiator – whether the technology has a positive business impact. Technology Award winners pass that test with flying colors,\" said Rachel Cooke, chief operating officer of Brandon Hall Group and head of the awards program.\"An Excellence Award also validates the vision of the technology development team, the wisdom of the company's investment in the solution, and the value the technology brings to the end-user,\" said Mike Cooke, CEO of Brandon Hall Group. Designed to simplify and facilitate HR tasks for employers so they can focus on finding, engaging, and keeping the right employees, Paychex Flex is a single platform that features a consistent user experience regardless of the device being used. Built to support a wide variety of business needs and growth patterns, Paychex customers have access to solutions spanning the entire employee lifecycle and can choose which modules to leverage today, choose to add more in the future, and integrate with existing best-of-breed solutions when needed.  \"HR is not one-size-fits-all, and we build Paychex Flex from the ground up with that fact at the forefront,\" said Mike Gioja, senior vice president of IT and product development. \"Paychex Flex enables thousands of employers and millions of employees to access what they want, when they want, and on whatever device they want. The architectural framework and automation we've built into our application, based largely on individual patterns and preferences, results in an optimized user experience that we're extremely proud of.\" \"Over the last year, we've delivered solutions that help our more than 670,000 customers solve critical business challenges like navigating compliance, engaging their workforce, controlling costs, and staying competitive,\" added Tom Hammond, vice president of corporate strategy and product management. \"From modernizing performance management to introducing benchmarking and a 1-on-1 conversation log, to giving our customers instant access to a ready pool of qualified candidates through our partnership with Indeed, we're proud of what we've brought to market this year and thank Brandon Hall Group for this validation of our work.\" A panel of veteran, independent senior industry experts, and Brandon Hall Group senior analysts and executives, evaluated the entries based upon the following criteria:The full list of Technology Excellence Award winners can be found online here.  About PaychexPaychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.About Brandon Hall Group, Inc. With more than 10,000 clients globally and 20 years of delivering world class research and advisory services, Brandon Hall Group is the most well-known and established research organization in the performance improvement industry. We conduct research that drives performance, and provides strategic insights for executives and practitioners responsible for growth and business results. Brandon Hall Group has an extensive repository of thought leadership, research and expertise in Learning and Development, Talent Management, Leadership Development, Talent Acquisition and Human Resources. At the core of our offerings is a Membership Program that Empowers Excellence Through Content, Collaboration and Community. Our members have access to research that helps them make the right decisions about people, processes, and systems, combined with research-powered advisory services customized to their needs. (www.brandonhall.com).Media Contact Tracy Volkmann Public Relations Program Manager Paychex, Inc. (585) 387-6705 tvolkmann@paychex.com @PaychexNews View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-flex-wins-gold-brandon-hall-group-excellence-in-technology-award-300975362.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Identifies the Top 10 Regulatory Issues for Employers in 2020",
        "subtitle": "",
        "date": "Dec 12, 2019 2:03PM EST",
        "content": "ROCHESTER, N.Y., Dec. 12, 2019 /PRNewswire/ -- Paychex, Inc., a leading provider of HR technology solutions for human resources, payroll, benefits, and insurance services, today identified the top 10 regulatory issues that employers should be aware of and prepared for in 2020. As business owners and HR managers plan for the year ahead, the list outlines the compliance topics that should be kept top of mind as they are likely to shape the legislative and regulatory landscape of the next 12 months, especially heading into an unpredictable election year.\"Business owners must be prepared for regulatory changes at the federal, state, and local levels across a multitude of different issues,\" said Martin Mucci, president and CEO of Paychex. \"It's more challenging than ever for employers to track, understand, and implement these complex and ever-changing laws. With our annual summary of timely regulatory developments, we hope to simplify some of these compliance challenges for business owners and HR leaders.\"Here are the top 10 regulatory issues compliance experts at Paychex have identified for 2020:#1 Form W-4 Changes. The Tax Cuts and Jobs Act of 2017 forced a revision of the federal withholding process, culminating in a brand-new Form W-4 for use in 2020. Key changes include the elimination of withholding allowances and the ability for taxpayers to have more tax withheld to address the concerns of those who have had to unexpectedly pay tax when filing in the years following the tax reform legislation. All new employees hired as of January 1, 2020 must complete the new form. Existing employees are not required to complete a new form but can choose to adjust their withholding based on the new form. Any adjustments made after January 1, 2020 must be made using the new form. Employers, therefore, must be prepared to compute employees' withholdings based on both the old and new versions of the Form W-4. With the release of the new federal form and revised withholding tables, individual states must also determine if they will update their systems based on the federal changes, keep their current process, or develop a new withholding process. A few states have already made their determinations, but the majority have yet to decide.#2 Final Overtime Rule. In September 2019, the U.S. Department of Labor (DOL) announced its long-awaited Final Overtime Rule to revise the federal regulations governing which employees are entitled to minimum wage and overtime pay under the federal wage and hour law. Among other changes, the Final Overtime Rule raises the \"standard salary\" for the executive, administrative and professional white collar exemptions from the currently enforced level of $455 to $684 per week (equivalent to $35,568 per year for a full-year worker), effective January 1, 2020. The new rule also allows employers to use non-discretionary bonuses and certain incentive payments (including commissions) that are paid at least annually to satisfy up to 10 percent of the standard salary level in a 52-week period. #3 Worker Classification. Worker classification continues to be addressed by enforcing agencies, in the courts and in local and state legislatures across the country. Perhaps the most impactful legislation this year, especially for workers of ridesharing services, is California AB5, effective January in 2020.  The new law will require employers to demonstrate a worker satisfies a three-part (ABC) test to be classified as an independent contractor in the state. Other state and local legislatures are considering similar legislation. #4 Multiple Payment Options Available to Businesses. In 2020, the rapid expansion of multiple faster payment options to send and receive funds will continue. New developments include the roll out of the Clearinghouse's Real Time Payments network and the expansion of same-day ACH for businesses and pay-on-demand products that allow workers to receive pay as it is earned. These convenient electronic payment options will continue to make non-cash payments increasingly popular. Businesses interested in improving their cash flow through utilizing these faster payment options and assisting their employees with financial flexibility should consult with their financial institution or payroll provider for more information on available payment options. #5 Privacy. Employers need to be mindful of the impact various privacy related regulations have on the way they do business. One of the more actively discussed regulations going in to 2020 will continue to be the California Consumer Privacy Act, (CCPA). Even though employers have been exempted from many of the CCPA requirements for one year, until January 1, 2021, the notice provision will still apply. What this means is that any business that meets the CCPA criteria is required to provide employees with a privacy policy notice. The CCPA requirements will continue to undergo additional refinements as the Attorney General begins to issue final guidance in 2020. Additionally, more employers are utilizing biometrics to identify employees and track hours worked. However, unlike other methods of authentication such as passwords, ID cards, etc., biometric identifiers cannot be changed once compromised. Employers that use biometrics need to be aware of regulations such as the Illinois Biometric Information Privacy Act (BIPA) that are emerging at the state level.  #6 Health Care Reform. Many health care regulations have shifted under the current administration, including Association Health Plans (AHPs), Short-Term Limited Duration Insurance (STLDI), and Individual Coverage Health Reimbursement Arrangements (ICHRAs). Additional changes include the removal of the federal penalty under the individual mandate. In some cases, these changes have prompted states to take legal action to shape the health coverage in their geographies, including instituting their own individual mandate or further limiting the federal rules of AHPs and STLDI in their jurisdiction. As a result, employers may have some new alternatives and new obligations when it comes to employees' health care options, depending on where they live, but these choices are often complex. Employers should be cognizant that the current landscape is fluid, and both state and federal elections in 2020 have the potential to alter this trajectory in various geographies.  #7 Employer Shared Responsibility Enforcement. The IRS continues to expand and refine its enforcement of the Employer Shared Responsibility (ESR) provisions. In addition to the IRS 226J letters, which include the preliminary calculations for ESR payments for not offering adequate affordable insurance to full-time employees, the IRS has begun assessing penalties for untimely or non-filing of the information returns 1094-C/1095-C. The good-faith-effort relief for filing inaccurate or incomplete returns was recently extended, but this relief did not apply if the returns were not filed timely and these penalties can be substantial. As the IRS continues to enhance its enforcement efforts, applicable large employers (ALEs) should ensure they do their due diligence to report information on Forms 1094-C/1095-C in a timely and accurate manner, as well as respond promptly to any notice received from the IRS. #8 Sexual Harassment Prevention. The #MeToo movement continued to drive increased attention to the prevention of sexual harassment in the workplace in 2019. In response, state and city legislatures, including California, Connecticut, Illinois, New York state, and New York City, passed legislation and developed regulations that included provisions to implement or expand employer requirements for workplace sexual harassment prevention policies and/or training. All employers should consider examining their internal processes for addressing inappropriate behavior in the workplace and creating a safe, respectful environment for all employees and non-employees.#9 Paid Family Leave and Paid Sick Leave. Many state and local jurisdictions have implemented paid sick leave laws, and eight states and Washington, D.C., have passed legislation to implement paid family and medical leave programs to provide eligible employees with benefits in the form of partial wages when taking leave to care for themselves or a covered family member. Bipartisan interest in a paid family leave law at the federal level also exists, with several proposals being considered at this time. Also trending in 2019, Maine; Nevada; and Bernalillo County, New Mexico passed paid leave laws requiring employers to provide paid time off to eligible employees without requiring a reason for the leave. #10 Marijuana Legalization. State and local jurisdictions continue to enact legislation that addresses decriminalization of marijuana, recognition of medical marijuana use, and/or legalization of recreational marijuana. Currently, 11 states and Washington D.C. have passed legislation to legalize marijuana for recreational purposes. Employers must stay apprised of these legal developments as well as court decision and consider adjusting their risk mitigation strategies, including workplace policies to allow for accommodations where applicable for the lawful use of marijuana for medicinal purposes and the parameters of existing drug testing programs.For a slideshow of 2020's top 10 regulatory issues, visit Paychex WORX.Keeping up with regulations is a challenge for today's business owners and HR leaders. With a dedicated team of compliance experts, Paychex is constantly tracking regulatory changes in order to help provide customers with the information and resources they need to make the best decisions for their business. For up-to-date regulatory news and resources from Paychex, visit www.paychex.com/WORX.Note: The information contained within is not tax or legal advice. These issues are complex, and applicability depends on individual circumstances. Businesses should consult tax or legal counsel before taking action on any of the items identified above.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves over 670,000 payroll clients as of May 31, 2019, across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.Media ContactsLisa FlemingPaychex, Inc. 585-387-6402lfleming@paychex.com @PaychexNews Colleen BennisMower 585-389-1865cbennis@mower.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-identifies-the-top-10-regulatory-issues-for-employers-in-2020-300974268.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Supports Customers with New Form W-4 through Rapid System Update and Other Resources",
        "subtitle": "The IRS has released a final version of the Form W-4 to be used by all new employees, and for all adjustments, effective January 1, 2020",
        "date": "Dec 5, 2019 3:41PM EST",
        "content": "ROCHESTER, N.Y., Dec. 5, 2019 /PRNewswire/ -- Paychex, Inc., a leading provider of HR technology solutions for human resources, payroll, benefits, and insurance services, has updated its systems to accommodate the new Form W-4 issued late yesterday by the IRS, while continuing to support calculation methods of the previous W-4 for its customers. All new employees hired as of January 1, 2020 must complete the new Form W-4, as well as any current employees who wish to make withholding adjustments. \"Throughout this process, which began with the passage of the Tax Cuts and Jobs Act of 2017, Paychex has actively engaged with the IRS, providing feedback to the draft versions of the Form W-4,\" said Frank Fiorille, Paychex vice president of Risk, Compliance, and Data Analytics. \"We're proud of the leadership role we've taken in the payroll industry, working with the IRS to address the areas of greatest importance, communicating with our customers about this impactful change, and quickly updating our systems to support payroll calculations based on both the new W-4 and the previous version.\" What has changed? The IRS has updated the form to better reflect the current tax code established under the Tax Cuts and Jobs Act of 2017. Key changes include the elimination of withholding allowances and the ability for taxpayers to have more tax withheld to address the concerns of those who had to unexpectedly pay tax when filing in the years following the tax reform legislation.Who does this change impact? All new employees hired as of January 1, 2020 must complete the new form. Existing employees are not required to complete a new form but can choose to adjust their withholding based on the new form. Any adjustments made after January 1, 2020 must be made using the new form. Employers, therefore, must be prepared to compute employees' withholdings based on both the old and new versions of the Form W-4. How is Paychex supporting customers? Over the past several months, Paychex has provided updates to its customers to support them through this change, including informational resources and links to the draft versions of the updated form, along with withholding calculators. With the official release of the new W-4, Paychex customers will have seamless access to the updated W-4 for new employees, as well as employees who choose to make withholding adjustments. Visit Paychex WORX for an overview of the new Form W-4 and the considerations to keep in mind as the form rolls out next year. As part of the new W-4, the IRS has provided a worksheet to guide taxpayers through the completion of the new form available at www.irs.gov/pub/irs-pdf/fw4.pdf. About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves over 670,000 payroll clients as of May 31, 2019, across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.Media ContactLisa FlemingManager, Public Relations Paychex, Inc.(585) 387-6402lfleming@paychex.com @PaychexNews View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-supports-customers-with-new-form-w-4-through-rapid-system-update-and-other-resources-300970310.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex, Inc. Schedules Second Quarter Fiscal 2020 Earnings Release Conference Call for December 18, 2019",
        "subtitle": "",
        "date": "Dec 4, 2019 2:00PM EST",
        "content": "    ROCHESTER, N.Y.--(BUSINESS WIRE)--\nPaychex, Inc. (Nasdaq:PAYX) is scheduled to release financial results for the fiscal 2020 second quarter ended November 30, 2019 via Business Wire before the financial markets open on Wednesday, December 18, 2019.\n\nThe Company will host a conference call at 9:30 a.m. ET on Wednesday, December 18, 2019 to review the results for the quarter. Participating in this call will be Martin Mucci, President and CEO, and Efrain Rivera, Senior Vice President, CFO, and Treasurer. This call will be simultaneously broadcast over the Internet.\n\nTo listen to the Webcast of the conference call, access the Company’s Financial Webcasts page at our Investor Relations Page. Webcast participants should access this site in advance of the call to ensure their PCs are properly configured. The Webcast will be archived and available for replay for approximately one month.\n\nAbout Paychex\nPaychex, Inc. (Nasdaq:PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.\n\nPaychex, Inc.’s news releases, current financial information, SEC filings, and investor presentations are accessible at our Investor Relations Page.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191204005605/en/\nInvestor Relations:\nEfrain Rivera, CFO or Terri Allen\n585-383-3406\n\nMedia Inquiries:\nLaura Saxby Lynch\n585-383-3074\nSource: Paychex, Inc."
    },
    {
        "title": "Small Business Wage Growth Hits New High, Job Growth Consistent in November",
        "subtitle": "The Paychex ",
        "date": "Dec 3, 2019 8:30AM EST",
        "content": " ROCHESTER, N.Y., Dec. 3, 2019 /PRNewswire/ -- The tight labor market continues to positively impact wage growth, according to the latest Paychex | IHS Markit Small Business Employment Watch. Hourly earnings grew 3.11 percent among employees of small businesses, the highest level since reporting began in 2011. Weekly earnings continue to grow, accelerating 3.75 percent in November. Essentially unchanged from the previous month, the national jobs index moderated 0.03 percent, remaining above 98. \"Wage increases are finally beginning to reflect the tight labor market for small businesses,\" said James Diffley, chief regional economist at IHS Markit.\"Employers are responding to the challenges of the tight labor market,\" said Martin Mucci, Paychex president and CEO. \"We've seen a steady climb in hourly earnings growth, now reaching the highest levels in nearly a decade.\"  Broken down further, the November report showed: The complete results for November, including interactive charts detailing all data at a national, regional, state, metro, and industry level, are available at www.paychex.com/employment-watch. Highlights are available below.National Jobs IndexNational Wage Report Regional Jobs Index Regional Wage Report  State Jobs Index Note: Analysis is provided for the 20 largest states based on U.S. population. State Wage Report Note: Analysis is provided for the 20 largest states based on U.S. population. Metropolitan Jobs Index  Note: Analysis is provided for the 20 largest metro areas based on U.S. population. Metropolitan Wage Report Note: Analysis is provided for the 20 largest metro areas based on U.S. population.Industry Jobs Index Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. Industry Wage Report  Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. For more information about the Paychex | IHS Markit Small Business Employment Watch, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts.*Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website. About the Paychex | IHS Markit Small Business Employment WatchThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.About IHS Markit (www.ihsmarkit.com)IHS Markit (NYSE: INFO) is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world's leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.IHS Markit is a registered trademark of IHS Markit Ltd. and/or its affiliates. All other company and product names may be trademarks of their respective owners © 2019 IHS Markit Ltd. All rights reserved. Media ContactsLisa FlemingPaychex, Inc. +1 585-387-6402lfleming@paychex.com @PaychexNews Kate SmithIHS Markit+1 781-301-9311katherine.smith@ihsmarkit.com  Tess Flynn Mower +1 716-880-1488tflynn@mower.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/small-business-wage-growth-hits-new-high-job-growth-consistent-in-november-300968052.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex One of the Best Places to Work in Insurance",
        "subtitle": "Paychex Insurance Agency, Inc. honored as an outstanding employer in the insurance industry for the fifth consecutive year by Business Insurance magazine",
        "date": "Nov 19, 2019 10:55AM EST",
        "content": "ROCHESTER, N.Y., Nov. 19, 2019 /PRNewswire/ -- Paychex Insurance Agency, Inc., a wholly owned subsidiary of Paychex, Inc., has been named to Business Insurance magazine's 2019 list of the Best Places to Work in Insurance. This marks the fifth year in a row that the agency has been honored through the Best Places to Work in Insurance program, which recognizes employers for establishing workplaces where employees can thrive, enjoy their work, and help their companies grow.\"We are a customer-centric company, but we understand that perhaps the best thing we can do to deliver a great customer experience is take excellent care of our employees,\" said Laurie Zaucha, vice president of human resources and organizational development. \"We are deliberate in making sure employees feel valued and set up for success with industry-leading technology, a strong emphasis on overall employee well-being, and opportunities for people to grow their careers – and it's these things that we believe make Paychex a great place to work.\"To be considered for this listing, companies underwent a rigorous assessment that began in June 2019. A two-part evaluation took place in the months following, including a confidential employee engagement and satisfaction survey, as well as an in-depth employer questionnaire. The employee survey accounted for 75 percent of the company's score and measured workplace experience and company culture in both sales and operations. The employer survey accounted for the remaining 25 percent of the final score and collected data related to the company's benefit programs, policies, practices, and other general information.\"This honor reflects our commitment to maintaining a business environment and company culture in which employees feel connected to their work – as well as their peers – and empowered to succeed,\" said Mark Bottini, Paychex senior vice president of sales.Paychex Insurance Agency was among 100 insurance companies recognized as part of this year's Best Places to Work in Insurance program, which was again a joint effort between Business Insurance and employee engagement survey administrator Best Companies Group.View the alphabetized 2019 list in its entirety at businessinsurance.com. To learn more about Paychex Insurance Agency, visit paychex.com/employee-benefits.Insurance is available through Paychex Insurance Agency, Inc., 150 Sawgrass Dr., Rochester, NY 14620. CA License #0C28207About PaychexPaychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.Media Contact  Michael DiLuglio  Employee Communications Program Manager  Paychex, Inc.  585-387-4801  mdiluglio@paychex.com  @PaychexNews View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-one-of-the-best-places-to-work-in-insurance-300961070.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "FORTUNE® Names Paychex Among the 'Future 50' Companies Best Positioned for Growth",
        "subtitle": "",
        "date": "Nov 18, 2019 2:20PM EST",
        "content": "ROCHESTER, N.Y., Nov. 18, 2019 /PRNewswire/ -- Paychex, Inc., a leading provider of HR technology solutions for human resources, payroll, benefits, and insurance services, has been included on FORTUNE magazine's Future 50 list of companies that are best positioned for long-term growth by demonstrating both steady execution and strategic agility.In addition to the company's solid financial results, Paychex was recognized for its commitment to innovative technology offerings, designed to meet the needs of the evolving workplace. \"Paychex has stayed focused on innovation, launching new products for niche markets, such as solo practitioners, and steadily adding functionality to its core platforms,\" the FORTUNE article reports. \"Over the years, Paychex has transformed from a digital player to a true digital disruptor,\" said Martin Mucci, Paychex president and CEO. \"We're proud of our commitment to anticipate, develop, and implement new technology solutions that address the HR industry's most complex challenges.\"To compile the list, FORTUNE works in partnership with the management consulting group BCG to evaluate firms on more than a dozen factors that predict growth over the next five years, measuring the following categories: strategy, technology and investments, people, and structure. The complete list of the 2019 FORTUNE Future 50 is available here. About the FORTUNE Future 50To identify the Future 50, FORTUNE partners with the management consulting firm BCG to examine more than 1,000 publicly traded companies with at least $20 billion in market value or $10 billion in revenue in the 12 months through the end of 2018. The ratings are determined using the following criteria: 30 percent of a company's score is based on market potential (defined as its expected future growth as determined by financial markets). The other 70 percent is based on a company's capacity to deliver against this potential. This score comprises 19 factors, selected for their ability to predict growth over the following five years, which fall into four categories: strategy, technology and investments, people, and structure.  About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for human resources, payroll, benefits, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves over 670,000 payroll clients as of May 31, 2019, across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn.Media ContactLisa FlemingManager, Public Relations Paychex, Inc.(585) 387-6402lfleming@paychex.com @PaychexNews View original content to download multimedia:http://www.prnewswire.com/news-releases/fortune-names-paychex-among-the-future-50-companies-best-positioned-for-growth-300960202.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Small Business Wage Growth Gains Momentum, Job Growth Holds Steady in October",
        "subtitle": "Paychex ",
        "date": "Oct 29, 2019 8:30AM EDT",
        "content": " ROCHESTER, N.Y., Oct. 29, 2019 /PRNewswire/ -- The tight labor market positively impacted wage growth in October, according to the latest Paychex | IHS Markit Small Business Employment Watch. Hourly earnings are on the rise, reaching 3.00 percent ($0.80) growth in October. Additionally, after hovering just above two percent to start the year, weekly earnings growth has quickly improved to 3.36 percent as month-to-month gains grow larger. At 98.14, the national jobs index remains essentially the same as last month (98.22).\"There was little change in the jobs index in October, but hourly earnings growth continued to accelerate, and weekly earnings gains reached a new series high, 3.36 percent,\" said James Diffley, chief regional economist at IHS Markit.\"The recruitment and retention challenges presented by this tight labor market are becoming more noticably reflected in employees' paychecks,\" said Martin Mucci, Paychex president and CEO. \"We anticipate wage growth will continue as employers work to attract and keep top talent.\" Broken down further, the October report showed: The complete results for October, including interactive charts detailing all data at a national, regional, state, metro, and industry level, are available at www.paychex.com/employment-watch. Highlights are available below.National Jobs IndexNational Wage Report Regional Jobs Index  Note: Percentages displayed in the regional heat map reflect 12-month changes.Regional Wage Report  Note: Percentages displayed in the regional heat map reflect 12-month changes.State Jobs Index  Note: Analysis is provided for the 20 largest states based on U.S. population. State Wage Report Note: Analysis is provided for the 20 largest states based on U.S. population. Metropolitan Jobs Index   Note: Analysis is provided for the 20 largest metro areas based on U.S. population. Metropolitan Wage Report Note: Analysis is provided for the 20 largest metro areas based on U.S. population.Industry Jobs Index Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. Industry Wage Report  Note: Analysis is provided for seven major industry sectors. Definitions of each industry sector can be found here. The Other Services (excluding Public Administration) industry category includes religious, civic, and social organizations, as well as personal services, including automotive and household repair, salons, drycleaners, and other businesses. For more information about the Paychex | IHS Markit Small Business Employment Watch, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts. *Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website. About the Paychex | IHS Markit Small Business Employment WatchThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.About PaychexPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com, and stay connected on Twitter and LinkedIn. About IHS Markit (www.ihsmarkit.com)IHS Markit (NYSE: INFO) is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world's leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.IHS Markit is a registered trademark of IHS Markit Ltd. and/or its affiliates. All other company and product names may be trademarks of their respective owners © 2019 IHS Markit Ltd. All rights reserved. Media ContactsLisa FlemingPaychex, Inc. +1 585-387-6402lfleming@paychex.com @PaychexNews Kate SmithIHS Markit+1 781-301-9311katherine.smith@ihsmarkit.com  Tess Flynn Mower +1 716-880-1488tflynn@mower.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/small-business-wage-growth-gains-momentum-job-growth-holds-steady-in-october-300946926.htmlSOURCE  Paychex, Inc."
    },
    {
        "title": "Paychex Named to HRExaminer 2020 Watchlist for AI in HR",
        "subtitle": "Analyst firm recognizes Paychex for leading the way with intelligent tools",
        "date": "Oct 25, 2019 1:03PM EDT",
        "content": "ROCHESTER, N.Y., Oct. 25, 2019 /PRNewswire/ -- HRExaminer has named Paychex to its 2020 Watchlist for intelligent tools and artificial intelligence in HR. As part of the third annual report – The 2020 Index of Intelligent Tools in HR Technology – Paychex, Inc., a leading provider of HR, payroll, benefits, and insurance solutions, appears on the Watchlist for the first time. \"Legacy providers have massive market advantages over startups,\" noted John Sumser, HRExaminer founder and principal analyst, in the report. \"With large datasets and existing customers, it's easier to see intelligent tools as a path to increased customer satisfaction while reducing overall costs. Paychex is demonstrating that a broad-spectrum utilization of 'AI' tools can strengthen existing operations.\"Sumser based the Watchlist on 450 hours of in-depth interviews with 110 organizations globally.\"The sheer volume of data at our disposal allows us to deploy AI and machine learning principles more effectively than most organizations,\" said Mike Gioja, Paychex senior vice president of IT and product development. \"Our product development strategy today enables us to automate where it makes sense to do so and, in turn, deliver a more personalized, optimized user experience. We do all of this while making the security and privacy of our customers' data a top priority.\"Paychex Flex® Assistant, the company's customer-facing service chatbot, can currently answer 200 questions spanning the Paychex Flex suite – from recruiting and onboarding to engagement and retirement – with more questions being added as the bot matures. The chatbot also seamlessly integrates with real-time live chat capability, functionality that connects users with a live Paychex service agent if Paychex Flex Assistant cannot yet answer their question. All chatbot transactions are visible to the live Paychex service agent, eliminating the need for users to repeat their question to the live agent. Since its introduction in December 2018, Paychex Flex Assistant has handled more than a half million transactions.Paychex underpins other aspects of the Paychex Flex architecture with intelligent tools, as well, leveraging AI and machine learning to deliver a more personalized user experience (UX) for its millions of monthly users. This approach leads to a more predictive UX, as the system learns individual user preferences over time and makes real-time recommendations for things like a custom dashboard or the user's learning preferences for application help.\"I'm extremely proud of the progress we've made as a technology-focused organization, and recognitions like this prove that work is paying off,\" Gioja added. \"However, as an organization with a history of providing world-class service, we will never lose sight of the value in blending humans and machines. Our AI doesn't replace human interactions, but rather allows us and our customers to engage in more high-value human touchpoints because we've automated a lot of the routine interactions.\"In addition to customer-facing solutions, Paychex regularly leverages Robotic Process Automation (RPA) to complete simple, repetitive tasks behind the scenes. RPA powers the company's approach to automated payroll processing and appointment scheduling, for example, saving thousands of hours in manual work. Additionally, leveraging consistent monitoring of client profiles and key transactions across millions of users, automated routines distribute Paychex Flex users to the most appropriate infrastructure, resulting in optimal application performance.To view the HRExaminer 2020 Watchlist for AI in HR, visit hrexaminer.com. The 2020 Index of Intelligent Tools in HR Technology: The Birth of HR as a Systems Science full research report is also available for download. About PaychexPaychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting paychex.com and stay connected on Twitter and LinkedIn.Media ContactTracy VolkmannPublic Relations Program ManagerPaychex, Inc.(585) 387-6705tvolkmann@paychex.com @PaychexNews View original content to download multimedia:http://www.prnewswire.com/news-releases/paychex-named-to-hrexaminer-2020-watchlist-for-ai-in-hr-300945618.htmlSOURCE  Paychex, Inc."
    }
]