[
    {
        "title": "PACCAR Achieves Record Annual Revenues and Net Income",
        "subtitle": "",
        "date": "Jan 28, 2020 8:00AM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\n“PACCAR (Nasdaq: PCAR) reported record annual revenues and profits in 2019 and has earned an impressive 81 consecutive years of net income,” said Preston Feight, chief executive officer. “PACCAR’s vibrant results reflect the company’s premium-quality products and services, strong global truck markets, record truck production and record aftermarket parts sales. I am very proud of our employees who have delivered outstanding products and services to our customers.” PACCAR delivered a total shareholder return of 45% compared to the S&P 500 Index total return of 31% in 2019.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200128005231/en/Kenworth W990 Truck (Photo: Business Wire)\n“Freight tonnage grew 3.3% percent in the U.S. in 2019. The North American and European economies are projected to continue growing in 2020. We expect 2020 to be another strong year for PACCAR,” added Feight.\n\nPACCAR achieved quarterly revenues of $6.12 billion in the fourth quarter 2019, compared to the $6.28 billion reported in the same period in 2018. The company earned $531.3 million ($1.53 per diluted share) in the fourth quarter of 2019. PACCAR earned $578.1 million ($1.65 per diluted share) in the fourth quarter of 2018. PACCAR achieved record revenues of $25.60 billion in 2019, a 9% increase compared to revenues of $23.50 billion in 2018. The company earned a record $2.39 billion ($6.87 per diluted share) in 2019, 9% higher than the $2.20 billion ($6.24 per diluted share) earned in 2018.\n\nIncreased Dividends and Share Repurchases \n\nPACCAR declared cash dividends of $3.58 per share during 2019, a 16% increase compared to the $3.09 per share declared in 2018. Dividends declared in 2019 included a $2.30 per share extra cash dividend paid in January 2020. PACCAR has increased its regular quarterly dividend an average of 11% per year during the last 20 years. “PACCAR has delivered annual dividends, including regular quarterly and extra cash dividends, totaling approximately 50% of net income for many years,” said Mark Pigott, executive chairman.\n\nPACCAR repurchased 1.68 million of its common shares for $110.2 million during 2019. PACCAR’s Board of Directors approved the repurchase of $500 million of its common stock in December 2018. Stock repurchases of $430.5 million are remaining under the authorization.\n\nBusiness Highlights – 2019\n\nFinancial Highlights – Fourth Quarter 2019\n\nHighlights of PACCAR’s financial results during the fourth quarter of 2019 include:\n\nFinancial Highlights – Full Year 2019\n\nHighlights of PACCAR’s financial results during 2019 include:\n\nGlobal Truck Markets\n\n“Strong GDP and consumer spending growth in 2019 resulted in increased freight tonnage and record Kenworth and Peterbilt truck deliveries,” said Darrin Siver, PACCAR senior vice president. “Kenworth and Peterbilt achieved strong U.S. and Canada Class 8 retail sales market share of 30.0%.” Class 8 truck industry retail sales in the U.S. and Canada were 309,000 units in 2019 compared to 285,000 vehicles sold in 2018. U.S. and Canada Class 8 truck industry retail sales are expected to be in a range of 230,000-260,000 trucks in 2020.\n\nEuropean above 16-tonne truck industry registrations were 320,000 trucks in 2019. It is estimated that European truck industry registrations in the above 16-tonne market in 2020 will be another excellent year in the range of 260,000-290,000 trucks. “European truck demand remains strong due to steady European economic growth,” said Harry Wolters, DAF president. “DAF achieved robust above 16-tonne market share of 16.2% in 2019. DAF trucks deliver premium quality, exceptional fuel efficiency and superior driver comfort for its customers.”\n\nThe South American above 16-tonne truck market was 105,000 vehicles this year, and is projected to be in a range of 100,000-110,000 trucks in 2020. “Customer demand for DAF and Kenworth trucks resulted in a 59% increase in deliveries in South America in 2019,” said Gary Moore, PACCAR executive vice president. The Brasilian above 16-tonne truck market was 75,000 vehicles in 2019, and is projected to be in a range of 70,000-80,000 trucks in 2020.\n\nPACCAR Parts Achieves Record Results\n\nPACCAR’s aftermarket parts business achieved fourth quarter pre-tax income of $205.2 million, 6% higher than the $193.8 million earned in the fourth quarter of 2018. Fourth quarter 2019 revenues were $993.9 million compared to $970.9 million reported in the fourth quarter of 2018. PACCAR Parts achieved record annual pre-tax income of $830.8 million, 8% higher than the $768.6 million earned in 2018. Annual revenues were a record $4.02 billion compared to $3.84 billion in 2018. David Danforth, PACCAR vice president and PACCAR Parts general manager, said, “PACCAR Parts’ revenue and profit growth has been driven by investments in distribution and technology, initiatives such as TRP all-makes parts, TRP stores and a growing population of integrated and connected PACCAR vehicles. More than 40% of Kenworth and Peterbilt Class 8 trucks and 100% of DAF above 16-tonne vehicles are sold with PACCAR Engines.”\n\nPACCAR Parts’ 18 Distribution Centers (PDCs) support over 2,200 DAF, Kenworth and Peterbilt dealer locations and deliver industry-leading customer service. PACCAR will open a new 250,000-square-foot PDC in Las Vegas, Nevada and a new 160,000-square-foot PDC in Ponta Grossa, Brasil in 2020 to enhance parts availability for customers.\n\nPACCAR Displays Innovative Autonomous and Electric Trucks at CES 2020\n\nPACCAR participated in the CES technology show in Las Vegas, Nevada this month. PACCAR is a leader in autonomous and alternative powertrain commercial vehicles, and exhibited three vehicles with these technologies: a battery-electric Kenworth K270E, a Level 4 autonomous Kenworth T680 and a battery-electric Peterbilt Model 520EV. These trucks are designed for a range of customer applications, including urban distribution, over-the-road transportation and refuse collection. “These advanced technology Kenworth and Peterbilt vehicles are environmentally-friendly and enhance our customers’ operations,” said Kyle Quinn, PACCAR chief technology officer.\n\nKenworth, Peterbilt and DAF to Produce Battery-Electric Vehicles\n\nPACCAR is investing in next generation technology in its portfolio of industry-leading products and services. “Kenworth, Peterbilt and DAF are field testing battery-electric trucks with customers, and plan to deliver production models in the next 12 to 18 months,” said Kyle Quinn.\n\nThe zero-emissions Peterbilt Model 220EV and Kenworth K270E cabover trucks will have a range between 100 and 200 miles. The DAF CF Electric was honored as the Green Truck Logistics Solution 2019 in Germany, a prestigious award for the deployment of sustainable technologies in Europe.\n\nCapital and R&D Investments in Products, Technologies and Facilities\n\nPACCAR’s consistent long-term profits, strong balance sheet, and intense focus on quality, technology and productivity have enabled the company to invest $6.8 billion in new and expanded facilities, innovative products and new technologies during the past decade. PACCAR invested $743.9 million in capital projects and $326.6 million in research and development expenses in 2019. Mike Dozier, PACCAR senior vice president, said, “Capital expenditures are projected to be $625-$675 million and research and development expenses are estimated to be $310-$340 million in 2020. PACCAR is investing for long-term growth in aerodynamic truck models, integrated powertrains including diesel, electric, hybrid, and hydrogen fuel cell technologies, as well as advanced driver assistance systems, connected vehicle services and next-generation manufacturing and distribution capabilities.”\n\nPACCAR Achieves Elite “A” Rating from CDP for Environmental Management\n\nPACCAR has been honored for the second year as a global leader in environmental practices by reporting firm CDP, earning recognition on the 2019 CDP Climate Change “A” List. Over 8,000 companies disclose data about their environmental impacts, risks and opportunities to CDP for independent assessment. “Environmental leadership is one of PACCAR’s core values. PACCAR is proud to earn a CDP score of ‘A,’ which places PACCAR in the top 2% of reporting companies worldwide,” said Harrie Schippers, PACCAR president and chief financial officer. “PACCAR is one of only 35 companies in the U.S. to earn an ‘A’ rating.” PACCAR’s 2019 CDP report is available to the public at www.cdp.net.\n\nFinancial Services Companies Achieve Record Revenues and Assets \n\nPACCAR Financial Services (PFS) has a portfolio of 208,000 trucks and trailers, with record total assets of $16.07 billion. PacLease, a major full-service truck leasing company in North America and Europe with a fleet of over 40,000 vehicles, is included in this segment. PFS achieved fourth quarter 2019 pretax income of $68.1 million, compared to $87.2 million in the fourth quarter of 2018. Fourth quarter 2019 revenues were a record $406.3 million compared to $347.0 million in the same quarter of 2018. PFS earned $298.9 million of pretax profit in 2019 compared to the $305.9 million earned in 2018. PFS revenues were a record $1.48 billion in 2019 compared to the $1.36 billion achieved in 2018. “PFS’ excellent portfolio performance and increased earning assets contributed to very good results in 2019,” said Todd Hubbard, PACCAR vice president.\n\n“PACCAR’s strong balance sheet, complemented by its A+/A1 credit ratings, enables PFS to offer competitive retail financing to Kenworth, Peterbilt and DAF dealers and customers in 25 countries on four continents,” said Craig Gryniewicz, PACCAR Financial Corp. president. “PACCAR Financial Services has excellent access to the debt markets, issuing $2.49 billion in three-, four- and five-year term notes during 2019.”\n\nPACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced powertrains, provides financial services and information technology, and distributes truck parts related to its principal business.\n\nPACCAR will hold a conference call with securities analysts to discuss fourth quarter earnings on January 28, 2020, at 9:00 a.m. Pacific time. Interested parties may listen to the call by selecting “Q4 Earnings Webcast” at PACCAR’s homepage. The webcast will be available on a recorded basis through February 4, 2020. PACCAR shares are traded on the Nasdaq Global Select Market, symbol PCAR. Its homepage is www.paccar.com.\n\nThis release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act. These statements are based on management’s current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from those included in these statements due to a variety of factors. More information about these factors is contained in PACCAR’s filings with the Securities and Exchange Commission.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005231/en/\nKen Hastings\n(425) 468-7530\nken.hastings@paccar.com\nSource: PACCAR"
    },
    {
        "title": "Peterbilt and Dana Announce Collaboration on Electric Truck Powertrain Development",
        "subtitle": "",
        "date": "Jan 8, 2020 2:25PM EST",
        "content": "LAS VEGAS, Jan. 8, 2020 /PRNewswire/ -- Peterbilt Motors Company and Dana Incorporated (NYSE: DAN) have announced their collaboration on electric powertrain development for Peterbilt Model 220EV battery electric vehicles. The announcement was made in conjunction with CES that opened yesterday in Las Vegas. Peterbilt will integrate Dana's Spicer® Electrified™ e-propulsion system into its 220EV chassis. The truck will also be equipped with two battery packs and an on-board charger. The 220EV features a range between 100 and 200 miles. Using the vehicle's DC fast-charging system, the state-of-the-art, high-energy density battery packs can recharge in about an hour, making the 220EV ideal for local pickup and delivery, as well as short regional haul operations. \"Peterbilt continues to lead the charge by providing the industry's largest lineup of electric vehicles.  Announcing the Dana electric powertrain for the Model 220EV finalizes our path forward for the Medium Duty pickup and delivery market.  We will be ready to meet the growing demand of our customers who want to incorporate zero-emissions vehicles into this application,\" said Jason Skoog, PACCAR Vice President and Peterbilt General Manager.\"We are pleased to collaborate with Peterbilt by providing the complete e-powertrain, including the integration, and upfit for the Model 220EV electric vehicle,\" said Mark Wallace, president of Commercial Vehicle Driveline Technologies for Dana. \"Combining Peterbilt's advanced technologies with our own expertise in delivering end-to-end turnkey electric systems, will result in highly-efficient solutions that will lead to low total cost of ownership.\"Peterbilt Motors Company, located in Denton, Texas, has a global reputation for superior quality, industry leading design, innovative engineering and fuel-efficient solutions, and is recognized as the \"Class\" of the industry. In addition to a full lineup of on-highway, vocational and medium duty products, Peterbilt is Driving Uptime Every Day through a comprehensive array of aftermarket services and programs, including SmartLINQ® remote diagnostics, PACCAR Over-the-Air updates, RapidCheck expedited triage service, and PACCAR Solutions® Service Management. Peterbilt's 400-plus North American locations offer industry-leading parts availability thanks to automated parts inventory replenishment. Complimentary Customer Assistance is available 24/7/365 through 1-800-4-PETERBILT. For more information about Peterbilt, visit www.peterbilt.com. Peterbilt is a PACCAR Company, traded publicly on the NASDAQ as PCAR.About Dana IncorporatedDana is a world leader in providing power-conveyance and energy-management solutions that are engineered to improve the efficiency, performance, and sustainability of light vehicles, commercial vehicles, and off-highway equipment. Enabling the propulsion of conventional, hybrid, and electric-powered vehicles, Dana equips its customers with critical drive and motion systems; electrodynamic and power technologies; and thermal, sealing, and digital solutions. Learn more at dana.com. View original content:http://www.prnewswire.com/news-releases/peterbilt-and-dana-announce-collaboration-on-electric-truck-powertrain-development-300983782.htmlSOURCE  Dana Incorporated"
    },
    {
        "title": "PACCAR Displays Innovative Autonomous and Electric Trucks at CES 2020",
        "subtitle": "",
        "date": "Jan 7, 2020 12:35PM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nPACCAR (Nasdaq: PCAR) is participating in the CES 2020 show in Las Vegas, Nevada this week. CES is one of the world’s largest showcases for technological innovation. PACCAR is a leader in autonomous and alternative powertrain commercial vehicles, and is exhibiting three vehicles with these technologies at the show: a Level 4 autonomous Kenworth T680; a battery-electric Peterbilt Model 520EV; and a battery-electric Kenworth K270E. Peterbilt and Kenworth designed these trucks for a range of customer applications, including over-the-road goods transportation, refuse collection and urban distribution. Visitors are welcome to explore these advanced vehicles at PACCAR’s booth, near the Convention Center monorail station.\n\nThe Kenworth T680 autonomous truck displayed at CES demonstrates PACCAR’s commitment to developing self-driving commercial vehicles for its customers. Stephan Olsen, PACCAR Innovation Center general manager, noted, “The PACCAR Innovation Center in Silicon Valley has become a central player in the truck innovation ecosystem. Peterbilt and Kenworth are the clear trucks of choice among the leading independent autonomous driving technology developers. We look forward to deepening our productive partnerships with these innovative companies in the future.”\n\nPeterbilt Model 520EV battery-electric trucks are currently being field tested by customers. The trucks quietly collect refuse on residential and commercial routes, operating a full day on a single charge. Peterbilt expects to deliver Model 520EV trucks to customers in 2021.\n\nThe battery-electric Kenworth K270E is a medium-duty commercial vehicle with range options between 100 and 200 miles, ideal for local pickup and delivery operations. Kenworth expects to deliver K270E trucks to customers in 2020.\n\n“These advanced technology Kenworth and Peterbilt vehicles are environmentally-friendly and enhance our customers’ operations,” said Kyle Quinn, PACCAR chief technology officer.\n\n“PACCAR is investing in next-generation technologies across its portfolio of industry-leading transportation solutions. We are delighted to return to CES this year to showcase PACCAR’s innovative autonomous and alternative powertrain trucks,” added Quinn.\n\nPACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced powertrains, provides financial services and information technology, and distributes truck parts related to its principal business.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200107005930/en/\nKen Hastings\n(425) 468-7530\nken.hastings@paccar.com\nSource: PACCAR"
    },
    {
        "title": "PACCAR Announces Regular Quarterly Cash Dividend and Extra Cash Dividend",
        "subtitle": "",
        "date": "Dec 10, 2019 12:35PM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nPACCAR Inc’s (Nasdaq: PCAR) Board of Directors today declared a regular quarterly cash dividend of thirty-two cents ($.32) per share, payable on March 3, 2020, to stockholders of record at the close of business on February 11, 2020. The Board of Directors declared an extra cash dividend in the amount of two dollars and thirty cents ($2.30) per share, payable on January 8, 2020, to stockholders of record at the close of business on December 20, 2019.\n\nIn December 2018, PACCAR’s Board of Directors approved the repurchase of $500 million of PACCAR stock. Stock repurchases of $430.5 million are remaining under this authorization as of September 30, 2019.\n\nMark Pigott, executive chairman, shared, “PACCAR has generated excellent shareholder returns due to its focus on premium-quality products and processes, innovative use of technology, strong global diversification and continued expansion of its financial services and aftermarket parts businesses. PACCAR has delivered annual dividends, including regular quarterly and extra cash dividends, totaling approximately 50% of net income for many years.” PACCAR stock has delivered a 45% total return this year compared to the S&P 500 Index total return of 28%.\n\nPreston Feight, chief executive officer, said, “PACCAR’s profits and strong cash flow have enabled the company to invest in new and expanded manufacturing and distribution facilities, industry-leading products and new technologies. PACCAR’s excellent 2019 performance reflects strong global truck production and continued global aftermarket parts growth.”\n\nPACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced diesel engines, provides financial services and information technology, and distributes truck parts related to its principal business. PACCAR shares are listed on the NASDAQ Global Select Market, symbol PCAR. Its homepage is www.paccar.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191210005867/en/\nKen Hastings\n(425) 468-7530\nken.hastings@paccar.com\nSource: PACCAR Inc"
    },
    {
        "title": "PACCAR Achieves Excellent Quarterly Revenues and Earnings",
        "subtitle": "",
        "date": "Oct 22, 2019 8:00AM EDT",
        "content": "\nStrong Truck Deliveries and Aftermarket Sales Drive Results\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\n“PACCAR (Nasdaq: PCAR) reported excellent revenues and net income for the third quarter of 2019,” said Preston Feight, chief executive officer. “PACCAR’s third quarter results reflect strong global truck production and excellent global aftermarket parts results. I am very proud of our employees who have delivered industry-leading trucks, powertrains and transportation solutions to our customers.”\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191022005385/en/Kenworth T880 Truck (Photo: Business Wire)\nPACCAR achieved net income of $607.9 million ($1.75 per diluted share) in the third quarter of this year, 11% higher than the net income of $545.3 million ($1.55 per diluted share) earned in the same period last year. Third quarter net sales and financial services revenues were $6.37 billion, 11% higher than the $5.76 billion reported in the third quarter of 2018.\n\nNet sales and financial services revenues for the first nine months of 2019 were $19.48 billion compared to $17.22 billion last year. PACCAR earned $1.86 billion ($5.34 per diluted share) for the first nine months of 2019 compared to $1.62 billion ($4.59 per diluted share) in the same period last year. PACCAR achieved an excellent 9.5% after-tax return on revenues in the third quarter and the first nine months of 2019.\n\nFeight added, “PACCAR achieved a strong 14.9% Truck, Parts and Other gross margin in the third quarter and year-to-date, benefiting from good pricing, production efficiency and rigorous cost controls. We anticipate that 2020 will be another good year with a normal replacement truck market and strong demand for PACCAR’s premium products.”\n\nPACCAR Repurchases Common Shares\n\nPACCAR repurchased 832,800 common shares for $53.6 million in the third quarter. Stock repurchases of $430.5 million remain under the current $500 million program authorized by the PACCAR Board of Directors. “The stock repurchase program reflects PACCAR’s ongoing excellent business performance and the Board’s confidence in PACCAR’s future opportunities,” said Mark Pigott, PACCAR executive chairman.\n\nFinancial Highlights – Third Quarter 2019\n\nHighlights of PACCAR’s financial results for the third quarter of 2019 include:\n\nFinancial Highlights – Nine Months 2019\n\nHighlights of PACCAR’s financial results for the first nine months of 2019 include:\n\nGlobal Truck Markets\n\nClass 8 truck industry retail sales for the U.S. and Canada are expected to be in a range of 310,000-320,000 vehicles in 2019, the second highest market in history. “Class 8 truck industry retail sales in 2020 for the U.S. and Canada are estimated to be in a range of 230,000-260,000 vehicles, a solid replacement vehicle market. Good U.S. economic growth, 50-year-low unemployment and strong consumer spending are generating freight tonnage growth of 4.2% this year,” said Gary Moore, PACCAR executive vice president. “The superior operating performance of Peterbilt and Kenworth trucks enhances our customers’ profitability.”\n\n“Customers recognize DAF’s product quality leadership, industry-leading fuel efficiency, low operating costs and excellent resale value,” said Harry Wolters, DAF president. “DAF’s above 16-tonne market share was a strong 16.4% through the first three quarters of this year.” It is estimated that European truck industry registrations in the above 16-tonne segment will be in the range of 310,000-320,000 units this year, one of the best markets in history. The 2020 truck market is expected to be in the range of 260,000-290,000 trucks.\n\nThe South American above 16-tonne truck market is projected to be in a range of 95,000-105,000 vehicles this year, and in a range of 100,000-110,000 trucks in 2020. “Customer demand for DAF and Kenworth trucks has resulted in a 79% increase in deliveries in South America this year,” said Marco Davila, PACCAR vice president. The Brasilian portion of the above 16-tonne truck market is projected to be in the range of 65,000-75,000 vehicles in 2019, and a range of 70,000-80,000 trucks in 2020.\n\nPACCAR Parts Achieves Excellent Profits and Opens New TRP Stores \n\nPACCAR Parts achieved outstanding pre-tax profit of $207.4 million in the third quarter of 2019, 10% higher than the $188.5 million earned in the third quarter of 2018. Third quarter 2019 revenues were $1.00 billion, 4% higher than the $960.1 million achieved in the third quarter last year. PACCAR Parts achieved pre-tax profit of $625.6 million in the first nine months of 2019, compared to $574.8 million in the first nine months of 2018. PACCAR Parts’ nine-month revenues were $3.03 billion, compared to $2.87 billion for the same period last year. David Danforth, PACCAR vice president and PACCAR Parts general manager, noted, “PACCAR Parts’ outstanding financial results have been driven by investments in new parts distribution centers (PDCs), innovative programs such as national fleet services, e-commerce and a growing population of PACCAR MX engines. PACCAR Parts’ new 250,000 square-foot PDC in Las Vegas, Nevada, and 160,000 square-foot PDC in Ponta Grossa, Brasil, will open in 2020.”\n\nDAF, Kenworth and Peterbilt dealers have opened nearly 200 TRP retail stores, which provide high quality aftermarket products and services to owners of all makes of light-, medium- and heavy-duty trucks, trailers, buses and engines. TRP stores are located close to customers in order to provide fast delivery, comprehensive parts selection and technical expertise for all brands of trucks. Fifty percent of the customers at TRP stores are new to PACCAR. The first TRP store opened in 2013, and there are now retail stores in Europe, North America, South America, Australia, Asia and Africa. “TRP stores increase the aftermarket parts opportunity available to PACCAR and its dealers,” commented Darrin Siver, PACCAR senior vice president.\n\nCapital Investment and Research and Development\n\nPACCAR’s excellent long-term profits, strong balance sheet and intense focus on quality have enabled the company to invest $6.6 billion in new and expanded facilities, innovative products and new technologies during the past decade. Capital investments are estimated to be $675-$725 million and research and development expenses are expected to be $325-$335 million in 2019. PACCAR estimates that it will invest $625-$675 million in capital projects and $320-$350 million in research and development expenses in 2020.\n\n“The company is investing in aerodynamic truck models, integrated powertrains including diesel, electric, hybrid, and hydrogen fuel cell technologies, as well as advanced driver assistance systems, digital services and next-generation manufacturing capabilities,” said Harrie Schippers, PACCAR president and chief financial officer.\n\nThe DAF CF Electric truck was honored as the “Green Truck Logistics Solution” for 2019 at the Transport Logistic trade fair in Munich, Germany by the leading German trade magazines VerkehrsRundschau and TRUCKER. The prestigious award recognizes the deployment of advanced technologies for innovative, sustainable logistics. The Port of Duisburg in Germany is testing DAF CF Electric trucks in its operations.\n\nPACCAR Earns Diversity Award\n\nKenworth, Peterbilt and PACCAR Parts were each honored by the Women In Trucking Association (WIT) as a “Top Company to Work for.” The recognition was for having a culture that fosters gender diversity as well as providing employees with an excellent work environment. WIT is a nonprofit organization that encourages the employment and promotes the accomplishments of women in the trucking industry.\n\nFinancial Services Companies Achieve Good Results \n\nPACCAR Financial Services (PFS) offers competitive retail financing to Peterbilt, Kenworth and DAF dealers and customers. PFS has a portfolio of 205,000 trucks and trailers, with record total assets of $15.61 billion. PacLease, a major full-service truck leasing company in North America and Europe, with a fleet of 39,000 vehicles, is included in this segment.\n\nPFS achieved good profits during the third quarter and first nine months of 2019. PFS earned $66.5 million in the third quarter this year compared to $78.8 million earned in the same period last year. Third quarter 2019 revenues were $362.8 million compared to $339.9 million in the same quarter of 2018. For the nine-month period, PFS pre-tax income was $230.8 million in 2019 compared to $218.7 million last year. Nine-month revenues were $1.07 billion in 2019 compared with $1.01 billion for the same period a year ago. “PFS’ high quality portfolio delivers excellent profits to PACCAR and benefits dealers in new and used truck transactions,” said Todd Hubbard, PACCAR vice president. “Kenworth and Peterbilt truck resale values command a 10-15% premium over competitors’ trucks.”\n\n“PFS provides leading-edge technology solutions, excellent customer service and dedicated support to the transportation industry. Kenworth, Peterbilt and DAF dealers and customers appreciate the ease of doing business with PFS,” said Craig Gryniewicz, PACCAR Financial Corp. president. PACCAR’s strong balance sheet, complemented by its A+/A1 credit ratings, enables PFS to have excellent access to the commercial paper and medium-term note markets. PFS profitably supports the sale of PACCAR trucks in 25 countries on four continents.\n\nPACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced diesel engines, provides financial services and information technology, and distributes truck parts related to its principal business.\n\nPACCAR will hold a conference call with securities analysts to discuss third quarter earnings on October 22, 2019, at 9:00 a.m. Pacific time. Interested parties may listen to the call by selecting “Q3 Earnings Webcast” at PACCAR’s homepage. The Webcast will be available on a recorded basis through October 29, 2019. PACCAR shares are listed on the NASDAQ Global Select Market, symbol PCAR. Its homepage is www.paccar.com.\n\nThis release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act. These statements are based on management’s current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from those included in these statements due to a variety of factors. More information about these factors is contained in PACCAR’s filings with the Securities and Exchange Commission.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005385/en/\nKen Hastings\n(425) 468-7530\nken.hastings@paccar.com\nSource: PACCAR"
    },
    {
        "title": "PACCAR Declares Regular Quarterly Cash Dividend",
        "subtitle": "",
        "date": "Sep 11, 2019 9:40AM EDT",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nPACCAR Inc’s (Nasdaq: PCAR) Board of Directors today declared a regular quarterly cash dividend of thirty-two cents ($.32) per share, payable on December 3, 2019, to stockholders of record at the close of business on November 12, 2019.\n\nPACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced diesel engines, provides financial services and information technology, and distributes truck parts related to its principal business. PACCAR shares are listed on the NASDAQ Global Select market, symbol PCAR. Its homepage is www.paccar.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190911005495/en/\nKen Hastings\n(425) 468-7530\nSource: PACCAR Inc"
    }
]