[
    {
        "title": "Ten Female Entrepreneurs Chosen to Participate in Inaugural WomanMade Expo West Challenge with $100,000 in Business Grants at Stake",
        "subtitle": "",
        "date": "Feb 26, 2020 9:37AM EST",
        "content": "PLANO, Texas, Feb. 26, 2020 /PRNewswire/ -- Today Frito-Lay has unveiled the 10 finalists in its inaugural WomanMade Expo West Challenge, in which female entrepreneurs will pitch their business plans in a live, rapid-fire format to industry experts for a chance to win from $100,000 in business grants. The WomanMade Expo West Challenge, a PepsiCo initiative dedicated to advancing female-founded businesses in the food and beverage industry, will take place at Natural Products Expo West on Friday, March 6 from 7:30-9:30 a.m. PT in the Marriot Convention Center, Marquis Northwest. The Challenge is open to any credentialed attendees of Expo West who would like to learn more about the 10 finalists, all female founders whose businesses have $500,000 in annual revenue and rose to the top with their commitment to innovation and social impact. The 10 finalists of the inaugural WomanMade Expo West Challenge are:\"We were blown away by the 100+ submissions we received for our inaugural WomanMade challenge, and while it was difficult to narrow down the outstanding work being done by women in the food and beverage industry, the 10 women we've selected as finalists are so deserving of the recognition,\" said Ciara Dilley, vice president of transform brands & portfolio innovation at Frito-Lay. \"Dedicated to championing diversity and inclusion, our entire WomanMade team is proud to do our part in providing much-needed support to female founders as they scale their businesses. We're honored to highlight these women as they continue to be a driving force in our industry.\" Each of the finalists will have five minutes to present their business plans, immediately followed by up to five minutes for a Q&A session with the judging panel comprised of PepsiCo executives and fellow entrepreneurs, including:The top three winners of the WomanMade Expo West Challenge will be announced live on-site and will receive $50,000, $30,000 and $20,000 grants, respectively. Additionally, in partnership with Alice, a free multi-channel platform that helps New Majority Entrepreneurs, all applicants will receive support for their business through the WomanMade Community on Alice, as well as tickets to Alice's Business for All conferences in 2020.The number of women-owned businesses grew 58% between 2007 and 2018, and by 46% in terms of revenue, according to research from American Express. A study conducted by Mass Challenge and BCG also found that businesses founded by women deliver higher revenue – more than two times as much per dollar invested – than those founded by men. However according to PitchBook Data Inc., of all venture capitalist funding invested in 2018, only 2.2% was given to female-founded companies and only 0.2% went to diverse female entrepreneurs. Additionally, research shows that female entrepreneurs often have less access than male counterparts to the tools and resources they need to launch and sustain successful businesses. For more information about WomanMade, please visit www.helloalice.com/communities/womanmade-by-pepsico. To learn more about Frito-Lay, please visit www.fritolay.com. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $67 billion in net revenue in 2019, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 23 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.com View original content to download multimedia:http://www.prnewswire.com/news-releases/ten-female-entrepreneurs-chosen-to-participate-in-inaugural-womanmade-expo-west-challenge-with-100-000-in-business-grants-at-stake-301011295.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "Amy Poehler And Pure Leaf Iced Tea Teach Us The Art Of No-ing With A New Purpose-Led Campaign",
        "subtitle": "",
        "date": "Feb 26, 2020 9:00AM EST",
        "content": "PURCHASE, N.Y., Feb. 26, 2020 /PRNewswire/ -- PepsiCo, Inc. (NASDAQ: PEP) - Pure Leaf, the premium iced tea brand that believes there is no shortcut to making exceptional iced tea, unveils its first-ever purpose-driven campaign: \"No Is Beautiful.\"  The campaign is derived from and celebrates the way Pure Leaf embraces the word 'no' when brewing iced tea. The brand says no to artificial flavors, no to tea powders and concentrate, and no to anything that doesn't make Pure Leaf taste better. \"No Is Beautiful\" aims to inspire people to say \"no\" to the things that do not matter in tea and in life, so they can say \"yes\" to more of the things that do.  Experience the interactive Multichannel News Release here: https://www.multivu.com/players/English/8687151-pure-leaf-amy-poehler-no-is-beautiful/ New research conducted by Pure Leaf reveals that always saying yes and over-committing is a major problem, where almost 70% of both men and women revealed feeling some pressure, especially in their professional lives. This burden is leading to unprecedented stress, particularly for women, half of whom revealed that they don't feel empowered to say no to things in their professional lives, while only a third (34%) of men share the same sentiment. Almost all women, 85%, agreed that taking on too many tasks negatively affects their quality of life and 86% agreed that being able to simply say no to more undesired asks would feel liberating. \"Saying no is at the heart of how we brew our iced tea,\" said Katrina McDonald, Senior Director, Pepsi Lipton Partnership. \"At Pure Leaf we embrace the beauty of saying no, but also understand that today's society operates differently. To-do lists grow and there is overwhelming pressure to say yes to everything and do it all. We wanted this campaign to remind people that saying 'yes' to more 'no' isn't always a bad thing because no is beautiful.\" While the brand can't check off every item on everyone's to do list, Pure Leaf understands the importance of starting somewhere. The brand is fully committed to helping normalize \"no\" in order to say \"yes\" to what really matters and the \"No Is Beautiful\" campaign is already coming to life in the following ways:360-Marketing Efforts: In addition to a 60-second TV ad currently on-air narrated by Amy Poehler (produced by DDB), Poehler also worked with Pure Leaf to launch a light-hearted digital series titled, Once Upon a No, which reimagines classic fairy tales to show how the word \"no\" can be beautiful. The series was directed by Poehler's friend and former co-star, Rashida Jones, and debuts today in honor of National Tell a Fairy Tale Day. Out of home advertising and in-store retail amplifications will also cleverly depict the campaign message.\"There are times when I love the power of no, so of course I was happy to be part of this campaign when Pure Leaf shared it with me,\" said actor and producer Amy Poehler. \"The Once Upon a No videos are a fun way to show how you can change the outcome of an entire story with just one word, and getting the chance to be directed by my beautiful wife Rashida Jones put it over the top for me. Ironically, when Pure Leaf approached us both, it was easy to say yes!\"In celebration of \"No Is Beautiful\" and Once Upon a No, fans are also invited to rewrite and imagine their own fairy tale for a chance to win an illustrated version, and a once-in-a-lifetime fairy tale adventure.  For official details and rules, visit www.OnceUponANo.com.For consumers in New York City today, on National Tell a Fairy Tale Day, Pure Leaf will host an interactive experience in Times Square to submit a uniquely personal, re-written fairy tale on-site for a chance to appear on a jumbotron billboard in Times Square. Top-notch Innovation: New Pure Leaf Cold Brew iced tea, which utilizes a \"no rush\" approach, hits shelves in early March. Its brewing time is three times longer, resulting in a smoother tasting iced tea. Sundance Film Festival attendees were able to get an exclusive taste of Pure Leaf Cold Brew iced tea at this year's festival and beginning in March, Cold Brew will be available at retailers nationwide in three flavors: Slightly Sweet Black Tea, Slightly Sweet Black Tea with Mango, and Unsweetened.Pure Leaf Herbal Iced Teas are also adding two new delicious flavors that will hit store shelves in March: Unsweetened Hibiscus Mango, and Raspberry Chamomile. Masterfully crafted and made from real-brewed herbal tea leaves, these new tea blends say no to caffeine and yes to flavor.Like-Minded Ambassadors: Pure Leaf will continue to partner with like-minded ambassadors like Poehler, including bestselling author of Fair Play, Eve Rodsky, to amplify the campaign message and offer resources for time management and prioritization.Internal Mindset: The brand is working closely with Human Resource leaders within the Pepsi Lipton Partnership on ways of working that both reflect and encourage the \"say 'yes' to more 'no'\" spirit both personally and professionally. To learn more about Pure Leaf and No Is Beautiful, please visit www.pureleaf.com, and find us on Facebook, Instagram, Twitter and YouTube at @pureleaf. Research Methodology Pure Leaf partnered with Ipsos to conduct a poll between November 25 - December 3, 2019. For this survey, a sample of roughly 2,661 adults age 18+ from the continental U.S., Alaska, and Hawaii was interviewed online in English. The sample includes 1,012 males, 1,649 females. This study had a credibility interval adjusted for design effect of the following (n=2,661, adjusted Confidence Interval=+/-3.7 percentage points). Additionally, the poll has a credibility interval or plus or minus 3.5 percentage points for males, plus or minus 2.8 percentage points for females. About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $67 billion in net revenue in 2019, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 23 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.comAbout Unilever North AmericaUnilever is one of the world's leading suppliers of Beauty & Personal Care, Home Care, and Foods & Refreshment products with sales in over 190 countries and reaching 2.5 billion consumers a day. In the United States and Canada, the portfolio includes brand icons such as: Axe, Ben & Jerry's, Breyers, Degree, Dollar Shave Club, Dove, Hellmann's, Klondike, Knorr, Lever 2000, Lipton, Love Beauty and Planet, Magnum, Nexxus, Noxzema, Pond's, Popsicle, Pure Leaf, Q-tips, Seventh Generation, Simple, Sir Kensington's, St. Ives, Suave, Talenti Gelato & Sorbetto, TAZO, TIGI, TRESemmé and Vaseline. All of the preceding brand names are trademarks or registered trademarks of the Unilever Group of Companies. Unilever's Sustainable Living Plan (USLP) underpins the company's strategy and commits to: The USLP creates value by driving growth and trust, eliminating costs and reducing risks. In 2018, the company's Sustainable Living Brands grew 69% faster than the rest of the business, compared to 46% in 2017.Since 2010 we have been taking action through the Unilever Sustainable Living Plan to help more than a billion people improve their health and well-being, halve our environmental footprint and enhance the livelihoods of millions of people as we grow our business. We have already made significant progress and continue to expand our ambition – most recently committing to ensure 100% of our plastic packaging is fully reusable, recyclable or compostable by 2025. While there is still more to do, we are proud to have been recognized in 2018 as sector leader in the Dow Jones Sustainability Index and as the top ranked company in the GlobeScan/SustainAbility Global Corporate Sustainability Leaders survey, for the eighth-consecutive year.  For more information on Unilever U.S. and its brands visit: www.unileverusa.com For more information on Unilever Canada and its brands visit: www.unilever.ca For more information on the USLP: www.unilever.com/sustainable-living/Media Contacts: Rena Daum (Manager Brand Communications, PepsiCo Beverages)rena.daum@pepsico.com Sarah Ingram, Golin singram@golin.com  213-335-5543      View original content:http://www.prnewswire.com/news-releases/amy-poehler-and-pure-leaf-iced-tea-teach-us-the-art-of-no-ing-with-a-new-purpose-led-campaign-301011715.htmlSOURCE  PepsiCo, Inc."
    },
    {
        "title": "Lay's Partners With NBC'S \"The Voice\" And Coach John Legend To Debut Team Of Flavors Sure To Make Chairs Turn",
        "subtitle": "",
        "date": "Feb 24, 2020 8:00AM EST",
        "content": "PLANO, Texas, Feb. 24, 2020 /PRNewswire/ -- When fans tune into Season 18 of NBC's \"The Voice\" this spring to discover the newest talent to hit the stage, they'll also discover an assortment of delicious new chip flavors from the Lay's® brand. Lay's Cheddar Jalapeño, Lay's Poppables® Sea Salt & Vinegar, and Lay's Kettle Cooked Flamin' Hot® all joined Team Lay's earlier this year – and to celebrate Lay's partnership with \"The Voice,\" the brand is also re-introducing Lay's Crispy Taco and Lay's Wavy Fried Green Tomato chip flavors, available for a limited time only.Together with John Legend, Lay's will be inviting fans to enter for a chance to win exclusive prizes – including a trip to see a live taping of \"The Voice\" in Los Angeles. Beginning March 2 through April 17, fans can visit www.LaysAndTheVoice.com to answer a weekly trivia question pertaining to each week's episode of \"The Voice\", enter an on-pack code from participating bags of Lay's, and learn about more ways to enter for a chance to win.\"I'm excited to partner with Lay's to launch these fun new flavors and to give the wonderful fans of 'The Voice' the opportunity to come share in the fun of the live show!\" said Legend. All the newest Lay's flavors are on shelves nationwide:Season 18 of NBC's \"The Voice\" premieres on Monday, Feb. 24 (8:00-10:00pm ET/PT on NBC). For more information on Lay's newest flavors and how fans can enter to win exclusive prizes from Lay's and the hit show, visit www.LaysAndTheVoice.com. NO PURCHASE NECESSARY. Open to 50 US/DC, 18+ (19+ for AL/NE). Void where prohibited. Ends 4/17/20. Rules: LaysAndTheVoice.com.About Lay's Lay's is one of the brands that makes up Frito-Lay North America, the $15 billion convenient foods division of PepsiCo, Inc. (Nasdaq: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/, the Snack Chat blog, http://www.snacks.com/ and on Twitter http://www.twitter.com/fritolay. Learn more about Lay's by visiting www.facebook.com/lays or on Twitter at www.twitter.com/lays. You can also follow Lay's on Instagram by visiting http://instagram.com/lays.About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $67 billion in net revenue in 2019, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 23 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.comAbout NBC Entertainment  NBC Entertainment develops and schedules the network's primetime, late night and daytime programming. NBC's quality programs and balanced lineup have earned the network critical acclaim, numerous awards and ratings success. NBC has won the last six September-September 52-week seasons in the 18-49 demo, and for the 2018-19 season, also ranked #1 counting entertainment programs only, scripted programs only and alternative programs only.NBC has earned more Emmy Awards than any network in television history.NBC's 2019-20 drama slate is highlighted by pop culture phenomenon \"This Is Us,\" second-year hit series \"Manifest\" and \"New Amsterdam\"; the Windy City trifecta of \"Chicago Fire,\" \"Chicago Med\" and \"Chicago P.D.\"; the record-breaking 21st season of \"Law & Order: Special Victims Unit,\" James Spader-starrer \"The Blacklist,\" \"Blindspot\" and \"Good Girls,\" as well as new additions \"Zoey's Extraordinary Playlist,\" \"Lincoln Rhyme: Hunt for the Bone Collector\" and \"Council of Dads.\" NBC's current comedy lineup includes the final season of \"Will & Grace,\" \"Superstore,\" \"Brooklyn Nine-Nine\" and newcomers \"Perfect Harmony\" and \"Indebted.\"Unscripted series for NBC include four-time Emmy Award-winning musical competition hit \"The Voice,\" perennial #1 most-watched summer series \"America's Got Talent\" and its winter companion \"America's Got Talent: The Champions,\" summer hit series \"Songland,\" four-time Emmy nominee \"American Ninja Warrior,\" \"Ellen's Game of Games,\" the Melissa McCarthy-led \"Little Big Shots,\" \"The Titan Games,\" \"World of Dance,\" \"Making It,\" \"Hollywood Game Night\" and \"The Wall.\"In late night, NBC regularly delivers #1 broadcast results with \"The Tonight Show Starring Jimmy Fallon,\" \"Late Night with Seth Meyers,\" \"Saturday Night Live\" and its newest entry in the daypart, \"A Little Late with Lilly Singh.\" NBC daytime's \"Days of our Lives\" consistently ranks among daytime's top programs in the valuable women 18-34 category. The five-time Emmy Award-winning NBC.com streams full episodes and provides original content for NBC entertainment shows online and through apps for mobile and tablet devices.  View original content to download multimedia:http://www.prnewswire.com/news-releases/lays-partners-with-nbcs-the-voice-and-coach-john-legend-to-debut-team-of-flavors-sure-to-make-chairs-turn-301009646.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "Nico Young Named 2019-20 Gatorade® National Boys Cross Country Runner of the Year",
        "subtitle": "",
        "date": "Feb 20, 2020 1:50PM EST",
        "content": "NEWBURY PARK, Calif., Feb. 20, 2020 /PRNewswire/ -- In its 35th year of honoring the nation's most elite high school athletes, The Gatorade Company today announced Nico Young of Newbury Park High School in Newbury Park, Calif. is the 2019-20 Gatorade National Boys Cross Country Runner of the Year. Young won the prestigious award for his accomplishments on and off the field, joining an impressive group of former Gatorade National Boys Cross Country Runner of the Year winners who have combined for 18 National Championships.Young was surprised with the award in front of teammates, coaches, friends and family at his school. Check out a video of the announcement here. The award, which recognizes not only outstanding athletic excellence, but also high standards of academic achievement and exemplary character demonstrated on and off the field, distinguishes Young as the nation's best high school boys cross country runner. A national advisory panel comprised of sport-specific experts and sports journalists helped select Young from nearly 300,000 high school boys cross country runners nationwide. Competition for the national award is fierce. Young topped the list of 51 state winners in boys cross country who have an incredible list of accomplishments including 15 All-Americans. Of this year's winners, 84% percent of the seniors will be on scholarship this fall, more than 20 with a GPA of 4.0 or higher and over 30 volunteering with at least two organizations. Young is now a finalist for the most prestigious award in high school sports, the Gatorade Male High School Athlete of the Year award, which is announced at a special ceremony prior to The ESPY Awards in July.\"Nico Young didn't shy away from setting lofty goals for both himself and his Newbury Park teammates this past season,\" said Erik Boal, editor for DyeStat.com. \"Those grand ambitions were not only met, but often exceeded during one of the most dominant seasons in high school cross country history. Although he raced fewer times than most of the country's top athletes last fall, he established a new meet or division standard in seven of eight outings, including the national 3-mile cross country record at the Woodbridge Classic, along with the best 5K performance in Nike Cross Nationals history to win a national championship and lead the Panthers to the national team title.\"The 5-foot-11, 135-pound senior raced to the national championship this past season, breaking the tape at the Nike Cross Nationals Final with a course-record time of 14:52.3 and leading the Panthers to the national title as a team. Young also won the Division 2 CIF state championship in 14:26.5. He also set a U.S. prep three-mile record of 13:39.7 last fall in winning the Woodbridge Classic and and broke the tape at the Southern Section finals, the Marmonte League finals and the Clovis Invitational. Moreover, Young has volunteered locally for three summers in a row as a camp assistant at Many Mansions for underprivileged youth. He has accomplished these athletic feats, all while maintaining a 4.68 GPA in the classroom.\"Nico Young was selected as this year's Gatorade National Boys Cross Country Runner of the Year because of his achievements on and off the field,\" said Gatorade Senior Vice President and General Manager Brett O'Brien. \"It is a prestigious honor and we're excited to see what is next for this impressive student-athlete.\"Through Gatorade's cause marketing platform \"Play it Forward,\" Young has the opportunity to award a $1,000 grant to a local or national youth sports organization of his choosing. He is also eligible to submit an essay to win one of twelve $10,000 spotlight grants for the organization of choice, which will be announced throughout the year.  Each year a selection committee evaluates the nation's top talent in the District of Columbia and all 50 states, choosing national winners in 12 different sports: football, girls volleyball, boys and girls cross country, boys and girls basketball, baseball, softball, boys and girls soccer, and boys and girls track and field. From the 12 national winners, one male and one female athlete are each named Gatorade High School Athlete of the Year. Since the program's inception in 1985, Gatorade Player of the Year award recipients have won hundreds of professional and college championships, and many have also turned into pillars in their communities, becoming coaches, business owners and educators. Previous winners include a distinguished list of athletes, such as Peyton Manning, Abby Wambach, Karl-Anthony Towns, Derek Jeter and many other sports icons. To learn more about the Gatorade Player of the Year program, check out past winners or to nominate student-athletes, visit www.Gatorade.com/POY, on Facebook at www.facebook.com/GatoradePOY or follow us on Twitter at www.twitter.com/Gatorade. About GatoradeThe Gatorade Company, a division of PepsiCo (NASDAQ: PEP), meets the needs of consumers who participate in Sports and Fitness, through brands that include Gatorade, Propel, Muscle Milk and Bolt24. The solutions they provide are driven by a deep understanding of the unique needs and occasions of different types of sports and fitness. Gatorade, their marquee brand, is underpinned by more than 50-year history of studying the best athletes in the world and sports-nutrition research by the Gatorade Sport Science Institute, allowing it to provide scientifically-formulated products that meet athletes' needs both on and off the field. For more information and a full list of products, please visit www.gatorade.com. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.At the heart of PepsiCo is Performance with Purpose – our fundamental belief that the success of our company is inextricably linked to the sustainability of the world around us. We believe that continuously improving the products we sell, operating responsibly to protect our planet and empowering people around the world enable PepsiCo to run a successful global company that creates long-term value for society and our shareholders. For more information, visit www.pepsico.com.    View original content:http://www.prnewswire.com/news-releases/nico-young-named-2019-20-gatorade-national-boys-cross-country-runner-of-the-year-301008642.htmlSOURCE  The Gatorade Company"
    },
    {
        "title": "Ruffles, The Official Chip Of The NBA, And Anthony Davis Team Up For NBA All-Star 2020 To Bring Flavor On And Off The Court",
        "subtitle": "",
        "date": "Feb 12, 2020 10:40AM EST",
        "content": "PLANO, Texas, Feb. 12, 2020 /PRNewswire/ -- Ruffles, the Official Chip of the NBA, is going full-court press as the presenting partner of the NBA All-Star Celebrity Game during All-Star 2020 in Chicago. For the third consecutive year, Ruffles returns with its in-game 4-point RIDGE line to benefit charity – plus a new courtside lounge featuring an appearance by Chicago's own Anthony Davis, who just last month unveiled his Ruffles Lime & Jalapeno chip flavor. \"The RIDGE\" 4-point line, which resembles the ridges in Ruffles potato chips, has amped up the star-studded game since its All-Star debut in 2018. For every shot made at \"The RIDGE\" this year, Ruffles will donate $4,000 dollars to the Special Olympics to foster environments of acceptance and inclusion in sports, with a minimum total donation of $40,000. \"NBA All-Star is the ultimate celebration of basketball culture – from fashion and music to the celebrities and athletes converging in the host city. Ruffles is proud to add our flavor thanks to our longstanding relationship with the NBA and partnership with Chicago's own Anthony Davis,\" said Sadira Furlow, vice president of marketing, Frito-Lay North America. \"Athletes and fans alike have enjoyed how the 4-point 'RIDGE' line makes this weekend unique, and we're aiming for more of the same with the VIP courtside lounge, while continuing to support the Special Olympics' mission.\"The all-new Ruffles Celebrity Game Lounge will host fans' favorite basketball-loving celebrities and influencers for an up-close and in-style view of the game or even get in on the action themselves with fun activities like cornhole. Off the court and in the local community, Ruffles, in partnership with 2KFoundations, will be dedicating a refurbished and redesigned basketball court to the Valentine Boys & Girls Club of Chicago. With the backdrop of NBA All-Star 2020, the new basketball court is a way to empower and inspire youth in the South Side of Chicago who come to Valentine Boys & Girls Club for a safe place to learn lifelong skills while having fun in a caring environment. ESPN will exclusively televise the 2020 NBA All-Star Celebrity Game presented by Ruffles on Friday, February 14, at 7 p.m. ET. The event will take place at the Wintrust Arena in Chicago, Ill. For more information, visit Ruffles.com or follow @Ruffles on Facebook, Instagram, and Twitter.About RufflesRuffles is one of many Frito-Lay North America brands – the $16 billion convenient foods division of PepsiCo, Inc. (NASDAQ: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/, the Snack Chat blog, http://www.snacks.com/ and on Twitter http://www.twitter.com/fritolay.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com. View original content:http://www.prnewswire.com/news-releases/ruffles-the-official-chip-of-the-nba-and-anthony-davis-team-up-for-nba-all-star-2020-to-bring-flavor-on-and-off-the-court-301003794.htmlSOURCE  Frito-Lay"
    },
    {
        "title": "Record-Breaking Katelyn Tuohy Earns Fifth Gatorade® National Player of the Year Award",
        "subtitle": "",
        "date": "Feb 6, 2020 5:42PM EST",
        "content": "THIELLS, N.Y., Feb. 6, 2020 /PRNewswire/ -- In its 35th year of honoring the nation's most elite high school athletes, The Gatorade Company today announced Katelyn Tuohy of Rockland North High School in Thiells, N.Y. is the 2019-20 Gatorade National Girls Cross Country Runner of the Year. Truly an incredible feat, Tuohy is now the winningest Gatorade Player of the Year of all time, racking up a record-breaking five national awards (2017-18, 2018-19 and 2019-20 Gatorade National Girls Cross Country Runner of the Year, 2017-18 Gatorade National Track & Field Athlete of the Year and 2018 Gatorade Female Athlete of the Year). Tuohy won the prestigious award for her accomplishments on and off the field, joining an impressive group of former Gatorade National Girls Cross Country Runner of the Year winners who have combined for seven National Championships and five bronze medals.Tuohy was surprised with the award in front of teammates, coaches, friends and family at her school. Check out a video of the announcement here. The award, which recognizes not only outstanding athletic excellence, but also high standards of academic achievement and exemplary character demonstrated on and off the field, distinguishes Tuohy as the nation's best high school girls cross country runner. A national advisory panel comprised of sport-specific experts and sports journalists helped select Tuohy from nearly half a million high school girls cross country runners nationwide. Competition for the national award is fierce. Tuohy topped the list of 51 state winners in girls cross country who have an incredible list of accomplishments, including 14 All-America, 7 multi-sport standouts, 24 with a GPA of 4.0 or higher and over 35 girls volunteering with at least two organizations. Tuohy is now a finalist for the most prestigious award in high school sports, the Gatorade Female High School Athlete of the Year award, which is announced at a special ceremony after the ESPY Awards in July.\"Katelyn Tuohy has risen to become the gold standard during what has become the golden age of female distance running,\" says Rich Gonzalez, Nike Cross Nationals Meet Director. \"She's the undisputed queen of cross country, and her perfect three-year results along with a long list of course records is beyond compare. At a time when our sport has been flooded with record participation numbers and corresponding historic levels of achievement, she has risen from the crowd to become the best ever. Her high character, class and charisma have inspired legions of fans, opponents and future champions.\"The 5-foot-4 senior raced to her third consecutive Nike Cross Nationals championship this past season, breaking the tape with a time of 17:18.4. The 2018 and 2019 Gatorade National Girls Cross Country Runner of the Year, Tuohy also won the Class A individual state championship in 15:36.5 and finished first at the NXR New York Regional championships in 17:06.6. Unbeaten against high school competition at 5K for the third straight season, she also earned victories at the Section 1 championships, the Great American Cross Country Festival, the Manhattan Invitational and the New York Federation championships.Tuohy has volunteered locally on behalf of youth soccer and running programs, in addition to donating her time to the Rose Memorial Library. This past summer, Katelyn was a daily participant—and a huge draw— at the Rockland County Track & Field Clinic for ages 4-13. She was present every day of the clinic and would run with kids, encourage them in all their events, and take pictures/sign autographs. \"Katelyn has impressed me so much with the maturity she has shown,\" said North Rockland coach Brian Diglio.  \"It's very easy for an elite athlete to focus mostly on her own performance, but for Katelyn, priority number one has been helping her teammates race to the best of their ability.\" Tuohy has maintained an A average in the classroom. She has signed a National Letter of Intent to compete in cross country and track and field on scholarship at North Carolina State University this fall.\"To determine Gatorade Player of the Year award winners, we look for student-athletes that are exceptional in their sport and who also value academics and community service,\" said Gatorade Senior Vice President and General Manager Brett O'Brien. \"We chose Katelyn Tuohy as this year's award winner because she embodies everything we look for in a Gatorade Player of the Year recipient.\"Through Gatorade's cause marketing platform \"Play it Forward,\" Tuohy has the opportunity to award a $1,000 grant to a local or national youth sports organization of her choosing. She is also eligible to submit an essay to win one of twelve $10,000 spotlight grants for the organization of choice, which will be announced throughout the year.  Each year a selection committee evaluates the nation's top talent in the District of Columbia and all 50 states, choosing national winners in 12 different sports: football, girls volleyball, boys and girls cross country, boys and girls basketball, baseball, softball, boys and girls soccer, and boys and girls track and field. From the 12 national winners, one male and one female athlete are each named Gatorade High School Athlete of the Year. Since the program's inception in 1985, Gatorade Player of the Year award recipients have won hundreds of professional and college championships, and many have also turned into pillars in their communities, becoming coaches, business owners and educators. Previous winners include a distinguished list of athletes, such as Peyton Manning, Abby Wambach, Karl-Anthony Towns, Derek Jeter and many other sports icons. To learn more about the Gatorade Player of the Year program, check out past winners or to nominate student-athletes, visit www.Gatorade.com/POY, on Facebook at www.facebook.com/GatoradePOY or follow us on Twitter at www.twitter.com/Gatorade. About GatoradeThe Gatorade Company, a division of PepsiCo (NASDAQ: PEP), meets the needs of consumers who participate in Sports and Fitness, through brands that include Gatorade, Propel, Muscle Milk and Bolt24. The solutions they provide are driven by a deep understanding of the unique needs and occasions of different types of sports and fitness. Gatorade, their marquee brand, is underpinned by more than 50-year history of studying the best athletes in the world and sports-nutrition research by the Gatorade Sport Science Institute, allowing it to provide scientifically-formulated products that meet athletes' needs both on and off the field. For more information and a full list of products, please visit www.gatorade.com. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.At the heart of PepsiCo is Performance with Purpose – our fundamental belief that the success of our company is inextricably linked to the sustainability of the world around us. We believe that continuously improving the products we sell, operating responsibly to protect our planet and empowering people around the world enable PepsiCo to run a successful global company that creates long-term value for society and our shareholders. For more information, visit www.pepsico.com.  View original content:http://www.prnewswire.com/news-releases/record-breaking-katelyn-tuohy-earns-fifth-gatorade-national-player-of-the-year-award-301000723.htmlSOURCE  The Gatorade Company"
    },
    {
        "title": "Miss Vickie's Awards $50,000 To AJ Shear Of DiBella's Subs As The Grand Prize Winner Of Its PartnerChip Program",
        "subtitle": "",
        "date": "Jan 23, 2020 9:00AM EST",
        "content": "PLANO, Texas, Jan. 23, 2020 /PRNewswire/ -- Miss Vickie's® names AJ Shear of DiBella's Subs as the grand prize winner of the brand's PartnerChip program, earning the small business a $50,000 prize. The announcement celebrates the culmination of the program, launched last year by Miss Vickie's and PepsiCo Foodservice, to support small- and medium-size foodservice operators in addressing their biggest business challenges.While Miss Vickie's has grown tremendously over the past 10 years, it continues its commitment to community and wanted to reaffirm the importance of nurturing local businesses. With this in mind, the PartnerChip program set out to equip store operators with the tools they need to continue growing thriving enterprises.In May 2019, Miss Vickie's kicked off the PartnerChip program by identifying six small business finalists, each hailing from a different part of the U.S., to receive funding for and education on digital media initiatives – a tactic proven to drive traffic. PartnerChip finalists include:The brand and PepsiCo Foodservice hosted the finalists at a Small Business Leader Summit at Frito-Lay headquarters on October 3-4. The finalists engaged in digital and social learnings from PepsiCo executives as well as the company's best-in-class partners like Google during the two-day summit. Through key learnings, all six finalists received hands on education in driving traffic across digital and social, learning directly from the experts. They also received a crash course in the PepsiCo Foodservice Digital Lab, a first-of-its-kind suite of capabilities built to connect foodservice operators with the companies, services, insights, and solutions best-suited for their specific digital and online needs. The Lab connects customers with the latest technology and consumer trends impacting the industry, by combining PepsiCo's wealth of knowledge with cutting edge insights.\"Miss Vickie's PartnerChip program is a project of love – we want to set all of our partners up for success,\" said Arcely Moreno-Mosier, senior director of marketing, PepsiCo Foodservice Foods Division. \"It doesn't stop here, it's part of the commitment we have to helping our PepsiCo Foodservice customers grow by sharing the best of our capabilities with them. We want to hear how they're doing in six months and how we can continue to help them grow their businesses.\"Following the event, each finalist leveraged the learnings from the summit and prepared their own digital media plans. From there, a distinguished panel of judges evaluated their plans and chose the most compelling to receive an additional $50,000 towards their business' growth.DiBella's started as a small, family-run business almost a century ago with a reputation for quality, value and consistency that gradually evolved into an Italian import store and deli. Over time, DiBella's moved away from importing, turning instead to time-honored baking techniques that would produce the classic sub roll for which they're famous. Today, that small, family-run business is 46 stores in six states, still specializing in what they are known for: Quality, exceptional service and awesome bread.\"Challenges in the restaurant industry are universal,\" said AJ Shear, director of marketing for DiBella's. \"What's unique is that PepsiCo Foodservice and Miss Vickie's are putting an emphasis on getting us the tools and resources to deal with those challenges. Our learnings from the summit and the $50,000 award will go a long way to help us continue to build our business.\"For more information about the PartnerChip finalist and our program, please visit www.missvickies.com.About Frito-Lay North AmericaFrito-Lay North America is the $16 billion convenient foods division of PepsiCo, Inc. (NASDAQ: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/ and on Twitter http://www.twitter.com/fritolay.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/miss-vickies-awards-50-000-to-aj-shear-of-dibellas-subs-as-the-grand-prize-winner-of-its-partnerchip-program-300992138.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "Jess Mruzik Named 2019-20 Gatorade® National Volleyball Player of the Year",
        "subtitle": "",
        "date": "Jan 22, 2020 4:16PM EST",
        "content": "FARMINGTON HILLS, Mich., Jan. 22, 2020 /PRNewswire/ -- In its 35th year of honoring the nation's most elite high school athletes, The Gatorade Company today announced Jess Mruzik of Mercy High School in Farmington Hills, Mich. is the 2019-20 Gatorade National Volleyball Player of the Year. Mruzik won the prestigious award for her accomplishments on and off the court joining an impressive group of former Gatorade National Volleyball Player of the Year winners who have combined for 89 gold medals and 13 National Championships. Mruzik was surprised with the award in front of teammates, coaches, friends and family at her school. Check out a video of the announcement here. The award, which recognizes not only outstanding athletic excellence, but also high standards of academic achievement and exemplary character demonstrated on and off the field, distinguishes Mruzik as the nation's best high school volleyball player. A national advisory panel comprised of sport-specific experts and sports journalists helped select Mruzik from nearly half a million high school volleyball players nationwide. Competition for the national award is fierce. Mruzik topped the list of 51 state winners in volleyball who have an incredible list of accomplishments, including 15 All-Americans, 27 All-State, 10 Big Ten committees, 15 with a GPA of 3.8 or higher and 40 volunteering with at least two organizations. Mruzik is now a finalist for the most prestigious award in high school sports, the Gatorade Female High School Athlete of the Year award, which is announced at a special ceremony prior to The ESPY Awards in July.\"I first saw Jess as an eighth grader, when she was dominating older players on the club circuit,\" says John Tawa, Managing Editor for PrepVolleyball.com. \"Not only had she already begun to flash the all-around skillset that overwhelms opponents today, but she also showed the grit and determination that all great athletes possess. Even at a young age, she understood that need to expect more of herself than others because of the extraordinary gifts she owned.\"The state's returning Gatorade Player of the Year and 6-foot-1 senior outside hitter led the Marlins to a 59-1 record and the Division 1 state championship this past season. Mruzik compiled 495 kills, 209 digs, 47 service aces and 19 blocks while posting a dizzying .635 kill percentage and a .540 hitting percentage. The captain of the USA Volleyball Youth National Team, Mruzik missed 16 matches in September while leading Team USA to the gold medal at the FIVB Girls U18 World Championships in Egypt, earning tournament MVP honors in the process. She concluded her prep volleyball career with 2,151 kills.         A member of the Science Club and Spirit Club, Mruzik participated in a community cleanup effort sponsored by Mercy High School and has also donated her time instructing youth players in association with her volleyball club team as well as assisting with her local grade school volleyball program. She has also served as part of a local quilting initiative to benefit children of families in need. Mruzik has maintained a 3.47 GPA in the classroom. She has signed a National Letter of Intent to play volleyball on scholarship at the University of Michigan this fall, though she matriculated at Ann Arbor on Jan. 9.\"Gatorade Player of the Year is the most prestigious award in high school sports and recognizes only the best and brightest,\" said Gatorade Senior Vice President and General Manager Brett O'Brien. \"We selected Jess Mruzik not only for her athletic talent, but also for outstanding academic achievement and exemplary character.\"Through Gatorade's cause marketing platform \"Play it Forward,\" Mruzik has the opportunity to award a $1,000 grant to a local or national youth sports organization of her choosing. She is also eligible to submit an essay to win one of twelve $10,000 spotlight grants for the organization of choice, which will be announced throughout the year.  Each year a selection committee evaluates the nation's top talent in the District of Columbia and all 50 states, choosing national winners in 12 different sports: football, girls volleyball, boys and girls cross country, boys and girls basketball, baseball, softball, boys and girls soccer, and boys and girls track and field. From the 12 national winners, one male and one female athlete are each named Gatorade High School Athlete of the Year. Since the program's inception in 1985, Gatorade Player of the Year award recipients have won hundreds of professional and college championships, and many have also turned into pillars in their communities, becoming coaches, business owners and educators. Previous winners include a distinguished list of athletes, such as Peyton Manning, Abby Wambach, Karl-Anthony Towns, Derek Jeter and many other sports icons. To learn more about the Gatorade Player of the Year program, check out past winners or to nominate student-athletes, visit www.Gatorade.com/POY, on Facebook at www.facebook.com/GatoradePOY or follow us on Twitter at www.twitter.com/Gatorade. About GatoradeThe Gatorade Company, a division of PepsiCo (NASDAQ: PEP), meets the needs of consumers who participate in Sports and Fitness, through brands that include Gatorade, Propel, Muscle Milk and Bolt24. The solutions they provide are driven by a deep understanding of the unique needs and occasions of different types of sports and fitness. Gatorade, their marquee brand, is underpinned by more than 50-year history of studying the best athletes in the world and sports-nutrition research by the Gatorade Sport Science Institute, allowing it to provide scientifically-formulated products that meet athletes' needs both on and off the field. For more information and a full list of products, please visit www.gatorade.com. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.At the heart of PepsiCo is Performance with Purpose – our fundamental belief that the success of our company is inextricably linked to the sustainability of the world around us. We believe that continuously improving the products we sell, operating responsibly to protect our planet and empowering people around the world enable PepsiCo to run a successful global company that creates long-term value for society and our shareholders. For more information, visit www.pepsico.com.    View original content:http://www.prnewswire.com/news-releases/jess-mruzik-named-2019-20-gatorade-national-volleyball-player-of-the-year-300991674.htmlSOURCE  The Gatorade Company"
    },
    {
        "title": "Frito-Lay U.S. Snack Index Reveals Nearly All Super Bowl LIV Viewers Expect Snacks for the Big Game",
        "subtitle": "",
        "date": "Jan 22, 2020 9:00AM EST",
        "content": "PLANO, Texas, Jan. 22, 2020 /PRNewswire/ -- As fans prep their platters for the Super Bowl, Frito-Lay today announced findings from its latest U.S. Snack Index, a poll focused on Super Bowl snacking habits, and the results are clear – snacking is an essential part of the game day experience as nearly eight in 10 Americans expect snacks, such as chips and pretzels, to be available at a Super Bowl event. Retail sales data shows Super Bowl Sunday is the biggest day of the year for salty snacks, generating approximately $520 million in one day. Historically, Frito-Lay produces approximately 600 million pounds of snacks in the six weeks leading up to the game – nearly 20 percent of its annual snack production – and more than 67 million pounds of snacks the week of Super Bowl. Potato chips and tortilla chips are the most sought-after snacks with 70 percent of Super Bowl watchers – up four points from the 2019 U.S. Snack Index – expecting potato chips to be available at a Super Bowl event, followed by tortilla chips (54 percent vs. 52 percent in 2019). \"The Super Bowl is ingrained in American culture and a top week for the business of snacks,\" said Mike Del Pozzo, senior vice president of sales and chief customer officer, Frito-Lay North America. \"For Frito-Lay, the Super Bowl is a cross-functional effort involving our sales, operations and marketing teams to ensure consumers have the best Super Bowl experience. Our U.S. Snack Index is just one of the ways we keep a pulse on how consumers are snacking for Super Bowl, and we're always excited to see the evolving trends around the biggest salty snacks day of the year.\"Key insights from the annual U.S. Snack Index around Super Bowl snacking include: Given the heightened demand and excitement around Super Bowl, Frito-Lay has increased its marketing investment to support its multitude of new innovations this year. Launching its first-ever portfolio Super Bowl advertising campaign staring NFL legends Deion Sanders, Michael Irvin, Tony Gonzalez and Terry Bradshaw to get consumers \"Ready for Crunchtime.\" Featuring Lay's, Doritos and Tostitos, the campaign includes in-store, out-of-home, digital and radio advertising, as well as two 30-second TV spots.For more information, visit: FritoLay.com/SnackIndex. Frito-Lay is an Official Sponsor of Super Bowl LIV.Survey MethodologyThis poll was conducted between January 13-15, 2020 among a national sample of 2200 adults and oversamples of 200 adults each in the Miami MSA, Kansas City MSA, San Francisco MSA, Tennessee, and Wisconsin. The national interviews were conducted online and the data were weighted to approximate a target sample of adults based on age, education, gender, race, and region. Results from the full survey have a margin of error of +/-2%. The local data was weighted to approximate geographic samples based on age, gender, and race and has a margin of error of +/-7%. About Frito-Lay North America Frito-Lay North America is the $16 billion convenient foods division of PepsiCo, Inc. (NASDAQ: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/ and on Twitter http://www.twitter.com/fritolay.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales. Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com.    View original content to download multimedia:http://www.prnewswire.com/news-releases/frito-lay-us-snack-index-reveals-nearly-all-super-bowl-liv-viewers-expect-snacks-for-the-big-game-300991097.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "Cheetos Pops Back Into Super Bowl For First Time In Over A Decade With Commerical Starring MC Hammer",
        "subtitle": "",
        "date": "Jan 16, 2020 9:30AM EST",
        "content": "PLANO, Texas, Jan. 16, 2020 /PRNewswire/ -- Cheetos is popping back into the Super Bowl ad scene for the first time in over a decade to debut its biggest innovation in a decade — Cheetos Popcorn — on the world's largest advertising stage. The :30 TVC spotlights the orange and red dust that all Cheetos fans proudly wear on their fingertips, known officially as Cheetle®, and will kick off Cheetos' newest marketing campaign, \"It's a Cheetos Thing.\"Experience the interactive Multichannel News Release here: https://www.multivu.com/players/English/8677551-its-a-cheetos-thing/ Beloved '90s hip-hop star MC Hammer is the star of the new commercial, as seen in the teaser released today on Cheetos' social channels [See here]. The teaser video explores the origins of one of MC Hammer's most beloved songs, \"U Can't Touch This\" — which celebrates its 30th anniversary this week — and asks the question, \"Was Cheetos and Cheetle the inspiration behind the iconic track?\" Fans are transported back to the 1990s before MC Hammer debuted his hit song, showing that it all began with a bag of Cheetos and Cheetle-covered fingertips. The teaser is in preparation for the full Super Bowl commercial that will give a nod to Cheetle-covered fingertips being not just a delicious treat, but a permission slip to escape the mundane routines of everyday life.\"Cheetos is such an iconic and beloved brand that has gained even more popularity in the last decade, so we saw the Super Bowl as the only fitting place to debut our biggest product launch in a decade with Cheetos Popcorn,\" said Rachel Ferdinando, SVP and Chief Marketing Officer, Frito-Lay North America. \"And of course, joining our mischievous brand identity in a playful way with MC Hammer was a perfect fit. It's two icons coming together — Cheetos and Hammertime — in a relatable story about the Cheetle that sticks to everyone's fingers when eating Cheetos.\"Cheetos Explodes in Pop-CultureCheetos last had an in-game Super Bowl TVC in 2009 during Super Bowl XLIII when the Pittsburgh Steelers defeated the Arizona Cardinals. Since then, the brand has seen an even greater surge in popularity on the back of numerous experiential campaigns and partnerships such as the Cannes award-winner \"Cheetos Museum\"; a pair of Cheetos restaurants; a fashion show at New York Fashion Week; and collaborations such as Mac N' Cheetos with Burger King and the KFC Cheetos Chicken Sandwich. The Flamin' Hot line has further ingrained the brand in pop-culture, showing up everywhere from celebrity social media postings to music videos from the biggest artists in the world to celebrity chef culinary creations to runway fashion.It's a Cheetos ThingNow, the brand is embarking on its biggest effort yet and is using the world's largest advertising stage to launch not only a massive new product, but a new Masterbrand campaign as well. The campaign, \"It's a Cheetos Thing,\" is described as a point of view, or a way of life. As in, it's an unspoken bond you share with anyone whose fingers are constantly orange. It's a break from the everyday, or a momentary pause on adulthood. The campaign narrative concludes with the tagline, \"It's a Cheetos Thing.\"The campaign will be supported through all of the primary channels, including the Super Bowl TVC that will also run the bulk of the year; in-store; out-of-home; and will heavy up on digital.Cheetos PopcornCheetos' new ready-to-eat Popcorn brings the legendary taste of the iconic Cheetos seasoning to one of America's snacking favorites, swapping the butter and salt for the cheesy flavors fans know and love. Available in two flavors — Cheddar and Flamin' Hot® — Cheetos Popcorn elevates fans' snacking game with cheesy and flamin' hot twists on a snack perfect for any occasion.Ready to go right out of the bag, Cheetos Popcorn creates a new snacking experience that pairs the classic taste of popcorn with an added boost of cheesy, flavorful fun from Cheetos. Cheetos Popcorn is available now in 7.0 oz. Cheddar bags and 6.5 oz. Flamin' Hot bags for a suggested retail price of $3.99 and 2 oz. bags for a suggested retail price of $1.89. For more information, please visit Cheetos.com.High-res images and other press materials are available here.About CheetosCheetos is one of the many brands that make up Frito-Lay North America, the $16 billion convenient foods division of PepsiCo, Inc. (Nasdaq: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/, the Snack Chat blog, http://www.snacks.com/ and on Twitter http://www.twitter.com/fritolay.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales. Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com.        View original content:http://www.prnewswire.com/news-releases/cheetos-pops-back-into-super-bowl-for-first-time-in-over-a-decade-with-commerical-starring-mc-hammer-300988112.htmlSOURCE  Frito-Lay"
    },
    {
        "title": "PepsiCo and the International Youth Foundation Launch Digital Life Skills Training Course Designed to Help One Million Young Women Succeed in the Workplace",
        "subtitle": "",
        "date": "Jan 16, 2020 7:00AM EST",
        "content": "PURCHASE, N.Y., Jan. 16, 2020 /PRNewswire/ -- PepsiCo, Inc. (NASDAQ: PEP), The PepsiCo Foundation, the philanthropic arm of one of the world's leading food and beverage companies and nonprofit organization, the International Youth Foundation (IYF), today announced the launch of their Passport to Success® Traveler program — an online, mobile-friendly training course for students to learn and practice life skills. Referred to by many names—soft skills, social-emotional skills, essential skills, 21st century skills, power skills, non-cognitive skills, work readiness skills—life skills include self-confidence, responsibility, teamwork, and communication, and they are necessary to enabling young people to succeed at home, in school and on the job. Life skills are increasingly essential to company and employee success in today's rapidly changing, globalized economy. According to LinkedIn's latest Global Talent Trends Report, 92 percent of talent professionals surveyed said soft skills matter as much or more than hard skills in the hiring process. Passport to Success® Traveler addresses this skills need head-on by focusing on areas of development that international experts agree are critical, such as preparing youth to be able to manage conflict and adept at critical and creative thinking. Developed with a $2.5 million investment from The PepsiCo Foundation, Passport to Success® Traveler is a mobile-first, game-based learning, digital version of IYF's existing, printed soft skills curriculum that is already used in classrooms and workshops around the globe. Currently available in American English and British English, Spanish, and Hinglish (a blend of Hindi and English languages in Hindi with Roman characters), with an Arabic version launching later in the year, the 18-unit, 10-hour online curriculum is designed for 16-24-year-olds and features a range of lessons that include: how to secure a job, manage personal finances, and master social-emotional skills, including conflict management and teamwork. The curriculum is designed with guidance from native speakers to be culturally relevant and appropriate to each market.While these skills are increasingly important for success in the workplace, a report from UNESCO in 2019 found that young women and girls are more likely than young men to be excluded from education; further, according to the International Labour Organization, women and girls often lack access to vocational education and skills training. A 2019 International Youth Foundation and PepsiCo study conducted by the International Center for Research on Women found that soft skills programs that work for young women tend to encourage holistic youth development, offer gender-smart programming and address societal norms that can prevent women from succeeding in the workplace.To support young women, Passport to Success® Traveler was designed to be gender-smart and features scenarios with women serving in positions of authority and in non-traditional professional roles. In addition, the curriculum targets the societal barriers impeding gender equality specific to each country in which it will be offered. It emphasizes holistic youth development, focusing on teaching skills that benefit young people in all areas of life, to empower girls and young women toward continuing education, sustainable livelihoods and workforce success. The PepsiCo Foundation and IYF are working with non-governmental organizations and nonprofits, public education organizations, and communicating directly with young people to help one million young women and girls access the curriculum by 2025. \"PepsiCo is proud to partner with the International Youth Foundation to support this curriculum and help young women gain the skills they need to enter today's workforce and be successful,\" said Blair Bennett, PepsiCo Senior Vice President of Global Talent Acquisition. \"At PepsiCo, we are committed to raising the bar on talent and diversity and Passport to Success® Traveler is one way for us to help create inclusive environments and economic opportunity for young people around the world.\"  \"At IYF, we know that whatever the future of work holds, young people—and especially young women—will guide its growth and trajectory for decades to come,\" said Susan Reichle, President & CEO of the International Youth Foundation. \"We also know diversity—and the innovation a diverse workforce engenders—will be essential to the success of organizations and corporations across sectors. That's why we created Passport to Success® Traveler to help young women and men unlock their potential.\"The PepsiCo Foundation has invested nearly $9 million with IYF since 2014. In addition to Passport to Success® Traveler, The PepsiCo Foundation is working with IYF in Mexico to improve the work readiness skills of female students in the country's public technical high school system and supporting IYF's work in South Africa to prepare young women for the workforce by integrating life skills training into the country's college system. The PepsiCo Foundation's partnership with IYF supports PepsiCo's goal to invest $100 million by 2025 in initiatives to provide 12.5 million women and girls around the world with essential resources for workforce readiness and in programs that empower women in the food system and farming. The Passport to Success® Traveler curriculum is available here. Media assets about this work are available for download at https://pepsi.co/media.About IYF The International Youth Foundation® (IYF®) stands by, for, and with young people. Founded in 1990 through a generous grant from the W.K. Kellogg Foundation, IYF is a global nonprofit with programs directly benefiting 7.7 million young people and operations spanning 100 countries so far. We believe that educated, employed, engaged young people possess the power to solve the world's toughest problems, and we focus our youth development efforts on three linked objectives: unlocking agency, driving economic opportunity, and making systems more inclusive. To learn more about the International Youth Foundation, please join us at iyfnet.org.About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales. Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com. About PepsiCo Foundation  Established in 1962, The PepsiCo Foundation works with nonprofit partners and invests in the essential elements of a sustainable food system – helping alleviate hunger, manage water and waste responsibly, and support women as champions of nutrition from farm to family.  View original content to download multimedia:http://www.prnewswire.com/news-releases/pepsico-and-the-international-youth-foundation-launch-digital-life-skills-training-course-designed-to-help-one-million-young-women-succeed-in-the-workplace-300987408.htmlSOURCE  PepsiCo, Inc."
    },
    {
        "title": "Ruffles And Anthony Davis Collab Reaches New Heights With Launch Of New Flavor, Lime And Jalapeño",
        "subtitle": "",
        "date": "Jan 15, 2020 8:00AM EST",
        "content": "PLANO, Texas, Jan. 15, 2020 /PRNewswire/ -- Chip lovers and basketball fans finally get a taste of what's been cooking with Ruffles and six-time NBA All-Star, Anthony Davis' groundbreaking endorsement deal, The Chip Deal. Ruffles, one of the marquee brands from PepsiCo's Frito-Lay division, and the basketball powerhouse set yet another new precedent and go where no other athlete collaboration has gone before – the co-creation of a custom potato chip flavor: Lime and Jalapeño.As a part of the innovative partnership, Davis took his skills from the court to the Frito-Lay culinary center to create a spicy, fresh take on the classic ridged potato chip. The NBA All-Star's new signature flavor, Ruffles Lime & Jalapeño, is bursting with tangy lime zest and a spicy kick of jalapeño – a flavor only fitting for an athlete known for bringing heat and thrill to the game. To officially reveal the flavor, Davis joined Ruffles last night in Los Angeles at an exclusive gathering where more than 300 guests were among the first to taste the new creation and experience the ultimate \"lime-lit\" affair.\"The Chip Deal is transcending the notion of traditional athlete endorsement deals: pairing Anthony Davis' commitment to impact beyond the court and bringing fans something unprecedented from a potato chip brand,\" said Sadira Furlow, vice president of marketing, Frito-Lay North America. \"With the launch of Ruffles Lime and Jalapeño, we translated Davis' energy and originality into an incredible potato chip flavor that is undoubtedly one of the most innovative flavors in Ruffles history.\"In celebration of the new flavor launch, Ruffles is unveiling three limited-edition packaging designs for the new flavor (after all, Davis' jersey number calls for a notable trifecta). The limited batch of custom packaging designs were created in collaboration with Davis and inspired by the unique cross-section of Davis' multidimensional personality and the spirit of individuality Ruffles represents. Starting tomorrow, Ruffles will be giving away these exclusive drops on Instagram and Twitter at @Ruffles.Ruffles Inaugural 'Chip Deal'Last summer, Ruffles announced the launch of one of the most groundbreaking athlete endorsement deals: The Chip Deal. Inspired by Ruffles' fans who are uniquely passionate about their snacks and their style on and off the court, the Chip Deal was established to embody that enthusiasm and cultivate rare new products and fan experiences. The Chip Deal's first creative partner, NBA All-Star Anthony Davis, tipped off the partnership with the creation of limited-edition sneakers, The Ruffles Ridge Tops, in collaboration with famed sneaker designer, Dominic Ciambrone a.k.a. The Shoe Surgeon. The Ruffles/Davis Chip Deal will continue catering to fans in Chicago, Davis' hometown, for NBA All-Star 2020. NBA All-Star Voting presented by Google ends January 20.\"From behind the scenes of sneaker creation to the art of potato chip flavors to the design process of chip packaging, it's a real win to have a partner who's so committed to creating new unexpected experiences for fans,\" said Davis. \"I can't wait for everyone to get a taste – literally – of the latest chapter of my Chip Deal with Ruffles, my Lime & Jalapeño signature flavor.\"Ruffles Lime & Jalapeño will hit shelves in select retailers starting on January 20 and nationwide on February 3 in 8.5 oz. bags for a suggested retail price of $4.29 and 2.5 oz. bags for a suggested retail price of $1.89. For more information, please visit Ruffles.com. About RufflesRuffles is one of many Frito-Lay North America brands – the $16 billion convenient foods division of PepsiCo, Inc. (NASDAQ: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/, the Snack Chat blog, http://www.snacks.com/ and on Twitter http://www.twitter.com/fritolay.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com.   View original content to download multimedia:http://www.prnewswire.com/news-releases/ruffles-and-anthony-davis-collab-reaches-new-heights-with-launch-of-new-flavor-lime-and-jalapeno-300987288.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "PepsiCo To Achieve 100% Renewable Electricity In The U.S.",
        "subtitle": "",
        "date": "Jan 15, 2020 7:00AM EST",
        "content": "PURCHASE, N.Y., Jan. 15, 2020 /PRNewswire/ -- Some of America's favorite snacks and beverages – from Lay's and SunChips to bubly, Gatorade and Pepsi – will soon be made using electricity from renewable sources, such as wind and solar. PepsiCo, Inc. (NASDAQ:PEP) today announced plans to achieve 100% renewable electricity for its U.S. direct operations this year. The U.S. is the food and beverage company's largest market and accounts for nearly half of its total global electricity consumption. PepsiCo's efforts in the U.S. build upon its global progress in switching to renewable electricity around the world. For example, nine countries in PepsiCo's European direct operations already meet 100% of their electricity demand from renewable sources. Additionally, in 2018, 76% of the electricity needs of the PepsiCo Mexico Foods business were delivered via wind energy.  \"We have entered a decade that will be critical for the future of our planet's health,\" said Ramon Laguarta, Chairman and Chief Executive Officer, PepsiCo. \"PepsiCo is pursuing 100% renewable electricity in the U.S. because the severe threat that climate change poses to the world demands faster and bolder action from all of us.\"PepsiCo's shift to renewable electricity in the U.S. this year is expected to deliver a 20% reduction in company-wide direct operations (Scopes 1 and 2) greenhouse gas (GHG) emissions relative to a 2015 baseline. This represents a significant contribution to the company's goal of reducing absolute GHG emissions across its global value chain by 20% by 2030 against a 2015 baseline. \"As an industry leader, we have a responsibility to help spur the use of renewable energy in the U.S., while encouraging the kind of systemic change that can build a more sustainable food system. This is another step forward in that journey,\" said Simon Lowden, Chief Sustainability Officer, PepsiCo. To achieve 100% renewable electricity, PepsiCo plans to target a diversified portfolio of solutions. These include Power Purchase Agreements (PPAs) and Virtual Power Purchase Agreements (VPPAs), which finance the development of new renewable electricity projects such as solar and wind farms, as well as renewable energy certificates (RECs), which are credits certified by independent third parties that support existing green electricity generation from renewable sources. In 2020, PepsiCo's portfolio will feature more RECs, then will gradually move toward PPAs and VPPAs by 2025.Alongside these measures, PepsiCo continues to expand its onsite renewable electricity. The company recently installed new solar panels at its global headquarters in Purchase, N.Y., complementing other solar energy installations throughout the country. These include Frito-Lay facilities in Modesto, CA and Casa Grande, AZ, as well as PepsiCo beverage facilities in Fresno, CA and Tolleson, AZ, among others. About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker, and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com.Cautionary StatementThis release contains statements reflecting our views about our future performance that constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are generally identified through the inclusion of words such as \"aim,\" \"anticipate,\" \"believe,\" \"drive,\" \"estimate,\" \"expect,\" \"goal,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"strategy,\" \"target\" and \"will\" or similar statements or variations of such terms and other similar expressions. Forward-looking statements inherently involve risks and uncertainties that could cause actual results to differ materially from those predicted in such statements, including changes in demand for PepsiCo's products, as a result of changes in consumer preferences or otherwise; changes in laws related to the use or disposal of plastics or other packaging of PepsiCo's products; changes in, or failure to comply with, applicable laws and regulations; imposition or proposed imposition of new or increased taxes aimed at PepsiCo's products; imposition of labeling or warning requirements on PepsiCo's products; PepsiCo's ability to compete effectively; political conditions, civil unrest or other developments and risks in the markets where PepsiCo's products are made, manufactured, distributed or sold; the ability to protect information systems against, or effectively respond to, a cybersecurity incident or other disruption; increased costs, disruption of supply or shortages of raw materials and other supplies; business disruptions; damage to PepsiCo's reputation or brand image; loss of, or a significant reduction in sales to, any key customer; disruption to the retail landscape, including rapid growth in hard discounters and the e-commerce channel; climate change or water scarcity, or legal, regulatory or market measures to address climate change or water scarcity; and other factors that may adversely affect the price of PepsiCo's publicly traded securities and financial performance. For additional information on these and other factors that could cause PepsiCo's actual results to materially differ from those set forth herein, please see PepsiCo's filings with the Securities and Exchange Commission, including its most recent annual report on Form 10-K and subsequent reports on Forms 10-Q and 8-K. Investors are cautioned not to place undue reliance on any such forward-looking statements, which speak only as of the date they are made. PepsiCo undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.Press Contact: pepsicomediarelations@pepsico.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/pepsico-to-achieve-100-renewable-electricity-in-the-us-300987189.htmlSOURCE  PepsiCo, Inc."
    },
    {
        "title": "More Smiles In 2020: Lay's Kicks Off Search For People Creating Joy Across The Country; Unveils Three New Flavors To Smile About",
        "subtitle": "Most Americans (66 percent) consider themselves \"happy\" people, while 33 percent go out of their way to smile at strangers - according to Lay's 2020 Smiles Survey",
        "date": "Jan 8, 2020 7:00AM EST",
        "content": "PLANO, Texas, Jan. 8, 2020 /PRNewswire/ -- With the start of a new year, America's favorite potato chip is resolving to create more smiles in 2020 than ever before. Lay's, having recently unveiled its first brand redesign in over a decade, is ready to turn over the power of its bags – found in more than 68 percent of households nationwide – to star ordinary people who are doing extraordinary things to create joy in their communities. And as Lay's kicks off its nationwide search, the brand is doing its part to spread even more joy to flavor fans across the country by introducing three new chip flavors across its entire portfolio this January: Lay's Cheddar Jalapeño, Lay's Poppables Sea Salt & Vinegar, and Lay's Kettle Cooked Flamin' Hot. To help find the smiles worthy of inviting into millions of Americans' homes later this year, Lay's issued its first-ever Smiles Survey to map the most joyful regions of the country and determine what's bringing them joy: Meanwhile, the 66 percent of Americans who personally know someone who goes to great lengths to inspire joy should visit www.SmileWithLays.com to nominate their friends and family for the Lay's Smiles campaign, which will once again benefit Operation Smile in 2020. Last year, Lay's custom-designed 65 potato chip bags to feature the smiles of 31 ordinary people whose extraordinary acts – from throwing birthday parties for children in need to providing jobs to women transitioning out of homelessness to training injured veterans – inspired more than 17,500 Instagram shares to date and countless more smiles across the country.While Lay's 2020 Smiles bags will hit shelves this fall, fans of flavor have three new reasons to smile this month with the latest additions to the Lay's portfolio:To learn more about the Smile with Lay's campaign and to nominate a friend or family member inspiring joy, visit www.SmileWithLays.com. Survey Methodology Frito-Lay North America partnered with Lucid to field the 2020 Lay's Smiles Survey. This poll was conducted between Dec. 5-16, 2019, among a national sample of 5,000 adults. The interviews were conducted online and the data was weighted to approximate a target sample of adults based on region, gender, age, race/ethnicity, and household income. Results from the full survey have a margin of error of plus or minus 1 percentage point.About Lay'sLay's is one of the brands that makes up Frito-Lay North America, the $15 billion convenient foods division of PepsiCo, Inc. (Nasdaq: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/, the Snack Chat blog, http://www.snacks.com/ and on Twitter http://www.twitter.com/fritolay. Learn more about Lay's by visiting www.facebook.com/lays or on Twitter at www.twitter.com/lays. You can also follow Lay's on Instagram by visiting http://instagram.com/lays.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail.About Operation SmileOperation Smile has provided hundreds of thousands safe surgeries for those born with cleft lip, cleft palate or other facial differences. With more than three decades of expertise, Operation Smile creates solutions that deliver free surgery to people where it's needed most.  As one of the largest medical volunteer-based nonprofits, Operation Smile has mobilized thousands of medical volunteers from a wide range of medical specialties from more than 80 countries. Operation Smile engages public-private partnerships to advance health care delivery, train local medical professionals to provide surgical care for patients in their communities, donate crucial medical equipment and supplies, and increase access to surgical care so that everyone living with cleft is treated. Visit www.operationsmile.org, find us on Facebook or follow us on Twitter. View original content to download multimedia:http://www.prnewswire.com/news-releases/more-smiles-in-2020-lays-kicks-off-search-for-people-creating-joy-across-the-country-unveils-three-new-flavors-to-smile-about-300983117.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "Arik Gilbert Named 2019-20 Gatorade® National Football Player Of The Year",
        "subtitle": "Atlanta Falcons Quarterback Matt Ryan Surprises Winner with Honor",
        "date": "Dec 17, 2019 1:29PM EST",
        "content": "MARIETTA, Ga., Dec. 17, 2019 /PRNewswire/ -- In its 35th year of honoring the nation's most elite high school athletes, The Gatorade Company today announced Arik Gilbert of Marietta High School in Marietta, Ga. is the 2019-20 Gatorade National Football Player of the Year. Gilbert won the prestigious award for his accomplishments on and off the field, joining an impressive group of former Gatorade National Football Player of the Year winners who combined for six NFL MVP awards, 30 Pro Bowl appearances and six NFL first round draft picks.Atlanta Falcons quarterback Matt Ryan surprised Gilbert with the award in front of family, friends, teammates and coaches at his school. Check out a video of the announcement here. The award, which recognizes not only outstanding athletic excellence, but also high standards of academic achievement and exemplary character demonstrated on and off the field distinguishes Gilbert as the nation's best high school football player. A national advisory panel comprised of sport-specific experts and sports journalists helped select Gilbert from more than a million high school football players nationwide. Competition for the national award is fierce. Gilbert topped the list of 51 state winners in football who have an incredible list of accomplishments, including 9 All-American Bowl Game participants, 27 All-State players, 7 SEC school committees and nearly all volunteering with at least two organizations. Gilbert is now a finalist for the most prestigious award in high school sports, the Gatorade Male High School Athlete of the Year award, which is announced at a special ceremony prior to The ESPY Awards in July.\"Gilbert is probably the most complete prep tight end I've scouted,\" says Director of Sports Illustrated All-American John Garcia, Jr. \"His physical profile alone would warrant offers, but it's his polish that makes him a can't-miss prospect. He's already a great route runner with very good ball skills, which pairs almost unfairly with his athletic ability. He's big, fast, physical, and competitive on top of it. He's probably the most dominant offensive weapon in the country, and he's doing it against elite competition in the Atlanta area, where he led his team to its first state title since 1967.\"The 6-foot-5, 255-pound senior tight end led the Blue Devils to a 13-2 record and the Class 7A State Championship. Gilbert caught 102 passes for 1,735 yards and 14 touchdowns through 15 games. A two-time All-State honoree, he was also named Region 3 Offensive Player of the Year as a junior and has been selected to play in the 2020 All-American Bowl. Gilbert is ranked as the nation's No. 1 tight end prospect in the Class of 2020 by ESPN and Rivals, and No. 11 in the country regardless of position by Rivals.      The founder of a campus-wide initiative called \"Whisper,\" which urges students to have device-free conversations and supports diversity and inclusion efforts, Gilbert has also volunteered on behalf of the East Atlanta Kids Club, Habitat for Humanity and March of Dimes. A parishioner at the Life Revolution Church, Gilbert has also donated more than 50 hours to Marietta elementary schools and the Marietta Youth Football program. \"Arik Gilbert is one of the best players I've ever coached against,\" said John Reid, head coach at Rome High School. \"He's huge, fast and has great hands. He's the best player on the field at any position he lines up.\"     Gilbert has maintained a 3.14 GPA in the classroom. He has verbally committed to play football on scholarship at Louisiana State University next fall.Through Gatorade's cause marketing platform \"Play it Forward,\" Gilbert has the opportunity to award a $1,000 grant to a local or national youth sports organization of his choosing. He is also eligible to submit an essay to win one of twelve $10,000 spotlight grants for the organization of choice, which will be announced throughout the year.  Each year a selection committee evaluates the nation's top talent in the District of Columbia and all 50 states, choosing national winners in 12 different sports: football, girls volleyball, boys and girls cross country, boys and girls basketball, baseball, softball, boys and girls soccer, and boys and girls track and field. From the 12 national winners, one male and one female athlete are each named Gatorade High School Athlete of the Year. Since the program's inception in 1985, Gatorade Player of the Year award recipients have won hundreds of professional and college championships, and many have also turned into pillars in their communities, becoming coaches, business owners and educators. Previous winners include a distinguished list of athletes, such as Peyton Manning, Abby Wambach, Karl-Anthony Towns, Derek Jeter and many other sports icons. To learn more about the Gatorade Player of the Year program, check out past winners or to nominate student-athletes, visit www.Gatorade.com/POY, on Facebook at www.facebook.com/GatoradePOY or follow us on Twitter at www.twitter.com/Gatorade. About GatoradeThe Gatorade Company, a division of PepsiCo (NASDAQ: PEP), meets the needs of consumers who participate in Sports and Fitness, through brands that include Gatorade, Propel, Muscle Milk and Bolt24. The solutions they provide are driven by a deep understanding of the unique needs and occasions of different types of sports and fitness. Gatorade, their marquee brand, is underpinned by more than 50-year history of studying the best athletes in the world and sports-nutrition research by the Gatorade Sport Science Institute, allowing it to provide scientifically-formulated products that meet athletes' needs both on and off the field. For more information and a full list of products, please visit www.gatorade.com. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.At the heart of PepsiCo is Performance with Purpose – our fundamental belief that the success of our company is inextricably linked to the sustainability of the world around us. We believe that continuously improving the products we sell, operating responsibly to protect our planet and empowering people around the world enable PepsiCo to run a successful global company that creates long-term value for society and our shareholders. For more information, visit www.pepsico.com.    View original content:http://www.prnewswire.com/news-releases/arik-gilbert-named-2019-20-gatorade-national-football-player-of-the-year-300976343.htmlSOURCE  The Gatorade Company"
    },
    {
        "title": "Frito-Lay and Feed the Children Partner in Seventh Annual Event to Help Defeat Hunger in Phoenix, Ariz.",
        "subtitle": "Eight Hundred Local Families to Receive Week of Supplies of Food, Essential Items at Phoenix Event",
        "date": "Dec 13, 2019 10:00AM EST",
        "content": "PHOENIX, Dec. 13, 2019 /PRNewswire/ -- For the seventh year, Frito-Lay and Feed the Children will provide 800 families, pre-identified by Pilgrim Rest Baptist Church, with enough food and daily essentials to supplement meals for a week. The event kicks off Friday, Dec. 13, at 11 a.m. MST at Pilgrim Rest Baptist Church, 1401 E. Jefferson St. Phoenix, Ariz. 85034. Volunteers from Frito-Lay, PepsiCo, Feed the Children and Pilgrim Rest Baptist Church will be onsite serving families and assisting with distribution during the event.  Part of Feed the Children's No Hunger Holidays campaign, the event designed to feed families during the holidays, as well as bring awareness to the important issue of childhood hunger. With more than 20 percent of Phoenix residents living below the poverty line, holidays can be a stressful time for families. It can be especially difficult once school is out for the holidays, leaving children food insecure – without a source for consistent meals.Since 2010, Frito-Lay, a division of PepsiCo, and Feed the Children have provided more than 88,000 families across the U.S. everyday care items and food. The annual event is part of a larger initiative between the organizations to provide much-needed resources in effort to fight childhood hunger.\"Our annual event with Feed the Children is one of our favorite times of the year,\" said Nick Burge, zone sales director, Phoenix, Frito-Lay North America. \"With this year's event, Frito-Lay has been able to provide food and daily essentials to 5,600 Phoenix families over seven years alongside Feed the Children, Pepsi, Quaker, and local partners like Pilgrim Rest Baptist Church.\" \"We believe that no child should go to bed hungry, especially during a time full of warmth, love and sharing,\" said Travis Arnold, Feed the Children president and CEO. \"But the reality is, millions of children face this hardship every day. Thanks to our generous partners at Frito-Lay, we are able to help these families rest a little easier knowing they don't have to worry about where their next meal is coming from this holiday season.\"Each family at today's event will receive a variety of products, including donations from Frito-Lay, Pepsi and Quaker: About Frito-Lay North America Frito-Lay North America is the $16 billion convenient foods division of PepsiCo, Inc. (NASDAQ: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/ and on Twitter http://www.twitter.com/fritolay.About Feed the ChildrenAt Feed the Children, we feed hungry kids. We envision a world where no child goes to bed hungry. In the U.S. and internationally, we are dedicated to helping families and communities achieve stable lives and to reducing the need for help tomorrow, while providing food and resources to help them today. We distribute product donations from corporate donors to local community partners, we provide support for teachers and students, and we mobilize resources quickly to aid recovery efforts when natural disasters strike. Internationally, we manage child-focused community development programs in 10 countries. We welcome partnerships because we know our work would not be possible without collaborative relationships.Visit feedthechildren.org for more information.  View original content to download multimedia:http://www.prnewswire.com/news-releases/frito-lay-and-feed-the-children-partner-in-seventh-annual-event-to-help-defeat-hunger-in-phoenix-ariz-300974046.htmlSOURCE  Frito-Lay North America"
    },
    {
        "title": "PepsiCo Launches Second North America Greenhouse Program To Accelerate Purpose-Driven Solutions For The Food And Beverage Industry",
        "subtitle": "Up to 10 start-ups will receive $20,000 in grant funding and mentorship",
        "date": "Dec 5, 2019 9:00AM EST",
        "content": " PURCHASE, N.Y., Dec. 5, 2019 /PRNewswire/ -- PepsiCo (NASDAQ: PEP) today announced the launch of its second PepsiCo Greenhouse program in North America, an innovation initiative designed to support emerging entrepreneurs and brands in the food and beverage industry. The 2020 program seeks to collaborate with purpose-driven brands at the forefront of transformative trends that are changing the way consumers eat and drink. \"As part of our vision to be the 'Global Leader in Convenient Foods and Beverages by Winning with Purpose,' we are integrating purpose into the core of our business and our brands,\" said Jim Andrew, PepsiCo Executive Vice President, Corporate Strategy and Chief Venturing Officer. \"Since its inception, the PepsiCo Greenhouse has been a great source of ideation, talent development and agility, while also providing an opportunity to collaborate with like-minded, mission-driven entrepreneurs as they develop and scale their innovative ideas that look to improve the way we shop and eat, offer new choices to consumers and solve the needs of our communities.\"  Issuing an open call today through January 6, 2020, PepsiCo is seeking 10 start-ups based in the U.S. or Canada whose businesses or brands integrate purpose into their offering, meeting the needs of current and future consumers, communities and/or our planet. The selected start-ups are granted $20,000 in funding and will participate in a six-month business optimization program designed to accelerate growth. The program includes personalized mentorship with experts across PepsiCo functions and from some of its leading and emerging brands, such as Stacy's, IMAG!NE and KeVita, to help address critical early-stage business operations like strategic planning, corporate structuring and fundraising. Guidance on brand optimization, product development, supply chain management, customer acquisition and distribution will also be provided. At the end of the program, one start-up will be awarded an additional $100,000 in funding to continue its expansion, and an opportunity to continue partnering with PepsiCo to further their growth.PepsiCo first launched its Greenhouse program in Europe in 2017 and expanded the program to North America in the fall of 2018, awarding Austin, Texas-based Hapi Drinks, a sugar-free kids drinks company founded with the mission to fight childhood obesity, as the winning brand. Collectively, the 10 participating companies in the inaugural North America class grew average revenues of 200 percent through the six-month duration of the program, with other successes including the launch of new product lines and digital campaigns that have driven sales and new customer acquisitions. For applicant information and additional detail on this year's PepsiCo Greenhouse program, please visit www.greenhouseaccelerator.com. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales. Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.com.Press Contact: pepsicomediarelations@pepsico.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/pepsico-launches-second-north-america-greenhouse-program-to-accelerate-purpose-driven-solutions-for-the-food-and-beverage-industry-300969885.htmlSOURCE  PepsiCo, Inc."
    },
    {
        "title": "PepsiCo Announces Definitive Agreement to Acquire BFY Brands Expanding Better-For-You Portfolio and Production Capabilities",
        "subtitle": "",
        "date": "Dec 2, 2019 4:01PM EST",
        "content": "PURCHASE, N.Y., Dec. 2, 2019 /PRNewswire/ -- PepsiCo, Inc. (NASDAQ: PEP) today announced it has entered into a definitive agreement to acquire BFY Brands, the maker of PopCorners snacks. Upon closing, BFY Brands will report into PepsiCo's Frito-Lay North America division.  The addition of BFY Brands will expand Frito-Lay's snacking portfolio and further deliver on its Winning with Purpose vision to offer consumers more positive nutritious options. \"BFY Brands offers distinctive products that deliver the great taste and ingredients consumers are looking for,\" said Steven Williams, CEO, PepsiCo Foods North America. \"Their production capabilities will support the growth of our existing, more-nutritious snack brands.\"The PopCorners line of snacks is available in grocery stores nationwide and includes Flex Protein Crisps and Flourish Veggie Crisps.The transaction is subject to customary conditions and approvals, including regulatory approvals.About PepsiCoPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.com.PepsiCo Cautionary StatementStatements in this release that are \"forward-looking statements\" are based on currently available information, operating plans and projections about future events and trends. Terminology such as \"believe,\" \"expect,\" \"intend,\" \"estimate,\" \"project,\" \"anticipate,\" \"will,\" or similar statements or variations of such terms are intended to identify forward-looking statements, although not all forward-looking statements contain such terms. Forward-looking statements inherently involve risks and uncertainties that could cause actual results to differ materially from those predicted in any such forward-looking statement. Such risks and uncertainties include, but are not limited to: changes in demand for PepsiCo's products, as a result of changes in consumer preferences or otherwise; changes in laws related to the use or disposal of plastics or other packaging of PepsiCo's products; changes in, or failure to comply with, applicable laws and regulations; imposition or proposed imposition of new or increased taxes aimed at PepsiCo's products; imposition of labeling or warning requirements on PepsiCo's products; PepsiCo's ability to compete effectively; political conditions, civil unrest or other developments and risks in the markets where PepsiCo's products are made, manufactured, distributed or sold; the ability to protect information systems against, or effectively respond to, a cybersecurity incident or other disruption; damage to PepsiCo's reputation or brand image; failure to successfully complete, integrate or manage acquisitions and joint ventures into PepsiCo's existing operations or to complete or effectively manage divestitures or refranchisings; loss of, or a significant reduction in sales to, any key customer; disruption to the retail landscape, including rapid growth in hard discounters and the e-Commerce  channel; and other factors that may adversely affect the price of PepsiCo's publicly traded securities and financial performance.For additional information on these and other factors that could cause PepsiCo's actual results to materially differ from those set forth herein, please see PepsiCo's filings with the Securities and Exchange Commission, including its most recent annual report on Form 10-K and subsequent reports on Forms 10-Q and 8-K. Investors are cautioned not to place undue reliance on any such forward-looking statements, which speak only as of the date they are made. PepsiCo undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.About BFY BrandsBFY Brands is a global, diversified, better-for-you snack company, directly addressing the growing consumer trends toward healthier living and eating.  The company's primary product, PopCorners®, is a high growth, better-for-you popped corn snack with a strong track record in the club and grocery segments within the U.S. and Canada and a presence in over 40 countries and territories worldwide.  BFY is also a contract manufacturer of better-for-you popped snacks.  BFY employs approximately 750 people, primarily at its manufacturing facilities in Middletown, NY, and Liberty, NY.  For more information, please visit www.popcorners.com. Press Contact: pepsicomediarelations@pepsico.com View original content to download multimedia:http://www.prnewswire.com/news-releases/pepsico-announces-definitive-agreement-to-acquire-bfy-brands-expanding-better-for-you-portfolio-and-production-capabilities-300967676.htmlSOURCE  PepsiCo, Inc."
    },
    {
        "title": "PepsiCo, Inc. Announces Post Stabilisation Notice",
        "subtitle": "",
        "date": "Nov 29, 2019 12:10PM EST",
        "content": "NEW YORK, NY / ACCESSWIRE / November 29, 2019 / PepsiCo, Inc. (NASDAQ:PEP)HSBC (contact: Syndicate desk, telephone: +44 207 992 8066) hereby gives notice that no stabilisation (within the meaning of the rules of the Financial Conduct Authority) was undertaken by the Stabilisation Manager(s) named below in relation to the offer of the following securities.This announcement is for information purposes only and does not constitute an invitation or offer to underwrite, subscribe for or otherwise acquire or dispose of any securities of the Issuer in any jurisdiction.This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.SOURCE: PepsiCo, Inc"
    },
    {
        "title": "Frito-Lay Releases U.S. Snack Index and No Need to Check Twice: It's Family, Friends and Food that Make the Holidays Nice",
        "subtitle": "Actress Anna Kendrick Stars in Frito-Lay's First-Ever Snack Portfolio Holiday Campaign Celebrating America's \"Favorite Things\"",
        "date": "Nov 20, 2019 10:00AM EST",
        "content": "PLANO, Texas, Nov. 20, 2019 /PRNewswire/ -- Forget the \"Naughty\" or \"Nice\" lists. This holiday season, Frito-Lay is all about salty vs. sweet with the release of its latest U.S. Snack Index1, revealing the taste preferences driving snack consumption among consumers.Survey data revealed women tend to prefer a mix of savory and sweet snacks, and Gen Z shoppers are more likely to seek savory snacks – while men and Boomers over age 55 have more of a sweet tooth. Yet, regardless of age or gender, it's food that brings people together during the holidays, as respondents overwhelmingly ranked snacks/food one of their \"Favorite Things\" for celebrating the season – second only to family and friends (whew!).\"This holiday season – and all year long – Frito-Lay has a snack for everyone, whether it's a tried-and-true classic or a new twist on an old favorite,\" said Mike Del Pozzo, senior vice president of sales and chief customer officer, Frito-Lay North America. \"Consumers told us they prefer holiday food over drinks, gifts, decorations, music and sports. The good news is that Frito-Lay can meet that demand, as we produce nearly 100 pounds of snacks per second.\"Holiday Campaign Starring Anna KendrickAmericans will take part in an estimated 327 million gatherings over the next six weeks. Therefore, it's no snaccident that Frito-Lay is debuting its first-ever portfolio holiday creative campaign this week, ahead of the Thanksgiving supermarket surge.Starring Anna Kendrick singing  \"My Favorite Things\" from the classic Rodgers & Hammerstein musical THE SOUND OF MUSIC, with a special take for Frito-Lay, the music video-esque production celebrates what everyone loves most about the holidays: snacks. Frito-Lay snacks, to be exact, as Kendrick shares the screen with Lay's, Doritos, Cheetos, Tostitos and Smartfood popcorn in a two-minute anthem video complete with a tacky-turned-tasty sweater party, gingerbread house decorating, queso-inspired tango, and of course a snack table spread that's fit for a king (or queen).The Frito-Lay U.S. Snack Index: By the NumbersThe U.S. Snack Index also indicates time is at the top of everyone's wish list, perhaps due to the holiday shopping season being six days shorter in 2019 than it was last year. Americans are choosing NOT to play host this year. While they plan to attend a Thanksgiving (60 percent) or December holiday (44 percent) celebration, just 21 percent plan to host themselves. Meanwhile, 40 percent of Americans say they'll pitch in to help with the snacks...provided the recipe is easy to prepare. And only 28 percent are stringing popcorn or partaking in other snack-inspired crafts – choosing instead to simply eat their snacks or give them as gifts (which is just fine with us, too).America's Favorite Holiday SnacksSalty vs. SweetSnack Occasions Among the 28 percent of people who say they use snacks in crafts, nearly half (48 percent) use popcorn while many also use pretzels (28 percent).Frito-Lay's U.S. Snack Index is an ongoing, national pulse on how different generations, regions and cities snack. For more information, visit: FritoLay.com/SnackIndex.1Survey Methodology Frito-Lay North America partnered with Morning Consult to field the Frito-Lay North America U.S. Snack Index nationally. This poll was conducted between Nov. 1-3, 2019, among a national sample of 2,200 adults. The interviews were conducted online and the data were weighted to approximate a target sample of Adults based on age, race/ethnicity, gender, educational attainment and region. Results from the full survey have a margin of error of plus or minus 2 percentage points.About Frito-Lay North America Frito-Lay North America is the $16 billion convenient foods division of PepsiCo, Inc. (NASDAQ: PEP), which is headquartered in Purchase, NY. Learn more about Frito-Lay at the corporate website, http://www.fritolay.com/ and on Twitter http://www.twitter.com/fritolay.About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $64 billion in net revenue in 2018, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.Guiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business.  For more information, visit www.pepsico.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/frito-lay-releases-us-snack-index-and-no-need-to-check-twice-its-family-friends-and-food-that-make-the-holidays-nice-300961860.htmlSOURCE  Frito-Lay North America"
    }
]