[
    {
        "title": "PayPal Updates First Quarter 2020 Revenue Outlook Based on Coronavirus Impact",
        "subtitle": "",
        "date": "Feb 27, 2020 8:39AM EST",
        "content": "SAN JOSE, Calif., Feb. 27, 2020 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) has been carefully assessing the effect of COVID-19 as conditions continue to evolve. We are prioritizing the health and safety of our employees and supporting those in need. Our thoughts continue to be with the communities and individuals affected by this disease.PayPal's business trends remain strong; however, international cross-border e-commerce activity has been negatively impacted by COVID-19. We currently estimate the negative impact from COVID-19 to be an approximate one percentage point reduction, on both a spot and foreign currency-neutral basis, to PayPal's year-over-year revenue growth for the first quarter, as compared to the revenue guidance provided on January 29, 2020. Stronger performance quarter-to-date across our diversified business is partially offsetting this one percentage point negative impact. We now expect to report first quarter 2020 revenue towards the lower end of our previously guided range of $4.78 - $4.84 billion. We are reaffirming our first quarter 2020 GAAP and non-GAAP EPS guidance. At this time, the duration of COVID-19's impact is difficult to estimate. We are continuing to closely monitor this evolving situation. We will provide further updates on our first quarter earnings call in April.  About PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.Forward-looking statementsThis press release contains forward-looking statements relating to, among other things, the future results of operations, financial condition, expectations, and plans of PayPal Holdings, Inc. and its consolidated subsidiaries that reflect PayPal's current projections and forecasts. Forward-looking statements can be identified by words such as \"may,\" \"will,\" \"would,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"believe,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"project,\" \"forecast,\" and other similar expressions. Forward-looking statements include, but are not limited to, statements regarding projected financial results for the first quarter and full year 2020 and projected future growth of PayPal's businesses. Forward-looking statements are based upon various estimates and assumptions, as well as information known to PayPal as of the date of this press release, and are inherently subject to numerous risks and uncertainties, including uncertainties around the duration and severity of the novel coronavirus (COVID-19) outbreak. Accordingly, actual results could differ materially from those predicted or implied by forward-looking statements. For information about factors that could adversely affect PayPal's results of operations, financial condition and prospects, or that could cause actual results to differ from those expressed or implied in forward-looking statements is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in PayPal's most recently filed annual report on Form 10-K and its subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting PayPal's Investor Relations website at https://investor.paypal-corp.com or the SEC's website at www.sec.gov. All information in this release speaks as of February 27, 2020. For the reasons discussed above, you should not place undue reliance on the forward-looking statements in this press release. PayPal assumes no obligation to update such forward-looking statements.ContactsInvestor Relations Contacts   Gabrielle Rabinovitchgrabinovitch@paypal.comAkila Moorthyamoorthy@paypal.com          Media Relations ContactJosh Criscoejcriscoe@paypal.com 646.667.5065  View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-updates-first-quarter-2020-revenue-outlook-based-on-coronavirus-impact-301012673.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "PayPal Funds Northeastern University in Launch of Major Research Project on Illegal Firearms Transactions",
        "subtitle": "",
        "date": "Feb 11, 2020 1:00PM EST",
        "content": "SAN JOSE, Calif., Feb. 11, 2020 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL), along with the Center on Crime and Community Resilience at Northeastern University, in partnership with the University of Chicago Crime Lab, today announced the formation of a research initiative designed to better understand illegal firearm trafficking and financing in the United States. The research initiative, with funding support from PayPal, is designed to generate actionable insights and guide efforts to monitor and respond to illegal firearm distribution, with the goal of combating the illegal sale of firearms. The specific research proposal further seeks to understand what types of payment methods are used to finance these illegally-sourced firearms. \"We are working to combat illegal gun trafficking, which will help to reduce and eliminate firearm-related violence,\" said Dan Schulman, president and CEO of PayPal. \"All of us at PayPal are proud of the work we do with law enforcement officials around the world to assist in efforts to identify and stop illegal activity from occurring. This research is an extension of these efforts, and will help law enforcement and all payment platforms to better understand and address the issue of illegal firearms trafficking.\"The initiative will be led by Dr. Anthony Braga, director of the School of Criminology and Criminal Justice at Northeastern University and director of the Center on Crime and Community Resilience. Dr. Braga is an internationally-recognized expert on the subject of gun violence and reducing illegal access to firearms, and has worked with city and state governments across the country to combat unauthorized gun sales to dangerous individuals and criminal networks.\"The United States has a significant problem with illegal acquisition of guns by individuals at elevated risk of becoming involved with gun violence. It is these guns that end up in the wrong hands that lead to serious violence,\" said Dr. Braga. \"Through this cutting-edge research enterprise, we hope to advance innovative collaborations between law enforcement and private industry to understand the evolving landscape and to generate actionable solutions.\"Dr. Braga and his Northeastern team are joined by experts from the University of Chicago Crime Lab, the Violence Prevention Research Program at the University of California, Davis, led by Garen J. Wintemute, a professor of emergency medicine, and Philip J. Cook, a professor of public policy at Duke University and co-director of the NBER Working Group on the Economics of Crime, to address this complicated and important issue. Together, these organizations have experience working on numerous projects related to illegal and underground firearm markets. PayPal, which has prohibited firearms sales on all of its platforms and is invested in finding ways to prevent illegal firearm transactions, is supporting the research.\"Preventing illegal firearms trafficking and violent gun crime has always been the Bureau of Alcohol, Tobacco, Firearms and Explosives' (ATF) top priority,\" said ATF Management. \"It is clear from crime guns recovered on the streets every day that we need to better understand emerging firearms trafficking techniques that utilize the internet, and disrupt the illegal financing behind them. To mitigate this threat, ATF welcomes the opportunity to collaborate with our partners to identify how we can enhance the security of private businesses and promote public safety.\"More information about the research initiative can be found here.About PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.About Northeastern University Center on Crime and Community Resilience The Center on Crime and Community Resilience at Northeastern University partners with governments and non-profits to find research-based solutions to crime and other complex social problems. Our projects range from helping community partners address gang violence, to studying body cameras worn by police, to working to prevent gun violence through programs that reclaim firearms from people prohibited from carrying them. Through these projects and others we focus on the needs and priorities of the partners and communities we work with, with the goal of bringing resilience to vulnerable communities. To learn more about the Center on Crime and Community Resilience, visit ccresilience.org.About University of Chicago Crime LabThe University of Chicago Crime Lab partners with policymakers and practitioners to help cities design and test the most promising ways to reduce crime and improve human lives at scale. We focus on the most important criminal justice challenges of our time, including efforts to help Chicago and other cities prevent crime and violence from happening in the first place, improve schooling and income opportunities for those living in communities most impacted by violence, and reduce the harms associated with the criminal justice system. To learn more about the Crime Lab, visit urbanlabs.uchicago.edu/labs/crime.   Media Contacts:PayPalJustin Higgs, 408-219-8118Bernadette Green, 404-210-3322Tiffany Peng, 669-287-6845Northeastern UniversityMike Woeste, 617-373-5471University of ChicagoKim Smith, 773-834-0518 View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-funds-northeastern-university-in-launch-of-major-research-project-on-illegal-firearms-transactions-301003066.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "PayPal Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Jan 29, 2020 4:15PM EST",
        "content": "SAN JOSE, Calif., Jan. 29, 2020 /PRNewswire/ -- Global technology platform and digital payments leader PayPal Holdings, Inc. (NASDAQ: PYPL) today announced fourth quarter and full year results for the period ended December 31, 2019.\"PayPal delivered strong results in 2019, achieving many records including revenue, net income and operating margin performance.  We added 37.3 million net new active accounts, bringing total active accounts to 305 million, up 14% year over year.  In Q4 alone, we processed nearly $200 billion of TPV and engagement grew 10% to 40.6 transactions per active account. We strengthened our value proposition for consumers and merchants, expanded our international scope and scale, and announced transformative strategic acquisitions, investments and commercial partnerships,\" said Dan Schulman, President and CEO of PayPal.Financial highlights for fourth quarter 2019Operating highlights for fourth quarter 2019Financial highlights for full year 2019Operating highlights for full year 2019PayPal's key business initiativesIn November, PayPal announced its agreement to acquire Honey Science Corporation, a rapidly-growing technology platform for shopping and rewards, for approximately $4 billion.  This transaction, which closed in January 2020, is expected to transform the shopping experience for PayPal's consumers while increasing sales and customer engagement for merchants.Following a strategic investment in March 2019, PayPal executed a commercial agreement with MercadoLibre in December.  This agreement will allow PayPal and MercadoLibre to jointly leverage their scale and capabilities to strengthen both companies' networks.In December, PayPal completed its acquisition of a 70% equity interest in Guofubao Information Technology Co., Ltd. (GoPay), following approval of the transaction by the People's Bank of China in September 2019. With the completion of this deal, PayPal became the first foreign payments platform licensed to provide online payment services in China.In January 2020, PayPal announced a strategic partnership with UnionPay International (UPI) whereby both companies will work together to better serve joint consumers and merchants. As part of this partnership, UPI will support PayPal's merchant and consumer initiatives in China and PayPal will support UPI acceptance globally where PayPal is accepted, providing UPI consumers more choice when shopping.Fourth Quarter 2019 Financial and Operating HighlightsCash, Cash Equivalents, and Investments - PayPal's cash, cash equivalents, and investments totaled $13.6 billion as of December 31, 2019.Long-Term Debt - PayPal's long-term debt totaled $5.0 billion as of December 31, 2019.2020 Financial GuidanceFull year 2020 revenue and earnings guidanceFirst quarter 2020 revenue and earnings guidancePlease see \"Non-GAAP Financial Measures\" and \"Non-GAAP Measures of Financial Performance\" for important additional information.Quarterly conference call and webcastPayPal Holdings, Inc. will host a conference call to discuss fourth quarter and full year 2019 results at 2:00 p.m. Pacific Time today. A live webcast of the conference call, together with a slide presentation that includes supplemental financial information and reconciliations of certain non-GAAP measures to their most directly comparable GAAP measures, can be accessed through the company's Investor Relations website at https://investor.paypal-corp.com. In addition, an archive of the webcast will be accessible for 90 days through the same link.PayPal Holdings, Inc. uses its Investor Relations website (https://investor.paypal-corp.com), its PayPal Stories Blog (https://www.paypal.com/stories/us), Twitter handles (@PayPal and @PayPalNews), LinkedIn page (https://www.linkedin.com/company/paypal), Facebook page (https://www.facebook.com/PayPalUSA/), YouTube channel (https://www.youtube.com/paypal), Dan Schulman's LinkedIn profile (https://www.linkedin.com/in/dan-schulman/), John Rainey's LinkedIn profile (www.linkedin.com/in/john-rainey-pypl) and Dan Schulman's Facebook page (https://www.facebook.com/DanSchulmanPayPal/) as a means of disclosing information about the company and for complying with its disclosure obligations under Regulation FD. The information that is posted through these channels may be deemed material. Accordingly, investors should monitor these channels in addition to PayPal's press releases, filings with the Securities and Exchange Commission (\"SEC\"), public conference calls, and webcasts.About PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.PresentationAll growth rates represent year-over-year comparisons, except as otherwise noted. FX-neutral results are calculated by translating the current period local currency results by the prior period exchange rate. FX-neutral growth rates are calculated by comparing the current period FX-neutral results with the prior period results, excluding the impact from hedging activities. All amounts in tables are presented in U.S. dollars, rounded to the nearest millions, except as otherwise noted. As a result, certain amounts and rates may not sum or recalculate using the rounded dollar amounts provided.Non-GAAP financial measuresThis press release includes financial measures defined as \"non-GAAP financial measures\" by the SEC including: non-GAAP net income, non-GAAP earnings per diluted share, non-GAAP operating income, non-GAAP operating margin, non-GAAP effective tax rate, free cash flow, and adjusted free cash flow. For an explanation of the foregoing non-GAAP measures, please see \"Non-GAAP Measures of Financial Performance\" included in this press release. These measures may be different from non-GAAP financial measures used by other companies. The presentation of this financial information, which is not prepared under any comprehensive set of accounting rules or principles, is not intended to be considered in isolation of, or as a substitute for, the financial information prepared and presented in accordance with generally accepted accounting principles (GAAP). For a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP measures, see \"Non-GAAP Measures of Financial Performance,\" \"Reconciliation of GAAP Operating Margin to Non-GAAP Operating Margin,\" \"Reconciliation of GAAP Net Income to Non-GAAP Net Income, GAAP Diluted EPS to Non-GAAP Diluted EPS and GAAP Effective Tax Rate to Non-GAAP Effective Tax Rate,\" and \"Reconciliation of Operating Cash Flow to Free Cash Flow and Adjusted Free Cash Flow.\"Forward-looking statementsThis press release contains forward-looking statements relating to, among other things, the future results of operations, financial condition, expectations, and plans of PayPal Holdings, Inc. and its consolidated subsidiaries that reflect PayPal's current projections and forecasts. Forward-looking statements can be identified by words such as \"may,\" \"will,\" \"would,\" \"should,\" \"could,\" \"expect,\" anticipate,\" \"believe,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"project,\" \"forecast,\" and other similar expressions. Forward-looking statements include, but are not limited to, statements regarding projected financial results for the first quarter and full year 2020, impact and timing of acquisitions, and projected future growth of PayPal's businesses. Forward-looking statements are based upon various estimates and assumptions, as well as information known to PayPal as of the date of this press release, and are inherently subject to numerous risks and uncertainties. Accordingly, actual results could differ materially from those predicted or implied by forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to: the effect of political, business, economic, market, and trade conditions, including any regional or general economic downturn or crisis and any conditions that affect payments or e-commerce growth; fluctuations in foreign currency exchange rates; the competitive, regulatory, payment card association-related and other risks specific to PayPal's payment platform, including the PayPal, PayPal Credit, Braintree, Venmo, Xoom, iZettle, and other products, especially as PayPal continues to expand geographically, introduce new products and support across technologies and payment methods and as new laws and regulations related to payments and financial services come into effect; the impact of PayPal's customer choice initiatives, including on its funding mix and transaction expense; PayPal's ability to successfully compete in an increasingly competitive environment for its businesses, products, and services, including competition for consumers and merchants and the increasing importance of digital and mobile payments and mobile commerce; the outcome of legal and regulatory proceedings and PayPal's need and ability to manage regulatory, tax and litigation risks as its products and services are offered in more jurisdictions and applicable laws become more restrictive; changes to PayPal's capital allocation or management of operating cash; uncertainty surrounding the implementation and impact of the United Kingdom's formal notification of its intent to withdraw from the European Union; cyberattacks and security vulnerabilities in PayPal products and services that could disrupt business, reduce revenue, increase costs, harm our competitive position or our reputation, or lead to liability; the effect of management changes and business initiatives; any changes PayPal may make to its product and service offerings; the effect of any natural disasters or other business interruptions on PayPal or PayPal's customers; PayPal's ability to timely upgrade and develop its technology systems, infrastructure, and customer service capabilities at reasonable cost; PayPal's ability to maintain the stability, security, and performance of its Payments Platform while adding new products and features in a timely fashion; risks that planned acquisitions will not be completed on contemplated terms, or at all, and that any businesses PayPal may acquire may not perform in accordance with its expectations; and PayPal's ability to profitably integrate, manage, and grow businesses that have been acquired or may be acquired in the future. The forward-looking statements in this release do not include the potential impact of any acquisitions or divestitures that may be announced and/or completed after the date hereof.More information about factors that could adversely affect PayPal's results of operations, financial condition and prospects, or that could cause actual results to differ from those expressed or implied in forward-looking statements is included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in PayPal's most recent annual report on Form 10-K and its subsequent quarterly reports on Form 10-Q, copies of which may be obtained by visiting PayPal's Investor Relations website at https://investor.paypal-corp.com or the SEC's website at www.sec.gov. All information in this release speaks as of January 29, 2020. For the reasons discussed above, you should not place undue reliance on the forward-looking statements in this press release. PayPal assumes no obligation to update such forward-looking statements.Copyright © 1999-2020 PayPal. All rights reserved. Other company and product names may be trademarks of their respective owners.      PayPal Holdings, Inc.Non-GAAP Measures of Financial PerformanceTo supplement the company's condensed consolidated financial statements presented in accordance with generally accepted accounting principles, or GAAP, the company uses non-GAAP measures of certain components of financial performance. These non-GAAP measures include non-GAAP net income, non-GAAP diluted earnings per share, non-GAAP operating income, non-GAAP operating margin, non-GAAP effective tax rate, free cash flow, and adjusted free cash flow.These non-GAAP measures are not in accordance with, or an alternative to, measures prepared in accordance with GAAP and may be different from non-GAAP measures used by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. Non-GAAP measures have limitations in that they do not reflect all of the amounts associated with the company's results of operations as determined in accordance with GAAP. These measures should only be used to evaluate the company's results of operations in conjunction with the corresponding GAAP measures.Reconciliation to the most directly comparable GAAP measure of all non-GAAP measures included in this press release can be found in the tables included in this press release.These non-GAAP measures are provided to enhance investors' overall understanding of the company's current financial performance and its prospects for the future. Specifically, the company believes the non-GAAP measures provide useful information to both management and investors by excluding certain expenses, gains and losses, as the case may be, that may not be indicative of its core operating results and business outlook. In addition, because the company has historically reported certain non-GAAP results to investors, the company believes that the inclusion of non-GAAP measures provides consistency in the company's financial reporting.For its internal budgeting process, and as discussed further below, the company's management uses financial measures that do not include stock-based compensation expense, employer payroll taxes on stock-based compensation, amortization or impairment of acquired intangible assets, impairment of goodwill, restructuring-related charges, certain other gains, losses, benefits, or charges that are not indicative of the company's core operating results, and the income taxes associated with the foregoing. In addition to the corresponding GAAP measures, the company's management also uses the foregoing non-GAAP measures in reviewing the financial results of the company.The company excludes the following items from non-GAAP net income, non-GAAP diluted earnings per share, non-GAAP operating income, non-GAAP operating margin, and non-GAAP effective tax rate:Stock-based compensation expense and related employer payroll taxes. This consists of expenses for equity awards under our equity incentive plans. We exclude stock-based compensation expense from our non-GAAP measures primarily because they are non-cash expenses. The related employer payroll taxes are dependent on our stock price and the timing and size of exercises and vesting of equity awards, over which management has limited to no control, and as such management does not believe it correlates to the operation of our business.Amortization or impairment of acquired intangible assets, impairment of goodwill, and transaction expenses from the acquisition or disposal of a business. We incur amortization or impairment of acquired intangible assets and goodwill in connection with acquisitions and may incur significant gains or losses or transactional expenses from the acquisition or disposal of a business and therefore exclude these amounts from our non-GAAP measures. We exclude these items because management does not believe they are reflective of our ongoing operating results.Restructuring. These consist of expenses for employee severance and other exit and disposal costs. The company excludes significant restructuring charges primarily because management does not believe they are reflective of ongoing operating results.Certain other significant gains, losses, benefits, or charges that are not indicative of the company's core operating results. These are significant gains, losses, benefits, or charges during a period that are the result of isolated events or transactions which have not occurred frequently in the past and are not expected to occur regularly in the future. The company excludes these amounts from its non-GAAP results because management does not believe they are indicative of our current or ongoing operating results.Tax effect of non-GAAP adjustments. This adjustment is made to present stock-based compensation and the other amounts described above on an after-tax basis consistent with the presentation of non-GAAP net income.The company also uses free cash flow, a non-GAAP measure. Free cash flow represents operating cash flows less purchases of property and equipment. The company considers free cash flow to be a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business after the purchases of property, buildings, and equipment, which can then be used to, among other things, invest in the company's business, make strategic acquisitions and investments, and repurchase stock. A limitation of the utility of free cash flow as a measure of financial performance is that it does not represent the total increase or decrease in the company's cash balance for the period. In addition to the non-GAAP measures discussed above, the company also analyzes certain measures, including net revenues and operating expenses, on an FX-neutral basis to better measure the comparability of operating results between periods. The company believes that changes in foreign currency exchange rates are not indicative of the company's operations and evaluating growth in net revenues and operating expenses on an FX-neutral basis provides an additional meaningful and comparable assessment of these measures to both management and investors. FX-neutral results are calculated by translating the current period's local currency results with the prior period's exchange rate. FX-neutral growth rates are calculated by comparing the current period's FX-neutral results by the prior period's results, excluding the impact from hedging activities.     View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-reports-fourth-quarter-and-full-year-2019-results-300995613.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "UnionPay International and PayPal Enter Global Partnership Agreement to Accelerate Growth of Digital Payments",
        "subtitle": "",
        "date": "Jan 22, 2020 5:00PM EST",
        "content": "SHANGHAI and SAN JOSE, Calif., Jan. 22, 2020 /PRNewswire/ -- UnionPay International (UPI) and PayPal (NASDAQ: PYPL), today announced a global partnership where both companies will work together to accelerate the growth of their networks. As part of the agreement, PayPal has committed to supporting UPI acceptance globally where PayPal is accepted – giving UnionPay cardholders more choice when shopping. In the future, UPI will explore opportunities to support PayPal's merchant and consumer ambitions in China.\"At PayPal, we are proud of this landmark agreement with UnionPay International and the global impact that this creates for our joint customers, building on our status as the first foreign payments platform licensed to process online payments in China,\" said Jim Magats, senior vice president of global payments, PayPal. \"The partnership will give UnionPay customers more choice when shopping cross border and has the ability to contribute to the overall growth of China's e-commerce ecosystem. It will also give PayPal the opportunity to explore the option to expand PayPal's digital wallet to physical retail locations where UnionPay is accepted in China, or internationally.\"UnionPay cards can now be added to PayPal wallets in Australia, Philippines, Singapore, South Korea and Thailand. During 2020, PayPal and UPI plan to add more than 30 markets, which means that once a UnionPay card is added to the PayPal wallet these cardholders will have the ability to shop at any of the 24 million merchants globally where PayPal is accepted via the PayPal wallet.As part of the agreement, PayPal and UPI have also committed to collaborating to better serve joint customers and merchants to grow digital payments in China and globally. This will include the opportunity for PayPal customers from around the world to use PayPal at the merchants where UnionPay is accepted.\"With about 130 million UnionPay cards issued outside mainland China, UnionPay cards are becoming an important payment option of more and more global customers,\" said Larry Wang, vice president, UnionPay International. \"We are very glad to deepen collaboration with PayPal, the global leader in e-commerce. Both parties will jointly explore and implement the application of new products and new payment modes in the field of cross-border payment, hoping to better serve our cardholders and create greater value for both sides.\"The global partnership also includes a commitment from both companies to create joint customer awareness campaigns to \"Pay with UnionPay\" at PayPal merchants worldwide.About UnionPay InternationalUnionPay International (UPI) is a subsidiary of China UnionPay focused on the growth and support of UnionPay's global business. In partnership with more than 2000 institutions worldwide, UnionPay International has enabled card acceptance in 177 countries and regions with issuance in 58 countries and regions. UnionPay International provides high quality, cost effective and secure cross-border payment services to the world's largest cardholder base and ensures convenient local services to a growing number of global UnionPay cardholders and merchants.About PayPal PayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.Forward-Looking Statements This announcement contains \"forward-looking\" statements within the meaning of applicable securities laws. Forward-looking statements and information relate to future events and future performance and reflect, among other things, the parties' expectations regarding the anticipated benefits of this agreement on their respective businesses. Forward looking statements may be identified by words such as \"seek\", \"believe\", \"plan\", \"estimate\", \"anticipate\", \"expect\", \"project\", \"forecast\", or intend\", and statements that an event or result \"may\"\" \"will\", \"should\", \"could\", or \"might\" occur or be achieved and any other similar expressions.Forward-looking statements involve risks and uncertainties which may cause actual results to differ materially from the statements made. Factors that could cause or contribute to such differences include, but are not limited to, the possibility that the anticipated benefits of the agreement may not be realized fully or within the expected time period. More information about these and other factors can be found in PayPal Holdings, Inc.'s most recent Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings with the Securities and Exchange Commission (the \"SEC\"), and its future filings with the SEC.The forward-looking statements contained in this announcement speak only as of the date hereof.  PayPal expressly disclaims any obligation or undertaking to disseminate any updates or revisions to any forward-looking statements contained herein to reflect any change in the expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.PayPal Holdings, Inc. Contacts Investor Relations Contacts         Gabrielle Rabinovitchgrabinovitch@paypal.comAkila Moorthyamoorthy@paypal.com               Media Relations Contact Chris Morsecmorse@paypal.com+1 914-413-3045UnionPay International ContactsUPIPR@unionpayintl.com+86 21 20265843  View original content to download multimedia:http://www.prnewswire.com/news-releases/unionpay-international-and-paypal-enter-global-partnership-agreement-to-accelerate-growth-of-digital-payments-300991662.htmlSOURCE  PayPal Holdings, Inc.; UnionPay International"
    },
    {
        "title": "PayPal Processed Record $10 Billion in Charitable Donations in 2019",
        "subtitle": "",
        "date": "Jan 16, 2020 7:00AM EST",
        "content": "SAN JOSE, Calif., Jan. 16, 2020 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) today announced that it processed a record $10.3 billion in donations to charities around the world in 2019, and more than $1 billion in the month of December alone, as mobile and other digital channels continue to change how donors engage with nonprofit organizations. Twenty-one percent of all donations processed by PayPal in 2019 were made through mobile devices. \"Our efforts to drive social impact and create value for all of our stakeholders continue to expand. We are continually inspired by the generosity of the expanding PayPal community, which continues to reach new heights,\" said Franz Paasche, SVP, Corporate Affairs, PayPal. \"As we enter 2020, we remain committed to harnessing the power of our technology and scale to provide new ways for people to give to the causes they care about – and to help charitable organizations raise mission-critical funds that make a difference for communities around the world.\"PayPal is one of the largest digital donation platforms in the world, supporting more than 600,000 nonprofits with fundraising and powering giving for platforms including Facebook, GoFundMe, Airbnb, and eBay.\"We're proud to partner with PayPal, whose generous support enabled us to raise funds over the holidays and year-round to help provide comfort and hope to people impacted by disasters and countless other crises. We're thrilled to celebrate this PayPal milestone with their team,\" said Gail McGovern, President and CEO, American Red Cross.Every year, PayPal mobilizes its community of 300 million consumers and merchants to donate to disaster relief efforts and participate in campaigns with signature partners like GivingTuesday, which organizes an international day of charitable giving each December. On GivingTuesday 2019, PayPal processed $106 million for causes around the world.\"PayPal has been a believer in GivingTuesday since its launch in 2012 and is one of our most creative and innovative partners, both in the US and around the world. We are grateful to PayPal for their commitment to this movement and to growing generosity around the world,\" said Asha Curran, Founder and CEO, GivingTuesday. PayPal is currently mobilizing the PayPal community of customers, employees, and partners to support relief efforts for the bushfires in Australia. To learn more and donate, visit paypal.com/bushfires.About PayPal PayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.Contact: Julia Bass jbass@paypal.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-processed-record-10-billion-in-charitable-donations-in-2019-300987912.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "PayPal Completes Acquisition of Honey",
        "subtitle": "",
        "date": "Jan 6, 2020 8:00AM EST",
        "content": "SAN JOSE, Calif., Jan. 6, 2020 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) announced today that it has completed its acquisition of Honey Science Corporation for approximately $4 billion in cash. This transaction will transform the shopping experience for PayPal's consumers while increasing sales and customer engagement for its merchants.\"We're thrilled to complete this transformative transaction and to welcome the Honey team to the PayPal family,\" said Dan Schulman, president and CEO of PayPal. \"The addition of Honey to our platform enables a significant step forward in our commitment to provide powerful services and tools for merchants and consumers, move beyond our core checkout proposition and significantly enhance the shopping experience for our 300 million consumers and merchants.\"Honey Co-founders George Ruan and Ryan Hudson will continue to lead the Honey team as part of PayPal's global consumer product and technology organization, reporting to Senior Vice President John Kunze.To learn more and join Honey, visit www.joinhoney.com/paypal.About PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.About HoneyHoney Science Corporation is an L.A.-based tech company building tools to help people save time and money when shopping online. What started as a browser extension has grown into a suite of free tools that help everyone shop with confidence. From notifying you when a price drops, to showing you the lowest prices available, Honey provides you with the information that you need to make the best decisions with your money. With approximately 17 million monthly active users, Honey has helped millions of people find more than $1 billion in savings in the past year. Visit www.joinhoney.com to shop smarter.Forward-Looking StatementsThis announcement contains \"forward-looking\" statements within the meaning of applicable securities laws. Forward-looking statements and information relate to future events and future performance and reflect PayPal's expectations regarding the impact of this transaction on PayPal's and Honey's financial and operating results and business, the operation and management of Honey after the acquisition, and the timing of the closing of the acquisition. Forward-looking statements may be identified by words such as \"seek\", \"believe\", \"plan\", \"estimate\", \"anticipate\", expect\", \"project, \"forecast\", or \"intend\", and statements that an event or result \"may\", \"will\", \"should\", \"could\", or \"might\" occur or be achieved and any other similar expressions. Forward-looking statements involve risks and uncertainties which may cause actual results to differ materially from the statements made, and, accordingly, readers should not place undue reliance on forward-looking statements and information. Factors that could cause or contribute to such differences include, but are not limited to, the reaction to the transaction of Honey's customers and business partners, the reaction of competitors to the transaction, the retention of Honey's employees, PayPal's plans for Honey, economic and political conditions in the global markets in which PayPal and Honey operate, the future growth of PayPal's and Honey's businesses and the possibility that integration following the transaction may be more difficult than expected.More information about these and other factors that could adversely affect PayPal's results of operations, financial condition and prospects or that could cause actual results to differ materially from those expressed or implied in forward-looking statements can be found in PayPal Holdings, Inc.'s most recent Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings with the Securities and Exchange Commission (the \"SEC\"), and its future filings with the SEC.The forward-looking statements contained in this announcement speak only as of the date hereof. PayPal expressly disclaims any obligation or undertaking to disseminate any updates or revisions to any forward-looking statements contained herein to reflect any change in the expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.ContactsInvestor Relations ContactsGabrielle Rabinovitchgrabinovitch@paypal.comAkila Moorthyamoorthy@paypal.comMedia Relations ContactJosh Criscoejcriscoe@paypal.com646.667.5065 View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-completes-acquisition-of-honey-300981363.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Alibaba, Five Below, Netflix, NVIDIA, or Paypal?",
        "subtitle": "",
        "date": "Dec 31, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 31, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, FIVE, NFLX, NVDA, and PYPL.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alibaba-five-below-netflix-nvidia-or-paypal-300980135.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "PayPal to Acquire Honey",
        "subtitle": "Advances PayPal's leadership in digital commerce",
        "date": "Nov 20, 2019 4:15PM EST",
        "content": "SAN JOSE, Calif., Nov. 20, 2019 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) today announced that it has agreed to acquire Honey Science Corporation, a rapidly-growing technology platform for shopping and rewards, for approximately $4 billion. Honey, in combination with PayPal's two-sided network, will transform the shopping experience for PayPal's consumers while increasing sales and customer engagement for its merchants.Founded in 2012, Honey is best known as a popular discovery tool that helps consumers find savings as they shop online. Honey has continued to grow and evolve, expanding its suite of products and services to include a mobile shopping assistant, offers and rewards program, and price-tracking tools and alerts. With approximately 17 million monthly active users, Honey has helped millions of people find more than $1 billion in savings in the past year. Honey currently works across approximately 30,000 online retailers ranging from fashion and technology, to travel and pizza delivery.The acquisition supports PayPal and Honey's shared mission to simplify and personalize shopping experiences for consumers while driving conversion and increasing consumer engagement and sales for merchants. The combination will help accelerate growth across both companies. Honey will accelerate its growth by driving adoption among PayPal and Venmo's more than 275 million active consumer accounts and sourcing exclusive offers from PayPal's extensive network of 24 million merchant accounts. Honey will enable PayPal to reach consumers at the beginning of their shopping journeys and will enhance PayPal's ability to help merchants acquire and convert consumers by delivering offers that are personalized, timely, and optimized across channels.\"Honey is amongst the most transformative acquisitions in PayPal's history. It provides a broad portfolio of services to simplify the consumer shopping experience, while at the same time making it more affordable and rewarding,\" said Dan Schulman, president and CEO of PayPal. \"The combination of Honey's complementary consumer products with our platform will significantly enhance our ability to drive engagement and play a more meaningful role in the daily lives of our consumers. As a partner of choice for our merchants, this is another way that we can help them build and strengthen their customer relationships, provide personalized offers, and drive incremental sales. The combination of Honey and PayPal adds another significant and meaningful dimension to our two-sided platform.\" Following the acquisition, Honey will retain its headquarters and brand in Los Angeles, California. Honey co-founders George Ruan and Ryan Hudson will continue to lead the Honey team as part of PayPal's global consumer product and technology organization, reporting to Senior Vice President John Kunze. \"Honey's vision has always been to give consumers the tools they need to make the best decisions with their money,\" said Ruan. \"PayPal shares that vision and together we can build powerful commerce capabilities that create real value for both consumers and retailers around the world.\"\"Combining PayPal's assets and reach with our technology, we can build powerful new online shopping experiences for consumers and merchants,\" said Hudson. \"We'll have the ability to help millions of retailers efficiently reach consumers with offers that deliver more and more value to Honey members.\"Honey was profitable on a net income basis in 2018. Subject to customary closing conditions, including the receipt of regulatory approvals, the transaction is expected to close in the first quarter of 2020. The acquisition is expected to be accretive to PayPal's non-GAAP earnings per share in 2021.Perella Weinberg Partners LP is acting as sole financial adviser to PayPal, and Skadden, Arps, Slate, Meagher & Flom LLP is acting as its legal adviser with regard to the transaction. Qatalyst Partners is acting as sole financial adviser to Honey, while Latham & Watkins, LLP is acting as its legal adviser.Webcast and Conference Call InformationPayPal will host a conference call to discuss the transaction at 2:00 p.m. Pacific Standard Time (PST) today. A live webcast of the conference call, together with a slide presentation, can be accessed through the company's investor relations website at https://investor.paypal-corp.com. In addition, an archive of the webcast will be accessible for 90 days through the same link.About PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering 300 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.About HoneyHoney Science Corporation is an L.A.-based tech company building tools to help people save time and money when shopping online. What started as a browser extension has grown into a suite of free tools that help everyone shop with confidence. From notifying you when a price drops, to showing you the lowest prices available, Honey provides you with the information that you need to make the best decisions with your money. With approximately 17 million monthly active users, Honey has helped millions of people find more than $1 billion in savings in the past year. Visit www.joinhoney.com to shop smarter.Forward-Looking StatementsThis announcement contains \"forward-looking\" statements within the meaning of applicable securities laws. Forward-looking statements and information relate to future events and future performance and reflect PayPal's expectations regarding the impact of this transaction on PayPal's and Honey's financial and operating results and business, the operation and management of Honey after the acquisition, and the timing of the closing of the acquisition. Forward-looking statements may be identified by words such as \"seek\", \"believe\", \"plan\", \"estimate\", \"anticipate\", expect\", \"project, \"forecast\", or \"intend\", and statements that an event or result \"may\", \"will\", \"should\", \"could\", or \"might\" occur or be achieved and any other similar expressions.Forward-looking statements involve risks and uncertainties which may cause actual results to differ materially from the statements made, and, accordingly, readers should not place undue reliance on forward-looking statements and information. Factors that could cause or contribute to such differences include, but are not limited to, the timing and possible outcome of security holder and regulatory approvals in connection with the transaction, the possibility that the transaction may not close, the reaction to the transaction of Honey's customers and business partners, the reaction of competitors to the transaction, the retention of Honey's employees, PayPal's plans for Honey, economic and political conditions in the global markets in which PayPal and Honey operate, the future growth of PayPal's and Honey's businesses and the possibility that integration following the transaction may be more difficult than expected. More information about these and other factors that could adversely affect PayPal's results of operations, financial condition and prospects or that could cause actual results to differ materially from those expressed or implied in forward-looking statements can be found in PayPal Holdings, Inc.'s most recent Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings with the Securities and Exchange Commission (the \"SEC\"), and its future filings with the SEC.The forward-looking statements contained in this announcement speak only as of the date hereof.  PayPal expressly disclaims any obligation or undertaking to disseminate any updates or revisions to any forward-looking statements contained herein to reflect any change in the expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.ContactsInvestor Relations Contacts    Gabrielle Rabinovitchgrabinovitch@paypal.comAkila Moorthyamoorthy@paypal.com Media Relations ContactJosh Criscoejcriscoe@paypal.com 646.667.5065Amanda Coffeeacoffee@paypal.com408.221.1984 View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-to-acquire-honey-300962470.htmlSOURCE  PayPal, Inc."
    },
    {
        "title": "Xoom Rolls Out Domestic Money Transfer Services in the U.S.",
        "subtitle": "PayPal's international money transfer service works with Walmart and Ria to offer cash pick-up in minutes at 4,700 Walmart and 175 Ria locations across the country",
        "date": "Nov 12, 2019 6:00AM EST",
        "content": " SAN JOSE, Calif., Nov. 12, 2019 /PRNewswire/ -- Xoom, PayPal's international money transfer service, today rolled out the ability for customers to send money to recipients in the U.S. for the first time. Through strategic alliances with Walmart and Ria, Americans can now use Xoom to send money fast for cash pick-up typically in minutes at nearly 5,000 locations across the country*. Xoom's services potentially benefit more than 44 million foreign-born people in the U.S.1 who send remittances to family and friends in their home countries. With the introduction of domestic money transfer services, Xoom will now serve even more customers, including more than half of Americans who make domestic person-to-person (P2P) payments2. Using Xoom's mobile app or website, consumers will have the ability to send money quickly and securely for cash pick-up at any Walmart or Ria-owned store in the U.S.  \"Many of our customers in the U.S. already send money to loved ones in the country, and they usually prefer that the money is available right away,\" shared Julian King, Xoom's Vice President and General Manager. \"This rollout reinforces our commitment to make money transfers fast, easy and affordable for everyone, whether they are at home or on-the-go.\"\"At Ria, we are delighted to further consolidate our relationship with Xoom and Walmart,\" said Juan Bianchi, CEO of Euronet's Money Transfer Segment. \"Our continued partnership is a fine example of how Ria's technology can serve as an enabler between platforms, offering consumers and partners an added layer of security and compliance screening, in turn facilitating value creation within the Fintech ecosystem.\"Many consumers in the U.S. face personal, institutional and policy-related barriers to access the financial system. These underbanked consumers rely heavily on fringe financial service providers to conduct routine financial transactions and pay high fees in the process. With Xoom's introduction of domestic transfers, Americans can send money at affordable rates for cash pick-up quickly at 4,684 Walmart stores and 175 Ria locations across the United States. For more information on store locations and eligible banks, visit xoom.com. A pioneer in digital remittances, Xoom is a fast way to securely send money, pay bills and reload phones for loved ones in over 160 countries globally. These remittances serve as a lifeline for many people around the world and are used to pay for every day needs like utility bills, healthcare, and education costs, as well as emergencies. The largely cash-based system of sending money across borders is full of paperwork, high fees, standing in line and an ever-present uncertainty of when, and if, the money will arrive when it's needed. By providing fast and more secure payment options for customers to seamlessly and securely send money across borders by going online or using a mobile device, PayPal and Xoom are helping to expand and improve the financial health of millions of people worldwide.*Fees and Limitations applyAbout PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 295 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com. About Ria Money Transfer Ria, a subsidiary of Euronet Worldwide, Inc. (NASDAQ: EEFT), is a global leader in the money transfer industry. The company is steadfast in its commitment to its clients and their communities, offering fast, secure and affordable money transfers through a network of over 385,000 locations spanning across 160 countries and online at www.riamoneytransfer.com. For more information visit www.corporate.riafinancial.com.Media ContactJaymie Sinlao1-650-557-8173Jsinlao@paypal.com 1 According to the 2018 American Community Survey single-year estimates, commissioned by the U.S. Census Bureau.2 According to data from a 2017 Aité Group survey of 1,974 U.S. consumers about their person-to-person (P2P) payments behavior.  View original content to download multimedia:http://www.prnewswire.com/news-releases/xoom-rolls-out-domestic-money-transfer-services-in-the-us-300956007.htmlSOURCE  PayPal, Inc."
    },
    {
        "title": "Thinking about buying stock in AstraZeneca, Bank of America, Nike, Paypal, or Snap?",
        "subtitle": "",
        "date": "Oct 24, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 24, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AZN, BAC, NKE, PYPL, and SNAP.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-astrazeneca-bank-of-america-nike-paypal-or-snap-300944844.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Citigroup, Mastercard, Nike, Paypal, or Exxon Mobil?",
        "subtitle": "",
        "date": "Oct 22, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 22, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for C, MA, NKE, PYPL, and XOM.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-citigroup-mastercard-nike-paypal-or-exxon-mobil-300942974.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Xoom Launches Bank Deposits to South Korea",
        "subtitle": "PayPal's international remittance provider enables bank deposits to major banks in South Korea in collaboration with PayGate",
        "date": "Oct 3, 2019 12:00PM EDT",
        "content": "SAN JOSE, Calif., Oct. 3, 2019 /PRNewswire/ -- Xoom, PayPal's international money transfer service, today announced that customers in the U.S., U.K., Canada and 31 markets across Europe can now send money direct to bank accounts in South Korea to support their families at competitive rates. Funds sent via the website or mobile app to Kookmin Bank, Woori Bank, and Shinhan Bank can be accessed within minutes1, making Xoom one of the fastest ways to send money to South Korea. The global remittance market is an estimated $689 billion in 20182 with South Koreans residing abroad remitting $6.2BN last year3, according to World Bank data. The United States alone has 1.4 million4 people who have immigrated from the Republic of Korea, many of whom send money back home to provide critical financial support to their families. \"At Xoom, we are constantly innovating to provide the best possible money transfer service to families spread across the globe. We are delighted to offer South Korean foreign residents all the benefits of our service – speed, convenience and competitive rates. When they use Xoom, they no longer have to wait in line, fill out forms or pay higher fees to send money back home,\" said Julian King, Xoom's Vice President and General Manager.\"South Koreans who've moved abroad have wanted more convenient and affordable ways to support their families back home. We are excited to partner with PayPal to offer their innovative global remittance service Xoom to South Koreans living in Canada, Europe and the U.S.,\" shared Mountie Lee, PayGate's General Manager. A pioneer in digital remittances, Xoom is a fast way to securely send money, pay bills and reload phones for loved ones in over 160 countries globally. These remittances serve as a lifeline for many people around the world and are used to pay for things like utility bills, healthcare, education costs and emergencies. The largely cash-based system of sending money across borders is full of paperwork, high fees, standing in line and an ever-present uncertainty of when, and if, the money will arrive when it's needed. By providing fast and more secure payment options for customers to seamlessly send money across borders by going online or using a mobile device, PayPal and Xoom are helping to expand and improve the financial health of millions of people worldwide. To send money internationally in a few simple steps, download Xoom's mobile app on Android and iOS or go to xoom.com.About PayPalPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 286 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com. 1 Send money to bank accounts in Korea in minutes when sent 12:30AM to 11:30PM KST on business days. Transfers subject to review and may be delayed or stopped if an issue is identified. Business days are Monday – Friday, excluding bank holidays.2 World Bank Migration and Development Brief 31, 20193 World Bank Data, 20184 Source: US census data 2010  View original content to download multimedia:http://www.prnewswire.com/news-releases/xoom-launches-bank-deposits-to-south-korea-300929988.htmlSOURCE  PayPal, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Alibaba, Microsoft, Netflix, Paypal, or Wells Fargo?",
        "subtitle": "",
        "date": "Oct 1, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 1, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, MSFT, NFLX, PYPL, and WFC.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alibaba-microsoft-netflix-paypal-or-wells-fargo-300928678.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "PayPal Announces Pricing of Senior Notes Offering",
        "subtitle": "",
        "date": "Sep 19, 2019 7:11PM EDT",
        "content": "SAN JOSE, Calif., Sept. 19, 2019 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) announced today that it has priced its offering of $5.0 billion aggregate principal amount of senior notes, consisting of $1.0 billion aggregate principal amount of 2.200% notes due 2022, $1.25 billion aggregate principal amount of 2.400% notes due 2024, $1.25 billion aggregate principal amount of 2.650% notes due 2026 and $1.5 billion aggregate principal amount of 2.850% notes due 2029. The offering is expected to close September 26, 2019, subject to customary closing conditions.PayPal estimates that the net proceeds from the offering will be approximately $4.97 billion, before deducting offering expenses. PayPal intends to use a portion of the net proceeds from the offering to repay outstanding borrowings under its 364-day term loan credit facility and the remainder for general corporate purposes, which may include funding the repayment or redemption of outstanding debt, share repurchases, ongoing operations, capital expenditures and possible acquisitions of businesses or assets and strategic investments. As of June 30, 2019, $2.5 billion was outstanding under PayPal's 364-day term loan credit facility at a weighted average interest rate of 3.47%.Goldman Sachs & Co. LLC, J.P. Morgan Securities LLC, Morgan Stanley & Co. LLC, BNP Paribas Securities Corp., BofA Securities, Inc., HSBC Securities (USA) Inc. and MUFG Securities Americas Inc. are acting as joint book-running managers of the offering.This offering is being made under an automatic effective shelf registration statement on Form S-3 filed by PayPal with the Securities and Exchange Commission (SEC) and only by means of a prospectus supplement and accompanying prospectus. Before you invest, you should read the prospectus supplement and accompanying prospectus, as well as other documents PayPal has filed or will file with the SEC for more complete information about PayPal and this offering. These documents may be obtained for free by searching the SEC online database (EDGAR) on the SEC website at www.sec.gov. Alternatively, copies of the preliminary prospectus supplement and accompanying prospectus, and, when available, the final prospectus supplement for the offering may be obtained by contacting the joint book-running managers at the following addresses or telephone numbers:\n  \n\n  \n    \n      Goldman Sachs & Co. LLC200 West StreetNew York, NY 10282Attn: Prospectus DepartmentProspectus-NY@ny.email.gs.com1-212-902-1171\n                  J.P. Morgan Securities LLC383 Madison AvenueNew York, New York 10179Attn: Investment Grade Syndicate Desk, 3rd FloorTelephone collect at 1-212-834-4533\n                  Morgan Stanley & Co. LLC180 Varick Street, 2nd FloorNew York, NY 10014Attn: Prospectus Departmentprospectus@morganstanley.com1-866-718-1649\n              \n  \n  \nThis press release shall not constitute an offer to sell, or the solicitation of an offer to buy, nor shall there be any sale of the notes in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. About PayPal Holdings, Inc.PayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 286 million consumers and merchants in more than 200 markets to join and thrive in the global economy.Forward-Looking StatementsThis press release contains \"forward-looking\" statements within the meaning of applicable securities laws, including statements related to the anticipated terms of the offering, the anticipated closing of the offering, the expected use of proceeds of the notes and other statements that are not historical fact. These forward-looking statements can be identified by words such as \"may,\" \"will,\" \"would,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"believe,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"project,\" \"forecast\" and other similar expressions. Forward-looking statements are based upon various estimates and assumptions, as well as information known to PayPal as of the date of this press release, and are inherently subject to numerous risks and uncertainties. Accordingly, actual results could differ materially from those predicted or implied by forward-looking statements.  For the reasons discussed above, you should not place undue reliance on the forward-looking statements in this press release. PayPal assumes no obligation to update such forward-looking statements, except as required by law.  View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-announces-pricing-of-senior-notes-offering-300922165.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "PayPal Announces Senior Notes Offering",
        "subtitle": "",
        "date": "Sep 19, 2019 8:42AM EDT",
        "content": "SAN JOSE, Calif., Sept. 19, 2019 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) announced today that it intends to offer senior notes in one or more tranches, subject to market and customary conditions.PayPal intends to use a portion of the net proceeds from the offering to repay outstanding borrowings under its 364-day term loan credit facility and the remainder for general corporate purposes, which may include funding the repayment or redemption of outstanding debt, share repurchases, ongoing operations, capital expenditures and possible acquisitions of businesses or assets and strategic investments. As of June 30, 2019, $2.5 billion was outstanding under PayPal's 364-day term loan credit facility at a weighted average interest rate of 3.47%.Goldman Sachs & Co. LLC, J.P. Morgan Securities LLC, Morgan Stanley & Co. LLC, BNP Paribas Securities Corp., BofA Securities, Inc., HSBC Securities (USA) Inc. and MUFG Securities Americas Inc. are acting as joint book-running managers of the offering.This offering is being made under an automatic effective shelf registration statement on Form S-3 filed by PayPal with the Securities and Exchange Commission (SEC) and only by means of a prospectus supplement and accompanying prospectus. Before you invest, you should read the prospectus supplement and accompanying prospectus, as well as other documents PayPal has filed or will file with the SEC for more complete information about PayPal and this offering. These documents may be obtained for free by searching the SEC online database (EDGAR) on the SEC website at www.sec.gov. Alternatively, copies of the preliminary prospectus supplement and accompanying prospectus for the offering may be obtained by contacting the joint book-running managers at the following addresses or telephone numbers:This press release shall not constitute an offer to sell, or the solicitation of an offer to buy, nor shall there be any sale of the notes in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.About PayPal Holdings, Inc.PayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 286 million consumers and merchants in more than 200 markets to join and thrive in the global economy.Forward-Looking Statements This press release contains \"forward-looking\" statements within the meaning of applicable securities laws, including statements related to the anticipated offering of the notes, the expected use of proceeds of the notes and other statements that are not historical fact. These forward-looking statements can be identified by words such as \"may,\" \"will,\" \"would,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"believe,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"project,\" \"forecast\" and other similar expressions. Forward-looking statements are based upon various estimates and assumptions, as well as information known to PayPal as of the date of this press release, and are inherently subject to numerous risks and uncertainties. Accordingly, actual results could differ materially from those predicted or implied by forward-looking statements.  For the reasons discussed above, you should not place undue reliance on the forward-looking statements in this press release. PayPal assumes no obligation to update such forward-looking statements, except as required by law.  View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-announces-senior-notes-offering-300921678.htmlSOURCE  PayPal Holdings, Inc."
    },
    {
        "title": "PayPal Credit Extends Online Promotional Financing for Lower Cost Purchases",
        "subtitle": "Responding to market demand, PayPal Credit launches 3 Month Easy Payments at 0% APR offer on items starting at $30, opening up additional online promotional financing options to qualified retailers this holiday season",
        "date": "Sep 18, 2019 7:00AM EDT",
        "content": "SAN JOSE, Calif., Sept. 18, 2019 /PRNewswire/ -- PayPal Credit is enhancing its promotional financing offering to purchases starting at $30, making it possible for more retailers to now tap into the millions of consumers in the U.S. who already use PayPal Credit.To help more retailers attract more customers and drive sales this holiday season, PayPal Credit is extending its promotional financing offering to purchases starting at $30 for the first time. Retailers will be able to offer 3 month Easy Payments at 0% APR on purchases of $30 and above with no down payment, and the retailer gets paid up front (See terms). PayPal Credit is providing an easy integration with a singular line of code that will allow merchants to promote the offer across their online storefronts. When consumers use this new offer from PayPal Credit, the merchant gets paid in full, and PayPal Credit manages the consumer's digital, reusable credit line. In partnership with Synchrony Bank, the company is piloting this offer during the holiday season, with the intent to expand rollout in 2020. Online purchase financing has become an important tool for consumers looking to buy now and pay over time. This is especially true during the holiday season, where U.S. consumer holiday spending has historically increased1. Mobile shopping eclipsed desktop shopping for the first time in the 2018 holiday season2, while data from PayPal revealed that 80% of PayPal Credit transactions are under $99, even without a special financing offer3.With 45% of PayPal Credit volume on mobile, consumers are looking for seamless, mobile-first financing options for purchases at increasingly lower ticket sizes4.For merchants, PayPal Credit helps drive higher sales, increase average order volume, and improve customer loyalty. When businesses add the PayPal Credit button at checkout, retailers see an average 15 percent increase in incremental sales, starting within the first 3 months5 and 56 percent of the 2000 users surveyed say they are more likely to shop at a retailer again if they offer PayPal Credit.6\"PayPal Credit has created a culture of empowered shoppers. Shoppers do not need to apply for a new credit line each time they use PayPal Credit, they only need to apply once. In fact, unlike one-time use installments products, 90 percent of PayPal Credit spend is made by existing customers reusing their credit line and therefore does not require a new credit application,\" said Susan Schmidt, VP of US Consumer Credit at PayPal. Susan continued, \"With this new offering, merchants will also be able to take advantage of PayPal's affiliate marketing program, with content marketed to more than three million consumers across the customer lifecycle. PayPal helps drive consumers to merchants' websites to help build incremental revenue growth.\" PayPal Credit is the only online financing platform that can tap into PayPal's two-sided network of 286 million active accounts, including 23 million merchant accounts. Backed by 15+ years of experience, in February 2019 PayPal Credit surpassed $50B in transaction volume and has withstood financial cycles, including the Great Recession of 2008. Consumers will still be able to take advantage of No Interest if paid in full in 6 months on purchases of $99 or more. (Interest will be charged to the account from the purchase date if the balance is not paid in full within 6 months. Minimum monthly payments required. Subject to credit approval. See terms.)About PayPal Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal Holdings, Inc. (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal's 286 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo, Xoom and iZettle, enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. For more information on PayPal, visit https://www.paypal.com/about. For PayPal Holdings, Inc. financial information, visit https://investor.paypal-corp.com.Follow us on Twitter: @PayPalNews_______________________________1 2018 Deloitte holiday retail survey, https://www2.deloitte.com/us/en/insights/industry/retail-distribution/holiday-retail-sales-consumer-survey.html2 2018 Salesforce Holiday Shopping Report, https://www.salesforce.com/solutions/industries/retail/holiday-shopping-report/3 Internal PayPal Analytics, representative of PayPal and PayPal Credit transaction data between August 2018 – September 20194 Ibid5 Average incremental sales based on PayPal's analysis of internal data among middle market merchants with annual sales above $5MM against a similar control population between January 2013 and March 2018.6 Online study commissioned by PayPal and conducted by Logica Research in November 2018 involving 2,000 U.S. consumers, half were PayPal Credit users and half were non-PayPal Credit users. View original content to download multimedia:http://www.prnewswire.com/news-releases/paypal-credit-extends-online-promotional-financing-for-lower-cost-purchases-300920314.htmlSOURCE  PayPal"
    },
    {
        "title": "Thinking about trading options or stock in Amazon, Facebook, Intel, Paypal, or Starbucks?",
        "subtitle": "",
        "date": "Jul 24, 2019 9:31AM EDT",
        "content": "NEW YORK, July 24, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMZN, FB, INTC, PYPL, and SBUX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amazon-facebook-intel-paypal-or-starbucks-300890228.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Snupit Releases Results From its Popular Small Business Survey",
        "subtitle": "",
        "date": "Apr 15, 2019 10:38AM EDT",
        "content": "The goal of Snupit's survey of small business owners in South Africa was to understand how professionals feel about the experiences they have when doing business therePIETERMARITZBURG, SOUTH AFRICA / ACCESSWIRE / April 15, 2019 / Snupit recently conducted a survey with small business owners who are listed on the Snupit platform. The survey's goal was to better understand how professionals and business owners feel about the experiences and challenges they face doing business in South Africa. The company had recently participated in the 2019 Business Show in Johannesburg where Snupit met with many users and recorded their testimonials. According to Snupit's Chief Executive Officer and Co-Founder, Avinash Samlall, the survey is another step to get a better understanding of its users.To read positive reviews from some of the many satisfied professionals who use Snupit, please check out https://www.snupit.co.za/customer-testimonials.aspx.Talking about the survey Mr. Samlall said, ''At Snupit we like to keep a finger on the market's pulse. An intimate understanding of the Pros using our service is what helps us continually improve and grow. We're always learning how to make things easier and more efficient for our users.''Following are some of the key findings of the survey:Commenting on the findings, Mr. Samlall added, ''Ultimately, it is about making Snupit a more effective and profitable tool that empowers small businesses across South Africa. And information from the survey and other sources helps us make it happen.''Empathizing with users is the cornerstone of every successful business and service. Snupit's survey is one of the many things the company does to remain intimately connected with its growing user base.About Snupit:Founded in 2012, Snupit makes it easier for millions of customers to use technology to find and hire trusted small businesses across the country. Snupit is one of the largest local services companies in South Africa offering over 600 categories ranging from handymen, to wedding caterers to maths tutors. The service was created by Snupit's founder after he couldn't find a particular service online after searching for several days. Today, Snupit has 2 million monthly users and has 350,000 local professionals and businesses listed. For more information, visit www.snupit.co.za/.Contact InformationSnupitAddress: 2 Sanders RoadScottsville, PietermaritzburgSouth AfricaEmail: press@snupit.co.zaContact: Mithundra SivenandanPhone: 010 541 0200Contact:Mithundra Sivenandanpress@snupit.co.za010 541 0200SOURCE: Snupit"
    },
    {
        "title": "Option-trading opportunities on Delta Air Lines Inc., PayPal Inc., Roku Inc., Sony Corp., and Symantec Corp.",
        "subtitle": "",
        "date": "Apr 9, 2019 9:31AM EDT",
        "content": "NEW YORK, April 9, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for DAL, PYPL, ROKU, SNE, and SYMC.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/option-trading-opportunities-on-delta-air-lines-inc-paypal-inc-roku-inc-sony-corp-and-symantec-corp-300828001.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Check Out The Company That Created Digital Checks with Instant Payments",
        "subtitle": "",
        "date": "Apr 3, 2019 1:40PM EDT",
        "content": "DALLAS, TX / ACCESSWIRE / April 3, 2019 / The most immediate relationship the average person has with fintech comes in the form of digital payment services. Apps like PayPal, Venmo, and Zelle have made it easier than ever to send money to friends and coworkers for things as small as food, drinks, or concert tickets. Cash is a relic of the past.Regardless of such convenience, there is much to be improved in the digital transaction space. Processing and security fees applied on a percentage basis prevent the widespread adoption of such digital services. Additionally, paper checks continue to be used by individuals, businesses, and even the government. The Federal Reserve Bank estimates that it processes 15.2 billion paperchecks per year.Checkbook Inc. today announced the launch of Instant Pay. Businesses can push money instantly into millions of individual and business bank accounts without collecting sensitive routing or account information. There is no need for recipients to sign up for any service or download any app.With over 19 billion checks for over $30 trillion sent in 2013, B2B checks cost businesses $25 billion a year. Yet conducting the money transfers over the traditional banking backend costs Checkbook merely pennies each time. It's one of those classic startup businesses where you just wouldn't expect that tech could cut prices so low.The business model works a bit like Dropbox in the sense that Checkbook gives away its service to consumers in hopes of infiltrating businesses that it will charge. Rather than try to sell Checkbook's convenience to companies one at a time, it hopes to gain viral traction and parlay that into real customers. That opportunity attracted a seed round from Boost.vc, Rocketship.vc, AngelList's founders, and a slew of angels including Tim Draper.Until now, most bank to bank transactions in the United States take 3 to 5 business days since funds traditionally travel along the ACH infrastructure, which is 40+ years old. ACH transactions require recipient on-boarding as a prerequisite, which is a huge barrier, especially for new or one-time payments. Today, vendors, suppliers and consumers desire that funds will hit their bank accounts faster and effortlessly. Checkbook has innovated the instant payment solution with these factors in mind. The company enables this faster payment method across a number of industries with a variety of payor and payee entities using VISA Direct rails.One such partner is Yooz, which provides a seamless Accounts Payable automation solution for SMEs.Laurent Charpentier, Chief Operations Officer, explains their business places tremendous value on getting their customers' vendor invoices paid as quickly as possible. \"Our customers are looking for the easiest and most automated way to process, approve and pay their vendor invoices without losing visibility and control. The cycle time from capture to payment is really important to avoid late payment fees, but even more important to negotiate early payment discounts and generate value out of the AP process. While traditional ACH solves some of the paper issues compared to traditional checks, Checkbook now provides great additional value with InstantPay, a solution for our customers and their vendors to operate even faster.\"CONTACT: Shazir@imperium-Pr.comSOURCE:SV Advisory Group"
    }
]