[
    {
        "title": "Qualcomm Earnings Release Available on Company's Investor Relations Website",
        "subtitle": "",
        "date": "Feb 5, 2020 4:02PM EST",
        "content": "SAN DIEGO, Feb. 5, 2020 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced the Company's financial results for its first quarter of fiscal 2020 through an earnings release that is available on the Qualcomm Investor Relations website at http://investor.qualcomm.com/results.cfm. The earnings release will be furnished to the Securities and Exchange Commission (SEC) on a Form 8-K and will be available on the SEC website at http://www.sec.gov.As previously announced, Qualcomm will host a conference call to discuss its fiscal first quarter results which will be broadcast live on February 5, 2020, beginning at 1:45 p.m. Pacific Time (PT) at http://investor.qualcomm.com/events.cfm. An audio replay will be available at http://investor.qualcomm.com/events.cfm and via telephone following the live call for 30 days thereafter. To listen to the replay via telephone, U.S. callers may dial (877) 660-6853 and international callers may dial (201) 612-7415. Callers should use reservation number 13697473.       About Qualcomm Qualcomm is the world's leading wireless technology innovator and the driving force behind the development, launch and expansion of 5G. When we connected the phone to the internet, the mobile revolution was born. Today, our foundational technologies enable the mobile ecosystem and are found in every 3G, 4G and 5G smartphone. We bring the benefits of mobile to new industries, including automotive, the internet of things and computing, and are leading the way to a world where everything and everyone can communicate and interact seamlessly.Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including our QCT semiconductor business. For more information, visit www.qualcomm.com. Qualcomm Contact:Mauricio Lopez-Hodoyan, Investor RelationsPhone:  1-858-658-4813Email:  ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-earnings-release-available-on-companys-investor-relations-website-300999782.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm Schedules First Quarter Fiscal 2020 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Jan 24, 2020 9:00AM EST",
        "content": "SAN DIEGO, Jan. 24, 2020 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that it will publish the Company's financial results for its first quarter fiscal 2020 on Wednesday, February 5, 2020, after the close of the market on the Company's Investor Relations website, at https://investor.qualcomm.com/financial-information. The earnings release will also be furnished to the Securities and Exchange Commission (SEC) on a Form 8-K, which will be available on the SEC website at http://www.sec.gov. Qualcomm will host a conference call to discuss its first quarter fiscal 2020 results which will be broadcast live on February 5, 2020, beginning at 1:45 p.m. Pacific Time (PT) at https://investor.qualcomm.com/news-events/events. An audio replay will be available at https://investor.qualcomm.com/news-events/events and via telephone following the live call for 30 days thereafter. To listen to the replay via telephone, U.S. callers may dial (877) 660-6853 and international callers may dial (201) 612-7415. Callers should use reservation number 13697473.      About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and to encourage new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including our QCT semiconductor business. For more information, visit www.qualcomm.com. Qualcomm Contact:  Mauricio Lopez-HodoyanVice President, Investor Relations Phone: (858) 658-4813Email: ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-schedules-first-quarter-fiscal-2020-earnings-release-and-conference-call-300992554.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm Announces Quarterly Cash Dividend",
        "subtitle": "",
        "date": "Jan 17, 2020 9:00AM EST",
        "content": "SAN DIEGO, Jan. 17, 2020 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced a quarterly cash dividend of $0.62 per common share, payable on March 26, 2020, to stockholders of record at the close of business on March 5, 2020. About Qualcomm Qualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and to encourage new opportunities in connected cars, remote delivery of health care services, and the IoT – including smart cities, smart homes and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including our QCT semiconductor business. For more information,visit www.qualcomm.com.Qualcomm is a registered trademark of Qualcomm Incorporated.  All other trademarks are the property of their respective owners.Qualcomm Contact:Mauricio Lopez-Hodoyan, Investor RelationsPhone:  1-858-658-4813Email:  ir@qualcomm.com  View original content:http://www.prnewswire.com/news-releases/qualcomm-announces-quarterly-cash-dividend-300988740.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Thinking about buying stock in Cronos Group, FuelCell Energy, Alphabet, QUALCOMM, or Sorrento Therapeutics?",
        "subtitle": "",
        "date": "Jan 10, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 10, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for CRON, FCEL, GOOGL, QCOM, and SRNE.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-cronos-group-fuelcell-energy-alphabet-qualcomm-or-sorrento-therapeutics-300984892.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Boeing, Mastercard, QUALCOMM, or Skyworks Solutions?",
        "subtitle": "",
        "date": "Dec 12, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 12, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BA, MA, QCOM, and SWKS.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-boeing-mastercard-qualcomm-or-skyworks-solutions-300974051.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Beyond Meat, Costco, QUALCOMM, Shopify, or Verizon?",
        "subtitle": "",
        "date": "Dec 6, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 6, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BYND, COST, QCOM, SHOP, and VZ.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-beyond-meat-costco-qualcomm-shopify-or-verizon-300970640.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Facebook, Home Depot, QUALCOMM, Starbucks, or Square?",
        "subtitle": "",
        "date": "Nov 22, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 22, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FB, HD, QCOM, SBUX, and SQ.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-facebook-home-depot-qualcomm-starbucks-or-square-300963753.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Alibaba, Microsoft, Philip Morris, Qualcomm, or Starbucks?",
        "subtitle": "",
        "date": "Nov 11, 2019 9:31AM EST",
        "content": " NEW YORK, Nov. 11, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, MSFT, PM, QCOM, and SBUX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alibaba-microsoft-philip-morris-qualcomm-or-starbucks-300955451.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about buying stock in Advanced Micro Devices, General Electric, QUALCOMM, Teva Pharmaceutical, or Uber Technologies?",
        "subtitle": "",
        "date": "Nov 7, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 7, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMD, GE, QCOM, TEVA, and UBER.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-advanced-micro-devices-general-electric-qualcomm-teva-pharmaceutical-or-uber-technologies-300953912.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Qualcomm Names Akash Palkhiwala as Chief Financial Officer",
        "subtitle": "",
        "date": "Nov 6, 2019 4:05PM EST",
        "content": "SAN DIEGO, Nov. 6, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that its Board of Directors has unanimously approved the appointment of Akash Palkhiwala as executive vice president and chief financial officer. \"Akash's deep understanding of our business both operationally and strategically makes him the ideal individual to lead our finance function as we embark on a period that I believe may present the biggest opportunity for growth in Qualcomm's history,\" said Steve Mollenkopf, CEO of Qualcomm Incorporated. \"As the 5G ramp begins, I am thrilled to congratulate Akash on this appointment.\" Palkhiwala has been serving the Company as interim CFO since August. Previously, he was Senior Vice President and finance lead for QCT, with responsibility for finance and accounting for all chipset products and segments including Mobile, RF Front End, Compute, Auto, Connectivity and Networking, and IoT.Palkhiwala joined Qualcomm in 2001 and has held a variety of roles in Finance, including Treasurer and lead for Corporate Finance overseeing Qualcomm's overall financial planning and analysis. He has been part of the senior finance leadership team for more than 10 years.Palkhiwala holds an undergraduate degree in Mechanical Engineering from L.D. College of Engineering in India and an MBA from the University of Maryland. About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates.  When we connected the phone to the Internet, the mobile revolution was born.  Today, our inventions are the foundation for life-changing products, experiences, and industries.  As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT - including smart cities, smart homes and wearables.  Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio.  Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including our QCT semiconductor business.  For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.Qualcomm Contacts:Pete Lancia, Corporate CommunicationsPhone:  1-858-845-5959Email: corpcomm@qualcomm.comMauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-658-5431Email: ir@qualcomm.com  View original content:http://www.prnewswire.com/news-releases/qualcomm-names-akash-palkhiwala-as-chief-financial-officer-300953217.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm Earnings Release Available on Company's Investor Relations Website",
        "subtitle": "",
        "date": "Nov 6, 2019 4:00PM EST",
        "content": "SAN DIEGO, Nov. 6, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced the Company's financial results for its fiscal fourth quarter and year ended September 29, 2019 through an earnings release that is available on the Qualcomm Investor Relations website at http://investor.qualcomm.com/results.cfm. The earnings release will be furnished to the Securities and Exchange Commission (SEC) on a Form 8-K and will be available on the SEC website at http://www.sec.gov.As previously announced, Qualcomm will host a conference call to discuss its fiscal fourth quarter and year ended September 29, 2019 results which will be broadcast live on November 6, 2019, beginning at 1:45 p.m. Pacific Time (PT) at http://investor.qualcomm.com/events.cfm. An audio replay will be available at http://investor.qualcomm.com/events.cfm and via telephone following the live call for 30 days thereafter. To listen to the replay via telephone, U.S. callers may dial (877) 660-6853 and international callers may dial (201) 612-7415. Callers should use reservation number 13695634.       About Qualcomm Qualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including our QCT semiconductor business. For more information, visit www.qualcomm.com. Qualcomm Contact:Mauricio Lopez-Hodoyan, Investor RelationsPhone:  1-858-658-4813Email:  ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-earnings-release-available-on-companys-investor-relations-website-300953236.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Thinking about trading options or stock in Apple, Caterpillar, Chevron, Goldman Sachs, or Qualcomm?",
        "subtitle": "",
        "date": "Nov 4, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 4, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, CAT, CVX, GS, and QCOM.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-caterpillar-chevron-goldman-sachs-or-qualcomm-300950717.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Qualcomm Schedules Fourth Quarter and Fiscal 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Oct 23, 2019 9:00AM EDT",
        "content": "SAN DIEGO, Oct. 23, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that it will publish the Company's financial results for its fourth quarter and fiscal 2019 on Wednesday, November 6, 2019 after the close of the market on the Company's Investor Relations website, at http://investor.qualcomm.com/results.cfm. The earnings release will also be furnished to the Securities and Exchange Commission (SEC) on a Form 8-K, which will be available on the SEC website at http://www.sec.gov. Qualcomm will host a conference call to discuss its fourth quarter and fiscal 2019 results which will be broadcast live on November 6, 2019, beginning at 1:45 p.m. Pacific Time (PT) at http://investor.qualcomm.com/events.cfm. An audio replay will be available at http://investor.qualcomm.com/events.cfm and via telephone following the live call for 30 days thereafter. To listen to the replay via telephone, U.S. callers may dial (877) 660-6853 and international callers may dial (201) 612-7415. Callers should use reservation number 13695634.About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including the QCT semiconductor business. For more information, visit www.qualcomm.com. Qualcomm Contact:  Mauricio Lopez-HodoyanVice President, Investor Relations Phone: (858) 658-4813Email: ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-schedules-fourth-quarter-and-fiscal-2019-earnings-release-and-conference-call-300941495.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm Announces Quarterly Cash Dividend",
        "subtitle": "",
        "date": "Oct 15, 2019 9:00AM EDT",
        "content": " SAN DIEGO, Oct. 15, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced a quarterly cash dividend of $0.62 per common share, payable on December 19, 2019, to stockholders of record at the close of business on December 5, 2019. About Qualcomm Qualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including the QCT semiconductor business. For more information, visit www.qualcomm.com.Qualcomm is a registered trademark of Qualcomm Incorporated. All other trademarks are the property of their respective owners.Qualcomm Contact:Mauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-658-4813Email: ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-announces-quarterly-cash-dividend-300938116.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Thinking about buying stock in Aurora Cannabis, Facebook, Micron Technology, Histogenics, or Qualcomm?",
        "subtitle": "",
        "date": "Oct 9, 2019 9:31AM EDT",
        "content": "NEW YORK, Oct. 9, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ACB, FB, MU, OCGN, and QCOM.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-aurora-cannabis-facebook-micron-technology-histogenics-or-qualcomm-300934702.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Qualcomm Acquires Remaining Interest in RF360 Holdings",
        "subtitle": "--    Strengthens RF Business to Drive 5G Era and Paves Way for Future Growth --",
        "date": "Sep 16, 2019 7:30AM EDT",
        "content": "SAN DIEGO, Sept. 16, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) announced a significant milestone in its 5G strategy and leadership by completing the acquisition of the remaining interest in RF360 Holdings Singapore Pte. Ltd., a joint venture with TDK Corporation (TSE: 6762)1. Together with Qualcomm Technologies, Inc., the joint venture has produced RF front-end (RFFE) filters which enable Qualcomm Technologies to deliver complete 4G/5G RFFE solutions. With this acquisition, Qualcomm Technologies is able to provide customers a complete end-to-end solution from modem to antenna, the Qualcomm® Snapdragon™ 5G Modem-RF System, including the world's first commercial 5G NR sub-6 and mmWave solutions, integrating power amplifiers, filters, multiplexers, antenna tuning, LNAs, switching and envelope tracking products2. Qualcomm Technologies' second generation RFFE solutions for its 5G portfolio will further enable OEM customers to design thin, high-performance, battery-efficient 5G multimode devices at scale and on time. Qualcomm Technologies' system-level innovations such as wideband envelope tracking and adaptive antenna tuning intelligently combine the modem and RFFE to help achieve best-in-class 4G/5G power efficiency, data speeds and coverage. Due to the complexity of 5G, with its new spectrum and wider bandwidths, Qualcomm Technologies' advanced RFFE solutions are very well-positioned to win future smartphone designs.This acquisition is the final step to formally bring in-house more than 20 years of expertise in RFFE filtering. Qualcomm Technologies now has one of the broadest portfolios of RFFE products, including integrated and discrete micro-acoustic components utilizing RFFE filter technologies such as BAW, SAW, TC-SAW, as well as Thin Film SAW, all of which are core to developing and producing filters, duplexers, multiplexers for discrete, power amplifiers and diversity modules, as well as n-plexers and extractors for the very complex front end necessary for today's leading mobile phones and connected devices. \"Our goal in the formation of this joint venture was to enhance Qualcomm Technologies' front-end solutions to enable us to deliver a truly complete solution to the mobile device ecosystem, and we have done exactly that,\" said Cristiano Amon, president of Qualcomm Incorporated. \"We are excited about the strong adoption of Qualcomm Snapdragon 5G Modem-RF Systems in virtually all of our 150+ 5G design wins. Our systems approach has created a benchmark for 5G RFFE performance. I am very pleased to formally welcome to Qualcomm the talented employees of the joint venture, who already have been an integral part of the Qualcomm Technologies RFFE team, and I look forward to celebrating even more innovation as we continue to invent breakthrough technologies on the path towards a 5G connected world. Additionally, I would like to thank our long-time partner TDK. We look forward to continued opportunities to collaborate and to bring leading products from both companies to the market in the years ahead.\"TDK Electronics' (formerly EPCOS) remaining interest in the joint venture was valued at $1.15 billion in August 2019. The total purchase price, including the initial investment, payments to TDK based on sales by the joint venture, and development obligations, will be approximately $3.1 billion. About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including the QCT semiconductor business. For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.Qualcomm and Snapdragon are trademarks of Qualcomm Incorporated, registered in the United States and other countries. Qualcomm Snapdragon is a product of Qualcomm Technologies, Inc. and/or its subsidiaries.1 The agreement was made between Qualcomm's indirect, wholly-owned subsidiary, Qualcomm Global Trading Pte. Ltd. (QGT), and other Qualcomm affiliates, including Qualcomm Technologies, Inc. (QTI), and TDK and other TDK affiliates.2 Qualcomm RF front-end products are products of Qualcomm Technologies, Inc. (\"Qualcomm Technologies\") and/or its subsidiaries.Qualcomm Contacts:Pete Lancia, Corporate CommunicationsPhone: 1-858-845-5959Email: corpcomm@qualcomm.comMauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-658-4813Email: ir@qualcomm.com  View original content:http://www.prnewswire.com/news-releases/qualcomm-acquires-remaining-interest-in-rf360-holdings-300917654.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm Unveils Networking Pro Series Platforms that Aim to Set a New Benchmark in Wi-Fi 6 Performance",
        "subtitle": "- Four Distinct and Scalable Platforms Bringing Highly Differentiated Wi-Fi 6 Features Optimized for Highly Congested Wireless Networks -",
        "date": "Aug 27, 2019 1:00PM EDT",
        "content": " SAN FRANCISCO, Aug. 27, 2019 /PRNewswire/ -- Qualcomm Technologies, Inc. a wholly owned subsidiary of Qualcomm Incorporated (NASDAQ: QCOM), today announced Qualcomm® Networking Pro Series platforms, its second-generation Wi-Fi 6 networking offerings, designed to deliver the ultimate Wi-Fi 6 connectivity experience across the widest range of applications. At Qualcomm® Wi-Fi 6 Day in San Francisco, executives are demonstrating the Qualcomm Networking Pro Series, comprised of four platforms, the 1200, 800, 600, and 400, distinguished by format, scale of application, and computing needs. The platforms leverage the company's unique Wi-Fi 6 architecture and approach and are designed for densely congested networks, onboarding of hundreds of devices without degradation of user experience, and high performance. The full release is available on the Qualcomm News Center website at(https://www.qualcomm.com/news/releases/2019/08/27/qualcomm-unveils-networking-pro-series-platforms-aim-set-new-benchmark-wi)About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including the QCT semiconductor business. For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.Qualcomm is a trademark of Qualcomm Incorporated, registered in the United States and other countries.Qualcomm Networking Pro Series platforms are products of Qualcomm Technologies, Inc. and/or its subsidiaries.Qualcomm Contacts:Pete Lancia, Corporate CommunicationsPhone:  1-858-845-5959Email: corpcomm@qualcomm.com Mauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-658-4813Email: ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-unveils-networking-pro-series-platforms-that-aim-to-set-a-new-benchmark-in-wi-fi-6-performance-300907245.htmlSOURCE  Qualcomm Technologies, Inc."
    },
    {
        "title": "Qualcomm Interim Chief Financial Officer Dave Wise to Retire",
        "subtitle": "Akash Palkhiwala to Serve as Interim CFO; Company Continues Search for Permanent CFO",
        "date": "Aug 23, 2019 4:30PM EDT",
        "content": "SAN DIEGO, Aug. 23, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that Dave Wise has decided to retire after a 23-year tenure at the Company. His departure is effective as of today. As part of the transition plan, Qualcomm's Board of Directors has unanimously approved the appointment of Akash Palkhiwala, SVP of Finance, as interim CFO while the Company seeks a permanent replacement.  Wise will remain in a consulting capacity. \"On behalf of the Executive Team, I want to thank Dave for his long service to Qualcomm, and particularly for taking on the interim CFO role for the last five months. We all wish him well,\" said Steve Mollenkopf, CEO of Qualcomm Incorporated. \"I am confident that Akash Palkhiwala has the experience and deep understanding of our business to lead our finance function while we continue our efforts to identify a permanent CFO.\" Palkhiwala is currently Senior Vice President and finance lead for QCT, with responsibility for finance and all chipset products and segments including Mobile, RF Front End, Compute, Auto, Connectivity and Networking and IoT.Palkhiwala joined Qualcomm in 2001 and has previously held a variety of roles in Finance, including Treasurer and lead for Corporate Finance overseeing Qualcomm's overall financial planning and analysis.  He has been part of the senior finance leadership team for more than 10 years.Palkhiwala holds a B.A. degree in Mechanical Engineering and an MBA from the University of Maryland. About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including the QCT semiconductor business. For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.Qualcomm Contacts:Pete Lancia, Corporate CommunicationsPhone:  1-858-845-5959Email: corpcomm@qualcomm.com Mauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-658-5431Email: ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-interim-chief-financial-officer-dave-wise-to-retire-300906464.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm Welcomes Ninth Circuit Stay Ruling in FTC Case",
        "subtitle": "-- District Court Decision is stayed through course of expedited appeal --",
        "date": "Aug 23, 2019 1:30PM EDT",
        "content": "SAN DIEGO, Aug. 23, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that the United States Court of Appeals for the Ninth Circuit granted in its entirety Qualcomm's request for a partial stay, pending appeal, of an injunction from the U.S. District Court for the Northern District of California. In addition, the Court ordered oral argument on our expedited appeal to be set in January 2020. \"We are pleased that the Ninth Circuit granted our request and believe the district court decision will be overturned once the merits of our appeal have been considered,\" said Don Rosenberg, executive vice president and general counsel for Qualcomm. \"The stay, which remains in effect through the course of the appeals process, keeps intact Qualcomm's patent-licensing practices. This will allow Qualcomm to continue to invest in inventing the fundamental technologies at the heart of mobile communications at this critical time of transition to 5G.\"About QualcommQualcomm invents breakthrough technologies that transform how the world connects, computes and communicates. When we connected the phone to the Internet, the mobile revolution was born. Today, our inventions are the foundation for life-changing products, experiences, and industries. As we lead the world to 5G, we envision this next big change in cellular technology spurring a new era of intelligent, connected devices and enabling new opportunities in connected cars, remote delivery of health care services, and the IoT — including smart cities, smart homes, and wearables. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including the QCT semiconductor business. For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.Qualcomm Contacts:Pete Lancia, Corporate CommunicationsPhone:  1-858-845-5959Email: corpcomm@qualcomm.com Mauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-658-5431Email: ir@qualcomm.com View original content:http://www.prnewswire.com/news-releases/qualcomm-welcomes-ninth-circuit-stay-ruling-in-ftc-case-300906442.htmlSOURCE  Qualcomm Incorporated"
    },
    {
        "title": "Qualcomm and LGE Enter Into a New Global Patent License Agreement",
        "subtitle": "5-year agreement covers 3G, 4G and 5G single and multimode devices",
        "date": "Aug 20, 2019 7:30AM EDT",
        "content": "SAN DIEGO, Aug. 20, 2019 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that LGE has entered into a new direct worldwide patent license agreement with Qualcomm. Under the terms of the five-year, royalty-bearing agreement, Qualcomm has granted LGE a patent license to develop, manufacture and sell 3G, 4G and 5G single-mode and multimode complete devices. The agreement is consistent with Qualcomm's established global licensing terms.The full release is available on the Qualcomm News Center website at (https://www.qualcomm.com/news/releases/2019/08/20/qualcomm-and-lge-enter-new-global-patent-license-agreement)Qualcomm Contacts:Pete Lancia, Corporate CommunicationsPhone: 1-858-845-5959Email: corpcomm@qualcomm.com Mauricio Lopez-Hodoyan, Investor RelationsPhone: 1-858-651-1387Email: ir@qualcomm.com  View original content:http://www.prnewswire.com/news-releases/qualcomm-and-lge-enter-into-a-new-global-patent-license-agreement-300904140.htmlSOURCE  Qualcomm Incorporated"
    }
]