[
    {
        "title": "Regeneron Announces Upcoming Investor Conference Presentations",
        "subtitle": "",
        "date": "Mar 3, 2020 4:05PM EST",
        "content": "TARRYTOWN, N.Y., March 3, 2020 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) will webcast management participation as follows:The sessions may be accessed from the \"Investors & Media\" page of Regeneron's website at http://investor.regeneron.com/events-and-presentations.  Replays of the webcasts will be archived on the Company's website for at least 30 days.About Regeneron Pharmaceuticals, Inc.Regeneron is a leading biotechnology company that invents life-transforming medicines for people with serious diseases.  Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories.  Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through its proprietary VelociSuite® technologies, such as VelocImmune® which produces optimized fully-human antibodies, and ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Contact Information:Investor RelationsJustin Holko914.847.7786justin.holko@regeneron.comCorporate CommunicationsHala Mirza914.847.3422hala.mirza@regeneron.com View original content:http://www.prnewswire.com/news-releases/regeneron-announces-upcoming-investor-conference-presentations-301015780.htmlSOURCE  Regeneron Pharmaceuticals"
    },
    {
        "title": "Regeneron Announces Upcoming Investor Conference Presentations",
        "subtitle": "",
        "date": "Feb 12, 2020 4:01PM EST",
        "content": "TARRYTOWN, N.Y., Feb. 12, 2020 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) will webcast management presentations as follows:The sessions may be accessed from the \"Investors & Media\" page of Regeneron's website at http://investor.regeneron.com/events-and-presentations.  Replays of the webcasts will be archived on the Company's website for at least 30 days.About Regeneron Pharmaceuticals, Inc.Regeneron is a leading biotechnology company that invents life-transforming medicines for people with serious diseases.  Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories.  Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through its proprietary VelociSuite® technologies, such as VelocImmune® which produces optimized fully-human antibodies, and ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Contact Information:Investor RelationsJustin Holko914.847.7786justin.holko@regeneron.comCorporate CommunicationsHala Mirza914.847.3422hala.mirza@regeneron.com View original content:http://www.prnewswire.com/news-releases/regeneron-announces-upcoming-investor-conference-presentations-301003762.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "EYLEA® (aflibercept) Injection Reduced Risk of Developing Vision-Threatening Events by 75% After Two Years in Patients with Diabetic Retinopathy",
        "subtitle": "",
        "date": "Feb 8, 2020 5:00PM EST",
        "content": "TARRYTOWN, N.Y., Feb. 8, 2020 /PRNewswire/ --New data highlight importance of proactive EYLEA treatment as more than half of untreated patients in PANORAMA developed vision-threatening events over two yearsHigh-dose aflibercept development program underway with Phase 3 trials planned for 2020Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) announced positive two-year results from the Phase 3 PANORAMA trial evaluating EYLEA® (aflibercept) Injection 2 mg (0.05 mL) in patients with moderately severe to severe non-proliferative diabetic retinopathy (NPDR). The data were presented today for the first time at the Angiogenesis, Exudation, and Degeneration 2020 meeting in Miami, Florida.The two-year pre-specified exploratory data demonstrate that untreated moderately severe and severe NPDR can lead to vision-threatening events, which includes vision-threatening complications (VTCs; proliferative diabetic retinopathy or anterior segment neovascularization) and center-involved diabetic macular edema (CI-DME). Based on a Kaplan-Meier analysis, more than half (58%) of patients in the untreated sham arm developed a VTC or CI-DME within two years of entering the trial, while EYLEA treatment was shown to reduce the likelihood of these vision-threatening events by at least 75% (nominal p2-step improvement from baseline in Diabetic Retinopathy Severity Scale (DRSS) scores decreased in the second year (80% improvement at 52 weeks and 50% at 100 weeks).* By comparison, in patients who continued to receive EYLEA every 16 weeks (i.e., the 16-week group), the >2-step DRSS scores remained consistent (65% at 52 weeks vs. 62% at 100 weeks).* In the second year, patients received an average of 1.8 injections in the 8-week/PRN group (out of a possible 6); a review of data from the independent reading center of investigator PRN decisions suggests that some of these patients may have been under-dosed based on the protocol rules of the trial. Patients in the 16-week group received 2.6 injections (out of a possible 3) in the second year. During the 2-year PANORAMA trial, adverse events were consistent with the known profile of EYLEA. Serious ocular adverse events in the study eye occurred in 2% and 0% of the EYLEA 8-week/PRN and 16-week groups, respectively, and 2% of patients in the sham group. Ocular inflammation occurred in 2% and 1% of patients in the EYLEA treatment groups, respectively, and 1% of patients in the sham group. Anti-platelet trialists' collaboration (APTC)-defined arterial thromboembolic treatment emergent events occurred in 3% and 6% of patients in the EYLEA treatment groups, respectively, and 5% of patients in the sham group.*p"
    },
    {
        "title": "Regeneron Reports Fourth Quarter and Full Year 2019 Financial and Operating Results",
        "subtitle": "",
        "date": "Feb 6, 2020 6:30AM EST",
        "content": "TARRYTOWN, N.Y., Feb. 6, 2020 /PRNewswire/ --Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced financial results for the fourth quarter and full year 2019 and provided a business update.\"Regeneron had a very productive 2019 marked by strong commercial growth for our core franchises, significant pipeline and regulatory progress, and positive financial results,\" said Leonard S. Schleifer, M.D., Ph.D., President and Chief Executive Officer of Regeneron.  \"In 2020, we are focused on driving continued growth with EYLEA, Dupixent, and Libtayo and anticipate several new regulatory approvals and submissions across our portfolio.  Our expanding pipeline of innovative and complementary immuno-oncology therapies continues to advance, and we feel confident that we are positioned to bring new breakthroughs to cancer patients and be a leader in this rapidly evolving field.\"\"We continue to work constructively with Sanofi to finalize our modified antibody agreement for Praluent and Kevzara, which we expect to be accretive in 2020,\" said Robert E. Landry, Executive Vice President, Finance and Chief Financial Officer of Regeneron.  \"We will provide financial guidance for full year 2020 by no later than the end of the first quarter.\" Business HighlightsKey Pipeline ProgressRegeneron has 22 product candidates in clinical development, including five of the Company's U.S. Food and Drug Administration (FDA) approved products for which it is investigating additional indications.  Updates from the clinical pipeline include:EYLEA® (aflibercept) InjectionDupixent® (dupilumab)Libtayo® (cemiplimab)REGN1979, a bispecific antibody targeting CD20 and CD3REGN5458, a bispecific antibody targeting BCMA and CD3Pozelimab, an antibody to C5Garetosmab, an antibody to Activin AREGN-EB3, a multi-antibody therapy to Ebola virus infectionBusiness Development UpdateSelect 2020 MilestonesFourth Quarter and Full Year 2019 Financial ResultsTotal Revenues: Total revenues increased by 13% to $2.170 billion in the fourth quarter of 2019, compared to $1.928 billion in the fourth quarter of 2018.  Full year 2019 total revenues increased 17% to $7.863 billion, compared to $6.711 billion for the full year 2018.Net product sales were $1.286 billion in the fourth quarter and $4.834 billion for the full year 2019, compared to $1.096 billion in the fourth quarter and $4.106 billion for the full year 2018.  EYLEA net product sales in the United States were $1.222 billion in the fourth quarter and $4.644 billion for the full year 2019, compared to $1.079 billion in the fourth quarter and $4.077 billion for the full year 2018.  Overall distributor inventory levels for EYLEA in the United States remained within the Company's one-to-two-week targeted range.Total revenues also include Sanofi and Bayer collaboration revenues(2) of $748 million in the fourth quarter and $2.616 billion for the full year 2019, compared to $729 million in the fourth quarter and $2.188 billion for the full year 2018.  Sanofi collaboration revenue in the fourth quarter and full year 2019 included the Company's share of profits from collaboration antibodies (Dupixent, Praluent, and Kevzara) of $104 million and $209 million, respectively, while Sanofi collaboration revenue in the fourth quarter and full year 2018 included the Company's share of losses from collaboration antibodies of $(44) million and $(227) million, respectively.  The increase in the Company's share of profits from collaboration antibodies was primarily driven by higher Dupixent profits.  Sanofi collaboration revenue in the fourth quarter of 2018 also included the recognition of a cumulative catch-up adjustment of $149 million arising from a change in the estimate of the stage of completion of the collaborations' immuno-oncology programs primarily in connection with the Amended IO Discovery Agreement.Refer to Table 4 for a summary of collaboration and other revenue.Research and Development (R&D) Expenses: GAAP R&D expenses were $683 million in the fourth quarter and $3.037 billion for the full year 2019, compared to $601 million in the fourth quarter and $2.186 billion for the full year 2018.  The higher R&D expenses in the fourth quarter of 2019 were principally due to additional costs incurred in connection with our earlier-stage pipeline and dupilumab, and higher headcount and headcount-related costs.  The higher R&D expenses for the full year 2019 were principally due to a $400 million up-front payment to Alnylam, additional costs incurred in connection with our earlier-stage pipeline, and higher headcount and headcount-related costs.  R&D-related non-cash share-based compensation expense was $72 million in the fourth quarter and $250 million for the full year 2019, compared to $68 million in the fourth quarter and $229 million for the full year 2018.Selling, General, and Administrative (SG&A) Expenses: GAAP SG&A expenses were $587 million in the fourth quarter and $1.835 billion for the full year 2019, compared to $491 million in the fourth quarter and $1.556 billion for the full year 2018.  The higher SG&A expenses in the fourth quarter and full year 2019 were primarily due to higher headcount and headcount-related costs, an increase in commercialization-related expenses for Dupixent and EYLEA, additional accruals for loss contingencies associated with ongoing litigation, and higher contributions to independent not-for-profit patient assistance organizations.  In addition, in the fourth quarter of 2019, the Company recorded a charge for restructuring-related costs, primarily related to employee separation costs, as the Company has eliminated certain commercialization activities and related headcount in connection with the proposed restructuring of the antibody agreement with Sanofi (as described above).  SG&A-related non-cash share-based compensation expense was $45 million in the fourth quarter and $168 million for the full year 2019, compared to $51 million in the fourth quarter and $169 million for the full year 2018.Cost of Goods Sold (COGS): GAAP COGS was $109 million in the fourth quarter and $362 million for the full year 2019, compared to $44 million in the fourth quarter and $180 million for the full year 2018.  The increase in COGS was primarily due to our obligation to pay Sanofi its share of Libtayo U.S. gross profits, third-party royalties on Libtayo U.S. sales, and higher inventory write-downs and reserves.Cost of Collaboration and Contract Manufacturing (COCM): GAAP COCM was $115 million in the fourth quarter and $420 million for the full year 2019, compared to $73 million in the fourth quarter and $254 million for the full year 2018.  The increase in COCM for the full year 2019 was primarily due to the recognition of manufacturing costs associated with higher sales of Dupixent.Other Income (Expense): GAAP other income (expense), net, includes the recognition of net gains on equity securities of $189 million in the fourth quarter and $118 million for the full year 2019, compared to net losses of $(63) million in the fourth quarter and $(42) million for the full year 2018.Income Taxes: GAAP income tax expense was $98 million and the effective tax rate was 11.0% in the fourth quarter of 2019, compared to a GAAP income tax benefit of $(144) million and (21.3%) in the fourth quarter of 2018.  GAAP income tax expense was $313 million and the effective tax rate was 12.9% for the full year 2019, compared to $109 million and 4.3% for the full year 2018.  The effective tax rate for the fourth quarter and full year 2019 was positively impacted, compared to the U.S. federal statutory rate, primarily by stock-based compensation, income earned in foreign jurisdictions with tax rates lower than the U.S. federal statutory rate, and federal tax credits for research activities.  The Company's effective tax rate for the fourth quarter and full year 2018 was positively impacted, compared to the U.S. federal statutory rate, primarily by the Company's fourth quarter sale of non-inventory related assets between foreign subsidiaries, which had a net impact on the rate by 24.0% and 6.3% for the fourth quarter and full year 2018, respectively.  During the fourth quarter and full year 2018, the Company also recorded an income tax benefit of $56 million and $68 million, respectively, as an adjustment to the provisional amount recorded as of December 31, 2017 for the U.S. Tax Reform Act.GAAP and Non-GAAP Net Income(1): GAAP net income was $792 million, or $6.93 per diluted share, in the fourth quarter of 2019, compared to GAAP net income of $820 million, or $7.15 per diluted share, in the fourth quarter of 2018.  GAAP net income was $2.116 billion, or $18.46 per diluted share, for the full year 2019, compared to GAAP net income of $2.444 billion, or $21.29 per diluted share, for the full year 2018.Non-GAAP net income was $858 million, or $7.50 per diluted share, in the fourth quarter of 2019, compared to non-GAAP net income of $786 million, or $6.84 per diluted share, in the fourth quarter of 2018.  Non-GAAP net income was $2.827 billion, or $24.67 per diluted share, for the full year 2019, compared to non-GAAP net income of $2.622 billion, or $22.84 per diluted share, for the full year 2018.A reconciliation of the Company's GAAP to non-GAAP results is included in Table 3 of this press release.2020 Financial GuidanceGiven the announcement regarding the intent to restructure the antibody collaboration for Kevzara and Praluent with Sanofi, Regeneron will provide financial guidance for full year 2020 by the end of the first quarter of 2020.Conference Call InformationRegeneron will host a conference call and simultaneous webcast to discuss its fourth quarter and full year 2019 financial and operating results on Thursday, February 6, 2020, at 8:00 AM.  To access this call, dial (800) 708-4540 (U.S.) or (847) 619-6397 (International).  A link to the webcast may be accessed from the \"Investors and Media\" page of Regeneron's website at www.regeneron.com.  A replay of the conference call and webcast will be archived on the Company's website and will be available for at least 30 days.About Regeneron Pharmaceuticals, Inc.Regeneron is a leading biotechnology company that invents life-transforming medicines for people with serious diseases.  Founded and led for over 30 years by physician-scientists, Regeneron's unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in Regeneron's laboratories.  Regeneron's medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, pain, infectious diseases, and rare diseases.Regeneron is accelerating and improving the traditional drug development process through its proprietary VelociSuite® technologies, such as VelocImmune® which uses unique genetically-humanized mice to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center®, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the Company, please visit www.regeneron.com or follow @Regeneron on Twitter.Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements.  Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words.  These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of products marketed by Regeneron and/or its collaborators (collectively, \"Regeneron's Products\") and Regeneron's product candidates and research and clinical programs now underway or planned; the likelihood and timing of achieving any of the anticipated milestones described in this press release; unforeseen safety issues resulting from the administration of Regeneron's Products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's Products and product candidates in clinical trials; the likelihood and timing of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for Regeneron's Products, including without limitation EYLEA® (aflibercept) Injection, Dupixent® (dupilumab) Injection, Libtayo® (cemiplimab) Injection, Praluent® (alirocumab) Injection, Kevzara® (sarilumab) Injection, fasinumab, evinacumab, REGN-EB3, garetosmab, pozelimab, and REGN1979; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in other studies and lead to therapeutic applications; ongoing regulatory obligations and oversight impacting Regeneron's Products (such as EYLEA, Dupixent, Libtayo, Praluent, and Kevzara), research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's Products and product candidates; competing drugs and product candidates that may be superior to Regeneron's Products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's Products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary), on the commercial success of Regeneron's Products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's Products and product candidates; coverage and reimbursement determinations by third-party payors, including Medicare and Medicaid; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent and Praluent), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition.  A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission.  Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron.  Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).Non-GAAP Financial MeasuresThis press release and/or the financial results attached to this press release include amounts that are considered \"non-GAAP financial measures\" under SEC rules.  As required, Regeneron has provided reconciliations of such non-GAAP financial measures.            View original content:http://www.prnewswire.com/news-releases/regeneron-reports-fourth-quarter-and-full-year-2019-financial-and-operating-results-300999889.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron Announces Expanded Collaboration with HHS to Develop Antibody Treatments for New Coronavirus",
        "subtitle": "",
        "date": "Feb 4, 2020 9:00AM EST",
        "content": "TARRYTOWN, N.Y., Feb. 4, 2020 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced an expanded agreement with the U.S. Department of Health and Human Services (HHS) to develop new treatments combating the novel coronavirus, 2019-nCoV, which was recently declared a global public health emergency by the World Health Organization. Regeneron has a number of active collaborations with HHS's Biomedical Advanced Research and Development Authority (BARDA), part of the Office of the Assistant Secretary for Preparedness and Response (ASPR), including a collaboration to advance Regeneron's investigational Ebola treatment REGN-EB3, which demonstrated positive clinical data in 2019.The HHS and Regeneron Other Transaction Agreement (OTA), originally established in 2017, is focused on discovery, research, development and manufacturing of a portfolio of antibodies targeting up to 10 pathogens that pose significant risk to public health, now including the Influenza virus and 2019-nCoV. This effort utilizes Regeneron's proprietary VelociSuite® technologies – including the VelocImmune® platform which uses a unique genetically-engineered mouse with a humanized immune system that can be challenged with all or parts of a virus of interest – to facilitate swift identification, preclinical validation and development of promising antibody candidates. Regeneron's rapid response VelociSuite® technologies are particularly well-suited for use in quickly-developing outbreak situations, as was done for Ebola.\"The life-saving results seen with our investigational Ebola therapy last year underscore the potential impact of Regeneron's rapid response platform for addressing emerging outbreaks,\" said George D. Yancopoulos, M.D., Ph.D., President and Chief Scientific Officer of Regeneron. \"Our unique suite of technologies expedites and improves the drug discovery and development process at every stage, positioning Regeneron to respond quickly and effectively to new pathogens. We are eager to expand our productive collaboration with BARDA and are already working hard to address the novel coronavirus that is causing worldwide concern.\"The Other Transaction Authority provides a funding and collaboration vehicle for HHS to promote innovation in technology for advanced research and development. \"Emerging infectious diseases can present serious threats to our nation's health security,\" said Rick Bright, Ph.D., Deputy Assistant Secretary for Preparedness and Response and Director of BARDA at ASPR. \"Working as public-private partners like we have with Regeneron since 2014, we can move rapidly to respond to new global health threats.\"About RegeneronRegeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, pain, infectious diseases and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune® which uses unique genetically-humanized mice to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Forward-Looking Statements and Use of Digital Media  This press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements.  Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words.  These statements concern, and these risks and uncertainties include, among others, the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable) and the agreements with the Biomedical Advanced Research and Development Authority of the U.S. Department of Health and Human Services discussed in this news release, to be cancelled or terminated without any product success; the nature, timing, and possible success and therapeutic applications of products marketed by Regeneron and/or its collaborators (collectively, \"Regeneron's Products\") and Regeneron's product candidates and research and clinical programs now underway or planned, including without limitation REGN-EB3 (Regeneron's multi-antibody therapy to Ebola virus infection); uncertainty of market acceptance and commercial success of Regeneron's Products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's Products and product candidates; the availability and extent of reimbursement of Regeneron's Products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; competing drugs and product candidates that may be superior to Regeneron's Products and product candidates; unforeseen safety issues resulting from the administration of Regeneron's Products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's Products and product candidates in clinical trials; the likelihood and timing of possible regulatory approval and commercial launch of Regeneron's product candidates and new indications for Regeneron's Products; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in other studies and lead to therapeutic applications; ongoing regulatory obligations and oversight impacting Regeneron's Products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's Products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's Products and product candidates; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition.  A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission.  Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron.  Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).Regeneron Contacts:Media Relations  Alexandra Bowie  Tel: +1 (914) 847-3477  Alexandra.bowie@regeneron.com Investor Relations  Justin Holko  Tel: +1 (914) 847-7786  Justin.holko@regeneron.com   View original content:http://www.prnewswire.com/news-releases/regeneron-announces-expanded-collaboration-with-hhs-to-develop-antibody-treatments-for-new-coronavirus-300998140.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "FDA Accepts for Priority Review Dupixent® (dupilumab) for Children Aged 6 to 11 Years with Moderate-to-Severe Atopic Dermatitis",
        "subtitle": "",
        "date": "Jan 28, 2020 12:59AM EST",
        "content": "TARRYTOWN, N.Y. and PARIS, Jan. 28, 2020 /PRNewswire/ -- If approved, Dupixent would be the first biologic medicine available in the U.S. for these childrenRegeneron Pharmaceuticals, Inc. (NASDAQ: REGN) and Sanofi today announced that the U.S. Food and Drug Administration (FDA) has accepted for Priority Review the supplemental Biologics License Application (sBLA) for Dupixent® (dupilumab) as an add-on maintenance treatment for children aged 6 to 11 years with moderate-to-severe atopic dermatitis whose disease is not adequately controlled with topical prescription therapies or when those therapies are not advisable. The target action date for the FDA decision is May 26, 2020. Despite standard-of-care therapy, many young children with moderate-to-severe atopic dermatitis continue to experience uncontrolled, persistent symptoms. These children live with intense, persistent itching, skin lesions and skin dryness, cracking, redness or darkness, crusting and oozing. Beyond the physical symptoms, moderate-to-severe atopic dermatitis can have a significant impact on health-related quality of life for children, as well as placing a burden on their families. The sBLA is supported by data that includes pivotal Phase 3 results on the efficacy and safety of Dupixent combined with topical corticosteroids (TCS) in children with severe atopic dermatitis. In the trial, children treated with Dupixent and TCS experienced significantly improved measures of overall disease severity, skin clearing, itching and health-related quality of life, compared to TCS alone. Adverse events more commonly observed with Dupixent and TCS included conjunctivitis, nasopharyngitis and injection site reactions, which is consistent with the previously documented safety profile of Dupixent in older populations. Detailed results from this trial will be presented at an upcoming medical congress. The FDA previously granted Breakthrough Therapy designation to Dupixent for the treatment of severe atopic dermatitis in children 6 months to 11 years of age not well controlled on topical prescription medications.Dupixent is a fully human monoclonal antibody that inhibits the signaling of the interleukin-4 (IL-4) and interleukin-13 (IL-13) proteins. Dupixent was invented using Regeneron's proprietary VelocImmune® technology, which uses a unique genetically-humanized mouse to produce optimized fully human antibodies. Data from Dupixent clinical trials have shown that IL-4 and IL-13 are key drivers of the type 2 inflammation that plays a major role in atopic dermatitis, asthma and chronic rhinosinusitis with nasal polyposis (CRSwNP).About Dupixent  Dupixent is approved in the U.S. to treat patients aged 12 years and older with moderate-to-severe atopic dermatitis that is not well controlled with prescription therapies used on the skin (topical), or who cannot use topical therapies; for use with other asthma medicines for the maintenance treatment of moderate-to-severe eosinophilic or oral steroid dependent asthma in patients aged 12 years and older whose asthma is not controlled with their current asthma medicines; and for use with other medicines to treat CRSwNP in adults whose disease is not controlled.Outside of the U.S., Dupixent is approved for specific patients with moderate-to-severe atopic dermatitis and certain patients with asthma in a number of other countries around the world, including the EU and Japan. Dupixent is also approved in the EU to treat certain adults with severe CRSwNP. Dupilumab Development Program To date, there have been 11 pivotal trials involving more than 9,000 patients across various chronic type 2 inflammatory diseases.  In addition to the currently approved indications, Regeneron and Sanofi are also studying dupilumab in a broad range of clinical development programs for diseases driven by allergic and other type 2 inflammation, including pediatric asthma (6 to 11 years of age, Phase 3), pediatric atopic dermatitis (6 months to 5 years of age, Phase 2/3), eosinophilic esophagitis (Phase 3), chronic obstructive pulmonary disease (Phase 3) and food and environmental allergies (Phase 2). Dupilumab is also being studied in combination with REGN3500 (SAR440340), which targets IL-33. These potential uses are investigational and the safety and efficacy have not been evaluated by any regulatory authority. Dupilumab and REGN3500 are being jointly developed by Regeneron and Sanofi under a global collaboration agreement.U.S. IndicationsDUPIXENT is a prescription medicine used:IMPORTANT SAFETY INFORMATION FOR U.S. PATIENTSDo not use if you are allergic to dupilumab or to any of the ingredients in DUPIXENT®. Before using DUPIXENT, tell your healthcare provider about all your medical conditions, including if you:Tell your healthcare provider about all the medicines you take, including prescription and over-the-counter medicines, vitamins and herbal supplements. If you are taking asthma medicines, do not change or stop your asthma medicine without talking to your healthcare provider. DUPIXENT can cause serious side effects, including:The most common side effects include:Tell your healthcare provider if you have any side effect that bothers you or that does not go away. These are not all the possible side effects of DUPIXENT. Call your doctor for medical advice about side effects. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit www.fda.gov/medwatch, or call 1-800-FDA-1088.Use DUPIXENT exactly as prescribed. DUPIXENT is an injection given under the skin (subcutaneous injection). If your healthcare provider decides that you or a caregiver can give DUPIXENT injections, you or your caregiver should receive training on the right way to prepare and inject DUPIXENT. Do not try to inject DUPIXENT until you have been shown the right way by your healthcare provider. In children 12 years of age and older, it is recommended that DUPIXENT be administered by or under supervision of an adult.Please see full Prescribing Information including Patient Information.About Regeneron Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune®, which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.About SanofiSanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.Sanofi, Empowering LifeRegeneron Forward-Looking Statements and Use of Digital Media This press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements.  Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words.  These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation Dupixent® (dupilumab); the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products, such as dupilumab for the treatment of pediatric atopic dermatitis, pediatric asthma, eosinophilic esophagitis, chronic obstructive pulmonary disease, food and environmental allergies, and other potential indications (as well as in combination with REGN3500); unforeseen safety issues resulting from the administration of products and product candidates (such as dupilumab) in patients, including serious complications or side effects in connection with the use of Regeneron's product candidates in clinical trials; ongoing regulatory obligations and oversight impacting Regeneron's marketed products (such as Dupixent), research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates, including without limitation dupilumab; the availability and extent of reimbursement of the Company's products (such as Dupixent) from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates (such as Dupixent) and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of any such products and product candidates; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in other studies and lead to therapeutic applications; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition.  A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019.  Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron.  Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).  Sanofi Forward-Looking Statements This press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, as amended. Forward-looking statements are statements that are not historical facts. These statements include projections and estimates and their underlying assumptions, statements regarding plans, objectives, intentions and expectations with respect to future financial results, events, operations, services, product development and potential, and statements regarding future performance. Forward-looking statements are generally identified by the words \"expects\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"plans\" and similar expressions. Although Sanofi's management believes that the expectations reflected in such forward-looking statements are reasonable, investors are cautioned that forward-looking information and statements are subject to various risks and uncertainties, many of which are difficult to predict and generally beyond the control of Sanofi, that could cause actual results and developments to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. These risks and uncertainties include among other things, the uncertainties inherent in research and development, future clinical data and analysis, including post marketing, decisions by regulatory authorities, such as the FDA or the EMA, regarding whether and when to approve any drug, device or biological application that may be filed for any such product candidates as well as their decisions regarding labelling and other matters that could affect the availability or commercial potential of such product candidates, the absence of guarantee that the product candidates if approved will be commercially successful, the future approval and commercial success of therapeutic alternatives, Sanofi's ability to benefit from external growth opportunities and/or obtain regulatory clearances, risks associated with intellectual property and any related pending or future litigation and the  ultimate outcome of such litigation,  trends in exchange rates and prevailing interest rates, volatile economic conditions, the impact of cost containment initiatives and subsequent changes thereto, the average number of shares outstanding as well as those discussed or identified in the public filings with the SEC and the AMF made by Sanofi, including those listed under \"Risk Factors\" and \"Cautionary Statement Regarding Forward-Looking Statements\" in Sanofi's annual report on Form 20-F for the year ended December 31, 2018. Other than as required by applicable law, Sanofi does not undertake any obligation to update or revise any forward-looking information or statements.   View original content:http://www.prnewswire.com/news-releases/fda-accepts-for-priority-review-dupixent-dupilumab-for-children-aged-6-to-11-years-with-moderate-to-severe-atopic-dermatitis-300994046.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Forty of the Nation's Brightest Young Scientists Named Finalists in Regeneron Science Talent Search 2020",
        "subtitle": "",
        "date": "Jan 22, 2020 12:01PM EST",
        "content": "TARRYTOWN, N.Y. and WASHINGTON, Jan. 22, 2020 /PRNewswire/ --Finalists to Compete for More Than $1.8 Million in Oldest and Most Prestigious U.S. STEM Competition for High School SeniorsFemales represent more than 50 percent of the Regeneron STS finalistsRegeneron Pharmaceuticals, Inc. (NASDAQ: REGN) and Society for Science & the Public (the Society) today announced 40 finalists in the Regeneron Science Talent Search 2020, the nation's oldest and most prestigious science and math competition for high school seniors. Alumni have gone on to have world-changing careers in STEM fields and earn some of the most esteemed academic honors, including the Nobel Prize, the Fields Medal, the National Medal of Science, the MacArthur Fellowship and even an Academy Award. The 2020 finalists were selected from 1,993 highly qualified entrants, all of whom completed an original research project and extensive application process. Earlier this month, the Society and Regeneron named the top 300 scholars. The finalists were selected based on their projects' scientific rigor and their potential to become world-changing scientists and leaders. Finalists' projects span a diversity of STEM-related topics including targeting cancer via signaling pathways, developing a mobile application for stroke diagnosis using deep learning and computer vision and identifying an improved method for trace level arsenic quantification in water. The finalists will travel to Washington, D.C. from March 5-11, 2020, where they will undergo a rigorous judging process and compete for more than $1.8 million in awards. They will also have an opportunity to interact with leading scientists, meet with Members of Congress and display their projects to the public on March 8. The finalists are each awarded at least $25,000, and the top 10 awards range from $40,000 to $250,000. The top 10 Regeneron Science Talent Search 2020 winners will be announced at a black-tie gala awards ceremony at the National Building Museum on March 10. In total, more than $3 million in awards will be distributed throughout the Regeneron Science Talent Search, which includes the awards to finalists as well as the $2,000 provided to each of the top 300 scholars and their schools.  \"This year's finalists are part of the next generation of brilliant minds who – through the pursuit of science and innovation – can address many of society's most urgent challenges and help improve our world,\" said George D. Yancopoulos, M.D., Ph.D., Co-founder, President and Chief Scientific Officer of Regeneron and a Science Talent Search top winner (1976). \"These students are joining a community of highly talented STS alumni who have gone on to make incredible contributions to their chosen fields and our society. If one, two or even a handful of these impressive young scholars make discoveries that impact our world, that could make all the difference.\" \"The Regeneron Science Talent Search finalists are the stewards of our future,\" said Maya Ajmera, President and CEO of Society for Science & the Public, Publisher of Science News and 1985 Science Talent Search alum. \"These finalists are the top young scientists of our country today and they give me great hope for what lies ahead.\"Regeneron Science Talent Search 2020 Fast FactsIn addition to its sponsorship of the Science Talent Search, in December 2019, Society for Science & the Public announced Regeneron as the new title sponsor of the International Science and Engineering Fair (ISEF), a global competition for high school students where nearly 2,000 young scientists from 80 countries, regions and territories compete on a world stage.About the Regeneron Science Talent SearchThe Regeneron Science Talent Search, a program of Society for Science & the Public since 1942, is the nation's oldest and most prestigious science and math competition for high school seniors. Each year, around 2,000 student entrants submit original research in critically important scientific fields of study and are judged by leading experts in their fields. Unique among high school competitions in the U.S. and around the world, the Regeneron Science Talent Search focuses on identifying, inspiring and engaging the nation's most promising young scientists who are creating the ideas that could solve society's most urgent challenges.In 2017, Regeneron became only the third sponsor of the Science Talent Search as a way to help reward and celebrate the best and brightest young minds and encourage them to pursue careers in STEM as a way to positively impact the world. Through its 10-year, $100 million commitment, Regeneron nearly doubled the overall award distribution to $3.1 million annually, increasing the top award to $250,000 and doubling the awards for the top 300 scholars and their schools to $2,000 each to inspire more young people to engage in science.Program alumni include recipients of the world's most coveted science and math honors, including 11 National Medals of Science, five Breakthrough Prizes, 21 MacArthur Foundation Fellowships, two Fields Medals and 13 Nobel Prizes.Learn more at https://www.societyforscience.org/regeneron-sts. About Society for Science & the PublicSociety for Science & the Public is dedicated to the achievement of young scientists in independent research and to public engagement in science. Established in 1921, the Society is a nonprofit whose vision is to promote the understanding and appreciation of science and the vital role it plays in human advancement. Through its world-class competitions, including the Regeneron Science Talent Search, the Regeneron International Science and Engineering Fair, the Broadcom MASTERS, and its award-winning magazine, Science News and Science News for Students, Society for Science & the Public is committed to inform, educate, and inspire. Learn more at www.societyforscience.org and follow us on Facebook, Twitter, Instagram and Snapchat (Society4Science).About Regeneron Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron believes that operating as a good corporate citizen is crucial to delivering on our mission. We approach corporate responsibility with three goals in mind: to improve the lives of people with serious diseases, to foster a culture of integrity and excellence and to build sustainable communities. Regeneron is proud to be included on the Dow Jones Sustainability World Index and the Civic 50 list of the most \"community-minded\" companies in the United States. Throughout the year, Regeneron empowers and supports employees to give back through our volunteering, pro-bono and matching gift programs. Our most significant philanthropic commitments are in the area of science education, including the Regeneron Science Talent Search and Regeneron ISEF. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter. Media ContactsAlex Bowie, Regeneron202-213-1643, alexandra.bowie@regeneron.comGayle Kansagor, Society for Science & the Public703-489-1131, gkansagor@societyforscience.org   View original content to download multimedia:http://www.prnewswire.com/news-releases/forty-of-the-nations-brightest-young-scientists-named-finalists-in-regeneron-science-talent-search-2020-300991182.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron to Report Fourth Quarter and Full Year 2019 Financial and Operating Results and Host Conference Call and Webcast on February 6, 2020",
        "subtitle": "",
        "date": "Jan 10, 2020 7:00AM EST",
        "content": "TARRYTOWN, N.Y., Jan. 10, 2020 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that it will report its fourth quarter and full year 2019 financial and operating results on Thursday, February 6, 2020, before the U.S. financial markets open.  The Company will host a conference call and simultaneous webcast at 8:00 AM Eastern Time that day.Conference Call InformationTo access this call, dial (800) 708-4540 (U.S.) or (847) 619-6397 (International).  A link to the webcast may be accessed from the 'Investors and Media' page of Regeneron's website at http://investor.regeneron.com/events.cfm.  A replay of the conference call and webcast will be archived on the Company's website for at least 30 days.  About Regeneron Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases. Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, including VelocImmune® which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.  View original content:http://www.prnewswire.com/news-releases/regeneron-to-report-fourth-quarter-and-full-year-2019-financial-and-operating-results-and-host-conference-call-and-webcast-on-february-6-2020-300984444.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Publication Highlights Regeneron's Costimulatory Bispecific Antibodies, an Emerging Class of Cancer Immunotherapy",
        "subtitle": "",
        "date": "Jan 8, 2020 2:02PM EST",
        "content": "TARRYTOWN, N.Y., Jan. 8, 2020 /PRNewswire/ --Preclinical results published in Science Translational Medicine show that adding CD28 costimulatory bispecifics to CD3 bispecifics led to synergistic anti-tumor activity without inducing cytokine storm First costimulatory bispecific clinical trial initiated for prostate cancer; multiple additional costimulatory bispecifics to enter the clinic this yearRegeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced a publication featured on the cover of Science Translational Medicine describing the potential of a new class of cancer immunotherapy known as \"costimulatory bispecific antibodies.\" Regeneron and others have previously shown that CD3 bispecifics can result in meaningful clinical responses in previously untreatable cancer settings. The results published today show that adding a novel class of CD28 costimulatory bispecifics to Regeneron's CD3 bispecifics can lead to synergistic anti-tumor activity in multiple cell culture and animal model experiments, without inducing systemic cytokine release (cytokine storm).\"This novel class of CD28 costimulatory bispecifics are key to our strategy of developing a broad oncology portfolio – based on rational combinations to efficiently engage the immune system – to address a broad range of cancers, including those that are not responsive to currently available immunotherapy,\" said George D. Yancopoulos, M.D., Ph.D., Co-Founder, President and Chief Scientific Officer at Regeneron. \"We have dosed prostate cancer patients with our first CD28 costimulatory bispecific, REGN5678, in combination with Libtayo® (cemiplimab), and we plan to advance additional CD28 costimulatory bispecifics into the clinic for other cancers this year, including in combinations with CD3 bispecifics.\"The rationale for combining CD3 and CD28 bispecific antibodies is based on the fact that T-cells require two signals to fully activate. The first \"recognition\" signal occurs when the T-cell identifies a foreign or mutated protein (antigen), via its T-cell receptor/CD3 complex. However, the T-cell is only fully activated for cancer cell killing after it receives a second \"costimulatory\" signal, most powerfully via the CD28 costimulatory receptor. Regeneron's CD3 and CD28 investigational bispecifics are designed to bridge T-cells to cancer cells and simultaneously provide activation through these two signals. The publication demonstrates that this combination approach can drive markedly enhanced T-cell killing of prostate and ovarian tumors in sophisticated genetically-humanized animal models.\"Cancer researchers have long known that CD28-targeted therapies have the ability to supercharge T-cells against cancer, but little progress was made in harnessing this powerful opportunity given historic safety findings with CD28 superagonists. Our goal was to engage the CD28 pathway in a completely novel and targeted way to avoid the issues with generalized CD28 activation,\" said Dimitris Skokos, Ph.D., Senior Director, Cancer Immunology Research at Regeneron. \"Costimulatory bispecifics offered an innovative solution that allowed us to design antibodies with molecular controls to use CD28 to boost T-cell activation only in the presence of cancer cells and after the 'recognition' signal had been received. To see this design work preclinically is gratifying, and we are excited to see if these results will translate in human clinical trials.\"CD28 superagonists were investigational CD28-targeted monoclonal antibodies. In a Phase 1 trial conducted in 2006 by another company, a CD28 superagonist overactivated T-cells throughout the bodies of healthy volunteers. This caused life-threatening levels of cytokine release syndrome (known as cytokine storm), leading to multiple organ failure. As a result, clinical research into CD28-based treatments was largely stopped.This led Regeneron to carefully select CD28 costimulatory bispecific antibody candidates that would only activate T-cells when they were bridged to cancer cells and after having received the first \"recognition\" signal. Regeneron also tested the safety of its CD28 costimulatory bispecifics in several animal models and showed they did not induce cytokine storm when administered as monotherapy or in combination. These findings support the further investigation of CD28 costimulatory bispecifics in combination with other treatments. \"Checkpoint inhibitors and CAR-T cell therapy have transformed cancer treatment over the past decade, but many patients still don't respond to these immunotherapies. That's why it's exciting to see Regeneron's CD28 costimulatory bispecifics emerge as promising future off-the-shelf solutions,\" said Jill O'Donnell-Tormey, Ph.D., Chief Executive Officer and Director of Scientific Affairs at the Cancer Research Institute. \"The data published in Science Translational Medicine show that Regeneron is helping to expand the boundaries of what may be possible with immunotherapy.\"Among the investigational medicines studied in the paper were two CD28 costimulatory bispecifics (PSMAxCD28 and MUC16xCD28) and two CD3 bispecifics (CD20xCD3 and MUC16xCD3).About the Regeneron Bispecific Antibody PlatformAll of Regeneron's bispecifics are designed to closely resemble natural human antibodies and bind to two different targets. They are derived from a next-generation version of Regeneron's proprietary VelocImmune® technology and created using the company's Veloci-Bi® platform. These allow for the creation of bispecifics with no linkers or artificial sequences. Additionally, Regeneron bispecifics are manufactured using similar approaches used for human antibody medicines, with similar pharmacokinetics.There are six Regeneron investigational bispecific antibodies currently in ongoing clinical trials for multiple blood cancers and solid tumors. These bispecifics fall into three categories:Regulatory Status of Oncology ProgramsThe bispecifics mentioned in this release are currently under clinical development, and their safety and efficacy have not been evaluated by any regulatory authority.Libtayo in combination with REGN5678 is currently under clinical development for prostate cancer, and its safety and efficacy have not been evaluated by any regulatory authority for this use. Libtayo is currently approved in the U.S. for the treatment of patients with metastatic cutaneous squamous cell carcinoma (CSCC) or locally advanced CSCC who are not candidates for curative surgery or curative radiation, and in other countries for similar indications. In the U.S., the generic name for Libtayo is cemiplimab-rwlc, with rwlc as the suffix designated in accordance with Nonproprietary Naming of Biological Products Guidance for Industry issued by the U.S. Food and Drug Administration.As part of a global collaboration agreement, Regeneron and Sanofi are jointly developing Libtayo, as well as Regeneron's BCMAxCD3 and MUC16xCD3 bispecific programs.About RegeneronRegeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune®, which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Regeneron Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation REGN5678 (a PSMAxCD28 costimulatory bispecific antibody) being studied in combination with Libtayo® (cemiplimab) for the treatment of prostate cancer, as well as REGN1979 (a CD20xCD3 bispecific antibody), REGN5458 (a BCMAxCD3 bispecific antibody), REGN5459 (a BCMAxCD3 bispecific antibody), REGN4018 (a MUC16xCD3 bispecific antibody), REGN5093 (a METxMET bispecific antibody), and Regeneron's earlier-stage product candidates (such as Regeneron's other costimulatory bispecific antibodies discussed in this press release); unforeseen safety issues resulting from the administration of products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's product candidates (such as Regeneron's bispecific antibodies and costimulatory bispecific antibodies discussed in this press release) in clinical trials; the likelihood and timing of achieving any anticipated development milestones discussed or referenced in this press release; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in other studies and lead to therapeutic applications; the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products; ongoing regulatory obligations and oversight impacting Regeneron's marketed products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; the availability and extent of reimbursement of the Company's products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the fiscal year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).  View original content:http://www.prnewswire.com/news-releases/publication-highlights-regenerons-costimulatory-bispecific-antibodies-an-emerging-class-of-cancer-immunotherapy-300983768.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron Announces Presentation at the 38th Annual J.P. Morgan Healthcare Conference",
        "subtitle": "",
        "date": "Dec 20, 2019 7:00AM EST",
        "content": "TARRYTOWN, N.Y., Dec. 20, 2019 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) will webcast its presentation at the 38th Annual J.P. Morgan Healthcare Conference on Monday, January 13, 2020.  The presentation is scheduled for 10:30 a.m. Pacific Time (1:30 p.m. Eastern Time) and may be accessed from the \"Investors & Media\" page of Regeneron's website at http://investor.regeneron.com/events.cfm.  A breakout session will immediately follow the formal presentation and can also be accessed from our website.  An archived version of the presentation and the breakout session will be available for at least 30 days.Following the announcement regarding the Intent to Restructure the Antibody Collaboration for Kevzara® (sarilumab) and Praluent® (alirocumab) with Sanofi, Regeneron will provide financial guidance for 2020 at a date subsequent to the J.P. Morgan Healthcare Conference.About Regeneron Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases. Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, including VelocImmune® which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Contact Information:Investor RelationsJustin Holko914.847.7786 justin.holko@regeneron.comCorporate CommunicationsHala Mirza914.847.3422 hala.mirza@regeneron.com View original content:http://www.prnewswire.com/news-releases/regeneron-announces-presentation-at-the-38th-annual-jp-morgan-healthcare-conference-300978211.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Society for Science & the Public Announces Regeneron as New Title Sponsor of the International Science and Engineering Fair",
        "subtitle": "",
        "date": "Dec 12, 2019 10:15AM EST",
        "content": "TARRYTOWN, N.Y. and WASHINGTON, Dec. 12, 2019 /PRNewswire/ -- Regeneron ISEF gathers outstanding science students from around the globe to compete for millions in prizes at the world's largest pre-college science and engineering competition  Society for Science & the Public (Society) and Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that Regeneron is the new title sponsor of the International Science and Engineering Fair (ISEF), the world's largest pre-college science and engineering competition, with a commitment of approximately $24 million over a five-year period.  Established in 1950, ISEF gives the world's best and brightest young scientists a global stage to share their outstanding STEM research, and compete for nearly $5 million in awards, prizes and scholarships. Each year, over 175,000 students compete in the Society's more than 420 affiliated high school science fairs around the world. Top winners earn the right to compete at ISEF where nearly 2,000 finalists, half of which are young female scientists, are judged in 21 different categories including biochemistry, behavioral and social sciences, environmental engineering, mathematics, robotics and intelligent machines, systems software and translational medical science.  Regeneron's commitment comes as the Society has created a new multitiered sponsorship model to support different judging categories, events and delegations of ISEF finalists. The Society is continuing to seek additional sponsors who are similarly committed to furthering the future of science and engineering, and will be announcing new sponsors in the coming weeks and months.This sponsorship builds on Regeneron and the Society's long-standing partnership to advance STEM education, including through Regeneron's $100 million, ten-year commitment to the Regeneron Science Talent Search (STS), the nation's most prestigious science competition for high school seniors. \"Regeneron is committed to helping engage and inspire the next generation of scientific innovators, as we believe there is nothing more important for helping address the truly existential threats facing humankind – from disease to climate change. We are thrilled to expand our collaboration with the Society for Science & the Public to now take on title sponsorship of the International Science and Engineering Fair, adding to our previous commitment with the Regeneron Science Talent Search,\" said George D. Yancopoulos, M.D., Ph.D., Co-founder, President and Chief Scientific Officer of Regeneron. \"It is a great honor, as well as a major responsibility, to take on these legacy programs – ISEF previously sponsored by Intel, and STS previously sponsored by Westinghouse and Intel – that have been inspiring young scientists for generations. As a product of these programs myself, I know firsthand how they can change a young person's life by providing the experiences and challenges, as well as the confidence, that one can make a change in the world through science.\"\"The International Science and Engineering Fair is the world's most powerful STEM talent pipeline, providing young scientists and engineers from 80 countries, regions and territories an opportunity to compete on the world's stage. We are thrilled to have Regeneron join us as the title sponsor of ISEF, and look forward to announcing more sponsors soon,\" said Maya Ajmera, President and CEO of the Society for Science & the Public and Publisher of Science News. \"Regeneron's commitment to supporting the next generation of STEM leaders is inspiring.\" About Society for Science & the PublicSociety for Science & the Public is dedicated to the achievement of young scientists in independent research and to public engagement in science. Established in 1921, the Society is a nonprofit whose vision is to promote the understanding and appreciation of science and the vital role it plays in human advancement. Through its world-class competitions, including the Regeneron Science Talent Search, the Regeneron International Science and Engineering Fair, the Broadcom MASTERS and its award-winning magazine, Science News and Science News for Students, Society for Science & the Public is committed to inform, educate and inspire. Learn more at www.societyforscience.org and follow us on Facebook, Twitter, Instagram and Snapchat (Society4Science). About Regeneron Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases. The National Institutes of Health (NIH) recently announced that, in a clinical trial, Regeneron's investigational therapy for Ebola demonstrated superior efficacy to the existing standard-of-care for saving the lives of people infected with this virus.Regeneron believes that operating as a good corporate citizen is crucial to delivering on our mission. We approach corporate responsibility with three goals in mind: to improve the lives of people with serious disease, to foster a culture of integrity and operational excellence and to build a sustainable future. Regeneron is proud to be included on the Dow Jones Sustainability World Index and the Civic 50 list of the most \"community-minded\" companies in the United States. Throughout the year, Regeneron empowers and supports employees to give back through our volunteering, pro-bono and matching gift programs. Our most significant philanthropic commitments are in the area of science education, including the Regeneron Science Talent Search, and now, Regeneron ISEF. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter. Media Contact at Society for Science & the PublicGayle KansagorPhone: 703-489-1131gkansagor@societyforscience.org Media Contact at Regeneron Ella CampbellPhone: 914-847-7017 ella.campbell@regeneron.com View original content:http://www.prnewswire.com/news-releases/society-for-science--the-public-announces-regeneron-as-new-title-sponsor-of-the-international-science-and-engineering-fair-300974103.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron and Cold Spring Harbor Laboratory Unveil New Dedicated Laboratories for Student Science Education",
        "subtitle": "",
        "date": "Dec 12, 2019 7:00AM EST",
        "content": " TARRYTOWN, N.Y. and COLD SPRING HARBOR, N.Y., Dec. 12, 2019 /PRNewswire/ --The Regeneron DNA Learning Center is located on the company's Sleepy Hollow, NY campus and will welcome middle and high school students Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) and Cold Spring Harbor Laboratory today announced the launch of the Regeneron DNA Learning Center. The new 4,700 square foot center is located on Regeneron's Sleepy Hollow campus in Westchester County, N.Y. The interactive educational center is equipped with two state-of-the-art teaching labs to host local middle and high school field trips during the academic year, summer camps, and semester or year-long research projects.As the newest of Cold Spring Harbor Laboratory's nine total teaching laboratories, the Regeneron DNA Learning Center offers hands-on experimentation to a diverse group of local pre-college students. The goal of this program is to increase awareness, access and exposure to STEM at a young age and inspire students to pursue careers in STEM fields. \"Regeneron and Cold Spring Harbor Laboratory are two prominent New York organizations with a shared belief in the power of science and the need to prepare students for STEM careers,\" said George D. Yancopoulos, M.D., Ph.D., Co-Founder, President and Chief Scientific Officer at Regeneron and a Trustee of Cold Spring Harbor Laboratory. \"We strongly believe that there is nothing more important to helping solve the daunting issues we face today – such as climate change, global hunger and incurable diseases – than inspiring and engaging great young scientists, including those in the Hudson Valley region. The Regeneron DNA Learning Center is one more step in that direction, and together with other efforts such as the Regeneron Science Talent Search, reflects our commitment to fostering the next generation of scientists.\"\"Our collaboration with Regeneron brings together two leading scientific institutions to offer a unique STEM learning opportunity to students across the greater Hudson Valley,\" said Bruce Stillman, Ph.D., President and Chief Executive Officer of Cold Spring Harbor Laboratory. \"This program will equip students with the skills, knowledge and excitement to thrive in future STEM careers, and contribute significantly not only to the scientific community, but also make meaningful change in their own backyards to keep New York State competitive.\" Regeneron invested approximately $4 million to build and outfit the new laboratories. The DNA Learning Center is an award-winning program of Cold Spring Harbor Laboratory and is run by their educators and Ph.D. biologists who have been trained to deliver an exceptional learning experience to every student. In addition to the onsite activities, mentor training for teachers and support for in-school experiments will provide an immersive educational experience. About Regeneron Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron believes that operating as a good corporate citizen is crucial to delivering on our mission. We approach corporate responsibility with three goals in mind: to improve the lives of people with serious disease, to foster a culture of integrity and operational excellence and to build a sustainable future. Regeneron is proud to be included on the Dow Jones Sustainability World Index and the Civic 50 list of the most \"community-minded\" companies in the United States. Throughout the year, Regeneron empowers and supports employees to give back through our volunteering, pro-bono and matching gift programs. Our most significant philanthropic commitments are in the area of science education, including the Regeneron Science Talent Search, the nation's most prestigious science and math competition for high school seniors. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter. About Cold Spring Harbor LaboratoryFounded in 1890, Cold Spring Harbor Laboratory has shaped contemporary biomedical research and education with programs in cancer, neuroscience, plant biology and quantitative biology. Home to eight Nobel Prize winners, the private, not-for-profit Laboratory employs 1,100 people including 600 scientists, students and technicians. The Meetings & Courses Program annually hosts more than 12,000 scientists. The Laboratory's education arm also includes an academic publishing house, a graduate school and the DNA Learning Center with programs for middle and high school students and teachers. For more information, visit www.cshl.edu.Regeneron Media RelationsElla CampbellPhone: 914-847-7017ella.campbell@regeneron.comCold Spring Harbor Laboratory Media RelationsSara Roncero-MenendezPhone: 516-367-6866roncero@cshl.edu  View original content:http://www.prnewswire.com/news-releases/regeneron-and-cold-spring-harbor-laboratory-unveil-new-dedicated-laboratories-for-student-science-education-300973928.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "First Clinical Data for REGN5458 (BCMAxCD3) Show Positive Preliminary Results in Multiple Myeloma",
        "subtitle": "",
        "date": "Dec 8, 2019 9:00AM EST",
        "content": "TARRYTOWN, N.Y., Dec. 8, 2019 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced initial clinical data for REGN5458, a BCMAxCD3 bispecific antibody, in patients with relapsed or refractory (R/R) multiple myeloma. BCMA (B-cell maturation antigen) is a protein that is typically over-expressed on multiple myeloma cells. REGN5458 is designed to bind to BCMA on multiple myeloma cells and the CD3 receptor on T-cells, bridging them together and activating T-cell killing of the cancer cell. Results were presented today at the American Society of Hematology (ASH) Annual Meeting from the first two dose groups (3 mg and 6 mg weekly doses). Patients had a median of seven lines of prior systemic therapy, and all had failed CD38 antibody treatment. Responses were observed in 4 of 7 (57%) patients, including 3 of 4 (75%) in the 6 mg dose group. In the 6 mg dose group, 2 patients (50%) were also minimal residual disease (MRD) negative, meaning that no cancer cells were detectable in their bone marrow.\"We are encouraged to see promising, rapid clinical activity even at the initial two doses of REGN5458 in heavily pretreated patients with multiple myeloma. Two patients achieved the high bar of MRD negativity, and another patient attained a very good partial response despite entering the trial with difficult-to-treat plasmacytomas outside of the bone marrow,\" said Israel Lowy, M.D., Ph.D., Senior Vice President and Head of Clinical and Translational Sciences for Oncology at Regeneron. \"We are actively recruiting patients into higher dose groups in this trial and look forward to sharing further results in 2020. In addition, we have also initiated a clinical trial for our second BCMAxCD3 bispecific, REGN5459, which has different binding characteristics.\"REGN5458 and REGN5459 were invented using Regeneron's next generation VelocImmune® \"human antibody mouse\" technology, together with its VelociBi™ platform. These allow for the creation of bispecific antibodies that closely resemble natural human antibodies with no linkers or artificial sequences. Additionally, Regeneron bispecifics are manufactured using similar approaches used for human antibody medicines, with similar pharmacokinetics. As of data cutoff, there have been no neurotoxicity, dose-limiting toxicities or treatment discontinuations due to adverse events (AEs). The most common treatment-emergent AEs were lymphopenia (n=5), anemia (n=4) and thrombocytopenia and cytokine release syndrome (n=3 each). Grade 3 or higher treatment-emergent AEs were seen in 5 patients and included lymphopenia (n=3), hypertension (n=2) and anemia, atrial fibrillation, fatigue, febrile neutropenia, pain in extremity, septic shock and thrombocytopenia (n=1 each). Multiple myeloma is the second most common blood cancer, with approximately 32,000 and 138,500 new diagnoses in the U.S. and world respectively. It is characterized by the proliferation of cancerous plasma cells (multiple myeloma cells) that crowd out healthy blood cells in the bone marrow, infiltrate other tissues and cause potentially life-threatening organ injury. Recent advances, such as CD38 antibody treatment, have increased life expectancy of patients from 3-4 years to 7-8 years. Despite this, multiple myeloma remains incurable, and most patients will experience relapse and require additional therapy. The REGN5458 data follow other positive results from Regeneron's growing bispecific pipeline, including updated REGN1979 data that will be presented at ASH. REGN1979 is an investigational CD3 bispecific that is being studied in R/R follicular lymphoma and diffuse large B-cell lymphoma, including in patients whose cancer did not respond to CAR-T therapy. Regeneron has also invented a second class of CD28 bispecifics, called co-stimulatory bispecifics, which have recently entered clinical trials.About the REGN5458 Phase 1/2 Dose-escalation TrialREGN5458 monotherapy is being investigated in an open-label, Phase 1/2 dose-escalation trial in patients with R/R multiple myeloma who have exhausted all therapeutic options, including proteasome inhibitors, immunomodulatory drugs and CD38 antibody treatments. The Phase 1 portion is assessing safety, tolerability and dose-limiting toxicities. Beyond the initial dose groups presented at ASH, additional dose groups are being evaluated to determine a recommended Phase 2 dose regimen. The Phase 2 portion will further assess REGN5458 anti-tumor activity and safety.Among the patients being enrolled are those with heavily pre-treated multiple myeloma, including those with extra-medullary (outside of the bone marrow) and non-secretory disease (do not secrete detectable myeloma proteins).In multiple myeloma clinical trials, treatment effectiveness is typically assessed by overall response rate (ORR; with response types categorized by the level of reduction in myeloma protein) and the rate of conversion to negative MRD (which measures the eradication of myeloma cells in bone marrow). For ORR, myeloma protein levels in the blood are reduced by more than 50% in partial responses (PR) and 90% in very good PR (VGPR), while complete responses are defined as no evidence of myeloma protein and ≤5% of plasma cells in the bone marrow. MRD is measured separately from ORR, and MRD negativity is defined as the absence of myeloma cells within 100,000 bone marrow cells.About the Regeneron Bispecific Antibody PlatformAll of Regeneron's bispecific antibodies are designed to closely resemble natural human antibodies. They are derived from a next-generation version of Regeneron's proprietary VelocImmune technology and created using the company's VelociBi platform.There are six Regeneron investigational bispecific antibodies currently in ongoing clinical trials for multiple blood cancers and solid tumors. These bispecifics fall into three categories:-- CD3 bispecifics are designed to bridge T-cells and tumor cells. At the tumor site, they activate T-cells via their CD3 receptors and promote T-cell killing of the cancer cells. Investigational candidates include: -- CD28 costimulatory bispecifics are also designed to bridge T-cells and tumor cells. At the tumor site, they costimulate T-cells via their CD28 receptors and may synergize with PD-1 inhibitors and/or CD3 bispecifics. Investigational candidates include: -- Tumor-targeted bispecifics are designed to target proteins only on the cancer cell. In this way, they may affect various signaling pathways to hamper the cancer cells' ability to survive and proliferate. Investigational candidates include: Regulatory Status of Oncology ProgramsREGN1979, REGN5458, REGN5459, REGN4018, REGN5678, REGN5093 and Libtayo are currently under clinical development for the diseases noted in this press release, and their safety and efficacy have not been evaluated by any regulatory authority for these diseases. As part of a global collaboration agreement, Regeneron and Sanofi are jointly developing Libtayo, as well as Regeneron's BCMAxCD3 and MUC16xCD3 bispecific programs.Libtayo is approved in the U.S. for the treatment of patients with metastatic cutaneous squamous cell carcinoma (CSCC) or locally advanced CSCC who are not candidates for curative surgery or curative radiation, and in other countries for similar indications. In the U.S., the generic name for Libtayo is cemiplimab-rwlc, with rwlc as the suffix designated in accordance with Nonproprietary Naming of Biological Products Guidance for Industry issued by the U.S. Food and Drug Administration.About RegeneronRegeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune®, which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Regeneron Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation REGN5458 (a BCMAxCD3 bispecific antibody) in patients with relapsed or refractory multiple myeloma, as well as REGN5459 (a BCMAxCD3 bispecific antibody), REGN1979 (a CD20xCD3 bispecific antibody), REGN4018 (a MUC16xCD3 bispecific antibody), REGN5678 (a PSMAxCD28 bispecific antibody), REGN5093 (a METxMET bispecific antibody), and Regeneron's earlier-stage product candidates (as a monotherapy or in combination with Libtayo® (cemiplimab), as applicable); unforeseen safety issues resulting from the administration of products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's product candidates (such as REGN5458, REGN5459, REGN1979, REGN4018, REGN5678, and REGN5093) in clinical trials; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators (including the open-label, Phase 1/2 dose-escalation trial evaluating REGN5458 discussed in this press release) may be replicated in other studies and lead to therapeutic applications; the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products; ongoing regulatory obligations and oversight impacting Regeneron's marketed products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; the availability and extent of reimbursement of the Company's products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the fiscal year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).Contacts: Media Relations Daren Kwok Tel: +1 (914) 598-7590 Daren.Kwok@regeneron.com Investor Relations Justin Holko Tel: +1 (914) 847-7786 Justin.Holko@regeneron.com  View original content:http://www.prnewswire.com/news-releases/first-clinical-data-for-regn5458-bcmaxcd3-show-positive-preliminary-results-in-multiple-myeloma-300971020.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron Announces Positive Topline Phase 2 Data with Anti-C5 Antibody Pozelimab in Patients with a Rare Blood Disorder",
        "subtitle": "",
        "date": "Dec 5, 2019 7:00AM EST",
        "content": "TARRYTOWN, N.Y., Dec. 5, 2019 /PRNewswire/ --Results from initial 6-patient cohort show pozelimab reduced lactate dehydrogenase (LDH) to normal levels at week 8 in patients with paroxysmal nocturnal hemoglobinuria (PNH), utilizing a weekly subcutaneous dosing regimen Second part of Phase 2 trial initiated; plans for Phase 3 program underway Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced topline data from the pozelimab (REGN3918) Phase 2 clinical program in paroxysmal nocturnal hemoglobinuria (PNH), validating the weekly 800 mg subcutaneous (SC) dosing regimen, following an initial intravenous (IV) loading dose. Pozelimab reduced the abnormal destruction of red blood cells, otherwise known as \"hemolysis,\" with patients in the initial cohort achieving normal levels of a blood biomarker of elevated hemolysis called lactate dehydrogenase (LDH).PNH is an ultra-rare, chronic, life-threatening disease where genetic mutations cause hemolysis, resulting in a range of symptoms including fatigue, shortness of breath and blood clots. Even with existing therapies, which require regular intravenous infusions administered at infusion centers or during a home visit by a health professional, approximately 50% of newly-treated patients do not achieve normal LDH levels. \"In our view, any new medicine for PNH must deliver real change for patients, such as more patients achieving normal LDH levels, or a reduced treatment burden that potentially allows for at-home self-administration,\" said George D. Yancopoulos, M.D., Ph.D., President and Chief Scientific Officer at Regeneron. \"We are encouraged by these early pozelimab results, with patients achieving normal levels of LDH by week 8 using the subcutaneous dosing regimen. We look forward to speaking with regulators about the next phase of our program for these patients.\"Pozelimab is a VelocImmune®-derived fully-human monoclonal antibody that blocks the pathway leading to red blood cell hemolysis, which was designed to reduce LDH levels and the occurrence of breakthrough hemolysis, using a self-administered subcutaneous regimen. All 6 patients in the initial treatment cohort treated with pozelimab experienced rapid and sustained reductions in LDH up to week 8. By week 2, LDH was reduced to <1.5 times the upper limit of normal (ULN) in all patients, and at the pre-specified week 8 evaluation timepoint, the mean LDH level was 0.74 (x ULN); range: 0.62-0.91 (x ULN). One of these patients had a known C5 variant resistant to existing treatments.In these 6 patients, no adverse events (AEs) were serious or led to discontinuation. At the cut-off date of the analyses, treatment-related AEs were reported in 3 patients (50%), including headache (n=2), injection site reaction (n=1) and nausea (n=1). One patient received a blood transfusion on day 50 due to underlying bone marrow dysfunction. In the earlier Phase 1 trial, the only serious AE was salpingitis in a single participant.Patients in the trial initially received a 30 mg/kg IV loading dose of pozelimab, followed by weekly 800 mg SC injections. Current approved treatments are only available via IV infusion.Data from the Phase 2 trial will be presented at an upcoming medical meeting.About PozelimabPozelimab is an investigational, fully-human monoclonal antibody designed to block complement factor C5 and prevent the destruction of red blood cells (hemolysis) that cause the symptoms of PNH and other diseases mediated by complement pathway activity. It is an IgG4 antibody that binds with high affinity to wild-type and variant human C5 and blocks its activity. Pozelimab was invented using Regeneron's proprietary VelocImmune technology, which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies. Pozelimab is currently under clinical development, and its safety and efficacy have not been evaluated by any regulatory authority.About the Phase 2 Trial The ongoing open-label, single-arm, two-part trial will enroll patients with active symptomatic PNH who are naïve to complement inhibitors or who have not received treatment with a complement inhibitor within 6 months prior to entering the trial. It consists of two cohorts: cohort A (n=6), which is complete and achieved its objective of dose confirmation; and cohort B (n=approx. 30), which is ongoing and will focus on further evaluating efficacy and safety in a larger PNH population. Patients in the trial suffer from elevated hemolytic activity, as reflected by baseline LDH levels of ≥2 times the ULN. Patients are administered a single 30 mg/kg IV loading dose of pozelimab followed by a once-weekly 800 mg SC dose.This Phase 2 trial could potentially provide pivotal data supporting approval for this orphan disease indication.About Regeneron Pharmaceuticals, Inc.Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, including VelocImmune®, which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Regeneron Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation pozelimab (REGN3918); unforeseen safety issues resulting from the administration of products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's product candidates (such as pozelimab) in clinical trials; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators (including the ongoing Phase 2 trial evaluating pozelimab discussed in this press release) may be replicated in other studies and lead to therapeutic applications; the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products; ongoing regulatory obligations and oversight impacting Regeneron's marketed products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; the availability and extent of reimbursement of the Company's products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the fiscal year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).  Contacts: Media Relations Sarah Cornhill Tel: +1 (917) 297-1522 Sarah.Cornhill@regeneron.com Investor Relations Justin Holko Tel: +1 (914) 847-7786 Justin.Holko@regeneron.com  View original content:http://www.prnewswire.com/news-releases/regeneron-announces-positive-topline-phase-2-data-with-anti-c5-antibody-pozelimab-in-patients-with-a-rare-blood-disorder-300969698.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "New England Journal of Medicine Publishes Results of Ebola Clinical Trial Confirming Superiority of Regeneron's REGN-EB3 to ZMapp in Preventing Ebola Deaths",
        "subtitle": "",
        "date": "Nov 27, 2019 5:00PM EST",
        "content": "TARRYTOWN, N.Y., Nov. 27, 2019 /PRNewswire/ --Nearly 90 percent survival for patients who received REGN-EB3 treatment earlier in the course of their disease; 66.5 percent survival among all patients who received REGN-EB3Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) announced today that the New England Journal of Medicine (NEJM) published results from the randomized controlled PALM trial showing that Regeneron's REGN-EB3 and another investigational agent provided the highest overall survival rates among four investigational treatments for Ebola virus disease. Monoclonal antibody treatments REGN-EB3, mAb114 and ZMapp and the small molecule antiviral agent remdesivir were given to a trial population of 681 patients who had Ebola during the ongoing outbreak in the Democratic Republic of the Congo (DRC). REGN-EB3, a triple-antibody cocktail, demonstrated superior efficacy compared to the ZMapp control arm across multiple measures, including the primary endpoint of mortality at day 28 (33.5 percent with REGN-EB3 versus 51.3 percent with ZMapp, p=0.002) and secondary endpoint of reduction of the number of days until the Ebola virus was no longer detected in the bloodstream.The trial was stopped in August 2019 when preliminary results showed that REGN-EB3 crossed the pre-specified superiority threshold for preventing death compared to ZMapp. Although a second investigational treatment, mAb114, did not meet this statistical threshold, it had notable activity, and the decision was made for these two strongest-performing investigational therapies to continue to be administered to patients in a trial extension phase. The REGN-EB3 antibodies were created using Regeneron's novel and proprietary VelocImmune® platform, which utilizes a mouse model with a genetically humanized immune system, and associated VelociSuite technologies that allow for harvesting and production of specific human antibodies from these mice. These technologies enable the rapid and efficient generation of multiple fully-human antibodies against targets such as Ebola virus, without requiring the identification and utilization of rare human survivors as sources of such therapeutic antibodies.\"In this study, REGN-EB3 demonstrated a significant survival advantage over another antibody treatment approach, underscoring the importance of antibody selection and design. REGN-EB3 was specifically designed to enhance efficacy, reduce the risk of viral resistance and mitigate against potential virus evolution. Our ability to rapidly create and develop these clinically-effective Ebola-specific antibodies highlights the power and speed of our VelociSuite human antibody platforms,\" said Neil Stahl, Ph.D., Executive Vice President of Research and Development at Regeneron. \"We are committed to continuing to provide this important treatment to patients through the PALM trial extension trial and 'compassionate use' until the current outbreak ends. We are also working closely with the U.S. Food and Drug Administration to gain regulatory approval and with U.S. and global health authorities to determine appropriate stockpiling of REGN-EB3, as we believe our triple antibody approach may have particular utility for future outbreaks.\"  Ebola outbreaks have historically resulted in survival rates as low as 10 percent1 and there are no approved treatments for the disease. Of all patients given REGN-EB3 in this trial setting, 66.5 percent were alive at day 28, compared to 48.7 percent of patients given ZMapp. Importantly, administration of treatment earlier in the course of disease (when viral loads are typically lower) resulted in dramatically higher survival rates with all four investigational treatments, including 88.8 percent survival at day 28 with REGN-EB3. The greatest reduction in mortality (minus 22.5 percent) across all study groups occurred with REGN-EB3 treatment in patients who were treated later in the course of their disease, when risk of dying from Ebola is greatest. All patients received optimized supportive care (oSOC), including supportive oral and/or intravenous fluids, electrolyte replacement, maintaining of oxygen status and blood pressure, pain management, and antibiotics and antimalarials as indicated. The paper reported 3 serious adverse events for REGN-EB3, compared to 7 for ZMapp, 9 for remdesivir and 10 for mAb114. Comparison of 28-day mortality and days to negative PCR by treatment group\"This trial required an incredible level of cooperation from international government agencies, non-governmental organizations and drug developers in order to deliver experimental treatments to remote, violence-plagued areas of the DRC,\" said Sumathi Sivapalasingam, M.D., Senior Director, Early Clinical Development and Experimental Sciences at Regeneron. \"Healthcare workers in the field risked their lives to treat patients, all while conducting scientifically rigorous and ethically sound research that will improve the treatment of Ebola in future outbreaks. We are so grateful for their work and that REGN-EB3 was able to improve survival for people suffering from this terrible disease.\"About the PALM TrialThe PAmoja TuLinde Maisha (PALM [\"together save lives\" in Kiswahili]) clinical trial was a randomized, multicenter, controlled trial initiated in 2018 to evaluate the safety and efficacy of three investigational Ebola virus disease therapies: mAb114, remdesivir and ZMapp. The trial protocol was amended after the World Health Organization (WHO) held an Ad-Hoc Expert Consultation to assess all preclinical and clinical data on available investigational products, and recommended the addition of REGN-EB3 as a fourth treatment arm. The National Institutes of Health (NIH) and the Institut National de Recherche Biomédicale (INRB) in the DRC jointly sponsored and served as co-principal investigators and are senior authors of the New England Journal of Medicine publication. About REGN-EB3REGN-EB3 (also known as REGN3470-3471-3479) was invented by Regeneron using its VelociSuite® technologies, starting with the VelocImmune® mouse; the therapy combines three fully-human monoclonal antibodies. REGN-EB3 has received Orphan Drug designation from both the U.S. Food and Drug Administration (FDA) and the European Medicines Agency; in early September 2019, REGN-EB3 also received Breakthrough Therapy designation from the FDA. REGN-EB3 is being developed, tested and manufactured through contracts awarded in 2015 and 2017 by the Biomedical Advanced Research and Development Authority (BARDA), under the Assistant Secretary for Preparedness and Response within the U.S. Department of Health and Human Services (USG Contract No. HHSO100201500013C and HHSO100201700016C). REGN-EB3 is currently under clinical development and its safety and efficacy have not been fully evaluated by any regulatory authority. Regeneron's rapid response infectious disease platform has the potential to accelerate response to future epidemics and pandemics that may pose a threat to public health. Regeneron and BARDA have several ongoing research collaborations in addition to the Ebola program, including efforts to develop antibodies targeting up to 10 pathogens that pose significant risk to public health. About RegeneronRegeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases. Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, including VelocImmune® which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Regeneron Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation Regeneron's potential antibody therapy for the treatment of Ebola (REGN-EB3 or REGN3470-3471-3479); the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in later studies and lead to therapeutic applications; unforeseen safety issues and possible liability resulting from the administration of products and product candidates in patients, including without limitation Regeneron's potential antibody therapy for the treatment of Ebola; serious complications or side effects in connection with the use of Regeneron's products and product candidates (such as Regeneron's potential antibody therapy for the treatment of Ebola) in clinical trials; the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products; the availability and extent of reimbursement of the Company's products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; ongoing regulatory obligations and oversight impacting Regeneron's marketed products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates, such as Regeneron's potential antibody therapy for the treatment of Ebola; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), as well as the agreements with the Biomedical Advanced Research and Development Authority of the U.S. Department of Health and Human Services referenced in this press release, to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the United States Securities and Exchange Commission, including its Form 10-K for the year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise. Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron). Regeneron Contacts:Media RelationsElla CampbellTel: +1 (914) 572-4003Ella.campbell@regeneron.com Investor RelationsJustin HolkoTel: +1 (914) 847-7786Justin.Holko@regeneron.com 1 \"Ebola virus disease.\" World Health Organization. https://www.who.int/en/news-room/fact-sheets/detail/ebola-virus-disease. Last accessed November 26, 2019. 2 Administration of remdesivir, mAb114 and ZMapp began in November 2018, and REGN-EB3 was added as a fourth arm of the trial in January 2019. Therefore, outcomes in the remdesivir and mAb114 arms and outcomes in the REGN-EB3 arm were compared to slightly different cohorts of participants in the ZMapp control group based on time of enrollment. Overall mortality was very similar in each control group. 3 CtNP refers to \"cycle threshold for the nucleoprotein gene,\" a measure to determine viral load in the bloodstream. Patients with higher viral loads will have lower CtNP values. Viral load generally increases over time without treatment. View original content:http://www.prnewswire.com/news-releases/new-england-journal-of-medicine-publishes-results-of-ebola-clinical-trial-confirming-superiority-of-regenerons-regn-eb3-to-zmapp-in-preventing-ebola-deaths-300966255.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron's Yancopoulos Receives Columbia College's Alexander Hamilton Award",
        "subtitle": "",
        "date": "Nov 22, 2019 7:00AM EST",
        "content": "TARRYTOWN, N.Y., Nov. 22, 2019 /PRNewswire/ --Columbia's highest honor bestowed for Yancopoulos' contributions to science and medicineRegeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that George D. Yancopoulos, M.D., Ph.D., Co-Founder, President and Chief Scientific Officer, was awarded Columbia College's Alexander Hamilton Medal, the highest honor awarded to a member of the Columbia College community for distinguished service and accomplishment in any field of endeavor.\"George is a generational talent as a life scientist, technology innovator and drug developer. His abilities as a biotech leader, combined with his remarkably synergistic and long-term partnership with Len Schleifer, are the major drivers behind Regeneron's extraordinary growth and contributions to human health over the years,\" said Nobel Prize winner and Regeneron board member Michael S. Brown, M.D., Distinguished Chair in Biomedical Sciences and Regental Professor of Molecular Genetics and Internal Medicine at the University of Texas Southwestern Medical Center.Biography & Career Accomplishments Yancopoulos, the son of Greek immigrants and a life-long New Yorker, attended New York City public schools and graduated as valedictorian of the Bronx High School of Science, where he was a top winner of the nation's premier high school science competition, then known as the Westinghouse Science Talent Search. He became valedictorian of Columbia College in 1980, where he received the Eisenhower award as the school's top scholar-athlete while serving as captain of the crew team. Yancopoulos then received his M.D. from Columbia University's College of Physicians and Surgeons and his Ph.D. in Biochemistry and Molecular Biophysics from Columbia University's Graduate School of Arts and Sciences, where he was chosen to represent his doctoral class as commencement speaker. He launched his career as an academic scientist with Frederick W. Alt at Columbia, publishing seminal papers in molecular immunology. In 1989, Yancopoulos left academia to join Leonard S. Schleifer, M.D., Ph.D., his Co-founder, President and Chief Executive Officer of Regeneron. Under their leadership, Regeneron has become one of the most admired and innovative companies in biotech, with seven FDA-approved medicines since 2008, and a pipeline of over twenty additional investigational products – all homegrown in the company's own laboratories. In the last twenty years, fewer than 100 biotech companies have invented and successfully obtained FDA approval for even one drug, and only a handful have done this four or more times. Regeneron medicines include the blockbusters EYLEA® (aflibercept) Injection and Dupixent® (dupilumab). Regeneron medicines are used to treat vision loss, asthma, atopic dermatitis, heart disease, arthritis and cancer, and the National Institutes of Health recently announced the effectiveness of Regeneron's investigational Ebola virus infection therapy. Yancopoulos takes an unusually hands-on approach to drug discovery, serving as lead inventor and developer. He works closely with key members of his team to invent Regeneron's medicines and their underlying foundational technologies, such as the VelociGene® \"knockout\" platform, the VelocImmune® human antibody mouse, and the Veloci-Bi™ bispecific antibody creation platform. During the 1990s, he was among the ten most highly cited scientists in the world, with landmark publications pertaining to the cloning and biology of numerous growth factors and their receptors (from the Neurotrophins, Angiopoietins, and Ephrins to the CNTF receptor and the Agrin receptor, MUSK), on the elucidation of the mechanism of action of the cytokine class of receptors, and other findings leading to the development of Regeneron's medicines and technologies. His team continues to pursue cutting-edge research, such as through the Regeneron Genetics Center, a world-leading effort that has sequenced the exomes of nearly one million people and paired this information with de-identified medical records in the quest to identify new and improved treatment options. Yancopoulos is passionate about giving back to the Columbia community and committed to supporting the next generation of great young scientists. He leads Regeneron's numerous STEM education and mentorship programs, including a $100 million commitment to the Regeneron Science Talent Search, which was formerly sponsored by Intel and Westinghouse. Yancopoulos was inducted into the National Academy of Sciences in 2004 and into the Biotech Hall of Fame in 2014. He and Schleifer were selected as Ernst & Young's \"Entrepreneurs of the Year\" in 2016. Other accolades from Columbia include the Steven's Triennial Prize for original medical research, the University Medal of Excellence and the John Jay Award for distinguished professional achievement. Yancopoulos' efforts have also been recognized at the company level, as Regeneron has routinely been listed by Forbes as one of the \"Ten Most Innovative Companies in the World\" and by Science magazine as either the 1st or 2nd Top Biopharma Company to work for over the past nine years. Many of Yancopoulos' fellow R&D leaders at Regeneron also have Columbia roots, including Drew Murphy, Ph.D. (Executive Vice President, Research), and Lynn MacDonald, Ph.D. (Vice President, Research), who are Yancopoulos' co-inventors of the VelociGene and VelocImmune technologies; Christos Kyratsous, Ph.D. (Vice President, Infectious Disease and Viral Vector Technologies), who spearheaded development of Regeneron's Ebola treatment; Ned Braunstein, M.D. (Senior Vice President, Regulatory, Pharmacovigilance and Risk Management), and David Weinreich, M.D. (Senior Vice President and Head of Global Clinical Development), who lead the Company's regulatory and Global Development efforts; Israel Lowy, M.D., Ph.D. (Senior Vice President and Head of Translational Science and Oncology), who leads Regeneron's clinical program in oncology; and Jay Markowitz, M.D. (Senior Vice President, Portfolio Management), who leads strategic direction.About RegeneronRegeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases. Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, including VelocImmune® which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Regeneron Media Relations  (914) 847-3407  media@regeneron.com   View original content:http://www.prnewswire.com/news-releases/regenerons-yancopoulos-receives-columbia-colleges-alexander-hamilton-award-300963506.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron Announces Upcoming Investor Conference Presentations",
        "subtitle": "",
        "date": "Nov 12, 2019 7:30AM EST",
        "content": "TARRYTOWN, N.Y., Nov. 12, 2019 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) will webcast management presentations as follows:The sessions may be accessed from the \"Investors & Media\" page of Regeneron's website at http://investor.regeneron.com/events-and-presentations.  Replays of the webcasts will be archived on the Company's website for at least 30 days.About Regeneron Pharmaceuticals, Inc.Regeneron is a leading biotechnology company that invents life-transforming medicines for people with serious diseases.  Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories.  Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through its proprietary VelociSuite® technologies, such as VelocImmune® which produces optimized fully-human antibodies, and ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Contact Information:Investor RelationsJustin Holko914.847.7786justin.holko@regeneron.comCorporate CommunicationsHala Mirza914.847.3422hala.mirza@regeneron.com View original content:http://www.prnewswire.com/news-releases/regeneron-announces-upcoming-investor-conference-presentations-300955713.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron to Report Results from CD20xCD3 and BCMAxCD3 Bispecifics and C5 Antibody Programs at ASH Annual meeting",
        "subtitle": "New data is from programs in B-cell non-Hodgkin lymphoma, multiple myeloma and paroxysmal nocturnal hemoglobinuria",
        "date": "Nov 6, 2019 9:00AM EST",
        "content": "TARRYTOWN, N.Y., Nov. 6, 2019 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that it will share new and updated data for two investigational medicines for blood cancers and a third for a rare blood disease at the 2019 American Society of Hematology (ASH) Annual Meeting from December 7-10 in Orlando, FL. Among the accepted abstracts are the first clinical data for REGN5458 (BCMAxCD3) in relapsed/refractory (R/R) multiple myeloma, as well as updated data for REGN1979 (CD20xCD3) in R/R B-cell non-Hodgkin lymphoma (B-NHL). Beyond oncology, the company will share data on pozelimab, a monoclonal antibody designed to block complement factor C5 and prevent the destruction of red blood cells (hemolysis) that cause the symptoms of paroxysmal nocturnal hemoglobinuria (PNH). \"The ASH presentations highlight Regeneron's growing portfolio in blood cancer and rare diseases, including data from two of our six bispecific antibodies currently in clinical development,\" said David Weinreich, M.D., Senior Vice President, Head of Global Clinical Development and Co-Head of Global Development at Regeneron. \"We will also present data on pozelimab, which we are studying in a Phase 2 program in paroxysmal nocturnal hemoglobinuria.\"\"We continue to make important progress with REGN1979 and are currently enrolling a potentially registrational Phase 2 trial. At ASH, we plan to share new data with additional patients and longer duration of follow-up, with about 20 patients at effective dose levels for each cohort of follicular lymphoma and diffuse large B-cell lymphoma,\" said Israel Lowy, M.D., PhD, Senior Vice President and Head of Clinical and Translational Sciences for Oncology at Regeneron. \"As part of our expanding bispecific portfolio, we will also present encouraging, early single-agent data on REGN5458, our BCMAxCD3 bispecific for multiple myeloma. Additional investigational bispecific antibodies are expected to enter clinical trials in the coming year.\"The abstracts published today reflect older data; presentations with updated data will be shared at ASH as follows:REGN1979REGN5458Pozelimab/PNHAbout the Regeneron Bispecific Antibody PlatformAll of Regeneron's bispecific antibodies are designed to closely resemble natural human antibodies. They are derived from a next-generation version of Regeneron's proprietary VelocImmune® technology and created using the company's VelociBi™ platform.There are six Regeneron investigational bispecific antibodies currently in ongoing clinical trials for multiple blood cancers and solid tumors. These bispecifics fall into three categories:Regulatory Status of ProgramsREGN1979, REGN5458, REGN5459, REGN4018, REGN5678, REGN5093, pozelimab and Libtayo are currently under clinical development for the diseases noted in this press release, and their safety and efficacy have not been evaluated by any regulatory authority for these diseases. As part of a global collaboration agreement, Regeneron and Sanofi are jointly developing Libtayo, as well as Regeneron's BCMAxCD3 and MUC16xCD3 bispecific programs. Libtayo is approved in the U.S. for the treatment of patients with metastatic cutaneous squamous cell carcinoma (CSCC) or locally advanced CSCC who are not candidates for curative surgery or curative radiation, and in other countries for similar indications. In the U.S., the generic name for Libtayo is cemiplimab-rwlc, with rwlc as the suffix designated in accordance with Nonproprietary Naming of Biological Products Guidance for Industry issued by the U.S. Food and Drug Administration.About Regeneron Pharmaceuticals, Inc.Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune®, which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Regeneron Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation REGN1979 in patients with relapsed or refractory B-cell non-Hodgkin lymphoma and other potential indications, as well as REGN5458 (BCMAxCD3 bispecific antibody being investigated in multiple myeloma) and pozelimab (C5 antibody), and Regeneron's earlier-stage product candidates (such as Regeneron's other bispecific antibodies and costimulatory bispecific antibody discussed in this press release (as a monotherapy or in combination with Libtayo® (cemiplimab), as applicable)); unforeseen safety issues resulting from the administration of products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's product candidates (such as REGN1979, REGN5458, and pozelimab) in clinical trials; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in other studies and lead to therapeutic applications; the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products; ongoing regulatory obligations and oversight impacting Regeneron's marketed products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; the availability and extent of reimbursement of the Company's products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab)), other litigation and other proceedings and government investigations relating to the Company and/or its operations, the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the fiscal year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron). Contacts: Media Relations Daren Kwok Tel: +1 (914) 847-1328 Daren.Kwok@regeneron.com Investor Relations Justin Holko Tel: +1 (914) 847-7786 Justin.Holko@regeneron.com  View original content:http://www.prnewswire.com/news-releases/regeneron-to-report-results-from-cd20xcd3-and-bcmaxcd3-bispecifics-and-c5-antibody-programs-at-ash-annual-meeting-300952821.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron and Vyriad Announce Strategic Agreement for Discovery and Development of New Oncolytic Virus Treatments for Cancer",
        "subtitle": "",
        "date": "Nov 6, 2019 7:00AM EST",
        "content": " TARRYTOWN, N.Y. and ROCHESTER, Minn., Nov. 6, 2019 /PRNewswire/ -- Phase 2 trial will evaluate combination of PD-1 inhibitor Libtayo® (cemiplimab-rwlc) and oncolytic virus Voyager-V1; preclinical research collaboration will explore new oncolytic virus treatmentsVyriad to receive upfront payment and equity investment from Regeneron Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) and Vyriad, Inc. today announced a research collaboration and option licensing agreement focused on the development of new oncolytic (cancer-killing) virus-based treatments for various forms of cancer. The agreement includes a Phase 2 clinical study, slated to begin in 2020, evaluating Regeneron's PD-1 inhibitor Libtayo® (cemiplimab-rwlc) in combination with Vyriad's oncolytic virus Voyager-V1 in multiple types of cancer, including melanoma, lung, liver and endometrial cancers. The companies will also enter into a five-year research effort that utilizes Regeneron's VelociSuite® technologies to jointly design and validate novel Vesicular Stomatitis Virus (VSV)-based oncolytic virus treatments. Libtayo is a fully-human monoclonal antibody targeting the immune checkpoint receptor PD-1 (programmed cell death protein-1) and is being jointly developed and commercialized by Regeneron and Sanofi under a global collaboration agreement. Libtayo was invented by Regeneron using the company's proprietary VelocImmune® technology which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies. Vyriad's investigational drug candidate Voyager-V1 is a potent VSV programmed to attack cancer cells selectively, while also activating the immune system to kill local and distant cancer cells. Further, it amplifies inflammatory and antitumor immune system responses that help turn \"cold\" tumors \"hot,\" which potentially enhances anti-PD-1 activity. Voyager-V1 is deliverable by intravenous infusion.\"Vyriad's differentiated oncolytic virotherapy platform helps Regeneron continue to diversify our arsenal of immuno-oncology approaches, which include multiple combinations with our anti-PD-1 backbone, as well as novel delivery and re-targeting mechanisms,\" said Israel Lowy, M.D., Ph.D., Senior Vice President and Head of Clinical and Translational Sciences, Oncology at Regeneron. \"We are eager to explore the combination of Voyager-V1 and Libtayo in patients with different tumor types in the short term, and see long-term promising synergies with our existing areas of strength, particularly in antibody development and viral vector technologies. We look forward to working together to help cancer patients in need.\"\"We are thrilled to partner with Regeneron in this far-reaching collaboration to develop novel cancer treatments,\" said Stephen Russell, M.D., Ph.D., President and Chief Executive Officer of Vyriad. \"We are optimistic that the clinical combination of Voyager-V1 with Libtayo will result in effective anticancer activity, and we are very excited to join forces with Regeneron scientists to develop a new generation of precision targeted VSV therapies. Through the collaboration, we expect that the emerging power of oncolytic virotherapy can finally integrate with proven capabilities of antibody engineering, with the potential to create life-changing medicines for cancer patients.\"Under the agreement, Vyriad will receive an upfront payment and Regeneron will make an equity investment in the company. Regeneron will have an exclusive option to license Voyager-V1 and other collaboration products. Vyriad is eligible to receive additional payments based on the achievement of specified development and commercial milestones, as well as royalties on net sales of potential future VSV-based collaboration products. During the five-year collaboration term, Vyriad will work exclusively with Regeneron to research and develop VSV technologies. Specific financial terms were not disclosed.More About Voyager-V1Voyager-V1 is an investigational oncolytic virus that was designed for enhanced safety, efficacy, and traceability through the inclusion of an interferon beta gene, enabling the virus to replicate quickly in cancer cells without damaging healthy cells, recruit cancer-fighting immune cells to the tumor, and secrete a measurable reporter protein into the blood. Voyager-V1 was also engineered to include an iodine transporter NIS gene that facilitates tracking of the virus' spread to cancer cells throughout the body. Voyager-V1 is under evaluation as both a monotherapy and combination therapy in multiple Phase 1-2 studies for metastatic colorectal cancer, endometrial cancer, non-small cell lung cancer, squamous cell carcinoma of the head and neck and various blood cancers.More About LibtayoLibtayo is approved in the U.S., European Union, Canada and Brazil for adult patients with metastatic cutaneous squamous cell carcinoma (CSCC) or locally advanced CSCC who are not candidates for curative surgery or curative radiation. In the U.S., the generic name for Libtayo is cemiplimab-rwlc, with rwlc as the suffix designated in accordance with Nonproprietary Naming of Biological Products Guidance for Industry issued by the U.S. Food and Drug Administration.Beyond the ongoing EMPOWER-CSCC-1 trial, Libtayo is also being investigated in adjuvant and neoadjuvant trials in CSCC and in potential registrational trials in non-small cell lung cancer, basal cell carcinoma and cervical cancer. Additional studies include trials in squamous cell carcinoma of the head and neck, melanoma, colorectal cancer, prostate cancer, multiple myeloma, Hodgkin's lymphoma and non-Hodgkin's lymphoma. These trials are designed to investigate Libtayo as monotherapy; in combination with conventional treatments like chemotherapy; or in combination with other investigational agents, including vaccines, oncolytic viruses and bispecific antibodies, among others. These potential uses are investigational, and their safety and efficacy have not been evaluated by any regulatory authority.IMPORTANT SAFETY INFORMATION AND INDICATION FOR U.S. PATIENTSWhat is the most important information I should know about Libtayo?Libtayo is a medicine that may treat a type of skin cancer by working with your immune system. Libtayo can cause your immune system to attack normal organs and tissues in any area of your body and can affect the way they work. These problems can sometimes become severe or life-threatening and can lead to death. These problems may happen anytime during treatment or even after your treatment has ended.Call or see your healthcare provider right away if you develop any symptoms of the following problems or these symptoms get worse:Getting medical treatment right away may help keep these problems from becoming more serious.Your healthcare provider will check you for these problems during your treatment with Libtayo. Your healthcare provider may treat you with corticosteroid or hormone replacement medicines. Your healthcare provider may delay or completely stop treatment if you have severe side effects.Before you receive Libtayo, tell your healthcare provider about all your medical conditions, including if you:Females who are able to become pregnant: Tell your healthcare provider about all the medicines you take, including prescription and over-the-counter medicines, vitamins, and herbal supplements.The most common side effects of Libtayo include tiredness, rash, and diarrhea. These are not all the possible side effects of Libtayo. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. You may also report side effects to Regeneron Pharmaceuticals and Sanofi at 1-877-542-8296.For more information, please see full Prescribing Information, including Medication Guide.What is Libtayo?Libtayo is a prescription medicine used to treat people with a type of skin cancer called cutaneous squamous cell carcinoma (CSCC) that has spread or cannot be cured by surgery or radiation.It is not known if Libtayo is safe and effective in children.About RegeneronRegeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, infectious diseases, pain and rare diseases. Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, including VelocImmune® which uses a unique genetically-humanized mouse to produce optimized fully-human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world. For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.About VyriadVyriad is a clinical-stage company developing proprietary oncolytic virus therapies for the treatment of cancers with significant unmet needs. Founded by scientists at Mayo Clinic and the University of Miami, Vyriad programs viruses to selectively attack cancer cells, thereby igniting antitumor immune responses that can complete the process of tumor destruction and prevent disease recurrence. Our lead platforms, derived from vesicular stomatitis and measles viruses, are being evaluated in ongoing Phase 1-2 clinical trials addressing multiple cancer types.  Vyriad is a privately held company based in Rochester, Minnesota. For more information, visit www.vyriad.com.Regeneron Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's or its collaborators' products, product candidates, and research and clinical programs now underway or planned, such as the oncolytic virus-based treatment programs discussed in this press release (including the program evaluating Libtayo® (cemiplimab-rwlc) in combination with Voyager-V1 in multiple types of cancer, including melanoma, lung, liver, and endometrial cancers); the extent to which the results from the research and development programs conducted by Regeneron or its collaborators (including based on the collaboration discussed in this press release) may be replicated in other studies and lead to therapeutic applications; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), as well as Regeneron's collaboration with Vyriad, Inc. discussed in this press release, to be cancelled or terminated without any product success; the likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products, such as Libtayo (as a monotherapy or in combination with conventional treatments or other investigational agents (such as oncolytic viruses), as applicable) for the treatment of non-small cell lung cancer, basal cell carcinoma, cervical cancer, squamous cell carcinoma of the head and neck, melanoma, colorectal cancer, prostate cancer, multiple myeloma, Hodgkin's lymphoma, non-Hodgkin's lymphoma, and other potential indications; unforeseen safety issues resulting from the administration of products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's or its collaborators' product candidates in clinical trials; ongoing regulatory obligations and oversight impacting Regeneron's marketed products, research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's or its collaborators' ability to continue to develop or commercialize products and product candidates; competing drugs and product candidates that may be superior to Regeneron's or its collaborators' products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's or its collaborators' products and product candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) on the commercial success of Regeneron's or its collaborators' products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; the availability and extent of reimbursement of the Company's products from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; and risks associated with intellectual property of other parties and pending or future litigation relating thereto, including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab), the ultimate outcome of any such proceedings, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, including without limitation any financial projection or guidance, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron). Regeneron Contacts:Vyriad Contact:  View original content:http://www.prnewswire.com/news-releases/regeneron-and-vyriad-announce-strategic-agreement-for-discovery-and-development-of-new-oncolytic-virus-treatments-for-cancer-300952141.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    },
    {
        "title": "Regeneron Provides Updates on Phase 3 Libtayo® (cemiplimab) Development Program in Advanced Non-small Cell Lung Cancer",
        "subtitle": "",
        "date": "Nov 5, 2019 6:40AM EST",
        "content": "TARRYTOWN, N.Y., Nov. 5, 2019 /PRNewswire/ -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today provided an update on the ongoing Phase 3 development program evaluating Libtayo® (cemiplimab), a PD-1 inhibitor, as monotherapy and combination therapy in first-line patients with advanced non-small cell lung cancer (NSCLC). Regeneron is currently recruiting patients in two Phase 3 trials in first-line NSCLC. The first trial, an open-label randomized trial that compares Libtayo monotherapy to standard-of-care platinum-based chemotherapy in patients with high PD-L1 expression (tumor proportion score [TPS] >50%):The second trial, which consists of two parts, evaluates Libtayo in combination with platinum-based chemotherapy:Libtayo is being jointly developed by Regeneron and Sanofi under a global collaboration agreement. Libtayo is a PD-1 inhibitor that was invented by Regeneron using the company's proprietary VelocImmune® technology, which uses a genetically-humanized mouse to produce optimized fully-human antibodies.About the Phase 3 Libtayo NSCLC TrialsThe primary endpoints of the randomized, open-label Phase 3 monotherapy trial are OS and progression-free survival (PFS). Patients receive either Libtayo 350 mg every 3 weeks or investigator's choice of a standard-of-care platinum-based doublet chemotherapy regimen (with or without maintenance therapy). Patients in the trial have stage IIIB, IIIC or stage IV squamous or non-squamous NSCLC, are not candidates for definitive chemotherapy and radiation, have not received prior systemic treatment for their advanced disease, and have high PD-L1 expression (TPS ³50%). As part of a separate internal research effort assessing the effect of baseline patient variables, an unintended aggregation of open-label ORR data by treatment group occurred for the first 361 enrolled patients. In NSCLC, regulatory authorities do not consider ORR a validated surrogate endpoint. In the Phase 3 combination trial, the Part 1 primary endpoint is ORR and the Part 2 primary endpoints are OS and PFS. Patients in the Libtayo treatment groups receive 350 mg every 3 weeks. Trial patients have either stage IIIB or IIIC squamous or non-squamous NSCLC and are not candidates for treatment with definitive concurrent chemoradiation, or have stage IV disease and have not received prior systemic treatment for recurrent or metastatic NSCLC. About LibtayoLibtayo is a fully-human monoclonal antibody targeting the immune checkpoint receptor PD-1 (programmed cell death protein-1). It is approved in the U.S., European Union, Canada and Brazil for adult patients with metastatic cutaneous squamous cell carcinoma (CSCC) or locally advanced CSCC who are not candidates for curative surgery or curative radiation. In the U.S., the generic name for Libtayo is cemiplimab-rwlc, with rwlc as the suffix designated in accordance with Nonproprietary Naming of Biological Products Guidance for Industry issued by the U.S. Food and Drug Administration.In addition to NSCLC, Libtayo is also being investigated in potential registrational trials in basal cell carcinoma and cervical cancer, along with additional trials in squamous cell carcinoma of the head and neck, melanoma, colorectal cancer, prostate cancer, multiple myeloma, Hodgkin lymphoma and non-Hodgkin lymphoma. These trials are designed to investigate Libtayo as monotherapy; in combination with conventional treatments like chemotherapy; or in combination with other investigational agents, including vaccines, oncolytic viruses and bispecific antibodies, among others. These potential uses are investigational, and their safety and efficacy have not been evaluated by any regulatory authority.IMPORTANT SAFETY INFORMATION AND INDICATION FOR U.S. PATIENTSWhat is the most important information I should know about Libtayo?Libtayo is a medicine that may treat a type of skin cancer by working with your immune system. Libtayo can cause your immune system to attack normal organs and tissues in any area of your body and can affect the way they work. These problems can sometimes become severe or life-threatening and can lead to death. These problems may happen anytime during treatment or even after your treatment has ended.Call or see your healthcare provider right away if you develop any symptoms of the following problems or these symptoms get worse:Getting medical treatment right away may help keep these problems from becoming more serious. Your healthcare provider will check you for these problems during your treatment with Libtayo. Your healthcare provider may treat you with corticosteroid or hormone replacement medicines. Your healthcare provider may delay or completely stop treatment if you have severe side effects.Before you receive Libtayo, tell your healthcare provider about all your medical conditions, including if you: Tell your healthcare provider about all the medicines you take, including prescription and over-the-counter medicines, vitamins, and herbal supplements. The most common side effects of Libtayo include tiredness, rash, and diarrhea. These are not all the possible side effects of Libtayo. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. You may also report side effects to Regeneron Pharmaceuticals and Sanofi at 1-877-542-8296.Please see accompanying full Prescribing Information, including Medication Guide.What is Libtayo?Libtayo is a prescription medicine used to treat people with a type of skin cancer called cutaneous squamous cell carcinoma (CSCC) that has spread or cannot be cured by surgery or radiation.It is not known if Libtayo is safe and effective in children.About Regeneron Pharmaceuticals, Inc.Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to seven FDA-approved treatments and numerous product candidates in development, all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, neuromuscular diseases, infectious diseases and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune® which produces optimized fully-human antibodies, and ambitious research initiatives such as the Regeneron Genetics Center, which is conducting one of the largest genetics sequencing efforts in the world.For additional information about the company, please visit www.regeneron.com or follow @Regeneron on Twitter.Forward-Looking Statements and Use of Digital MediaThis press release includes forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (\"Regeneron\" or the \"Company\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others, the nature, timing, and possible success and therapeutic applications of Regeneron's products, product candidates, and research and clinical programs now underway or planned, including without limitation Libtayo® (cemiplimab) as a monotherapy and combination therapy in first-line patients with advanced non-small cell lung cancer (\"NSCLC\") and as a monotherapy or in combination with conventional treatments or other investigational agents for the treatment of basal cell carcinoma, cervical cancer, squamous cell carcinoma of the head and neck, melanoma, colorectal cancer, prostate cancer, multiple myeloma, Hodgkin lymphoma, non-Hodgkin lymphoma, and other potential indications; the likelihood and timing of achieving any of Regeneron's anticipated clinical development milestones; unforeseen safety issues resulting from the administration of products and product candidates in patients, including serious complications or side effects in connection with the use of Regeneron's product candidates (such as Libtayo) in clinical trials (including the clinical trials referenced in this press release); the likelihood and timing of possible regulatory approval and commercial launch of Regeneron's late-stage product candidates and new indications for marketed products, including without limitation any possible regulatory approval of Libtayo (as a monotherapy or in combination with conventional treatments or other investigational agents, as applicable) for the treatment of NSCLC, basal cell carcinoma, cervical cancer, squamous cell carcinoma of the head and neck, melanoma, colorectal cancer, prostate cancer, multiple myeloma, Hodgkin lymphoma, non-Hodgkin lymphoma, and other potential indications; the extent to which the results from the research and development programs conducted by Regeneron or its collaborators may be replicated in other studies and lead to therapeutic applications; ongoing regulatory obligations and oversight impacting Regeneron's marketed products (such as Libtayo), research and clinical programs, and business, including those relating to patient privacy; determinations by regulatory and administrative governmental authorities which may delay or restrict Regeneron's ability to continue to develop or commercialize Regeneron's products and product candidates; competing drugs and product candidates that may be superior to Regeneron's products and product candidates; uncertainty of market acceptance and commercial success of Regeneron's products and product candidates; the ability of Regeneron to manufacture and manage supply chains for multiple products and product candidates; the ability of Regeneron's collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's products and product candidates; the availability and extent of reimbursement of the Company's products (such as Libtayo) from third-party payers, including private payer healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; coverage and reimbursement determinations by such payers and new policies and procedures adopted by such payers; unanticipated expenses; the costs of developing, producing, and selling products; the ability of Regeneron to meet any of its financial projections or guidance and changes to the assumptions underlying those projections or guidance; the potential for any license or collaboration agreement, including Regeneron's agreements with Sanofi, Bayer, and Teva Pharmaceutical Industries Ltd. (or their respective affiliated companies, as applicable), to be cancelled or terminated without any further product success; and risks associated with intellectual property of other parties and pending or future litigation relating thereto, including without limitation the patent litigation and other related proceedings relating to Dupixent® (dupilumab) and Praluent® (alirocumab), the ultimate outcome of any such proceedings, and the impact any of the foregoing may have on Regeneron's business, prospects, operating results, and financial condition. A more complete description of these and other material risks can be found in Regeneron's filings with the U.S. Securities and Exchange Commission, including its Form 10-K for the fiscal year ended December 31, 2018 and its Form 10-Q for the quarterly period ended September 30, 2019. Any forward-looking statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any forward-looking statements made by Regeneron. Regeneron does not undertake any obligation to update publicly any forward-looking statement, whether as a result of new information, future events, or otherwise.Regeneron uses its media and investor relations website and social media outlets to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Regeneron is routinely posted and is accessible on Regeneron's media and investor relations website (http://newsroom.regeneron.com) and its Twitter feed (http://twitter.com/regeneron).Contacts:Media RelationsSarah CornhillTel: +1 (917) 297-1522Sarah.Cornhill@regeneron.com Investor RelationsJustin HolkoTel: +1 (914) 847-7786Justin.Holko@regeneron.com  View original content:http://www.prnewswire.com/news-releases/regeneron-provides-updates-on-phase-3-libtayo-cemiplimab-development-program-in-advanced-non-small-cell-lung-cancer-300951372.htmlSOURCE  Regeneron Pharmaceuticals, Inc."
    }
]