[
    {
        "title": "Starbucks and PepsiCo Bring Nitro Cold Brew to the Grocery Aisle and Convenience Stores",
        "subtitle": "",
        "date": "Feb 26, 2020 9:00AM EST",
        "content": "\nAfter expanding Nitro Cold Brew availability to U.S. Starbucks stores nationwide last summer, the brand is bringing the velvety smooth taste of Nitro Cold Brew to scale in a new ready-to-drink format\n    SEATTLE & PURCHASE, N.Y.--(BUSINESS WIRE)--\nStarbucks (Nasdaq: SBUX) and PepsiCo today announced the launch of new Ready-To-Drink (RTD) Starbucks® Nitro Cold Brew, entering a high growth segment of the RTD Cold Brew category. This is the latest product to join the ranks of successful innovations developed since Starbucks and PepsiCo formed the North American Coffee Partnership (NACP) in 1994, which includes Bottled Cold Brew, Bottled Frappuccino® chilled coffee drink, Starbucks Tripleshot® beverages, Starbucks Doubleshot® beverages, Multi-Serve Iced Coffee and more. Over the past 25+ years, the NACP has grown to more than $2 billion in retail sales, and Starbucks is the leader in the RTD coffee category with 82 percent share.\n\n“Through the NACP, Starbucks and PepsiCo created the RTD Coffee category 25 years ago and have consistently delivered leading innovation to our consumers,” said Nik Dhodi, Starbucks senior director, brand management. “To build on the success of Starbucks Nitro Cold Brew in our retail cafes and meet the evolving needs of consumers in the category, we are excited to launch a line of RTD Starbucks Nitro Cold Brew beverages to expand the reach to even more people.”\n\nWhile RTD Nitro Cold Brew isn’t new to the marketplace, Starbucks is one of the only coffee companies to bring it to scale, and the brand sees a great opportunity to further expand the RTD Nitro Cold Brew market that is growing at a rate of almost 40% per year.\n\nRTD Starbucks Nitro Cold Brew arrives on the heels of the popular Nitro Cold Brew in Starbucks stores, representing customer-centric innovation for Starbucks. The brand first introduced Nitro Cold Brew at Starbucks Reserve® Roastery in Seattle in July 2015, and due to popularity, Nitro Cold Brew scaled to 500 U.S. stores less than one year later. Last year, Starbucks reached national availability of Nitro Cold Brew in U.S. company operated stores.\n\nThe new product is available in three flavors, two of which are inspired by handcrafted beverages served at Starbucks stores: Black, Vanilla Sweet Cream and Dark Caramel. The Cold Brew is infused with nitrogen, and the moment the can is opened a rush of microbubbles delivers a delicious, velvety smooth taste. It can be found nationwide for a suggested retail price of $3.99 at convenience locations and $3.49 in grocery.\n\nThe NACP has more café favorites available in RTD format, including the new Starbucks Iced Latte Caramel Macchiato that brings the fan-favorite flavor available in cafés since 1996 to your home or on-the-go. The NACP has also introduced new flavors to various existing product platforms this year, including: Starbucks Frappuccino Brown Butter Caramel with a Splash of Cold Brew, Starbucks Iced Espresso Classics White Chocolate Mocha, Starbucks Tripleshot™ Energy Dark Roast, Starbucks Doubleshot Espresso Americano, Starbucks Medium Roast Subtly Sweet Iced Coffee, and 40 oz. Starbucks Cold Brew Black.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 30,000 stores around the globe, Starbucks is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at stories.starbucks.com and www.starbucks.com.\n\nAbout PepsiCo\n\nPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $67 billion in net revenue in 2019, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 23 brands that generate more than $1 billion each in estimated annual retail sales.\n\nGuiding PepsiCo is our vision to Be the Global Leader in Convenient Foods and Beverages by Winning with Purpose. \"Winning with Purpose\" reflects our ambition to win sustainably in the marketplace and embed purpose into all aspects of the business. For more information, visit www.pepsico.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005078/en/\npress@starbucks.com\n206-318-7100\nSource: Starbucks Coffee Company"
    },
    {
        "title": "Starbucks Reports Q1 Fiscal 2020 Results",
        "subtitle": "",
        "date": "Jan 28, 2020 4:05PM EST",
        "content": "\nQ1 Comparable Store Sales Up 5% Globally, Led by 6% Comp Growth in the U.S. and 3% Comp Growth in China\n\nGlobal Net Store Growth of 6% Versus Prior Year, Led by 16% Net Store Growth in China\n\nGAAP EPS of $0.74; Non-GAAP EPS of $0.79\n\nActive Starbucks® Rewards Membership in the U.S. Up 16% Year-Over-Year to 18.9 Million\n    SEATTLE--(BUSINESS WIRE)--\nStarbucks Corporation (NASDAQ: SBUX) today reported financial results for its 13-week fiscal first quarter ended December 29, 2019. GAAP results in fiscal 2020 and fiscal 2019 include items which are excluded from non-GAAP results. Please refer to the reconciliation of GAAP measures to non-GAAP measures at the end of this release for more information.\n\n“Building on solid business momentum from fiscal 2019, Starbucks performed very well throughout the first quarter, including one of the strongest holiday seasons in the history of our company. As a result, we are off to a strong start in fiscal 2020,” said Kevin Johnson, president and ceo. “Our growth was fueled by a healthy balance of comparable sales growth and new store development, as well as continued expansion of our Global Coffee Alliance with Nestlé. Investments in our partners, beverage innovation and digital customer relationships contributed not only to strong topline growth, but also significant margin expansion in the quarter.”\n\n“Our partners are the center of creating a special Starbucks Experience for each and every customer we serve, and I am very grateful for their extraordinary efforts through this holiday quarter. As we begin our fiscal second quarter, I want to acknowledge the dynamic situation our partners in China are navigating as health officials respond to the coronavirus. As events unfold, we will be transparent with all stakeholders in communicating how we are responding to these extraordinary circumstances and the implications for our near-term business results. We remain optimistic and committed to the long-term opportunity in China, building on our brand heritage and 20-year legacy of profitable growth,” concluded Johnson.\n\nQ1 Fiscal 2020 Highlights\n\nQ1 Americas Segment Results\n\nNet revenues for the Americas segment grew 9% over Q1 FY19 to $5.0 billion in Q1 FY20, primarily driven by 6% growth in comparable store sales and 550 net new store openings, or 3% store growth, over the past 12 months.\n\nOperating income grew 13% to $1.1 billion in Q1 FY20, up from $1.0 billion in Q1 FY19. Operating margin of 21.9% expanded 90 basis points, primarily due to sales leverage, supply chain efficiencies and lower restructuring and impairment charges, partially offset by growth in wages and benefits, as well as investments in store labor hours and higher occupancy costs.\n\nQ1 International Segment Results\n\nNet revenues for the International segment grew 4% over Q1 FY19 to $1.6 billion in Q1 FY20, primarily driven by 1,380 net new store openings, or 11% store growth, over the past 12 months and 1% growth in comparable store sales, partially offset by a 5% revenue-dilutive impact of converting certain retail businesses to fully licensed markets.\n\nQ1 FY20 operating income of $275.9 million grew 20% over Q1 FY19 operating income of $230.0 million. Operating margin expanded 230 basis points to 17.6%, primarily due to sales leverage, supply chain efficiencies, the impact of the conversions of certain retail businesses to fully licensed markets and lower restructuring and impairment charges, partially offset by product mix shift and strategic investments.\n\nQ1 Channel Development Segment Results\n\nNet revenues for the Channel Development segment declined 2% from Q1 FY19 to $494.6 million in Q1 FY20, primarily due to lapping prior year product sales to Unilever as a result of the sale and transition of the Tazo brand, partially offset by expansion of the Global Coffee Alliance.\n\nOperating income of $175.5 million in Q1 FY20 was flat compared to Q1 FY19. Operating margin expanded 70 basis points to 35.5%, primarily due to the lapping of prior year Nestlé transaction costs, distribution efficiencies and favorable business mix shift, partially offset by incremental costs to develop and grow the Global Coffee Alliance.\n\nFiscal 2020 Guidance\n\nThe company's fiscal year 2020 guidance is unchanged from what was provided in conjunction with its Q4 fiscal 2019 earnings report which excludes any impact of the coronavirus.\n\nCurrently, we have closed more than half of our stores in China and continue to monitor and modify the operating hours of all of our stores in the market in response to the outbreak of the coronavirus. This is expected to be temporary. Given the dynamic nature of these circumstances, the duration of business disruption, reduced customer traffic and related financial impact cannot be reasonably estimated at this time but are expected to materially affect our International segment and consolidated results for the second quarter and full year of fiscal 2020. The company will update its guidance for fiscal 2020 when we can reasonably estimate the impact of the coronavirus.\n\nCompany Updates\n\n1. In October, Starbucks announced a $10 million investment in four established Community Development Financial Institutions to drive economic opportunities in Chicago. The investment is expected to finance more than 500 small business loans focused on supporting entrepreneurs in Chicago's underserved communities.\n\n2. In November, Starbucks opened its first-ever Starbucks® Pickup store in New York City's Penn Plaza. This unique location is designed for customers on-the-go and uses Starbucks Mobile Order & Pay as the primary ordering and payment method.\n\n3. In November, Starbucks announced a new flexible benefits program for its partners in China known as Flex Star Benefits. The program empowers partners to make individual benefits selections based on what they need from a variety of options designed to help partners enrich themselves, provide better care for loved ones, or make a positive difference to their communities.\n\n4. In November, Starbucks announced that it will eliminate single-use plastic straws from nearly 1,500 stores across Japan starting in January 2020. The change will introduce new paper straws made of responsibly-sourced paper certified by the Forest Stewardship Council® and will eliminate an estimated 200 million single-use plastic straws annually from Starbucks stores in Japan.\n\n5. The company repurchased 13.0 million shares of common stock in Q1 fiscal 2020; approximately 16.2 million shares remain available for purchase under the current authorization.\n\n6. The Board of Directors declared a cash dividend of $0.41 per share, payable on February 21, 2020, to shareholders of record as of February 6, 2020.\n\nConference Call\n\nStarbucks will hold a conference call today at 2:00 p.m. Pacific Time, which will be hosted by Kevin Johnson, president and ceo, and Patrick Grismer, cfo. The call will be webcast and can be accessed at http://investor.starbucks.com. A replay of the webcast will be available until end of day Thursday, February 27, 2020.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 31,000 stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at stories.starbucks.com or www.starbucks.com.\n\nForward-Looking Statements \n\nCertain statements contained herein are “forward-looking” statements within the meaning of the applicable securities laws and regulations. Generally, these statements can be identified by the use of words such as “anticipate,” “continue,” “could,” “estimate,” “expect,” “forecast,” “intend,” “may,” “outlook,” “plan,” “potential,” “predict,” “project,” “remain,” “should,” “will,” “would,” and similar expressions intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. These statements include statements relating to: certain company initiatives, strategies and plans, as well as trends in or expectations regarding our diversified business model; the strength, resilience, momentum and potential of our business, operations and brand; the impacts, benefits, goals and expectations of our Streamline-driven initiatives and long-term investments; the execution and anticipated impact of our “Growth at Scale” agenda, with a focus on our two lead growth markets of the U.S. and China; expanding the global reach of the Starbucks brand through our Global Coffee Alliance with Nestlé; increasing shareholder returns; our commitment to the long-term opportunity in China, building on our brand heritage and legacy of profitable growth; the estimated impact of the changes in U.S. tax law; outlook, guidance and projections for revenues, earnings per share, operating income, operating margins, comparable store sales, net new stores, capital expenditures, interest expense, G&A expenses, tax rates, fiscal 2020 guidance and long-term G&A expense guidance. These forward-looking statements are based on currently available operating, financial and competitive information and are subject to a number of significant risks and uncertainties. Actual future results and trends may differ materially depending on a variety of factors, including, but not limited to: fluctuations in U.S. and international economies and currencies; our ability to preserve, grow and leverage our brands; the ability of our business partners and third-party providers to fulfill their responsibilities and commitments; potential negative effects of incidents involving food or beverage-borne illnesses, tampering, adulteration, contamination or mislabeling; potential negative effects of material breaches of our information technology systems to the extent we experience a material breach; material failures of our information technology systems; costs associated with, and the successful execution of, the company’s initiatives and plans, including the integration of the East China business and the successful expansion of our Global Coffee Alliance with Nestlé; our ability to obtain financing on acceptable terms; the acceptance of the company’s products by our customers and evolving consumer preferences and tastes; changes in the availability and cost of labor; the impact of competition; inherent risks of operating a global business; the prices and availability of coffee, dairy and other raw materials; the effect of legal proceedings; the disruption to our business related to the coronavirus; the effects of changes in tax laws and related guidance and regulations that may be implemented and other risks detailed in the company filings with the Securities and Exchange Commission, including the “Risk Factors” section of Starbucks Annual Report on Form 10-K for the fiscal year ended September 29, 2019. The company assumes no obligation to update any of these forward-looking statements.\n\nNon-GAAP Financial Measures\n\nCertain non-GAAP measures included in our press release were not reconciled to the comparable GAAP financial measures because the GAAP measures are not accessible on a forward-looking basis. The company is unable to reconcile these forward-looking non-GAAP financial measures to the most directly comparable GAAP measures without unreasonable efforts because the company is currently unable to predict with a reasonable degree of certainty the type and extent of certain items that would be expected to impact GAAP measures for these periods but would not impact the non-GAAP measures. Such items may include acquisitions, divestitures, restructuring and other items. The unavailable information could have a significant impact on the company’s GAAP financial results.\n\nSupplemental Information\n\nThe following supplemental information is provided for historical and comparative purposes.\n\nNon-GAAP Disclosure\n\nIn addition to the GAAP results provided in this release, the company provides certain non-GAAP financial measures that are not in accordance with, or alternatives for, generally accepted accounting principles in the United States. Our non-GAAP financial measures of non-GAAP G&A, non-GAAP operating income, non-GAAP operating income growth, non-GAAP operating margin, non-GAAP effective tax rate and non-GAAP EPS exclude the below-listed items and their related tax impacts, as they do not contribute to a meaningful evaluation of the company's future operating performance or comparisons to the company's past operating performance. The GAAP measures most directly comparable to non-GAAP G&A, non-GAAP operating income, non-GAAP operating income growth, non-GAAP operating margin, non-GAAP effective tax rate and non-GAAP EPS are general and administrative expenses, operating income, operating income growth, operating margin, effective tax rate and diluted net earnings per share, respectively.\n\nNon-GAAP G&A, non-GAAP operating income, non-GAAP operating income growth, non-GAAP operating margin, non-GAAP effective tax rate and non-GAAP EPS may have limitations as analytical tools. These measures should not be considered in isolation or as a substitute for analysis of the company's results as reported under GAAP. Other companies may calculate these non-GAAP financial measures differently than the company does, limiting the usefulness of those measures for comparative purposes.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005762/en/\nStarbucks Contact, Investor Relations:\nDurga Doraisamy\n206-318-7118\ninvestorrelations@starbucks.com\n\nStarbucks Contact, Media:\nReggie Borges\n206-318-7100\npress@starbucks.com\nSource: Starbucks Corporation"
    },
    {
        "title": "Starbucks Commits to a Resource-Positive Future, Giving More than It Takes from the Planet",
        "subtitle": "",
        "date": "Jan 21, 2020 9:00AM EST",
        "content": "\nIn a public letter to all company stakeholders, chief executive officer Kevin Johnson sets 2030 science-based targets for carbon, water and waste as part of multi-decade aspiration\n    SEATTLE--(BUSINESS WIRE)--\nToday in a public letter citing the company’s enduring mission to inspire and nurture the human spirit, Starbucks chief executive officer Kevin Johnson announced a multi-decade commitment to be a resource-positive company, aspiring to give more than it takes from the planet. The announcement included science-based preliminary targets for the reduction of carbon emissions, water use and waste by 2030, and outlined five strategies the company has identified to move toward them.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200121005351/en/A Starbucks barista hands a reusable cup to a customer. As part of the company’s new sustainability commitments, the company is working to encourage more use of reusable cups. (Photo: Business Wire)\n“As we approach the 50th anniversary of Starbucks in 2021, we are looking ahead with a heightened sense of urgency and conviction that we must challenge ourselves, think bigger and do much more in partnership with others to take care of the planet we share,” Johnson said.\n\nThe company’s aspiration is to become resource positive – storing more carbon than it emits, eliminating waste, and providing more clean, freshwater than it uses. “This aspiration is grounded in Starbucks mission,” Johnson said. “By embracing a longer-term economic, equitable and planetary value for our company, we will create greater value for all stakeholders.”\n\nA comprehensive, data-driven environmental footprint of carbon emissions, water use and waste in Starbucks global operations and supply chain informed the five strategies to prioritize work:\n\nJohnson also outlined three preliminary targets for 2030:\n\nOn Starbucks 50th anniversary in 2021, the company will formalize its 2030 environmental goals based on learnings between now and then. Specifically, Johnson noted, the coming year will involve comprehensive market research and trials to better understand consumer behavior and incentives to encourage more use of reusable containers.\n\nJohnson noted the importance of Starbucks partnerships with others on its journey to be a more sustainable company. Advisors to the company have provided the following comments:\n\nSheila Bonini, Senior Vice President, Private Sector Engagement, World Wildlife Fund (WWF), said: “As the global climate crisis is fueling a new set of challenges for the planet, Starbucks has set an ambitious vision to give more than they take from our planet’s finite natural resources. This is exactly the kind of leadership we need to see from businesses—an opportunity to invest in their own future while making their global customer base a partner in this sustainability journey.”\n\nWilliam McDonough, CEO, McDonough Innovation, said: “I am inspired by Starbucks resource positive goals because commerce is the engine of change and these goals allow us, with constant humility, to create authentic Environmental, Social and Governance value. These goals also encourage us to innovate toward the dream of Cradle to Cradle: A delightfully diverse, safe, healthy and just world, with clean air, water, soil and power – economically, equitably, ecologically and elegantly enjoyed. Imagine…have a cup of coffee and the world gets a little bit better.”\n\nSander Defruyt, Lead of the New Plastics Economy initiative at the Ellen MacArthur Foundation, said: “The New Plastics Economy Global Commitment unites businesses, governments and others behind a clear vision for a world where plastic never becomes waste or pollution, and the ambitious targets required to achieve it. Creating this circular economy for plastic will be a challenging journey, but by signing the Global Commitment, Starbucks is joining forces with more than 450 signatories to make it possible. We urge others to join them. By coming together, we can eliminate the plastics we don’t need and innovate, so the plastics we do need can be safely and easily circulated, keeping them in the economy and out of the environment.”\n\nMark Lee, Executive Director, SustainAbility, said: “It is encouraging to see Starbucks embrace a data-driven and team-driven approach to creating a resource positive future. Given their proven ability to tap into the passion and expertise of their partners around the globe, I am confident that they will succeed and that this will have a huge impact. Starbucks sustainability commitment is deeply embedded in their enterprise-wide strategies and in the hearts and minds of their leaders. Their most senior leadership was directly involved in the creation of this plan, and they did an outstanding job convening experts in the field in the course of its development, inviting them to help Starbucks dream big on what's possible for the planet. This puts Starbucks in the vanguard of corporate sustainability leaders, and we hope more businesses will be inspired to develop similarly robust approaches to addressing the world's most pressing sustainability challenges.\"\n\nDr. M. Sanjayan, CEO, Conservation International, said: “This pledge to become ‘resource positive’ is bold and necessary – exactly what I’ve come to expect from Starbucks. For more than two decades, Conservation International has partnered with Starbucks to source coffee in ways that are good for people and the planet. Today, 99 percent of Starbucks coffee is verified as ethically sourced – but we have not rested. Now we are working to bring the entire coffee sector along to make coffee the world’s first sustainable agricultural product. This is what it will take to meet today’s challenges: bold vision paired with action that does not rest.”\n\nConrad MacKerron, Senior Vice President, As You Sow, said: “As You Sow and Trillium Asset Management applaud Starbucks commitment to undertake extensive research and testing on consumer behavior and ways to dramatically increase utilization of reusable beverage containers, and to set a new reusables goal within one year. Socially conscious shareholders hope the commitment to reduce waste sent to landfill with be a catalyst for new programs on reuse, recycling, and compostability in fast-growing developing markets.”\n\nRay Silverstein, vp of Store Development at Starbucks and the sponsor of Partners for Sustainability, said: “Starbucks commitment to sustainability has been a meaningful way for our partners to engage and support their communities and neighborhoods. With today’s announcement, we are even more energized to have science-based strategies to guide us in setting priorities and accelerating this work. Whether it’s reducing our environmental footprint in our stores, in our supply chain, or through our ability to engage our communities -- we will have new ways to focus our efforts to make the greatest impact.”\n\nStarbucks invites others to learn more by visiting http://stories.starbucks.com/stories/sustainability, and to follow the journey by texting “GREEN” to 73356. Message and data rates may apply. Text STOP to 73356 to opt out and discontinue further participation. Text HELP for more information. By opting in, you agree to receive messages from Starbucks, which may be sent through an automated dialing system. Consent is not required to purchase. Visit Starbucks.com to read our Privacy Statement. Additional info: http://sbux.co/terms\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 30,000 stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at Starbucks Stories or Starbucks.com.\n\nForward-Looking Statements\n\nCertain statements contained in this release are “forward-looking statements” within the meaning of applicable securities laws and regulations, including statements about executing our strategy, driving growth and building shareholder value. Such forward-looking statements are based on current management expectations and satisfactions of certain conditions that are subject to various risks and uncertainties, including market conditions and those risks detailed in the Company’s filings with the Securities and Exchange Commission, including the “Risk Factors” section of the Starbucks Annual Report on Form 10-K for the fiscal year ended September 30, 2018. The Company assumes no obligation to update any of these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121005351/en/\nStarbucks Coffee Company\npress@starbucks.com\n206-318-7100\nSource: Starbucks Coffee Company"
    },
    {
        "title": "Starbucks Expands Commitment in Underserved Communities Across the U.S. in Partnership with United Way",
        "subtitle": "",
        "date": "Jan 16, 2020 9:00AM EST",
        "content": "\nStarbucks plans to operate 100 stores by 2025 in underrepresented neighborhoods across the country as part of the expanded Community Store program, working with nonprofits and civic leaders to bolster economic growth \n\nA national partnership with United Way will help enable hundreds of Starbucks partners (employees) to drive meaningful community engagement in and outside of store\n\nStarbucks partners are multiplying their community impact this month with the distribution of 1,000 Neighborhood Grants to local NGOs and support in hundreds of service projects for Martin Luther King Jr. Week of Service\n    SEATTLE--(BUSINESS WIRE)--\nFive years following the launch of its Community Store Program initiative, Starbucks today announced it will increase its commitment to open 100 Community Stores dedicated to providing economic opportunity in underserved rural and urban communities across the country, an 85 store increase from its 2015 commitment. These stores will focus on hiring locally, creating dedicated space for communities to come together for events and working with diverse contractors for store construction and remodels. The company aspires to complete this goal by 2025.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200116005239/en/As part of the company’s expanded national partnership with United Way, Starbucks Community Store partners (employees) will work with their local United Way chapter to provide relevant resources and programs for their neighborhood using the store’s community space. (Photo: Business Wire)\nStarbucks will consider factors such as high youth unemployment, low median household income and population stability when selecting Community Store locations. The company will prioritize developing cafes in economically distressed communities, or Opportunity Zones, with upcoming locations planned for Prince George’s County, MD; Anacostia, D.C.; and Los Angeles, CA.\n\n“We believe it is our role and responsibility to partner with those in the communities we serve to help make a positive economic and social impact,” said John Kelly, executive vice president of Public Affairs at Starbucks. “These stores are successful and it’s time to expand the model. Over the last five years, we’ve seen these Community Stores empower our partners and customers to create meaningful impact that is localized and relevant to their neighborhoods. We’ve learned a great deal from our 14 Community Stores and applied those learnings to how we approach community partnership in more than 8,000 neighborhoods we serve across the country.”\n\nThe Community Stores will share several common aspects compared to other Starbucks cafes, including: locations in economically distressed communities; a designated room or space for community events and programming; a partnership with a local United Way chapter to facilitate relevant community programs; a focus on working with diverse contractors for store construction and remodels; and an emphasis on hiring locally.\n\nSince launching the Community Store initiative in 2015, Starbucks has opened 14 stores across the country in Jamaica Queens, NY; Ferguson, MO; Phoenix, AZ; Englewood in the southside of Chicago; east Baltimore; Long Beach, CA; Trenton, NJ; White Center in south Seattle; Miami Gardens, FL; Birmingham, AL; Redbird in Dallas, TX; Bed-Stuy in Brooklyn, NY; New Orleans, LA; and Jonesboro, GA. The 15th store will open in Prince George’s County, MD this spring.\n\nStarbucks estimates its Community Stores have helped:\n\nTo scale the program to 100 locations by 2025, Starbucks will focus on supporting store remodels in addition to new development projects.\n\nAs part of Starbucks national partnership with United Way, local United Ways and 211s in targeted communities will work with Community Store partners to create resources and programs for each community from life skills training for youth to mentorship programs and beyond. That includes facilitating activities at the stores that support people in the community, providing Starbucks partners with customized community profiles and resource information and connecting partners with volunteer activities that help create real change in the communities in which they live and work.\n\n“United Way and Starbucks share a commitment to ensuring every person has the opportunity to thrive, and we’re honored to partner with them,” said Suzanne McCormick, U.S. President of United Way Worldwide. “United Way has been connecting people to resources across the U.S. for more than 130 years, and we look forward to deploying United Way’s local expertise and experience to help Starbucks Community Stores make a real difference.”\n\nThe Starbucks Foundation Awards 1,000 Neighborhood Grants, Thousands of Starbucks Partners Volunteer in National Service Projects \n\nIn addition to today’s news of the Community Store expansion, The Starbucks Foundation also announced it has awarded more than 1,000 Neighborhood Grants, a new giving program that creates local impact and empowers store partners to strengthen relationships with local nonprofit organizations. To date, hundreds of store managers have secured more than $1 million in grants from The Starbucks Foundation for more than 1,000 local nonprofit organizations in all 50 U.S. states and all Canadian provinces.\n\nIn addition to these local partnerships initiated by Starbucks partners every day, thousands of store partners have committed to hundreds of local service projects next week across the United States as part of the Martin Luther King Week of Good. In many communities, United Way is facilitating volunteer activities that help improve education, health and financial stability.\n\nTo learn more about how our partners are creating meaningful connections and driving positive impact in their communities, visit stories.starbucks.com/stories/partners.\n\nAbout Starbucks \n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 31,000 stores around the globe, Starbucks is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at https://stories.starbucks.com and www.Starbucks.com.\n\nAbout United Way \n\nUnited Way fights for the health, education and financial stability of every person in every community. Supported by 2.9 million volunteers, 8.1 million donors worldwide and $4.8 billion raised every year, United Way is the world’s largest privately-funded nonprofit. We’re engaged in nearly 1,800 communities across more than 40 countries and territories worldwide to create sustainable solutions to the challenges facing our communities. United Way partners include global, national and local businesses, nonprofits, government, civic and faith-based organizations, along with educators, labor leaders, health providers, senior citizens, students and more. For more information about United Way, please visit https://www.UnitedWay.org. Follow us on Twitter: @UnitedWay and #LiveUnited.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200116005239/en/\nStarbucks Coffee Company\npress@starbucks.com\n206-318-7100\nSource: Starbucks Coffee Company"
    },
    {
        "title": "Starbucks Announces Q1 Fiscal Year 2020 Results Conference Call",
        "subtitle": "",
        "date": "Jan 14, 2020 4:05PM EST",
        "content": "    SEATTLE--(BUSINESS WIRE)--\nStarbucks Corporation (Nasdaq: SBUX) plans to release its first quarter fiscal year 2020 financial results after the market close on Tuesday, January 28, 2020 with a conference call to follow at 2:00 p.m. PT. The conference call will be webcast, including closed captioning, and can be accessed on the Company’s website: http://investor.starbucks.com. A replay of the webcast will be available on the Company’s website until end of day Thursday, February 27, 2020.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with stores around the globe, the Company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at stories.starbucks.com or www.starbucks.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005778/en/\nStarbucks Contact, Investor Relations:\nDurga Doraisamy\n206-318-7118\ninvestorrelations@starbucks.com\n\nStarbucks Contact, Media:\nReggie Borges\n206-318-7100\npress@starbucks.com\nSource: Starbucks Corporation"
    },
    {
        "title": "S&P 500 buybacks reverse declines in Q3 2019; expenditures remain lower than the 2018 levels",
        "subtitle": "- Q3 2019 share repurchases reached $175.9 billion - 6.3% higher than Q2 2019, 13.7% lower than Q3 2018, and 21.1% lower than the record Q4 2018.",
        "date": "Dec 17, 2019 12:04PM EST",
        "content": "NEW YORK, Dec. 17, 2019 /PRNewswire/ -- S&P Dow Jones Indices (\"S&P DJI\") announced today that preliminary Q3 2019 S&P 500® stock buybacks, or share repurchases, were $175.9 billion – a 6.3% increase over Q2 2019's $165.5 billion. This was the first increase after two consecutive quarters of declines since the record $223 billion in Q4 2018. Historical data on S&P 500 buybacks are available at www.spdji.com/indices/equity/sp-500.  Key Takeaways: \"After lowering expenditures in the first half of the year from their tax-inspired record-setting buying spree of 2018, companies increased their share repurchases by 6.3% in the third quarter,\" said Howard Silverblatt, Senior Index Analyst at S&P Dow Jones Indices.  \"While the levels still pale in comparison to 2018, they are significantly higher than the pre-2018 levels, and surpass the hoped for $170 billion mark, which was seen as the level needed to support stocks and continue reduced share count EPS growth. For Q4, the market is looking for another increase in buybacks, in the mid-single digit range, staying near the $190 billion level, well shy of the Q4 2018 record-setting $223 billion.\"Silverblatt also found that buybacks continue to be top heavy, with the top 20 issues accounting for 50.4% of the buybacks, compared to the 10-year average of 44.5%.  Q3 2019 GICS® Sector Analysis:Information Technology buybacks continued to decline as a percentage of all buybacks, as they decreased 10.8% to $49.2 billion compared to $55.2 billion for Q2 2019. Twelve-month expenditures were down 7.6% to $233.7 billion from the $253.0 billion spent in the same period in 2018. The sector represents 28.0% of the index's buybacks, down from Q2 2019's 33.4% and 40.4% in Q3 2018.Financials were right behind Information Technology for expenditures, as they increased 26.4% to $47.8 billion, up from last quarter's $37.8 billion. They represented 27.2% of all buybacks, up from 22.9% in Q2 2019, and are less than one percentage point away from Information Technology's 28.0%.Materials buybacks continued to be volatile, as they increased 123.1% after declining 49.3% last quarter, spending $5.4 billion on buybacks, up from $2.4 billion last quarter and down from $4.8 billion for Q1 2019. Utilities again declined, spending 11.1% less, to $0.8 billion from last quarter's $0.9 billion and $1.5 billion in Q1 2019.Health Care buybacks declined 6.2%, to $16.0 billion, from last quarter's $17.1 billion, as they represent 9.1% of all buybacks, down from last quarter's 10.3%.  Issues:The five issues with the highest total buybacks for Q3 2019 are:For more information about S&P Dow Jones Indices, please visit www.spdji.com.             ABOUT S&P DOW JONES INDICESS&P Dow Jones Indices is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&P 500® and the Dow Jones Industrial Average®. More assets are invested in products based on our indices than products based on indices from any other provider in the world. Since Charles Dow invented the first index in 1884, S&P DJI has been innovating and developing indices across the spectrum of asset classes helping to define the way investors measure and trade the markets.S&P Dow Jones Indices is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit: www.spdji.com.  View original content to download multimedia:http://www.prnewswire.com/news-releases/sp-500-buybacks-reverse-declines-in-q3-2019-expenditures-remain-lower-than-the-2018-levels-300976248.htmlSOURCE  S&P Dow Jones Indices"
    },
    {
        "title": "Thinking about trading options or stock in Nike, Roku, Starbucks, Visa, or Walmart?",
        "subtitle": "",
        "date": "Dec 5, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 5, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for NKE, ROKU, SBUX, V, and WMT.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-nike-roku-starbucks-visa-or-walmart-300970011.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Facebook, Home Depot, QUALCOMM, Starbucks, or Square?",
        "subtitle": "",
        "date": "Nov 22, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 22, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for FB, HD, QCOM, SBUX, and SQ.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-facebook-home-depot-qualcomm-starbucks-or-square-300963753.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Starbucks to Participate at the Morgan Stanley Global Consumer & Retail Conference",
        "subtitle": "",
        "date": "Nov 19, 2019 6:30PM EST",
        "content": "    SEATTLE--(BUSINESS WIRE)--\nStarbucks Corporation (Nasdaq: SBUX) today announced that Patrick Grismer, chief financial officer, will participate at the Morgan Stanley Global Consumer & Retail Conference in New York on Tuesday, December 3, 2019 at 8:00 a.m. ET.\n\nThe event will be webcast and can be accessed on the company’s website: http://investor.starbucks.com. A replay of the webcast will be available on the company’s website through Friday, January 3rd, 2020.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with over 31,000 stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at http://news.starbucks.com or www.starbucks.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191119006106/en/\nStarbucks Contact, Investor Relations:\nDurga Doraisamy\n206-318-7118\ninvestorrelations@starbucks.com\n\nStarbucks Contact, Media:\nReggie Borges\n206-318-7100\npress@starbucks.com\nSource: Starbucks Corporation"
    },
    {
        "title": "Thinking about trading options or stock in Bank of America, Microsoft, Nike, Roku, or Starbucks?",
        "subtitle": "",
        "date": "Nov 15, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 15, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BAC, MSFT, NKE, ROKU, and SBUX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-bank-of-america-microsoft-nike-roku-or-starbucks-300959148.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Starbucks Unveils Epic 35,000-Square-Foot Reserve Roastery in Chicago",
        "subtitle": "",
        "date": "Nov 12, 2019 7:00PM EST",
        "content": "\nStarbucks® Reserve Roastery Chicago is the company’s largest retail experience, featuring a unique menu of Starbucks Reserve specialty coffee, boutique Milanese Princi™ bakery, and Arriviamo™ Bar featuring coffee cocktails\n\nTributes to Chicago abound, including locally inspired craft cocktails, barrel aged coffee and collaborations with local artists, vendors \n\nStarbucks Reserve Roastery Chicago is the company’s sixth Reserve Roastery, joining locations in Seattle, Shanghai, Milan, New York and Tokyo\n    CHICAGO--(BUSINESS WIRE)--\nStarbucks Coffee Company (NASDAQ: SBUX) today unveiled Starbucks Reserve Roastery Chicago, which opens its doors to the public on Friday, November 15. Located on North Michigan Avenue and Erie Street on Chicago’s Magnificent Mile, the opening of Chicago Reserve Roastery marks Starbucks sixth global Roastery and third location in the U.S. Starbucks largest-ever immersive coffee experience – across five floors and 35,000 square feet of retail space – celebrates the company’s heritage and is a tribute to the roasting and the craft of coffee. Visitors will be able to see, hear and learn about coffee’s extraordinary journey through intentional and unparalleled design, while enjoying a menu featuring exclusive coffee beverages exclusive to this location. The Chicago Roastery joins locations in Seattle, Shanghai, Milan, New York and Tokyo.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191112006093/en/Today Starbucks unveiled the Reserve Roastery Chicago, which opens its doors to the public on Friday, November 15. (Photo: Business Wire)\n“Over the past five years, we have created the ultimate immersive experience around all-things-coffee in spectacular Starbucks Reserve Roasteries in flagship cities around the world. This week we are delighted to open our doors on the sixth global Roastery in an iconic building located on Chicago’s renowned Magnificent Mile,” said Kevin Johnson, Starbucks ceo. “These Roasteries amplify the Starbucks brand, serve as innovation hubs, and create experiences for millions of customers around the world.”\n\nStarbucks has a rich history with the Windy City, dating back to 1987 when the company opened its first store outside of the Pacific Northwest and had a total of 11 retail stores and served as the foundation for the company’s national growth strategy. Nearly 32 years later, there are 796 company-operated stores in the region where Starbucks employs more than 18,100 partners (employees). The Roastery employs nearly 200 people, including roasters, baristas, commessas, bakers, and mixologists.\n\n“The design of the Chicago Roastery was inspired by the iconic Chicago landmark, and the city itself,” said Jill Enomoto, vice president of Roastery Design & Concept for Starbucks. “We embraced the building’s natural light, married it with shades of classic Starbucks greens and intentionally wove in design features to encourage customer exploration and highlight the love and respect we have for coffee.”\n\nThe Starbucks Reserve Roastery Chicago is a working coffee roastery where Starbucks Roasters will be small-batch roasting Starbucks rarest single-origin coffees and blends called Starbucks Reserve. The coffee roasted in Chicago will be served exclusively to visitors of the location, available in handcrafted beverages as well as freshly scooped whole bean coffee.\n\nUnique Food and Beverage Experiences \n\nCoffee Bars\n\nThere are three main coffee bars at the Roastery, which in total offer seven brewing methods, including espresso, pour over, coffee press, siphon, Chemex®, Clover® and cold brewing.\n\nNitrogen Gelato\n\nThe Starbucks Reserve Roastery Chicago is the only Starbucks location in the U.S. to offer on-demand liquid nitrogen gelato. Designed to pair with Starbucks Reserve® coffee, nitrogen gelato is mixed by hand, with every scoop made right on the spot and offers another way for customers to enjoy specialty Starbucks Reserve coffees. Nitrogen gelato previously debuted at the Milan Roastery when it opened in September 2018.\n\nArriviamo™ Cocktail Bar\n\nThe Chicago Roastery will feature a dedicated Arriviamo™ Bar, like the Starbucks Reserve Roastery locations in New York and Milan. Inspired by the Italian tradition of apertivo, the Arriviamo Bar will be a destination for customers looking for a carefully crafted cocktail. Located on the fourth floor, the Arriviamo™ bar features an assortment of traditional and unique cocktails, all concepted by local mixologists Julia Momose, Annie Beebe-Tron and Rachel Miller. In addition to a menu of classic cocktails and a selection of local Chicago beer and wine, exclusive specialty cocktails featuring Starbucks Reserve coffee and tea that nod to the culture and traditions of Chicago include:\n\nPrinci\n\nIn addition to coffee beverages, Roastery visitors can enjoy food at Princi™, the renowned artisanal boutique bakery and cafe founded by Italian baker Rocco Princi. As the exclusive food purveyor at Starbucks Reserve locations, Princi offers on-site baking of fresh breads, cornetti and focaccia, pizza and salads, plus cakes and tarts. A full menu of items will be available on the second floor Princi bakery, while select items will also be available throughout the Roastery for customers looking to pair their coffee with a savory or sweet bite.\n\nExclusive to the Chicago Roastery will be a bakery conveyor that has been designed by Starbucks to transport fresh baked goods from the Princi bakery on the second floor, to the Starbucks Reserve Coffee Bar on the main level.\n\nLocal Collaborations\n\nIn a nod to the city’s vibrant history, artwork from local Chicago artists that tell stories and encourage customers to explore can be found throughout the building’s five floors. Customers can also purchase limited-edition merchandise from Chicago-based visual artist Mac Blackout to take home with them.\n\nCreating a Positive Impact \n\nTo further show support for city of Chicago, Starbucks recently announced an investment of $10 million into four established Community Development Financial Institutions (CDFI) to drive economic opportunity in the city. The investment, dispersed among Accion Chicago, Chicago Community Loan Fund, Local Initiative Support Corporation and IFF, is expected to generate more than 500 loans toward supporting Chicago’s small businesses, community development projects, and the economic vitality of the city’s underserved neighborhoods.\n\nThe Starbucks Reserve Roastery Chicago opens on November 15 at 9 a.m. For more information, visit www.StarbucksReserve.com or follow us on Instagram: https://www.instagram.com/starbucksreserve/\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191112006093/en/\nStarbucks Coffee Company\npress@starbucks.com\n206-318-7100\nSource: Starbucks Coffee Company"
    },
    {
        "title": "Thinking about trading options or stock in Alibaba, Microsoft, Philip Morris, Qualcomm, or Starbucks?",
        "subtitle": "",
        "date": "Nov 11, 2019 9:31AM EST",
        "content": " NEW YORK, Nov. 11, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BABA, MSFT, PM, QCOM, and SBUX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-alibaba-microsoft-philip-morris-qualcomm-or-starbucks-300955451.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Starbucks Reports Q4 and Full Year Fiscal 2019 Results",
        "subtitle": "",
        "date": "Oct 30, 2019 4:05PM EDT",
        "content": "\nQ4 Comparable Store Sales Up 5% Globally, Led by 6% Comp Growth in the U.S. and 5% Comp Growth in China\n\nGlobal Net Store Growth of 7% Versus Prior Year, Led by 17% Net Store Growth in China\n\nGAAP EPS of $0.67; Non-GAAP EPS of $0.70, Up 13% Year-Over-Year\n\nActive Starbucks® Rewards Membership in the U.S. Up 15% Year-Over-Year to 17.6 Million\n\nReturned $12 Billion to Shareholders in Fiscal 2019; Announces Quarterly Dividend Increase of 14% to $0.41 Per Share\n\nIntroduces Fiscal 2020 Outlook Reaffirming Long-term Operating Growth Model\n    SEATTLE--(BUSINESS WIRE)--\nStarbucks Corporation (NASDAQ: SBUX) today reported financial results for its 13-week fiscal fourth quarter and 52-week fiscal year ended September 29, 2019. GAAP results in fiscal 2019 and fiscal 2018 include items which are excluded from non-GAAP results. Please refer to the reconciliation of GAAP measures to non-GAAP measures at the end of this release for more information.\n\n“I’m very pleased with our strong finish to fiscal 2019, as we sustained positive momentum across each of our business segments,” said Kevin Johnson, president and ceo. “Our U.S. business delivered 6% comparable store sales growth in the fourth quarter, while China grew comparable store sales by 5% and total transactions by 13%. Our strong performance throughout fiscal 2019 gives us confidence in a robust operating outlook for fiscal 2020.”\n\n“We are making meaningful progress against our strategic priorities while streamlining the company, bringing more focus and discipline to everything we do. The investments we are making for the long term---in our partners, our stores, beverage innovation and digital---are collectively delivering an elevated Starbucks Experience, as evidenced by all-time-high customer connection scores in the fourth quarter. This long-term focus is instrumental to how we are building an enduring company,” concluded Johnson.\n\nQ4 Fiscal 2019 Highlights\n\nFull Year Fiscal 2019 Highlights\n\nFiscal 2019 Re-segmentation\n\nIn the fourth quarter of fiscal 2019, the company realigned its operating segment reporting structure to better reflect the cumulative effect of its streamlining efforts. Specifically, the previous China/Asia Pacific (\"CAP\") segment and Europe, Middle East, and Africa (\"EMEA\") segment have been combined into one International segment. The company will continue to provide supplemental information on its two lead growth markets, the U.S. and China, in its quarterly earnings news releases in accordance with its \"Growth at Scale\" agenda.\n\nConcurrently, results of Siren Retail, a non-reportable operating segment consisting of Starbucks ReserveTM Roastery & Tasting Rooms, Starbucks Reserve brand and Princi operations, which was previously included within Corporate and Other, is now reported within the Americas and International segments based on the geographical location of the operations.\n\nFurther, to better support the review of its results, the company changed the classification of certain costs. The most significant change was the reclassification of company-operated store occupancy costs from cost of sales to store operating expenses. The company also made certain other immaterial changes. These reclassifications have been retrospectively applied.\n\nThere was no impact to consolidated net revenues, consolidated operating income, or net earnings per share as a result of these changes.\n\nConcurrent with the change in reportable segments and reclassification of certain operating expenses noted above, the company revised its prior period financial information to be consistent with the current period presentation.\n\nRestated GAAP and non-GAAP quarterly financial information for FY18 and FY19 (through fiscal Q3) can be found on the Supplemental Financial Data page of our Investor Relations website (http://investor.starbucks.com).\n\nQ4 Americas Segment Results\n\nNet revenues for the Americas segment grew 9% over Q4 FY18 to $4.7 billion in Q4 FY19, primarily driven by 6% growth in comparable store sales, 607 net new store openings, or 3% store growth, over the past 12 months, and the impact of the adoption of new revenue recognition accounting for stored value card (SVC) breakage.\n\nOperating income grew 5% to $938.9 million in Q4 FY19, up from $890.8 million in Q4 FY18. Operating margin of 20.2% declined 70 basis points, primarily due to the 2019 Starbucks Leadership Experience, growth in wages and benefits and increased investments in labor hours, partially offset by cost savings initiatives and sales leverage.\n\nNet revenues for the International segment grew 6% over Q4 FY18 to $1.6 billion in Q4 FY19, primarily driven by 1,337 net new store openings, or 11% store growth, over the past 12 months, and a 3% increase in comparable store sales, partially offset by a 5% revenue-dilutive impact of converting certain retail businesses to fully licensed markets.\n\nQ4 FY19 operating income of $262.7 million grew 18% over Q4 FY18 operating income of $222.4 million. Operating margin expanded 180 basis points to 16.7%, primarily due to sales leverage, cost savings initiatives, labor efficiencies and the impact of the conversions of certain retail businesses to fully licensed markets, partially offset by growth in wages and benefits, unfavorable product mix shift and strategic investments.\n\nNet revenues for the Channel Development segment declined 6% from Q4 FY18 to $508.1 million in Q4 FY19, primarily due to licensing our CPG and Foodservice businesses to Nestlé following the close of the transaction on August 26, 2018.\n\nOperating income of $190.9 million in Q4 FY19 was flat compared to Q4 FY18. Operating margin expanded 220 basis points to 37.6%, primarily due to lapping prior year costs associated with the establishment of the Global Coffee Alliance, including business taxes associated with the up-front payment and employee-related costs. This favorability was partially offset by the impact of our ownership changes, including licensing our CPG and Foodservice businesses to Nestlé and the sale of our Tazo brand.\n\nFiscal 2020 Guidance\n\nThe company introduces the following fiscal year 2020 guidance (all growth targets are relative to fiscal year 2019 non-GAAP measures unless specified):\n\nPlease refer to the reconciliation of GAAP measures to non-GAAP measures at the end of this release.\n\nThe company will provide additional information regarding its business outlook during its regularly scheduled quarterly earnings conference call; this information will also be available following the call on the company's website at http://investor.starbucks.com.\n\nCompany Updates\n\n1. In July, Starbucks opened its first Starbucks NowTM store in Beijing, China. The new express store format integrates Starbucks store environment with the company's Mobile Order & Pay technology and Starbucks® Delivers into one seamless and convenient experience for customers.\n\n2. In September, Starbucks hosted over 12,000 store managers and field operations leaders at its largest ever Leadership Experience. The three-day conference held in Chicago was designed to help strengthen leadership capabilities and solidify the foundation of an enduring company.\n\n3. In September, Starbucks welcomed three new appointees to its Board of Directors: Richard E. Allison, Jr., Chief Executive Officer of Domino's; Andrew Campion, Executive Vice President and Chief Financial Officer of Nike; and Isabel Ge Mahe, Apple's Vice President and Managing Director of Greater China. These appointments increased Starbucks board of directors to 13 members.\n\n4. The company repurchased 23.5 million shares of common stock in Q4 fiscal 2019; approximately 29.2 million shares remain available for purchase under the current authorization.\n\n5. The Board of Directors declared a cash dividend of $0.41 per share, an increase of 14%, payable on November 29, 2019, to shareholders of record as of November 13, 2019.\n\nConference Call\n\nStarbucks will hold a conference call today at 2:00 p.m. Pacific Time, which will be hosted by Kevin Johnson, president and ceo, and Patrick Grismer, cfo. The call and selected presentation materials will be webcast and can be accessed at http://investor.starbucks.com. A replay of the webcast will be available until end of day Thursday, November 28, 2019.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 31,000 stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at stories.starbucks.com or www.starbucks.com.\n\nForward-Looking Statements\n\nCertain statements contained herein are “forward-looking” statements within the meaning of the applicable securities laws and regulations. Generally, these statements can be identified by the use of words such as “anticipate,” “expect,” “believe,” “could,” “estimate,” “feel,” “forecast,” “outlook,” “intend,” “may,” “plan,” “potential,” “project,” “should,” “will,” “would,” and similar expressions intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. These statements include statements relating to certain company initiatives, strategies and plans, as well as trends in or expectations regarding our diversified business model, the strength, resilience, momentum, and potential of our business, operations, and brand, the impacts, benefits, goals and expectations of our Streamline-driven initiatives and long-term investments, the execution and anticipated impact of our “Growth at Scale” agenda, with a focus on our two lead growth markets of the U.S. and China, expanding the global reach of the Starbucks brand through our Global Coffee Alliance with Nestlé, increasing shareholder returns, the company's position to deliver predictable and sustainable results, building an enduring company, and the creation of meaningful long-term value for shareholders, the estimated impact of the changes in U.S. tax law, net new stores, outlook, guidance and projections for revenues, earnings per share, operating income, operating margins, comparable store sales, capital expenditures, interest expense, G&A expenses, tax rates, and our fiscal 2020 financial targets, fiscal 2020 guidance and long-term G&A expense guidance. These forward-looking statements are based on currently available operating, financial, and competitive information and are subject to a number of significant risks and uncertainties. Actual future results may differ materially depending on a variety of factors including, but not limited to, fluctuations in U.S. and international economies and currencies, our ability to preserve, grow, and leverage our brands, potential negative effects of incidents involving food or beverage-borne illnesses, tampering, adulteration, contamination, or mislabeling, potential negative effects of material breaches of our information technology systems to the extent we experience a material breach, material failures of our information technology systems, costs associated with, and the successful execution of the company’s initiatives and plans, including the integration the East China business and successful execution of our Global Coffee Alliance with Nestlé, the acceptance of the company’s products by our customers, our ability to obtain financing on acceptable terms, the impact of competition, the prices and availability of coffee, dairy, and other raw materials, the effect of legal proceedings, the effects of changes in U.S. tax law and related guidance and regulations that may be implemented, and other risks detailed in the company filings with the Securities and Exchange Commission, including the “Risk Factors” section of Starbucks Annual Report on Form 10-K for the fiscal year ended September 30, 2018. The company assumes no obligation to update any of these forward-looking statements.\n\nNon-GAAP Financial Measures\n\nCertain non‐GAAP measures included in our press release were not reconciled to the comparable GAAP financial measures because the GAAP measures are not accessible on a forward‐looking basis. The company is unable to reconcile these forward-looking non-GAAP financial measures to the most directly comparable GAAP measures without unreasonable efforts because the company is currently unable to predict with a reasonable degree of certainty the type and extent of certain items that would be expected to impact GAAP measures for these periods but would not impact the non-GAAP measures. Such items may include acquisitions, divestitures, restructuring and other items. The unavailable information could have a significant impact on the company’s GAAP financial results.\n\nSegment Results (in millions)\n\nCorporate and Other primarily consists of our unallocated corporate operating expenses, Evolution Fresh and formerly, the Teavana retail business.\n\nSupplemental Information\n\nThe following supplemental information is provided for historical and comparative purposes.\n\nNon-GAAP Disclosure\n\nIn addition to the GAAP results provided in this release, the company provides certain non-GAAP financial measures that are not in accordance with, or alternatives for, generally accepted accounting principles in the United States. Our non-GAAP financial measures of non-GAAP G&A, non-GAAP operating income, non-GAAP operating income growth, non-GAAP operating margin, non-GAAP effective tax rate and non-GAAP EPS exclude the below-listed items and their related tax impacts, as they do not contribute to a meaningful evaluation of the company's future operating performance or comparisons to the company's past operating performance. The GAAP measures most directly comparable to non-GAAP G&A, non-GAAP operating income, non-GAAP operating income growth, non-GAAP operating margin, non-GAAP effective tax rate and non-GAAP EPS are general and administrative expenses, operating income, operating income growth, operating margin, effective tax rate and diluted net earnings per share, respectively.\n\nNon-GAAP G&A, non-GAAP operating income, non-GAAP operating income growth, non-GAAP operating margin, non-GAAP effective tax rate and non-GAAP EPS may have limitations as analytical tools. These measures should not be considered in isolation or as a substitute for analysis of the company's results as reported under GAAP. Other companies may calculate these non-GAAP financial measures differently than the company does, limiting the usefulness of those measures for comparative purposes.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005930/en/\nStarbucks Contact, Investor Relations:\nDurga Doraisamy\n206-318-7118\ninvestorrelations@starbucks.com\n\nStarbucks Contact, Media:\nReggie Borges\n206-318-7100\npress@starbucks.com\nSource: Starbucks Corporation"
    },
    {
        "title": "Starbucks Invests $10 Million in Small Business and Community Development Loans to Bolster Economic Opportunity in Chicago",
        "subtitle": "",
        "date": "Oct 29, 2019 7:00AM EDT",
        "content": "\nThe investment in community lenders Accion Chicago, Chicago Community Loan Fund, IFF and Local Initiatives Support Corporation will finance more than 500 loans focused on supporting Chicagoland entrepreneurs in underserved communities\n    CHICAGO--(BUSINESS WIRE)--\nToday, Starbucks Coffee Company announced its plans to invest $10 million in four community lenders to drive economic opportunity in Chicago. Starbucks investment is expected to help finance more than 500 loans to foster growth in small business, support community development projects and create more jobs in Chicago’s underserved communities.\n\n“We believe the pursuit of profit is not in conflict with the pursuit of doing good,” said Starbucks ceo Kevin Johnson. “We know that our business performs at its best when the communities we serve are thriving. This sustained investment will provide borrowers who often face barriers with access to capital and mentorship to grow their business and create more jobs in Chicago.”\n\n“I applaud Starbucks for their commitment of corporate citizenship and efforts to strengthen the communities in which they serve,” said Mayor Lori E. Lightfoot. “Chicago’s own relationship with Starbucks stretches over three decades, and we are incredibly excited to continue that partnership well into the future, through the 200 new jobs created in the beautiful new Reserve Roastery, as well as across our neighborhoods that aligns to our new INVEST South/West initiative, as we work together to create jobs, drive investment, and expand access to opportunity for every one of our city’s residents and families.”\n\nThe $10 million investment from Starbucks is planned to be dispersed among Accion Chicago, Chicago Community Loan Fund (CCLF), Local Initiative Support Corporation (LISC) and IFF – four established Community Development Financial Institutions (CDFI) that drive economic opportunity in the city’s neighborhoods, especially within those with little access to the flexible, affordable capital that entrepreneurs need. In addition to lending, the organizations will provide borrowers with mentoring and technical assistance to ensure the success of their projects.\n\n“Our communities are filled with talent and entrepreneurial spirit,” said Meghan Harte, executive director of LISC Chicago, which has invested more than $970M in grants, loans and equity throughout Chicago. “What they often lack is access to the right kind of capital so that entrepreneurs can launch, build and grow. With this investment, Starbucks is supporting a broadly shared prosperity that will deliver clear benefits to residents, while making our neighborhoods safer and stronger.”\n\nWith more than 150+ combined years of experience providing capital and financial guidance, these CDFIs have the financial expertise and local knowledge of Chicago to support meaningful, sustainable impact. Areas of focus for loan disbursement will include small businesses, nonprofit organizations and commercial real estate ventures.\n\n“OFN commends Starbucks for this investment in small business and job creation for the Chicago communities that need it most,” said Amir Kirkwood, chief lending and investment officer for Opportunity Finance Network (OFN). “This welcome investment will be managed by four CDFIs who are OFN members, all expert in providing much-needed fair and responsible lending to small businesses to create economic opportunity where it really counts.”\n\n“The Chicago Community Loan Fund has been working strategically to create more commercial retail in low-income neighborhoods for a number of years,” stated Bob Tucker, Chief Operating Officer of CCLF. “With this influx of capital from Starbucks, CCLF will leverage additional funding to help address Chicago’s loss of population in these communities and create not only access to quality goods and services, but needed jobs for local residents.”\n\nThis investment follows Starbucks Create Jobs for USA initiative in partnership with the OFN in 2011. The program was dedicated to creating and sustaining jobs in underserved communities throughout the U.S. bolstered by a $5 million contribution from the Starbucks Foundation. In three years, it raised more than $15 million in donations, which participating CDFIs turned into $105 million in financing for businesses to create or retain more than 5,000 jobs.\n\n“Accion provides the capital, coaching and connections that neighborhood entrepreneurs need to create jobs and wealth in underserved communities. In Chicago, entrepreneurs of color and women entrepreneurs need services that traditional financial institutions often can’t provide,” said Brad McConnell, CEO of Accion Chicago. “That’s what we do, and that’s why partnerships with thoughtful organizations like Starbucks are so crucial.”\n\n“IFF is thrilled that a partner like Starbucks is seeing the communities of Chicago as wellsprings of opportunity,” said Matthew Roth, President Core Business Solutions, IFF. “By making an investment - one that expects to be repaid - Starbucks is betting that our communities can transform their dreams and aspirations into financial and social return.”\n\nBank of America will assist Starbucks in deploying the investment to each of the four lenders. The CDFIs are expected to start making loans to small business owners and community organizations by early next year, although borrowers can apply for a loan now. Chicagoland residents can learn more and apply for loans by visiting the respective CDFI websites.\n\nThis news comes weeks ahead of the opening the Starbucks Reserve® Roastery on Chicago’s Magnificent Mile.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 30,000 stores around the globe, Starbucks is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at https://stories.starbucks.com/ and www.Starbucks.com.\n\nAbout Accion Chicago\n\nAccion helps neighborhood entrepreneurs grow by providing the capital, coaching, and connections small business owners need to create wealth and jobs throughout Illinois and Indiana. By partnering with entrepreneurs, Accion offers the most cost-effective way to invest in underserved communities. Accion offers small business loans between $500 and $100,000 to qualified borrowers and provides free coaching to any entrepreneur who wants to grow their business. Learn more at us.accion.org/chicago.\n\nAbout CCLF\n\nFounded in 1991, Chicago Community Loan Fund is a federally certified Community Development Financial Institution (CDFI) providing flexible, affordable and responsible financing and technical assistance for community stabilization and development efforts and initiatives that benefit low- to moderate-income neighborhoods, families and individuals throughout metropolitan Chicago. To-date, CCLF has closed 486 loans totaling over $210 million in financing that has leveraged an additional $1.4 billion in public and private sector capital for community projects. For more information, please visit cclfchicago.org.\n\nAbout LISC\n\nWith residents and partners, LISC forges resilient and inclusive communities of opportunity across America – great places to live, work, visit, do business and raise families. Since 1979, LISC has invested $20 billion to build or rehab 400,500 affordable homes and apartments and develop 66.8 million square feet of retail, community and educational space.\n\nAbout IFF\n\nIFF is a mission-driven lender, real estate consultant, and developer that helps communities thrive by creating opportunities for low-income populations and individuals with disabilities. Since 1988, IFF has provided $907 million in flexible, affordable financing to nonprofits serving a variety of sectors – affordable housing, health care, education, community development, and more. These investments have leveraged $2.9 billion and impacted communities by creating more than 6,700 child care slots, 50,000 charter school seats, 369,000 new patient visits, 10,000 units of affordable housing, 2,000 beds at supportive housing agencies, and 66,000 full- or part-time jobs.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191029005274/en/\nStarbucks Coffee Company\npress@starbucks.com\n206-318-7100\nSource: Starbucks Coffee Company"
    },
    {
        "title": "Starbucks® Delivers Comes to Five New U.S. Markets",
        "subtitle": "",
        "date": "Oct 22, 2019 9:00AM EDT",
        "content": "\nStarbucks® Delivers continues toward national availability in 2020 by expanding to five new U.S. markets \n\nThe delivery program, powered by Uber Eats in 16 U.S. markets, now includes Atlanta, Denver, Phoenix, Philadelphia, and New Jersey, as well as further expansion in the New York Metro\n    SEATTLE--(BUSINESS WIRE)--\nStarbucks Coffee Company (NASDAQ: SBUX) today announced the latest expansion of Starbucks® Delivers to five new U.S. markets, Atlanta, Denver, Phoenix, Philadelphia, and New Jersey, as well as further expansion in the New York Metro. The delivery program, which initially launched as a pilot in partnership with Uber Eats in late 2018, is now available in a total of 16 major U.S. markets and will reach national availability in early 2020.\n\n“Following our recent commitment to make delivery available nationwide in 2020, we are excited to bring Starbucks Delivers to five more major U.S. markets,” said Roz Brewer, group president and chief operating officer for Starbucks. “The expansion of Starbucks Delivers is part of our continuous effort to enhance the retail experience and provide customers another convenient option to enjoy Starbucks wherever they are.”\n\nThrough its partnership with Uber Eats, Starbucks leverages the expertise of the largest global delivery service outside of China. This service extends potential engagement to new customers and those who currently include Starbucks as part of their morning or afternoon routines, providing the ultimate Starbucks convenience. Through the Uber Eats platform, customers can track progress of their order and location of their Uber courier. With approximately 95% of core items available from the Starbucks menu, customers will be able to customize their orders as they would when ordering on the Starbucks® Mobile App.\n\nIn addition to the U.S., Starbucks has launched delivery programs in more than 15 global markets, including Canada, Chile, China, Colombia, Hong Kong, India, Indonesia, Japan, Mexico, Singapore, the U.K., and Vietnam. Starbucks has made several investments to its global delivery initiatives, including voice ordering and delivery capabilities through Alibaba’s delivery platform Ele.me in China and expanding Starbucks Delivers, in partnership with Uber Eats, to 11 major markets in the U.K.\n\nStarbucks Delivers is available through the Uber Eats mobile app on iOS and Android devices. Learn more and order here.\n\nAbout Starbucks \n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 30,000 stores around the globe, Starbucks is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit our stores or online at stories.starbucks.com and Starbucks.com.\n\nAbout Uber Eats\n\nUber Eats is an on-demand food delivery app and website that helps bring millions of people around the world the food they want, at the tap of a button. We partner with over 200,000 restaurants in more than 500 cities across 36 countries and six continents to offer meals for every taste and occasion. From specialty local favorites to everyday national brand names, Uber Eats offers millions of dishes while maintaining an average delivery time under 30 minutes.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005453/en/\nStarbucks Coffee Company\npress@starbucks.com\n206-318-7100\nSource: Starbucks Coffee Company"
    },
    {
        "title": "Starbucks Announces Q4 and Fiscal Year 2019 Results Conference Call",
        "subtitle": "",
        "date": "Oct 16, 2019 5:05PM EDT",
        "content": "\nIntroduces Realigned Operating Segment Reporting Structure and Statement of Earnings Reclassifications\n    SEATTLE--(BUSINESS WIRE)--\nStarbucks Corporation (Nasdaq: SBUX) plans to release its fourth quarter and fiscal year 2019 financial results after the market close on Wednesday, October 30, 2019 with a conference call to follow at 2:00 p.m. PT. The conference call will be webcast, including closed captioning, and can be accessed on the company’s website: http://investor.starbucks.com. A replay of the webcast will be available on the company’s website until end of day Thursday, November 28, 2019.\n\nIn the fourth quarter of fiscal 2019, Starbucks realigned its operating segment reporting structure to better reflect the cumulative effect of the company’s streamlining efforts. Specifically, the previous China/Asia Pacific (“CAP”) segment and Europe, Middle East, and Africa (“EMEA”) segment have been combined into one International segment. The company will continue to provide supplemental information on its two lead growth markets, the U.S. and China, in its quarterly earnings news releases in accordance with its “Growth at Scale” agenda.\n\nConcurrently, results of Siren Retail, a non-reportable operating segment consisting of Starbucks ReserveTM Roastery & Tasting Rooms, Starbucks Reserve brand and Princi operations, which was previously included within Corporate and Other, is now reported within the Americas and International segments based on the geographical location of the operations. Starbucks has also changed the classification of certain costs, including reclassification of company-operated store occupancy costs from cost of sales to store operating expenses.\n\nThere is no impact to consolidated net revenues, consolidated operating income, or net earnings per share as a result of these changes.\n\nRestated GAAP and non-GAAP quarterly financial information for FY18 and FY19 (through fiscal Q3) can be found on the company’s website under Supplemental Financial Data.\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at stories.starbucks.com or www.starbucks.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191016005907/en/\nStarbucks Contact, Investor Relations:\nDurga Doraisamy\n206-318-7118\ninvestorrelations@starbucks.com\n\nStarbucks Contact, Media:\nReggie Borges\n206-318-7100\npress@starbucks.com\nSource: Starbucks Corporation"
    },
    {
        "title": "Thinking about trading options or stock in Blackstone, NVIDIA, Philip Morris, Roku, or Starbucks?",
        "subtitle": "",
        "date": "Sep 16, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 16, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BX, NVDA, PM, ROKU, and SBUX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-blackstone-nvidia-philip-morris-roku-or-starbucks-300918603.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Starbucks Announces Three New Appointments to Board of Directors",
        "subtitle": "",
        "date": "Sep 12, 2019 8:15AM EDT",
        "content": "    SEATTLE--(BUSINESS WIRE)--\nStarbucks Corporation (NASDAQ: SBUX) announced today the appointment of Richard (Ritch) E. Allison, Jr., Chief Executive Officer of Domino’s; Andrew (Andy) Campion, Executive Vice President and Chief Financial Officer of NIKE; and Isabel Ge Mahe, Apple’s Vice President and Managing Director of Greater China, to the Starbucks Board of Directors. These appointments increase Starbucks Board of Directors to 13.\n\n“As we pursue our goal of building an enduring company, I couldn’t be more excited to have Ritch, Andy and Isabel join our world-class board of directors,” said Kevin Johnson, Starbucks president and chief executive officer. “Their expertise across global technology, retail and customer experience at scale will accelerate our drive to innovate in a way that’s relevant to our customers and inspiring to our partners.”\n\nAll three joined the Starbucks Board of Directors effective Sept. 11, 2019. Other members of the Starbucks Board of Directors include: Myron E. Ullman III, Mellody Hobson, Roz Brewer, Mary Dillon, Kevin Johnson, Jorgen Vig Knudstorp, Satya Nadella, Joshua Cooper Ramo, Clara Shih, and Javier Teruel.\n\nAllison has served as Domino’s Chief Executive Officer since July 2018. He previously served as President, Domino’s International from October 2014 to July 2018, after joining the company in March 2011 as Executive Vice President of International. Allison will serve on the company’s Compensation and Management Development Committee.\n\nCampion will serve on the company’s Audit and Compliance Committee. He joined NIKE in 2007 and since 2015 has served as Executive Vice President and Chief Financial Officer of NIKE, Inc., with responsibility for all aspects of strategy and financial management.\n\nGe Mahe joined Apple in 2008, overseeing the development of cellular, Wi-Fi, Bluetooth, Near Field Communication (NFC), location and motion technologies for nearly every Apple product. She also played a key role in developing new China-specific features for iPhone and iPad. In her current role, she provides leadership and coordination across Apple’s China-based team. She will join the company’s Nominating and Corporate Governance Committee.\n\n“We are pleased to welcome Ritch, Andy and Isabel as new independent directors to the Starbucks board,” said Starbucks Chair Myron E. Ullman III. ”The addition of these directors complements our existing skills and experiences, and we are confident they will provide valuable perspectives as we continue to execute our strategy, drive growth and build long-term shareholder value for Starbucks.\"\n\nAbout Starbucks\n\nSince 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality arabica coffee. Today, with more than 30,000 stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique Starbucks Experience to life for every customer through every cup. To share in the experience, please visit us in our stores or online at stories.starbucks.com or www.starbucks.com.\n\nForward-Looking Statements\n\nCertain statements contained in this release are “forward-looking statements” within the meaning of applicable securities laws and regulations, including statements about executing our strategy, driving growth and building shareholder value. Such forward-looking statements are based on current management expectations and satisfactions of certain conditions that are subject to various risks and uncertainties, including market conditions and those risks detailed in the Company’s filings with the Securities and Exchange Commission, including the “Risk Factors” section of the Starbucks Annual Report on Form 10-K for the fiscal year ended September 30, 2018. The Company assumes no obligation to update any of these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190912005127/en/\nStarbucks\npress@starbucks.com\n206-318-7100\nSource: Starbucks Corporation"
    },
    {
        "title": "Thinking about trading options or stock in Boeing, Walt Disney, Alphabet, Starbucks, or Twitter?",
        "subtitle": "",
        "date": "Jul 26, 2019 9:31AM EDT",
        "content": "NEW YORK, July 26, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for BA, DIS, GOOGL, SBUX, and TWTR.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-boeing-walt-disney-alphabet-starbucks-or-twitter-300891670.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Thinking about trading options or stock in Amazon, Facebook, Intel, Paypal, or Starbucks?",
        "subtitle": "",
        "date": "Jul 24, 2019 9:31AM EDT",
        "content": "NEW YORK, July 24, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMZN, FB, INTC, PYPL, and SBUX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-amazon-facebook-intel-paypal-or-starbucks-300890228.htmlSOURCE  InvestorsObserver"
    }
]