[
    {
        "title": "Seattle Genetics Announces Cancellation of Presentation and Webcast at the Cowen 40th Annual Healthcare Conference",
        "subtitle": "",
        "date": "Mar 2, 2020 8:00AM EST",
        "content": "    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) announced today the cancellation of the Company’s presentation and webcast at the Cowen 40th Annual Healthcare Conference on Tuesday, previously scheduled to take place on March 3, 2020 at 9:20 a.m. Eastern Time. Management will no longer be attending the conference as a precautionary measure related to travel amidst the evolving coronavirus situation.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEV™ (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology. ADCETRIS is approved in certain CD30-expressing lymphomas, and PADCEV is approved in certain metastatic urothelial cancers. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005307/en/\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics to Present at the Cowen 40th Annual Healthcare Conference",
        "subtitle": "",
        "date": "Feb 26, 2020 8:00AM EST",
        "content": "    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) announced today that management will present at the Cowen 40th Annual Healthcare Conference on Tuesday, March 3, 2020 at 9:20 a.m. Eastern Time. The presentation will be webcast live and available for replay from Seattle Genetics’ website at www.seattlegenetics.com in the Investors section.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEVTM (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology. ADCETRIS is approved in certain CD30-expressing lymphomas, and PADCEV is approved in certain metastatic urothelial cancers. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005071/en/\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics and Astellas Receive FDA Breakthrough Therapy Designation for PADCEV™ (enfortumab vedotin-ejfv) in Combination with Pembrolizumab in First-Line Advanced Bladder Cancer",
        "subtitle": "",
        "date": "Feb 19, 2020 8:12AM EST",
        "content": "\n- Breakthrough Therapy Designation Based on Initial Results from Phase 1b/2 EV-103 Clinical Trial -\n    BOTHELL, Wash. & TOKYO--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) and Astellas Pharma Inc. (TSE: 4503, President and CEO: Kenji Yasukawa, Ph.D., “Astellas”) today announced that the U.S. Food and Drug Administration (FDA) has granted Breakthrough Therapy designation for PADCEV™ (enfortumab vedotin-ejfv) in combination with Merck’s (known as MSD outside the United States and Canada) anti-PD-1 therapy KEYTRUDA® (pembrolizumab) for the treatment of patients with unresectable locally advanced or metastatic urothelial cancer who are unable to receive cisplatin-based chemotherapy in the first-line setting. \n\nThe FDA’s Breakthrough Therapy process is designed to expedite the development and review of drugs that are intended to treat a serious or life-threatening condition. Designation is based upon preliminary clinical evidence indicating that the drug may demonstrate substantial improvement over available therapies on one or more clinically significant endpoints.\n\n“This is an important step in our investigation of PADCEV in combination with pembrolizumab as a first-line therapy for patients with advanced urothelial cancer who are unable to receive cisplatin-based chemotherapy,” said Roger Dansey, M.D., Chief Medical Officer, Seattle Genetics. “Based on encouraging early clinical activity, we recently initiated a phase 3 trial of this platinum-free combination and look forward to potentially addressing an unmet need for patients.”\n\n“The FDA’s Breakthrough Therapy designation reflects the encouraging preliminary evidence for the combination of PADCEV and pembrolizumab in previously untreated advanced urothelial cancer to benefit patients who are in need of effective treatment options,” said Andrew Krivoshik, M.D., Ph.D., Senior Vice President and Oncology Therapeutic Area Head, Astellas. “We look forward to continuing our work with the FDA as we progress our clinical development program as quickly as possible.”\n\nThe Breakthrough Therapy designation was granted based on results from the dose-escalation cohort and expansion cohort A of the phase 1b/2 trial EV-103 (NCT03288545), evaluating patients with locally advanced or metastatic urothelial cancer who are unable to receive cisplatin-based chemotherapy treated in the first-line setting with PADCEV in combination with pembrolizumab. Initial results from the trial were presented at the European Society of Medical Oncology (ESMO) 2019 Congress, and updated findings at the 2020 Genitourinary Cancers Symposium. EV-103 is an ongoing, multi-cohort, open-label, multicenter phase 1b/2 trial of PADCEV alone or in combination, evaluating safety, tolerability and efficacy in muscle invasive, locally advanced and first- and second-line metastatic urothelial cancer.\n\nAbout Bladder and Urothelial Cancer\n\nIt is estimated that approximately 81,000 people in the U.S. will be diagnosed with bladder cancer in 2020.1 Urothelial cancer accounts for 90 percent of all bladder cancers and can also be found in the renal pelvis, ureter and urethra.2\n\nGlobally, approximately 549,000 people were diagnosed with bladder cancer in 2018, and there were approximately 200,000 deaths worldwide.3\n\nThe recommended first-line treatment for patients with advanced urothelial cancer is a cisplatin-based chemotherapy. For patients who are unable to receive cisplatin, such as people with kidney impairment, a carboplatin-based regimen is recommended. However, fewer than half of patients respond to carboplatin-based regimens and outcomes are typically poorer compared to cisplatin-based regimens.4\n\nAbout PADCEV \n\nPADCEV (enfortumab vedotin-ejfv) was approved by the U.S. Food and Drug Administration (FDA) in December 2019 and is indicated for the treatment of adult patients with locally advanced or metastatic urothelial cancer who have previously received a programmed death receptor-1 (PD-1) or programmed death-ligand 1 (PD-L1) inhibitor and a platinum-containing chemotherapy before (neoadjuvant) or after (adjuvant) surgery or in a locally advanced or metastatic setting. PADCEV was approved under the FDA’s Accelerated Approval Program based on tumor response rate. Continued approval for this indication may be contingent upon verification and description of clinical benefit in confirmatory trials.5\n\nPADCEV is a first-in-class antibody-drug conjugate (ADC) that is directed against Nectin-4, a protein located on the surface of cells and highly expressed in bladder cancer.5,6 Nonclinical data suggest the anticancer activity of PADCEV is due to its binding to Nectin-4 expressing cells followed by the internalization and release of the anti-tumor agent monomethyl auristatin E (MMAE) into the cell, which result in the cell not reproducing (cell cycle arrest) and in programmed cell death (apoptosis).5 PADCEV is co-developed by Astellas and Seattle Genetics.\n\nImportant Safety Information \n\nWarnings and Precautions\n\nAdverse Reactions\n\nSerious adverse reactions occurred in 46% of patients treated with PADCEV. The most common serious adverse reactions (≥3%) were urinary tract infection (6%), cellulitis (5%), febrile neutropenia (4%), diarrhea (4%), sepsis (3%), acute kidney injury (3%), dyspnea (3%), and rash (3%). Fatal adverse reactions occurred in 3.2% of patients, including acute respiratory failure, aspiration pneumonia, cardiac disorder, and sepsis (each 0.8%).\n\nAdverse reactions leading to discontinuation occurred in 16% of patients; the most common adverse reaction leading to discontinuation was peripheral neuropathy (6%). Adverse reactions leading to dose interruption occurred in 64% of patients; the most common adverse reactions leading to dose interruption were peripheral neuropathy (18%), rash (9%) and fatigue (6%). Adverse reactions leading to dose reduction occurred in 34% of patients; the most common adverse reactions leading to dose reduction were peripheral neuropathy (12%), rash (6%) and fatigue (4%).\n\nThe most common adverse reactions (≥20%) were fatigue (56%), peripheral neuropathy (56%), decreased appetite (52%), rash (52%), alopecia (50%), nausea (45%), dysgeusia (42%), diarrhea (42%), dry eye (40%), pruritus (26%) and dry skin (26%). The most common Grade ≥3 adverse reactions (≥5%) were rash (13%), diarrhea (6%) and fatigue (6%).\n\nLab Abnormalities\n\nIn one clinical trial, Grade 3-4 laboratory abnormalities reported in ≥5% were: lymphocytes decreased, hemoglobin decreased, phosphate decreased, lipase increased, sodium decreased, glucose increased, urate increased, neutrophils decreased.\n\nDrug Interactions\n\nSpecific Populations\n\nFor more information, please see the full Prescribing Information for PADCEV here.\n\nAbout Seattle Genetics \n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nAbout Astellas \n\nAstellas Pharma Inc., based in Tokyo, Japan, is a company dedicated to improving the health of people around the world through the provision of innovative and reliable pharmaceutical products. For more information, please visit our website at https://www.astellas.com/en.\n\nAbout the Seattle Genetics and Astellas Collaboration\n\nSeattle Genetics and Astellas are co-developing PADCEV (enfortumab vedotin-ejfv) under a collaboration that was entered into in 2007 and expanded in 2009. Under the collaboration, the companies are sharing costs and profits on a 50:50 basis worldwide.\n\nAbout the Seattle Genetics, Astellas and Merck Collaboration\n\nSeattle Genetics and Astellas entered a clinical collaboration agreement with Merck to evaluate the combination of Seattle Genetics’ and Astellas’ PADCEV™ (enfortumab vedotin-ejfv) and Merck’s KEYTRUDA® (pembrolizumab), in patients with previously untreated metastatic urothelial cancer. KEYTRUDA is a registered trademark of Merck Sharp & Dohme Corp., a subsidiary of Merck & Co., Inc., Kenilworth, NJ, USA.\n\nSeattle Genetics Forward Looking Statements\n\nCertain statements made in this press release are forward looking, such as those, among others, relating to the development of PADCEV in combination with pembrolizumab as a first-line therapy for patients with advanced urothelial cancer who are unable to receive cisplatin-based chemotherapy, and the therapeutic potential of PADCEV including its efficacy, safety and therapeutic uses. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that ongoing and subsequent clinical trials may fail to establish sufficient efficacy, that adverse events or safety signals may occur and that adverse regulatory actions may occur. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Annual Report on Form 10-K for the year ended December 31, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nAstellas Cautionary Notes\n\nIn this press release, statements made with respect to current plans, estimates, strategies and beliefs and other statements that are not historical facts are forward-looking statements about the future performance of Astellas. These statements are based on management’s current assumptions and beliefs in light of the information currently available to it and involve known and unknown risks and uncertainties. A number of factors could cause actual results to differ materially from those discussed in the forward-looking statements. Such factors include, but are not limited to: (i) changes in general economic conditions and in laws and regulations, relating to pharmaceutical markets, (ii) currency exchange rate fluctuations, (iii) delays in new product launches, (iv) the inability of Astellas to market existing and new products effectively, (v) the inability of Astellas to continue to effectively research and develop products accepted by customers in highly competitive markets, and (vi) infringements of Astellas’ intellectual property rights by third parties.\n\nInformation about pharmaceutical products (including products currently in development), which is included in this press release is not intended to constitute an advertisement or medical advice.\n\n____________________________\n1 American Cancer Society. Cancer Facts & Figures 2020. https://www.cancer.org/content/dam/cancer-org/research/cancer-facts-and-statistics/annual-cancer-facts-and-figures/2020/cancer-facts-and-figures-2020.pdf. Accessed 01-23-2020.\n2 American Society of Clinical Oncology. Bladder cancer: introduction (10-2017). https://www.cancer.net/cancer-types/bladder-cancer/introduction. Accessed 05-09-2019.\n3 International Agency for Research on Cancer. Cancer Tomorrow: Bladder. http://gco.iarc.fr/tomorrow\n4 National Comprehensive Cancer Network (NCCN). NCCN Clinical Practice Guidelines in Oncology: Bladder Cancer. Version 4; July 10, 2019. https://www.nccn.org/professionals/physician_gls/pdf/bladder.pdf.\n5 PADCEV [package insert]. Northbrook, IL: Astellas, Inc.\n6 Challita-Eid P, Satpayev D, Yang P, et al. Enfortumab Vedotin Antibody-Drug Conjugate Targeting Nectin-4 Is a Highly Potent Therapeutic Agent in Multiple Preclinical Cancer Models. Cancer Res 2016;76(10):3003-13.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005512/en/\nSeattle Genetics Contacts: \n\nFor Media\nMonique Greer\nVice President, Corporate Communications\n(425) 527-4641\nmgreer@seagen.com\n\nFor Investors\nPeggy Pinkston\nVice President, Investor Relations\n(425) 527-4160\nppinkston@seagen.com\n\nAstellas Contacts:\n\nFor Media\nChris Goldrick\nAssociate Director, Portfolio Communications\n(847) 224-3014\nchris.goldrick@astellas.com\n\nFor Investors\nShin Okubo\nExecutive Director, Investor Relations\n+81-3-3244-3202\nshin.ohkubo@astellas.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Announces FDA Filing Acceptance for Priority Review of Tucatinib New Drug Application (NDA) for Patients with Locally Advanced or Metastatic HER2-Positive Breast Cancer",
        "subtitle": "",
        "date": "Feb 13, 2020 8:00AM EST",
        "content": "\n- FDA Action Date is August 20, 2020; Application Under FDA’s Real-Time Oncology Review (RTOR) and Orbis Pilot Programs -\n\n- Supported by Results from Pivotal HER2CLIMB Trial; First Investigational Therapy in a Pivotal Trial to Include Patients with Metastatic HER2-Positive Breast Cancer with Active Brain Metastases - \n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced that the U.S. Food and Drug Administration (FDA) has accepted for priority review the Company’s New Drug Application (NDA) for the investigational medicine tucatinib. This NDA requests FDA approval of tucatinib in combination with trastuzumab and capecitabine for treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have received at least three prior HER2-directed agents separately or in combination, in the neoadjuvant, adjuvant or metastatic setting. The filing is based on the results of HER2CLIMB, a randomized pivotal trial comparing tucatinib added to trastuzumab and capecitabine versus trastuzumab and capecitabine alone. HER2CLIMB trial results were recently presented at the 2019 San Antonio Breast Cancer Symposium and published in the New England Journal of Medicine (NEJM). Under the Prescription Drug User Fee Act (PDUFA), the FDA has set a target action date of August 20, 2020. Tucatinib is an oral, small molecule tyrosine kinase inhibitor (TKI) that is highly selective for HER2.\n\n“The FDA’s filing of the tucatinib NDA marks an important step forward for patients with locally advanced or metastatic HER2-positive breast cancer, including those with brain metastases,” said Clay Siegall, Ph.D., President and Chief Executive Officer of Seattle Genetics. “We are working collaboratively with the FDA throughout the review process to bring this important medicine to patients as quickly as possible.”\n\nThe NDA for tucatinib was submitted in December 2019 and is being reviewed under the Real-Time Oncology Review (RTOR) Pilot Program. The review of the tucatinib NDA is also being conducted under Project Orbis, an initiative of the FDA Oncology Center of Excellence. Project Orbis provides a framework for concurrent submission and review of oncology drugs among participating international partners. Tucatinib was recently granted Breakthrough Therapy designation by the FDA in combination with trastuzumab and capecitabine for the treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have been treated with trastuzumab, pertuzumab, and T-DM1. This designation was based on data from the pivotal HER2CLIMB trial.\n\nAbout HER2-Positive Breast Cancer\n\nPatients with HER2-positive breast cancer have tumors with high levels of a protein called human epidermal growth factor receptor 2 (HER2), which promotes the growth of cancer cells. An estimated 271,270 new cases of invasive breast cancer will be diagnosed in the U.S. in 2019.1 Between 15 and 20 percent of breast cancer cases worldwide are HER2-positive.2 Historically, HER2-positive breast cancer tends to be more aggressive and more likely to recur than HER2-negative breast cancer.2, 3, 4 In patients with metastatic breast cancer, the most common site of first metastasis is in bone, followed by lung, brain, and liver.5, 6 Up to 50 percent of metastatic HER2-positive breast cancer patients develop brain metastases over time.2, 7 Despite recent treatment advances, there is still a significant need for new therapies that can impact metastatic disease, especially brain metastases. There are currently no approved therapies demonstrating progression-free survival or overall survival benefit for the treatment of patients with HER2-positive metastatic breast cancer after progression on T-DM1.8, 9, 10\n\nAbout Tucatinib \n\nTucatinib is an investigational, orally bioavailable, potent tyrosine kinase inhibitor that is highly selective for HER2 without significant inhibition of EGFR. Inhibition of EGFR has been associated with significant toxicities, including skin rash and diarrhea. Tucatinib has shown activity as a single agent and in combination with both chemotherapy and other HER2 targeted agents such as trastuzumab.1,2 Studies of tucatinib in these combinations have shown activity both systemically and in brain metastases. HER2 is a growth factor receptor that is overexpressed in multiple cancers, including breast, colorectal and gastric cancers. HER2 mediates cell growth, differentiation and survival. Tucatinib has been granted orphan drug designation by the FDA for the treatment of breast cancer patients with brain metastases.\n\nIn addition to HER2CLIMB, tucatinib is being evaluated in a randomized, double-blind, placebo-controlled, multi-center phase 3 trial of tucatinib called HER2CLIMB-02. This trial is evaluating tucatinib in combination with T-DM1 compared to T-DM1 alone, in patients with unresectable locally advanced or metastatic HER2-positive breast cancer, including those with brain metastases, who have had prior treatment with a taxane and trastuzumab. The primary endpoint is progression-free survival (PFS) per RECIST criteria. Secondary endpoints include overall survival, objective response rate and duration of response. This global trial is expected to enroll approximately 460 patients. More information about the phase 3 trial, including enrolling centers, is available at www.clinicaltrials.gov.\n\nTucatinib is also being evaluated in a multi-center, open-label, single-arm phase 2 clinical trial known as MOUNTAINEER, with tucatinib in combination with trastuzumab in patients with HER2-positive, RAS wildtype metastatic or unresectable colorectal cancer. The primary endpoint of the trial is overall response rate by RECIST criteria. Duration of response, PFS, overall survival and safety and tolerability of the combination regimen are secondary objectives. Results for the first 26 patients were presented at the European Society for Medical Oncology (ESMO) 2019 Congress. Enrollment of up to 110 patients is ongoing. More information about the MOUNTAINEER trial, including enrolling centers, is available at www.clinicaltrials.gov.\n\nAbout Seattle Genetics \n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEVTM (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology. ADCETRIS is approved in certain CD30-expressing lymphomas, and PADCEV is approved in certain metastatic urothelial cancers. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nForward Looking Statements\n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the potential FDA approval of tucatinib in combination with trastuzumab and capecitabine for treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have received at least three prior HER2-directed agents separately or in combination, in the neoadjuvant, adjuvant or metastatic setting; the potential approval of tucatinib by regulatory authorities in Project Orbis countries outside the U.S.; the timing of any such approvals; the therapeutic potential of tucatinib, including its possible efficacy, safety and therapeutic uses and development activities including ongoing and future clinical trials. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that data from the HER2CLIMB trial may not be sufficient to support approval of tucatinib in the U.S. or in other Project Orbis countries; the possibility of delays in the regulatory approval process; the possibility of other adverse regulatory actions or developments; the difficulty and uncertainty of pharmaceutical product development; the risk of adverse events or safety signals and the possibility of disappointing results in ongoing or future clinical trials despite earlier promising clinical results. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Annual Report on Form 10-K for the year ended December 31, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nReferences:\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200213005275/en/\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\n\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics and Astellas Announce Updated Results from Phase 1b/2 Trial of PADCEV™ (enfortumab vedotin-ejfv) in Combination with Immune Therapy Pembrolizumab as Investigational First-Line Treatment for Advanced Bladder Cancer",
        "subtitle": "",
        "date": "Feb 11, 2020 8:00AM EST",
        "content": "\n- After Median Follow-Up of 11.5 Months, 73 Percent of Patients Had Confirmed Tumor Response with Majority of Responses Still Ongoing; No New Safety Signals Observed for the Combination -\n\n- Findings To Be Presented During an Oral Session at the 2020 Genitourinary Cancers Symposium -\n    BOTHELL, Wash. & TOKYO--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) and Astellas Pharma Inc. (TSE: 4503, President and CEO: Kenji Yasukawa, Ph.D., “Astellas”) today announced updated results from the phase 1b/2 clinical trial EV-103 in previously untreated patients with locally advanced or metastatic urothelial cancer who were ineligible for treatment with cisplatin-based chemotherapy. Forty-five patients were treated with the combination of PADCEV™ (enfortumab vedotin-ejfv) and pembrolizumab and were evaluated for safety and efficacy. After a median follow-up of 11.5 months, the study results continue to meet outcome measures for safety and demonstrate encouraging clinical activity for this platinum-free combination in a first-line setting. Updated results will be presented during an oral session on Friday, February 14 at the 2020 Genitourinary Cancers Symposium in San Francisco (Abstract #441). Initial results from the study were presented at the European Society of Medical Oncology Congress in September 2019.\n\nPADCEV is a first-in-class antibody-drug conjugate (ADC) that is directed against Nectin-4, a protein located on the surface of cells and highly expressed in bladder cancer.1,2\n\n“Cisplatin-based chemotherapy is the standard treatment for first-line advanced urothelial cancer; however, it isn’t an option for many patients,” said Jonathan E. Rosenberg, M.D., Medical Oncologist and Chief, Genitourinary Medical Oncology Service at Memorial Sloan Kettering Cancer Center in New York. “I’m encouraged by these interim results, including a median progression-free survival of a year for patients who received the platinum-free combination of PADCEV and pembrolizumab in the first-line setting.”\n\nIn the study, 58 percent (26/45) of patients had a treatment-related adverse event greater than or equal to Grade 3: increase in lipase (18 percent; 8/45), rash (13 percent; 6/45), hyperglycemia (13 percent; 6/45) and peripheral neuropathy (4 percent; 2/45); these rates were similar to those observed with PADCEV monotherapy.3 Eighteen percent (8/45) of patients had treatment-related immune-mediated adverse events of clinical interest greater than or equal to Grade 3 that required the use of systemic steroids (arthralgia, dermatitis bullous, pneumonitis, lipase increased, rash erythematous, rash maculo-papular, tubulointerstitial nephritis, myasthenia gravis). None of the adverse events of clinical interest were Grade 5 events. Six patients (13 percent) discontinued treatment due to treatment-related adverse events, most commonly peripheral sensory neuropathy. As previously reported, there was one death deemed to be treatment-related by the investigator attributed to multiple organ dysfunction syndrome.\n\nThe data demonstrated the combination of PADCEV plus pembrolizumab shrank tumors in the majority of patients, resulting in a confirmed objective response rate (ORR) of 73.3 percent (33/45; 95% Confidence Interval (CI): 58.1, 85.4) after a median follow-up of 11.5 months (range, 0.7 to 19.2). Responses included 15.6 percent (7/45) of patients who had a complete response (CR) and 57.8 percent (26/45) of patients who had a partial response. Median duration of response has not yet been reached (range 1.2 to 12.9+ months). Eighteen (55%) of 33 responses were ongoing at the time of analysis, with 83.9% of responses lasting at least 6 months and 53.7% of responses lasting at least 12 months (Kaplan-Meier estimate). The median progression-free survival was 12.3 months (95% CI: 7.98, -) and the 12-month overall survival (OS) rate was 81.6 percent (95% CI: 62 to 91.8 percent); median OS has not been reached.\n\n“These updated data are encouraging and provide support for the recently initiated phase 3 trial EV-302 that includes an arm evaluating PADCEV in this platinum-free combination in the first-line setting,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics.\n\n“These additional results support continued evaluation of PADCEV in combination with other agents and at earlier stages of treatment for patients with urothelial cancer,” said Andrew Krivoshik, M.D., Ph.D., Senior Vice President and Oncology Therapeutic Area Head at Astellas.\n\nAbout the EV-103 Trial\n\nEV-103 is an ongoing, multi-cohort, open-label, multicenter phase 1b/2 trial of PADCEV alone or in combination, evaluating safety, tolerability and efficacy in muscle invasive, locally advanced and first- and second-line metastatic urothelial cancer.\n\nThe dose-escalation cohort and expansion cohort A include locally advanced or metastatic urothelial cancer patients who are ineligible for cisplatin-based chemotherapy. Patients were dosed in a 21-day cycle, receiving an intravenous (IV) infusion of enfortumab vedotin on Days 1 and 8 and pembrolizumab on Day 1. At the time of this initial analysis, 45 patients (5 from the dose-escalation cohort and 40 from the dose-expansion cohort A) with locally advanced and/or metastatic urothelial cancer had been treated with enfortumab vedotin (1.25 mg/kg) plus pembrolizumab in the first-line setting.\n\nThe primary outcome measure of the cohorts included in this analysis is safety. Key secondary objectives related to efficacy include objective response rate (ORR), disease control rate (DCR), duration of response (DoR), progression-free survival (PFS) and overall survival (OS). DoR, PFS and OS are not yet mature.\n\nAdditional cohorts in the EV-103 study will evaluate enfortumab vedotin:\n\nMore information about PADCEV clinical trials can be found at clinicaltrials.gov.\n\nAbout Bladder and Urothelial Cancer\n\nIt is estimated that approximately 81,000 people in the U.S. will be diagnosed with bladder cancer in 2020.5 Urothelial cancer accounts for 90 percent of all bladder cancers and can also be found in the renal pelvis, ureter and urethra.6 Globally, approximately 549,000 people were diagnosed with bladder cancer in 2018, and there were approximately 200,000 deaths worldwide.7\n\nThe recommended first-line treatment for patients with advanced urothelial cancer is a cisplatin-based chemotherapy. For patients who are ineligible for cisplatin, such as people with kidney impairment, a carboplatin-based regimen is recommended. However, fewer than half of patients respond to carboplatin-based regimens and outcomes are typically poorer compared to cisplatin-based regimens.8\n\nAbout PADCEV \n\nPADCEV (enfortumab vedotin-ejfv) was approved by the U.S. Food and Drug Administration (FDA) in December 2019 and is indicated for the treatment of adult patients with locally advanced or metastatic urothelial cancer who have previously received a programmed death receptor-1 (PD-1) or programmed death-ligand 1 (PD-L1) inhibitor and a platinum-containing chemotherapy before (neoadjuvant) or after (adjuvant) surgery or in a locally advanced or metastatic setting. PADCEV was approved under the FDA’s Accelerated Approval Program based on tumor response rate. Continued approval may be contingent upon verification and description of clinical benefit in confirmatory trials.9\n\nPADCEV is a first-in-class antibody-drug conjugate (ADC) that is directed against Nectin-4, a protein located on the surface of cells and highly expressed in bladder cancer.2,9 Nonclinical data suggest the anticancer activity of PADCEV is due to its binding to Nectin-4 expressing cells followed by the internalization and release of the anti-tumor agent monomethyl auristatin E (MMAE) into the cell, which result in the cell not reproducing (cell cycle arrest) and in programmed cell death (apoptosis).9 PADCEV is co-developed by Astellas and Seattle Genetics.\n\nImportant Safety Information \n\nWarnings and Precautions\n\nAdverse Reactions\n\nSerious adverse reactions occurred in 46% of patients treated with PADCEV. The most common serious adverse reactions (≥3%) were urinary tract infection (6%), cellulitis (5%), febrile neutropenia (4%), diarrhea (4%), sepsis (3%), acute kidney injury (3%), dyspnea (3%), and rash (3%). Fatal adverse reactions occurred in 3.2% of patients, including acute respiratory failure, aspiration pneumonia, cardiac disorder, and sepsis (each 0.8%).\n\nAdverse reactions leading to discontinuation occurred in 16% of patients; the most common adverse reaction leading to discontinuation was peripheral neuropathy (6%). Adverse reactions leading to dose interruption occurred in 64% of patients; the most common adverse reactions leading to dose interruption were peripheral neuropathy (18%), rash (9%) and fatigue (6%). Adverse reactions leading to dose reduction occurred in 34% of patients; the most common adverse reactions leading to dose reduction were peripheral neuropathy (12%), rash (6%) and fatigue (4%).\n\nThe most common adverse reactions (≥20%) were fatigue (56%), peripheral neuropathy (56%), decreased appetite (52%), rash (52%), alopecia (50%), nausea (45%), dysgeusia (42%), diarrhea (42%), dry eye (40%), pruritus (26%) and dry skin (26%). The most common Grade ≥3 adverse reactions (≥5%) were rash (13%), diarrhea (6%) and fatigue (6%).\n\nLab Abnormalities\n\nIn one clinical trial, Grade 3-4 laboratory abnormalities reported in ≥5% were: lymphocytes decreased, hemoglobin decreased, phosphate decreased, lipase increased, sodium decreased, glucose increased, urate increased, neutrophils decreased.\n\nDrug Interactions\n\nSpecific Populations\n\nFor more information, please see the full Prescribing Information for PADCEV here.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit https://www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nAbout Astellas\n\nAstellas Pharma Inc., based in Tokyo, Japan, is a company dedicated to improving the health of people around the world through the provision of innovative and reliable pharmaceutical products. For more information, please visit our website at https://www.astellas.com/en.\n\nAbout the Astellas and Seattle Genetics Collaboration\n\nSeattle Genetics and Astellas are co-developing enfortumab vedotin-ejfv under a collaboration that was entered into in 2007 and expanded in 2009. Under the collaboration, the companies are sharing costs and profits on a 50:50 basis worldwide.\n\nSeattle Genetics Forward-Looking Statements\n\nCertain statements made in this press release are forward looking, such as those, among others, relating to the EV-103 and EV-302 clinical trials; clinical development plans relating to enfortumab vedotin; the therapeutic potential of enfortumab vedotin; and its possible safety, efficacy, and therapeutic uses, including in the first-line setting. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that ongoing and subsequent clinical trials of enfortumab vedotin may fail to establish sufficient efficacy; that adverse events or safety signals may occur and that adverse regulatory actions or other setbacks could occur as enfortumab vedotin advances in clinical trials even after promising results in earlier clinical trials. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Annual Report on Form 10-K for the year ended December 31, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nAstellas Cautionary Notes\n\nIn this press release, statements made with respect to current plans, estimates, strategies and beliefs and other statements that are not historical facts are forward-looking statements about the future performance of Astellas. These statements are based on management’s current assumptions and beliefs in light of the information currently available to it and involve known and unknown risks and uncertainties. A number of factors could cause actual results to differ materially from those discussed in the forward-looking statements. Such factors include, but are not limited to: (i) changes in general economic conditions and in laws and regulations, relating to pharmaceutical markets, (ii) currency exchange rate fluctuations, (iii) delays in new product launches, (iv) the inability of Astellas to market existing and new products effectively, (v) the inability of Astellas to continue to effectively research and develop products accepted by customers in highly competitive markets, and (vi) infringements of Astellas’ intellectual property rights by third parties.\n\nInformation about pharmaceutical products (including products currently in development), which is included in this press release is not intended to constitute an advertisement or medical advice.\n\n1 PADCEV [package insert]. Northbrook, IL: Astellas, Inc.\n2 Challita-Eid P, Satpayev D, Yang P, et al. Enfortumab Vedotin Antibody-Drug Conjugate Targeting Nectin-4 Is a Highly Potent Therapeutic Agent in Multiple Preclinical Cancer Models. Cancer Res 2016;76(10):3003-13.\n3 Rosenberg JE, O’Donnell PH, Balar AV, et al. Pivotal Trial of Enfortumab Vedotin in Urothelial Carcinoma After Platinum and Anti-Programmed Death 1/Programmed Death Ligand 1 Therapy. J Clin Oncol 2019;37(29):2592-600.\n4 ClinicalTrials.gov. A Study of Enfortumab Vedotin Alone or With Other Therapies for Treatment of Urothelial Cancer (EV-103). https://clinicaltrials.gov/ct2/show/NCT03288545.\n5 American Cancer Society. Cancer Facts & Figures 2020. https://www.cancer.org/content/dam/cancer-org/research/cancer-facts-and-statistics/annual-cancer-facts-and-figures/2020/cancer-facts-and-figures-2020.pdf. Accessed 01-23-2020.\n6 National Cancer Institute. Surveillance, Epidemiology, and End Results Program. Cancer stat facts: bladder cancer. https://seer.cancer.gov/statfacts/html/urinb.html. Accessed 05-01-2019.\n7 International Agency for Research on Cancer. Cancer Tomorrow: Bladder. http://gco.iarc.fr/tomorrow.\n8 National Comprehensive Cancer Network (NCCN). NCCN Clinical Practice Guidelines in Oncology: Bladder Cancer. Version 4; July 10, 2019. https://www.nccn.org/professionals/physician_gls/pdf/bladder.pdf.\n9 PADCEV [package insert]. Northbrook, IL: Astellas, Inc.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005337/en/\nSeattle Genetics Contacts:\nFor Media\nMonique Greer\nVice President, Corporate Communications\n(425) 527-4641\nmgreer@seagen.com\n\nFor Investors\nPeggy Pinkston\nVice President, Investor Relations\n(425) 527-4160\nppinkston@seagen.com\n\nAstellas Contacts:\nFor Media\nChris Goldrick\nAssociate Director, Portfolio Communications\n(847) 224-3014\nchris.goldrick@astellas.com\n\nFor Investors\nShin Ohkubo\nExecutive Director, Investor Relations\n+81-3-3244-3202\nshin.ohkubo@astellas.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Reports Fourth Quarter and Full Year 2019 Financial Results",
        "subtitle": "",
        "date": "Feb 6, 2020 4:02PM EST",
        "content": "\n-ADCETRIS® (Brentuximab Vedotin) Net Sales in U.S. and Canada of $627.7 Million in 2019, Including $166.2 Million in the Fourth Quarter-\n\n-PADCEV™ (Enfortumab Vedotin-ejfv) Granted Accelerated Approval by FDA for Patients with Locally Advanced or Metastatic Urothelial Cancer Following Platinum-based Chemotherapy and a PD-1 or PD-L1 Inhibitor; U.S. Commercial Launch Underway-\n\n-Tucatinib Applications for Approval Submitted to the FDA and EMA for Patients with Locally Advanced or Metastatic HER2-Positive Breast Cancer-\n\n-Conference Call Today at 4:30 p.m. ET-\n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today reported financial results for the fourth quarter and year ended December 31, 2019. The Company also highlighted ADCETRIS (brentuximab vedotin) and PADCEV (enfortumab vedotin-ejfv) commercial, regulatory and clinical development accomplishments and progress with its clinical programs for cancer, including tucatinib.\n\n“At the end of 2019, we became a multi-product oncology company following the rapid FDA approval of PADCEV for previously treated metastatic urothelial cancer patients, expanding our commercial portfolio into solid tumors,” said Clay Siegall, Ph.D., President and Chief Executive Officer of Seattle Genetics. “In addition, in collaboration with Takeda, global sales of ADCETRIS exceeded $1 billion in 2019, underscoring its importance in the treatment of multiple lymphomas. As we look ahead, subject to regulatory reviews, we are well positioned to bring a third product to market with the tucatinib marketing applications in the United States, Europe and other countries for patients with metastatic HER2-positive breast cancer. Importantly, across PADCEV, tucatinib and ADCETRIS, we are advancing broad clinical development programs intended to fully explore their potential. We are executing on our mission to develop transformative cancer therapies that make a meaningful difference in people's lives.”\n\nADCETRIS Program Highlights\n\nPADCEV Program Highlights\n\nTucatinib Program Highlights\n\nTisotumab Vedotin Program Highlights\n\nOther Recent Activities\n\nFOURTH QUARTER AND FULL YEAR 2019 FINANCIAL RESULTS\n\nRevenues: Total revenues in the fourth quarter and year ended December 31, 2019 increased to $289.8 million and $916.7 million, respectively, compared to $174.5 million and $654.7 million for the same periods in 2018. Revenues are comprised of the following three components:\n\nResearch and Development (R&D) Expenses: R&D expenses in the fourth quarter were $201.1 million, compared to $149.8 million in the fourth quarter of 2018. R&D expenses were $719.4 million for the full year in 2019, compared to $565.3 million in 2018. The increase in 2019 primarily reflected increased investment in the Company's late-stage pipeline.\n\nSelling, general and administrative (SG&A) Expenses: SG&A expenses in the fourth quarter were $115.2 million, compared to $79.5 million in the fourth quarter of 2018. SG&A expenses were $373.9 million for the full year in 2019, compared to $261.1 million for the same period in 2018. The increases were primarily attributed to costs to support commercialization efforts related to ADCETRIS frontline indications, launch preparation for PADCEV and tucatinib, as well as higher infrastructure costs to support the Company's continued growth.\n\nCost of Sales: Cost of sales in the fourth quarter were $9.6 million, compared to $30.2 million in the fourth quarter of 2018. Cost of sales were $34.9 million for the full year in 2019, compared to $66.1 million for the same period in 2018. The 2018 periods reflected an inventory write-off of $18.1 million recorded in the fourth quarter of 2018 related to ADCETRIS in-process production that did not meet manufacturing specifications, as well as a reduction in amounts owed to certain third-party technology licensors.\n\nNon-cash, share-based compensation cost for the full year in 2019 was $127.3 million, compared to $78.9 million for the same period in 2018.\n\nNet Income / Loss: Net income for the fourth quarter of 2019 was $25.8 million, or $0.14 per diluted share, compared to a net loss of $119.8 million, or $0.75 per diluted share, for the fourth quarter of 2018. Net income in the fourth quarter of 2019 included net investment income of $64.2 million primarily associated with Seattle Genetics’ common stock holdings in Immunomedics, which are marked-to-market. For the full year in 2019, net loss was $158.7 million, or $0.96 per share, compared to a net loss of $222.7 million, or $1.41 per share, for the year in 2018. Net loss for the full year in 2019 included net investment income of $61.9 million primarily associated with Seattle Genetics’ common stock holdings in Immunomedics. Net loss for both the fourth quarter and the full year in 2018 included a non-cash income tax benefit of $23.7 million related to acquired intangible assets as part of the acquisition of Cascadian Therapeutics.\n\nCash and Investments: As of December 31, 2019, Seattle Genetics had $868.3 million in cash and investments. In addition, the Company held stock investments, primarily in Immunomedics common stock, valued at $163.9 million.\n\n2020 FINANCIAL OUTLOOK\n\nSeattle Genetics anticipates 2020 revenues, operating expenses and other costs to be in the ranges shown in the table below.\n\nConference Call Details\n\nSeattle Genetics’ management will host a conference call and webcast with supporting slides to discuss its fourth quarter and full year 2019 financial results and provide an update on business activities. The event will be held today at 1:30 p.m. Pacific Time (PT); 4:30 p.m. Eastern Time (ET). The live event and supporting slides will be simultaneously webcast on the Seattle Genetics website at www.seattlegenetics.com, under the Investors section. Investors may also participate in the conference call by calling 800-353-6461 (domestic) or 334-323-0501 (international). The conference ID is 7290215. A replay of the live event and supporting slides will be available starting on February 6, 2020 on the Seattle Genetics website at www.seattlegenetics.com, under the Investors section, for at least 30 days. A replay of the audio only will be available by calling 888-203-1112 (domestic) or 719-457-0820 (international), using conference ID 7290215. The telephone replay will be available until 5:00 p.m. PT on February 9, 2020.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEV™ (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology. ADCETRIS is approved in certain CD30-expressing lymphomas, and PADCEV is approved in certain metastatic urothelial cancers. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nForward-Looking Statements\n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the Company’s 2020 outlook, including anticipated 2020 revenues, costs and expenses; the Company’s potential to achieve the noted development and regulatory milestones in 2020 and future periods and to bring a third product to market in the United States and other countries; anticipated activities related to the Company’s planned and ongoing clinical trials, including clinical trial enrollment and data availability and the expected timing thereof, including with respect to innovaTV 204, EV-301, EV-302, EV-202, HER2CLIMB-02, MOUNTAINEER and other clinical trials; the potential for the Company’s clinical trials to support further development, regulatory submissions and potential marketing approvals; the opportunities for, and the therapeutic and commercial potential of ADCETRIS, PADCEV, tucatinib, and tisotumab vedotin and the Company’s other product candidates and those of its licensees and collaborators; as well as other statements that are not historical facts. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the risks that the Company’s net sales, revenue, expense, and other financial guidance may not be as expected, as well as risks and uncertainties associated with maintaining or increasing sales of ADCETRIS and PADCEV due to competition, unexpected adverse events, regulatory action, reimbursement, market adoption by physicians or other factors. The Company may also be delayed in its planned clinical trial initiations, enrollment in and conduct of its clinical trials, obtaining data from clinical trials, planned regulatory submissions, regulatory approvals and launch in each case for a variety of reasons including the difficulty and uncertainty of pharmaceutical product development, negative or disappointing clinical trial results, unexpected adverse events or regulatory discussions or actions and the inherent uncertainty associated with the regulatory approval process and the pricing and reimbursement process when applicable. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the Company’s periodic reports filed with the Securities and Exchange Commission, including the Company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 and future periodic reports filed by the Company, including the Company's Annual Report on Form 10-K for the year ended December 31, 2019. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise except as required by applicable law.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005874/en/\nInvestors:\nPeggy Pinkston\n425-527-4160\nppinkston@seagen.com\n\nMedia:\nMonique Greer\n425-527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "EMA Validates Seattle Genetics’ Marketing Authorization Application for Tucatinib for Patients with Locally Advanced or Metastatic HER2-Positive Breast Cancer",
        "subtitle": "",
        "date": "Jan 31, 2020 8:00AM EST",
        "content": "\n- Application Supported by Results of Pivotal HER2CLIMB Trial -\n\n- First Investigational Therapy in a Pivotal Trial to Include Patients with Metastatic HER2-Positive Breast Cancer with Active Brain Metastases -\n\n- EU Marketing Authorization Application (MAA) Follows Recent Submission of Tucatinib New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) -\n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced that the European Medicines Agency (EMA) validated the Marketing Authorization Application (MAA) for tucatinib, in combination with trastuzumab and capecitabine, for the treatment of adult patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have received at least two prior anti-HER2 treatment regimens. The EMA validation of the MAA confirms that the submission is sufficiently complete to begin the formal review process. Tucatinib is an oral, small molecule tyrosine kinase inhibitor (TKI) that is highly selective for HER2.\n\n“Today, we achieved a significant milestone towards our goal of making tucatinib available to patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including those with brain metastases, around the world,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “We look forward to working with the EMA throughout the review process. If approved, tucatinib has the potential to be a clinically meaningful advance for patients in this disease setting.”\n\nThe MAA is based on data from the pivotal HER2CLIMB clinical trial, which compared tucatinib in combination with trastuzumab and capecitabine to trastuzumab and capecitabine alone in patients with locally advanced unresectable or metastatic HER2-positive breast cancer. Patients had previously received trastuzumab, pertuzumab and T-DM1 (ado-trastuzumab emtansine). Patients had received a median of four prior lines of therapy overall and three in the metastatic setting. Forty-seven percent of the patients enrolled in the trial had brain metastases at the time of enrollment. Results of the pivotal HER2CLIMB trial were presented during an oral presentation at the 2019 San Antonio Breast Cancer Symposium (SABCS) and simultaneously published in the New England Journal of Medicine (NEJM).\n\nThe New Drug Application (NDA) for tucatinib was submitted to the U.S. Food and Drug Administration (FDA) on December 23, 2019 under the Real-Time Oncology Review Pilot Program. The review of the tucatinib NDA is also being conducted under Project Orbis, an initiative of the FDA Oncology Center of Excellence. Project Orbis provides a framework for concurrent submission and review of oncology drugs among participating international partners. Tucatinib was recently granted Breakthrough Therapy designation by the FDA in combination with trastuzumab and capecitabine, for the treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have been treated with trastuzumab, pertuzumab, and T-DM1. This designation was based on data from the HER2CLIMB trial.\n\nAbout HER2CLIMB \n\nHER2CLIMB is a multinational randomized (2:1), double-blind, placebo-controlled, active comparator, pivotal clinical trial comparing tucatinib in combination with trastuzumab and capecitabine compared with trastuzumab and capecitabine alone in patients with locally advanced unresectable or metastatic HER2-positive breast cancer who were previously treated with trastuzumab, pertuzumab and T-DM1. The primary endpoint of the trial was progression-free survival (PFS) per Response Evaluation Criteria in Solid Tumors (RECIST) v1.1 as determined by blinded independent central review (BICR) in the first 480 patients enrolled in the trial. HER2CLIMB enrolled a total of 612 patients to support the analyses of key secondary endpoints, including overall survival, PFS per BICR in patients with brain metastases at baseline and confirmed objective response rate (ORR). Safety data were evaluated throughout the study.\n\nAbout HER2-Positive Breast Cancer\n\nPatients with HER2-positive breast cancer have tumors with high levels of a protein called human epidermal growth factor receptor 2 (HER2), which promotes the aggressive spread of cancer cells. An estimated 271,270 new cases of invasive breast cancer will be diagnosed in the U.S. in 2019.1 Between 15 and 20 percent of breast cancer cases worldwide are HER2-positive.2 Historically, HER2-positive breast cancer tends to be more aggressive and more likely to recur than HER2-negative breast cancer.2, 3, 4 In patients with metastatic breast cancer, the most common site of first metastasis is in bone, followed by lung, brain, and liver.5, 6 Up to 50 percent of metastatic HER2-positive breast cancer patients develop brain metastases over time.2, 7 Despite recent treatment advances, there is still a significant need for new therapies that can impact metastatic disease, especially brain metastases. There are currently no approved therapies demonstrating progression-free survival or overall survival benefit for the treatment of patients with HER2-positive metastatic breast cancer after progression on T-DM1.8, 9, 10\n\nAbout Tucatinib \n\nTucatinib is an investigational, orally bioavailable, potent tyrosine kinase inhibitor that is highly selective for HER2 without significant inhibition of EGFR. Inhibition of EGFR has been associated with significant toxicities, including skin rash and diarrhea. Tucatinib has shown activity as a single agent and in combination with both chemotherapy and other HER2 targeted agents such as trastuzumab.1,2 Studies of tucatinib in these combinations have shown activity both systemically and in brain metastases. HER2 is a growth factor receptor that is overexpressed in multiple cancers, including breast, colorectal and gastric cancers. HER2 mediates cell growth, differentiation and survival. Tucatinib has been granted orphan drug designation by the FDA for the treatment of breast cancer patients with brain metastases.\n\nIn addition to HER2CLIMB, tucatinib is being evaluated in a randomized, double-blind, placebo-controlled, multi-center phase 3 trial of tucatinib in combination with T-DM1 compared to T-DM1 alone, in patients with unresectable locally advanced or metastatic HER2-positive breast cancer, including those with brain metastases, who have had prior treatment with a taxane and trastuzumab. The primary endpoint is PFS per RECIST criteria. Secondary endpoints include overall survival, objective response rate and duration of response. This global trial is expected to enroll approximately 460 patients. More information about the phase 3 trial, including enrolling centers, is available at www.clinicaltrials.gov.\n\nTucatinib is also being evaluated in a multi-center, open-label, single-arm phase 2 clinical trial known as MOUNTAINEER, which is evaluating tucatinib in combination with trastuzumab in patients with HER2-positive, RAS wildtype metastatic or unresectable colorectal cancer. The primary endpoint of the trial is ORR by RECIST criteria. PFS, duration of response, overall survival and safety and tolerability of the combination regimen are secondary objectives. Results for 26 patients were evaluated in an analysis and presented at the European Society for Medical Oncology (ESMO) 2019 Congress. Enrollment is ongoing. More information about the MOUNTAINEER trial, including enrolling centers, is available at www.clinicaltrials.gov.\n\nAbout Seattle Genetics \n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEVTM (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology. ADCETRIS is approved in certain CD30-expressing lymphomas, and PADCEV is approved in certain metastatic urothelial cancers. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nForward Looking Statements\n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the therapeutic potential of tucatinib, including its possible efficacy, safety and therapeutic uses; anticipated development activities including ongoing and future clinical trials; and the potential to obtain regulatory approvals of tucatinib in the United States, the European Union and in countries participating in Project Orbis. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the difficulty and uncertainty of pharmaceutical product development, the risk of adverse events or safety signals, the possibility of disappointing results in ongoing or future clinical trials despite earlier promising clinical results, the possibility that data from the HER2CLIMB trial may not be sufficient to support approval of tucatinib in the United States, the European Union or in other countries participating in Project Orbis or that other adverse regulatory actions could occur. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nReferences:\n\n1. American Cancer Society, Cancer Facts and Figures 2018-2019.\n\n2. Loibl S, Gianni L (2017). HER2-positive breast cancer. The Lancet 389(10087): 2415-29.\n\n3. Slamon D, Clark G, Wong S, et al. (1987). Human breast cancer: correlation of relapse and survival with amplification of the HER-2/neu oncogene. Science 235(4785): 177-82.\n\n4. American Cancer Society (ACS) (2018). Breast cancer HER2 status. Accessed: December 10, 2018.\n\n5. Kennecke H, Yerushalmi R, Woods R, et al. (2010). Metastatic Behavior of Breast Cancer Subtypes. Journal of Clinical Oncology 28(20): 3271-7.\n\n6. Berman AT, Thukral AD, Hwang W-T, et al. (2013). Incidence and Patterns of Distant Metastases for Patients With Early-Stage Breast Cancer After Breast Conservation Treatment. Clinical Breast Cancer 13(2): 88-94.\n\n7. Duchnowska R, Loibl S, Jassem J (2018). Tyrosine kinase inhibitors for brain metastases in HER2-positive breast cancer. Cancer Treatment Reviews 67: 71-7.\n\n8. Verma S, Miles D, Gianni L, et al. (2012). Trastuzumab Emtansine for HER2-Positive Advanced Breast Cancer. New England Journal of Medicine 367(19): 1783-91.\n\n9. Geyer CE, Forster J, Lindquist D, et al. (2006). Lapatinib plus Capecitabine for HER2-Positive Advanced Breast Cancer. New England Journal of Medicine 355(26): 2733-43.\n\n10. Blackwell KL, Burstein HJ, Storniolo AM, et al. (2012). Overall Survival Benefit With Lapatinib in Combination With Trastuzumab for Patients With Human Epidermal Growth Factor Receptor 2–Positive Metastatic Breast Cancer: Final Results From the EGF104900 Study. Journal of Clinical Oncology 30(21): 2585-92.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200131005084/en/\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\n\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics to Host Conference Call and Webcast Discussion of Fourth Quarter and Full Year 2019 Financial Results on February 6, 2020",
        "subtitle": "",
        "date": "Jan 21, 2020 8:30AM EST",
        "content": "    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq: SGEN) announced today that it will report its fourth quarter and full year 2019 financial results on Thursday, February 6, 2020 after the close of financial markets. Following the announcement, company management will host a conference call and webcast discussion of the results and provide a general corporate update. Access to the event can be obtained as follows:\n\nLIVE access on Thursday, February 6, 2020\n1:30 p.m. Pacific Time / 4:30 p.m. Eastern Time\n\nREPLAY access\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEVTM (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology designed to bring a powerful medicine directly to cancer cells. ADCETRIS is approved for the treatment of several types of CD30-expressing lymphomas, and PADCEV is approved to treat adults with metastatic urothelial cancer. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121005347/en/\nInvestors\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nMedia\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Achieves Milestone Following European Commission Approval of Roche’s Polivy® (Polatuzumab Vedotin)",
        "subtitle": "",
        "date": "Jan 21, 2020 8:00AM EST",
        "content": "    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced that it will receive a milestone payment from Roche triggered by European Commission conditional marketing authorisation for Polivy® (polatuzumab vedotin). Polivy is an antibody-drug conjugate (ADC) that utilizes Seattle Genetics’ technology. It was developed and is commercialized by Roche/Genentech. Polivy was approved in combination with bendamustine plus MabThera® (rituximab) (BR) for the treatment of adult patients with relapsed or refractory (R/R) diffuse large B-cell lymphoma (DLBCL), who are not candidates for a haematopoietic stem cell transplant. Polivy was granted PRIME (PRIority MEdicines) designation by the European Medicines Agency (EMA) for the treatment of people with R/R DLBCL in 2017.\n\n“In addition to our two marketed ADC products ADCETRIS® (brentuximab vedotin) and the recently FDA-approved PADCEV™ (enfortumab vedotin-ejfv), the European Commission approval of Polivy highlights the increasing importance of ADCs in the treatment of cancer,” said Clay Siegall, Ph.D., President and Chief Executive Officer of Seattle Genetics. “Across our internal and collaborator pipelines, there are more than ten ADCs in clinical development employing our proprietary technology. We continue to lead in the field of ADCs with our novel linker systems, cell-killing payloads and conjugation technologies.”\n\nSeattle Genetics’ ADC technology combines the specificity of monoclonal antibodies, innovative linker systems and potent cell-killing agents to treat cancer. The technology has been licensed to several companies, including Roche/Genentech and GlaxoSmithKline. Under the terms of these agreements, each licensee company has rights to use the technology with antibodies against specified targets. The licensee is responsible for research, product development, manufacturing and commercialization. Seattle Genetics is entitled to receive fees, progress-dependent milestone payments and royalties on worldwide net sales of any resulting ADC products.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEV™ (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology designed to bring a powerful medicine directly to cancer cells. ADCETRIS is approved for the treatment of several types of CD30-expressing lymphomas, and PADCEV is approved to treat adults with metastatic urothelial cancer. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nForward-Looking Statements \n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to anticipated milestone payments, fees, and royalties due to the company from Genentech and other licensees, the therapeutic uses of Polivy, the importance of ADCs in treating cancer and the company’s leadership in the field of ADCs. Actual results or developments may differ materially from those projected or implied in these forward-looking statements due to factors such as unanticipated delays in or other obstacles to the development or commercialization of ADCs subject to these license agreements and the receipt by the Company of consideration from the subject ADC licenses. More information about the risks and uncertainties faced by the company is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121005354/en/\nInvestors\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nMedia\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics to Present at the J.P. Morgan Healthcare Conference",
        "subtitle": "",
        "date": "Jan 6, 2020 8:00AM EST",
        "content": "    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) announced today that management will present at the 38th Annual J.P. Morgan Healthcare Conference on Monday, January 13, 2020 at 2:30 p.m. Pacific Time. Both the presentation and question and answer session that follows at 3:00 p.m. will be webcast live and available for replay from Seattle Genetics’ website at www.seattlegenetics.com in the Investors section.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEVTM (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology designed to bring a powerful medicine directly to cancer cells. ADCETRIS is approved for the treatment of several types of CD30-expressing lymphomas, and PADCEV is approved to treat adults with metastatic urothelial cancer. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005191/en/\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Announces Submission of Tucatinib New Drug Application to the U.S. FDA for Patients with Locally Advanced or Metastatic HER2-Positive Breast Cancer",
        "subtitle": "",
        "date": "Dec 23, 2019 8:00AM EST",
        "content": "\n– Submission Based on Positive Pivotal HER2CLIMB Trial Results Recently Presented at the 2019 San Antonio Breast Cancer Symposium and Published in the New England Journal of Medicine –\n\n– FDA Granted Breakthrough Therapy Designation for Tucatinib in Locally Advanced or Metastatic HER2-Positive Breast Cancer –\n\n– First Investigational Therapy in a Pivotal Trial to Address Unmet Need for Patients with Metastatic HER2-Positive Breast Cancer with or without Brain Metastases –\n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced it has completed the submission of a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for tucatinib. This NDA requests FDA approval of tucatinib in combination with trastuzumab and capecitabine for treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have received at least three prior HER2-directed agents separately or in combination, in the neoadjuvant, adjuvant or metastatic setting. The submission is based on the results of HER2CLIMB, a randomized pivotal trial comparing tucatinib added to trastuzumab and capecitabine versus trastuzumab and capecitabine alone. HER2CLIMB trial results were presented on December 11, 2019 at the 2019 San Antonio Breast Cancer Symposium and published in the New England Journal of Medicine. Tucatinib is an oral, small molecule tyrosine kinase inhibitor (TKI) that is highly selective for HER2.\n\nTucatinib was recently granted Breakthrough Therapy designation by the FDA in combination with trastuzumab and capecitabine, for treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have been treated with trastuzumab, pertuzumab, and T-DM1. This designation was based on data from the HER2CLIMB trial.\n\n“Today’s submission marks another important milestone for Seattle Genetics and tucatinib, and a potential advance for patients with either locally advanced or metastatic HER2-positive breast cancer, including those with and without brain metastases,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “We look forward to working with the FDA on the review of this application.”\n\nAbout HER2-Positive Breast Cancer\n\nPatients with HER2-positive breast cancer have tumors with high levels of a protein called human epidermal growth factor receptor 2 (HER2), which promotes the aggressive spread of cancer cells. An estimated 271,270 new cases of invasive breast cancer will be diagnosed in the U.S. in 2019.1 Between 15 and 20 percent of breast cancer cases worldwide are HER2-positive.2 Historically, HER2-positive breast cancer tends to be more aggressive and more likely to recur than HER2-negative breast cancer.2, 3, 4 In patients with metastatic breast cancer, the most common site of first metastasis is in bone, followed by lung, brain, and liver.5, 6 Up to 50 percent of metastatic HER2-positive breast cancer patients develop brain metastases over time.2, 7 Despite recent treatment advances, there is still a significant need for new therapies that can impact metastatic disease, especially brain metastases. There are currently no approved therapies demonstrating progression-free survival or overall survival benefit for the treatment of patients with HER2-positive metastatic breast cancer after progression on T-DM1.8, 9, 10\n\nAbout HER2CLIMB \n\nHER2CLIMB is a multinational randomized (2:1), double-blind, placebo-controlled, active comparator, pivotal clinical trial comparing tucatinib in combination with trastuzumab and capecitabine compared with trastuzumab and capecitabine alone in patients with locally advanced unresectable or metastatic HER2-positive breast cancer who were previously treated with trastuzumab, pertuzumab, and T-DM1. The primary endpoint of the trial was PFS per Response Evaluation Criteria in Solid Tumors (RECIST) v1.1 as determined by blinded independent central review (BICR) in the first 480 patients enrolled in the trial. HER2CLIMB enrolled a total of 612 patients to support the analyses of key secondary endpoints, including overall survival, PFS per BICR in patients with brain metastases at baseline, and confirmed objective response rate. Safety data were evaluated throughout the study.\n\nAbout Tucatinib \n\nTucatinib is an investigational, orally bioavailable, potent tyrosine kinase inhibitor that is highly selective for HER2 without significant inhibition of EGFR. Inhibition of EGFR has been associated with significant toxicities, including skin rash and diarrhea. Tucatinib has shown activity as a single agent and in combination with both chemotherapy and other HER2 targeted agents such as trastuzumab.1, 2 Studies of tucatinib in these combinations have shown activity both systemically and in brain metastases. HER2 is a growth factor receptor that is overexpressed in multiple cancers, including breast, colorectal, and gastric cancers. HER2 mediates cell growth, differentiation, and survival. Tucatinib has been granted orphan drug designation by the FDA for the treatment of breast cancer patients with brain metastases.\n\nIn addition to HER2CLIMB, tucatinib is being evaluated in a randomized, double-blind, placebo-controlled, multi-center phase 3 trial of tucatinib in combination with T-DM1 compared to T-DM1 alone, in patients with unresectable locally advanced or metastatic HER2-positive breast cancer, including those with brain metastases, who have had prior treatment with a taxane and trastuzumab. The primary endpoint is progression-free survival per RECIST criteria. Secondary endpoints include overall survival, objective response rate, and duration of response. The trial is being conducted in North America and is expected to enroll approximately 460 patients. More information about the phase 3 trial, including enrolling centers, is available at www.clinicaltrials.gov.\n\nTucatinib is also being evaluated in a multi-center, open-label, single-arm phase 2 clinical trial known as MOUNTAINEER, which is evaluating tucatinib in combination with trastuzumab in patients with HER2-positive, RAS wildtype metastatic, or unresectable colorectal cancer. The primary endpoint of the trial is objective response rate by RECIST criteria. Progression-free survival, duration of response, overall survival, and safety and tolerability of the combination regimen are secondary objectives. Results for 26 patients were evaluated in an analysis and presented at the European Society for Medical Oncology (ESMO) 2019 Congress. Enrollment is ongoing. More information about the MOUNTAINEER trial, including enrolling centers, is available at www.clinicaltrials.gov.\n\nAbout Seattle Genetics \n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops, and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEV™ (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology designed to bring a powerful medicine directly to cancer cells. ADCETRIS is approved for the treatment of several types of CD30-expressing lymphomas, and PADCEV is approved to treat adults with metastatic urothelial cancer. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland, and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nForward Looking Statements\n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the potential FDA approval of tucatinib in combination with trastuzumab and capecitabine for treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have received at least three prior HER2-directed agents separately or in combination, in the neoadjuvant, adjuvant or metastatic setting; the therapeutic potential of tucatinib, including its possible efficacy, safety and therapeutic uses and anticipated development activities including ongoing and future clinical trials. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that the New Drug Application submission based on the HER2CLIMB trial may not be accepted for filing by, or ultimately approved by, the FDA in a timely manner or at all or with the requested label; the difficulty and uncertainty of pharmaceutical product development; the risk of adverse events or safety signals; and the possibility of disappointing results in ongoing or future clinical trials despite earlier promising clinical results. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nReferences:\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191223005127/en/\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\n\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics to Host Conference Call and Webcast on December 19, 2019 to Discuss PADCEVTM (enfortumab vedotin-ejfv) Approval",
        "subtitle": "",
        "date": "Dec 18, 2019 6:42PM EST",
        "content": "    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq: SGEN) will host a conference call and webcast on Thursday, December 19, 2019 to discuss the U.S. Food and Drug Administration approval of PADCEVTM (enfortumab vedotin-ejfv). Access to the event can be obtained as follows:\n\nLIVE access on Thursday, December 19, 2019\n6:00 a.m. Pacific Time / 9:00 a.m. Eastern Time\n\nREPLAY access\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is a global biotechnology company that discovers, develops and commercializes transformative medicines targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) and PADCEVTM (enfortumab vedotin-ejfv) use the company’s industry-leading antibody-drug conjugate (ADC) technology designed to bring a powerful medicine directly to cancer cells. ADCETRIS is approved for the treatment of several types of CD30-expressing lymphomas, and PADCEV is approved to treat adults with metastatic urothelial cancer. In addition, investigational agent tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer, and in clinical development for metastatic colorectal cancer. The company is headquartered in Bothell, Washington, and has offices in California, Switzerland and the European Union. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191218005820/en/\nInvestors\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nMedia\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "FDA Grants Accelerated Approval to Astellas’ and Seattle Genetics’ PADCEV™ (enfortumab vedotin-ejfv) for People with Locally Advanced or Metastatic Urothelial Cancer, the Most Common Type of Bladder Cancer",
        "subtitle": "",
        "date": "Dec 18, 2019 6:36PM EST",
        "content": "\n  - First-in-Class Antibody-Drug Conjugate Directed Against Nectin-4, a Protein Highly Expressed in Urothelial Tumors1,2 -\n\n- PADCEV is the First Treatment Approved for Locally Advanced or Metastatic Urothelial Cancer Following Treatment with Platinum-based Chemotherapy and a PD-1 or PD-L1 Inhibitor -\n    BOTHELL, Wash. & TOKYO--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) and Astellas Pharma Inc. (TSE: 4503, President and CEO: Kenji Yasukawa, Ph.D., “Astellas”) today announced that the U.S. Food and Drug Administration (FDA) granted accelerated approval to PADCEV™ for the treatment of adult patients with locally advanced or metastatic urothelial cancer who have previously received a PD-1/L1 inhibitor and a platinum-containing chemotherapy before (neoadjuvant) or after (adjuvant) surgery or in a locally advanced or metastatic setting. PADCEV is approved under the FDA’s Accelerated Approval Program based on tumor response rate. Continued approval may be contingent upon verification and description of clinical benefit in confirmatory trials. PADCEV is the first FDA approved treatment in the U.S. for these patients. It is a first-in-class antibody-drug conjugate (ADC) that is directed against Nectin-4, a protein located on the surface of cells and highly expressed in bladder cancer.1,3\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191218005817/en/(Photo: Business Wire)\n“Metastatic urothelial cancer is an aggressive and devastating disease with limited treatment options, and the approval of PADCEV is a significant advance for these patients who previously had limited options after initial therapies failed,” said Jonathan E. Rosenberg, M.D., Medical Oncologist, Chief, Genitourinary Medical Oncology Service, Memorial Sloan Kettering Cancer Center in New York. “The PADCEV clinical trial enrolled a range of patients whose cancer was difficult to treat, including those whose disease had spread to the liver.”\n\n“The FDA approval of PADCEV is welcome news for patients with bladder cancer,” said Andrea Maddox-Smith, Chief Executive Officer, Bladder Cancer Advocacy Network. “Though new medicines for bladder cancer have been approved in recent years, most people living with advanced stages of this disease face a difficult journey with few treatment options.”\n\n“This approval underscores our commitment to develop novel medicines that address unmet patient needs, and we’re grateful to the patients and physicians whose participation led to this outcome,” said Andrew Krivoshik, M.D., Ph.D., Senior Vice President and Oncology Therapeutic Area Head, Astellas.\n\n“PADCEV is the first antibody-drug conjugate approved for patients facing this aggressive disease, and it is the culmination of years of innovative work on this technology,” said Roger Dansey, M.D., Chief Medical Officer, Seattle Genetics.\n\nPADCEV was evaluated in the pivotal trial EV-201, a single-arm phase 2 multi-center trial that enrolled 125 patients with locally advanced or metastatic urothelial cancer who received prior treatment with a PD-1 or PD-L1 inhibitor and a platinum-based chemotherapy.1 In the study, the primary endpoint of confirmed objective response rate (ORR) was 44 percent per blinded independent central review (55/125; 95% Confidence Interval [CI]: 35.1, 53.2). Among patients treated with the single agent PADCEV, 12 percent (15/125) experienced a complete response, meaning no cancer could be detected at the time of assessment, and 32 percent (40/125) experienced a partial response, meaning a decrease in tumor size or extent of cancer in the body. The median duration of response (DoR), a secondary endpoint, was 7.6 months (95% CI: 6.3, not estimable [NE]). The most common serious adverse reactions (≥3%) were urinary tract infection (6%), cellulitis (5%), febrile neutropenia (4%), diarrhea (4%), sepsis (3%), acute kidney injury (3%), dyspnea (3%), and rash (3%). The most common adverse reaction leading to discontinuation was peripheral neuropathy (6%). The most common adverse reactions (≥20%) were fatigue (56%), peripheral neuropathy (56%), decreased appetite (52%), rash (52%), alopecia (50%), nausea (45%), dysgeusia (42%), diarrhea (42%), dry eye (40%), pruritus (26%) and dry skin (26%). The most common Grade ≥3 adverse reactions (≥5%) were rash (13%), diarrhea (6%) and fatigue (6%).\n\nThe FDA's Accelerated Approval Program allows approval of a medicine based on a surrogate endpoint if the medicine fills an unmet medical need for a serious condition. A global, randomized phase 3 confirmatory clinical trial (EV-301) is underway and is also intended to support global registrations.\n\nAbout PADCEV \n\nPADCEV is a first-in-class antibody-drug conjugate (ADC) that is directed against Nectin-4, a protein located on the surface of cells and highly expressed in bladder cancer.1,2 Nonclinical data suggest the anticancer activity of PADCEV is due to its binding to Nectin-4 expressing cells followed by the internalization and release of the anti-tumor agent monomethyl auristatin E (MMAE) into the cell, which result in the cell not reproducing (cell cycle arrest) and in programmed cell death (apoptosis). PADCEV is co-developed by Astellas and Seattle Genetics.\n\nPADCEV Support Solutions offers access and reimbursement support to help patients access PADCEV. For more information, go to PADCEV Support Solutions at PADCEVSupportSolutions.com.\n\nAbout Bladder and Urothelial Cancer\n\nApproximately 80,000 people in the U.S. will be diagnosed with bladder cancer this year.4 Urothelial cancer accounts for 90 percent of all bladder cancers and can also be found in the renal pelvis, ureter and urethra.5\n\nImportant Safety Information \n\nWarnings and Precautions\n\nAdverse Reactions\n\nSerious adverse reactions occurred in 46% of patients treated with PADCEV. The most common serious adverse reactions (≥3%) were urinary tract infection (6%), cellulitis (5%), febrile neutropenia (4%), diarrhea (4%), sepsis (3%), acute kidney injury (3%), dyspnea (3%), and rash (3%). Fatal adverse reactions occurred in 3.2% of patients, including acute respiratory failure, aspiration pneumonia, cardiac disorder, and sepsis (each 0.8%).\n\nAdverse reactions leading to discontinuation occurred in 16% of patients; the most common adverse reaction leading to discontinuation was peripheral neuropathy (6%). Adverse reactions leading to dose interruption occurred in 64% of patients; the most common adverse reactions leading to dose interruption were peripheral neuropathy (18%), rash (9%) and fatigue (6%). Adverse reactions leading to dose reduction occurred in 34% of patients; the most common adverse reactions leading to dose reduction were peripheral neuropathy (12%), rash (6%) and fatigue (4%).\n\nThe most common adverse reactions (≥20%) were fatigue (56%), peripheral neuropathy (56%), decreased appetite (52%), rash (52%), alopecia (50%), nausea (45%), dysgeusia (42%), diarrhea (42%), dry eye (40%), pruritus (26%) and dry skin (26%). The most common Grade ≥3 adverse reactions (≥5%) were rash (13%), diarrhea (6%) and fatigue (6%).\n\nLab Abnormalities\n\nIn one clinical trial, Grade 3-4 laboratory abnormalities reported in ≥5% were: lymphocytes decreased, hemoglobin decreased, phosphate decreased, lipase increased, sodium decreased, glucose increased, urate increased, neutrophils decreased.\n\nDrug Interactions\n\nSpecific Populations\n\nFor more information, please see the full Prescribing Information for PADCEV here.\n\nAbout Seattle Genetics \n\nSeattle Genetics, Inc. is an emerging multi-product, global biotechnology company that develops and commercializes transformative therapies targeting cancer to make a meaningful difference in people’s lives. The company is headquartered in Bothell, Washington, and has a European office in Switzerland. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nAbout Astellas \n\nAstellas Pharma Inc., based in Tokyo, Japan, is a company dedicated to improving the health of people around the world through the provision of innovative and reliable pharmaceutical products. For more information, please visit our website at https://www.astellas.com/en.\n\nAbout the Seattle Genetics and Astellas Collaboration \n\nSeattle Genetics and Astellas are co-developing PADCEV (enfortumab vedotin) under a collaboration that was entered into in 2007 and expanded in 2009. Under the collaboration, the companies are sharing costs and profits on a 50:50 basis worldwide.\n\nSeattle Genetics Forward Looking Statements \n\nCertain statements made in this press release are forward looking, such as those, among others, relating to the continued FDA approval of PADCEV™ (enfortumab vedotin-ejfv) for the treatment of adult patients with locally advanced or metastatic urothelial cancer who have previously received a PD-1/L1 inhibitor, and a platinum-containing chemotherapy in the neoadjuvant/adjuvant, locally advanced or metastatic setting; the conduct of an ongoing randomized phase 3 confirmatory clinical trial (EV-301) intended to verify the clinical benefit of PADCEV and support global registrations; and the therapeutic potential of PADCEV including its efficacy, safety and therapeutic uses. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that EV-301 and subsequent clinical trials may fail to establish sufficient efficacy; that adverse events or safety signals may occur; that utilization and adoption of PADCEV by prescribing physicians may be limited by the availability and extent of reimbursement or other factors; and that adverse regulatory actions may occur. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nAstellas Cautionary Notes\n\nIn this press release, statements made with respect to current plans, estimates, strategies and beliefs and other statements that are not historical facts are forward-looking statements about the future performance of Astellas. These statements are based on management’s current assumptions and beliefs in light of the information currently available to it and involve known and unknown risks and uncertainties. A number of factors could cause actual results to differ materially from those discussed in the forward-looking statements. Such factors include, but are not limited to: (i) changes in general economic conditions and in laws and regulations, relating to pharmaceutical markets, (ii) currency exchange rate fluctuations, (iii) delays in new product launches, (iv) the inability of Astellas to market existing and new products effectively, (v) the inability of Astellas to continue to effectively research and develop products accepted by customers in highly competitive markets, and (vi) infringements of Astellas’ intellectual property rights by third parties.\n\nInformation about pharmaceutical products (including products currently in development), which is included in this press release is not intended to constitute an advertisement or medical advice.\n\n1 PADCEV [package insert]. Northbrook, IL: Astellas, Inc.\n2 Rosenberg JE, O’Donnell PH, Balar AV, et al. Pivotal Trial of Enfortumab Vedotin in Urothelial Carcinoma After Platinum and Anti-Programmed Death 1/Programmed Death Ligand 1 Therapy. J Clin Oncol 2019;37(29):2592-600.\n3 Challita-Eid P, Satpayev D, Yang P, et al. Enfortumab Vedotin Antibody-Drug Conjugate Targeting Nectin-4 Is a Highly Potent Therapeutic Agent in Multiple Preclinical Cancer Models. Cancer Res 2016;76(10):3003-13.\n4 American Society of Clinical Oncology. Bladder cancer: introduction (10-2017). https://www.cancer.net/cancer-types/bladdercancer/introduction. Accessed 05-09-2019.\n5 National Cancer Institute. Surveillance, Epidemiology, and End Results Program. Cancer stat facts: bladder cancer. https://seer.cancer.gov/statfacts/html/urinb.html. Accessed 05-01-2019.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191218005817/en/\nSeattle Genetics Contacts:\nFor Media\nMonique Greer\nVice President, Corporate Communications\n(425) 527-4641\nmgreer@seagen.com\n\nFor Investors\nPeggy Pinkston\nVice President, Investor Relations\n(425) 527-4160\nppinkston@seagen.com\n\nAstellas Contacts:\nFor Media\nMarjorie Moeling\nDirector, Corporate Affairs\n(224) 205-5205\nmarjorie.moeling@astellas.com\n\nFor Investors\nShin Okubo\nExecutive Director, Investor Relations\n+81-3-3244-3202\nshin.ohkubo@astellas.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Announces U.S. FDA Grants Breakthrough Therapy Designation for Tucatinib in Locally Advanced or Metastatic HER2-Positive Breast Cancer",
        "subtitle": "",
        "date": "Dec 18, 2019 8:00AM EST",
        "content": "\n- Designation Based on Positive Pivotal HER2CLIMB Trial Evaluating Tucatinib in Locally Advanced or Metastatic HER2-Positive Breast Cancer; Data were Presented at 2019 SABCS and Published in the New England Journal of Medicine -\n\n- New Drug Application Submission to U.S. FDA Expected by First Quarter of 2020 -\n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced that the U.S. Food and Drug Administration (FDA) has granted Breakthrough Therapy designation to tucatinib, in combination with trastuzumab and capecitabine, for treatment of patients with locally advanced unresectable or metastatic HER2-positive breast cancer, including patients with brain metastases, who have been treated with trastuzumab, pertuzumab, and T-DM1. The positive topline results of the pivotal HER2CLIMB clinical trial were announced in October 2019, and additional data were presented at the 2019 San Antonio Breast Cancer Symposium (SABCS) on December 11, 2019 and were simultaneously published in the New England Journal of Medicine (NEJM). Tucatinib is an oral, small molecule tyrosine kinase inhibitor (TKI) that is highly selective for HER2.\n\nThe FDA’s Breakthrough Therapy process is intended to expedite the development and review of promising drug candidates intended for serious or life-threatening conditions. Designation is based upon preliminary clinical evidence of the potential for substantial improvement over existing therapies on one or more clinically significant endpoints.\n\n“The addition of tucatinib to the commonly used combination of trastuzumab and capecitabine demonstrated superior activity compared to trastuzumab and capecitabine alone in patients with unresectable locally advanced or metastatic HER2-positive breast cancer, including those with and without brain metastases,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “The decision by the FDA to grant Breakthrough Therapy designation to tucatinib recognizes the urgent need for new medicines that can impact the lives of those with HER2-positive metastatic breast cancer. We intend to submit a New Drug Application to the FDA and an MAA to the EMA by the first quarter 2020, with the goal of making tucatinib available to patients in this setting as soon as possible.”\n\nThis Breakthrough Therapy designation was based on data from the pivotal HER2CLIMB clinical trial, which compared tucatinib in combination with trastuzumab and capecitabine to trastuzumab and capecitabine alone in patients with locally advanced unresectable or metastatic HER2-positive breast cancer. Patients had previously received trastuzumab, pertuzumab and ado-trastuzumab emtansine (T-DM1). Patients had received a median of four prior lines of therapy overall and three in the metastatic setting. Forty-seven percent of the patients enrolled in the trial had brain metastases at the time of enrollment.\n\nData presented at SABCS and published in NEJM include the primary endpoint of progression-free survival (PFS) as assessed by blinded independent central review (BICR) in the first 480 patients enrolled in the trial. The primary endpoint of PFS showed that the addition of tucatinib was superior to trastuzumab and capecitabine alone, with a 46 percent reduction in the risk of disease progression or death (hazard ratio (HR)=0.54 (95% Confidence Interval (CI): 0.42, 0.71); p"
    },
    {
        "title": "Seattle Genetics Announces Positive Tucatinib HER2CLIMB Trial Results in Locally Advanced or Metastatic HER2-Positive Breast Cancer Presented at 2019 SABCS and Published in the New England Journal of Medicine",
        "subtitle": "",
        "date": "Dec 11, 2019 9:54AM EST",
        "content": "\n- First HER2 Tyrosine Kinase Inhibitor in Combination to Show Improved Progression-Free Survival and Overall Survival in Patients with Metastatic HER2-Positive Breast Cancer With or Without Brain Metastases - \n\n- NDA and MAA On Track for Submission by First Quarter of 2020 -\n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced positive pivotal data from the HER2CLIMB trial evaluating tucatinib in patients with HER2-positive metastatic breast cancer (MBC) were presented at the 2019 San Antonio Breast Cancer Symposium (SABCS) and simultaneously published in the New England Journal of Medicine (NEJM). The HER2CLIMB trial compared tucatinib in combination with trastuzumab and capecitabine to trastuzumab and capecitabine alone in patients with unresectable locally advanced or metastatic HER2-positive breast cancer. Patients had previously received trastuzumab, pertuzumab and ado-trastuzumab emtansine (T-DM1). Patients had received a median of four prior lines of therapy overall and three lines in the metastatic setting. Forty-seven percent of the patients enrolled in the trial had brain metastases at the time of enrollment. HER2CLIMB is the first randomized pivotal trial completed to enroll patients with metastatic HER2-positive breast cancer who have untreated or previously treated and progressing brain metastases. Tucatinib is an oral, small molecule tyrosine kinase inhibitor (TKI) that is highly selective for HER2.\n\n“Following progression on trastuzumab, pertuzumab and T-DM1 in the metastatic HER2-positive breast cancer setting, there is no single standard of care regimen and clinical trial participation is often strongly encouraged. There is a significant unmet medical need for these patients, particularly those who develop brain metastases,” said Rashmi Murthy, MD, MBE, Assistant Professor, Department of Breast Medical Oncology, Division of Cancer Medicine, The University of Texas MD Anderson Cancer Center. “The addition of tucatinib to the commonly used combination of trastuzumab and capecitabine improved overall survival, reducing the risk of death by 34 percent compared to trastuzumab and capecitabine alone. The results from HER2CLIMB demonstrate tucatinib has the potential to become a new treatment option for patients who have been previously treated with multiple anti-HER2 agents, including patients with and without brain metastases.”\n\n“Continued innovation to bring new therapies for the treatment of metastatic HER2-positive breast cancer is urgently needed, and we are encouraged by the impressive clinical activity demonstrated with the addition of tucatinib to trastuzumab and capecitabine in the HER2CLIMB trial,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “Tucatinib demonstrated a statistically significant and clinically meaningful benefit in overall survival, progression-free survival and objective response rate compared to the control arm. We plan to submit a New Drug Application (NDA) to the U.S. Food and Drug Administration and a Marketing Authorization Application (MAA) to the European Medicines Agency by the first quarter of 2020, with the goal of bringing a much-needed new medicine to patients.”\n\nData presented at SABCS and published in NEJM include the primary endpoint of progression-free survival (PFS) as assessed by blinded independent central review (BICR) in the first 480 patients enrolled in the trial. HER2CLIMB enrolled a total of 612 patients to support the analyses of key secondary endpoints, including overall survival (OS) as well as progression-free survival (PFS) in patients with brain metastases at baseline.\n\nPivotal HER2CLIMB Trial Results\n\nEfficacy:\n"
    },
    {
        "title": "Seattle Genetics and Takeda Announce Additional Analyses of ADCETRIS® (Brentuximab Vedotin) ECHELON-1 and ECHELON-2 Phase 3 Clinical Trials at the 2019 ASH Annual Meeting",
        "subtitle": "",
        "date": "Dec 9, 2019 10:00AM EST",
        "content": "\n- Four-Year Data Continue to Show Superior Progression-Free Survival of ADCETRIS in Combination with AVD when Compared to ABVD in Frontline Advanced Hodgkin Lymphoma with 31 Percent Reduction in the Risk of Progression or Death -\n\n- Additional Analysis from ECHELON-2 Phase 3 Clinical Trial Evaluating ADCETRIS Plus CHP Chemotherapy Also Featured at ASH Annual Meeting -\n    BOTHELL, Wash. & CAMBRIDGE, Mass. & OSAKA, Japan--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) and Takeda Pharmaceutical Company Limited (TSE:4502/NYSE:TAK) today announced additional analyses of results from the ECHELON-1 and ECHELON-2 frontline phase 3 trials of ADCETRIS® (brentuximab vedotin). These analyses were presented at the 61st Annual Meeting of the American Society of Hematology (ASH) taking place December 7-10, 2019 in Orlando, Fla. ADCETRIS is an antibody-drug conjugate (ADC) directed to CD30, a defining marker of classical Hodgkin lymphoma and expressed on the surface of several types of peripheral T-cell lymphomas (PTCL).\n\nThe ECHELON-1 analysis highlighted a four-year update of the phase 3 clinical trial in a poster presentation. ECHELON-1 is evaluating ADCETRIS in combination with AVD (Adriamycin [doxorubicin], vinblastine and dacarbazine) compared to ABVD (Adriamycin [doxorubicin], bleomycin, vinblastine and dacarbazine) in patients with Stage III or IV frontline classical Hodgkin lymphoma.\n\nThe ECHELON-2 phase 3 clinical trial data were presented in an oral session at ASH and focused on the outcomes of the subset of patients who underwent consolidative stem cell transplant. ECHELON-2 is evaluating ADCETRIS in combination with CHP (cyclophosphamide, doxorubicin, prednisone) compared to CHOP (cyclophosphamide, doxorubicin, vincristine, prednisone) in frontline CD30-expressing PTCL.\n\n“For decades, the standard of care for the treatment of frontline Hodgkin lymphoma has been combination chemotherapy, called ABVD. Unfortunately, approximately 30 percent of patients with advanced stage Hodgkin lymphoma do not respond or relapse following treatment with this therapy,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “The four-year update from the ECHELON-1 trial continues to support the robust and durable frontline treatment benefit of ADCETRIS plus AVD, including in both Stage III and IV disease settings, compared to ABVD across subgroups, regardless of PET2 status. These data reinforce ADCETRIS plus AVD as a treatment option that should be offered to all newly diagnosed advanced stage patients with Hodgkin lymphoma.”\n\n“Updated data from the ECHELON-1 trial and further insights from ECHELON-2 build upon our continued understanding of the potential ADCETRIS offers patients with CD30-positive lymphomas,” said Phil Rowlands, Ph.D., Head, Oncology Therapeutic Area Unit, Takeda. “We’re especially encouraged by the promising four-year follow-up ECHELON-1 results being presented at ASH, as approximately one in three patients with advanced Hodgkin lymphoma do not achieve long-term remission after standard frontline therapy.”\n\nBrentuximab Vedotin with Chemotherapy for Stage 3/4 Classical Hodgkin Lymphoma (cHL): 4-Year Update of the ECHELON-1 Study (Abstract #4026, poster presentation on Monday, December 9, 2019)\n\nAs previously reported, the ECHELON-1 trial achieved its primary endpoint with the combination of ADCETRIS plus AVD resulting in a statistically significant improvement in modified progression-free survival (PFS) compared to the control arm of ABVD as assessed by independent review facility (IRF; hazard ratio (HR), 0.77; p=0.035). A four-year post-hoc exploratory analysis was conducted to examine PFS outcomes per investigator assessment in the intent-to-treat population of 1,334 patients, including results by PET2 status, age, stage and prognostic risk scores. Results include:\n\nMore than 45 countries and regions have approved ADCETRIS in combination with AVD for the treatment of patients with previously untreated Stage III or IV Hodgkin lymphoma. The U.S. Food and Drug Administration (FDA) approved ADCETRIS in combination with AVD for the treatment of adult patients with previously untreated stage III or IV classical Hodgkin lymphoma in March 2018, based on the results of the ECHELON-1 phase 3 clinical trial in which the primary endpoint was modified PFS. In February 2019, the European Commission (EC) approved ADCETRIS for the treatment of adult patients with previously untreated CD30+ Stage IV Hodgkin lymphoma in combination with AVD.\n\nAn Exploratory Analysis of Brentuximab Vedotin plus CHP (A+CHP) in the Frontline Treatment of Patients with CD30+ Peripheral T-Cell Lymphomas (ECHELON-2): Impact of Consolidative Stem Cell Transplant (Abstract #464, oral presentation on Sunday, December 8, 2019)\n\nAs previously reported, the ECHELON-2 trial met its primary endpoint with the combination of ADCETRIS plus CHP resulting in a statistically significant improvement in PFS versus the control arm of CHOP per blinded independent central review (HR, 0.71; p=0.0110). In addition, the overall survival benefit in the ADCETRIS plus CHP arm was statistically significant compared to CHOP (HR, 0.66; p=0.0244). A post-hoc exploratory analysis evaluated the impact of consolidative stem cell transplant in the ECHELON-2 study for the patients who achieved CR treated with ADCETRIS plus CHP. In the ADCETRIS plus CHP arm, this included 38 patients in CR who received a stem cell transplant and 76 patients in CR who did not. Key findings of this analysis include:\n\nAbout Classical Hodgkin Lymphoma\n\nLymphoma is a general term for a group of cancers that originate in the lymphatic system. There are two major categories of lymphoma: Hodgkin lymphoma and non-Hodgkin lymphoma. Classical Hodgkin lymphoma is distinguished from other types of lymphoma by the presence of one characteristic type of cell, known as the Reed-Sternberg cell. The Reed-Sternberg cell expresses CD30.\n\nAccording to the American Cancer Society, approximately 8,110 cases of Hodgkin lymphoma will be diagnosed in the United States during 2019 and 1,000 will die from the disease. Approximately half of all newly diagnosed Hodgkin lymphoma patients have Stage III/IV disease. According to the Lymphoma Coalition, over 62,000 people worldwide are diagnosed with Hodgkin lymphoma each year and approximately 25,000 people die each year from this cancer.\n\nAbout T-Cell Lymphomas\n\nThere are more than 60 subtypes of non-Hodgkin lymphomas which are broadly divided into two major groups: B-cell lymphomas, which develop from abnormal B-lymphocytes, and T-cell lymphomas, which develop from abnormal T-lymphocytes. There are many different forms of T-cell lymphomas, some of which are extremely rare. T-cell lymphomas can be aggressive (fast-growing) or indolent (slow-growing). PTCL accounts for approximately 10 percent of non-Hodgkin lymphoma cases in the U.S. and Europe and may be as high as 24 percent in parts of Asia.\n\nAbout ADCETRIS \n\nADCETRIS is being evaluated broadly in more than 70 clinical trials in CD30-expressing lymphomas. These include three completed phase 3 trials: ECHELON-2 trial in frontline peripheral T-cell lymphomas, ECHELON-1 in previously untreated Hodgkin lymphoma, and ALCANZA in cutaneous T-cell lymphoma.\n\nADCETRIS is an ADC comprising an anti-CD30 monoclonal antibody attached by a protease-cleavable linker to a microtubule disrupting agent, monomethyl auristatin E (MMAE), utilizing Seattle Genetics’ proprietary technology. The ADC employs a linker system that is designed to be stable in the bloodstream but to release MMAE upon internalization into CD30-expressing tumor cells.\n\nADCETRIS injection for intravenous infusion has received FDA approval for six indications in adult patients with: (1) previously untreated systemic anaplastic large cell lymphoma (sALCL) or other CD30-expressing peripheral T-cell lymphomas (PTCL), including angioimmunoblastic T-cell lymphoma and PTCL not otherwise specified, in combination with cyclophosphamide, doxorubicin, and prednisone, (2) previously untreated Stage III or IV classical Hodgkin lymphoma (cHL), in combination with doxorubicin, vinblastine, and dacarbazine, (3) cHL at high risk of relapse or progression as post-autologous hematopoietic stem cell transplantation (auto-HSCT) consolidation, (4) cHL after failure of auto-HSCT or failure of at least two prior multi-agent chemotherapy regimens in patients who are not auto-HSCT candidates, (5) sALCL after failure of at least one prior multi-agent chemotherapy regimen, and (6) primary cutaneous anaplastic large cell lymphoma (pcALCL) or CD30-expressing mycosis fungoides (MF) who have received prior systemic therapy.\n\nHealth Canada granted ADCETRIS approval with conditions in 2013 for patients with (1) HL after failure of autologous stem cell transplant (ASCT) or after failure of at least two multi-agent chemotherapy regimens in patients who are not ASCT candidates and (2) sALCL after failure of at least one multi-agent chemotherapy regimen. Non-conditional approval was granted for (3) post-ASCT consolidation treatment of patients with HL at increased risk of relapse or progression in 2017, (4) adult patients with pcALCL or CD30-expressing MF who have received prior systemic therapy in 2018, (5) for previously untreated patients with Stage IV HL in combination with doxorubicin, vinblastine, and dacarbazine in 2019, and (6) for previously untreated adult patients with sALCL, peripheral T-cell lymphoma-not otherwise specified (PTCL-NOS) or angioimmunoblastic T-cell lymphoma (AITL), whose tumors express CD30, in combination with cyclophosphamide, doxorubicin, prednisone in 2019.\n\nADCETRIS received conditional marketing authorization from the European Commission in October 2012. The approved indications in Europe are: (1) for the treatment of adult patients with relapsed or refractory CD30-positive Hodgkin lymphoma following ASCT, or following at least two prior therapies when ASCT or multi-agent chemotherapy is not a treatment option, (2) for the treatment of adult patients with relapsed or refractory sALCL, (3) for the treatment of adult patients with CD30-positive Hodgkin lymphoma at increased risk of relapse or progression following ASCT, (4) for the treatment of adult patients with CD30-positive cutaneous T-cell lymphoma (CTCL) after at least one prior systemic therapy and (5) for the treatment of adult patients with previously untreated CD30-positive Stage IV Hodgkin lymphoma in combination with AVD (Adriamycin®, vinblastine and dacarbazine).\n\nADCETRIS has received marketing authorization by regulatory authorities in 73 countries for relapsed or refractory Hodgkin lymphoma and sALCL. See select important safety information, including Boxed Warning, below.\n\nSeattle Genetics and Takeda are jointly developing ADCETRIS. Under the terms of the collaboration agreement, Seattle Genetics has U.S. and Canadian commercialization rights and Takeda has rights to commercialize ADCETRIS in the rest of the world. Seattle Genetics and Takeda are funding joint development costs for ADCETRIS on a 50:50 basis, except in Japan where Takeda is solely responsible for development costs.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is an emerging multi-product, global biotechnology company that develops and commercializes transformative therapies targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) utilizes the company’s industry-leading antibody-drug conjugate (ADC) technology and is currently approved for the treatment of multiple CD30-expressing lymphomas. Beyond ADCETRIS, the company has a late-stage pipeline including enfortumab vedotin for metastatic urothelial cancer, currently being reviewed for approval by the FDA, and tisotumab vedotin in clinical trials for metastatic cervical cancer, which utilize our proprietary ADC technology. In addition, tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer and in clinical development for metastatic colorectal cancer. We are also leveraging our expertise in empowered antibodies to build a portfolio of proprietary immuno-oncology agents in clinical trials targeting hematologic malignancies and solid tumors. The company is headquartered in Bothell, Washington, and has a European office in Switzerland. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nAbout Takeda Pharmaceutical Company \n\nTakeda Pharmaceutical Company Limited (TSE:4502/NYSE:TAK) is a global, values-based, R&D-driven biopharmaceutical leader headquartered in Japan, committed to bringing Better Health and a Brighter Future to patients by translating science into highly-innovative medicines. Takeda focuses its R&D efforts on four therapeutic areas: Oncology, Rare Diseases, Neuroscience and Gastroenterology (GI). We also make targeted R&D investments in Plasma-Derived Therapies and Vaccines. We are focusing on developing highly innovative medicines that contribute to making a difference in people's lives by advancing the frontier of new treatment options and leveraging our enhanced collaborative R&D engine and capabilities to create a robust, modality-diverse pipeline. Our employees are committed to improving quality of life for patients and to working with our partners in health care in approximately 80 countries.\n\nFor more information, visit https://www.takeda.com\n\nADCETRIS (brentuximab vedotin) U.S. Important Safety Information\n\nBOXED WARNING\n\nPROGRESSIVE MULTIFOCAL LEUKOENCEPHALOPATHY (PML): JC virus infection resulting in PML and death can occur in ADCETRIS-treated patients.\n\nContraindication\n\nADCETRIS concomitant with bleomycin due to pulmonary toxicity (e.g., interstitial infiltration and/or inflammation).\n\nWarnings and Precautions\n\nMost Common (≥20% in any study) Adverse Reactions: Peripheral neuropathy, fatigue, nausea, diarrhea, neutropenia, upper respiratory tract infection, pyrexia, constipation, vomiting, alopecia, decreased weight, abdominal pain, anemia, stomatitis, lymphopenia and mucositis.\n\nDrug Interactions\n\nConcomitant use of strong CYP3A4 inhibitors or inducers has the potential to affect the exposure to monomethyl auristatin E (MMAE).\n\nUse in Specific Populations\n\nModerate or severe hepatic impairment or severe renal impairment: MMAE exposure and adverse reactions are increased. Avoid use.\n\nAdvise males with female sexual partners of reproductive potential to use effective contraception during ADCETRIS treatment and for at least 6 months after the final dose of ADCETRIS.\n\nAdvise patients to report pregnancy immediately and avoid breastfeeding while receiving ADCETRIS.\n\nPlease see the full Prescribing Information, including BOXED WARNING, for ADCETRIS here.\n\nADCETRIS (brentuximab vedotin) Important Safety Information (European Union)\n\nPlease refer to Summary of Product Characteristics (SmPC) before prescribing.\n\nCONTRAINDICATIONS\n\nADCETRIS is contraindicated for patients with hypersensitivity to brentuximab vedotin and its excipients. In addition, combined use of ADCETRIS with bleomycin causes pulmonary toxicity.\n\nSPECIAL WARNINGS & PRECAUTIONS\n\nProgressive multifocal leukoencephalopathy (PML): John Cunningham virus (JCV) reactivation resulting in progressive multifocal leukoencephalopathy (PML) and death can occur in patients treated with ADCETRIS. PML has been reported in patients who received ADCETRIS after receiving multiple prior chemotherapy regimens. PML is a rare demyelinating disease of the central nervous system that results from reactivation of latent JCV and is often fatal.\n\nClosely monitor patients for new or worsening neurological, cognitive, or behavioral signs or symptoms, which may be suggestive of PML. Suggested evaluation of PML includes neurology consultation, gadolinium-enhanced magnetic resonance imaging of the brain, and cerebrospinal fluid analysis for JCV DNA by polymerase chain reaction or a brain biopsy with evidence of JCV. A negative JCV PCR does not exclude PML. Additional follow up and evaluation may be warranted if no alternative diagnosis can be established Hold dosing for any suspected case of PML and permanently discontinue ADCETRIS if a diagnosis of PML is confirmed.\n\nBe alert to PML symptoms that the patient may not notice (e.g., cognitive, neurological, or psychiatric symptoms).\n\nPancreatitis: Acute pancreatitis has been observed in patients treated with ADCETRIS. Fatal outcomes have been reported. Closely monitor patients for new or worsening abdominal pain, which may be suggestive of acute pancreatitis. Patient evaluation may include physical examination, laboratory evaluation for serum amylase and serum lipase, and abdominal imaging, such as ultrasound and other appropriate diagnostic measures. Hold ADCETRIS for any suspected case of acute pancreatitis. ADCETRIS should be discontinued if a diagnosis of acute pancreatitis is confirmed.\n\nPulmonary Toxicity: Cases of pulmonary toxicity, some with fatal outcomes, including pneumonitis, interstitial lung disease, and acute respiratory distress syndrome (ARDS), have been reported in patients receiving ADCETRIS. Although a causal association with ADCETRIS has not been established, the risk of pulmonary toxicity cannot be ruled out. Promptly evaluate and treat new or worsening pulmonary symptoms (e.g., cough, dyspnoea) appropriately. Consider holding dosing during evaluation and until symptomatic improvement.\n\nSerious infections and opportunistic infections: Serious infections such as pneumonia, staphylococcal bacteremia, sepsis/septic shock (including fatal outcomes), and herpes zoster, and opportunistic infections such as Pneumocystis jiroveci pneumonia and oral candidiasis have been reported in patients treated with ADCETRIS. Carefully monitor patients during treatment for emergence of possible serious and opportunistic infections.\n\nInfusion-related reactions (IRR): Immediate and delayed IRR, as well as anaphylaxis, have been reported with ADCETRIS. Carefully monitor patients during and after an infusion. If anaphylaxis occurs, immediately and permanently discontinue administration of ADCETRIS and administer appropriate medical therapy. If an IRR occurs, interrupt the infusion and institute appropriate medical management. The infusion may be restarted at a slower rate after symptom resolution. Patients who have experienced a prior IRR should be premedicated for subsequent infusions. IRRs are more frequent and more severe in patients with antibodies to ADCETRIS.\n\nTumor lysis syndrome (TLS): TLS has been reported with ADCETRIS. Patients with rapidly proliferating tumor and high tumor burden are at risk of TLS. Monitor these patients closely and manage according to best medical practice.\n\nPeripheral neuropathy (PN): ADCETRIS treatment may cause PN, both sensory and motor. ADCETRIS-induced PN is typically an effect of cumulative exposure to ADCETRIS and is reversible in most cases. Monitor patients for symptoms of neuropathy, such as hypoesthesia, hyperesthesia, paresthesia, discomfort, a burning sensation, neuropathic pain, or weakness. Patients experiencing new or worsening PN may require a delay and a dose reduction or discontinuation of ADCETRIS.\n\nHematological toxicities: Grade 3 or Grade 4 anemia, thrombocytopenia, and prolonged (equal to or greater than one week) Grade 3 or Grade 4 neutropenia can occur with ADCETRIS. Monitor complete blood counts prior to administration of each dose.\n\nFebrile neutropenia: Febrile neutropenia has been reported with ADCETRIS. Complete blood counts should be monitored prior to administration of each dose of treatment. Closely monitor patients for fever and manage according to best medical practice if febrile neutropenia develops.\n\nWhen ADCETRIS is administered in combination with AVD, primary prophylaxis with G-CSF is recommended for all patients beginning with the first dose.\n\nStevens-Johnson syndrome (SJS): SJS and toxic epidermal necrolysis (TEN) have been reported with ADCETRIS. Fatal outcomes have been reported. Discontinue treatment with ADCETRIS if SJS or TEN occurs and administer appropriate medical therapy.\n\nGastrointestinal (GI) Complications: GI complications, some with fatal outcomes, including intestinal obstruction, ileus, enterocolitis, neutropenic colitis, erosion, ulcer, perforation and haemorrhage, have been reported with ADCETRIS. Promptly evaluate and treat patients if new or worsening GI symptoms occur.\n\nHepatotoxicity: Elevations in alanine aminotransferase (ALT) and aspartate aminotransferase (AST) have been reported with ADCETRIS. Serious cases of hepatotoxicity, including fatal outcomes, have also occurred. Pre-existing liver disease, comorbidities, and concomitant medications may also increase the risk. Test liver function prior to treatment initiation and routinely monitor during treatment. Patients experiencing hepatotoxicity may require a delay, dose modification, or discontinuation of ADCETRIS.\n\nHyperglycemia: Hyperglycemia has been reported during trials in patients with an elevated body mass index (BMI) with or without a history of diabetes mellitus. Closely monitor serum glucose for patients who experiences an event of hyperglycemia. Administer anti-diabetic treatment as appropriate.\n\nRenal and Hepatic Impairment: There is limited experience in patients with renal and hepatic impairment. Available data indicate that MMAE clearance might be affected by severe renal impairment, hepatic impairment, and by low serum albumin concentrations.\n\nCD30+ CTCL: The size of the treatment effect in CD30 + CTCL subtypes other than mycosis fungoides (MF) and primary cutaneous anaplastic large cell lymphoma (pcALCL) is not clear due to lack of high level evidence. In two single arm phase II studies of ADCETRIS, disease activity has been shown in the subtypes Sézary syndrome (SS), lymphomatoid papulosis (LyP) and mixed CTCL histology. These data suggest that efficacy and safety can be extrapolated to other CTCL CD30+ subtypes. Carefully consider the benefit-risk per patient and use with caution in other CD30+ CTCL patient types.\n\nSodium content in excipients: This medicinal product contains 13.2 mg sodium per vial, equivalent to 0.7% of the WHO recommended maximum daily intake of 2 g sodium for an adult.\n\nINTERACTIONS\n\nPatients who are receiving a strong CYP3A4 and P-gp inhibitor, concomitantly with ADCETRIS may have an increased risk of neutropenia. If neutropenia develops, refer to dosing recommendations for neutropenia (see SmPC section 4.2). Co-administration of ADCETRIS with a CYP3A4 inducer did not alter the plasma exposure of ADCETRIS, but it appeared to reduce plasma concentrations of MMAE metabolites that could be assayed. ADCETRIS is not expected to alter the exposure to drugs that are metabolized by CYP3A4 enzymes.\n\nPREGNANCY: Advise women of childbearing potential to use two methods of effective contraception during treatment with ADCETRIS and until 6 months after treatment. There are no data from the use of ADCETRIS in pregnant women, although studies in animals have shown reproductive toxicity. Do not use ADCETRIS during pregnancy unless the benefit to the mother outweighs the potential risks to the fetus.\n\nLACTATION (breast-feeding): There are no data as to whether ADCETRIS or its metabolites are excreted in human milk, therefore a risk to the newborn/infant cannot be excluded. With the potential risk, a decision should be made whether to discontinue breast-feeding or discontinue/abstain from therapy with ADCETRIS.\n\nFERTILITY: In nonclinical studies, ADCETRIS treatment has resulted in testicular toxicity, and may alter male fertility. Advise men being treated with ADCETRIS not to father a child during treatment and for up to 6 months following the last dose.\n\nEffects on ability to drive and use machines: ADCETRIS may have a moderate influence on the ability to drive and use machines.\n\nUNDESIRABLE EFFECTS\n\nMonotherapy: The most frequent adverse reactions (≥10%) were infections, peripheral sensory neuropathy, nausea, fatigue, diarrhoea, pyrexia, upper respiratory tract infection, neutropenia, rash, cough, vomiting, arthralgia, peripheral motor neuropathy, infusion-related reactions, pruritus, constipation, dyspnoea, weight decreased, myalgia and abdominal pain. Serious adverse drug reactions occurred in 12% of patients. The frequency of unique serious adverse drug reactions was ≤1%. Adverse events led to treatment discontinuation in 24% of patients.\n\nCombination Therapy: In the study of ADCETRIS as combination therapy with AVD in 662 patients with previously untreated advanced Hodgkin lymphoma, the most common adverse reactions (≥ 10%) were: neutropenia, nausea, constipation, vomiting, fatigue, peripheral sensory neuropathy, diarrhoea, pyrexia, alopecia, peripheral motor neuropathy, decreased weight, abdominal pain, anaemia, stomatitis, febrile neutropenia, bone pain, insomnia, decreased appetite, cough, headache, arthralgia, back pain, dyspnoea, myalgia, upper respiratory tract infection, alanine aminotransferase increased. Serious adverse reactions occurred in 36% of patients. Serious adverse reactions occurring in ≥ 3% of patients included febrile neutropenia (17%), pyrexia (6%), and neutropenia (3%). Adverse events led to treatment discontinuation in 13% of patients.\n\nSeattle Genetics Forward-Looking Statements\n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the therapeutic potential of ADCETRIS for patients with previously untreated stage III or IV classical Hodgkin lymphoma and patients with previously untreated systemic anaplastic large cell lymphoma (sALCL) or other CD30-expressing peripheral T-cell lymphomas (PTCL). Actual results or developments may differ materially from those projected or implied in these forward-looking statements due to factors such as utilization and adoption of the approved treatment regimen by prescribing physicians, competitive conditions including the availability of alternative treatment regimens, the availability and extent of reimbursement, the risk of adverse events and adverse regulatory action. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nTakeda Important Notice\n\nFor the purposes of this notice, “press release” means this document, any oral presentation, any question and answer session and any written or oral material discussed or distributed by Takeda Pharmaceutical Company Limited (“Takeda”) regarding this release. This press release (including any oral briefing and any question-and-answer in connection with it) is not intended to, and does not constitute, represent or form part of any offer, invitation or solicitation of any offer to purchase, otherwise acquire, subscribe for, exchange, sell or otherwise dispose of, any securities or the solicitation of any vote or approval in any jurisdiction. No shares or other securities are being offered to the public by means of this press release. No offering of securities shall be made in the United States except pursuant to registration under the U.S. Securities Act of 1933, as amended, or an exemption therefrom. This press release is being given (together with any further information which may be provided to the recipient) on the condition that it is for use by the recipient for information purposes only (and not for the evaluation of any investment, acquisition, disposal or any other transaction). Any failure to comply with these restrictions may constitute a violation of applicable securities laws.\n\nThe companies in which Takeda directly and indirectly owns investments are separate entities. In this press release, “Takeda” is sometimes used for convenience where references are made to Takeda and its subsidiaries in general. Likewise, the words “we”, “us” and “our” are also used to refer to subsidiaries in general or to those who work for them. These expressions are also used where no useful purpose is served by identifying the particular company or companies.\n\nTakeda Forward-Looking Statements\n\nThis press release and any materials distributed in connection with this press release may contain forward-looking statements, beliefs or opinions regarding Takeda’s future business, future position and results of operations, including estimates, forecasts, targets and plans for Takeda. Without limitation, forward-looking statements often include words such as “targets”, “plans”, “believes”, “hopes”, “continues”, “expects”, “aims”, “intends”, “ensures”, “will”, “may”, “should”, “would”, “could” “anticipates”, “estimates”, “projects” or similar expressions or the negative thereof. Forward-looking statements in this document are based on Takeda’s estimates and assumptions only as of the date hereof. Such forward-looking statements do not represent any guarantee by Takeda or its management of future performance and involve known and unknown risks, uncertainties and other factors, including but not limited to: the economic circumstances surrounding Takeda’s global business, including general economic conditions in Japan and the United States; competitive pressures and developments; changes to applicable laws and regulations; the success of or failure of product development programs; decisions of regulatory authorities and the timing thereof; fluctuations in interest and currency exchange rates; claims or concerns regarding the safety or efficacy of marketed products or product candidates; the timing and impact of post-merger integration efforts with acquired companies; and the ability to divest assets that are not core to Takeda’s operations and the timing of any such divestment(s), any of which may cause Takeda’s actual results, performance, achievements or financial position to be materially different from any future results, performance, achievements or financial position expressed or implied by such forward-looking statements. For more information on these and other factors which may affect Takeda’s results, performance, achievements, or financial position, see “Item 3. Key Information—D. Risk Factors” in Takeda’s most recent Annual Report on Form 20-F and Takeda’s other reports filed with the U.S. Securities and Exchange Commission, available on Takeda’s website at: https://www.takeda.com/investors/reports/sec-filings/ or at www.sec.gov. Future results, performance, achievements or financial position of Takeda could differ materially from those expressed in or implied by the forward-looking statements. Persons receiving this press release should not rely unduly on any forward-looking statements. Takeda undertakes no obligation to update any of the forward-looking statements contained in this press release or any other forward-looking statements it may make, except as required by law or stock exchange rule. Past performance is not an indicator of future results and the results of Takeda in this press release may not be indicative of, and are not an estimate, forecast or projection of Takeda’s future results.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005142/en/\nSeattle Genetics:\nMedia\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\n\nInvestors\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\n\nTakeda:\nJapanese Media\nKazumi Kobayashi\nkazumi.kobayashi@takeda.com\n+81 (0) 3-3278-2095\n\nMedia outside Japan\nSara Noonan\nsara.noonan@takeda.com\n+1-617-551-3683\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Announces Updated Data of ADCETRIS® (Brentuximab Vedotin) in Combination with OPDIVO® (Nivolumab) in Frontline and Relapsed or Refractory Hodgkin Lymphoma at ASH Annual Meeting",
        "subtitle": "",
        "date": "Dec 7, 2019 2:00PM EST",
        "content": "\n- Additional Analysis in Phase 2 Trial of ADCETRIS plus OPDIVO in Patients with Frontline Hodgkin Lymphoma Aged 60 Years and Older - \n\n- Two-Year Follow-up Results from Phase 1/2 Trial in Relapsed Hodgkin Lymphoma - \n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced updated and long-term follow-up analyses from two clinical trials evaluating ADCETRIS (brentuximab vedotin) and OPDIVO® (nivolumab) in frontline Hodgkin lymphoma (HL) patients aged 60 years and older and in relapsed or refractory classical HL. ADCETRIS is an antibody-drug conjugate (ADC) directed to CD30, a defining marker of classical HL. ADCETRIS and OPDIVO are not approved in combination for the treatment of HL. Results were presented today at the 61st American Society of Hematology (ASH) Annual Meeting and Exposition taking place December 7-10 in Orlando, Fla.\n\n“We continue to evaluate ADCETRIS in combination with novel therapies, such as checkpoint inhibitors, with the goal of identifying new options for CD30-expressing lymphomas where there is high unmet need,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “These data presentations at ASH reinforce our strong commitment to the ADCETRIS clinical development program, potentially moving into new patient populations and novel combination treatment strategies.”\n\nPhase 2 Study of Frontline Brentuximab Vedotin Plus Nivolumab in Patients with Hodgkin Lymphoma Aged ≥ 60 Years (Abstract #237, oral presentation at 2:30 p.m. ET on Saturday, December 7, 2019)\nData were presented from an updated analysis from the phase 2 clinical trial evaluating ADCETRIS in combination with OPDIVO as frontline therapy for HL patients aged 60 years and older. Data were reported from 21 patients, and the median age was 72 years. The majority of patients (76 percent) had stage III/IV disease at the time of diagnosis. These results will be highlighted in an oral presentation by Christopher A. Yasenchak, M.D., Willamette Valley Cancer Institute and Research Center/US Oncology Research, Ore., and include:\n\nTwo-Year Follow-up Results from the Phase 1-2 Study of Brentuximab Vedotin in Combination with Nivolumab in Patients with Relapsed or Refractory Classical Hodgkin Lymphoma (Abstract #238, oral presentation at 2:45 p.m. ET on Saturday, December 7, 2019)\nData were reported from 93 patients with relapsed or refractory classical HL after failure of frontline therapy who received the combination regimen of ADCETRIS plus OPDIVO. After completion of the fourth cycle of treatment, patients were eligible to undergo an autologous stem cell transplant (ASCT). The median age of patients was 34 years. These results will be highlighted in an oral presentation by Alison J. Moskowitz, M.D., Memorial Sloan Kettering Cancer Center, NY, and include:\n\nAbout Classical Hodgkin Lymphoma\nLymphoma is a general term for a group of cancers that originate in the lymphatic system. There are two major categories of lymphoma: Hodgkin lymphoma and non-Hodgkin lymphoma. Classical Hodgkin lymphoma is distinguished from other types of lymphoma by the presence of one characteristic type of cell, known as the Reed-Sternberg cell. The Reed-Sternberg cell expresses CD30.\n\nAccording to the American Cancer Society, approximately 8,110 cases of Hodgkin lymphoma will be diagnosed in the United States during 2019 and 1,000 will die from the disease. Approximately half of all newly diagnosed Hodgkin lymphoma patients have Stage III/IV disease. According to the Lymphoma Coalition, over 62,000 people worldwide are diagnosed with Hodgkin lymphoma each year and approximately 25,000 people die each year from this cancer.\n\nAbout ADCETRIS\nADCETRIS is being evaluated broadly in more than 70 clinical trials in CD30-expressing lymphomas. These include three completed phase 3 trials: ECHELON-2 trial in frontline peripheral T-cell lymphomas, ECHELON-1 in previously untreated Hodgkin lymphoma, and ALCANZA in cutaneous T-cell lymphoma.\n\nADCETRIS is an ADC comprising an anti-CD30 monoclonal antibody attached by a protease-cleavable linker to a microtubule disrupting agent, monomethyl auristatin E (MMAE), utilizing Seattle Genetics’ proprietary technology. The ADC employs a linker system that is designed to be stable in the bloodstream but to release MMAE upon internalization into CD30-expressing tumor cells.\n\nADCETRIS injection for intravenous infusion has received FDA approval for six indications in adult patients with: (1) previously untreated systemic anaplastic large cell lymphoma (sALCL) or other CD30-expressing peripheral T-cell lymphomas (PTCL), including angioimmunoblastic T-cell lymphoma and PTCL not otherwise specified, in combination with cyclophosphamide, doxorubicin, and prednisone, (2) previously untreated Stage III or IV classical Hodgkin lymphoma (cHL), in combination with doxorubicin, vinblastine, and dacarbazine, (3) cHL at high risk of relapse or progression as post-autologous hematopoietic stem cell transplantation (auto-HSCT) consolidation, (4) cHL after failure of auto-HSCT or failure of at least two prior multi-agent chemotherapy regimens in patients who are not auto-HSCT candidates, (5) sALCL after failure of at least one prior multi-agent chemotherapy regimen, and (6) primary cutaneous anaplastic large cell lymphoma (pcALCL) or CD30-expressing mycosis fungoides (MF) who have received prior systemic therapy.\n\nHealth Canada granted ADCETRIS approval with conditions in 2013 for patients with (1) HL after failure of autologous stem cell transplant (ASCT) or after failure of at least two multi-agent chemotherapy regimens in patients who are not ASCT candidates and (2) sALCL after failure of at least one multi-agent chemotherapy regimen. Non-conditional approval was granted for (3) post-ASCT consolidation treatment of patients with HL at increased risk of relapse or progression in 2017, (4) adult patients with pcALCL or CD30-expressing MF who have received prior systemic therapy in 2018, (5) for previously untreated patients with Stage IV HL in combination with doxorubicin, vinblastine, and dacarbazine in 2019, and (6) for previously untreated adult patients with sALCL, peripheral T-cell lymphoma-not otherwise specified (PTCL-NOS) or angioimmunoblastic T-cell lymphoma (AITL), whose tumors express CD30, in combination with cyclophosphamide, doxorubicin, prednisone in 2019.\n\nADCETRIS received conditional marketing authorization from the European Commission in October 2012. The approved indications in Europe are: (1) for the treatment of adult patients with relapsed or refractory CD30-positive Hodgkin lymphoma following ASCT, or following at least two prior therapies when ASCT or multi-agent chemotherapy is not a treatment option, (2) for the treatment of adult patients with relapsed or refractory sALCL, (3) for the treatment of adult patients with CD30-positive Hodgkin lymphoma at increased risk of relapse or progression following ASCT, (4) for the treatment of adult patients with CD30-positive cutaneous T-cell lymphoma (CTCL) after at least one prior systemic therapy and (5) for the treatment of adult patients with previously untreated CD30-positive Stage IV Hodgkin lymphoma in combination with AVD (Adriamycin®, vinblastine and dacarbazine).\n\nADCETRIS has received marketing authorization by regulatory authorities in 73 countries for relapsed or refractory Hodgkin lymphoma and sALCL. See select important safety information, including Boxed Warning, below.\n\nSeattle Genetics and Takeda are jointly developing ADCETRIS. Under the terms of the collaboration agreement, Seattle Genetics has U.S. and Canadian commercialization rights and Takeda has rights to commercialize ADCETRIS in the rest of the world. Seattle Genetics and Takeda are funding joint development costs for ADCETRIS on a 50:50 basis, except in Japan where Takeda is solely responsible for development costs.\n\nAbout Seattle Genetics\nSeattle Genetics, Inc. is an emerging multi-product, global biotechnology company that develops and commercializes transformative therapies targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) utilizes the company’s industry-leading antibody-drug conjugate (ADC) technology and is currently approved for the treatment of multiple CD30-expressing lymphomas. Beyond ADCETRIS, the company has a late-stage pipeline including enfortumab vedotin for metastatic urothelial cancer, currently being reviewed for approval by the FDA, and tisotumab vedotin in clinical trials for metastatic cervical cancer, which utilize our proprietary ADC technology. In addition, tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer and in clinical development for metastatic colorectal cancer. We are also leveraging our expertise in empowered antibodies to build a portfolio of proprietary immuno-oncology agents in clinical trials targeting hematologic malignancies and solid tumors. The company is headquartered in Bothell, Washington, and has a European office in Switzerland. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nADCETRIS (brentuximab vedotin) U.S. Important Safety Information\n\nBOXED WARNING\nPROGRESSIVE MULTIFOCAL LEUKOENCEPHALOPATHY (PML): JC virus infection resulting in PML and death can occur in ADCETRIS-treated patients.\n\nContraindication\nADCETRIS concomitant with bleomycin due to pulmonary toxicity (e.g., interstitial infiltration and/or inflammation).\n\nWarnings and Precautions\n\nMost Common (≥20% in any study) Adverse Reactions: Peripheral neuropathy, fatigue, nausea, diarrhea, neutropenia, upper respiratory tract infection, pyrexia, constipation, vomiting, alopecia, decreased weight, abdominal pain, anemia, stomatitis, lymphopenia and mucositis.\n\nDrug Interactions\nConcomitant use of strong CYP3A4 inhibitors or inducers has the potential to affect the exposure to monomethyl auristatin E (MMAE).\n\nUse in Specific Populations\nModerate or severe hepatic impairment or severe renal impairment: MMAE exposure and adverse reactions are increased. Avoid use.\n\nAdvise males with female sexual partners of reproductive potential to use effective contraception during ADCETRIS treatment and for at least 6 months after the final dose of ADCETRIS.\n\nAdvise patients to report pregnancy immediately and avoid breastfeeding while receiving ADCETRIS.\n\nPlease see the full Prescribing Information, including BOXED WARNING, for ADCETRIS here.\n\nForward Looking Statements\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the potential uses and benefits of ADCETRIS (brentuximab vedotin) in combination with OPDIVO® (nivolumab) in frontline Hodgkin lymphoma (HL) patients age 60 years or older and in relapsed or refractory classical HL under staggered and concurrent dosing schedules, the therapeutic potential of ADCETRIS in these indications and the company’s clinical development plans. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include potential lack of efficacy or risk of adverse events associated with the use of ADCETRIS in certain clinical settings and the difficulty and uncertainty of pharmaceutical product development. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nOpdivo® is a registered trademark of Bristol-Myers Squibb Company.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191207005021/en/\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\n\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics and Astellas Announce Clinical Trial Collaboration with Merck to Evaluate Enfortumab Vedotin in Combination with KEYTRUDA® (pembrolizumab) in Patients with Metastatic Urothelial Cancer",
        "subtitle": "- Companies to Initiate Phase 3 Trial to Support Global Registrations -",
        "date": "Dec 2, 2019 8:00AM EST",
        "content": " BOTHELL, Wash., and TOKYO, Dec. 2, 2019 /PRNewswire/ -- Seattle Genetics, Inc. (Nasdaq:SGEN) and Astellas Pharma Inc. (TSE: 4503, President and CEO: Kenji Yasukawa, Ph.D., \"Astellas\"), today announced a clinical collaboration agreement with Merck, known as MSD outside the United States and Canada through a subsidiary, to evaluate the combination of Seattle Genetics' and Astellas' antibody-drug conjugate (ADC) enfortumab vedotin and Merck's anti-PD-1 therapy, KEYTRUDA® (pembrolizumab), in patients with previously untreated metastatic urothelial cancer.Under the terms of the agreement, the three companies will conduct and fund a global, registrational phase 3 clinical trial to be led by Seattle Genetics. The trial will be designed to evaluate the efficacy of the combination of enfortumab vedotin and pembrolizumab in patients with previously untreated locally advanced or metastatic urothelial cancer. The companies are working in consultation with regulatory authorities to finalize the trial design and currently plan to initiate the trial in the first half of 2020. \"We look forward to initiating a randomized phase 3 trial in patients with previously untreated locally advanced or metastatic urothelial cancer,\" said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. \"Recent data from a phase 1b trial of enfortumab vedotin in combination with pembrolizumab showed evidence of clinical activity leading to the development of this phase 3 trial.\"\"An unmet medical need exists for previously untreated patients with metastatic urothelial cancer, and we are committed to studying enfortumab vedotin in combination with other agents in different stages of urothelial cancer,\" said Andrew Krivoshik, M.D., Ph.D., Senior Vice President and Oncology Therapeutic Area Head at Astellas. \"We look forward to further evaluating enfortumab vedotin and pembrolizumab in this high unmet need patient population.\" Enfortumab vedotin is currently under review by the U.S. Food and Drug Administration (FDA) for the treatment of adult patients with locally advanced or metastatic urothelial cancer who have received a PD-1/L1 inhibitor and who have received a platinum-containing chemotherapy in the neoadjuvant/adjuvant, locally advanced or metastatic setting. The PDUFA action date is March 15, 2020.KEYTRUDA® is a registered trademark of Merck Sharp & Dohme Corp., a subsidiary of Merck & Co., Inc., Kenilworth, NJ, USA.About Urothelial CancerUrothelial cancer is the most common type of bladder cancer (90 percent of cases).1 In 2019, more than 80,000 people will be diagnosed with bladder cancer in the United States. Globally, approximately 549,000 people were diagnosed with bladder cancer last year, and there were approximately 200,000 deaths worldwide.2About Enfortumab VedotinEnfortumab vedotin is an investigational ADC composed of an anti-Nectin-4 monoclonal antibody attached to a microtubule-disrupting agent, MMAE, using Seattle Genetics' proprietary linker technology. Enfortumab vedotin targets Nectin-4, a cell adhesion molecule that is expressed on many solid tumors, and that has been identified as an ADC target by Astellas.The safety and efficacy of enfortumab vedotin are under investigation and have not been established. There is no guarantee that the agent will receive regulatory approval or become commercially available for the uses being investigated. About Seattle Genetics Seattle Genetics, Inc. is an emerging multi-product, global biotechnology company that develops and commercializes transformative therapies targeting cancer to make a meaningful difference in people's lives. The company is headquartered in Bothell, Washington, and has a European office in Switzerland. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.About Astellas Astellas Pharma Inc., based in Tokyo, Japan, is a company dedicated to improving the health of people around the world through the provision of innovative and reliable pharmaceutical products. For more information, please visit our website at https://www.astellas.com/en About the Astellas and Seattle Genetics Collaboration Seattle Genetics and Astellas are co-developing enfortumab vedotin under a collaboration that was entered into in 2007 and expanded in 2009. Under the collaboration, the companies are sharing costs and profits on a 50:50 basis worldwide. Seattle Genetics Forward Looking Statements Certain statements made in this press release are forward looking, such as those, among others, relating to   clinical development plans including the proposed phase 3 trial of enfortumab vedotin in combination with pembrolizumab as a potential treatment option for previously untreated metastatic urothelial cancer; the therapeutic potential of enfortumab vedotin including its possible safety, efficacy, and therapeutic uses, including in previously untreated metastatic urothelial cancer, and the potential FDA approval of enfortumab vedotin for the treatment of patients with locally advanced or metastatic urothelial cancer who have received a PD-1/L1 inhibitor and who have received a platinum-containing chemotherapy in the neoadjuvant/adjuvant, locally advanced or metastatic setting. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that ongoing and subsequent clinical trials of enfortumab vedotin, including the proposed phase 3 trial of enfortumab vedotin in combination with pembrolizumab, may fail to establish sufficient efficacy; that adverse events or safety signals may occur; that adverse regulatory actions or other setbacks could occur as enfortumab vedotin advances in clinical trials even after promising results in earlier clinical trials; and that the Biologics License Application submission and any future potential supplemental Biologics License Application submissions for enfortumab vedotin may not be approved by the FDA in a timely manner or at all or with the requested label(s). More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption \"Risk Factors\" included in the company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.Astellas Cautionary NotesIn this press release, statements made with respect to current plans, estimates, strategies and beliefs and other statements that are not historical facts are forward-looking statements about the future performance of Astellas. These statements are based on management's current assumptions and beliefs in light of the information currently available to it and involve known and unknown risks and uncertainties. A number of factors could cause actual results to differ materially from those discussed in the forward-looking statements. Such factors include, but are not limited to: (i) changes in general economic conditions and in laws and regulations, relating to pharmaceutical markets, (ii) currency exchange rate fluctuations, (iii) delays in new product launches, (iv) the inability of Astellas to market existing and new products effectively, (v) the inability of Astellas to continue to effectively research and develop products accepted by customers in highly competitive markets, and (vi) infringements of Astellas' intellectual property rights by third parties.Information about pharmaceutical products (including products currently in development), which is included in this press release is not intended to constitute an advertisement or medical advice._____________________________1 American Society of Clinical Oncology. Bladder Cancer: Introduction (05-2019). https://www.cancer.net/cancer-types/bladder-cancer/introduction.2 International Agency for Research on Cancer. Cancer tomorrow: bladder. http://gco.iarc.fr/tomorrow. View original content to download multimedia:http://www.prnewswire.com/news-releases/seattle-genetics-and-astellas-announce-clinical-trial-collaboration-with-merck-to-evaluate-enfortumab-vedotin-in-combination-with-keytruda-pembrolizumab-in-patients-with-metastatic-urothelial-cancer-300967128.htmlSOURCE  Astellas Pharma Inc."
    },
    {
        "title": "Seattle Genetics and Astellas Announce Clinical Trial Collaboration with Merck to Evaluate Enfortumab Vedotin in Combination with KEYTRUDA® (pembrolizumab) in Patients with Metastatic Urothelial Cancer",
        "subtitle": "",
        "date": "Dec 2, 2019 8:00AM EST",
        "content": "\n- Companies to Initiate Phase 3 Trial to Support Global Registrations -\n    BOTHELL, Wash. & TOKYO--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) and Astellas Pharma Inc. (TSE: 4503, President and CEO: Kenji Yasukawa, Ph.D., “Astellas”), today announced a clinical collaboration agreement with Merck, known as MSD outside the United States and Canada through a subsidiary, to evaluate the combination of Seattle Genetics’ and Astellas’ antibody-drug conjugate (ADC) enfortumab vedotin and Merck’s anti-PD-1 therapy, KEYTRUDA® (pembrolizumab), in patients with previously untreated metastatic urothelial cancer.\n\nUnder the terms of the agreement, the three companies will conduct and fund a global, registrational phase 3 clinical trial to be led by Seattle Genetics. The trial will be designed to evaluate the efficacy of the combination of enfortumab vedotin and pembrolizumab in patients with previously untreated locally advanced or metastatic urothelial cancer. The companies are working in consultation with regulatory authorities to finalize the trial design and currently plan to initiate the trial in the first half of 2020.\n\n“We look forward to initiating a randomized phase 3 trial in patients with previously untreated locally advanced or metastatic urothelial cancer,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “Recent data from a phase 1b trial of enfortumab vedotin in combination with pembrolizumab showed evidence of clinical activity leading to the development of this phase 3 trial.”\n\n“An unmet medical need exists for previously untreated patients with metastatic urothelial cancer, and we are committed to studying enfortumab vedotin in combination with other agents in different stages of urothelial cancer,” said Andrew Krivoshik, M.D., Ph.D., Senior Vice President and Oncology Therapeutic Area Head at Astellas. “We look forward to further evaluating enfortumab vedotin and pembrolizumab in this high unmet need patient population.”\n\nEnfortumab vedotin is currently under review by the U.S. Food and Drug Administration (FDA) for the treatment of patients with locally advanced or metastatic urothelial cancer who have received a PD-1/L1 inhibitor and who have received a platinum-containing chemotherapy in the neoadjuvant/adjuvant, locally advanced or metastatic setting. The PDUFA action date is March 15, 2020.\n\nKEYTRUDA® is a registered trademark of Merck Sharp & Dohme Corp., a subsidiary of Merck & Co., Inc., Kenilworth, NJ, USA.\n\nAbout Urothelial Cancer\n\nUrothelial cancer is the most common type of bladder cancer (90 percent of cases).1 In 2019, more than 80,000 people will be diagnosed with bladder cancer in the United States. Globally, approximately 549,000 people were diagnosed with bladder cancer last year, and there were approximately 200,000 deaths worldwide.2\n\nAbout Enfortumab Vedotin\n\nEnfortumab vedotin is an investigational ADC composed of an anti-Nectin-4 monoclonal antibody attached to a microtubule-disrupting agent, MMAE, using Seattle Genetics’ proprietary linker technology. Enfortumab vedotin targets Nectin-4, a cell adhesion molecule that is expressed on many solid tumors, and that has been identified as an ADC target by Astellas.\n\nThe safety and efficacy of enfortumab vedotin are under investigation and have not been established. There is no guarantee that the agent will receive regulatory approval or become commercially available for the uses being investigated.\n\nAbout Seattle Genetics \n\nSeattle Genetics, Inc. is an emerging multi-product, global biotechnology company that develops and commercializes transformative therapies targeting cancer to make a meaningful difference in people’s lives. The company is headquartered in Bothell, Washington, and has a European office in Switzerland. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nAbout Astellas \n\nAstellas Pharma Inc., based in Tokyo, Japan, is a company dedicated to improving the health of people around the world through the provision of innovative and reliable pharmaceutical products. For more information, please visit our website at https://www.astellas.com/en\n\nAbout the Astellas and Seattle Genetics Collaboration \n\nSeattle Genetics and Astellas are co-developing enfortumab vedotin under a collaboration that was entered into in 2007 and expanded in 2009. Under the collaboration, the companies are sharing costs and profits on a 50:50 basis worldwide.\n\nSeattle Genetics Forward Looking Statements \n\nCertain statements made in this press release are forward looking, such as those, among others, relating to clinical development plans including the proposed phase 3 trial of enfortumab vedotin in combination with pembrolizumab as a potential treatment option for previously untreated metastatic urothelial cancer; the therapeutic potential of enfortumab vedotin including its possible safety, efficacy, and therapeutic uses, including in previously untreated metastatic urothelial cancer, and the potential FDA approval of enfortumab vedotin for the treatment of patients with locally advanced or metastatic urothelial cancer who have received a PD-1/L1 inhibitor and who have received a platinum-containing chemotherapy in the neoadjuvant/adjuvant, locally advanced or metastatic setting. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include the possibility that ongoing and subsequent clinical trials of enfortumab vedotin, including the proposed phase 3 trial of enfortumab vedotin in combination with pembrolizumab, may fail to establish sufficient efficacy; that adverse events or safety signals may occur; that adverse regulatory actions or other setbacks could occur as enfortumab vedotin advances in clinical trials even after promising results in earlier clinical trials; and that the Biologics License Application submission and any future potential supplemental Biologics License Application submissions for enfortumab vedotin may not be approved by the FDA in a timely manner or at all or with the requested label(s). More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nAstellas Cautionary Notes\n\nIn this press release, statements made with respect to current plans, estimates, strategies and beliefs and other statements that are not historical facts are forward-looking statements about the future performance of Astellas. These statements are based on management’s current assumptions and beliefs in light of the information currently available to it and involve known and unknown risks and uncertainties. A number of factors could cause actual results to differ materially from those discussed in the forward-looking statements. Such factors include, but are not limited to: (i) changes in general economic conditions and in laws and regulations, relating to pharmaceutical markets, (ii) currency exchange rate fluctuations, (iii) delays in new product launches, (iv) the inability of Astellas to market existing and new products effectively, (v) the inability of Astellas to continue to effectively research and develop products accepted by customers in highly competitive markets, and (vi) infringements of Astellas’ intellectual property rights by third parties.\n\nInformation about pharmaceutical products (including products currently in development), which is included in this press release is not intended to constitute an advertisement or medical advice.\n\n1 American Society of Clinical Oncology. Bladder Cancer: Introduction (05-2019). https://www.cancer.net/cancer-types/bladder-cancer/introduction.\n2 International Agency for Research on Cancer. Cancer tomorrow: bladder. http://gco.iarc.fr/tomorrow.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005357/en/\nSeattle Genetics Contacts:\nFor Media\nMonique Greer\nVice President, Corporate Communications\n(425) 527-4641\nmgreer@seagen.com\n\n\nFor Investors\nPeggy Pinkston\nVice President, Investor Relations\n(425) 527-4160\nppinkston@seagen.com\n\n\nAstellas Contacts:\nFor Media\nMarjorie Moeling\nDirector, Corporate Affairs\n(224) 205-5205\nmarjorie.moeling@astellas.com\n\n\nFor Investors\nShin Okubo\nExecutive Director, Investor Relations\n+81-3-3244-3202\nshin.ohkubo@astellas.com\nSource: Seattle Genetics, Inc."
    },
    {
        "title": "Seattle Genetics Announces Health Canada Approval of ADCETRIS® (Brentuximab Vedotin) in Combination with Chemotherapy in Frontline CD30-Expressing Peripheral T-Cell Lymphoma",
        "subtitle": "",
        "date": "Nov 25, 2019 8:00AM EST",
        "content": "\n- Approval of Supplemental New Drug Submission for ADCETRIS in Combination with CHP Chemotherapy in Frontline CD30-Expressing Peripheral T-Cell Lymphoma based on Positive Phase 3 ECHELON-2 Clinical Trial Results -\n    BOTHELL, Wash.--(BUSINESS WIRE)--\nSeattle Genetics, Inc. (Nasdaq:SGEN) today announced that Health Canada has approved the supplemental New Drug Submission that expands the use of ADCETRIS (brentuximab vedotin) in combination with CHP (cyclophosphamide, doxorubicin, prednisone) chemotherapy for the treatment of previously untreated adult patients with systemic anaplastic large cell lymphoma (sALCL), peripheral T-cell lymphoma-not otherwise specified (PTCL-NOS) or angioimmunoblastic T-cell lymphoma (AITL), whose tumours express CD30. The approval is based on positive results of the phase 3 ECHELON-2 clinical trial that compared ADCETRIS plus CHP to CHOP (cyclophosphamide, doxorubicin, vincristine, prednisone). Health Canada granted a Priority Review Designation for this submission. ADCETRIS is an antibody-drug conjugate (ADC) directed to CD30, which is expressed on the surface of several types of PTCL.\n\n“The Health Canada approval of ADCETRIS (brentuximab vedotin) in combination with CHP chemotherapy in newly diagnosed CD30-expressing peripheral T-cell lymphoma represents the first major advance for Canadian patients with PTCL in decades,” said Kerry Savage, M.D., Medical Oncologist at the BC Cancer Agency, Professor of Medicine at the University of British Columbia and investigator on the ECHELON-2 clinical trial. “The approval is based on the ECHELON-2 clinical trial that demonstrated ADCETRIS (brentuximab vedotin) plus CHP regimen was superior for both progression-free survival and all key secondary endpoints, including overall survival, when compared to the standard of care CHOP chemotherapy.”\n\n“The current standard of care for initial treatment of peripheral T-cell lymphoma is multi-agent chemotherapy, which results in low complete remission rates and poor progression-free and overall survival. ECHELON-2 is the first randomized trial to demonstrate an overall survival benefit over established standard therapy, making it a meaningful advance in the treatment of these rare lymphomas,” said Roger Dansey, M.D., Chief Medical Officer at Seattle Genetics. “With this new indication for ADCETRIS, physicians and eligible patients in Canada now have access to this important new regimen for treating frontline CD30-expressing peripheral T-cell lymphoma, another milestone supporting our plans to continue to expand ADCETRIS globally to patients in need.”\n\nIn May 2019, Health Canada approved the supplemental New Drug Submission that expanded the use of ADCETRIS in combination with AVD (Adriamycin, vinblastine and dacarbazine) chemotherapy in patients with previously untreated Stage IV Hodgkin lymphoma (HL) based on the results of the phase 3 ECHELON-1 clinical trial.\n\nAbout T-Cell Lymphomas\n\nThere are more than 60 subtypes of non-Hodgkin lymphomas which are broadly divided into two major groups: B-cell lymphomas, which develop from abnormal B-lymphocytes, and T-cell lymphomas, which develop from abnormal T-lymphocytes. There are many different forms of T-cell lymphomas, some of which are extremely rare. T-cell lymphomas can be aggressive (fast-growing) or indolent (slow-growing). PTCL accounts for approximately 10 percent of non-Hodgkin lymphoma cases in the U.S. and Europe and may be as high as 24 percent in parts of Asia.\n\nAbout ADCETRIS \n\nADCETRIS is being evaluated broadly in more than 70 clinical trials in CD30-expressing lymphomas. These include three completed phase 3 trials: ECHELON-2 trial in frontline peripheral T-cell lymphomas, ECHELON-1 in previously untreated Hodgkin lymphoma, and ALCANZA in cutaneous T-cell lymphoma.\n\nADCETRIS is an ADC comprising an anti-CD30 monoclonal antibody attached by a protease-cleavable linker to a microtubule disrupting agent, monomethyl auristatin E (MMAE), utilizing Seattle Genetics’ proprietary technology. The ADC employs a linker system that is designed to be stable in the bloodstream but to release MMAE upon internalization into CD30-expressing tumor cells.\n\nADCETRIS injection for intravenous infusion has received FDA approval for six indications in adult patients with: (1) previously untreated systemic anaplastic large cell lymphoma (sALCL) or other CD30-expressing peripheral T-cell lymphomas (PTCL), including angioimmunoblastic T-cell lymphoma and PTCL not otherwise specified, in combination with cyclophosphamide, doxorubicin, and prednisone, (2) previously untreated Stage III or IV classical Hodgkin lymphoma (cHL), in combination with doxorubicin, vinblastine, and dacarbazine, (3) cHL at high risk of relapse or progression as post-autologous hematopoietic stem cell transplantation (auto-HSCT) consolidation, (4) cHL after failure of auto-HSCT or failure of at least two prior multi-agent chemotherapy regimens in patients who are not auto-HSCT candidates, (5) sALCL after failure of at least one prior multi-agent chemotherapy regimen, and (6) primary cutaneous anaplastic large cell lymphoma (pcALCL) or CD30-expressing mycosis fungoides (MF) who have received prior systemic therapy.\n\nHealth Canada granted ADCETRIS approval with conditions in 2013 for patients with (1) HL after failure of autologous stem cell transplant (ASCT) or after failure of at least two multi-agent chemotherapy regimens in patients who are not ASCT candidates and (2) sALCL after failure of at least one multi-agent chemotherapy regimen. Non-conditional approval was granted for (3) post-ASCT consolidation treatment of patients with HL at increased risk of relapse or progression in 2017, (4) adult patients with pcALCL or CD30-expressing MF who have received prior systemic therapy in 2018, (5) for previously untreated patients with Stage IV HL in combination with doxorubicin, vinblastine, and dacarbazine in 2019, and (6) for previously untreated adult patients with sALCL, peripheral T-cell lymphoma-not otherwise specified (PTCL-NOS) or angioimmunoblastic T-cell lymphoma (AITL), whose tumors express CD30, in combination with cyclophosphamide, doxorubicin, prednisone in 2019.\n\nADCETRIS received conditional marketing authorization from the European Commission in October 2012. The approved indications in Europe are: (1) for the treatment of adult patients with relapsed or refractory CD30-positive Hodgkin lymphoma following ASCT, or following at least two prior therapies when ASCT or multi-agent chemotherapy is not a treatment option, (2) for the treatment of adult patients with relapsed or refractory sALCL, (3) for the treatment of adult patients with CD30-positive Hodgkin lymphoma at increased risk of relapse or progression following ASCT, (4) for the treatment of adult patients with CD30-positive cutaneous T-cell lymphoma (CTCL) after at least one prior systemic therapy and (5) for the treatment of adult patients with previously untreated CD30-positive Stage IV Hodgkin lymphoma in combination with AVD (Adriamycin®, vinblastine and dacarbazine).\n\nADCETRIS has received marketing authorization by regulatory authorities in 73 countries for relapsed or refractory Hodgkin lymphoma and sALCL. See select important safety information, including Boxed Warning, below.\n\nSeattle Genetics and Takeda are jointly developing ADCETRIS. Under the terms of the collaboration agreement, Seattle Genetics has U.S. and Canadian commercialization rights and Takeda has rights to commercialize ADCETRIS in the rest of the world. Seattle Genetics and Takeda are funding joint development costs for ADCETRIS on a 50:50 basis, except in Japan where Takeda is solely responsible for development costs.\n\nAbout Seattle Genetics\n\nSeattle Genetics, Inc. is an emerging multi-product, global biotechnology company that develops and commercializes transformative therapies targeting cancer to make a meaningful difference in people’s lives. ADCETRIS® (brentuximab vedotin) utilizes the company’s industry-leading antibody-drug conjugate (ADC) technology and is currently approved for the treatment of multiple CD30-expressing lymphomas. Beyond ADCETRIS, the company has a late-stage pipeline including enfortumab vedotin for metastatic urothelial cancer, currently being reviewed for approval by the FDA, and tisotumab vedotin in clinical trials for metastatic cervical cancer, which utilize our proprietary ADC technology. In addition, tucatinib, a small molecule tyrosine kinase inhibitor, is in late-stage development for HER2-positive metastatic breast cancer and in clinical development for metastatic colorectal cancer. We are also leveraging our expertise in empowered antibodies to build a portfolio of proprietary immuno-oncology agents in clinical trials targeting hematologic malignancies and solid tumors. The company is headquartered in Bothell, Washington, and has a European office in Switzerland. For more information on our robust pipeline, visit www.seattlegenetics.com and follow @SeattleGenetics on Twitter.\n\nADCETRIS (brentuximab vedotin) U.S. Important Safety Information\n\nBOXED WARNING\nPROGRESSIVE MULTIFOCAL LEUKOENCEPHALOPATHY (PML): JC virus infection resulting in PML and death can occur in ADCETRIS-treated patients.\n\nContraindication\n\nADCETRIS concomitant with bleomycin due to pulmonary toxicity (e.g., interstitial infiltration and/or inflammation).\n\nWarnings and Precautions\n\nMost Common (≥20% in any study) Adverse Reactions: Peripheral neuropathy, fatigue, nausea, diarrhea, neutropenia, upper respiratory tract infection, pyrexia, constipation, vomiting, alopecia, decreased weight, abdominal pain, anemia, stomatitis, lymphopenia and mucositis.\n\nDrug Interactions\n\nConcomitant use of strong CYP3A4 inhibitors or inducers has the potential to affect the exposure to monomethyl auristatin E (MMAE).\n\nUse in Specific Populations\n\nModerate or severe hepatic impairment or severe renal impairment: MMAE exposure and adverse reactions are increased. Avoid use.\n\nAdvise males with female sexual partners of reproductive potential to use effective contraception during ADCETRIS treatment and for at least 6 months after the final dose of ADCETRIS.\n\nAdvise patients to report pregnancy immediately and avoid breastfeeding while receiving ADCETRIS.\n\nPlease see the full Prescribing Information, including BOXED WARNING, for ADCETRIS here.\n\nForward-Looking Statements\n\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to the potential utilization of ADCETRIS (brentuximab vedotin) for previously untreated adult patients with systemic anaplastic large cell lymphoma, peripheral T-cell lymphoma-not otherwise specified or angioimmunoblastic T-cell lymphoma, whose tumours express CD30 in Canada and the therapeutic potential of ADCETRIS in this indication. Actual results or developments may differ materially from those projected or implied in these forward-looking statements due to factors such as utilization and adoption of the approved treatment regimen by prescribing physicians, competitive conditions including the availability of alternative treatment regimens, the availability and extent of reimbursement, the risk of adverse events, and adverse regulatory action. More information about the risks and uncertainties faced by Seattle Genetics is contained under the caption “Risk Factors” included in the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019 filed with the Securities and Exchange Commission. Seattle Genetics disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191125005237/en/\nMedia:\nMonique Greer\n(425) 527-4641\nmgreer@seagen.com\n\nInvestors:\nPeggy Pinkston\n(425) 527-4160\nppinkston@seagen.com\nSource: Seattle Genetics, Inc."
    }
]