[
    {
        "title": "SiriusXM To Showcase Its Biggest Exclusive Live Concerts From The Past Decade On SiriusXM's Superstar Concert Series Channel",
        "subtitle": "",
        "date": "Mar 5, 2020 10:00AM EST",
        "content": "NEW YORK, March 5, 2020 /PRNewswire/ -- SiriusXM announced today the broadcast of the biggest, exclusive SiriusXM subscriber-only concerts from the past 10 years, including critically-acclaimed performances by musical icons such as Paul McCartney, Garth Brooks, Bruce Springsteen, U2, and Lady Gaga, on a dedicated limited-time channel, SiriusXM's Superstar Concert Series, starting March 9. \n                        \n                    \n                For more than a decade, SiriusXM has invited its subscribers to exclusive concerts headlined by some of the most important names in music playing at legendary venues; Pearl Jam will perform at Harlem's world-famous Apollo Theater in a special invitation-only concert for SiriusXM subscribers and Pandora listeners March 26. SiriusXM programmers have now curated the exclusive concert series to create a limited-time channel for a national audience. SiriusXM's Superstar Concert Series channel will air one special concert, all day, on their respective broadcast date on channel 30.\"A hallmark and distinctive benefit of being a SiriusXM subscriber has been the chance to not only hear the best big-time and emerging artists on our great range of channels, but also to actually attend a live special show by the musical artists they love,\" said Scott Greenstein, President and Chief Content Officer, SiriusXM. \"We continue to hold great concerts for subscribers, but we wanted to share these great moments, and bring it all together in one place for our listeners.\"The limited-run channel will highlight the outstanding caliber of SiriusXM live shows, featuring live performances from renowned, global artists at unique venues such as New York City's Apollo Theater, Nashville's Ryman Auditorium and Grand Ole Opry, and world-famous rock venues such as The Troubadour and Whisky a Go Go in Los Angeles, as well as other intimate venues.The SiriusXM Superstar Concert Series pop-up channel will run from March 9 through March 24.  See the full broadcast schedule below. SiriusXM subscribers can listen to the special limited-run channel (ch. 30) and other channels on SiriusXM radios, and those with streaming access can listen online, on-the-go with the SiriusXM mobile app and at home on a wide variety of connected devices, including smart TVs, devices with Amazon Alexa or the Google Assistant, Apple TV, PlayStation, Roku, Sonos speakers and more. Go to www.SiriusXM.com/streaming to learn more.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2019, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMSiriusXM Media Contacts: Angela Burke 212-584-5350 Angela.burke@siriusxm.com Carolina Dubon 646-313-2293 Carolina.dubon@siriusxm.com \n                        \n                    \n                \n                        \n                    \n                \n                        \n                    \n                \n                        \n                    \n                 View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-to-showcase-its-biggest-exclusive-live-concerts-from-the-past-decade-on-siriusxms-superstar-concert-series-channel-301017342.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM's Doctor Radio and NYU Langone Health's Medical Experts Launch 24/7 Coronavirus Programming",
        "subtitle": "",
        "date": "Mar 2, 2020 10:00AM EST",
        "content": "NEW YORK, March 2, 2020 /PRNewswire/ -- SiriusXM today announced that Doctor Radio and NYU Langone Health's medical experts will launch 24/7 programming, live and on demand, dedicated to the latest news and updates surrounding the coronavirus. All programming will be presented by NYU Langone's team of world-class infectious disease and medical authorities and curated by SiriusXM's Doctor Radio channel programmers.\n                        \n                    \n                This special programming will help listeners separate fact from fiction, provide informational tips about prevention, and guidance on what to be prepared for. NYU Langone Health's physicians contributing to the programming will include Infectious Disease specialists Dr. Mark Mulligan and Dr. Michael Phillips, and Chief Medical Officer Dr. Fritz Francois.SiriusXM's Doctor Radio channel and NYU Langone Health have created a special informative guide -- Coronavirus: Everything You Need To Know -- available as a podcast on Pandora and an On Demand selection through SiriusXM's app and streaming platform. On the 15-minute podcast Drs. Phillips and Francois discuss everything you need to know from the basics of a virus to the new coronavirus, COVID-19, including prevention, symptoms, and what to do if you experience them.Doctor Radio will post a daily podcast, Coronavirus - What You Need To Know Now, available on Pandora and SiriusXM, drawn from updates and specials, consolidating in one place the latest news and information from Doctor Radio and NYU Langone Health. Also this week, Doctor Radio, channel 110, will begin airing hourly coronavirus updates, and also across multiple select SiriusXM channels. The updates will provide the latest information and news related to the pandemic. Starting March 6, Doctor Radio will start airing regular live call-in specials each Friday. Hosted by Doctor Radio Medical Director Dr. Marc Siegel, Doctor Radio Reports: Coronavirus - What You Need To Know Now, will be a one-hour live call-in show, where listeners can hear from NYU's top physicians and experts, and will be able to call in and ask their own questions. The weekly call-in specials start this Friday at 2:00 pm ET. Listeners are encouraged to call 877 NYU DOCS (877 698-3627), tweet @NYUDocs, or email docs@siriusxm.com,with their questions.\"Around the globe, and here at home, the coronavirus outbreak has millions concerned about their health, and we're grateful to have the world-class physicians from NYU Langone Health on our Doctor Radio channel to support and educate listeners during this time,\" says Scott Greenstein, President and Chief Content Officer, SiriusXM. \"This kind of direct access to important fact-based information from the best experts is vital right now.\"\"Countless individuals have benefitted over the years from the excellent advice and guidance provided through Doctor Radio, so it is fitting that we embark on a bold initiative to educate the public as best we can on this latest health crisis,\" says Andrew W. Brotman, MD, Executive Vice President and Vice Dean for Clinical Affairs at NYU Langone Health. \"Being able to tap into our shared resources is what makes the SiriusXM-NYU Langone Health partnership so beneficial to our listeners.\"Hosted by doctors and medical administrators, Doctor Radio provides listeners across the country world class medical advice with access to world-renowned physicians and health professionals. The 24/7 channel features daily shows and reports on general health and wellness, plastic surgery, weight loss, sports and emergency medicine, pediatrics, and much more.Since the launch of Doctor Radio 2008 with only a handful of hosts, the channel today boasts 26 regularly scheduled shows covering different medical specialties with over 60 different hosts producing 48 hours a week of original programming plus regularly scheduled quarterly and annual specials examining breaking medical stories, the latest research, rare diseases, and every day health.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2019, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contact:Chelsea Kaufman646.949.8591Chelsea.Kaufman@siriusxm.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxms-doctor-radio-and-nyu-langone-healths-medical-experts-launch-247-coronavirus-programming-301014435.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "Mark Knopfler to Host The British Grove Broadcast, Exclusive New Show on SiriusXM's Volume Channel",
        "subtitle": "",
        "date": "Feb 25, 2020 8:00AM EST",
        "content": "NEW YORK, Feb. 25, 2020 /PRNewswire/ -- SiriusXM announced today that Mark Knopfler, songwriter, guitarist, and record producer, will host The British Grove Broadcast, a new music radio program exclusively on SiriusXM's Volume channel 106.  Broadcasting from Knopfler's British Grove Studios in West London, The British Grove Broadcast will feature Knopfler playing some of his favorite music—from early roots, blues, rock n' roll to up-and-comers—hand-selected from his personal and extensive record collection.  This weekly one-hour show will celebrate Knopfler's love of radio, influential artists and music discovery as he introduces audiences to tracks that they may not have heard before.  With each program, audiences will be treated to Knopfler's musical knowledge and share in his joy of all kinds of music. Describing his new SiriusXM show, Knopfler said: \"I've tried not to make my choices too obvious and avoided the mega-hits. I hope people might make a discovery or two, but there's so much good music out there I've had to leave out mountains of it. It's been tricky, but fun all the way.\"\"Having Mark take us on his personal journey of music discovery—from the comfort of his own London studios—is a special addition to our Volume channel,\" said Scott Greenstein, President and Chief Content Officer of SiriusXM.  \"He is a true modern guitar hero and his work as a songwriter and producer has such tremendous range. With that rich and varied background, each show will be a treat for our listeners as Mark curates and comments on his extraordinary range of selections.\" SiriusXM subscribers can catch The British Grove Broadcast beginning Wednesday, March 4 at 9pm ET on Volume (channel 106), the channel devoted to the discussion of, and passion for, music.  Listeners can find The British Grove Broadcast on Volume every Wednesday night at 9pm ET where they'll hear tracks from artists such as Sharon Van Etten, Yo La Tengo, Jenny O., Bob Dylan, John Prine, Joni Mitchell and Los Lobos, among others.  Pandora will also release special playlists echoing the music and themes of The British Grove Broadcast. British Grove Studios, established in 2005, is Knopfler's state-of-the-art recording studio complex, named after its location in London's Chiswick neighborhood.  Knopfler has recorded five solo albums at British Grove Studios including his latest album, Down The Road Wherever, as well as various projects and a film soundtrack. Artists who have recorded at British Grove Studios include the Rolling Stones, Eric Clapton, The Who, Nick Cave, Sting, Kaiser Chiefs and Goldfrapp, among others. Knopfler is one of the most celebrated British guitar heroes to emerge in the late 1970's and 1980's.  He first rose to fame as the lead singer and guitarist of Dire Straits and went on to launch his solo career in 1983.  He is a producer, songwriter, film composer and guitarist.  In addition to 2018's Down The Road Wherever, recent studio albums include Privateering (2012) All The Roadrunning, a duets album with Emmylou Harris (2006), and Shangri-La (2004). SiriusXM subscribers with streaming access can also hear the program on a wide variety of connected devices including smart TVs, devices with Amazon Alexa or the Google Assistant, Apple TV, Sony PlayStation, Roku, Sonos speakers and more. Go to www.SiriusXM.com/AtHome to learn more.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2019, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contact:Amy Galleazzi212.901.6552 amy.galleazzi@siriusxm.com View original content to download multimedia:http://www.prnewswire.com/news-releases/mark-knopfler-to-host-the-british-grove-broadcast-exclusive-new-show-on-siriusxms-volume-channel-301010584.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "AutoNation and Automatic Labs, a SiriusXM Company, to Expand Coverage of Connected Car Program to Additional Stores and Customers",
        "subtitle": "",
        "date": "Feb 13, 2020 8:00AM EST",
        "content": "NEW YORK, Feb. 13, 2020 /PRNewswire/ -- AutoNation, Inc., America's largest and most recognized automotive retailer, and Automatic Labs, Inc., a SiriusXM company that brings the power of connectivity to most cars available at AutoNation, are expanding the AutoNation Connected Car Program to additional markets.The AutoNation Connected Car Program is powered by Automatic's in-vehicle adapter and app, and was initially launched at five AutoNation USA stores in April 2019. Customers who take advantage of the program have access to important safety services such as Crash Alert and timely vehicle health notifications in vehicles without built-in connectivity, when choosing AutoNation to purchase their vehicles. Since launch, 97% of customers who activated at point-of-sale remain engaged with Automatic month over month. In turn, AutoNation has benefitted from higher retention of customers' vehicle maintenance and service business. Automatic's Dealer Insights platform and customized analytics deliver daily reports to AutoNation, including information such as lists of customers with active recalls, engine light check alerts, service recommendations, and various data points about the health and performance of customer vehicles. AutoNation uses this valuable information to send targeted communications to its customers specific to their vehicles' service and maintenance needs. \"Following the successful launch of the AutoNation Connected Car Program, we are excited to expand the program in additional markets across the country. Our customers have recognized and appreciated the value of Automatic, and now we will be delivering that value to many more customers,\" said Marc Cannon, Executive Vice President and Chief Marketing Officer at AutoNation.\"This expansion of the AutoNation Connected Car Program powered by Automatic reflects its success at the AutoNation USA dealerships and the positive response from customers who appreciate the value of Automatic's connectivity features,\" said Joe Verbrugge, Executive Vice President and Division President, Connected Vehicle for SiriusXM. \"This service establishes a strong and lasting connection between dealers and their customers long after the sale.  We are very excited to continue building on the program's success with AutoNation.\"Automatic Labs will be demonstrating its Dealer Insights platform at NADA 2020 and will be located with SiriusXM at Booth #2562 in the Central Hall. Parties interested in meeting at NADA should contact Radhika Giri, VP and GM, Product, Sales & Marketing for Automatic, at radhika.giri@siriusxm.com.All Automatic subscriptions, including trial subscriptions, are governed by the terms of the Automatic Customer Agreement. Consumers can access the Automatic Customer Agreement at https://automatic.com/legal#customer. Please see the Customer Agreement for complete terms and how to cancel.About AutomaticAutomatic Labs Inc., a SiriusXM company, brings the power of connectivity to most vehicles model year 1996 or later. By pairing Automatic's app with an in-car adapter, drivers are able to enhance their driving experience with a host of connected services. Automatic helps customers drive safer and smarter with applications that diagnose engine trouble, detect accidents, send emergency responses when needed, and save money. Developers can use the Automatic platform to build services and applications that use driving data with interoperable access to cars on the road. Automatic is headquartered in San Francisco. For more information, visit www.automatic.com and www.linkedin.com/company/automatic-labs.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.About AutoNation, Inc.AutoNation, America's largest and most recognized automotive retailer, is transforming the automotive industry through its bold leadership, innovation, and comprehensive brand extensions. As of December 31, 2019, AutoNation owned and operated over 325 locations from coast to coast. AutoNation has sold over 12 million vehicles, the first automotive retailer to reach this milestone. AutoNation's success is driven by a commitment to delivering a peerless experience through customer-focused sales and service processes. Since 2013, AutoNation has raised over $22 million to drive out cancer, create awareness, and support critical research through its DRIVE PINK initiative, which was officially branded in 2015.Please visit www.autonation.com, investors.autonation.com, www.twitter.com/CEOCherylMiller, and www.twitter.com/AutoNation, where AutoNation discloses additional information about the Company, its business, and its results of operations. Please also visit www.autonationdrive.com, AutoNation's automotive blog, for information regarding the AutoNation community, the automotive industry, and current automotive news and trends.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contacts:Kevin BrunsSiriusXMKevin.Bruns@SiriusXM.comMarc CannonAutoNationCannonM@AutoNation.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/autonation-and-automatic-labs-a-siriusxm-company-to-expand-coverage-of-connected-car-program-to-additional-stores-and-customers-301004534.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SoundCloud Announces $75 Million Investment from Sirius XM Holdings Inc.",
        "subtitle": "",
        "date": "Feb 11, 2020 8:00AM EST",
        "content": "NEW YORK, Feb. 11, 2020 /PRNewswire/ -- SoundCloud and SiriusXM Holdings Inc. (NASDAQ: SIRI) announced today that the leading U.S. audio entertainment company, SiriusXM, has invested $75 million in SoundCloud, the world's largest open audio platform. SoundCloud will use this additional investment to accelerate its product development and enhance the services that fuel its global community of creators and listeners.\"SoundCloud's three consecutive years of strong financial performance directly reflect the success of our creator-led growth strategy,\" said Kerry Trainor, Chief Executive Officer, SoundCloud. \"We have an exciting roadmap focused on deepening the connections between creators and listeners that fuel creator discovery, career growth and the evolution of music culture on SoundCloud. We've built a great relationship with SiriusXM through our highly successful Pandora ad sales agreement, and their investment gives us added capital flexibility to accelerate our vision and take advantage of strategic opportunities as they arise.\"\"SoundCloud's unique platform serves a vital role in today's music ecosystem where new artists are discovered and build their fan base, and established artists experiment and connect directly with their fans in highly effective ways,\" said Jim Meyer, Chief Executive Officer of SiriusXM. \"We admire SoundCloud's loyal and growing audience, its offering for creators, and its reputation and popularity in global music communities. We believe this is another opportunity to continue creating value for SiriusXM stockholders by investing in expanding digital audio platforms.\" The minority investment follows the highly successful ad sales relationship between SoundCloud and Pandora, a subsidiary of SiriusXM, which started in 2019. The agreement enables advertisers and brands to purchase SoundCloud's U.S. ad inventory directly through Pandora, leveraging the company's direct sales capabilities, targeting data, and audio programmatic platform. Together, SoundCloud and Pandora's combined U.S. audience offering reaches more than 100 million unique listeners, creating the largest digital audio advertising marketplace.SoundCloud is the global accelerator for music culture and has grown its business through the introduction of new products, services and partnerships that empower audio creators and listener discovery. The creator-driven platform continues to be the first place creators share their audio with the world and the first place listeners discover what's next in music. Many of the most buzzed-about artists shaping music today – including Billie Eilish, Post Malone, Bad Bunny, Khalid, Lil Tecca, and more – started their careers first on SoundCloud.In 2019, SoundCloud set all-time highs for platform engagement, creators heard, subscribers and revenue. The company exited the year with its strongest financial performance in its history – accelerating to a $200 million forward revenue run-rate for the first time in the fourth quarter 2019.Under the terms of the agreement, SiriusXM has purchased $75 million of securities for a minority investment, and the SoundCloud Board of Directors will expand to include two individuals designated by SiriusXM. The Raine Group served as financial advisor to SoundCloud, and Morrison & Foerster as its legal counsel. Allen & Company LLC served as financial advisor to SiriusXM, and Weil, Gotshal & Manges LLP as its legal counsel.About SoundCloud SoundCloud is the world's largest open audio platform, powered by a connected community of creators,listeners, and curators on the pulse of what's new, now and next in culture. Founded in 2007, SoundCloud empowers the world's audio creators with the best tools, services, and resources to build and grow their careers. With over 200 million tracks from 25 million creators heard in 190 countries, what's next in music is first on SoundCloud.About SiriusXM Sirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.Contacts:For SiriusXMMedia:Patrick Reilly 212-901-6646 patrick.reilly@siriusxm.com   Investors:Hooper Stevens212-901-6718hooper.stevens@siriusxm.com For SoundCloudMedia:Sheri Ladner press@soundcloud.com       View original content:http://www.prnewswire.com/news-releases/soundcloud-announces-75-million-investment-from-sirius-xm-holdings-inc-301002813.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "Harry Styles to Perform for SiriusXM and Pandora in New York City",
        "subtitle": "",
        "date": "Feb 10, 2020 9:00AM EST",
        "content": "NEW YORK, Feb. 10, 2020 /PRNewswire/ -- SiriusXM announced today that Harry Styles will perform for SiriusXM and Pandora on Friday, February 28 at a secret location in New York City. The intimate set for SiriusXM subscribers and Pandora listeners will feature Styles performing songs from his recent sophomore album, Fine Line, released via Columbia Records. The event will also include an interview with Harry Styles and The Morning Mash Up hosts Ryan Sampson, Nicole Ryan and Stanley T.The special performance and interview will air on Saturday, February 29 at 6:00 pm ET on SiriusXM Hits1, channel 2 on satellite radios and on the SiriusXM app. The Morning Mash Up, SiriusXM Hits 1's live daily morning show airs Monday - Friday from 6:00 am - 12:00 pm ET from the SiriusXM studios in New York City. SiriusXM Hits 1 is also home to Hits 1 in Hollywood, the live daily afternoon show hosted by Tony Fly and Symon from the SiriusXM Hollywood studios in Los Angeles.SiriusXM subscribers are able to listen to SiriusXM Hits 1 (channel 2) on SiriusXM radios, and those with streaming access can listen online, on-the-go with the SiriusXM mobile app and at home on a wide variety of connected devices, including smart TVs, devices with Amazon Alexa or the Google Assistant, Apple TV, PlayStation, Roku, Sonos speakers and more. Go to www.SiriusXM.com/streaming to learn more.For more information about Harry Styles, go to www.hstyles.co.uk.ABOUT HARRY STYLES:Harry Styles has returned with his critically acclaimed second solo album Fine Line — his first piece of new music in two years. It's a new chapter in the story he's been building for the past ten years—a musical journey unlike any other. Styles' Fine Line, released in December 2019 on Columbia Records, achieved an array of history-making records and topped the charts at #1 in over 20 countries.  The album, which features the new single \"Adore You,\" debuted at #1 in the U.S. on the Billboard 200 with over 478,000 equivalent album units sold, making history as the biggest sales week for a solo U.K. male artist's album since Nielsen Music began electronically tracking sales data in 1991, and was the 3rd highest debut for any artist in 2019. Harry is nominated for Best Male and Mastercard Album of the Year at the 2020 BRIT AWARDS. He will kick off his world tour Love on Tour in April 2020 in support of Fine Line. Styles became an overnight sensation with the band One Direction which conquered the world, touring and scoring hits at a frantic pace, while he began to evolve as a songwriter and performer. Styles went his own way in spring 2017 when he dropped his first solo single: the double-platinum piano epic \"Sign of the Times,\" which Rolling Stone named the Song of the Year. His self-titled debut album released in May 2017, entered the Billboard 200 at #1 and topped charts at #1 in over 55 countries. The timeless 10-track album confirmed Styles as an artist schooled in the classics, while still breaking new ground. He toured the album in 2017 and 2018 with 90 sold-out shows in over 20 countries. He made his acting debut in Christopher Nolan's Oscar-nominated film \"Dunkirk\" in July 2017, becoming the first British artist with a #1 debut single, album and film in the same year. About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contacts for SiriusXM:Angela Burke212-584-5350Angela.burke@siriusxm.comCarolina Dubon646-313-2293Carolina.dubon@siriusxm.comFor more information on Harry Styles please contact:Mike Navarra, Columbia Records310.272.2167Mike.navarra@sonymusic.com View original content to download multimedia:http://www.prnewswire.com/news-releases/harry-styles-to-perform-for-siriusxm-and-pandora-in-new-york-city-301001649.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "Pearl Jam Plays the Apollo Theater for First Time Exclusively for SiriusXM on March 26",
        "subtitle": "",
        "date": "Feb 6, 2020 9:00AM EST",
        "content": "NEW YORK, Feb. 6, 2020 /PRNewswire/ -- SiriusXM announced today that Pearl Jam will perform at Harlem's world-famous Apollo Theater in a special invitation-only concert for SiriusXM subscribers and Pandora listeners on Thursday, March 26.The exclusive concert marks the first time that Pearl Jam has performed at the iconic venue and their first concert in New York City in almost three years. The special event comes days before the band embarks on the U.S. leg of their Pearl Jam 2020 tour. The concert will take place just hours ahead of the release of the band's new album Gigaton, which goes on sale at midnight.Concert will air live nationwide on the band's dedicated channel, SiriusXM's Pearl Jam Radio channel 22, now in its 10th year on SiriusXM. Directly following the live concert, Pearl Jam Radio will broadcast and premiere the new album in North America.  Upon the album's release, Pandora will release both a new Pearl Jam Live: A-Z playlist, which will include some of the band's greatest live performances, and a Pandora Story, where the band will share insights and stories about their new music and iconic songs.\"We are incredibly humbled and honored to take the stage at the legendary Apollo Theater,\" said Stone Gossard. \"We look forward to a memorable show to celebrate Gigaton and the 10-year anniversary of Pearl Jam Radio at SiriusXM. It's hard to understate the sacred and historical importance of the Apollo to the history of American popular music and African Americans' preeminent role in its invention. We will play this special one time show with those artists in mind.\" \"Pearl Jam Radio has become a must-listen-to destination to hear live concerts performed and chosen by one of the greatest live rock acts ever,\" said Scott Greenstein, President and Chief Content Officer, SiriusXM.  \"For the first time, we are thrilled to be able to offer our subscribers the exclusive opportunity to attend and listen to this great band's first show at the historic Apollo Theater, which will kick off Pearl Jam's massive U.S. tour promoting their new album.  Seeing the band in this intimate setting is certain to be a once in a lifetime experience that all Pearl Jam fans won't want to miss.\"Pearl Jam will release their much-anticipated eleventh studio album, Gigaton, on March 27, just hours after their special concert at the Apollo Theater. Gigaton marks the band's first studio album since their GRAMMY award-winning album, Lightning Bolt, which was released over six years ago.  Gigaton is available for pre-order now at www.pearljam.com. In support of Gigaton, Pearl Jam will embark on their first leg of North American tour dates in March and April. SiriusXM has had a long-standing relationship with Pearl Jam, having created a full-time music channel with the band, Pearl Jam Radio, in 2010, which features archival concerts throughout the band's 30-year career, rarities, unreleased material from the band's personal music library and music from the band's side projects, including solo and pre-Pearl Jam music.  The legendary Apollo Theater—the soul of American culture—plays a vital role in cultivating emerging artists and launching legends. Since its founding the Apollo has served as a center of innovation and a creative catalyst for Harlem, the city of New York, and the world. For more information, visit www.apollotheater.org.SiriusXM has presented special, private concerts at the Apollo Theater with Paul McCartney in 2010, Bruce Springsteen in 2012, Metallica in 2013, James Taylor in 2015, Guns N' Roses in 2017, U2 in 2018 and Lady Gaga in 2019.SiriusXM subscribers will have numerous opportunities to win a pair of tickets to this private SiriusXM & Pandora performance, including on-air on Pearl Jam Radio, via e-mail to qualified subscribers who have consented to e-mail marketing from SiriusXM and who have registered their music interests with us at siriusxm.com/perks. Pandora fans will have a similar opportunity based upon their listening histories. Additionally, SiriusXM subscribers since January 22, 2020 will be able to enter for the chance to win a trip for two to New York, NY including airfare, hotel stay, and a pair of tickets to SiriusXM & Pandora Present Pearl Jam at The Apollo Theater. See Official Rules for complete details at siriusxm.com/PJApollo.Pearl Jam Radio features archival concerts from throughout the band's celebrated 30-year career, rarities, unreleased material from the band's personal music library and music from the band's side projects, including solo and pre-Pearl Jam music. SiriusXM's exclusive Pearl Jam Radio channel is an example of SiriusXM channels created with iconic and leading artists including The Beatles, Bruce Springsteen, Tom Petty, Phish, Eminem, LL COOL J, Diplo, Elvis Presley, Garth Brooks, Kenny Chesney, Frank Sinatra and more. For more information on Pearl Jam, please visit www.pearljam.com.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Media contacts for SiriusXM:Angela Burke212-584-5350Angela.burke@siriusxm.com Carolina Dubon646-313-2293Carolina.dubon@siriusxm.com Media contact for Pearl Jam:Sarah Seiler at Pearl Jamsarah@pearljam.com View original content to download multimedia:http://www.prnewswire.com/news-releases/pearl-jam-plays-the-apollo-theater-for-first-time-exclusively-for-siriusxm-on-march-26-300999862.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM Reports Fourth Quarter and Full-Year 2019 Results",
        "subtitle": "",
        "date": "Feb 4, 2020 7:00AM EST",
        "content": "\n    \n  NEW YORK, Feb. 4, 2020 /PRNewswire/ -- SiriusXM today announced fourth quarter and full-year 2019 operating and financial results, including revenue of $2.1 billion and $7.8 billion, respectively, increasing 38% and 35% compared to the prior year periods. Revenue was boosted by the acquisition of Pandora Media on February 1, 2019. The Company's net income declined 3% to $243 million in the fourth quarter, while full-year net income totaled $914 million, down from $1.2 billion in 2018 due to higher acquisition, refinancing, and depreciation and amortization expenses in 2019. Net income per diluted common share was $0.05 in the fourth quarter, compared to $0.06 in the prior year period, while full-year 2019 net income per diluted share declined to $0.20 from $0.26 in 2018.\" On a pro forma basis, fourth quarter revenue grew 6% from $1.9 billion and full-year revenue climbed 8% from $7.3 billion in the prior year periods. Adjusted EBITDA in the fourth quarter totaled $587 million, down from $593 million in the prior year period. For the full-year, adjusted EBITDA grew 14% to $2.4 billion, resulting in an adjusted EBITDA margin of 30.6%, an improvement of approximately 160 basis points from 2018. The improvement in adjusted EBITDA margin was driven primarily by revenue growth across the business and cost efficiencies in subscriber acquisition costs and revenue share and royalties. Pro forma figures assume the Pandora acquisition closed on January 1, 2018.\"I am so proud of SiriusXM's milestone performance last year. Not only did we achieve our 10th consecutive year of one million-plus self-pay net additions, but we successfully completed the acquisition of Pandora Media and drove each business to record-high financial performance. Looking forward to 2020, we're excited about a new decade of opportunity before us and confident in reiterating our guidance for the year,\" said Jim Meyer, Chief Executive Officer, SiriusXM.\"In programming, our lifeblood, we continue to work with an increasing array of megastars and brands that have real value for SiriusXM subscribers and Pandora listeners. In the lead-up to the Super Bowl, The Chainsmokers and Lizzo played separate exclusive concerts on back-to-back nights in Miami Beach as part of our new Opening Drive Super Concert Series. Coldplay did a special stripped-down set at our new Hollywood studios for subscribers, and we announced the launch of a new SiriusXM channel and exclusive Pandora content from superstars U2, called U2X Radio, which will debut this year,\" added Meyer.FULL-YEAR 2019 HIGHLIGHTSSiriusXM operates two complementary audio entertainment businesses — our SiriusXM business and our Pandora business. Further information regarding these two segments will be contained in the Company's Annual Report on Form 10-K for the year ended December 31, 2019. The pro forma financial and operating highlights of these two segments are presented separately below and exclude the impact of share-based payment expense.SIRIUSXMPANDORA\"SiriusXM returned nearly $2.4 billion of capital to stockholders in 2019. We repurchased more than 364 million shares last year and paid approximately $226 million in dividends to stockholders. At year-end, our debt to adjusted EBITDA ratio was 3.2 times and we had the entire $1.75 billion available on our revolving credit facility. This gives us ample liquidity to continue investing in our business while returning capital to stockholders,\" noted David Frear, Chief Financial Officer, SiriusXM.2020 GUIDANCEThe Company's full-year 2020 guidance for self-pay net subscriber additions, revenue, adjusted EBITDA and free cash flow, as issued on January 7, 2020, is reiterated as follows:CAPITAL RETURN PROGRAMShares of common stock may be purchased from time to time on the open market, pursuant to pre-set trading plans meeting the requirements of Rule 10b5-1 under the Exchange Act of 1934, as amended, in privately negotiated transactions, including in accelerated stock repurchase transactions and transactions with Liberty Media and its affiliates, or otherwise. The Company expects to fund the repurchases through a combination of cash on hand, cash generated by operations and future borrowings. The size and timing of these purchases will be based on a number of factors, including price and business and market conditions.The Company's dividend policy may change at any time without notice to stockholders. The declaration and payment of dividends is at the discretion of the Company's Board of Directors in accordance with applicable law after taking into account various factors, including the Company's financial condition, operating results, current and anticipated cash needs, limitations imposed by its indebtedness, legal requirements and other factors that the Board of Directors deems relevant.\nFOURTH QUARTER AND FULL-YEAR 2019 RESULTS\n\nSIRIUS XM HOLDINGS INC. AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \n\n\nFor the Three Months Ended December 31,\n\n\n\nFor the Twelve Months Ended December 31,\n\n\n(in millions, except per share data)\n\n\n2019\n\n\n\n2018\n\n\n\n2019\n\n\n\n2018\n\n\n\n(Unaudited)\n\n\n\n(Unaudited)\n\n\n\n\n\n\nRevenue:\n\n\n\n\n\n\n\n\n\nSubscriber revenue\n\n\n$\n\n\n1,569\n\n\n\n\n$\n\n\n1,361\n\n\n\n\n$\n\n\n6,120\n\n\n\n\n$\n\n\n5,264\n\n\n\nAdvertising revenue\n\n\n403\n\n\n\n\n53\n\n\n\n\n1,336\n\n\n\n\n188\n\n\n\nEquipment revenue\n\n\n46\n\n\n\n\n42\n\n\n\n\n173\n\n\n\n\n155\n\n\n\nOther revenue\n\n\n44\n\n\n\n\n40\n\n\n\n\n165\n\n\n\n\n164\n\n\n\nTotal revenue\n\n\n2,062\n\n\n\n\n1,496\n\n\n\n\n7,794\n\n\n\n\n5,771\n\n\n\nOperating expenses:\n\n\n\n\n\n\n\n\n\nCost of services:\n\n\n\n\n\n\n\n\n\nRevenue share and royalties\n\n\n607\n\n\n\n\n337\n\n\n\n\n2,291\n\n\n\n\n1,394\n\n\n\nProgramming and content\n\n\n124\n\n\n\n\n103\n\n\n\n\n462\n\n\n\n\n406\n\n\n\nCustomer service and billing\n\n\n123\n\n\n\n\n98\n\n\n\n\n475\n\n\n\n\n382\n\n\n\nTransmission\n\n\n53\n\n\n\n\n26\n\n\n\n\n170\n\n\n\n\n96\n\n\n\nCost of equipment\n\n\n9\n\n\n\n\n9\n\n\n\n\n29\n\n\n\n\n31\n\n\n\nSubscriber acquisition costs\n\n\n114\n\n\n\n\n118\n\n\n\n\n427\n\n\n\n\n470\n\n\n\nSales and marketing\n\n\n289\n\n\n\n\n140\n\n\n\n\n937\n\n\n\n\n484\n\n\n\nEngineering, design and development\n\n\n74\n\n\n\n\n34\n\n\n\n\n280\n\n\n\n\n123\n\n\n\nGeneral and administrative\n\n\n145\n\n\n\n\n90\n\n\n\n\n524\n\n\n\n\n354\n\n\n\nDepreciation and amortization\n\n\n124\n\n\n\n\n79\n\n\n\n\n468\n\n\n\n\n301\n\n\n\nAcquisition and other related costs\n\n\n1\n\n\n\n\n3\n\n\n\n\n84\n\n\n\n\n3\n\n\n\nTotal operating expenses\n\n\n1,663\n\n\n\n\n1,037\n\n\n\n\n6,147\n\n\n\n\n4,044\n\n\n\nIncome from operations\n\n\n399\n\n\n\n\n459\n\n\n\n\n1,647\n\n\n\n\n1,727\n\n\n\nOther (expense) income:\n\n\n\n\n\n\n\n\n\nInterest expense\n\n\n(99)\n\n\n\n\n(87)\n\n\n\n\n(390)\n\n\n\n\n(350)\n\n\n\nLoss on extinguishment of debt\n\n\n—\n\n\n\n\n—\n\n\n\n\n(57)\n\n\n\n\n—\n\n\n\nOther (expense) income\n\n\n(1)\n\n\n\n\n(38)\n\n\n\n\n(3)\n\n\n\n\n44\n\n\n\nTotal other (expense) income\n\n\n(100)\n\n\n\n\n(125)\n\n\n\n\n(450)\n\n\n\n\n(306)\n\n\n\nIncome before income taxes\n\n\n299\n\n\n\n\n334\n\n\n\n\n1,197\n\n\n\n\n1,421\n\n\n\nIncome tax expense\n\n\n(56)\n\n\n\n\n(83)\n\n\n\n\n(283)\n\n\n\n\n(245)\n\n\n\nNet income\n\n\n$\n\n\n243\n\n\n\n\n$\n\n\n251\n\n\n\n\n$\n\n\n914\n\n\n\n\n$\n\n\n1,176\n\n\n\nForeign currency translation adjustment, net of tax\n\n\n5\n\n\n\n\n(19)\n\n\n\n\n14\n\n\n\n\n(29)\n\n\n\nTotal comprehensive income\n\n\n$\n\n\n248\n\n\n\n\n$\n\n\n232\n\n\n\n\n$\n\n\n928\n\n\n\n\n$\n\n\n1,147\n\n\n\nNet income per common share:\n\n\n\n\n\n\n\n\n\nBasic\n\n\n$\n\n\n0.05\n\n\n\n\n$\n\n\n0.06\n\n\n\n\n$\n\n\n0.20\n\n\n\n\n$\n\n\n0.26\n\n\n\nDiluted\n\n\n$\n\n\n0.05\n\n\n\n\n$\n\n\n0.06\n\n\n\n\n$\n\n\n0.20\n\n\n\n\n$\n\n\n0.26\n\n\n\nWeighted average common shares outstanding:\n\n\n\n\n\n\n\n\n\nBasic\n\n\n4,419\n\n\n\n\n4,401\n\n\n\n\n4,501\n\n\n\n\n4,462\n\n\n\nDiluted\n\n\n4,541\n\n\n\n\n4,478\n\n\n\n\n4,616\n\n\n\n\n4,561\n\n\n\nDividends declared per common share\n\n\n$\n\n\n0.01331\n\n\n\n\n$\n\n\n0.01210\n\n\n\n\n$\n\n\n0.04961\n\n\n\n\n$\n\n\n0.04510\n\n\n \nSIRIUS XM HOLDINGS INC. AND SUBSIDIARIES CONSOLIDATED BALANCE SHEETS\n\n\nAs of December 31,\n\n\n(in millions, except per share data)\n\n\n2019\n\n\n\n2018\n\n\nASSETS\n\n\n\n\n\nCurrent assets:\n\n\n\n\n\nCash and cash equivalents\n\n\n$\n\n\n106\n\n\n\n\n$\n\n\n54\n\n\n\nReceivables, net\n\n\n670\n\n\n\n\n233\n\n\n\nInventory, net\n\n\n11\n\n\n\n\n22\n\n\n\nRelated party current assets\n\n\n22\n\n\n\n\n11\n\n\n\nPrepaid expenses and other current assets\n\n\n194\n\n\n\n\n158\n\n\n\nTotal current assets\n\n\n1,003\n\n\n\n\n478\n\n\n\nProperty and equipment, net\n\n\n1,626\n\n\n\n\n1,513\n\n\n\nIntangible assets, net\n\n\n3,467\n\n\n\n\n2,501\n\n\n\nGoodwill\n\n\n3,843\n\n\n\n\n2,290\n\n\n\nRelated party long-term assets\n\n\n452\n\n\n\n\n960\n\n\n\nDeferred tax assets\n\n\n153\n\n\n\n\n293\n\n\n\nOperating lease right-of-use assets\n\n\n466\n\n\n\n\n—\n\n\n\nOther long-term assets\n\n\n139\n\n\n\n\n138\n\n\n\nTotal assets\n\n\n$\n\n\n11,149\n\n\n\n\n$\n\n\n8,173\n\n\n\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\n\n\n\n\n\nCurrent liabilities:\n\n\n\n\n\nAccounts payable and accrued expenses\n\n\n$\n\n\n1,151\n\n\n\n\n$\n\n\n736\n\n\n\nAccrued interest\n\n\n160\n\n\n\n\n128\n\n\n\nCurrent portion of deferred revenue\n\n\n1,930\n\n\n\n\n1,932\n\n\n\nCurrent maturities of debt\n\n\n2\n\n\n\n\n3\n\n\n\nOperating lease current liabilities\n\n\n46\n\n\n\n\n—\n\n\n\nRelated party current liabilities\n\n\n4\n\n\n\n\n4\n\n\n\nTotal current liabilities\n\n\n3,293\n\n\n\n\n2,803\n\n\n\nLong-term deferred revenue\n\n\n130\n\n\n\n\n149\n\n\n\nLong-term debt\n\n\n7,842\n\n\n\n\n6,885\n\n\n\nRelated party long-term liabilities\n\n\n—\n\n\n\n\n4\n\n\n\nDeferred tax liabilities\n\n\n70\n\n\n\n\n47\n\n\n\nOperating lease liabilities\n\n\n456\n\n\n\n\n—\n\n\n\nOther long-term liabilities\n\n\n94\n\n\n\n\n102\n\n\n\nTotal liabilities\n\n\n11,885\n\n\n\n\n9,990\n\n\n\nStockholders' equity (deficit):\n\n\n\n\n\nCommon stock, par value $0.001 per share; 9,000 shares authorized; 4,412 and 4,346 shares issued; 4,412 and 4,346 outstanding at December 31, 2019 and December 31, 2018, respectively\n\n\n4\n\n\n\n\n4\n\n\n\nAccumulated other comprehensive income (loss), net of tax\n\n\n8\n\n\n\n\n(6)\n\n\n\nAdditional paid-in capital\n\n\n395\n\n\n\n\n242\n\n\n\nTreasury stock, at cost; 0 and 0 shares of common stock at December 31, 2019 and December 31, 2018, respectively\n\n\n—\n\n\n\n\n—\n\n\n\nAccumulated deficit\n\n\n(1,143)\n\n\n\n\n(2,057)\n\n\n\nTotal stockholders' equity (deficit)\n\n\n(736)\n\n\n\n\n(1,817)\n\n\n\nTotal liabilities and stockholders' equity (deficit)\n\n\n$\n\n\n11,149\n\n\n\n\n$\n\n\n8,173\n\n\n  \nSIRIUS XM HOLDINGS INC. AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF CASH FLOWS\n\n\nFor the Twelve Months Ended December 31,\n\n\n(in millions)\n\n\n2019\n\n\n\n2018\n\n\nCash flows from operating activities:\n\n\n\n\n\nNet income\n\n\n$\n\n\n914\n\n\n\n\n$\n\n\n1,176\n\n\n\nAdjustments to reconcile net income to net cash provided by operating activities:\n\n\n\n\n\nDepreciation and amortization\n\n\n468\n\n\n\n\n301\n\n\n\nNon-cash interest expense, net of amortization of premium\n\n\n17\n\n\n\n\n9\n\n\n\nProvision for doubtful accounts\n\n\n53\n\n\n\n\n51\n\n\n\nAmortization of deferred income related to equity method investment\n\n\n(3)\n\n\n\n\n(3)\n\n\n\nLoss on extinguishment of debt\n\n\n57\n\n\n\n\n—\n\n\n\nLoss (gain) on unconsolidated entity investments, net\n\n\n21\n\n\n\n\n10\n\n\n\nGain on fair value instrument\n\n\n—\n\n\n\n\n(43)\n\n\n\nDividend received from unconsolidated entity investment\n\n\n2\n\n\n\n\n2\n\n\n\nShare-based payment expense\n\n\n250\n\n\n\n\n133\n\n\n\nDeferred income taxes\n\n\n259\n\n\n\n\n257\n\n\n\nChanges in operating assets and liabilities:\n\n\n\n\n\nReceivables\n\n\n(137)\n\n\n\n\n(42)\n\n\n\nInventory\n\n\n11\n\n\n\n\n(2)\n\n\n\nRelated party, net\n\n\n(10)\n\n\n\n\n1\n\n\n\nPrepaid expenses and other current assets\n\n\n(3)\n\n\n\n\n(20)\n\n\n\nOther long-term assets\n\n\n4\n\n\n\n\n10\n\n\n\nOperating lease right-of-use assets\n\n\n(14)\n\n\n\n\n—\n\n\n\nAccounts payable and accrued expenses\n\n\n109\n\n\n\n\n(20)\n\n\n\nAccrued interest\n\n\n32\n\n\n\n\n(9)\n\n\n\nDeferred revenue\n\n\n(58)\n\n\n\n\n70\n\n\n\nOperating lease liabilities\n\n\n36\n\n\n\n\n—\n\n\n\nOther long-term liabilities\n\n\n9\n\n\n\n\n(1)\n\n\n\nNet cash provided by operating activities\n\n\n2,017\n\n\n\n\n1,880\n\n\n\nCash flows from investing activities:\n\n\n\n\n\nAdditions to property and equipment\n\n\n(363)\n\n\n\n\n(355)\n\n\n\nPurchases of other investments\n\n\n(7)\n\n\n\n\n(8)\n\n\n\nAcquisition of business, net of cash acquired\n\n\n313\n\n\n\n\n(2)\n\n\n\nSale of short-term investments\n\n\n73\n\n\n\n\n—\n\n\n\nInvestments in related parties and other equity investees\n\n\n(19)\n\n\n\n\n(17)\n\n\n\nRepayment from (loan to) related party\n\n\n—\n\n\n\n\n3\n\n\n\nNet cash used in investing activities\n\n\n(3)\n\n\n\n\n(379)\n\n\n\nCash flows from financing activities:\n\n\n\n\n\nProceeds from exercise of stock options\n\n\n8\n\n\n\n\n—\n\n\n\nTaxes paid from net share settlements for stock-based compensation\n\n\n(150)\n\n\n\n\n(120)\n\n\n\nRevolving credit facility, net of deferred financing costs\n\n\n(439)\n\n\n\n\n136\n\n\n\nProceeds from long-term borrowings, net of costs\n\n\n2,715\n\n\n\n\n—\n\n\n\nProceeds from sale of capped call security\n\n\n3\n\n\n\n\n—\n\n\n\nPrincipal payments of long-term borrowings\n\n\n(1,666)\n\n\n\n\n(16)\n\n\n\nPayment of premiums on redemption of debt\n\n\n(45)\n\n\n\n\n—\n\n\n\nCommon stock repurchased and retired\n\n\n(2,159)\n\n\n\n\n(1,314)\n\n\n\nDividends paid\n\n\n(226)\n\n\n\n\n(201)\n\n\n\nNet cash used in financing activities\n\n\n(1,959)\n\n\n\n\n(1,515)\n\n\n\nNet increase (decrease) in cash, cash equivalents and restricted cash\n\n\n55\n\n\n\n\n(14)\n\n\n\nCash, cash equivalents and restricted cash at beginning of period\n\n\n65\n\n\n\n\n79\n\n\n\nCash, cash equivalents and restricted cash at end of period(1)\n\n\n$\n\n\n120\n\n\n\n\n$\n\n\n65\n\n\n Unaudited Pro Forma ResultsSet forth below are our pro forma results of operations for the three and twelve months ended December 31, 2019 compared with the three and twelve months ended December 31, 2018.  These pro forma results are based on estimates and assumptions, which we believe are reasonable.  They are not the results that would have been realized had the Pandora Acquisition actually occurred on January 1, 2018 and are not indicative of our consolidated results of operations in future periods.  The pro forma results primarily include adjustments related to amortization of acquired intangible assets, depreciation of property and equipment, acquisition costs, fair value gain or loss on the Pandora investment and associated tax impacts.  Please refer to the Footnotes to Results of Operations.Footnotes to Pro Forma Results of OperationsThe following tables reconcile our results of operations as reported to our pro forma results of operations for the three and twelve months ended December 31, 2019 and 2018 which includes the Pandora pre-acquisition financial information for the applicable periods and the effects of purchase price accounting.  These pro forma results are based on estimates and assumptions, which we believe are reasonable.  They are not the results that would have been realized had the Pandora Acquisition actually occurred on January 1, 2018 and are not indicative of our consolidated results of operations in future periods.  The pro forma results primarily include adjustments related to amortization of acquired intangible assets, depreciation of property and equipment, acquisition costs, fair value gain or loss on the Pandora investment and associated tax impacts.     Key Financial and Operating Performance MetricsSubscribers and subscription related revenues and expenses associated with our connected vehicle services and Sirius XM Canada are not included in Sirius XM's subscriber count or subscriber-based operating metrics.Set forth below are our subscriber balances as of December 31, 2019 compared to December 31, 2018:The following table contains our Non-GAAP pro forma financial and operating performance measures which are based on our adjusted results of operations for the three and twelve months ended December 31, 2019 and 2018:GlossaryMonthly active users - the number of distinct registered users on the Pandora services, including subscribers, which have consumed content within the trailing 30 days to the end of the final calendar month of the period. The number of monthly active users on the Pandora services may overstate the number of unique individuals who actively use our Pandora service, as one individual may use multiple accounts. To become a registered user on the Pandora services, a person must sign-up using an email address or phone number, or access our service using a device with a unique identifier, which we use to create an account for our service.Average self-pay monthly churn - the Sirius XM monthly average of self-pay deactivations for the period divided by the average number of self-pay subscribers for the period.Adjusted EBITDA - EBITDA is defined as net income before interest expense, income tax expense and depreciation and amortization.  We adjust EBITDA to exclude the impact of other expense (income) as well as certain other charges discussed below.  Adjusted EBITDA is a Non-GAAP financial measure that excludes or adjusts for (if applicable): (i) certain adjustments as a result of the purchase price accounting for the XM Merger and the Pandora Acquisition, (ii) predecessor net income adjusted for certain expenses, including depreciation and amortization, other income (loss), and share-based payment expense for January 2019 and the twelve months ended December 31, 2018, (iii) share-based payment expense and (iv) other significant operating expense (income) that do not relate to the on-going performance of our business.  We believe adjusted EBITDA is a useful measure of the underlying trend of our operating performance, which provides useful information about our business apart from the costs associated with our capital structure and purchase price accounting.  We believe investors find this Non-GAAP financial measure useful when analyzing our past operating performance with our current performance and comparing our operating performance to the performance of other communications, entertainment and media companies.  We believe investors use adjusted EBITDA to estimate our current enterprise value and to make investment decisions.  As a result of large capital investments in our satellite radio system, our results of operations reflect significant charges for depreciation expense.  We believe the exclusion of share-based payment expense is useful as it is not directly related to the operational conditions of our business.  We also believe the exclusion of the legal settlements and reserves, acquisition related costs, and loss on extinguishment of debt, to the extent they occur during the period, is useful as they are significant expenses not incurred as part of our normal operations for the period. Adjusted EBITDA has certain limitations in that it does not take into account the impact to our statements of comprehensive income of certain expenses, including share-based payment expense and certain purchase price accounting for the XM Merger and the Pandora Acquisition.  We endeavor to compensate for the limitations of the Non-GAAP measure presented by also providing the comparable GAAP measure with equal or greater prominence and descriptions of the reconciling items, including quantifying such items, to derive the Non-GAAP measure.  Investors that wish to compare and evaluate our operating results after giving effect for these costs, should refer to net income as disclosed in our consolidated statements of comprehensive income.  Since adjusted EBITDA is a Non-GAAP financial performance measure, our calculation of adjusted EBITDA may be susceptible to varying calculations; may not be comparable to other similarly titled measures of other companies; and should not be considered in isolation, as a substitute for, or superior to measures of financial performance prepared in accordance with GAAP.  The reconciliation of net income to the adjusted EBITDA is calculated as follows:    Free cash flow - is derived from cash flow provided by operating activities, net of additions to property and equipment and purchases of other investments.  Free cash flow is a metric that our management and board of directors use to evaluate the cash generated by our operations, net of capital expenditures and other investment activity.  In a capital intensive business, with significant investments in satellites, we look at our operating cash flow, net of these investing cash outflows, to determine cash available for future subscriber acquisition and capital expenditures, to repurchase or retire debt, to acquire other companies and to evaluate our ability to return capital to stockholders.  We exclude from free cash flow certain items that do not relate to the on-going performance of our business, such as cash flows related to acquisitions, strategic and short-term investments, and net loan activity with related parties and other equity investees.  We believe free cash flow is an indicator of the long-term financial stability of our business.  Free cash flow, which is reconciled to \"Net cash provided by operating activities,\" is a Non-GAAP financial measure.  This measure can be calculated by deducting amounts under the captions \"Additions to property and equipment\" and deducting or adding Restricted and other investment activity from \"Net cash provided by operating activities\" from the consolidated statements of cash flows.  Free cash flow should be used in conjunction with other GAAP financial performance measures and may not be comparable to free cash flow measures presented by other companies.  Free cash flow should be viewed as a supplemental measure rather than an alternative measure of cash flows from operating activities, as determined in accordance with GAAP.  Free cash flow is limited and does not represent remaining cash flows available for discretionary expenditures due to the fact that the measure does not deduct the payments required for debt maturities.  We believe free cash flow provides useful supplemental information to investors regarding our current cash flow, along with other GAAP measures (such as cash flows from operating and investing activities), to determine our financial condition, and to compare our operating performance to other communications, entertainment and media companies.  Free cash flow is calculated as follows:ARPU - Sirius XM ARPU is derived from total earned subscriber revenue (excluding revenue associated with our connected vehicle services), advertising revenue, divided by the number of months in the period, divided by the daily weighted average number of subscribers for the period.  Pandora ARPU is defined as average monthly subscriber revenue per paid subscriber on our Pandora subscription services.  Subscriber acquisition cost, per installation - or SAC, per installation, is derived from subscriber acquisition costs and margins from the sale of radios and accessories (excluding connected vehicle services), divided by the number of satellite radio installations in new vehicles and shipments of aftermarket radios for the period.  SAC, per installation, is calculated as follows: Ad supported listener hours - is based on the total bytes served over our Pandora advertising supported platforms for each track that is requested and served from our Pandora servers, as measured by our internal analytics systems, whether or not a listener listens to the entire track. For non-music content such as podcasts, episodes are divided into approximately track-length parts, which are treated as tracks. To the extent that third-party measurements of advertising hours are not calculated using a similar server-based approach, the third-party measurements may differ from our measurements.RPM - is calculated by dividing advertising revenue, excluding AdsWizz and other off-platform revenue, by the number of thousands of listener hours on our Pandora advertising-based service.LPM - is calculated by dividing advertising licensing costs by the number of thousands of listener hours on our Pandora advertising-based service.LPU - is calculated by dividing subscriber licensing costs by the number of paid subscribers on our Pandora subscription services.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com. FORWARD-LOOKING STATEMENTSThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements. The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other three facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018 and our Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, in each case, as filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov ). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMContact for SiriusXM:Hooper Stevens212-901-6718Hooper.stevens@siriusxm.comPatrick Reilly212-901-6646patrick.reilly@siriusxm.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-reports-fourth-quarter-and-full-year-2019-results-300998087.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM Declares Quarterly Cash Dividend",
        "subtitle": "",
        "date": "Jan 30, 2020 4:01PM EST",
        "content": "NEW YORK, Jan. 30, 2020 /PRNewswire/ -- SiriusXM today announced that its Board of Directors declared a regular quarterly cash dividend of $0.01331 per share of common stock, payable in cash on February 28, 2020 to stockholders of record at the close of business on February 12, 2020.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.FORWARD-LOOKING STATEMENTSThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other three facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018 and our Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, in each case, as filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov ). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMInvestor Relations contact:Hooper Stevens212-901-6718hooper.stevens@siriusxm.comChris Leal212-584-5236Chris.leal@siriusxm.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-declares-quarterly-cash-dividend-300996434.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "Hallmark Channel Radio Returns to SiriusXM Celebrating Valentine's Day and the Season of Love",
        "subtitle": "",
        "date": "Jan 29, 2020 10:00AM EST",
        "content": "NEW YORK, Jan. 29, 2020 /PRNewswire/ -- SiriusXM and Hallmark Channel announced today the return of Hallmark Channel Radio with \"Love Ever After,\" celebrating popular and timeless love songs with stories and tales of love by Hallmark Channel's favorite stars.   SiriusXM's Hallmark Channel Radio will celebrate love all month long beginning Friday, January 31 at 9 am ET through Sunday, March 1 at 3:00 am ET on SiriusXM channel 70 and through the SiriusXM app. SiriusXM's Hallmark Channel Radio kicks off in conjunction with Hallmark Channel's February \"Love Ever After\" programming featuring all-new original movies and pet television specials. Hosted by one of the network's most beloved stars, Lacey Chabert, SiriusXM's love-themed Hallmark Channel Radio will feature favorite love songs including tracks from artists such as Michael Bublé, Billy Joel, Elton John, Celine Dion, Frank Sinatra, Natalie Cole and more.  In addition, Hallmark Channel stars including Luke Macfarlane, Wes Brown, Larissa Wohl and Alison Sweeney, among others, will share their favorite Valentine's Day memories, traditions, love stories and fairy tale pet adoption stories with SiriusXM subscribers. Hallmark Channel will celebrate \"Love Ever After\" throughout February with all-new romantic movies and the biggest pet specials of the year including Cat Bowl II, Kitten Bowl VII, and the 2020 American Rescue Dog Show. SiriusXM's Hallmark Channel Radio will return this June celebrating June Weddings with timeless wedding love songs aligned with their June Weddings programming. SiriusXM subscribers can find Hallmark Channel Radio (channel 70) on SiriusXM radios and those with streaming access can listen online, on-the-go with the SiriusXM mobile app and at home on a wide variety of connected devices including smart TVs, Amazon Alexa devices, Apple TV, PlayStation, Roku, Sonos speakers and more. SiriusXM's popular Love Channel will move to channel 291 and will be available via streaming platforms throughout February.ABOUT HALLMARK CHANNELHallmark Channel, owned by Hallmark Cards, Inc., is Crown Media Family Networks' flagship 24-hour cable television network, distributed nationwide in high definition (HD) and standard definition (SD) to 80 million homes.  As the country's leading destination for quality family entertainment, Hallmark Channel delivers on the 100-year legacy of the Hallmark brand.  In addition to its signature new, original movies, the network features an ambitious lineup of other new, original content, including scripted primetime series, such as \"Good Witch,\" \"When Calls the Heart\" and \"Chesapeake Shores\"; annual specials including \"Kitten Bowl\" and \"Hero Dog Awards\"; and a daily, two-hour lifestyle show, \"Home & Family.\"  Additionally, Hallmark Channel is the exclusive home to world premiere presentations of the acclaimed Hallmark Hall of Fame franchise.  Dedicated to helping viewers celebrate life's special moments, Hallmark Channel also offers annual holiday programming franchises, including \"Countdown to Christmas,\" \"Love Ever After,\" \"Summer Nights,\" \"Fall Harvest\" and \"Winterfest.\"  Rounding out the network's diverse slate are some of television's most beloved comedies and series, including \"The Golden Girls\" and \"Frasier.\" For more information, please visit www.crownmediapress.comTo visit the network website, please visit www.hallmarkchannel.com Hallmark Channel on Social Media: Facebook, Twitter, Pinterest, YouTubeAbout SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the world's largest audio entertainment company, and the premier programmer and platform for subscription- and advertising-supported audio products. With the recent addition of Pandora, the largest streaming music provider in the U.S., SiriusXM reaches more than 100 million people with its audio products. For more about the new SiriusXM, please go to: SiriusXM.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contact:Amy Galleazzi212-901-6552Amy.galleazzi@siriusxm.comCarolina Dubon646-313-2293Carolina.dubon@siriusxm.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/hallmark-channel-radio-returns-to-siriusxm-celebrating-valentines-day-and-the-season-of-love-300995052.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "The Biggest Stars in Sports and Entertainment Converge on SiriusXM for Super Bowl LIV Week",
        "subtitle": "",
        "date": "Jan 22, 2020 2:46PM EST",
        "content": "NEW YORK, Jan. 22, 2020 /PRNewswire/ -- SiriusXM today announced an exceptional week of programming for Super Bowl LIV in Miami Beach, offering multiple live broadcasts of the game in seven languages, a dedicated Super Bowl LIV pop up channel, plus a wide-ranging mix of sports, entertainment and music programming that will connect listeners with many of today's biggest stars.On Sunday, February 2 (6:00 pm ET), SiriusXM's coverage of Super Bowl LIV from Hard Rock Stadium in Miami Gardens will showcase nine different game broadcasts to choose from including:All game broadcasts are available on SiriusXM radios, as well as on the SiriusXM app for authenticated subscribers with the SiriusXM All Access package. More info can be found here: SiriusXM.com/SuperBowlLIVDuring the Pepsi Super Bowl LIV Halftime Show, SiriusXM will offer listeners a live broadcast of the on-field musical performance by Jennifer Lopez and Shakira on both Pop2K (SiriusXM 10) and Super Bowl LIV Radio (SiriusXM 105). SiriusXM's 24/7 NFL channel - SiriusXM NFL Radio (channel 88) - will broadcast live from Radio Row at the Miami Convention Center throughout Super Bowl Week.  SiriusXM NFL Radio hosts in Miami will include Pro Football Hall of Fame inductee Gil Brandt, David Diehl, Bruce Gradkowski, Torry Holt, Pat Kirwan, Ed McCaffrey, Jim Miller, Kirk Morrison, Brady Quinn, Charlie Weis, Solomon Wilcots, Alex Marvez, Bruce Murray, John Clayton and Howard Balzer.Pro Football Hall of Famer and \"NFL 100 All-Time Team\" honoree Brett Favre will host a special edition of his SiriusXM NFL Radio show, The SiriusXM Blitz with Brett Favre, live from Radio Row on Friday, Jan. 31 at 11:00 am ET.On Saturday, February 1, SiriusXM NFL Radio will have live interviews from the red carpet before the annual NFL Honors event that salutes the top players and performers of the 2019 season, including the Walter Payton NFL Man of the Year presented by Nationwide, the AP Most Valuable Player, AP Coach of the Year and more.  Listeners will also hear live coverage of the announcement of the Pro Football Hall of Fame's Class of 2020.Super Bowl LIV Radio launches as a special week long pop-up channel on Monday, January 27 (SiriusXM channel 105).  The channel will be the home for highlights from the best programming happening across several SiriusXM channels during Super Bowl Week, and will also air the NFL press conferences featuring NFL Commissioner Roger Goodell and the halftime performers; content from the NFL 100 Greatest podcast series; replays of past Super Bowls; specials chronicling the storied history of Miami music; and more.  Throughout the week, Super Bowl LIV Radio will also be a source for fans seeking info on the NFL activities happening in Miami, including Super Bowl Experience and GameDay Fan Plaza, and game day specifics on transportation, parking, stadium security and more. Several other SiriusXM sports, entertainment and music channels will broadcast from the SiriusXM set on Radio Row, highlighted by a showcase day of programming on Friday, January 31. Earlier in the week, SiriusXM will present the SiriusXM & Pandora Opening Drive Super Concert Series, two free exclusive concerts on back-to-back nights in Miami.  GRAMMY® Award-winning duo The Chainsmokers will perform Wednesday, January 29, and GRAMMY® Award-nominated breakout star Lizzo will perform Thursday, January 30, both at The Fillmore Miami Beach at The Jackie Gleason Theater.  The Chainsmokers concert will air live Wednesday, January 29 at 9:00 pm ET on BPM (SiriusXM 51).  Lizzo's concert will air live Thursday, January 30 at 9:00 pm ET on The Heat (SiriusXM 46).  Highlights from Lizzo's performance will rebroadcast on SiriusXM Hits1 (SiriusXM 2).  Pandora NOW (SiriusXM 3) will replay The Chainsmokers and Lizzo performances back to back Saturday night, February 1, starting at 8:00 pm ET.  Other SiriusXM highlights for Super Bowl Week:SiriusXM's Mad Dog Sports Radio (channel 82) will broadcast live from Radio Row throughout the week, featuring shows hosted by Christopher 'Mad Dog' Russo, Adam Schein, Evan Cohen and Mike Babchik, Nick Wright, Steve Torre and Danny Kanell.On Thursday and Friday, SiriusXM NFL Radio will broadcast from 7:00 to 10:00 pm ET from the Tostito's Casa de Crunch at Super Bowl Live in Bayfront Park.  SiriusXM's Business Radio (SiriusXM 132) will broadcast the Wharton Moneyball show, hosted by Eric Bradlow, Shane Jensen, Cade Massey, and Adi Wyner, from Radio Row on Thursday at 2:00 pm ET.  On Wednesday and Thursday, SLAM! Radio (SiriusXM 145) will broadcast from Radio Row from 7:00 to 11:00 am ET.  Faction Talk's Rich Davis and Steve Covino will host The Covino & Rich Show on Radio Row Monday through Thursday at 11:00 am ET (SiriusXM 103).  About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contacts for SiriusXM:Andrew FitzPatrick, Andrew.FitzPatrick@SiriusXM.com Carolina Dubon, Carolina.Dubon@SiriusXM.com Kevin Bruns, Kevin.Bruns@SiriusXM.com View original content to download multimedia:http://www.prnewswire.com/news-releases/the-biggest-stars-in-sports-and-entertainment-converge-on-siriusxm-for-super-bowl-liv-week-300991580.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM's Scott Greenstein Named UJA-Federation of New York's Music Visionary of the Year",
        "subtitle": "",
        "date": "Jan 22, 2020 10:00AM EST",
        "content": "NEW YORK, Jan. 22, 2020 /PRNewswire/ -- UJA-Federation of New York has named Scott Greenstein, President and Chief Content Officer of SiriusXM, as its Music Visionary of the Year. Mr. Greenstein will be recognized for his exceptional professional accomplishments and commitment to philanthropy at the annual Music Visionary of the Year Award Luncheon on June 4, 2020, in New York City. \"Scott's vision and leadership have made an indelible impact on the world of music and entertainment,\" said Daniel Glass, president & founder of Glassnote Entertainment Group and vice chair of UJA's Entertainment, Media & Communications Division. \"Scott is the perfect recipient of this prestigious award because he is always ahead of the cultural and technology curve. He is responsible for the discovery and growth of so many careers.\"The Music Visionary Luncheon has been a must-attend event for the music industry for more than 20 years. The event attracts more than 600 of the most respected and well-regarded executives and an A-list roster of talent. Past honorees include Michele Anthony, Rob Stringer, Avery and Monte Lipman, Bob Pittman, Rich Bressler, John Sykes, Tom Poleman, Daniel Ek, Troy Carter, Daniel Glass, Tom Corson, and Julie Greenwald. Past performers include Lizzo, Eddie Vedder, Dan + Shay, Leon Bridges, Alessia Cara, Alicia Keys, Bruno Mars, Justin Timberlake, Adele, Mariah Carey, Jay-Z, The Weeknd, Jennifer Hudson, and many more.Funds raised at the luncheon go to UJA's annual campaign and help support the Music for Youth initiative, which provides music education programs for underprivileged children and children with special needs throughout the New York community. About UJA-Federation of New YorkFor more than 100 years, UJA-Federation has brought New Yorkers together to solve some of the most pressing problems facing our community. Through UJA-Federation, more than 50,000 donors impact the issues that matter most to them, pooling their resources to care for Jews everywhere and New Yorkers of all backgrounds, respond to crises close to home and far away, and shape our Jewish future. Working with a network of hundreds of nonprofits, UJA-Federation extends its reach from New York to Israel to nearly 70 other countries around the world, touching 4.5 million people each year. For more information on how to donate or volunteer, please visit our website at www.ujafedny.org. About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.PRESS CONTACTS:UJA-Federation of New YorkShari Harelharels@ujafedny.orgSiriusXM Patrick ReillyPatrick.Reilly@SiriusXM.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxms-scott-greenstein-named-uja-federation-of-new-yorks-music-visionary-of-the-year-300991338.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM Announces Extensive Broadcast Lineup for 2020 PGA Merchandise Show",
        "subtitle": "",
        "date": "Jan 16, 2020 3:00PM EST",
        "content": "NEW YORK, Jan. 16, 2020 /PRNewswire/ -- SiriusXM today announced its extensive coverage for this year's PGA Merchandise Show, the industry's MAJOR of Golf Business, (Jan. 21-24) in Orlando, Florida. SiriusXM PGA TOUR Radio, SiriusXM's exclusive 24/7 golf channel, will deliver four days of coverage from PGA Show Demo Day at the Orange County National Golf Center and the 2020 PGA Merchandise Show at the Orange County Convention Center, giving listeners special access to one of the biggest events on the golf calendar that is otherwise not open to the public. The SiriusXM PGA TOUR Radio channel is available to listeners nationwide on SiriusXM radios (Sirius channel 208, XM channel 92), on the SiriusXM app and on a wide variety of connected devices and speakers. For more go to SiriusXM.com/SiriusXMPGATOURRadio.This year's coverage is highlighted by six feature event SiriusXM Town Hall broadcasts from the PGA Forum Stage that will bring together some of the most successful and experienced personalities from the world of golf to focus on key aspects of the game and the business.  SiriusXM's PGA Merchandise Show Town Halls will spotlight:Entrepreneurship:World Golf Hall of Fame member Greg Norman, PGA will bring his unparalleled acumen as both a player and businessman to the PGA Forum Stage for a special Town Hall-style edition of his SiriusXM show, Attack Life Radio, focusing on entrepreneurship and what it takes to succeed in the business that supports the game.  Norman's featured guests will be PGA of America CEO Seth Waugh and former NFL QB Ron Jaworski, who owns and operates several golf courses.  Norman will also discuss the importance of fitness with renowned conditioning coach Joey Diovisalvi.When: Wed., Jan. 22 at 12:00 pm ET (Airs Live on SiriusXM PGA TOUR Radio)Teaching and Coaching:SiriusXM's annual Teaching and Coaching Town Hall will feature several of the game's prominent PGA and LPGA Instructors who are also regular SiriusXM hosts – Michael Breed, PGA; Debbie Doniger; Jim McLean, PGA; Larry Rinker, PGA and David Armitage, PGA.When: Wed., Jan. 22 at 1:00 pm ET (The show will air on SiriusXM PGA TOUR Radio that night at 10:00 pm ET).Junior Golf:PGA President Suzy Whaley, PGA; SiriusXM's Carl Paulson; andPGA Jr. League Captains Mike Suhre, PGA and Jason Witczak, PGA will discuss growing the game for young players.When: Thurs., Jan. 23 at 12:00 pm ET (Airs Live on SiriusXM PGA TOUR Radio)The Role of PGA Professionals in the Game:SiriusXM host and eight-time PGA Tour winner Brad Faxon, PGA will sit down with five respected and experienced club professionals – Bob Ford, PGA (Seminole G.C. and Oakmont G.C.), Jack Druga, PGA (Shinnecock Hills, G.C.), Keith Maxwell, PGA (Sunningdale G.C.), Jeff Warne, PGA (The Bridge G.C.) and Caroline Basarab, PGA – to discuss the important roles a PGA Professional plays in the game and business of golf.When: Thurs., Jan. 23 at 2:00 pm ET (The show will air on SiriusXM PGA TOUR Radio on Jan. 25, at 7:00 am ET).College Teaching & Coaching:Carl Paulson and some of the most successful collegiate coaches in golf – including NCAA Champion Conrad Ray (Stanford), Trey Jones (Florida State) and Frank Darby, PGA (St. Johns, Manhattan) – will share their thoughts on college coaching and mentoring up-and-coming players.When: Fri., Jan. 24 at 10:00 am ET (Airs Live on SiriusXM PGA TOUR Radio)The Growth of Women's Golf:SiriusXM host and top instructor Debbie Doniger; former college player and 34 Group CEO Patti Thomas; PGA teaching professional and women's golf league founder Mike D'Agostino, PGA; and Carl Paulson will discuss the growth of women's professional and amateur golf, and efforts to continue to increase female participation in the game.When: Fri., Jan. 24 at 11:00 am ET (Airs Live on SiriusXM PGA TOUR Radio)\"We're very excited and proud of our coverage of this year's PGA Merchandise Show,\" said Scott Greenstein, SiriusXM's President and Chief Content Officer.  \"Our six Town Hall events, more than we've ever done at the PGA Show before, will deliver important insight and conversation on some of the central topics and instructional practices in golf.  All of our programming, airing from Orlando and heard nationwide, will be enlightening for golf fans and anyone who is associated with the game.\" These Town Hall events and SiriusXM's coverage throughout the week will give listeners exclusive access to insights on the game from many of the world's foremost PGA Professionals, on shows hosted by many SiriusXM PGA TOUR Radio hosts, including former PGA Tour pros and several of the game's leading PGA Professionals.  (See schedule below.)SiriusXM PGA TOUR Radio Schedule from the PGA Merchandise Show: (All times ET)Tuesday, Jan. 21 – PGA Show Demo Day10 a.m. – 1 p.m.: Inside the Ropes with Carl Paulson and Dennis Paulson (live) 3 p.m. – 4 p.m.: On Course with Frank Darby, PGA and Brian Crowell, PGA (live)4 p.m. – 5 p.m.: Moment of Impact with Bill Price, PGA and Chris Voshall (live)5 p.m. – 7 p.m.: On Tap with Katrek and Maginnes with Brian Katrek and John Maginnes (live)Wednesday, Jan. 22 – PGA Merchandise Show7 a.m. – 8 a.m.: The Starter with Taylor Zarzour (live on SiriusXM set)8 a.m. – 10 a.m.: A New Breed of Golf (live on Titleist set)10 a.m. – 12 p.m.: Inside the Ropes (live on SiriusXM set) 12 p.m. – 1 p.m.: SiriusXM Town Hall: Entrepreneurship with Greg Norman, PGA (live on PGA stage)1 p.m. – 2 p.m.: SiriusXM Town Hall: Teaching and Coaching (live on PGA stage, taped for later airing on SiriusXM)2 p.m. – 3 p.m.: On Course (on SiriusXM set, taped for later airing)3 p.m. – 4 p.m.: Rinker's Golf Tips (on SiriusXM set, taped for later airing)3 p.m. – 4 p.m.: PGA of America Radio with David Marr III (live on PGA Stage)4 p.m. – 5 p.m.: Time to Let it Fly with Mark Lye (live on SiriusXM set)5 p.m. – 7 p.m.: On Tap with Katrek and Maginnes (live on SiriusXM set)10 p.m. – 11 p.m.: Airing of SiriusXM Town Hall: Teaching and CoachingThursday, Jan. 23 – PGA Merchandise Show7 a.m. – 8 a.m.: The Starter (live on SiriusXM set)8 a.m. – 10 a.m.: A New Breed of Golf (live on Titleist set)10 a.m. – 12 p.m.: Inside the Ropes (live on SiriusXM set) 12 p.m. – 1 p.m.: SiriusXM Town Hall: Junior Golf (live on PGA stage)2 p.m. – 3 p.m.: SiriusXM Town Hall: Club Pros (live on PGA stage, taped for later airing)Friday, Jan. 24 – PGA Merchandise Show10 a.m. – 11 a.m.: SiriusXM Town Hall: College Teaching & Coaching (live on PGA Stage) 11 a.m. – 12 p.m.: SiriusXM Town Hall: Women's Golf (live on PGA Stage)  12 p.m. – 1 p.m.: Inside the Ropes (live on SiriusXM set) SiriusXM PGA TOUR Radio will also provide listeners live play by play of all four rounds of the Farmers Insurance Open, starting at 1 p.m. ET/10 a.m. PT Thursday-Sunday. About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia contacts for SiriusXM:Kevin Bruns, Kevin.Bruns@SiriusXM.comAndrew FitzPatrick, Andrew.FitzPatrick@SiriusXM.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-announces-extensive-broadcast-lineup-for-2020-pga-merchandise-show-300988496.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM and Pandora Present The Chainsmokers & Lizzo Live from Miami Beach",
        "subtitle": "Chart Topping Artists Headline the SiriusXM & Pandora Opening Drive Super Concert Series",
        "date": "Jan 8, 2020 10:00AM EST",
        "content": "NEW YORK, Jan. 8, 2020 /PRNewswire/ -- Pandora and SiriusXM announced today that they are kicking off football's biggest weekend with the SiriusXM & Pandora Opening Drive Super Concert Series, two free exclusive concerts on back-to-back nights in Miami before the Big Game.  GRAMMY® Award-winning duo The Chainsmokers will perform Wednesday, January 29, and GRAMMY® Award-nominated breakout star Lizzo will perform Thursday, January 30, both at The Fillmore Miami Beach at The Jackie Gleason Theater. These exclusive events will be open to Pandora listeners and SiriusXM subscribers who are age 21 and over.  RSVP for The Chainsmokers show HERE.  RSVP for Lizzo's performance HERE.SiriusXM subscribers across the country can share in the excitement by listening to both shows on SiriusXM radios and the SiriusXM app.  The Chainsmokers concert will air live Wednesday, January 29 (9:00 pm ET) on BPM, SiriusXM channel 51. Lizzo's concert will air live Thursday, January 30 (9:00 pm ET) on The Heat, SiriusXM channel 46.  Highlights from Lizzo's performance will rebroadcast on SiriusXM Hits1, channel 2. Pandora NOW, SiriusXM channel 3, will replay The Chainsmokers and Lizzo performances back to back Saturday night, February 1, starting at 8 PM ET. Selections from Lizzo's live performance will also be made available on Pandora.\"We cannot wait to bring our full band show to such an intimate sized venue on the big game weekend with our good friends at Pandora and SiriusXM\" said The Chainsmokers.\"Hey SiriusXM and Pandora listeners,\" states Lizzo.  \"Look forward to performing for y'all in Miami!\"\"In a city known for big events, Pandora and SiriusXM will proudly present two of the biggest, can't-miss shows of the week in our Opening Drive Super Concert Series.  We are very excited to bring these stellar artists to both our live audiences in Miami Beach and to millions of listeners nationwide,\" said Scott Greenstein, President and Chief Content Officer of SiriusXM. \"The Chainsmokers and Lizzo are at the top of their game.  These are the one-of-a-kind experiences and performances that our listeners love and we at Pandora and SiriusXM love to deliver.\"Since their breakthrough in 2014, GRAMMY® Award-winning duo The Chainsmokers have evolved into a dominating musical force with a diverse repertoire of songs leading them to become one of music's hottest recording artists.  Collaborations with artists including Halsey, Coldplay, Bebe Rexha and others have landed them five Billboard Hot 100 Top 10 singles, close to 3 billion streams on Pandora and numerous appearances on the Pandora Top Spins chart.Lizzo will be making her first public performance at the SiriusXM Pandora stage following the 2020 GRAMMY® Awards where she leads with eight nominations including the highly coveted Album of the Year, Song of the Year and Best New Artist. Her breakthrough hit \"Truth Hurts\" had a Hot Streak on the Pandora Top Spins chart where it appeared for 19 straight weeks while her latest \"Good As Hell\" is currently sitting in the Top 5.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S.  SiriusXM and Pandora together reach more than 100 million people each month with their audio products.  SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada.  In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices.  For more about SiriusXM, please go to: www.siriusxm.com.About PandoraPandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S.  Pandora provides consumers a uniquely-personalized music and podcast listening experience with its proprietary Music Genome Project® and Podcast Genome Project® technology.  Pandora is also the leading digital audio advertising platform in the U.S. Through its own Pandora service, its AdsWizz platform, and third party services, such as SoundCloud, the Company connects brands to the largest ad-supported streaming audio marketplace in the country. Pandora is available through its mobile app, the web, and integrations with more than 2,000 connected products.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.Media Contacts:Heidi Anne-Noel201-892-1273hanne-noel@pandora.comCarolina Dubon646-313-2293Carolina.dubon@siriusxm.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-and-pandora-present-the-chainsmokers--lizzo-live-from-miami-beach-300983133.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM Introduces New Aftermarket Radio - SiriusXM Tour(TM) - Featuring SiriusXM with 360L",
        "subtitle": "SiriusXM's latest aftermarket radio combines satellite and streaming to deliver 300+ live channels of audio entertainment, 10,000 hours of On Demand Content, Personalized Stations Powered by Pandora and more",
        "date": "Jan 7, 2020 12:00PM EST",
        "content": "NEW YORK, Jan. 7, 2020 /PRNewswire/ -- SiriusXM today introduced its newest aftermarket radio – SiriusXM Tour™ – which can deliver subscribers the functionality of SiriusXM's next generation platform, SiriusXM with 360L, in a portable unit that can be used in the car and at home. SiriusXM Tour is on display this week at the Consumer Electronics Show (CES) in Las Vegas at the SiriusXM/Voxx booth (#13518) in the Central Hall of the Las Vegas Convention Center. Using SiriusXM with 360L functionality, SiriusXM Tour delivers content via both satellite and streaming, seamlessly switching between both. This gives listeners access to more than 300 live SiriusXM channels plus content from SiriusXM's On Demand library, which offers more than 10,000 hours of archived shows, exclusive interviews and audio documentaries. SiriusXM Tour will also feature SiriusXM's Personalized Stations Powered by Pandora, which employ Pandora's unrivaled listener personalization technology and draw from SiriusXM's music library to allow subscribers to create their own unique channels based on their favorite artists.\"SiriusXM with 360L is revolutionizing the way people listen to audio in the car, and with the all-new SiriusXM Tour plug and play radio new and existing subscribers will have the freedom to experience its benefits in the car and at home on an intuitive and user-friendly portable radio,\" said Joe Verbrugge, SiriusXM's EVP and Division President, Connected Vehicle.Like all of SiriusXM's dock and play radios, SiriusXM Tour is usable anywhere – in a vehicle, at home or in an office, and even outdoors – with available accessories. SiriusXM Tour can be connected to the Internet via WiFi connection in the home or mobile WiFi hotspot in the car. Additional features available on the SiriusXM Tour include: channel navigating and tuning via voice commands; personalized \"For You\" recommendations that are based on listening history and preferences; SiriusXM's 100+ Xtra Music Channels curated across genres and eras for any mood, occasion or activity; an enhanced sports play-by-play offering that makes it easier to find the favorite teams when it is game time and displays games in progress with scores; and the ability to receive software updates. SiriusXM Tour is expected to be available in May at retail locations and stores nationwide including Best Buy and SiriusXM.com. At launch, SiriusXM Tour can be purchased with a vehicle kit. Additional accessories will be available at retail locations and shop.siriusxm.com.SiriusXM Tour has not been authorized as required by the rules of the Federal Communications Commission. This device is not and may not be offered for sale or sold until such authorization is obtained. The content and features available on SiriusXM Tour will vary based on the SiriusXM subscription purchased. SiriusXM All Access is SiriusXM's most extensive subscription package and allows subscribers to enjoy the full breadth and depth of content. For more info on what channels and features are available on various SiriusXM subscriptions visit www.SiriusXM.com/subscriptions. About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other three facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018 and our Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, in each case, as filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication. Source: SiriusXM Media contacts for SiriusXM:Andrew FitzPatrick, Andrew.FitzPatrick@SiriusXM.comKevin Bruns, Kevin.Bruns@SiriusXM.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-introduces-new-aftermarket-radio--siriusxm-tour--featuring-siriusxm-with-360l-300982815.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "SiriusXM Beats 2019 Subscriber Guidance and Issues 2020 Guidance",
        "subtitle": "-Total Paid Subscriber Base Reaches Record-High 34.9 Million",
        "date": "Jan 7, 2020 8:30AM EST",
        "content": "NEW YORK, Jan. 7, 2020 /PRNewswire/ -- SiriusXM today announced it added 1.063 million net self-pay subscribers to finish 2019 with approximately 30 million self-pay subscribers, exceeding the company's initial 2019 subscriber guidance. The company also announced that it expects to meet or exceed its 2019 guidance for revenue, adjusted EBITDA and free cash flow.The company also issued 2020 subscriber and financial guidance, including:\"Last year was a milestone for SiriusXM. Not only did we achieve our tenth consecutive year of million-plus self-pay net additions, but we also completed our acquisition of Pandora Media and made significant investments in our business, all while returning more than $2 billion to our stockholders. And our new 2020 guidance points to what should be another excellent year of growth for SiriusXM,\" said Jim Meyer, SiriusXM's Chief Executive Officer.\"We're thrilled to start our year once again at the Consumer Electronics Show with so many new product and service launches to highlight. GM recently announced a broad rollout of our next-gen 360L hybrid satellite-IP architecture. GM anticipates it will produce about one million 360L-enabled vehicles this year. We recently announced a new creative collaboration with U2 to create an exclusive U2X RADIO Channel for SiriusXM and exclusive content for Pandora listeners. And we look forward this year to debuting exclusive content across SiriusXM and Pandora from Marvel and platinum selling recording artist Drake,\" added Meyer.SiriusXM also announced today that it plans to release full-year and fourth quarter 2019 financial and operating results on Tuesday, February 4, 2020. The company will hold a conference call at 8:00 am ET the same day to discuss these results. Investors and the press can listen to the conference call via the company's website at investor.siriusxm.com.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com. FORWARD-LOOKING STATEMENTSThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other three facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018 and our Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, in each case, as filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMContacts for SiriusXM:Investors:Hooper Stevens212-901-6718hooper.stevens@siriusxm.comMedia:Patrick Reilly212-901-6646patrick.reilly@siriusxm.com View original content to download multimedia:http://www.prnewswire.com/news-releases/siriusxm-beats-2019-subscriber-guidance-and-issues-2020-guidance-300982259.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "David Frear to Present at the Citi 2020 TMT West Conference",
        "subtitle": "",
        "date": "Jan 6, 2020 1:21PM EST",
        "content": " NEW YORK, Jan. 6, 2020 /PRNewswire/ -- SiriusXM today announced that David Frear, Senior Executive Vice President and Chief Financial Officer, is scheduled to speak at the Citi 2020 TMT West Conference tomorrow, Tuesday, January 7, 2020 at approximately 11:45 am ET.An audio webcast of the presentation will be available via the Investor Relations section of the company's website, www.siriusxm.com/investorrelations. About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in the U.S., and the premier programmer and platform for subscription and digital advertising-supported audio products. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM and Pandora together reach more than 100 million people each month with their audio products. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in Canada. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers and directly to consumers through aftermarket devices. For more about SiriusXM, please go to: www.siriusxm.com.FORWARD-LOOKING STATEMENTSThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other three facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018 and our Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, in each case, as filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov ). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMContact for SiriusXM:Hooper Stevens212-901-6718Hooper.Stevens@siriusxm.comChris Leal212-584-5236Chris.Leal@siriusxm.com View original content to download multimedia:http://www.prnewswire.com/news-releases/david-frear-to-present-at-the-citi-2020-tmt-west-conference-300981858.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "EyeLock to Debut Prototype of In-Vehicle Iris Authentication for SiriusXM's e-Wallet",
        "subtitle": "",
        "date": "Jan 6, 2020 8:00AM EST",
        "content": " LAS VEGAS, Jan. 6, 2020 /PRNewswire/ -- LVCC, CENTRAL HALL, BOOTH 13517 – Today at CES® 2020, EyeLock LLC, a wholly-owned subsidiary of VOXX International (NASDAQ: VOXX), in collaboration with SiriusXM (NASDAQ: SIRI), announced that it is demonstrating a prototype of a highly secure, iris biometric touchless gateway to the multiple services that the SiriusXM e-Wallet plans to offer.SiriusXM plans to offer the e-Wallet to automakers who deploy SiriusXM's connected vehicle services, which serves multiple major automotive brands. Using EyeLock's proprietary iris biometric authentication technology as the secure access, the SiriusXM e-Wallet is being designed to integrate into the vehicle and will allow drivers and their passengers to make purchases for everyday needs while on-the-go: shop and pay for coffee, find and pre-pay for gas, locate and pay for parking, purchase movie tickets, seamlessly pay tolls, and more. CES attendees and invited guests can see how the EyeLock prototype will activate and authenticate a payment through voice and touchscreen commands and eliminate driver distractions during the transaction. EyeLock's custom-designed, visor-mounted prototype will grant an enrolled driver secure access to the e-Wallet, with passenger authentication taking place in under one second. SiriusXM will demonstrate the EyeLock prototype on two different vehicle models at the show.\"We are thrilled to team with SiriusXM to deliver highly secure biometric solutions in the automotive marketplace. SiriusXM's network of automotive manufacturers and established consumer interfaces, combined with our security expertise, will help keep drivers safe and secure with the highest form of biometric authentication,\" said Jeff Carter, CEO of EyeLock. In order to implement these services, SiriusXM intends to establish virtual payment relationships with a wide-ranging network of retailers and expects to provide advanced authentication capabilities for greater security. This current suite of services is expected to be showcased to automobile manufacturers in 2020.CES (the Consumer Electronics Show) is the world's gathering place for all who thrive on the business of consumer technology. Owned and produced by the Consumer Technology Association™, it has served as the proving ground for innovators and breakthrough technologies for over 50 years. This year's show runs January 7-10 in Las Vegas, Nevada.About EyeLock  EyeLock LLC is an acknowledged leader in advanced iris authentication for the Internet of Things (IoT), providing the highest level of security with EyeLock ID™ technology. Iris authentication is highly secure because no two irises are alike, and the iris is the most accurate human identifier other than DNA. The Company's significant IP portfolio, including more than 75 patents and patents pending, and proprietary technology enable the convenient and secure authentication of individuals across physical and logical environments. EyeLock's solutions have been integrated and embedded across consumer and enterprise products and platforms, eliminating the need for PINs and passwords. Corporations across the Fortune 500 recognize the level of security EyeLock provides due in part to its extremely high false acceptance rate, ease of use, and scalability. For more information about EyeLock, please visit www.eyelock.com.About VOXX International Corporation  VOXX International Corporation (NASDAQ: VOXX) has grown into a worldwide leader in many automotive and consumer electronics and accessories categories, as well as premium high-end audio. Today, VOXX International is a global company, with an extensive distribution network that includes power retailers, mass merchandisers, 12-volt specialists and most of the world's leading automotive manufacturers. The Company has an international footprint in Europe, Asia and Latin America, and a growing portfolio which is comprised of over 30 trusted brands. For additional information, please visit our website at www.voxxintl.com.VOXX International Media Relations Contacts:  Larissa Goulding  Email: LGoulding@voxxintl.com Glenn Wiener  Phone: (212) 786-6011  Email: GWiener@gwcco.com   View original content:http://www.prnewswire.com/news-releases/eyelock-to-debut-prototype-of-in-vehicle-iris-authentication-for-siriusxms-e-wallet-300981169.htmlSOURCE  EyeLock, LLC"
    },
    {
        "title": "Coldplay to Perform Exclusive Stripped-Down Set in Los Angeles for SiriusXM and Pandora on January 15",
        "subtitle": "Special Invitation Only Performance for Subscribers, and Audience Q&A, at SiriusXM's Garage performance space in Hollywood; will air live on The Spectrum (ch. 28) and highlights on Pandora Story",
        "date": "Jan 3, 2020 10:00AM EST",
        "content": "NEW YORK, Jan. 3, 2020 /PRNewswire/ -- SiriusXM and Pandora announced today that seven-time Grammy Award winners, Coldplay will perform an intimate invitation-only stripped down set for SiriusXM and Pandora listeners on Wednesday, January 15 at The Garage performance space in SiriusXM's newly expanded west coast studios in Hollywood.  The performance will feature Chris Martin and Jonny Buckland from the band joined by special musical guests.  Martin and Buckland will also participate in a Q&A session with a select group of audience members. The acoustic performance, which follows the recent release of their eighth studio album, Everyday Life, will feature music spanning the influential band's career. Coldplay's performance will broadcast live on Wednesday, January 15 at 7 p.m. PT/10 p.m. ET via SiriusXM's The Spectrum (ch.28), with replays on Alt Nation (ch 36) to be announced.  Highlights from the Q&A and performance will be included in an expanded edition of Coldplay's Pandora Story, focusing on the band's latest album.\"This special performance by one of the world's most popular bands in a truly unique venue will be a special night for those attending and listeners nationwide,\" said Scott Greenstein, President and Chief Content Officer of SiriusXM. \"Since we've expanded our presence in Los Angeles, we have wanted to make The Garage, our state-of-the-art performance space in Hollywood, a go-to destination for a range of artists, and an up-close experience for our subscribers. Coldplay performing there is the one-of-a-kind moment we've envisioned and are eager to bring our listeners.\"SiriusXM subscribers will have the opportunity to win tickets to this private performance through an invitation sent via e-mail to qualified subscribers who have consented to receive e-mail marketing from SiriusXM and who have registered their music interests with us at siriusxm.com/perks. Pandora fans will have a similar opportunity based upon their listening histories. Additionally, SiriusXM subscribers since December 5, 2019 will be able to enter for the chance to win a trip for two to Los Angeles, CA, including airfare, hotel stay, and a pair of passes to SiriusXM and Pandora Present Coldplay. See Official Rules for complete details at siriusxm.com/coldplayLA. Since its inception as the new state-of-the-art performance space at SiriusXM's Hollywood studios, The Garage has hosted a variety of live music performances in addition to talk and comedy performances, and special events. Coldplay will become the first band to play the space in 2020, following artists such as Dave Matthews, Beck, Billy Idol, among others.SiriusXM subscribers are able to listen to The Spectrum (channel 28) on SiriusXM radios, and those with streaming access can listen online, on-the-go with the SiriusXM mobile app, and at home on a wide variety of connected devices, including smart TVs, devices with Amazon Alexa or the Google Assistant, Apple TV, PlayStation, Roku, Sonos speakers and more. Go to www.SiriusXM.com/streaming to learn more.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the world's largest audio entertainment company, and the premier programmer and platform for subscription- and advertising-supported audio products. With the recent addition of Pandora, the largest streaming music provider in the U.S., SiriusXM reaches more than 100 million people with its audio products. For more about the new SiriusXM, please go to: www.siriusxm.com.This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract or increase the number of subscribers, which is uncertain; our ability to profitably attract and retain more price-sensitive consumers; failure to protect the security of personal information about our customers; interference to our service from wireless operations; a decline in the effectiveness of our extensive marketing efforts; consumer protection laws and their enforcement; our failure to realize benefits of acquisitions or other strategic initiatives, including the acquisition of Pandora Media, Inc.; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications systems; rapid technological and industry changes; failure of third parties to perform; our failure to comply with FCC requirements; modifications to our business plan; our indebtedness; damage to our studios, networks or other facilities as a result of terrorism or natural catastrophes; our principal stockholder has significant influence over our affairs and over actions requiring stockholder approval and its interests may differ from interests of other holders of our common stock; impairment of our business by third-party intellectual property rights; and changes to our dividend policies which could occur at any time. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2018, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.Source: SiriusXMMedia Contacts for SiriusXM:Angela Burke Angela.burke@siriusxm.com Carolina DubonCarolina.dubon@siriusxm.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/coldplay-to-perform-exclusive-stripped-down-set-in-los-angeles-for-siriusxm-and-pandora-on-january-15-300980851.htmlSOURCE  Sirius XM Holdings Inc."
    },
    {
        "title": "General Motors Offers SiriusXM with 360L on Nearly 1 Million Vehicles",
        "subtitle": "Next-generation in-vehicle listening experience combines satellite and streaming to deliver more channels, on-demand audio and better personalization",
        "date": "Dec 17, 2019 10:00AM EST",
        "content": " DETROIT, Dec. 17, 2019 /PRNewswire/ -- General Motors is bringing a new way to listen to music, sports and talk shows to nearly 1 million Chevrolet, Buick, GMC and Cadillac owners with SiriusXM with 360L. Available on select 2020 model year vehicles, the rollout is the broadest integration by any automaker of SiriusXM's next generation listening experience. SiriusXM with 360L represents the future of in-vehicle audio entertainment. The new platform and easy-to-use interface delivers content via both satellite and streaming to give drivers and their passengers more than 200 live SiriusXM channels, plus the ability to make on-demand programming choices from a library of more than 10,000 hours of SiriusXM content – including SiriusXM exclusive interviews, shows and performances. SiriusXM with 360L's \"For You\" recommendations also make it easier to find the programming that drivers and passengers love. \"Whether on a road trip, dropping off the kids at school or on their daily commute, drivers can get more choice in entertainment with our embedded SiriusXM with 360L experience,\" said Santiago Chamorro, vice president for Global Connected Services, GM. \"By bringing SiriusXM with 360L to nearly 1 million drivers, we are making it easier than ever for our customers to listen to their favorite SiriusXM channels or on-demand content.\" Additionally, Chevrolet, Buick, GMC and Cadillac drivers in the United States with a Remote Access Plan can now set up their SiriusXM \"Favorites\" through the myChevrolet, myBuick, myGMC or myCadillac mobile apps1 – even if they're not in the vehicle – and the selections will sync to the infotainment system. Drivers can also check and manage their SiriusXM subscription right from their myChevrolet, myBuick, myGMC or myCadillac mobile app. A three-month subscription to SiriusXM All Access is included for customers who purchase equipped 2020 vehicle models, meaning those customers can enjoy the benefits of SiriusXM in the vehicle, and also listen outside the vehicle on the SiriusXM app. Customers can also download the SiriusXM app through their myChevrolet, myBuick, myGMC or myCadillac mobile app. \"General Motors has always been a leader in delivering innovative technology to their customers and our SiriusXM with 360L platform is a great example of this,\" said Steve Cook, EVP, Sales and Automotive, for SiriusXM.  \"SiriusXM with 360L transforms the way we listen to audio in the car by marrying our satellite network to embedded connectivity in vehicles. This allows for significantly more channels and choices than ever before while also making it easier than ever for our subscribers to find and listen to what they want to hear. This truly changes the way people will expect to be entertained in the car.\" The benefits of SiriusXM with 360L include: More varietyA more personalized experienceEase of useSiriusXM with 360L will be available on 13 Chevrolet, Buick, GMC and Cadillac model year 2020 vehicles. A Connected Access plan and a SiriusXM All Access or SiriusXM Select subscription is required to experience the benefits of SiriusXM with 360L. More information about vehicle eligibility will be shared as the vehicles hit dealer lots. About General MotorsGeneral Motors is a global company committed to delivering safer, better and more sustainable ways for people to get around. General Motors, its subsidiaries and its joint venture entities sell vehicles under the Chevrolet, Buick, GMC, Cadillac, Holden, Baojun and Wuling brands. More information on the company and its subsidiaries, including OnStar, a global leader in vehicle safety and security services, Maven, its personal mobility brand and Cruise, its autonomous vehicle ride-sharing company, can be found at http://www.gm.com.About SiriusXMSirius XM Holdings Inc. (NASDAQ: SIRI) is the world's largest audio entertainment company, and the premier programmer and platform for subscription- and advertising-supported audio products. With the recent addition of Pandora, the largest streaming music provider in the U.S., SiriusXM reaches more than 100 million people with its audio products. For more about the new SiriusXM, please go to: www.siriusxm.com.1 Available on select Apple and Android devices. Service availability, features and functionality vary by vehicle, device and the plan you are enrolled in. User terms apply. Device data connection required. See onstar.com for details and limitations. View original content:http://www.prnewswire.com/news-releases/general-motors-offers-siriusxm-with-360l-on-nearly-1-million-vehicles-300976098.htmlSOURCE  General Motors Co."
    }
]