[
    {
        "title": "Samsung Adopts Synopsys' Machine Learning-Driven IC Compiler II for its Next-Generation 5nm Mobile SoC Design",
        "subtitle": "",
        "date": "Mar 4, 2020 2:00PM EST",
        "content": "MOUNTAIN VIEW, Calif., March 4, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS) today announced that Samsung has adopted the industry-leading IC Compiler™ II place-and-route solution, part of the Synopsys Fusion Design Platform™, for its next-generation 5nm mobile system-on-chip (SoC) production design. In order to meet the aggressive design goals of this complex SoC, Samsung employed IC Compiler II's cutting-edge machine learning technologies resulting in significant QoR and productivity boosts of up to five percent higher frequency, five percent lower leakage power and faster TAT. The rapid development of Samsung's high-volume mobile SoC marks an important milestone as the first production design at Samsung to leverage IC Compiler II's ML-implementation technologies. \"We constantly look for ground-breaking technologies from EDA vendors to enable pushing the power, performance and area (PPA) envelope for our next-generation products,\" said Youngmin Shin, vice president of System LSI Design Technology at Samsung Electronics. \"Machine learning-driven chip design represents a paradigm shift which delivers a significant QoR and productivity leap required to tackle the mounting challenges of smaller geometries. We are extremely impressed with Synopsys for making the ML vision a reality in IC Compiler II and delivering exceptional QoR results.\" ML offers opportunities to enable self-optimizing design tools that can continuously learn and improve in customer environments, giving Synopsys a new arsenal of solutions for today's demanding semiconductor market. ML-driven capabilities in Synopsys' IC Compiler II and Fusion Compiler™ implementation solution capture design behavior at multiple stages of design evolution, offering upstream engines faster and accurate visibility into complex downstream effects - allowing designers to achieve new levels of productivity and QoR. Today's announcement is part of a multi-year initiative and strategic investment in ML technology at Synopsys' Design Group, aimed at enabling an orchestrated, self-optimizing design environment with ML, everywhere.\"Synopsys' investment into machine learning-driven implementation and signoff has opened up new avenues to further extend our PPA leadership with unsurpassed design QoR and TTR,\" said Sanjay Bali, vice president of marketing, Design Group at Synopsys. \"Through deep collaborations with our technology-leading partners like Samsung, we are able to develop and deploy machine-learning technologies to help customers realize their ultra-complex chip designs.\" About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Simone Souza Synopsys, Inc. 650-584-6454simone@synopsys.com View original content:http://www.prnewswire.com/news-releases/samsung-adopts-synopsys-machine-learning-driven-ic-compiler-ii-for-its-next-generation-5nm-mobile-soc-design-301016539.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Co-CEO Aart de Geus to Speak at Morgan Stanley Technology, Media & Telecom Conference",
        "subtitle": "",
        "date": "Feb 27, 2020 4:05PM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 27, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that Aart de Geus, chairman and co-CEO, will speak at the Morgan Stanley Technology, Media and Telecom Conference on Mar. 5, 2020. This event will be broadcast live on the Internet via the Synopsys corporate website at https://www.synopsys.com/company/investor-relations.html, on Thursday, Mar. 5, 2020, at 9:45 a.m. PT (12:45 p.m. ET).  The webcast replay of the presentation will be available at the Synopsys corporate website approximately one hour following the conclusion of the live event, and remain available for six months. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.     Investor Contact:Roberta ReidSynopsys, Inc.(650) 584-1901  View original content:http://www.prnewswire.com/news-releases/synopsys-co-ceo-aart-de-geus-to-speak-at-morgan-stanley-technology-media--telecom-conference-301012924.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Announces Next-Generation VC SpyGlass RTL Static Signoff Platform",
        "subtitle": "",
        "date": "Feb 27, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 27, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS), today announced general availability of the VC SpyGlass™ RTL Static Signoff platform, part of the Synopsys Verification Continuum™ platform, which builds on the proven SpyGlass® technology. The VC SpyGlass platform with multi-core support increases performance by 3X with half the memory footprint. The next-generation platform is enhanced with machine learning technology to reduce noise by 10X with no loss in quality of results using trusted industry-standard SpyGlass engines. \"The noise reduction technology in VC SpyGlass enabled us to focus on debugging real issues and discover clock domain crossing issues previously not found,\" said Duen-Min Wang, SoC Engineering Director at SK Hynix. \"In addition, the consistent design behavior between VC SpyGlass and Synopsys Design Compiler reduced our design setup to a single day, with more flexible debug and custom constraints settings.\" Increasing SoC complexity demands verifying correct construction of RTL, clock domain crossing (CDC), and reset domain crossing (RDC) early in the RTL phase of development. Synopsys VC SpyGlass integrates advanced algorithms and analysis techniques that provides designers detailed information and insights about their design much earlier in the RTL phase. It provides a tightly integrated solution for formal-enabled linting to reduce noise and comprehensive CDC and RDC analysis to catch logic issues added during implementation. VC SpyGlass is also natively integrated with Synopsys' Verdi® automated debug system to accelerate root cause analysis for bugs. In addition, the VC SpyGlass platform uses design behavior and Tcl flow consistent with Synopsys' Design Compiler® and PrimeTime® tools to significantly reduce setup time between implementation and verification flows.   \"Insufficient or incorrect constraints are the primary reason for a large number of violations, which increases our debug cycles,\" said Hideyuki Okabe, director of the Digital Design Technology Department, Shared R&D Division, IoT and Infrastructure Business Unit at Renesas Electronics Corporation. \"The new machine learning technology in VC SpyGlass will help our design teams to significantly reduce the number of false CDC violations to debug, enabling much faster identification of root cause.\" \"A tightly integrated RTL static verification platform is essential for customers to accelerate time to market and reduce iterations,\" said Rajiv Maheshwary, VP of marketing and business development in the Verification Group at Synopsys. \"VC SpyGlass delivers 3X higher performance, multi-billion gate capacity, and 10X less noise. Coupled with tight integration of Lint, CDC and RDC analysis, and compatibility with the implementation flow, SoC teams are able to increase overall productivity and accelerate RTL static signoff.\"Availability and Resources The Synopsys VC SpyGlass RTL static signoff platform is available now. Current SpyGlass users can easily upgrade to VC SpyGlass, using existing rules and scripts.About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Simone Souza Synopsys, Inc. 650-584-6454simone@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-announces-next-generation-vc-spyglass-rtl-static-signoff-platform-301012496.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Initiates $100 Million Accelerated Share Repurchase Agreement",
        "subtitle": "",
        "date": "Feb 27, 2020 9:00AM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 27, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that it has entered into an accelerated share repurchase agreement (ASR) with JPMorgan Chase Bank, National Association to repurchase an aggregate of $100 million of Synopsys stock.Under the terms of the ASR, Synopsys will receive an aggregate initial share delivery of approximately 563K shares, with the remainder, if any, to be settled on or before May 15, 2020, upon completion of the repurchases. The specific number of shares that Synopsys ultimately repurchases under the ASR will be based on the average of Synopsys' daily volume-weighted average share prices during the repurchase period, less a discount.About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Forward-Looking StatementsThis press release contains forward-looking statements, including statements regarding the expected settlement of the ASR. Forward-looking statements are subject to both known and unknown risks and uncertainties that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. These risks and uncertainties include, among others: the market price of Synopsys common stock during the repurchase period; the ability of JPMorgan Chase Bank, National Association to buy or borrow shares of Synopsys common stock; and the impact of global and regional economic and market conditions, including illiquidity and other risks of instability in the banking and financial services industry. Other risks and uncertainties that may apply are set forth in the Risk Factors section of Synopsys' most recently filed Annual Report on Form 10-K. Synopsys assumes no obligation to update any forward-looking statement contained in this press release.INVESTOR CONTACT:Lisa L. EwbankSynopsys, Inc.650-584-1901Synopsys-ir@synopsys.com EDITORIAL CONTACT:Simone SouzaSynopsys, Inc.650-584-6454simone@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-initiates-100-million-accelerated-share-repurchase-agreement-301012475.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Delivers Silicon-Proven HBM2E PHY IP Operating at 3.2 Gbps",
        "subtitle": "",
        "date": "Feb 25, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 25, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS) today announced it has delivered silicon-proven HBM2E PHY IP operating at 3.2 gigabits per second (Gbps), addressing high throughput requirements of advanced graphics, high-performance computing and networking SoCs. Verified on TSMC's Chip-on-Wafer-on-Substrate (CoWoS®) advanced packaging technology, Synopsys' DesignWare® HBM2E PHY IP offers a micro-bump array that adheres to the JEDEC HBM2E SDRAM standard for the shortest possible 2.5D package routes and highest signal integrity. With an aggregated bandwidth of 409 gigabytes per second, the HBM2E PHY delivers the required massive compute performance of system-on-chips (SoCs) in advanced FinFET processes. The HBM2E IP is part of Synopsys' comprehensive memory interface IP solution that includes DDR5/4/3/2 and LPDDR5/4/3/2 IP, which have been validated in hundreds of designs and shipped in millions of SoCs. \"As a leading global semiconductor manufacturer, SK hynix makes significant investments in developing robust DRAMs that offer increased capacity and processing speed while maintaining strict quality control,\" said Jun Hyun Chun, senior vice president, HBM Product Champion and Head of DRAM Design at SK hynix. \"We continue to collaborate with Synopsys to provide customers with a high-performance HBM DRAM solution that is fully-tested and interoperable with Synopsys' DesignWare HBM2E IP, which delivers the required capacity, throughput and power of compute-intensive SoCs in advanced processes.\"  \"TSMC's long history of successful collaboration with Synopsys has provided our mutual customers with access to a broad portfolio of high-quality DesignWare IP on TSMC's advanced process technologies, which they can integrate into their high-performance SoCs for a wide range of applications,\" said Suk Lee, senior director of the Design Infrastructure Management Division at TSMC. \"TSMC's industry-leading N7 process and CoWoS® packaging technologies combined with Synopsys' silicon-proven DesignWare HBM2E IP allows designers to achieve faster silicon-to-package manufacturing with improved yield, while minimizing integration risk.\"\"High-performance computing SoCs are requiring significantly more memory bandwidth to manage the massive amounts of data transfer to support rich graphics and machine learning workloads,\" said John Koeter, senior vice president of marketing and strategy for IP at Synopsys. \"As the leading memory interface IP provider, Synopsys delivers a range of silicon-proven DesignWare Memory Interface IP solutions with leading power, performance, and area to address the most challenging throughput requirements.\"   Availability & ResourcesThe Synopsys DesignWare HBM2/2E IP is available now. For more information, visit the DesignWare HBM IP web page. About DesignWare IPSynopsys is a leading provider of high-quality, silicon-proven IP solutions for SoC designs. The broad DesignWare IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, wired and wireless interface IP, security IP, embedded processors, and subsystems. To accelerate prototyping, software development, and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP prototyping kits, IP software development kits, and IP subsystems. Synopsys' extensive investment in IP quality, comprehensive technical support, and robust IP development methodology enable designers to reduce integration risk and accelerate time-to-market. For more information on DesignWare IP, visit http://www.synopsys.com/designware. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact: Kelly JamesSynopsys, Inc. 650-584-8972kellyj@synopsys.com   View original content:http://www.prnewswire.com/news-releases/synopsys-delivers-silicon-proven-hbm2e-phy-ip-operating-at-3-2-gbps-301010554.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Posts Financial Results for First Quarter Fiscal Year 2020",
        "subtitle": "",
        "date": "Feb 19, 2020 4:05PM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 19, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today reported results for its first quarter fiscal year 2020. Revenue for the first quarter was $834.4 million, compared to $820.4 million for the first quarter of fiscal 2019.  \"Our first quarter was a strong start to fiscal year 2020. We delivered financial results at or above our guidance targets and are reaffirming our outlook for the year,\" said Aart de Geus, chairman and co-CEO of Synopsys. \"Even with caution around global markets, electronics companies continue to invest in critical chip and system designs, as well as substantially increasing amounts of sophisticated software. Synopsys is uniquely positioned to enable these designs from Silicon to Software. Our innovation engine is unrelenting, and this quarter we will be introducing a number of exciting new products and differentiating capabilities. We remain on-track towards our longer-term revenue and operating margin expansion targets.\"GAAP ResultsOn a generally accepted accounting principles (GAAP) basis, net income for the first quarter of fiscal 2020 was $104.1 million, or $0.67 per share, compared to $153.5 million, or $1.01 per share, for the first quarter of fiscal 2019. Non-GAAP ResultsOn a non-GAAP basis, net income for the first quarter of fiscal 2020 was $156.7 million, or $1.01 per share, compared to non-GAAP net income of $164.9 million, or $1.08 per share, for the first quarter of fiscal 2019. For a reconciliation between GAAP and non-GAAP results, see \"GAAP to Non-GAAP Reconciliation\" and the accompanying tables below.  Business Segments Synopsys reports revenue and operating income in two segments: (1) Semiconductor & System Design, which includes EDA tools, IP products, system integration solutions and associated services, and (2) Software Integrity, which includes security and quality solutions for software development across many industries. Further information regarding these segments is provided at the end of this press release.Financial Targets Synopsys also provided its consolidated financial targets for the second quarter and full fiscal year 2020. These financial targets do not assume any revenue from companies currently on the U.S. government's \"Entity List.\" These targets constitute forward-looking statements and are based on current expectations. For a discussion of factors that could cause actual results to differ materially from these targets, see \"Forward-Looking Statements\" below.  Earnings Call Open to InvestorsSynopsys will hold a conference call for financial analysts and investors today at 2:00 p.m. Pacific Time. A live webcast of the call will be available on Synopsys' corporate website at www.synopsys.com. A recording of the call will be available by calling +1-866-207-1041 (+1-402-970-0847 for international callers), access code 7099244, beginning at 5:00 p.m. Pacific Time today, until 11:59 p.m. Pacific Time on February 26, 2020. A webcast replay will also be available on the website from approximately 5:30 p.m. Pacific Time today through the time Synopsys announces its results for the second quarter of fiscal year 2020 in May 2020.  Synopsys will post copies of the prepared remarks of Aart de Geus, chairman and co-chief executive officer, and Trac Pham, chief financial officer, on its website following today's call.  In addition, Synopsys makes additional information available in a financial supplement and corporate overview presentation, also posted on the corporate website.Effectiveness of InformationThe targets included in this press release, the statements made during the earnings conference call and the information contained in the financial supplement and corporate overview presentation (available in the Investor Relations section of Synopsys' corporate website at www.synopsys.com) represent Synopsys' expectations and beliefs as of the date of this release only. Although this press release, copies of the prepared remarks of the co-chief executive officer and chief financial officer made during the call, the financial supplement, and the corporate overview presentation will remain available on Synopsys' website through the date of the second quarter fiscal year 2020 earnings call in May 2020, their continued availability through such date does not mean that Synopsys is reaffirming or confirming their continued validity. Synopsys does not currently intend to report on its progress during the second quarter of fiscal year 2020 or comment to analysts or investors on, or otherwise update, the targets given in this release.Availability of Final Financial StatementsSynopsys will include final financial statements for the first quarter fiscal year 2020 in its quarterly report on Form 10-Q to be filed by March 12, 2020.About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.     GAAP to Non-GAAP ReconciliationSynopsys continues to provide all information required in accordance with GAAP but believes evaluating its ongoing operating results may not be as useful if an investor is limited to reviewing only GAAP financial measures. Accordingly, Synopsys presents non-GAAP financial measures in reporting its financial results to provide investors with an additional tool to evaluate Synopsys' operating results in a manner that focuses on what Synopsys believes to be its core business operations and what Synopsys uses to evaluate its business operations and for internal planning and forecasting purposes. Synopsys' management does not itself, nor does it suggest that investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, financial information prepared in accordance with GAAP. Synopsys' management believes it is useful for itself and investors to review, as applicable, both GAAP information that includes: (i) the amortization of acquired intangible assets, (ii) the impact of stock compensation, (iii) acquisition-related costs, (iv) restructuring charges, (v) the effects of certain settlements, final judgments and loss contingencies related to legal proceedings, and (vi) the income tax effect of non-GAAP pre-tax adjustments; and the non-GAAP measures that exclude such information in order to assess the performance of Synopsys' business and for planning and forecasting in subsequent periods. Synopsys utilizes a normalized annual non-GAAP tax rate in the calculation of its non-GAAP measures to provide better consistency across interim reporting periods by eliminating the effects of non-recurring and period-specific items such as tax audit settlements, which can vary in size and frequency and not necessarily reflect our normal operations, and to more clearly align our tax rate with our expected geographic earnings mix.  In projecting this rate, we evaluate our historical and projected mix of U.S. and international profit before tax, excluding the impact of stock-based compensation, the amortization of purchased intangibles and other non-GAAP adjustments described above. We also consider other factors including our current tax structure, our existing tax positions, and expected recurring tax incentives, such as the U.S. federal research and development tax credit. On an annual basis we re-evaluate this rate for significant events that may materially affect our projections.  Based upon our review, our projected normalized annual non-GAAP tax rate remains 16% through fiscal year 2021. We will re-evaluate this rate on an annual basis, but further regulatory guidance regarding specific parts of recent U.S. Tax reform legislation could materially change our projections.Whenever Synopsys uses a non-GAAP financial measure, it provides a reconciliation of the non-GAAP financial measure to the most closely applicable GAAP financial measure. Investors are encouraged to review the related GAAP financial measures and the reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measure as detailed below, as well as Item 2.02 of the Current Report on Form 8-K filed on February 19, 2020 for additional information about the measures Synopsys uses to evaluate its core business operations. Reconciliation of First Quarter Fiscal Year 2020 ResultsThe following tables reconcile the specific items excluded from GAAP in the calculation of non-GAAP net income and earnings per share for the periods indicated below.Reconciliation of 2020 TargetsThe following tables reconcile the specific items excluded from GAAP in the calculation of non-GAAP targets for the periods indicated below.Forward-Looking StatementsThis press release contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, including, but not limited to, financial targets for the second quarter and full fiscal year 2020, as well as statements related to our long-term revenue, non-GAAP EPS and non-GAAP operating margin objectives, and the expected impact of the U.S. government action on our results.  These statements involve known and unknown risks, uncertainties and other factors that could cause actual results to differ materially from those expressed or implied in our forward-looking statements. Accordingly, we caution stockholders and prospective investors not to place undue reliance on these statements. Such risks, uncertainties and factors include, but are not limited to: additional administrative, legislative or regulatory action by the U.S. or foreign governments, such as the imposition of additional tariffs or export restrictions, which could further interfere with our ability to provide products and services in certain countries; the response by current or potential customers and their willingness to purchase products and services from us in the future; uncertainty in the growth of the semiconductor and electronics industries; consolidation among our customers and our dependence on a relatively small number of large customers; risks and compliance obligations relating to the global nature of our operations; uncertainty in the global economy; fluctuation of our operating results; increased variability in our revenue due to the adoption of ASC 606, including the resulting increase in recognizing upfront revenue as a percentage of total revenue; our highly competitive industries and our ability to meet our customers' demand for innovative technology at lower costs; cybersecurity threats or other security breaches; our ability to protect our proprietary technology; our ability to realize the potential financial or strategic benefits of acquisitions we complete; our ability to carry out our new product and technology initiatives; investment of more resources in research and development than anticipated; product errors or defects; increased risks resulting from an increase in sales of our hardware products, including increased variability in upfront revenue; changes in accounting principles or standards; changes in our effective tax rate; liquidity requirements in our U.S. operations; claims that our products infringe on third-party intellectual property rights; litigation; the ability to obtain licenses to third-party software and intellectual property on reasonable terms or at all; the ability to timely recruit and retain senior management and key employees; the inherent limitations on the effectiveness of our controls and compliance programs; the impairment of our investment portfolio by the deterioration of capital markets; the accuracy of certain assumptions, judgments and estimates that affect amounts reported in our financial statements; and the impact of catastrophic events. More information on potential risks, uncertainties and other factors that could affect Synopsys' results is included in filings it makes with the Securities and Exchange Commission from time to time, including in the sections entitled \"Risk Factors\" in its Annual Report on Form 10-K for the fiscal year ended October 31, 2019 and its latest Quarterly Report on Form 10-Q. The information provided herein is as of February 19, 2020.  Synopsys undertakes no duty, and does not intend, to update any forward-looking statement, whether as a result of new information, future events or otherwise, unless required by law.   INVESTOR CONTACT:Lisa L. EwbankSynopsys, Inc.650-584-1901Synopsys-ir@synopsys.com EDITORIAL CONTACT:Simone SouzaSynopsys, Inc.650-584-6454simone@synopsys.com View original content:http://www.prnewswire.com/news-releases/synopsys-posts-financial-results-for-first-quarter-fiscal-year-2020-301007745.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys' Fusion Compiler Adopted by AMD",
        "subtitle": "",
        "date": "Feb 19, 2020 12:05PM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 19, 2020 /PRNewswire/ -- Highlights:Synopsys, Inc. (Nasdaq: SNPS) today announced that AMD is deploying Synopsys' Fusion Compiler™ RTL-to-GDSII product for its full-flow, digital-design implementation. Based on an evaluation process, the Fusion Compiler product delivered industry-leading performance, power and area (PPA) metrics. This work has additionally resulted in an expanded collaboration between Synopsys and AMD to optimize Synopsys applications on AMD EPYC™ processors, targeted to deliver marked runtime acceleration benefits when deploying the Fusion Compiler RTL-to-GDSII product across servers powered by AMD EPYC processors. These advancements will be made available to all users in upcoming service packs.\"At AMD, we are committed to exceeding customer expectations by continually expanding our leadership position in high-performance computing,\" said Mark Papermaster, Chief Technology Officer and Executive Vice President, Technology and Engineering at AMD. \"Based on our evaluation results, Synopsys' Fusion Compiler helped us meet our performance and time-to-market goals for our latest products. As a result, we plan to use Fusion Compiler for the development of our next-generation products.\"\"Synopsys' Fusion Compiler product is the successful result of a multi-year investment in a vision to build highly differentiated and transformative products for an increasingly demanding industry,\" said Sassine Ghazi, general manager, Design Group at Synopsys. \"It is very satisfying to see dozens of customers across the industry rapidly realize the benefits of the new product and extract previously untapped value in their digital designs. We are excited to work with market leaders like AMD who are benefiting from these leaps in innovation to deliver exciting products to their existing markets and creating the path to new ones.\"The Fusion Compiler product is uniquely architected to enable design teams to achieve the optimal levels of power, performance, and area (PPA) in the most convergent manner to ensure the fastest and most predictable time-to-results (TTR). Built using a single, highly-scalable data model, and based around an analysis backbone that leverages technology from the industry's golden-signoff analysis tools, Fusion Compiler guarantees that these critical PPA metrics are optimized efficiently and effectively throughout the full RTL-to-GDSII design flow. Fusion Compiler delivers best-in-class PPA through a highly-leveraged optimization framework, resulting in a fully-unified physical synthesis and optimization methodology where industry-leading technologies can be deployed at any point throughout the flow for maximum effect. This groundbreaking approach delivers better timing, better total power, and improved area density compared to using a traditional combination of front- and back-end tools. Fusion Compiler offers Simply Better PPA™.About Fusion Technology™ Synopsys' breakthrough Fusion Technology™ transforms the RTL-to-GDSII design flow with the fusion of best-in-class optimization and industry-golden signoff tools, enabling designers to accelerate the delivery of their next-generation designs with the industry-best full-flow quality of results (QoR) and the fastest TTR. It redefines conventional EDA tool boundaries across synthesis, place-and-route, and signoff, sharing engines across the industry's premier digital design tools, and using a unique, single data model for both logical and physical representation. Fusion Technology enables one DNA backbone across the Synopsys Design Platform that includes IC Compiler™ II place-and-route, Design Compiler® Graphical synthesis, PrimeTime® signoff, StarRC™ extraction, IC Validator physical verification, DFTMAX™ test, TetraMAX® II automatic test pattern generation (ATPG), SpyGlass® DFT ADV RTL testability analysis, and Formality® equivalence checking. It provides Design Fusion, ECO Fusion, Signoff Fusion, and Test Fusion, resulting in the most predictable RTL-to-GDSII flow with the fewest iterations, as well as unsurpassed design frequency, power, and area.About Synopsys Synopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:  Kelly James Synopsys, Inc. 650-584-8972 kellyj@synopsys.com View original content:http://www.prnewswire.com/news-releases/synopsys-fusion-compiler-adopted-by-amd-301007642.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Completes Acquisition of Certain IP Assets from INVECAS",
        "subtitle": "",
        "date": "Feb 13, 2020 4:05PM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 13, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that it has completed its acquisition of certain IP assets from INVECAS. This acquisition broadens Synopsys' DesignWare® Logic Library, Embedded Memory, General Purpose I/O, Analog, and Interface IP portfolio. The acquisition also adds a team of experienced R&D engineers to accelerate Synopsys' physical IP roadmap across a range of process technologies to address customers' evolving design requirements in markets such as consumer, IoT and automotive. INVECAS will retain its HDMI IP and ASIC Design Solutions.The transaction is not material to Synopsys' financials and the terms are not being disclosed.  About DesignWare IPSynopsys is a leading provider of high-quality, silicon-proven IP solutions for SoC designs. The broad DesignWare® IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, wired and wireless interface IP, security IP, embedded processors and subsystems. To accelerate prototyping, software development and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP prototyping kits, IP software development kits and IP subsystems. Synopsys' extensive investment in IP quality, comprehensive technical support and robust IP development methodology enable designers to reduce integration risk and accelerate time-to-market. For more information on DesignWare IP, visit www.synopsys.com/designware. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com/.    View original content:http://www.prnewswire.com/news-releases/synopsys-completes-acquisition-of-certain-ip-assets-from-invecas-301004795.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Launches New ARC Communications IP Subsystem for Wireless Narrowband IoT Designs",
        "subtitle": "",
        "date": "Feb 13, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 13, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS) today launched its new DesignWare® ARC® IoT Communications IP Subsystem, an integrated hardware and software solution that combines Synopsys' DSP-enhanced ARC EM11D processor, hardware accelerators, dedicated peripherals, and RF interface to deliver efficient DSP performance for ultra-low bandwidth wireless IoT (NB-IoT) applications, such as machine to machine communication. The ARC IP Subsystem includes SPI and GPIO for RF control and UARTs for logging and host control. The digital front end (DFE) offers a flexible interface to third party RF solutions, such as Palma Ceia's Release 14-compliant NB-IoT transceiver. The ARC IP Subsystem also contains a base software communications library, peripheral drivers, and application examples. The ARC IP Subsystem delivers the performance efficiency needed for a wide range of IoT applications including smart city, smart agriculture, and industrial automation. \"Smart IoT applications demand the robust and reliable data transfer with low power consumption to increase battery life,\" said Roy E. Jewell, chief executive officer of Palma Ceia SemiDesign. \"The combination of Palma Ceia SemiDesign's LTE Cat NB1/NB2 Release 14 RF transceiver with Synopsys' ARC IoT Communications IP Subsystem provides designers with an efficient end-to-end solution for the rapid deployment of their wireless NB-IoT applications.\"The integrated, ultra-low power ARC EM11D processor combines RISC and DSP capabilities for a flexible architecture that quickly adapts to rapidly changing wireless standards. The EM11D's zero-latency XY memory architecture implements instruction level parallelism and single-cycle 16+16 MAC operations for power-efficient data processing. Dedicated hardware accelerators for Viterbi decoding and trigonometric functions provide performance boosts for LTE NB-IoT algorithms while keeping processor frequency requirements to a minimum. Power management, critical to efficient IoT communications, is supported by an on-board power management unit, enabling up to six independent power domains and three unique power modes to support LTE Power Saving Mode (PSM) and Extended Discontinuous Reception (eDRX) modes.The ARC IoT Communications IP Subsystem includes a baseline communications library, which provides a critical foundation for NB-IoT functions, such as symbol interpolation, FFTs, modulation, and data manipulation. The application examples demonstrate use-cases in a typical Orthogonal Frequency-Division Multiplexing (OFDM) processing chain. The subsystem is supported by Synopsys' DesignWare ARC MetaWare Toolkit, which includes a rich library of DSP functions, allowing software engineers to rapidly implement algorithms from standard DSP building blocks.  \"Emerging NB-IoT applications require extremely low-power and low-cost implementations that can quickly adapt to evolving wireless standards,\" said John Koeter, senior vice president of marketing for IP at Synopsys. \"Synopsys' DesignWare ARC IoT Communications IP Subsystem with Palma Ceia SemiDesign's RF Transceiver provide a complete hardware and software solution, enabling designers to efficiently incorporate key NB-IoT communication functionality into their IoT devices with significantly less risk and effort.\"Availability and ResourcesAbout DesignWare IPSynopsys is a leading provider of high-quality, silicon-proven IP solutions for SoC designs. The broad DesignWare IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, wired and wireless interface IP, security IP, embedded processors, and subsystems. To accelerate prototyping, software development and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP prototyping kits, IP software development kits and IP subsystems. Synopsys' extensive investment in IP quality, comprehensive technical support and robust IP development methodology enables designers to reduce integration risk and accelerate time-to-market. For more information on DesignWare IP, visit https://www.synopsys.com/designware.About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Kelly JamesSynopsys, Inc. 650-584-8972kellyj@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-launches-new-arc-communications-ip-subsystem-for-wireless-narrowband-iot-designs-301004391.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Announces First Application Security Testing Solution to Analyze Both Open Source and Proprietary Code on the Developer's Desktop",
        "subtitle": "",
        "date": "Feb 12, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 12, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that on Feb. 18 it will release a major update to the Polaris Software Integrity Platform™ to extend its static application security testing (SAST) and software composition analysis (SCA) capabilities to the developer's desktop through the native integration of the Code Sight™ IDE plugin. These capabilities, the first of their kind, will enable developers to proactively find and fix both security weaknesses in proprietary code and known vulnerabilities in open source dependencies simultaneously, without leaving their interactive development environment (IDE).Synopsys will showcase these new capabilities at RSA Conference 2020, Booth S-1135, in San Francisco on Feb. 24–28. To receive a complimentary RSA Expo Pass, register using code XS0USYNOP.\"In modern development environments, security testing needs to integrate seamlessly into the developer's workflow, but it also needs to cover both proprietary and third-party code,\" said Simon King, vice president of solutions at the Synopsys Software Integrity Group. \"By providing real-time SAST and now SCA results together in the IDE, Synopsys enables developers to detect security defects in both their own code and the open source components they leverage – as they build their applications. Developers can fix problems in real time, avoiding the risks and loss of productivity when issues are allowed to go undetected for days, weeks, or even months after they've moved on to other tasks. With this release, the native integration of the Code Sight IDE plugin enables developers to build secure, high-quality software faster.\"More about the new Code Sight IDE plugin:To learn more, read the blog post.About the Synopsys Software Integrity Group Synopsys Software Integrity Group helps development teams build secure, high-quality software, minimizing risks while maximizing speed and productivity. Synopsys, a recognized leader in application security, provides static analysis, software composition analysis, and dynamic analysis solutions that enable teams to quickly find and fix vulnerabilities and defects in proprietary code, open source components, and application behavior. With a combination of industry-leading tools, services, and expertise, only Synopsys helps organizations optimize security and quality in DevSecOps and throughout the software development life cycle. Learn more at www.synopsys.com/software. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contacts:Mark Van ElderenSynopsys, Inc.650-793-7450mark.vanelderen@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-announces-first-application-security-testing-solution-to-analyze-both-open-source-and-proprietary-code-on-the-developers-desktop-301003577.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Announces Earnings Release Date for First Quarter Fiscal Year 2020",
        "subtitle": "",
        "date": "Feb 5, 2020 4:05PM EST",
        "content": "MOUNTAIN VIEW, Calif., Feb. 5, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced it will report results for the first quarter fiscal year 2020 on Wednesday, Feb. 19, 2020, after the market close. A conference call to review the results will begin at 2:00 p.m. PT (5:00 p.m. ET) and will be hosted by Aart de Geus, chairman and co-chief executive officer, and Trac Pham, chief financial officer.Financial and other statistical information to be discussed on this conference call will be available on the corporate website at www.synopsys.com, immediately before the call.  A live webcast will also be available on this site.  Participants should access the live webcast at least 10 minutes prior to the start of the call.  A webcast replay can be accessed on the corporate website beginning Wednesday, Feb. 19, 2020, at approximately 4:00 p.m. PT.  The replay will be available until Synopsys announces its second quarter fiscal year 2020 results in May 2020.  In addition, a dial-up replay of the conference call will be available beginning Feb. 19, 2020, at 5:00 p.m. PT, ending on Feb. 26, 2020, at midnight.  The replay telephone number is USA +1-866-207-1041, and International +1-402-970-0847, Access Code 7099244.About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.     Investor Contact:Roberta ReidSynopsys, Inc.(650) 584-1901  View original content:http://www.prnewswire.com/news-releases/synopsys-announces-earnings-release-date-for-first-quarter-fiscal-year-2020-300999636.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Announces New ARC HS4x/4xD Development Kit to Speed Software Development",
        "subtitle": "",
        "date": "Jan 23, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Jan. 23, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS), today announced availability of the DesignWare® ARC® HS4x/4xD  Development Kit to accelerate software development for the ARC HS4x/4xD family of high-performance processor IP. The ARC HS4x/4xD Development Kit is a ready-to-use software development platform with support for the Linux kernel and access to the embARC open-source software packages on the embARC website, enabling designers to start software development prior to SoC availability. The ARC HS4x/4xD Development Kit includes a multicore ARC HS4x/HS4xD-based chip implemented in a 28-nm process, and integrates a wide range of interfaces including Ethernet, HDMI, USB, SDIO, I2C, SPI, UART, and GPIO, as well as a low-power GPU. The kit also features an on-board WiFi (802.11abgn) and Bluetooth (BT4.0) module. This combination of ARC HS4x/4xD processors and the comprehensive set of peripherals allow developers to build and debug complex software on a fully-featured hardware platform.The ARC HS4x/4xD Development Kit is configurable to support single and dual-core HS45D and HS47D processors and up to quad-core ARC HS48 processors, giving developers the flexibility to use a single development board for multiple ARC HS processor configurations. The kit offers an ARC HS4x processor running at 1 GHz and includes 4 GB of DDR memory to run full software loads. With the Development Kit's support for the Linux kernel, Yocto, and Buildroot systems, developers can immediately begin Linux application development. For bare-metal and RTOS-based development, the freely available embARC Open Software Platform (OSP) provides drivers, FreeRTOS and middleware for embedded and IoT application development. All software for the ARC HS4x/4xD Development Kit is available on the embARC website, a comprehensive resource for embedded developers that provides a single point of access to free and open source software (FOSS) and tools to accelerate the development of embedded applications for ARC Processors.The ARC HS4x/4xD Development Kit is supported by Synopsys' ARC MetaWare Development Toolkit, enabling the development and debugging of highly optimized, high-density code. The GNU Toolchain for ARC also supports the ARC HS4x/4xD family of processors. A HapsTrak® connector, enabling designers to easily connect the ARC HS4x/4xD Development Kit to Synopsys' HAPS® FPGA-based prototyping system, extends the platform so that it can be used for prototyping of new IP and associated driver development. The ARC HS4x/4xD Development Kit is also extensible through the available Digilent Pmod, mikroBUS, and Arduino connectors.\"Integrated hardware and software solutions are crucial in helping designers rapidly develop and debug software for their embedded SoC designs,\" said John Koeter, senior vice president of marketing and strategy for IP at Synopsys. \"Synopsys' new ARC HS4x/4xD Development Kit provides developers with a ready-to-use platform and access to a comprehensive set of free and open source software, drivers, and operating systems to reduce development time and effort for their ARC HS DSP Processor-based systems.\"AvailabilityAbout DesignWare IPSynopsys is a leading provider of high-quality, silicon-proven IP solutions for SoC designs. The broad DesignWare IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, wired and wireless interface IP, security IP, embedded processors and subsystems. To accelerate prototyping, software development and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP prototyping kits, IP software development kits and IP subsystems. Synopsys' extensive investment in IP quality, comprehensive technical support and robust IP development methodology enables designers to reduce integration risk and accelerate time-to-market. For more information on DesignWare IP, visit www.synopsys.com/designware.About Synopsys Synopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Kelly JamesSynopsys, Inc. 650-584-8972kellyj@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-announces-new-arc-hs4x4xd-development-kit-to-speed-software-development-300992002.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys and Finastra Partner to Secure Financial Services App Ecosystem",
        "subtitle": "",
        "date": "Jan 22, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif. and LONDON, Jan. 22, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) and Finastra today announced a partnership establishing an application security validation program for FusionFabric.cloud, Finastra's open platform for developing, deploying and consuming financial applications. The program, powered by the Synopsys Software Integrity Group, ensures that all applications offered via the FusionFabric.cloud FusionStore have passed thorough vigorous security testing assessments.\"By partnering with Synopsys on our application validation program, we're creating a win-win solution for financial institutions and Fintech developers,\" said Nir Valtman, head of product and data security at Finastra. \"Financial institutions can streamline the onboarding process for new applications and bring innovation to market faster, and Fintech providers get third-party validation from an industry-leading application security company.\"FusionFabric.cloud is a scalable, open, and collaborative development platform that enables Fintech providers to create and bring applications to market faster. Synopsys will help validate the security posture of all applications onboarded to FusionFabric.cloud, using solutions that include static application security testing, software composition analysis, penetration testing, and code reviews.\"In today's dynamic threat landscape, security is a requisite component of innovation, especially in the Fintech space,\" said Steve McDonald, co-general manager of the Synopsys Software Integrity Group. \"The application validation program leverages Synopsys' security testing technology and expertise to ensure that applications published on the FusionFabric.cloud platform are designed, developed, and deployed with the highest standards for security. The net result is that Fintech providers can focus on delivering innovative solutions rapidly, and their financial services customers can rely on them with confidence.\"Early adopters of the platform, who have already completed the application validation program, include Allied Payment Network and Monotto.\"The FusionFabric.cloud platform has provided us with inroads to Finastra's client base, and has driven demand for the RoboSave app, our automated savings tool,\" said Christian Ruppe, CEO and Co-Founder, Monotto. \"By going through Synopsys' rigorous validation process before being made available on the FusionStore, banks have peace of mind that RoboSave meets the highest standards for security.\"About FinastraFinastra unlocks the potential of people and businesses in finance, creating a platform for open innovation. Formed in 2017 by the combination of Misys and D+H, we provide the broadest portfolio of financial services software in the world today—spanning retail banking, transaction banking, lending, and treasury and capital markets. Our solutions enable customers to deploy mission critical technology on premises or in the cloud. Our scale and geographical reach mean that we can serve customers effectively, regardless of their size or geographic location—from global financial institutions, to community banks and credit unions. Through our open, secure and reliable solutions, customers are empowered to accelerate growth, optimize cost, mitigate risk and continually evolve to meet the changing needs of their customers. 90 of the world's top 100 banks use Finastra technology. Please visit www.finastra.com About the Synopsys Software Integrity Group Synopsys Software Integrity Group helps development teams build secure, high-quality software, minimizing risks while maximizing speed and productivity. Synopsys, a recognized leader in application security, provides static analysis, software composition analysis, and dynamic analysis solutions that enable teams to quickly find and fix vulnerabilities and defects in proprietary code, open source components, and application behavior. With a combination of industry-leading tools, services, and expertise, only Synopsys helps organizations optimize security and quality in DevSecOps and throughout the software development life cycle. Learn more at www.synopsys.com/software. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contacts:Mark Van ElderenSynopsys, Inc.650-793-7450mark.vanelderen@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-and-finastra-partner-to-secure-financial-services-app-ecosystem-300991123.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Joins New Autonomous Vehicle Computing Consortium",
        "subtitle": "",
        "date": "Jan 16, 2020 4:05PM EST",
        "content": "MOUNTAIN VIEW, Calif., Jan. 16, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that it has joined the new Autonomous Vehicle Computing Consortium. The Consortium brings together leading experts in the automotive, automotive supply, semiconductor and computing industries to help accelerate the delivery of safer and affordable vehicles. As a member of the Consortium, Synopsys will actively contribute to the development of a set of recommendations for system architectures and computing platforms that will be used to address the challenges of deploying self-driving vehicles at scale. \"The Autonomous Vehicle Computing Consortium is focused on tackling the complexities and obstacles associated with the deployment of autonomous vehicles,\" said Pereira, Armando, president of the Autonomous Vehicle Computing Consortium. \"We look forward to Synopsys' active contribution to the consortium, helping to define a reference architecture and platform that address the design requirements for autonomous driving and move today's prototype systems to reality.\" \"Autonomous cars are the future of automotive industry and require massive amounts of electronic hardware and software,\" said Burkhard Huhnke, vice president of Automotive at Synopsys. \"Synopsys' triple shift left strategy is dedicated to addressing functional safety, security and reliability challenges in the automotive industry with a comprehensive suite of automotive-grade IP, design and verification solutions, and software. The Autonomous Vehicle Computing Consortium enables us to join forces with leading automotive experts to further advance the development of automotive systems.\"For more information about Synopsys' Automotive Solutions, please visitwww.synopsys.com/automotive. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contacts:  Simone Souza Synopsys, Inc.650-584-6454simone@synopsys.com   View original content:http://www.prnewswire.com/news-releases/synopsys-joins-new-autonomous-vehicle-computing-consortium-300988490.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys' John R. Rogers Named 2020 Recipient of the SPIE Rudolf and Hilda Kingslake Award",
        "subtitle": "",
        "date": "Jan 15, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Jan. 15, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS) today announced that Dr. John R. Rogers, principal engineer of imaging optics in the Optical Solutions Group at Synopsys, has been named the 2020 recipient of the SPIE Rudolf and Hilda Kingslake Award in Optical Design. SPIE, the international society for optics and photonics, presents the award in recognition of significant achievements in the field of optical design and optical engineering theory.As recognized by SPIE, Rogers has achieved technical innovations in imaging optics design, tolerancing of optical systems, and aberration theory for optical systems with rotationally nonsymmetric and freeform elements. Rogers is also recognized for his outstanding service to the academic and professional optics communities. He has had significant impact on next-generation engineers by teaching optical design courses at the University of Rochester and University of Arizona. Rogers actively contributes to professional optics societies by chairing conferences, editing technical journals, serving on conference committees, and presenting his research. He was named SPIE Fellow in 2018 in recognition of his achievements and contributions to the optics community.\"John's contributions to design strategies involving tilted, decentered, and freeform optics along with his innovations in reducing tolerancing sensitivities during optimization and environmental analysis has meaningfully advanced the field of optical design,\" said Stuart David, group director of Synopsys' Optical Solutions Group. \"We are all proud to have one of the foremost experts in optical design as part of our Synopsys team. We congratulate John on his achievements and for receiving the 2020 SPIE Rudolf and Hilda Kingslake Award in Optical Design.\"Rogers will formally accept the award at the SPIE Optics + Photonics Conference in San Diego, Calif. in August 2020.For more information about the SPIE Rudolf and Hilda Kingslake Award, visit https://spie.org/about-spie/awards-programs/awards-listing/spie-rudolf-and-hilda-kingslake-award-in-optical-design-.About Synopsys' Optical Solutions GroupSynopsys' Optical Solutions Group is a leading developer of optical design and analysis tools that model all aspects of light propagation, enabling users to produce accurate virtual prototypes leading to manufacturable optical systems. Our innovative software packages include CODE V® imaging design software, LightTools® illumination design software, and the LucidShape® products for automotive lighting. We are integrated with RSoft™ Photonic Device Tools for streamlined, multi-domain co-simulations of nano-textured optical structures and diffraction analysis. Learn more at https://www.synopsys.com/optical-solutions.html. About Synopsys Synopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Kelly JamesSynopsys, Inc. 650-584-8972kellyj@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-john-r-rogers-named-2020-recipient-of-the-spie-rudolf-and-hilda-kingslake-award-300987318.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys' John R. Rogers Named 2020 Recipient of the SPIE Rudolf and Hilda Kingslake Award",
        "subtitle": "",
        "date": "Jan 15, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Jan. 15, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS) today announced that Dr. John R. Rogers, principal engineer of imaging optics in the Optical Solutions Group at Synopsys, has been named the 2020 recipient of the SPIE Rudolf and Hilda Kingslake Award in Optical Design. SPIE, the international society for optics and photonics, presents the award in recognition of significant achievements in the field of optical design and optical engineering theory.As recognized by SPIE, Rogers has achieved technical innovations in imaging optics design, tolerancing of optical systems, and aberration theory for optical systems with rotationally nonsymmetric and freeform elements. Rogers is also recognized for his outstanding service to the academic and professional optics communities. He has had significant impact on next-generation engineers by teaching optical design courses at the University of Rochester and University of Arizona. Rogers actively contributes to professional optics societies by chairing conferences, editing technical journals, serving on conference committees, and presenting his research. He was named SPIE Fellow in 2018 in recognition of his achievements and contributions to the optics community.\"John's contributions to design strategies involving tilted, decentered, and freeform optics along with his innovations in reducing tolerancing sensitivities during optimization and environmental analysis has meaningfully advanced the field of optical design,\" said Stuart David, group director of Synopsys' Optical Solutions Group. \"We are all proud to have one of the foremost experts in optical design as part of our Synopsys team. We congratulate John on his achievements and for receiving the 2020 SPIE Rudolf and Hilda Kingslake Award in Optical Design.\"Rogers will formally accept the award at the SPIE Optics + Photonics Conference in San Diego, Calif. in August 2020.For more information about the SPIE Rudolf and Hilda Kingslake Award, visit https://spie.org/about-spie/awards-programs/awards-listing/spie-rudolf-and-hilda-kingslake-award-in-optical-design-.About Synopsys' Optical Solutions GroupSynopsys' Optical Solutions Group is a leading developer of optical design and analysis tools that model all aspects of light propagation, enabling users to produce accurate virtual prototypes leading to manufacturable optical systems. Our innovative software packages include CODE V® imaging design software, LightTools® illumination design software, and the LucidShape® products for automotive lighting. We are integrated with RSoft™ Photonic Device Tools for streamlined, multi-domain co-simulations of nano-textured optical structures and diffraction analysis. Learn more at https://www.synopsys.com/optical-solutions.html. About Synopsys Synopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Kelly JamesSynopsys, Inc. 650-584-8972kellyj@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-john-r-rogers-named-2020-recipient-of-the-spie-rudolf-and-hilda-kingslake-award-300987318.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Releases Industry's First Bluetooth LE Audio Codec for Power-Sensitive Audio and Voice Applications",
        "subtitle": "",
        "date": "Jan 14, 2020 7:00PM EST",
        "content": "New Low-Power Codec Optimized for Synopsys' ARC Processor IP Enables High-Quality Audio and Voice Streaming from Smart Home, Mobile, and Wearable DevicesMOUNTAIN VIEW, California, Jan. 15, 2020 /PRNewswire/ --Highlights:Synopsys, Inc. (Nasdaq: SNPS) today announced availability of the Bluetooth LE Audio LC3 Codec optimized for Synopsys' DesignWare® ARC® EM DSP and HS DSP processor IP. The LC3 codec is an important feature of Bluetooth LE Audio, the soon-to-be-released next-generation audio standard defined by the Bluetooth Special Interest Group (SIG) that enables system-on-chip (SoC) designers to efficiently implement high-quality voice and audio streaming in a wide range of applications, including mobile, wearables, and home automation. The LC3 codec for ARC processors is based on an implementation by Fraunhofer IIS that is designed to meet Bluetooth SIG requirements. The new LC3 codec, running on ARC EM and HS DSP processors, allows designers to rapidly integrate a complete, pre-verified hardware and software solution for voice and speech processing into Bluetooth-enabled devices requiring minimal energy consumption.\"The rapid growth of wearable devices requiring high-quality Bluetooth audio streaming is driving the need for power-efficient processor IP with DSP capabilities that can meet intensive computation requirements of voice and audio applications. Those applications require an optimized codec providing state-of-the art voice and audio quality at minimum computational complexity. The LC3 codec is designed exactly like that,\" said Manfred Lutzky, head of Audio for Communications at Fraunhofer IIS. \"By porting the LC3 codec to the DSP-enhanced ARC processors, Synopsys is enabling customers to quickly implement LC3 codec functionality in their low-power SoCs. We look forward to continuing our collaboration with Synopsys so that the LC3 codec for ARC processors continues to incorporate the latest updates.\"\"The fact that the LC3 codec can provide very high-quality audio even at low bit rates makes it a key feature of the upcoming LE Audio standard,\" said Mark Powell, chief executive officer of the Bluetooth Special Interest Group (SIG). \"We are pleased to see member companies working on implementations of the LC3 codec optimized for various processor architectures.\"The 32-bit DesignWare ARC EM and HS DSP processors are based on the scalable ARCv2DSP Instruction Set Architecture (ISA) and integrate RISC and DSP capabilities for a flexible processing architecture. The ARC EM DSP processors offer ultra-low power and industry-leading performance efficiency while the multi-core-capable ARC HS DSP processors provide a unique combination of high-performance control and high-efficiency digital signal processing. All ARC processors are supported by the ARC MetaWare Development Toolkit, which includes a rich library of DSP functions to allow software engineers to rapidly implement algorithms from standard DSP building blocks. In addition, ARC processors and the LC3 codec can be combined with Synopsys' Bluetooth 5.1-compliant DesignWare Bluetooth Low Energy IP to deliver power-efficient, high-quality wireless audio capability for smart IoT and other Bluetooth-enabled devices. \"Optimizing the LC3 codec for DesignWare ARC Processors demonstrates Synopsys' continued investment in providing customers with a robust portfolio of audio codecs for a wide range of SoC designs,\" said John Koeter, senior vice president of marketing for IP at Synopsys. \"Designed to process high-quality audio streams and deliver superior sound, the LC3 codec for ARC processors provides designers with a certified codec that reduces the integration time and testing required to deliver superior quality audio for Bluetooth streaming applications.\"Availability and ResourcesThe Bluetooth LC3 codec is available now from Synopsys with DSP-enhanced ARC EMxD and HS4xD processors.About DesignWare IPSynopsys is a leading provider of high-quality, silicon-proven IP solutions for SoC designs. The broad DesignWare IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, wired and wireless interface IP, security IP, embedded processors, and subsystems. To accelerate prototyping, software development, and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP prototyping kits, IP software development kits, and IP subsystems. Synopsys' extensive investment in IP quality, comprehensive technical support, and robust IP development methodology enables designers to reduce integration risk and accelerate time-to-market. For more information on DesignWare IP, visit www.synopsys.com/designware.About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contacts: Camille Xu Synopsys, Inc. wexu@synopsys.com Norma Sengstock Synopsys, Inc. norma@synopsys.com  SOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Completes Acquisition of Certain IP Assets from eSilicon",
        "subtitle": "",
        "date": "Jan 13, 2020 9:00AM EST",
        "content": " MOUNTAIN VIEW, Calif., Jan. 13, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that it has completed its acquisition of certain IP assets from eSilicon. This acquisition expands Synopsys' DesignWare® Embedded Memory IP portfolio with TCAMs and multi-port memory compilers, as well as its Interface IP portfolio with High-Bandwidth Interface (HBI) IP. The acquisition also adds a team of experienced R&D engineers to further scale Synopsys' IP development in the most advanced process technologies to address customers' evolving design requirements in growing markets such as AI and cloud. The remaining entirety of eSilicon, including its ASIC business and 56/112G SerDes design and related IP, was acquired by Inphi Corporation.The transaction is not material to Synopsys' financials and the terms are not being disclosed.  About DesignWare IPSynopsys is a leading provider of high-quality, silicon-proven IP solutions for SoC designs. The broad DesignWare IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, wired and wireless interface IP, security IP, embedded processors and subsystems. To accelerate prototyping, software development and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP prototyping kits, IP software development kits and IP subsystems. Synopsys' extensive investment in IP quality, comprehensive technical support and robust IP development methodology enable designers to reduce integration risk and accelerate time-to-market. For more information on DesignWare® IP, visit www.synopsys.com/designware. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com/.   Editorial Contact:Simone Souza Synopsys, Inc. 650-584-6454 simone@synopsys.comInvestor Contact: Lisa Ewbank Synopsys, Inc.     650-584-1901 synopsys-ir@synopsys.com   View original content:http://www.prnewswire.com/news-releases/synopsys-completes-acquisition-of-certain-ip-assets-from-esilicon-300985468.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Expands Portfolio of Automotive VDKs with Support for NXP S32G Vehicle Network Processor",
        "subtitle": "Virtualizer Development Kit Deployed at NXP, Tier 1, OEMs, and Software Ecosystem Vendors 18 Months Before Silicon Availability",
        "date": "Jan 9, 2020 9:05AM EST",
        "content": "MOUNTAIN VIEW, Calif., Jan. 9, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced the general availability of its Virtualizer Development Kit (VDK) supporting NXP® Semiconductor's S32G Vehicle Network Processor. The VDK has been extensively used by NXP's teams to develop their S32G enablement software and firmware. VDKs, software development kits using a virtual prototype as the embedded target, enable Tier 1, OEM, and semiconductor companies to start software development, integration, and test months in advance of hardware availability to increase fault and coverage testing and accelerate testing cycles through a flexible and scalable deployment in regression.With the S32G Vehicle Network Processor, NXP unlocks the full potential of vehicle data. It enables modern service-oriented gateways for rapid Over-the-Air (OTA) deployment of new capabilities and advanced edge-to-cloud analytics. It accelerates the shift to simplified domain and zonal-based vehicle architectures. With powerful processing, networking, and safety and security support, developers of automotive systems software face the challenges of increased integration complexity and testing requirements. They need to deploy more flexible and scalable solutions for software development and test by transitioning from a physical to a virtual environment. The Synopsys VDK for S32G has been used extensively by NXP and its ecosystem partners to develop the S32G software and firmware, advanced drivers, Linux, AUTOSAR, and automotive operating systems. Lead Tier 1 and OEM companies used the S32 virtual prototype to start software development 18 months before silicon availability.\"The availability of the Synopsys VDK for our S32G Vehicle Network processor has been critical to enabling earlier software development for our teams, our ecosystem, and our lead customers,\" said Ray Cornyn, vice president and general manager, Vehicle Network Processors at NXP Semiconductors. \"Our collaboration with Synopsys enables access to an integrated virtual development solution, including Synopsys VDK and NXP software offerings that help automotive system developers leverage the advanced features of the S32G and accelerate their software development, integration, and test.\"\"With the combination of hardware security, ASIL D safety, high-performance real-time and application processing, and network acceleration for service-oriented gateways, domain controllers, and safety coprocessor, NXP is enabling a whole new range of automotive applications,\" said Tom De Schutter, vice president of engineering at Synopsys. \"As a result of our close collaboration, the VDK for S32G is now available to Tier 1 and OEM companies worldwide, enabling them to transition from physical development, integration and test to a more powerful and scalable virtual environment.\"Availability & ResourcesThe Synopsys VDK for the NXP S32G platform is available now. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP, and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.Editorial Contact:Kelly JamesSynopsys, Inc. 650-584-8972kellyj@synopsys.com  View original content:http://www.prnewswire.com/news-releases/synopsys-expands-portfolio-of-automotive-vdks-with-support-for-nxp-s32g-vehicle-network-processor-300984097.htmlSOURCE  Synopsys, Inc."
    },
    {
        "title": "Synopsys Co-CEO Aart de Geus to Speak at 22nd Annual Needham Growth Conference",
        "subtitle": "",
        "date": "Jan 8, 2020 9:00AM EST",
        "content": " MOUNTAIN VIEW, Calif., Jan. 8, 2020 /PRNewswire/ -- Synopsys, Inc. (Nasdaq: SNPS) today announced that Aart de Geus, Chairman and Co-CEO, will speak at the 22nd Annual Needham Growth Conference, in New York, on January 14, 2020. This event will be broadcast live on the Internet via the Synopsys corporate website, at https://www.synopsys.com/company/investor-relations.html, on Tuesday, January 14, 2020, 2:50 p.m. ET (11:50 a.m. PT).  To access the live webcast event, please go to the website ten minutes prior to the start, to register and to download and install any necessary multimedia software.  The webcast replay of the presentation can be accessed at the Synopsys corporate website approximately ten minutes following the conclusion of the live event. About SynopsysSynopsys, Inc. (Nasdaq: SNPS) is the Silicon to Software™ partner for innovative companies developing the electronic products and software applications we rely on every day. As the world's 15th largest software company, Synopsys has a long history of being a global leader in electronic design automation (EDA) and semiconductor IP and is also growing its leadership in software security and quality solutions. Whether you're a system-on-chip (SoC) designer creating advanced semiconductors, or a software developer writing applications that require the highest security and quality, Synopsys has the solutions needed to deliver innovative, high-quality, secure products. Learn more at www.synopsys.com.  Investor Contact:Roberta ReidSynopsys, Inc.(650) 584-1901  View original content:http://www.prnewswire.com/news-releases/synopsys-co-ceo-aart-de-geus-to-speak-at-22nd-annual-needham-growth-conference-300983089.htmlSOURCE  Synopsys, Inc."
    }
]