[
    {
        "title": "Splunk Inc. Announces Fiscal Fourth Quarter and Full Year 2020 Financial Results",
        "subtitle": "",
        "date": "Mar 4, 2020 4:02PM EST",
        "content": "\nTotal ARR of $1.68 Billion, up 54% year over year;\nFull Year Software Revenues Up 40%\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced results for its fiscal fourth quarter and full year ended January 31, 2020.\n\nFourth Quarter 2020 Financial Highlights\n\nFull Year 2020 Financial Highlights\n\n“This was a transformational year for Splunk. We have transitioned our business model, our product strategy and introduced new and enhanced pricing models as part of our company-wide, cloud-first approach. These shifts have provided unprecedented value to our customers by bringing Data-to-Everything,” said Doug Merritt, President and CEO, Splunk.\n\n“As we deliver increasing value from our expanding product capabilities, customers are turning to our cloud offerings more and more. We expect our cloud products could represent more than 60% of our total software business in the next few years and during this shift, ARR is the best metric to evaluate our growth,” said Jason Child, chief financial officer, Splunk. “We grew ARR by 54% in fiscal year 2020 and are targeting a 40% ARR CAGR over the next three fiscal years.”\n\nCustomers\n\nFiscal Year 2020 & Recent Business Highlights\n\nFinancial Outlook\n\nThe company is providing the following guidance for its fiscal first quarter 2021 (ending April 30, 2020):\n\nThe company is providing the following guidance for its fiscal year 2021 (ending January 31, 2021):\n\nAll forward-looking non-GAAP financial measures contained in this section “Financial Outlook” exclude estimates for stock-based compensation and related employer payroll tax, acquisition-related adjustments, amortization of acquired intangible assets and capitalized software costs.\n\nA reconciliation of non-GAAP guidance measures to corresponding GAAP measures is not available on a forward-looking basis without unreasonable effort due to the uncertainty regarding, and the potential variability of, many of these costs and expenses that may be incurred in the future. The company has provided a reconciliation of GAAP to non-GAAP financial measures in the financial statement tables for its fiscal fourth quarter and full year 2020 non-GAAP results included in this press release.\n\nConference Call and Webcast\n\nSplunk’s executive management team will host a conference call today beginning at 1:30 p.m. PT (4:30 p.m. ET) to discuss the company’s financial results and business highlights. Interested parties may access the call by dialing (866) 501-1535. International parties may access the call by dialing (216) 672-5582. A live audio webcast of the conference call will be available through Splunk’s Investor Relations website at http://investors.splunk.com/events-presentations. A replay of the call will be available through March 11, 2020 by dialing (855) 859-2056 and referencing Conference ID 2863284.\n\nSafe Harbor Statement\n\nThis press release contains forward-looking statements that involve risks and uncertainties, including statements regarding Splunk’s revenue and non-GAAP operating margin targets for the company’s fiscal first quarter and fiscal year 2021 in the paragraphs under “Financial Outlook” above and other statements regarding our market opportunity, the market for data-related products, future growth and related targets, including our cloud software business mix, momentum, strategy, technology and product innovation, expectations for our industry and business, including our business model, customer demand, customer success and feedback, expanding use of Splunk by customers, our acquisitions and acquisition strategy, and expected benefits and scale of our products and pricing strategy. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: risks associated with Splunk’s rapid growth, particularly outside of the United States; Splunk’s inability to realize value from its significant investments in its business, including product and service innovations and through acquisitions; Splunk’s shift from sales of perpetual licenses in favor of sales of term licenses and subscription agreements for our cloud services; Splunk’s transition to a multi-product software and services business; Splunk’s inability to successfully integrate acquired businesses and technologies; Splunk’s inability to service its debt obligations or other adverse effects related to our convertible notes; and general market, political, economic, business and competitive market conditions.\n\nAdditional information on potential factors that could affect Splunk’s financial results is included in the company’s Quarterly Report on Form 10-Q for the fiscal quarter ended October 31, 2019, which is on file with the U.S. Securities and Exchange Commission (“SEC”) and Splunk’s other filings with the SEC. Splunk does not assume any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk>, Data-to-Everything, D2E and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2020 Splunk Inc. All rights reserved.\n\nSplunk Inc.\nOperating Metrics\n\nTotal Annual Recurring Revenue (“ARR”) represents the annualized revenue run-rate of active subscription, term license, and maintenance contracts at the end of a reporting period. Contracts are annualized by dividing the total contract value by the number of days in the contract term and then multiplying by 365.\n\nNon-GAAP Financial Measures and Reconciliations\n\nTo supplement Splunk’s condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (“GAAP”), Splunk provides investors with the following non-GAAP financial measures: cost of revenues, gross margin, research and development expense, sales and marketing expense, general and administrative expense, operating income (loss), operating margin, income tax provision (benefit), net income (loss), net income (loss) per share and free cash flow (collectively the “non-GAAP financial measures”). These non-GAAP financial measures exclude all or a combination of the following (as reflected in the following reconciliation tables): expenses related to stock-based compensation and related employer payroll tax, amortization of acquired intangible assets, adjustments related to a financing lease obligation, acquisition-related adjustments, including the partial release of the valuation allowance due to acquisitions, adjustments related to restructuring charges and facility exits, capitalized software development costs, a legal settlement charge and non-cash interest expense related to convertible senior notes that were issued in the fiscal third quarter of 2019. The adjustments for the financing lease obligation are to reflect the expense Splunk would have recorded if its build-to-suit lease arrangement had been deemed an operating lease instead of a financing lease and is calculated as the net of actual ground lease expense, depreciation and interest expense over estimated straight-line rent expense. The non-GAAP financial measures are also adjusted for Splunk's estimated tax rate on non-GAAP income (loss). To determine the annual non-GAAP tax rate, Splunk evaluates a financial projection based on its non-GAAP results. The annual non-GAAP tax rate takes into account other factors including Splunk's current operating structure, its existing tax positions in various jurisdictions and key legislation in major jurisdictions where Splunk operates. The non-GAAP tax rate applied to the three and twelve months ended January 31, 2020 was 20%. Splunk provides updates to this rate on an annual basis, or more frequently if material changes occur. The applicable fiscal 2019 tax rates are noted in the reconciliations. In addition, non-GAAP financial measures include free cash flow, which represents cash from operations less purchases of property and equipment. The presentation of the non-GAAP financial measures is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP. Splunk uses these non-GAAP financial measures for financial and operational decision-making purposes and as a means to evaluate period-to-period comparisons. Splunk believes that these non-GAAP financial measures provide useful information about Splunk’s operating results, enhance the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision making. In addition, these non-GAAP financial measures facilitate comparisons to competitors’ operating results.\n\nSplunk excludes stock-based compensation expense because it is non-cash in nature and excluding this expense provides meaningful supplemental information regarding Splunk’s operational performance and allows investors the ability to make more meaningful comparisons between Splunk’s operating results and those of other companies. Splunk excludes employer payroll tax expense related to employee stock plans in order for investors to see the full effect that excluding that stock-based compensation expense had on Splunk’s operating results. These expenses are tied to the exercise or vesting of underlying equity awards and the price of Splunk’s common stock at the time of vesting or exercise, which may vary from period to period independent of the operating performance of Splunk’s business. Splunk also excludes amortization of acquired intangible assets, adjustments related to a financing lease obligation, acquisition-related adjustments, including the partial release of the valuation allowance due to acquisitions, adjustments related to restructuring charges and facility exits, capitalized software development costs, a legal settlement charge and non-cash interest expense related to convertible senior notes from the applicable non-GAAP financial measures because these expenses are considered by management to be outside of Splunk’s core operating results. Accordingly, Splunk believes that excluding these expenses provides investors and management with greater visibility to the underlying performance of its business operations, facilitates comparison of its results with other periods and may also facilitate comparison with the results of other companies in its industry. Splunk considers free cash flow to be a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business that can be used for strategic opportunities, including investing in its business, making strategic acquisitions and strengthening its balance sheet.\n\nThere are limitations in using non-GAAP financial measures because the non-GAAP financial measures are not prepared in accordance with GAAP, may be different from non-GAAP financial measures used by Splunk’s competitors and exclude expenses that may have a material impact upon Splunk’s reported financial results. Further, stock-based compensation expense has been and will continue to be for the foreseeable future a significant recurring expense in Splunk’s business and an important part of the compensation provided to Splunk’s employees. The non-GAAP financial measures are meant to supplement and be viewed in conjunction with GAAP financial measures.\n\nThe following tables reconcile Splunk’s GAAP results to Splunk’s non-GAAP results included in this press release.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005752/en/\nMedia Contact\nRichard Brewer-Hay\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nIR@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Named a Leader for the Seventh Consecutive Time in Gartner’s 2020 Magic Quadrant for Security Information and Event Management",
        "subtitle": "",
        "date": "Feb 24, 2020 8:00AM EST",
        "content": "\nSplunk Positioned Highest Overall in Ability to Execute in SIEM Axis for Second Consecutive Time\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced it has been named a Leader in Gartner’s 2020 Magic Quadrant for Security Information and Event Management* for the seventh time in a row. For the second year in a row, Splunk was also positioned highest overall for ability to execute. For the report, Gartner evaluated security offerings from Splunk’s Data-to-Everything™ platform, including Splunk® Enterprise, Splunk Enterprise Security (ES), Splunk User Behavior Analytics (UBA) and Splunk Phantom®. For a complimentary copy of the Gartner 2020 Magic Quadrant for Security Information and Event Management, visit the Splunk website.\n\nAccording to Gartner’s 2020 report, “The security information and event management (SIEM) market is defined by customers’ need to analyze security event data in real time, which supports the early detection of attacks and breaches. SIEM systems collect, store, investigate, support mitigation and report on security data for incident response, forensics and regulatory compliance.” Splunk continued to build on its security offerings this year, introducing enhanced, real-time monitoring via ES Event Sequencing and the ability to implement security automation with threat intelligence.\n\n“A perfect storm of challenges including never-ending alerts, a security skills shortage, and a barrage of on-premise and cloud vulnerabilities are forcing the Security Operations Center to evolve quicker than ever before. While security analysts continue to look for ways to modernize the SOC, many are embracing Splunk to help them manage security across the entire threat lifecycle,” said Haiyan Song, senior vice president and general manager, security markets, Splunk. “We are honored by Gartner’s continued recognition of Splunk’s ability to lead and execute, which we believe is a testament to our relentless focus on helping 18,500+ customers solve their toughest cyber challenges and modernize security operations with data.”\n\nOrganizations around the world are going through a time of unprecedented change, driven by an explosion of new technologies and innovations. This change creates more data than ever imagined, which in turn creates wider attack surfaces and increasing security risk for organizations of all sizes. Splunk security solutions, designed to unlock the trapped value of data and enhance the security analyst experience, include:\n\nThis year, Splunk also added flexible new pricing models, allowing more customers to turn data into doing. To learn more about Splunk’s security portfolio, visit the Splunk website. \n\n*Gartner, “Magic Quadrant for Security Information and Event Management,” Kelly M. Kavanagh, Toby Bussa, Gorka Sadowski, February 18, 2020.\n\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk>, Data-to-Everything, D2E and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2020 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200224005041/en/\nMedia Contact\nBill Bode\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "The Splunk Data-to-Everything Platform Brings Speed and Scale to McLaren",
        "subtitle": "",
        "date": "Feb 6, 2020 8:00AM EST",
        "content": "\nMcLaren to Enhance Performance Fueled by Actionable Insights from Splunk \n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced its global partnership with McLaren, a prominent technology innovator and racing team. The multi-year partnership kicks off from the 2020 Formula 1 season and makes Splunk an official McLaren Technology Partner, bringing the power of the Data-to-Everything Platform to both McLaren Racing and McLaren Group.\n\nSplunk’s solutions will capture data across the McLaren Group infrastructure, network and server environment and from across the McLaren Racing function, including from the team’s Formula 1 cars, to help them accelerate performance development across the organization.\n\n“From the production line to the race track, Splunk will help McLaren drive meaningful business outcomes by connecting all of their data at ferocious speed and at immense scale. Performance is critical in the racing world, and it is no different in the world of data, which makes this partnership a great fit,” said Doug Merritt, President and CEO, Splunk. “I’m looking forward to the Formula 1 2020 season and will be rooting for the McLaren Racing team across the globe.”\n\nAs part of the partnership, Splunk will be integrated into the branding of the team, including on the sidepod and cockpit surrounds of McLaren MCL35 race car for the 2020 Formula 1 season.\n\n“It’s great to have Splunk join us as both a McLaren Racing and McLaren Group partner. Data is at the heart of everything we do at McLaren and in the competitive sport of Formula 1, and the Splunk platform will enable us to continue to draw meaningful insights that can be used to impact performance,” said Zak Brown, Chief Executive Officer, McLaren Racing. “We look forward to working as partners for the 2020 season and beyond.”\n\nFor more information about Splunk’s partnership with McLaren, visit the Splunk website.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2020 Splunk Inc. All rights reserved.\n\nAbout McLaren Racing \n\nMcLaren Racing was founded by New Zealand racing driver Bruce McLaren in 1963. The team entered its first Formula 1 race in 1966, since when McLaren has won 20 Formula 1 world championships, more than 180 Formula 1 grands prix, the Le Mans 24 Hours at its first attempt and the Indianapolis 500 three times. McLaren Racing competes in the FIA Formula 1 World Championship with Carlos Sainz and Lando Norris, and the IndyCar Series in North America with Oliver Askew and Pato O’Ward.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005245/en/\nMedia Contact\nJennifer Lopez\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nIR@splunk.com\n\nMedia Contact\nMaeve Harte\n+44 7909 861 438\nMaeve.harte@mclaren.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk to Announce Fiscal 2020 Fourth Quarter and Full Year Results on March 4, 2020",
        "subtitle": "",
        "date": "Feb 4, 2020 8:00AM EST",
        "content": "    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-To-Everything Platform, will report results for its fourth quarter and full year ended January 31, 2020 on Wednesday, March 4, 2020. Results will be included in a press release with accompanying financial information that will be released after market close and posted on the Splunk Investor Relations website.\n\nSplunk’s executive management team will host a conference call beginning at 1:30 p.m. PT (4:30 p.m. ET) to discuss financial results and business highlights. Interested parties may access the call by dialing (866) 501-1535 in the U.S. or (216) 672-5582 from international locations. In addition, a live audio webcast of the conference call will be available on the Splunk Investor Relations website at http://investors.splunk.com.\n\nShortly after the conclusion of the conference call, a replay of the audio webcast will be available on the Splunk Investor Relations website for approximately seven days.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, and analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2020 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005005/en/\nMedia Contact\nRichard Brewer-Hay\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Appoints Kristen Robinson as Chief People Officer",
        "subtitle": "",
        "date": "Jan 23, 2020 8:00AM EST",
        "content": "\nFormer Pandora and Yahoo Human Resources Executive to Focus on Employee Experience\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced it has appointed Kristen Robinson as the company’s first Chief People Officer. Robinson, who will play a critical role in accelerating Splunk’s continued transformation journey, has more than 25 years of experience pioneering people strategies at high growth companies and building diverse and inclusive organizations. Robinson will report to Doug Merritt, President and CEO, Splunk. Her start date is January 23, 2020.\n\n“What sets Kristen apart is her robust business acumen, ability to create an inclusive and people-centered culture, and her data- and analytics-driven approach across all aspects of the HR function,” Merritt said. “I believe Kristen will be a strong advocate for Splunkers and an ambassador of our amazing culture. I am thrilled to welcome Kristen to Splunk.”\n\nRobinson served as Chief Human Resources Officer (CHRO) at Pandora from 2014 to 2019. She was responsible for evolving the company’s people strategy to transform Pandora into a diversified digital content company. She previously served as SVP, Human Resources, at Yahoo from 2010 to 2013, where she led global HR centers of expertise and drove cultural transformation initiatives to reinvent Yahoo as a great place to work. Prior to that, she held the top Human Resources role at Verigy, a spin-off of Agilent Technologies, serving as VP, Human Resources from 2006 to 2010.\n\n“The dedication and innovation exemplified by Splunk’s unique culture was a natural draw, and I’m excited to be joining the Splunk team to lead the company’s people strategy during the next phase of high growth,” said Robinson. “I’m looking forward to expanding Splunk’s already inclusive employee experience, and driving operational excellence within the organization.”\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2020 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005240/en/\nMedia Contact\nJennifer Lopez\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nIR@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Brings Data Everywhere With Accelerated Global Growth",
        "subtitle": "",
        "date": "Dec 17, 2019 8:00AM EST",
        "content": "\nData-to-Everything Company Expands Offices Across 11 Global Innovation Hubs, Creating 1,000+ New Jobs \n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced that the company is expanding its global footprint to 11 global innovation hubs in locations spanning Canada, Poland, Singapore, the United Kingdom and the United States. Driven by Splunk’s accelerated growth across IT, Security and business operations, along with the ever-growing surge of organizations transforming data into doing, Splunk’s global expansions have added over 1,000 jobs to its existing 5,000 worldwide employee count. Splunk’s recent acquisitions of SignalFX, Omnition and Streamlio also lend to Splunk’s expansion strategy, bringing increased talent and innovation to Splunk.\n\n“Splunk is helping organizations around the world solve their toughest IT, security and business challenges with the power of data. As the growth of data continues to accelerate, so does the demand for Splunkers who can help our customers turn data into doing,” said Doug Merritt, President and CEO, Splunk. “Splunk’s focused global expansion speaks to the company’s continued momentum, as we help customers around the world bring Data-to-Everything.”\n\nSplunk is experiencing continued growth in both its San Francisco headquarters and San Jose campuses. Both innovation hubs will be expanding into new buildings directly adjacent to the existing offices. Splunk’s San Francisco office is moving back into 250 Brannan Street, totaling 100,850 square feet of additional space to grow Splunk’s talent pool in all sectors. Splunk’s San Jose office is adding 700 Santana Row, creating 301,019 square feet of new space for Splunk’s urban campus to grow in the community.\n\nIn addition to growing the home base, Splunk continues its expansion across the U.S. and internationally:\n\nSplunk is committed to growing its international workforce, and is also constantly investing in its current employees as well. Splunk has a multitude of programs targeted toward increasing employees’ skill-sets, experiences and careers. Some of these include formal mentorship programs, informal channels of communication and collaboration, affinity groups, educational training through LinkedIn Learning, reimbursement programs for external education efforts and more.\n\nFor more information on working at Splunk, visit Careers at Splunk.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191217005220/en/\nMedia Contact\nKaitlyn Hopkins\nSplunk Inc.\npress@splunk.com \n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 26, 2019 8:00AM EST",
        "content": "    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-To-Everything Platform, today announced its participation in two upcoming investor conferences.\n\nJason Child, chief financial officer, will host a discussion and Q&A session at the Credit Suisse 23rd Annual Technology Conference in Scottsdale, AZ, beginning at 1:10 p.m. MT on Tuesday, December 3, 2019.\n\nDoug Merritt, president and CEO, will host a discussion and Q&A session at the 2019 Wells Fargo TMT Summit in Las Vegas, NV, beginning at 2:45 p.m. PT on Tuesday, December 3, 2019.\n\nInterested parties may access an audio-only webcast of each session via the Splunk Investor Relations website at http://investors.splunk.com/events.cfm.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, and analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005091/en/\nFor more information, please contact: \n\nMedia Contact\nRichard Brewer-Hay\nSplunk Inc.\npress@splunk.com \n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Inc. Announces Fiscal Third Quarter 2020 Financial Results",
        "subtitle": "",
        "date": "Nov 21, 2019 4:02PM EST",
        "content": "\nSoftware Revenues Grew 40%;\nTotal ARR of $1.44 Billion, up 53% year over year\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced results for its fiscal third quarter ended October 31, 2019.\n\nThird Quarter 2020 Financial Highlights\n\n“Splunk continues to show the world how our Data-to-Everything Platform is uniquely positioned to bring data to every question, decision and action,” said Doug Merritt, President and CEO, Splunk. “Whether through our groundbreaking innovations like Splunk® Data Fabric Search and Splunk® Data Stream Processor or aggressive acquisition strategy, Splunk is transforming the way our customers around the world turn data into doing.”\n\n“With the shift to a renewable model largely complete, momentum in our term license and cloud offerings drove 53% growth in total ARR during the quarter,” said Jason Child, chief financial officer, Splunk.\n\nBusiness Highlights\n\nCustomers:\n\nCorporate:\n\nFinancial Outlook\n\nThe company is providing the following guidance for its fiscal fourth quarter 2020 (ending January 31, 2020):\n\nThe company is updating its previous guidance for its fiscal year 2020 (ending January 31, 2020):\n\nAll forward-looking non-GAAP financial measures contained in this section “Financial Outlook” exclude estimates for stock-based compensation and related employer payroll tax, acquisition-related adjustments, and amortization of acquired intangible assets.\n\nA reconciliation of non-GAAP guidance measures to corresponding GAAP measures is not available on a forward-looking basis without unreasonable effort due to the uncertainty regarding, and the potential variability of, many of these costs and expenses that may be incurred in the future. The company has provided a reconciliation of GAAP to non-GAAP financial measures in the financial statement tables for its fiscal third quarter 2020 non-GAAP results included in this press release.\n\nConference Call and Webcast\n\nSplunk’s executive management team will host a conference call today beginning at 1:30 p.m. PT (4:30 p.m. ET) to discuss the company’s financial results and business highlights. Interested parties may access the call by dialing (866) 501-1535. International parties may access the call by dialing (216) 672-5582. A live audio webcast of the conference call will be available through Splunk’s Investor Relations website at http://investors.splunk.com/events-presentations. A replay of the call will be available through November 28, 2019 by dialing (855) 859-2056 and referencing Conference ID 6965602.\n\nSafe Harbor Statement\n\nThis press release contains forward-looking statements that involve risks and uncertainties, including statements regarding trends in revenue composition, statements regarding acquisitions and related benefits, Splunk’s revenue and non-GAAP operating margin targets for the company’s fiscal fourth quarter and fiscal years 2020 in the paragraphs under “Financial Outlook” above and other statements regarding our market opportunity, the market for data-related products, future growth, momentum, strategy, technology and product innovation, expectations for our industry and business, customer demand, customer success and feedback, expanding use of Splunk by customers, and expected benefits and scale of our products. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: risks associated with Splunk’s rapid growth, particularly outside of the United States; Splunk’s inability to realize value from its significant investments in its business, including product and service innovations and through acquisitions; Splunk’s shift from sales of perpetual licenses in favor of sales of term licenses and subscription agreements for our cloud services; Splunk’s transition to a multi-product software and services business; Splunk’s inability to successfully integrate acquired businesses and technologies; Splunk’s inability to service its debt obligations or other adverse effects related to our convertible notes; and general market, political, economic, business and competitive market conditions.\n\nAdditional information on potential factors that could affect Splunk’s financial results is included in the company’s Quarterly Report on Form 10-Q for the fiscal quarter ended July 31, 2019, which is on file with the U.S. Securities and Exchange Commission (“SEC”) and Splunk’s other filings with the SEC. Splunk does not assume any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\n\nSplunk Inc.\nOperating Metrics\n\nTotal Annual Recurring Revenue (“ARR”) represents the annualized revenue run-rate of active subscription, term license, and maintenance contracts at the end of a reporting period. Contracts are annualized by dividing the total contract value by the number of days in the contract term and then multiplying by 365.\n\nNon-GAAP Financial Measures and Reconciliations\n\nTo supplement Splunk’s condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (“GAAP”), Splunk provides investors with the following non-GAAP financial measures: cost of revenues, gross margin, research and development expense, sales and marketing expense, general and administrative expense, operating income (loss), operating margin, income tax provision (benefit), net income (loss), net income (loss) per share and free cash flow (collectively the “non-GAAP financial measures”). These non-GAAP financial measures exclude all or a combination of the following (as reflected in the following reconciliation tables): expenses related to stock-based compensation and related employer payroll tax, amortization of acquired intangible assets, adjustments related to a financing lease obligation, acquisition-related adjustments, including the partial release of the valuation allowance due to acquisitions, and non-cash interest expense related to convertible senior notes that were issued in the fiscal third quarter of 2019. The adjustments for the financing lease obligation are to reflect the expense Splunk would have recorded if its build-to-suit lease arrangement had been deemed an operating lease instead of a financing lease and is calculated as the net of actual ground lease expense, depreciation and interest expense over estimated straight-line rent expense. The non-GAAP financial measures are also adjusted for Splunk's estimated tax rate on non-GAAP income (loss). To determine the annual non-GAAP tax rate, Splunk evaluates a financial projection based on its non-GAAP results. The annual non-GAAP tax rate takes into account other factors including Splunk's current operating structure, its existing tax positions in various jurisdictions and key legislation in major jurisdictions where Splunk operates. The non-GAAP tax rate applied to the three and nine months ended October 31, 2019 was 20%. Splunk expects to utilize this annual non-GAAP tax rate for all of fiscal 2020 and will provide updates to this rate on an annual basis, or more frequently if material changes occur. The applicable fiscal 2019 tax rates are noted in the reconciliations. In addition, non-GAAP financial measures includes free cash flow, which represents cash from operations less purchases of property and equipment. The presentation of the non-GAAP financial measures is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP. Splunk uses these non-GAAP financial measures for financial and operational decision-making purposes and as a means to evaluate period-to-period comparisons. Splunk believes that these non-GAAP financial measures provide useful information about Splunk’s operating results, enhance the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision making. In addition, these non-GAAP financial measures facilitate comparisons to competitors’ operating results.\n\nSplunk excludes stock-based compensation expense because it is non-cash in nature and excluding this expense provides meaningful supplemental information regarding Splunk’s operational performance and allows investors the ability to make more meaningful comparisons between Splunk’s operating results and those of other companies. Splunk excludes employer payroll tax expense related to employee stock plans in order for investors to see the full effect that excluding that stock-based compensation expense had on Splunk’s operating results. These expenses are tied to the exercise or vesting of underlying equity awards and the price of Splunk’s common stock at the time of vesting or exercise, which may vary from period to period independent of the operating performance of Splunk’s business. Splunk also excludes amortization of acquired intangible assets, adjustments related to a financing lease obligation, acquisition-related adjustments, including the partial release of the valuation allowance due to acquisitions, and non-cash interest expense related to convertible senior notes from the applicable non-GAAP financial measures because these expenses are considered by management to be outside of Splunk’s core operating results. Accordingly, Splunk believes that excluding these expenses provides investors and management with greater visibility to the underlying performance of its business operations, facilitates comparison of its results with other periods and may also facilitate comparison with the results of other companies in its industry. Splunk considers free cash flow to be a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business that can be used for strategic opportunities, including investing in its business, making strategic acquisitions and strengthening its balance sheet.\n\nThere are limitations in using non-GAAP financial measures because the non-GAAP financial measures are not prepared in accordance with GAAP, may be different from non-GAAP financial measures used by Splunk’s competitors and exclude expenses that may have a material impact upon Splunk’s reported financial results. Further, stock-based compensation expense has been and will continue to be for the foreseeable future a significant recurring expense in Splunk’s business and an important part of the compensation provided to Splunk’s employees. The non-GAAP financial measures are meant to supplement and be viewed in conjunction with GAAP financial measures.\n\nThe following tables reconcile Splunk’s GAAP results to Splunk’s non-GAAP results included in this press release.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191121005873/en/\nMedia Contact\nRichard Brewer-Hay\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk to Announce Fiscal 2020 Third Quarter Results on November 21, 2019",
        "subtitle": "",
        "date": "Nov 4, 2019 8:00AM EST",
        "content": "    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-To-Everything Platform, will report results for its third quarter ended October 31, 2019 on Thursday, November 21, 2019. Results will be included in a press release with accompanying financial information that will be released after market close and posted on the Splunk Investor Relations website.\n\nSplunk’s executive management team will host a conference call beginning at 1:30 p.m. PT (4:30 p.m. ET) to discuss financial results and business highlights. Interested parties may access the call by dialing (866) 501-1535 in the U.S. or (216) 672-5582 from international locations. In addition, a live audio webcast of the conference call will be available on the Splunk Investor Relations website at http://investors.splunk.com.\n\nShortly after the conclusion of the conference call, a replay of the audio webcast will be available on the Splunk Investor Relations website for approximately seven days.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, and analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191104005017/en/\nMedia Contact\nRichard Brewer-Hay\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "The Splunk Data-to-Everything Platform Increases Scale and Speed; Over 18,000 Customers Turn Data Into Doing",
        "subtitle": "",
        "date": "Oct 22, 2019 8:04AM EDT",
        "content": "\nSplunk Enterprise expands data access with Data Fabric Search and Data Stream Processor; empowers users with context and collaboration \n    SAN FRANCISCO & LAS VEGAS--(BUSINESS WIRE)--\n.conf19 – Splunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced that new versions of Splunk® Enterprise and Splunk Cloud™ will expand the ways customers can unlock value and bring data to every question, decision and action. These innovations power the Data-to-Everything Platform, helping customers solve any data problem at any scale. Splunk Enterprise 8.0 is now generally available.\n\nIn front of a capacity crowd of over 11,000 customers and partners at its annual user conference, .conf19, Splunk also announced the general availability of Splunk Data Fabric Search (DFS) and Splunk Data Stream Processor (DSP). With these innovative technologies, Splunk is taking customers beyond how they interact with data today enabling massive scale federated search and stream processing.\n\n“Every problem that organizations face is a data problem, so Splunk is designing products and solutions that help our customers get to the business outcomes that they want to achieve,” said Tim Tully, Senior Vice President and Chief Technology Officer, Splunk. “Whether our customers want the acceleration of Splunk Data Fabric Search, the real-time capabilities of Data Stream Processor, or the accessibility of Splunk Connected Experiences, Splunk provides the Data-to-Everything Platform to help all users across an organization tackle any type of data challenge.”\n\n“We are committed to being a leader in teaching, research and public engagement and these were important considerations that went into our selection of Splunk Cloud as our campus-wide data platform. Splunk Cloud helps us manage everything from IT and Security to providing personalized student experiences both in and out of the classroom,” said Joe Barnes, Chief Privacy and Security Officer, University of Illinois. “Splunk Data Stream Processor’s ability to mask private student information in real-time gives us a very effective tool to create a more safe and connected campus.”\n\nAnalyze and Act Fast Across Data Ecosystems with Data Fabric Search and Data Stream Processor\n\nSplunk DFS accelerates and streamlines the data analytics experience by quickly weaving together insights from massive datasets, living across diverse data stores, into a single view. For customers that have data living across multiple data stores, including data warehouses that aren't Splunk-based, DFS weaves together all this data for complete visibility across the entire organization.\n\nSplunk DSP is a real-time stream processing solution that continuously collects high-velocity, high-volume data from diverse sources, turns data into valuable information or insights, and then distributes results to Splunk or other destinations typically within milliseconds. Users can deliver meaningful data and information to numerous destinations or data stores in order for analysts or other business professionals to quickly extract insights and make critical business decisions. Splunk DSP can also mask sensitive data in order to protect critical information that could impact a business.\n\n“With Splunk’s new Data Fabric Search, we can detect and respond to potential issues within minutes, not hours, so our teams can focus on delivering innovative and personalized products for our customers,” said Jon Prall, VP Communications Production Engineering, Verizon Media. “Data Fabric Search harnesses the power of multiple Splunk deployments to gain operational insights about billions of events with optimized, scalable queries.”\n\nSplunk Expands Access to Data, Lets Customers Talk to their Data with Natural Language Platform \n\nSplunk further expanded its offerings that bring customers even closer to their data. Splunk Connected Experiences deliver insights on-the-go through augmented reality (AR), mobile devices, and mobile applications that provide users with the ability to access their data anywhere at any time. Enhancements to Connected Experiences include general availability on Android devices and tighter integration with Splunk Enterprise and Splunk Cloud.\n\nNow generally available with Connected Experiences, Splunk Natural Language Platform (NLP) provides more users the ability to access important information in their organization by allowing them to talk to their data through mobile devices using the Splunk Mobile and Splunk TV apps. Users can use their voice to ask questions and the system will respond with an answer. Responses can be configured to be Splunk dashboards or saved search results with natural language descriptions. The Splunk Mobile app is free to download through the App Store, and the Splunk TV app is only available from the App Store on Apple TV. NLP availability for Android will be available later this year.\n\nDiscover, Explore, and Monitor Processes With an Intuitive User Interface\n\nSplunk Business Flow is a fast, flexible and intuitive process mining solution that enables process improvement and business operations professionals to interactively discover, investigate, and check conformance of any business process. With the next version of Splunk Business Flow now generally available, users can use notifications to ensure that their most critical processes conform to expected performance thresholds.\n\nFor more information on Splunk solutions, visit the Splunk website.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, and analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005462/en/\nMedia Contact\nJennifer Lopez\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Brings the Power of Monitoring, AIOps and Observability to its Data-to-Everything Platform",
        "subtitle": "",
        "date": "Oct 22, 2019 8:03AM EDT",
        "content": "\nSplunk enhances IT Operations solutions; showcases observability portfolio to unify metrics, traces and logs for cloud-native infrastructure and applications\n    SAN FRANCISCO & LAS VEGAS--(BUSINESS WIRE)--\n.conf19 – Splunk Inc. (NASDAQ: SPLK), provider of the Data-To-Everything Platform, today announced enhancements to Splunk’s modern portfolio for IT Operations and to its portfolio for real-time observability for cloud infrastructures and microservices. Enhancements to IT Operations include new versions of Splunk® IT Service Intelligence (ITSI), Splunk App for Infrastructure (SAI), and integrations with Splunk VictorOps® and Splunk Phantom®. Splunk is already a leader in ITOM and an AIOps pioneer, and with the addition of SignalFx, Splunk delivers an observability portfolio for organizations at every stage of their cloud journey, from home grown on-premises applications to cloud-native applications.\n\n“For organizations to succeed in today’s data-driven world, the IT department must function at the forefront of innovation,” said Rick Fitz, senior vice president and general manager of IT Markets, Splunk. “With Splunk’s modern IT operations solutions, organizations can manage emerging complexities, and drive monitoring, collaboration and automation to solve long-standing IT problems while also tackling new challenges presented by digital transformation.”\n\n“Using Splunk helps ATB Financial to achieve speed, agility and operational visibility, and reinforces our primary goal to always put the customer first,” said Barry Hensch, Head of Technology and Data Enablement, ATB Financial. “Making sure that customers are successful in what they do with their business is most important.”\n\nSplunk IT Solutions Increase Productivity; Unify and Simplify IT Operations \n\nPowered by artificial intelligence (AI) and machine learning (ML) capabilities, the IT operations portfolio enables new, fast ways of working that take advantage of an organization’s data. Splunk’s IT solutions help enable any organization make the shift from traditional to modern IT Operations, and help customers turn data into doing by delivering key services and valuable business outcomes.\n\nThe new version of Splunk IT Service Intelligence 4.4 (ITSI) gives everyone from administrators to the CIO, the same capability to monitor, investigate, and act in order to work faster and better together. Organizations that are in the cloud, on-premises or hybrid can use Splunk ITSI to get a unified view across organizational silos, and predict and prevent problems in order to deliver exceptional customer experiences.\n\nPackaged with Splunk ITSI, Splunk App for Infrastructure 2.0 (SAI) enhancements include VMware vSphere Monitoring, multi-cloud monitoring (beta) and enhanced monitoring for Windows, Unix and Linux, providing customers with monitoring. troubleshooting and alerting across both physical and virtual environments.\n\nAdditionally, enhanced integrations and new ML-capabilities from Splunk VictorOps intelligently routes alerts to the right on-call teams for even faster problem resolution, enhanced cross-team collaboration, and seamlessly integrates with the Splunk Data-to-Everything Platform bridging IT Operations and observability.\n\n“Allied Irish Banks is the leading retail bank in Ireland and we’re using Splunk ITSI to monitor our payments processes,” said Damien Perrem, IT Service Assurance / Operations Manager – Payments at Allied Irish Banks. “Using Splunk ITSI, we now have a real-time, 360-degree view of payments services and the underlying IT application infrastructure which helps us reduce incidents, integrate machine learning and analytics into operations and improve overall customer experience.”\n\nSplunk Unlocks Real-Time Observability for Cloud Infrastructure and Microservices\n\nWith the acquisitions of SignalFx, a leader in real-time observability for cloud infrastructure and microservices, and Omnition, a leading innovator in open-source distributed tracing, Splunk provides a best-in-class portfolio for real-time observability of cloud-native environments. Splunk’s observability portfolio enables DevOps teams to process metrics, traces and logs with AI-driven analytics that enable deeper insights into critical systems in seconds. Today, Splunk is announcing:\n\n“As organizations evolve, they move farther away from a manufacturing model of specialization, and silos will be broken down, particularly between DevOps and IT Ops. Teams will have to get better at reacting to speed and complexity,” said Fitz. “We are excited to deliver innovative, data-driven solutions that provide real-time insights into our customers’ entire technology stack and application lifecycle, for every kind of IT organization, anywhere in their journey of transformation.”\n\nFor more information on Splunk IT and DevOps solutions, visit the Splunk website.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, and analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005557/en/\nFor more information, please contact:\n\nMedia Contact\nJennifer Lopez\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Mission Control Takes Off, Supercharging the Security Operations Center",
        "subtitle": "",
        "date": "Oct 22, 2019 8:02AM EDT",
        "content": "\nNew Splunk Security Solutions Help the SOC Turn Data into Business Outcomes\n    SAN FRANCISCO & LAS VEGAS--(BUSINESS WIRE)--\n.conf19 – Splunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced new innovations across its Security Operations Suite to modernize and unify the Security Operations Center (SOC). Anchored by the newly launched Splunk® Mission Control, the Splunk Security Operations Suite makes it easier than ever for security analysts to turn data into doing by managing security across the entire threat lifecycle.\n\nSecurity analysts around the world are under greater pressure than ever before to investigate, monitor, analyze and act on security threats with data. Splunk Mission Control is a new, cloud solution that connects Splunk SIEM (Splunk Enterprise Security), SOAR (Splunk Phantom) and UEBA (Splunk UBA) products into a single unified analyst experience. Combined, these powerful innovations form the Splunk Security Operations Suite, which allows customers to act on threats and other high-priority security issues through the entire event lifecycle.\n\nWith Splunk Mission Control, customers gain a new, unified SOC experience that supports investigation and search across multiple on-premises and cloud-based Splunk Enterprise and Splunk Enterprise Security instances, ChatOps collaboration, case management and automated response, all from a common work surface. This industry-first combination helps to boost productivity and increase efficiency, particularly for customers using hybrid on-premise and cloud-based infrastructures.\n\n“For decades, security analysts have been struggling to keep up with the rising volume of data to help them fight back against emerging cyber threats that can cripple businesses, disrupt governments and impact customer privacy. Today, the industry has grown to recognize that the answers are often sitting right in front of them, within their data,” said Haiyan Song, Senior Vice President and General Manager of Security Markets, Splunk. “Splunk is proud to launch Mission Control to help our customers bring data to every question, decision and action within the SOC, allowing them to dramatically improve the analyst experience and modernize security operations.”\n\n“Starbucks’ security operations team is responsible to defend its customers, partners and the Starbucks brand. Our success is directly dependent on the ability for our team to respond and remediate threats at machine speed,” said Atom Coffman, Manager of Cyber Security Operations, Starbucks. “Leveraging Splunk as a part of Starbucks’ SOC, we are able to automate action and pre-built orchestration workflows, all from one central platform.”\n\nSplunk’s Security Operations Suite Redefines The Analyst Experience\n\nAs the volume of security-relevant data continues to grow, so will the importance of technologies that can automate and respond to that data in real-time. In front of a capacity crowd of 11,000 customers and partners at its annual user conference, Splunk also introduced several significant updates across its security portfolio, designed to create the strongest analyst experience and enable detection, defense and action on threats at machine speed:\n\n“Deploying and scaling a cyber analytics platform is a journey,” said Brent Conran, Chief Information Security Officer, Intel. “We built a new platform based on Splunk and Kafka, and modernized our tools. With the data in the right place and reskilling of our people, we reduced our technical debt and created a force multiplier. Now, we are using machine learning to significantly increase the depth and speed of our cyber intelligence.”\n\nSplunk Mission Control is in beta for early access customers, with general availability coming in the near future. New versions of Splunk ES, Splunk UBA and Splunk Phantom are available today. For more information about Splunk’s Security Operations Suite and how you can turn data into doing, visit the Splunk website.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005465/en/\nFor more information, please contact:\nMedia Contact\nBill Bode\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Cloud Attains FedRAMP Authorization",
        "subtitle": "",
        "date": "Oct 22, 2019 8:01AM EDT",
        "content": "\nFedRAMP Authorization Accelerates Agency Modernization Initiatives\n    SAN FRANCISCO & LAS VEGAS--(BUSINESS WIRE)--\n.conf19 -- Splunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, announced today Splunk Cloud™ has received FedRAMP authorization at a moderate impact level. Achieving FedRAMP authorization from the General Services Administration (GSA) FedRAMP Program Management Office (PMO) brings the power of Splunk Cloud to agencies that are eager to remove the barrier between data and action and turn data into doing. As a result, federal agencies and their partners will now be able to leverage the assurance of the FedRAMP program to solve their toughest IT, security and IoT challenges with Splunk’s Data-to-Everything Platform.\n\n“Splunk has given us the ability to gain better insight into our data,” said the International Trade Administration. “Previously our reliance on on-premises infrastructure and software limited how far we could take that data. Splunk Cloud FedRAMP opens new opportunities to use data to further our agency’s mission.”\n\nWe are living in a time of unprecedented change, driven by an explosion of new technologies and new innovations. This change has created a never-ending flow of data from countless sources, however, the value of data remains trapped for most federal agencies. Splunk Cloud enables agencies to remove the barriers between data and action, allowing them to make confident decisions and take decisive action on data to help achieve mission success.\n\nFedRAMP is a U.S. government-wide program that provides a standardized approach to security assessment, authorization, and continuous monitoring for cloud products and services. Agencies can leverage the FedRAMP Marketplace to select Cloud Service Providers with services that meet their mission requirements\n\nSplunk Cloud meets FedRAMP risk management and security requirements at the moderate impact level, which helps agencies eliminate costly and time-consuming processes in selecting cloud technologies. Now, with Splunk Cloud, agencies can ingest data once and use that same data to address a variety of challenges across their organizations. By leveraging the data across the entire organization, agencies also have the ability to leverage this investment across various programs and initiatives.\n\n“Our FedRAMP authorization serves as further validation of Splunk’s commitment to our public sector customers and our ability to power digital transformation across government,” said Frank Dimina, vice president of public sector, Splunk. “We can now offer a single solution capable of solving IT, security and mission challenges for agencies where confident, data-driven, decisive actions matter for the success of the mission.”\n\nThousands of public sector organizations worldwide are leveraging the Splunk Data-to-Everything platform, including all three branches of the U.S. government and 15 cabinet-level departments. For more information on Splunk and Splunk Cloud with FedRAMP visit the Splunk website. For additional information related to the Splunk FedRAMP package, please visit the FedRAMP PMO Marketplace.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005059/en/\nMedia Contact\nBill Bode\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Announces Investment in Zonehaven",
        "subtitle": "",
        "date": "Oct 22, 2019 8:00AM EDT",
        "content": "\nTechnology Startup Redefines Wildfire Preparation, Detection and Management With Data\n    SAN FRANCISCO & LAS VEGAS--(BUSINESS WIRE)--\n.conf19 -- Splunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced that the company has closed funding in Zonehaven, a cloud-based analytics application designed to help communities improve evacuations and reduce wildfire risk with data. The funding is the first investment from Splunk’s newly launched Splunk Ventures Social Impact Fund, a $50 million fund that invests in early stage organizations that are using innovative, data driven approaches to drive meaningful social impact.\n\nIn 2018 alone, more than 57,000 wildfires burned 8.8 million acres of land in the United States1, which have taken lives, damaged global ecosystems, and cost billions in property damage. While the prevalence and volatility of wildfires has grown substantially, fire departments still rely heavily on word-of-mouth, 911 call centers and static paper playbooks to detect wildfires and evacuate those at risk. Launched in 2018, Zonehaven gives fire departments and emergency response agencies unprecedented situational awareness and decision support by utilizing intelligent evacuation zones, advanced fire modeling, real-time weather data and always-on fire sensing capabilities.\n\n“The increased spread of wildfires is a global emergency that impacts public health and the planet. While technology alone won't eliminate fires, Zonehaven’s unique software can help communities prepare for evacuation, provide advance warning to those in harm’s way, preserve natural and economic resources and ultimately save lives,” said Charlie Crocker, CEO, Zonehaven. “As one of the world’s leading data analytics platform providers, Splunk is an ideal partner to help us in our mission. We look forward to partnering with Splunk as we deliver data-driven impact in the fight against wildfires.”\n\nZonehaven’s technology offers a common data platform for coordination and response to wildfires. By facilitating evacuation pre-planning and analyzing always-on sensor data, Zonehaven helps identify ignition points, projects simulated fire spread, develops fire-specific intelligent evacuation zones and enables fire departments to execute efficient evacuations.\n\n“The Splunk Ventures Social Impact Fund was created to accelerate innovative, data-driven solutions to society’s most pressing challenges. As providers of the world’s first Data-to-Everything Platform, Splunk has a unique opportunity to make the world a better place by turning data into doing good,” said Lenny Stein, senior vice president of global affairs, Splunk. “Zonehaven’s innovative technology has enormous potential to bring wildfire detection and response into the 21st century. Splunk is proud to invest in and partner with Zonehaven as we work together to address one of the world’s most immediate threats.”\n\nBased in San Francisco, Zonehaven will leverage funding from the Splunk Ventures Social Impact Fund to expand its team, increase research and development and advance product capabilities. Zonehaven will also continue to collaborate closely with Splunk for Good, as well as resources from Splunk Products, Engineering and Business Development teams to meet their mission. To learn more about how Zonehaven can help minimize wildfire risk in your community, visit the Zonehaven website.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\n\n1National Interagency Fire Center; https://www.predictiveservices.nifc.gov/intelligence/2018_statssumm/fires_acres18.pdf\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005057/en/\nMedia Contact\nBill Bode\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Partner+ Program Brings Data-to-Everything at .conf19",
        "subtitle": "",
        "date": "Oct 21, 2019 8:00AM EDT",
        "content": "\nOver 2,200 Splunk partner attendees and 75+ sponsors help remove barriers between data and action at .conf19\n    SAN FRANCISCO & LAS VEGAS--(BUSINESS WIRE)--\n.conf19 -- Splunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced Splunk® Partner+ Program updates and notable partner activities at .conf19, Splunk’s 10th annual users conference. The event will be the largest assembly of Splunk partners ever, with over 2,200 individual partner attendees showcasing how .conf attendees can make smarter business decisions by bringing data to every question, decision and action. The Splunk Partner+ Program provides support and investments to drive the success of more than 1,900 global Splunk partner organizations, such as distributors, global system integrators, service providers, original equipment manufacturers, technology alliance partners and value-added resellers.\n\n“.conf19 is the best place in the world to see the strength of the Splunk partner ecosystem in action,” said Aziz Benmalek, vice president of worldwide partners, Splunk. “Together with our partners, Splunk’s mission is to help customers make smarter business decisions by bringing data to every question, decision and action. To help with this journey, Splunk has continued to develop a vast ecosystem of partners, making it easier than ever to focus on key business outcomes. We are excited to see all of our partners at .conf19 and appreciate their continued support.”\n\nBig Data Beard’s Road Trip to .conf19\n\nThe Big Data Beard team recently equipped an RV with IoT sensors, built an edge-to-cloud computing environment and drove over 3,700 miles with stops in 13 cities on their Road Trip to .conf19. Big Data Beard leveraged the Splunk Data-to-Everything Platform throughout the journey to gain insights on their location, the road quality, comfort levels and health data. The RV will be showcased in the exposition hall at .conf19, where attendees can see Big Data Beard’s dashboards using Splunk Augmented Reality. Big Data Beard will also be presenting a breakout session about their trip on Wednesday, October 23 at 12:30 p.m. PT.\n\nVisit the Splunk .conf19 SOC, in Partnership with ReliaQuest\n\nAttendees will be able to visit the Splunk .conf19 Security Operations Center (SOC), in partnership with ReliaQuest, which is created specifically to protect them from cybersecurity threats while at the event. Powered by Splunk and ReliaQuest’s GreyMatter platform, the .conf19 SOC leverages live conference data to provide unified and actionable insights. Visit the Splunk .conf19 SOC to learn more about how ReliaQuest (Booth #100) and Splunk are improving enterprise threat detection.\n\nAnnouncing the Splunk Revolution Ecosystem Award Finalists \n\nLater today, Splunk will announce the winner of the Splunk Revolution Ecosystem Award at the Welcome Soirée. Nominations for this award were made by peers in the industry to recognize the accomplishments of Splunk partners around the world. Congratulations to this year’s finalists, Accenture, Discovered Intelligence and vast limits.\n\nSplunk Partner+ Improvements\n\nSplunk has evolved the Partner+ Technology Alliance Program, offering enhancements to increase value for partners that build connectors, apps and add-ons to Splunk. This includes a new structure for partner engagement and solution development across the Splunk product portfolio addressing a broader set of customer challenges. Based on technical expertise and go-to-market engagement, Technology Alliance Partners now have a clear progression path to earn their way from the entry-level Enrolled tier up to Elite, the highest tier in the Splunk Partner+ Program. Splunk has also made enhancements to the Splunk Partner Portal, making it faster and easier to submit deal registrations, as well as an all-new CPQ system designed with Splunk partners in mind.\n\nSplunk thanks its .conf19 Sponsors\n\nAccenture and ReliaQuest are .conf19 Zetta sponsors, Splunk’s highest level of sponsorship. Amazon Web Services (AWS), Carahsoft, Cisco, Dell Technologies, Deloitte, Herjavec Group, Nutanix and Pure Storage are Peta sponsors, while over 60 additional strategic partners are also .conf19 sponsors.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005065/en/\nMedia Contact\nTaylor Jones\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nIR@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Leading Analyst Firm Ranks Splunk First in SIEM and ITOM Market Share in 2018",
        "subtitle": "",
        "date": "Oct 16, 2019 8:00AM EDT",
        "content": "\nAnalyst Firm Reports Splunk Moves into Leading Position in IT Operations Management and Security Information & Event Management Markets \n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced that it was ranked No. 1 for 2018 market share in the IDC Worldwide ITOM Software Market Shares, 2018, report* and ranked No. 1 for 2018 market share in the IDC Worldwide Security Information and Event Management Market Shares, 2018, report.** In both reports IDC cites Splunk growth in the double digits.\n\n“Our customers are at the forefront of digital transformation and understand the value that data provides to their business,” said Sendur Sellakumar, Chief Product Officer, Splunk. “We’re honored by the trust our forward-thinking customers have put in the Splunk® platform to deliver outcomes across their entire organization, and in particular in the IT and Security domains. The market share reports reflect the investments our customers have made in advancing their data journey and recognize that Splunk can play a leading role for these organizations.”\n\nSplunk Takes No. 1 Position in IT Operations Management Market \n\nIDC’s Worldwide ITOM Software Market Shares, 2018 report finds Splunk is the market share leader in 2018 with 11.9 percent market share. Splunk achieved the largest increase in market revenue among ITOM vendors. IDC estimates the worldwide ITOM market grew by 15.5% in 2018 and is valued at $9.7 billion.\n\nAccording to the report, Splunk's continued rapid growth is based on analytics with big data capture, indexing, management, search, and visualization capabilities that extend across a wide variety of data sources including metrics and logs. For this analysis, IDC evaluated Splunk solutions including Splunk IT Service Intelligence (ITSI) and Splunk Insights for Infrastructure as supported by the Splunk platform. Download the IDC Worldwide ITOM Software Market Shares, 2018.\n\nSplunk Takes No. 1 Position in Security Information and Event Management Market\n\nIn this year’s report, IDC Worldwide Security Information and Event Management Market Shares, 2018, IDC estimates that Splunk has the No. 1 market share overall, growing in double digits year-over-year. The report evaluates market share by size of business. Additionally, IDC reports that Splunk has the No. 1 in market share in the segments with 1,000 – 2,499 employees and 2,500 – 9,999 employees.\n\nIDC estimates that global security information and event management (SIEM) products and service providers improved revenue by 12.4% in 2018, realizing sales of just over $3 billion. According to IDC, SIEM has a central and critical role in the overall cybersecurity posture of organizations. The larger organizations become, the more critical the SIEM’s role. For this analysis, IDC evaluated Splunk solutions including Splunk Enterprise Security (ES), Splunk User Behavior Analytics (UBA) and Splunk Phantom. Download the IDC Worldwide Security Information and Event Management Market Shares, 2018.\n\n*IDC Worldwide IT Operations Management Software Market Shares, 2018: Monitoring, Log Analytics, Hybrid IT Drive Strong Growth, Doc #US4513041, June 2019\n\n**Source: IDC Worldwide Security Information and Event Management Market\n\nShares, 2018: By Size of Business — The Attempt to Serve All Client Needs, Doc #US45161819, June 2019\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, and analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191016005242/en/\nFor more information, please contact:\n\nMedia Contact\nJennifer Lopez\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "INSERTING and REPLACING Splunk .conf19 to Celebrate a Decade of Showcasing Customer Success in Front of a Sold Out Audience of Industry and Technology Innovators",
        "subtitle": "",
        "date": "Oct 15, 2019 8:00AM EDT",
        "content": "\n200+ Splunk Customers to Present at 10th Anniversary of Conference\n    SAN FRANCISCO--(BUSINESS WIRE)--\nInsert after fifth paragraph, first sentence of release: If you can’t join the action in-person, both day one and day two keynotes will be livestreamed on the Splunk.conf19 website.\n\nThe corrected release reads:\n\nSPLUNK .CONF19 TO CELEBRATE A DECADE OF SHOWCASING CUSTOMER SUCCESS IN FRONT OF A SOLD OUT AUDIENCE OF INDUSTRY AND TECHNOLOGY INNOVATORS\n\n200+ Splunk Customers to Present at 10th Anniversary of Conference\n\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced that its tenth annual user conference — .conf19 — will welcome a record number of attendees. The event will take place from October 21-24, 2019, at The Venetian and Sands Expo in Las Vegas. This will be Splunk’s 10th conference anniversary and attendees from around the globe are gearing up to learn the latest on Splunk® products spanning IT, security, developer, artificial intelligence and machine learning, mobile, and the Internet of Things (IoT) technology. To reserve your place at .conf19, register here.\n\nSplunk’s premier user conference has experienced exponential growth since its first .conf in 2010, expanding from approximately 350 attendees to over 11,000 this year. Additionally, 2,200 partners, 75+ different sponsors, 400 sessions and over 200 customer presentations from leading organizations are expected at .conf19.\n\n“From our very first user conference to today, customers and their success have been the foundation, the heart and the soul of Splunk,” said Doug Merritt, President and CEO, Splunk. “I’m excited to celebrate .conf’s 10th anniversary alongside our customers, partners and community members as we unveil the Data-to-Everything Platform to our .conf attendees and demonstrate how we bring data to every question, decision and action. In honor of ten years of unprecedented innovation, I want to thank everyone across our vibrant ecosystem and can’t wait to celebrate with them in Vegas.”\n\nMerritt will deliver Splunk’s Data-to-Everything Platform vision and guiding principles for the future of Splunk during his keynote address on Tuesday, October 22nd, from 9:00-10:30 a.m. PT at the Sands Expo. He will be joined on stage by Splunk Chief Technology Officer Tim Tully, Signal FX Founder and CEO Karthik Rau, Omnition Founder and CEO Spiros Xanthos, and Splunk customers for an in-depth look at how some of the world’s leading companies turn data into doing.\n\nSplunk Chief Product Officer, Sendur Sellakumar, will announce significant updates across the Splunk product portfolio during Wednesday’s keynote, October 23rd from 9:00-11:00 a.m. PT at the Sands Expo. If you can’t join the action in-person, both day one and day two keynotes will be livestreamed on the Splunk.conf19 website.\n\nWith intimate breakout sessions throughout .conf19, attendees will also hear from over 200 customers including Intel, Porsche, Arlo and more as they discuss how they’re removing the barriers between data and action. The full list of .conf19 sessions is available on the Splunk .conf19 website.\n\nsource=*Pavilion to Offer One-on-One and Experiential Learning\n\nAttendees will have the chance to visit and participate in different activations in the source=*Pavilion including:\n\n.conf19 Sponsors to Showcase Latest Technology and Integrations with Splunk\n\nMore than 75 leading technology vendors and Splunk ecosystem partners, including Cisco, Deloitte, ReliaQuest and more, will showcase demos of their latest technologies and integrations with Splunk. Advancements and enhancements across Splunk’s Partner+ ecosystem include solutions for IT, security and IoT.\n\nSplunk University to Train Next Generation of Power Users\n\nJoin 2,000 Splunk users at Splunk University — a pre-conference educational training program to help Splunk users sharpen their skills and learn the foundational frameworks of Splunk’s product features in a hands-on setting. Splunk University at .conf19 offers single-day, two-day, and three-day boot camps from October 19-21, 2019. Register through the Splunk University page.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191015005457/en/\nMedia Contact\nKaitlyn Hopkins\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Closes Acquisition of Cloud Monitoring Leader SignalFx",
        "subtitle": "",
        "date": "Oct 2, 2019 8:00AM EDT",
        "content": "\nSplunk and SignalFx Combine Forces to Usher In New Era of APM; Joint Offering Helps Customers Monitor and Observe Data at Any Stage of their Cloud Journey\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced that it has completed the acquisition of SignalFx, a SaaS leader in real-time monitoring and metrics for cloud infrastructure, microservices and applications. Splunk is already a leader in ITOM and an AIOps pioneer and, with the addition of SignalFx, is now a leader in observability and APM for organizations at every stage of their cloud journey, from cloud-native apps to homegrown on-premises applications. For more information, visit the SignalFx website for a free trial of SignalFx.\n\nThe aggregate purchase price for the transaction was approximately $1.05 billion, excluding adjustments, paid approximately 60% in cash and 40% in Splunk common stock.\n\n“We live in a cloud-first world, where developers must have the ability to monitor and observe cloud-native infrastructure and applications in real-time, whether via logs, metrics or tracing. The power of Splunk and SignalFx allows our customers to monitor any relevant data at massive scale,” said Doug Merritt, President and CEO, Splunk. “I’m thrilled to welcome SignalFx to the Splunk team, and can’t wait to show our customers how our data platform can help them turn data into doing.”\n\n“Atlassian uses SignalFx’s technology for cloud monitoring,” said Stephen Deasy, Atlassian’s Head of Engineering. “SignalFx helps us improve customer experience and keeps our business humming by monitoring our cloud infrastructure, microservices and applications.”\n\nWith Splunk, the combined technologies will give customers one platform that can monitor the entire enterprise application lifecycle. The predictability and versatility of Splunk's Data-to-Everything pricing programs will also provide SignalFx's customers with exceptional value and best-in-class, next generation solutions when compared to legacy APM solutions.\n\nSignalFx’s cloud-delivered solutions have a highly differentiated set of features including real-time streaming analytics, such as the NoSample™ architecture for distributed tracing. The combination of Splunk and SignalFx will give IT departments a data platform that allows them to monitor and observe data in real-time, no matter the infrastructure or scale - in order to cut costs, boost revenue and improve the customer experience.\n\nFor more information about Splunk and SignalFx, visit the Splunk website.\n\nSafe Harbor Statement\n\nThis press release contains forward-looking statements that involve risks and uncertainties, including statements regarding the expected benefits of the acquisition of SignalFx, the impact of the acquisition on Splunk’s products and services, the capabilities of SignalFx’s products and services and the expected benefits of the combined offerings as well as expectations regarding our products and pricing. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: difficulties encountered in integrating the business, technologies, personnel and operations; costs related to the acquisition and integration; market acceptance of the acquisition and resulting products and services; Splunk’s inability to realize value from its significant investments in its business, including product and service innovations; market acceptance of our new pricing models; and general market, political, economic and business conditions.\n\nAdditional information on potential factors that could affect Splunk’s financial results is included in the company’s Quarterly Report on Form 10-Q for the quarter ended July 31, 2019, which is on file with the U.S. Securities and Exchange Commission and Splunk’s other filings with the SEC. Splunk does not assume any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk> and Turn Data Into Doing are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191002005252/en/\nMedia Contact\nBill Bode\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nIR@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Introduces New Data-to-Everything Pricing and $150 Million Splunk Ventures Fund",
        "subtitle": "",
        "date": "Sep 18, 2019 8:01AM EDT",
        "content": "\nSimplified, Predictable Pricing; New Partner Developments; and Investment Fund Remove Barriers Between Data and Action\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced advancements to pricing, partner and investment initiatives designed to help customers make smarter business decisions by turning data into doing. With the Splunk Data-to-Everything Platform, more than 18,000 customers worldwide are unlocking value and bringing data to every question, decision and action.\n\n“We are living in a time of unprecedented change. The volume of data continues to grow at exponential rates, creating massive opportunities for those that are able to leverage this vast resource. Yet, most data is trapped inside an organization’s devices, systems and interactions,” said Doug Merritt, President and CEO, Splunk. “Our Data-to-Everything portfolio of products, combined with our new pricing programs, partner ecosystem solutions, and Splunk Ventures fund remove the barriers between data and action, so our customers -- regardless of size or business -- have the freedom to deliver outcomes across their entire organization.”\n\n“Data is one of Nubank’s most valuable assets, it’s what makes us one of the fastest-growing financial technology companies in the world,” said Cristina Junqueira, Co-founder, Nubank. “Splunk removes the complexity of data, so we can focus on delivering the best experience for our 12 million customers who want to take back control of their financial lives.”\n\nData-to-Everything Pricing\n\nNew Data-to-Everything pricing programs provide flexibility to help customers deliver business outcomes instead of only focusing on volumes of data. These programs provide a wide range of predictability and versatility across the Splunk® product suite.\n\nPredictive Pricing: A new, predictive pricing program facilitates long-term planning for customers and extends flexible, transparent pricing as data volumes grow. Driven by a collaboration with the Splunk community of experts, customers, partners and industry analysts, the new model allows customers to control and manage budgets around this critical asset, data. Predictive Pricing offers predefined pricing tiers from 125GB to unlimited ingestion for Splunk Enterprise, Splunk ITSI and Splunk ES. Learn more about Splunk Predictive Pricing details and eligibility on the Splunk website.\n\nInfrastructure-Based Pricing: For organizations that want to focus on the infrastructure needed to turn data into doing, customers can now choose to purchase Splunk Enterprise based on the compute power required to run the software on-premises and in the cloud. Data ingestion-based pricing will continue to be available for customers who do not wish to change their Splunk licensing model. Learn more about Splunk Infrastructure-Based Pricing on the Splunk website.\n\nSplunk Enterprise Rapid Adoption Packages: Splunk is unveiling new “Rapid Adoption” packages, starting at $10,000 MSRP, that work for three, four or five use cases. These packages help customers accelerate their data journey with Splunk with the most common IT and Security operations use cases. Learn more about Splunk Enterprise Rapid Adoption Packages on the Splunk website.\n\nEcosystem\n\nBuilding on an already rich ecosystem of partners, Splunk announced new and expanded partnerships that will make it easier than ever before to bring data to every question, decision and action across any organization.\n\nAccenture: Accenture offers more trained and certified Splunk resources than any other partner and is working with Splunk to launch data analytics plays that help clients increase revenue, reduce cost, and mitigate risk by actioning insights mined from vast amounts of data.\n\nCisco: Cisco is capitalizing on integrations with the Splunk platform to rapidly bring to market new, differentiated solutions that will be sold on Cisco’s Global Price List. A newly available security solution generated from this strategic partnership, Cisco Endpoint Security Analytics Built on Splunk, is now orderable.\n\nDeloitte: Deloitte Risk & Financial Advisory and Splunk also expanded their strategic relationship as Deloitte’s Fusion Managed Services offerings now incorporate Splunk Phantom, providing automated security monitoring and response to help clients address evolving cyber threats.\n\nSAP: Splunk and SAP are entering into a new partnership focused on enabling the Intelligent Enterprise, by bringing new integrations and solutions for our joint customers to be successful in the experience economy. Together, we plan to drive operational automation and innovation, unlock new areas of growth, and deliver exceptional experiences for our joint customer and partner ecosystems.\n\nSplunk Ventures\n\nSplunk’s investments will empower more users to make faster decisions and access more data types and sources. Through a $100 million Innovation Fund and a $50 million Social Impact Fund, Splunk Ventures will invest in organizations that are harnessing the power of data to change the world.\n\nBeyond capital, Splunk Ventures will also provide portfolio companies with differentiated access to Splunk technology, exposure to our ecosystem, engagement with Splunk’s leaders and experts, and go-to-market and co-marketing opportunities.\n\nAbout Splunk Inc.\n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190918005205/en/\nFor more information, please contact:\n\nMedia Contact\nKate Mahon\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    },
    {
        "title": "Splunk Ventures Launches With $150 Million to Fuel the Next Generation of Data Analytics",
        "subtitle": "",
        "date": "Sep 18, 2019 8:00AM EDT",
        "content": "\n$100 Million Innovation Fund and $50 Million Social Impact Fund Bring Data-to-Everything; Splunk Announces Investment in Kavach\n    SAN FRANCISCO--(BUSINESS WIRE)--\nSplunk Inc. (NASDAQ: SPLK), provider of the Data-to-Everything Platform, today announced the launch of Splunk Ventures and two inaugural funds designed to help the next generation of data doers turn data into doing. Through a $100 million Innovation Fund and a $50 million Social Impact Fund, Splunk Ventures is investing in early stage companies that can harness the power of data to change the world.\n\nToday’s world of unprecedented innovation is transforming and improving the way we live. Technology is fundamentally changing entire industries, globalizing businesses, big and small, and multiplying the efficiency of our workforce. Behind these global changes there is one constant: the rapidly accelerating, never-ending growth of data. Splunk Ventures is designed to invest in companies that will further drive growth of the technology ecosystem that brings data to every decision, question and action. Ultimately, these investments help customers, partners and third-party developers address new use cases and realize more value from their data.\n\n“Organizations around the world are not only racing to make faster, better decisions, they’re also hoping to turn data into business outcomes that are both cost and time effective,” said Doug Merritt, President and CEO, Splunk. “To meet this demand and help data live up to its full, world changing potential, it’s critical that Splunk invest in technologies that can help remove the barrier between data and action. I’m thrilled to launch Splunk Ventures and can’t wait to start working with some of the groundbreaking companies we’re investing in, as we work together to bring data to everything.”\n\nThe Splunk Ventures Innovation Fund is a $100 million fund that invests in startups working to transform data into business value. In addition to funding, Splunk Ventures provides portfolio companies with go-to-market support, access to Splunk technology and engagement with Splunk leaders.\n\nWhile the growth of technology is paramount to amplify data’s impact, Splunk also believes that data has the power to make the world a better, stronger and more inclusive place for all. The Splunk Ventures Social Impact Fund is a $50 million fund that invests in organizations using data for the good of society.\n\n“At Splunk, we firmly believe that data offers unparalleled potential to make the world better. As the world’s Data-to-Everything Platform, we have a responsibility to turn that potential into a reality,” said Ammar Maraqa, senior vice president of strategy and corporate development, Splunk. “Through investments, the Splunk Ventures Social Impact Fund helps us make good on our promise to improve society, solve problems and promote positive change with data. We’re proud to take this unique approach to the investment market, where we measure success not just on the bottom line, but also on societal impact.”\n\nSplunk also announced today its first Splunk Ventures Innovation Fund investment in Kavach, a cloud-native application security company.\n\n“As applications get increasingly distributed and disaggregated, organizations must have comprehensive security and privacy strategies in place for data no matter its form. Kavach offers innovative technology to help businesses of all shapes and sizes take the data-in-motion security challenge head-on,” said Pratik Roychowdhury, Founder & CEO, Kavach. \"As a startup, it’s important for Kavach to partner with not just leaders in data analytics, but investors who can put us in touch with the right partners and customers to help our business thrive. Splunk checks all of those boxes, and we’re thrilled to work with them as we help organizations fight back against emerging cybersecurity threats at the data layer.”\n\nFor more information about Splunk Ventures, visit the Splunk website.\n\nAbout Splunk Inc. \n\nSplunk Inc. (NASDAQ: SPLK) turns data into doing with the Data-to-Everything Platform. Splunk technology is designed to investigate, monitor, analyze and act on data at any scale.\n\nSplunk, Splunk>, Listen to Your Data, The Engine for Machine Data, Splunk Cloud, Splunk Light and SPL are trademarks and registered trademarks of Splunk Inc. in the United States and other countries. All other brand names, product names, or trademarks belong to their respective owners. © 2019 Splunk Inc. All rights reserved.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190918005208/en/\nFor more information, please contact:\nMedia Contact\nBill Bode\nSplunk Inc.\npress@splunk.com\n\nInvestor Contact\nKen Tinsley\nSplunk Inc.\nir@splunk.com\nSource: Splunk Inc."
    }
]