[
    {
        "title": "Skyworks Updates Q2 FY20 Outlook",
        "subtitle": "",
        "date": "Mar 4, 2020 8:30AM EST",
        "content": "\nRevised Outlook Reflects Expected Impact of COVID-19\n    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high-performance analog semiconductors connecting people, places and things, today announced that it is updating its outlook for the second fiscal quarter of 2020 ending March 27, 2020. This update reflects the unanticipated impact that the COVID-19 outbreak is having on the business environment. Based on a current assessment of business conditions, the company now expects for the second fiscal quarter of 2020:\n\n“Although COVID-19 has caused no significant disruption within Skyworks’ manufacturing operations to date, the current demand environment for our products has been negatively impacted by interruptions in global supply chains,” said Liam K. Griffin, president and chief executive officer of Skyworks. “Despite this, we remain upbeat about our design win momentum and our ability to deliver strong profitability and cash flow. As we navigate these challenges, we continue to focus on the health and safety of all our employees, customers and partners worldwide.”\n\nThis update is based on information available to management as of the date of this release. Skyworks undertakes no obligation to update the information in this release in the event facts or circumstances change after the date of this release.\n\nDiscussion Regarding the Use of Non-GAAP Financial Measures\n\nThis press release contains a forward-looking estimate of non-GAAP diluted earnings per share for the second quarter of our 2020 fiscal year (“Q2 2020”). We are unable to provide a reconciliation of our forward-looking estimate to Q2 2020 GAAP diluted earnings per share because certain information needed to make a reasonable forward-looking estimate of GAAP diluted earnings per share for Q2 2020 (other than estimated share-based compensation expense of $0.15 to $0.20 per diluted share, estimated amortization of intangibles of $0.05 to $0.07 per diluted share and certain tax items of -$0.05 to $0.05 per diluted share) is difficult to predict and estimate and is often dependent on future events that may be uncertain or outside of our control. Such events may include changes in the severity and scope of COVID-19, unanticipated changes in our GAAP effective tax rate, unanticipated one-time charges related to asset impairments (fixed assets, inventory, intangibles or goodwill), unanticipated acquisition-related expenses, unanticipated settlements, gains, losses and impairments and other unanticipated non-recurring items not reflective of ongoing operations. Our forward-looking estimates of both GAAP and non-GAAP measures of our financial performance may differ materially from our actual results and should not be relied upon as statements of fact.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com.\n\nSafe Harbor Statement\n\nThis news release includes “forward-looking statements” intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation information relating to future results and expectations of Skyworks (e.g., certain projections and business trends). Forward-looking statements can often be identified by words such as “anticipates,” “expects,” “forecasts,” “intends,” “believes,” “plans,” “may,” “will,” or “continue,” and similar expressions and variations or negatives of these words. All such statements are subject to certain risks, uncertainties and other important factors that could cause actual results to differ materially and adversely from those projected, and may affect our future operating results, financial position and cash flows.\n\nThese risks, uncertainties and other important factors include, but are not limited to: the susceptibility of the semiconductor industry and the markets addressed by our, and our customers’, products to economic downturns, including as a result of widespread illness such as the current COVID-19 outbreak; our reliance on several key customers for a large percentage of our sales; the risks of doing business internationally, including increased import/export restrictions and controls (e.g., the effect of the U.S. Bureau of Industry and Security of the U.S. Department of Commerce placing Huawei Technologies Co., Ltd. and certain of its affiliates on the Bureau’s Entity List), imposition of trade protection measures (e.g., tariffs or taxes), security and health risks, possible disruptions in transportation networks, fluctuations in foreign currency exchange rates, and other economic, social, military and geo-political conditions in the countries in which we, our customers or our suppliers operate; the volatility of our stock price; declining selling prices, decreased gross margins, and loss of market share as a result of increased competition; our ability to obtain design wins from customers; delays in the standardization or commercial deployment of 5G technologies; changes in laws, regulations and/or policies that could adversely affect our operations and financial results, the economy and our customers’ demand for our products, or the financial markets and our ability to raise capital; fluctuations in our manufacturing yields due to our complex and specialized manufacturing processes; our ability to develop, manufacture and market innovative products, avoid product obsolescence, reduce costs in a timely manner, transition our products to smaller geometry process technologies, and achieve higher levels of design integration; the quality of our products and any defect remediation costs; our products’ ability to perform under stringent operating conditions; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; our ability to retain, recruit and hire key executives, technical personnel and other employees in the positions and numbers, with the experience and capabilities, and at the compensation levels needed to implement our business and product plans; the timing, rescheduling or cancellation of significant customer orders and our ability, as well as the ability of our customers, to manage inventory; our ability to prevent theft of our intellectual property, disclosure of confidential information, or breaches of our information technology systems; uncertainties of litigation, including potential disputes over intellectual property infringement and rights, as well as payments related to the licensing and/or sale of such rights; our ability to continue to grow and maintain an intellectual property portfolio and obtain needed licenses from third parties; our ability to make certain investments and acquisitions, integrate companies we acquire, and/or enter into strategic alliances; and other risks and uncertainties, including, but not limited to, those detailed from time to time in our filings with the Securities and Exchange Commission.\n\nThe forward-looking statements contained in this news release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005221/en/\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Advances Next Generation Wi-Fi 6E",
        "subtitle": "",
        "date": "Feb 11, 2020 8:00AM EST",
        "content": "\nDeveloping Future-proof Connectivity Solutions in Alignment with Wi-Fi Alliance®\n    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that it is supporting next generation wireless technologies set forth by Wi-Fi Alliance® and developing advanced connectivity solutions designed to meet future requirements. Skyworks offers a family of solutions that address all existing Wi-Fi® standards and is working in Wi-Fi Alliance to develop its Wi-Fi 6E products that operate in the 5.925 to 7.125 GHz frequency range.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200211005436/en/\nAs a result of increasing demand for high data applications such as streaming media/TV/audio, social media and smart home devices, there has been an initiative to open up additional frequency bands to complement the existing 2.4 and 5 GHz bands. This new spectrum is expected to be made available by regulators around the world and it represents an opportunity to deliver the benefits of Wi-Fi 6 coupled with increased bandwidth available in the new 6 GHz band.\n\n“The 6 GHz band addresses the growing need for Wi-Fi spectrum capacity to ensure users continue to experience reliable and seamless connectivity,” said Kevin Robinson, SVP of Marketing, Wi-Fi Alliance. “We are glad to see Wi-Fi Alliance members working closely in Wi-Fi Alliance to ensure that new products meet high standards for interoperability and security.”\n\n“Skyworks is leveraging our expertise to produce connectivity solutions that address the insatiable demand for more data and the ever-evolving needs of the market,” said Dave Stasey, vice president and general manager of diversified analog solutions for Skyworks. “We look forward to continuing our tradition of innovation and providing the highest performance solutions for our OEM customers which deliver maximum Wi-Fi range and speeds.”\n\nIn a new article published by RF Globalnet, Skyworks’ experts explain the 6 GHz band, along with its uses and benefits. With decades of experience developing cutting-edge technologies for successive wireless standards, Skyworks works in partnership with members of the Wi-Fi Alliance and provides guidance on FCC proceedings regarding upcoming protocols.\n\nAbout Skyworks’ Wi-Fi Connectivity Solutions\n\nSkyworks’ powerful modules facilitate Wi-Fi functionality with best-in-class linearity and performance in the smallest footprint available. These solutions expedite time-to-market by incorporating the required functionality to deliver maximum performance and contain a logarithmic power detector to support wide dynamic ranges, low power consumption and improved thermal management. Visit Skyworks’ Wi-Fi page for more resources and solutions.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; delays in the standardization or commercial deployment of 5G technologies; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; our products’ ability to perform under stringent operating conditions; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005436/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks to Present at Goldman Sachs Technology and Internet Conference",
        "subtitle": "",
        "date": "Jan 29, 2020 8:00AM EST",
        "content": "    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that executives will be participating in the Goldman Sachs Technology and Internet Conference on February 12, 2020 at 11:40 a.m. Pacific time from The Palace Hotel in San Francisco.\n\nThe presentation will be webcast live and archived for replay for one week following the conference on the “Investors” section of Skyworks’ website at www.skyworksinc.com.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties, including those identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200129005228/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Exceeds Q1 FY20 Expectations",
        "subtitle": "",
        "date": "Jan 23, 2020 4:01PM EST",
        "content": "    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today reported first fiscal quarter results for the period ended December 27, 2019.\n\nRevenue for the first fiscal quarter of 2020 was $896.1 million, up 8 percent sequentially, exceeding the high end of the revenue guidance range, as well as consensus estimates. On a GAAP basis, operating income for the first fiscal quarter of 2020 was $277.3 million with diluted earnings per share of $1.50. On a non-GAAP basis, operating income was $315.4 million with non-GAAP diluted earnings per share of $1.68, or $0.03 better than guidance and consensus estimates.\n\n“Skyworks exceeded December quarter expectations driven by global demand for our high performance connectivity engines,” said Liam K. Griffin, president and chief executive officer of Skyworks. “Leveraging decades of experience, manufacturing scale and vertical integration capabilities, our highly advanced Sky5® platform is fueling market adoption of 5G across a broadening customer set. With an expansive suite of applications − from smartphones to wireless infrastructure, industrial robotics, autonomous vehicles, smart homes and virtual assistants − our solutions provide the critical connection, ensuring peak performance for 5G and IoT usage cases. At the same time, through crisp operational execution and a strong business model, we are translating these results into long-term shareholder value.”\n\nFirst Fiscal Quarter Business Highlights\n\nSecond Fiscal Quarter 2020 Outlook\n\nWe provide earnings guidance on a non-GAAP basis because certain information necessary to reconcile such guidance to GAAP is difficult to estimate and dependent on future events outside of our control. Please refer to the attached Discussion Regarding the Use of Non-GAAP Financial Measures in this press release for a further discussion of our use of non-GAAP measures, including quantification of known expected adjustment items.\n\n“We expect new content opportunities and the ramp of our Sky5® solutions to drive better-than-seasonal results in the March quarter,” said Kris Sennesael, senior vice president and chief financial officer of Skyworks. “Specifically, in the second fiscal quarter of 2020, we anticipate revenue to be between $800 and $820 million with non-GAAP diluted earnings per share of $1.46 at the midpoint of our revenue range.”\n\nDividend Payment\n\nSkyworks’ Board of Directors has declared a cash dividend of $0.44 per share of the Company’s common stock, payable on March 3, 2020, to stockholders of record at the close of business on February 11, 2020.\n\nSkyworks’ First Quarter 2020 Conference Call\n\nSkyworks will host a conference call with analysts to discuss its first fiscal quarter 2020 results and business outlook today at 4:30 p.m. Eastern time. To listen to the conference call via the Internet, please visit the investor relations section of Skyworks’ website. To listen to the conference call via telephone, please call (844) 583-4549 (domestic) or (825) 312-2257 (international), confirmation code: 7077695.\n\nPlayback of the conference call will begin at 9:00 p.m. Eastern time on January 23 and end at 9:00 p.m. Eastern time on January 30. The replay will be available on Skyworks’ website or by calling (800) 585-8367 (domestic) or (416) 621-4642 (international), access code: 7077695.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com.\n\nSafe Harbor Statement\n\nThis news release includes \"forward-looking statements\" intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation information relating to future results and expectations of Skyworks (e.g., certain projections and business trends, as well as plans for dividend payments and share repurchases). Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will,\" or \"continue,\" and similar expressions and variations or negatives of these words. All such statements are subject to certain risks, uncertainties and other important factors that could cause actual results to differ materially and adversely from those projected, and may affect our future operating results, financial position and cash flows.\n\nThese risks, uncertainties and other important factors include, but are not limited to: the susceptibility of the semiconductor industry and the markets addressed by our, and our customers', products to economic downturns; our reliance on several key customers for a large percentage of our sales; the risks of doing business internationally, including increased import/export restrictions and controls (e.g., the effect of the U.S. Bureau of Industry and Security of the U.S. Department of Commerce placing Huawei Technologies Co., Ltd. and certain of its affiliates on the Bureau’s Entity List), imposition of trade protection measures (e.g., tariffs or taxes), security and health risks, possible disruptions in transportation networks, fluctuations in foreign currency exchange rates, and other economic, social, military and geo-political conditions in the countries in which we, our customers or our suppliers operate; the volatility of our stock price; declining selling prices, decreased gross margins, and loss of market share as a result of increased competition; our ability to obtain design wins from customers; delays in the standardization or commercial deployment of 5G technologies; changes in laws, regulations and/or policies that could adversely affect our operations and financial results, the economy and our customers' demand for our products, or the financial markets and our ability to raise capital; fluctuations in our manufacturing yields due to our complex and specialized manufacturing processes; our ability to develop, manufacture and market innovative products, avoid product obsolescence, reduce costs in a timely manner, transition our products to smaller geometry process technologies, and achieve higher levels of design integration; the quality of our products and any defect remediation costs; our products’ ability to perform under stringent operating conditions; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; our ability to retain, recruit and hire key executives, technical personnel and other employees in the positions and numbers, with the experience and capabilities, and at the compensation levels needed to implement our business and product plans; the timing, rescheduling or cancellation of significant customer orders and our ability, as well as the ability of our customers, to manage inventory; our ability to prevent theft of our intellectual property, disclosure of confidential information, or breaches of our information technology systems; uncertainties of litigation, including potential disputes over intellectual property infringement and rights, as well as payments related to the licensing and/or sale of such rights; our ability to continue to grow and maintain an intellectual property portfolio and obtain needed licenses from third parties; our ability to make certain investments and acquisitions, integrate companies we acquire, and/or enter into strategic alliances; and other risks and uncertainties, including, but not limited to, those detailed from time to time in our filings with the Securities and Exchange Commission.\n\nThe forward-looking statements contained in this news release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only and are the property of their respective owners.\n\nSKYWORKS SOLUTIONS, INC.\n\nDISCUSSION REGARDING THE USE OF NON-GAAP FINANCIAL MEASURES\n\nOur earnings release contains some or all of the following financial measures that have not been calculated in accordance with United States Generally Accepted Accounting Principles (“GAAP”): (i) non-GAAP gross profit and gross margin, (ii) non-GAAP operating income and operating margin, (iii) non-GAAP net income, and (iv) non-GAAP diluted earnings per share. As set forth in the “Unaudited Reconciliations of Non-GAAP Financial Measures” table found above, we derive such non-GAAP financial measures by excluding certain expenses and other items from the respective GAAP financial measure that is most directly comparable to each non-GAAP financial measure. Management uses these non-GAAP financial measures to evaluate our operating performance and compare it against past periods, make operating decisions, forecast for future periods, compare our operating performance against peer companies and determine payments under certain compensation programs. These non-GAAP financial measures provide management with additional means to understand and evaluate the operating results and trends in our ongoing business by eliminating certain non-recurring expenses and other items that management believes might otherwise make comparisons of our ongoing business with prior periods and competitors more difficult, obscure trends in ongoing operations or reduce management’s ability to make forecasts.\n\nWe provide investors with non-GAAP gross profit and gross margin, non-GAAP operating income and operating margin, non-GAAP net income and non-GAAP diluted earnings per share because we believe it is important for investors to be able to closely monitor and understand changes in our ability to generate income from ongoing business operations. We believe these non-GAAP financial measures give investors an additional method to evaluate historical operating performance and identify trends, an additional means of evaluating period-over-period operating performance and a method to facilitate certain comparisons of our operating results to those of our peer companies. We also believe that providing non-GAAP operating income and operating margin allows investors to assess the extent to which our ongoing operations impact our overall financial performance. We further believe that providing non-GAAP net income and non-GAAP diluted earnings per share allows investors to assess the overall financial performance of our ongoing operations by eliminating the impact of share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, restructuring-related charges, certain deferred executive compensation and certain tax items which may not occur in each period presented and which may represent non-cash items unrelated to our ongoing operations. We believe that disclosing these non-GAAP financial measures contributes to enhanced financial reporting transparency and provides investors with added clarity about complex financial performance measures.\n\nWe calculate non-GAAP gross profit by excluding from GAAP gross profit, share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, and restructuring-related charges. We calculate non-GAAP operating income by excluding from GAAP operating income, share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, restructuring-related charges, and certain deferred executive compensation. We calculate non-GAAP net income and diluted earnings per share by excluding from GAAP net income and diluted earnings per share, share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, restructuring-related charges, certain deferred executive compensation, and certain tax items. We exclude the items identified above from the respective non-GAAP financial measure referenced above for the reasons set forth with respect to each such excluded item below:\n\nShare-Based Compensation - because (1) the total amount of expense is partially outside of our control because it is based on factors such as stock price volatility and interest rates, which may be unrelated to our performance during the period in which the expense is incurred, (2) it is an expense based upon a valuation methodology premised on assumptions that vary over time, and (3) the amount of the expense can vary significantly between companies due to factors that can be outside of the control of such companies.\n\nAcquisition-Related Expenses - including such items as, when applicable, amortization of acquired intangible assets, fair value adjustments to contingent consideration, fair value charges incurred upon the sale of acquired inventory, and acquisition-related expenses because they are not considered by management in making operating decisions and we believe that such expenses do not have a direct correlation to our future business operations and thereby including such charges does not necessarily reflect the performance of our ongoing operations for the period in which such charges or reversals are incurred.\n\nRestructuring-Related Charges - because these charges have no direct correlation to our future business operations and including such charges or reversals does not necessarily reflect the performance of our ongoing operations for the period in which such charges or reversals are incurred.\n\nSettlements, Gains, Losses and Impairments - because such settlements, gains, losses and impairments (1) are not considered by management in making operating decisions, (2) are infrequent in nature, (3) are generally not directly controlled by management, (4) do not necessarily reflect the performance of our ongoing operations for the period in which such charges are recognized and/or (5) can vary significantly in amount between companies and make comparisons less reliable.\n\nDeferred Executive Compensation - including charges related to any contingent obligation pursuant to an executive severance agreement, because that expense has no direct correlation with our recurring business operations and including such expenses or reversals does not accurately reflect the compensation expense for the period in which incurred.\n\nCertain Income Tax Items - including certain deferred tax charges and benefits that do not result in a current tax payment or tax refund and other adjustments, including but not limited to, items unrelated to the current fiscal year or that are not indicative of our ongoing business operations.\n\nThe non-GAAP financial measures presented in the table above should not be considered in isolation and are not an alternative for the respective GAAP financial measure that is most directly comparable to each such non-GAAP financial measure. Investors are cautioned against placing undue reliance on these non-GAAP financial measures and are urged to review and consider carefully the adjustments made by management to the most directly comparable GAAP financial measures to arrive at these non-GAAP financial measures. Non-GAAP financial measures may have limited value as analytical tools because they may exclude certain expenses that some investors consider important in evaluating our operating performance or ongoing business performance. Further, non-GAAP financial measures are likely to have limited value for purposes of drawing comparisons between companies as a result of different companies potentially calculating similarly titled non-GAAP financial measures in different ways because non-GAAP measures are not based on any comprehensive set of accounting rules or principles.\n\nOur earnings release contains forward-looking estimates of non-GAAP diluted earnings per share for the second quarter of our 2020 fiscal year (“Q2 2020”). We provide this non-GAAP measure to investors on a prospective basis for the same reasons (set forth above) that we provide it to investors on a historical basis. We are unable to provide a reconciliation of our forward-looking estimate of Q2 2020 GAAP diluted earnings per share to a forward-looking estimate of Q2 2020 non-GAAP diluted earnings per share because certain information needed to make a reasonable forward-looking estimate of GAAP diluted earnings per share for Q2 2020 (other than estimated share-based compensation expense of $0.15 to $0.20 per diluted share, estimated amortization of intangibles of $0.05 to $0.07 per diluted share and certain tax items of -$0.05 to $0.05 per diluted share) is difficult to predict and estimate and is often dependent on future events that may be uncertain or outside of our control. Such events may include unanticipated changes in our GAAP effective tax rate, unanticipated one-time charges related to asset impairments (fixed assets, inventory, intangibles or goodwill), unanticipated acquisition-related expenses, unanticipated settlements, gains, losses and impairments and other unanticipated non-recurring items not reflective of ongoing operations. The probable significance of these unknown items, in the aggregate, is estimated to be in the range of $0.00 to $0.08 in quarterly earnings per diluted share on a GAAP basis. Our forward-looking estimates of both GAAP and non-GAAP measures of our financial performance may differ materially from our actual results and should not be relied upon as statements of fact.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005782/en/\nMedia Relations:\nPilar Barrigas\n(949) 231-3061\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Sets Date for First Quarter Fiscal 2020 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Jan 9, 2020 8:00AM EST",
        "content": "\nJanuary 23 at 4:30 p.m. Eastern Time\n    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, will conduct a conference call with analysts to discuss its first quarter fiscal 2020 results and business outlook on January 23, 2020 at 4:30 p.m. Eastern time.\n\nAfter the close of the market on January 23 and prior to the conference call, Skyworks will issue a copy of the earnings press release via Business Wire. The press release may also be viewed on Skyworks’ website at www.skyworksinc.com/investors.\n\nTo listen to the conference call via the Internet, please visit the investor relations section of Skyworks’ website. To listen to the conference call via telephone, please call (844) 583-4549 (domestic) or (825) 312-2257 (international), confirmation code: 7077695.\n\nPlayback of the conference call will begin at 9:00 p.m. Eastern time on January 23 and end at 9:00 p.m. Eastern time on January 30. The replay will be available on Skyworks’ website or by calling (800) 585-8367 (domestic) or (416) 621-4642 (international), access code: 7077695.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com.\n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties, including those identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005322/en/\nMedia Relations:\nPilar Barrigas\n(949) 231-3061\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Delivers Premium Audio in Leading Sound Bars",
        "subtitle": "",
        "date": "Jan 8, 2020 8:00AM EST",
        "content": "\nProvides Turnkey Solutions for Top Global Brands\n    LAS VEGAS--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that its advanced audio processing and cognitive wireless solutions are enabling high performance sound bars from market leaders including Harman Kardon/JBL, Panasonic, Polk, Samsung, Sony, Toshiba, VIZIO and Yamaha. Skyworks’ analog system-on-chips (ASoCs) combine breakthrough audio/voice circuits, highly efficient power management ICs and custom hardware accelerators to enable smart acoustic signal processing and artificial intelligence (AI) features in audio systems. Through collaboration with key customers, Skyworks has played an important role in pioneering a new era of plug-and-play entertainment systems for the connected home.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200108005109/en/(Graphic: Business Wire)\nSound bars are speakers that help create an immersive, theater-like experience. By occupying minimal space and eliminating the need for multiple speakers and external wiring, consumers are able to enjoy versatile, quality sound in their home. Skyworks’ sixth generation cognitive wireless devices are the industry’s leading fixed low-latency audio solutions that deliver uncompressed, superior quality. Further, Skyworks’ proprietary platforms provide extreme interference resistance and co-existence for standards like Wi-Fi® and Bluetooth®.\n\n“Skyworks is pleased to offer unique ASoCs that deliver vital digital signal processing and wireless capabilities for high quality sound bars in today’s smart home,” said Manpreet Khaira, vice president and general manager of AI Solutions for Skyworks. “With a multitude of emerging applications requiring premium audio and AI functionality, we provide manufacturers with highly-integrated devices that set new performance standards and expedite time-to-market.”\n\nAbout Skyworks’ Audio Solutions\n\nThrough its 2018 acquisition of Avnera, Skyworks offers market-leading audio processors and cognitive wireless chipsets that power point-to-point and point-to-multi-point wireless connections in addition to synchronized multi-channel audio capabilities. Products include proprietary protocols for global hardware support and radio functionality with best-in-class co-existence for popular wireless standards. Skyworks’ solutions provide fixed and low-latency, uncompressed audio and interference-free transmission which are imperative for applications such as wireless home entertainment speakers, sound bars and gaming consoles.\n\nPlease visit Skyworks’ AI Solutions page for more information.\n\nSkyworks at CES\n\nSkyworks will be hosting customer meetings at CES by appointment from January 7 - 10, 2020 at the Sands Expo. Contact sales@skyworksinc.com for additional information or to schedule a meeting.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; delays in the standardization or commercial deployment of 5G technologies; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; our products’ ability to perform under stringent operating conditions; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005109/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Enables Top Smart Home Security Systems",
        "subtitle": "",
        "date": "Jan 7, 2020 8:00AM EST",
        "content": "\nSolutions Offer Enhanced IoT Connectivity for Expanding Connected Home Market\n    LAS VEGAS--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (NASDAQ: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that its proprietary solutions are powering essential connectivity in platforms across the growing smart home security segment. Leading brands including Amazon, Arlo, Google, Honeywell and Ring have adopted Skyworks’ highly integrated architectures in their newest surveillance systems and video doorbells, several of which are noted in a recent CNET article highlighting the best security cameras of 2020.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200107005393/en/(Photo: Business Wire)\nSkyworks’ wireless engines deliver extended range as well as maximum power and efficiency in a compact form-factor, enabling breakthrough features such as live HD video feeds, remote siren activation and two-way communication from a mobile device. In addition, Skyworks’ technology facilitates cloud connectivity for data and video storage features in these emerging IoT applications.\n\nThe rapid proliferation of home security systems is providing end users with the ability to monitor their residence remotely ─ adding to the growing list of conveniences and safety measures available in today’s connected home. According to an October 2019 Strategy Analytics report, global surveillance home camera sales will surge to more than 111 million units by 2023, up from approximately 54 million units in 2019, representing a 20 percent compounded annual growth rate. They also predict that the growth in consumer spending on video doorbells will be the highest of any camera category over this period.\n\n“Skyworks is uniquely delivering advanced architectures for short and long range connectivity throughout smart homes, empowering a multitude of IoT products,” said Carlos Bori, senior vice president of sales and marketing for Skyworks. “From security cameras and sensors to doorbells, locks, appliances and lighting, our solutions are driving convenience, safety features, and efficiency. We are delighted to partner with market leaders in bringing next generation technologies to life.”\n\nAbout Skyworks’ Solutions for Connected Home Security\n\nSkyworks’ highly integrated front-end modules for connected home applications include the SKY66420-11, SKY66421-11, SKY66423-11 designed for LPWAN as well as the SKY66114-11, SKY66403-11, and SKY66405-11 which support Zigbee®, Thread and Bluetooth® (including Low Energy). These security devices are also leveraging Skyworks’ high performance Wi-Fi front-end modules and switches including the SKY85337-11, SKY85746-11, SKY13370-374LF and SKY13698-694LF.\n\nPlease visit Skyworks’ IoT page for more information about the complete portfolio of solutions.\n\nSkyworks at CES\n\nSkyworks will be hosting customer meetings at CES by appointment from January 7 - 10, 2020 at the Sands Expo. Contact sales@skyworksinc.com for additional information or to schedule a meeting.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement \n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; delays in the standardization or commercial deployment of 5G technologies; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; our products’ ability to perform under stringent operating conditions; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200107005393/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Accelerates Adoption of 5G Massive IoT Applications",
        "subtitle": "",
        "date": "Jan 6, 2020 8:00AM EST",
        "content": "\nCellular-based Solution Certified by Global Carriers Including KDDI, NTT Docomo, SoftBank and Verizon \n    LAS VEGAS--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that its family of connectivity modules are powering the rapidly emerging 5G Massive Internet of Things (Massive IoT) market. Specifically, Skyworks’ turnkey engines provide the critical wireless functionality that is becoming essential for the billions of devices, objects and machines across an increasingly connected world.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200106005443/en/(Photo: Business Wire)\nIoT manufacturers are quickly embracing cellular connectivity given its ability to deliver a secure, real-time device-to-cloud connection needed for remote monitoring, control, or management. This low-power, wide area network (LPWAN) capability is ideal for widely adopted consumer products such as smartwatches, wearables and asset trackers, as well as industrial and infrastructure applications such as gas, water and electric metering, machine monitoring, factory automation, supply chain and logistics oversight.\n\n“With the emergence of 5G, IoT devices utilizing Skyworks’ carrier-certified solutions will go to market faster and be more cost-effective than implementing discrete architectures,” said John O’Neill, vice president of marketing for Skyworks. “Skyworks has established itself as a leader in developing breakthrough 5G platforms for mobile and has now combined this expertise with market leading modem technology to provide extremely power-efficient and unmatched integration for IoT innovations globally.”\n\nAccording to a recent 5G Americas white paper, in parallel to the 5G rollout, cellular IoT (also known as Massive IoT) is becoming the technology of choice for wide area IoT applications. In a 2019 Mobility Report from Ericsson, cellular-connected IoT devices are predicted to grow from 1 billion units in 2018 to 4.1 billion units by 2024, representing a 27 percent compounded annual growth rate. As a subset, LTE-M/NB-IoT (Massive IoT) is expected to represent 45 percent of this figure, or roughly two billion connections, up from less than 10 million in 2018.\n\nAbout Skyworks’ Massive IoT Portfolio\n\nSkyworks’ innovations expedite time-to-market by incorporating all the required functionality to deliver maximum performance and optimized power efficiency in the most compact package available. The flagship SKY66430-11 is the world’s smallest, fully certified all-in-one device and incorporates a multi-band, multi-chip system-in-package (SiP) enabling cellular LTE-M/NB-IoT (half-duplex FDD) architectures. By integrating Sequans’ Monarch SQN3330 chip, customers have an entire RF front-end (RFFE), transceiver, power management, memory and baseband modem for an LTE multiband radio operating in the 700 to 2200 MHz frequency range.\n\nSkyworks’ SiP has been certified by leading worldwide carriers including KDDI, NTT Docomo, SoftBank and Verizon. Early adopters of Skyworks’ Massive IoT portfolio include:\n\nOther products from Skyworks’ Massive IoT portfolio include the SKY68020-11, SKY68001-31, SKY68001-41, SKY68018-11 and SKY77368-11 multiband RFFE modules supporting up to Power Class 3 (+23 dBm) half-duplex transceiver platforms. These solutions are designed for global 5G Massive IoT network deployments in low-band and mid-band frequencies in addition to providing 2G backward compatibility, either natively or through auxiliary ports. These 5G-ready devices work in tandem with all major LTE-M/NB-IoT modems and are currently available.\n\nSkyworks at CES\n\nSkyworks will be hosting customer meetings and demonstrating its SKY66430 at CES by appointment from January 7 - 10, 2020 at the Sands Expo. Contact sales@skyworksinc.com for additional information or to schedule a meeting.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement \n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; delays in the standardization or commercial deployment of 5G technologies; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; our products’ ability to perform under stringent operating conditions; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005443/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks to Present at J.P. Morgan CES Tech/Auto Forum",
        "subtitle": "",
        "date": "Jan 3, 2020 8:00AM EST",
        "content": "    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that executives will be participating in the J.P. Morgan 18th Annual CES Technology/Auto Forum on January 7, 2020 at 3:40 p.m. Pacific time from the Bellagio Hotel in Las Vegas.\n\nThe event will be webcast live and archived for replay for one week following the conference in the “Investors” section of Skyworks’ website at www.skyworksinc.com.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com.\n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties, including those identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200103005073/en/\nMedia Relations:\nPilar Barrigas\n(949) 231-3061\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Apple, Boeing, Mastercard, QUALCOMM, or Skyworks Solutions?",
        "subtitle": "",
        "date": "Dec 12, 2019 9:31AM EST",
        "content": "NEW YORK, Dec. 12, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BA, MA, QCOM, and SWKS.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-apple-boeing-mastercard-qualcomm-or-skyworks-solutions-300974051.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Skyworks to Present at Barclays Global Technology, Media and Telecommunications Conference",
        "subtitle": "",
        "date": "Dec 3, 2019 8:00AM EST",
        "content": "    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that executives will be presenting a company overview at the Barclays Global Technology, Media and Telecommunications Conference on December 11, 2019 at 10:30 a.m. Pacific time from The Palace Hotel in San Francisco.\n\nThe presentation will be webcast live and archived for replay for one week following the conference on the “Investors” section of Skyworks’ website at www.skyworksinc.com.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties, including those identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191203005318/en/\nMedia Relations:\nPilar Barrigas\n(949) 231-3061\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Reports Q4 and Full Year FY19 Results",
        "subtitle": "",
        "date": "Nov 12, 2019 4:15PM EST",
        "content": "    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today reported fourth fiscal quarter and fiscal year-end results for the period ended September 27, 2019.\n\nRevenue for the fourth fiscal quarter of 2019 was $827.4 million, up 8 percent sequentially. On a GAAP basis, operating income for the fourth fiscal quarter of 2019 was $233.9 million with diluted earnings per share of $1.22. On a non-GAAP basis, operating income was $281.1 million with non-GAAP diluted earnings per share of $1.52.\n\nFor fiscal year 2019, revenue was $3.377 billion, with GAAP diluted earnings per share of $4.89. Non-GAAP diluted earnings per share for fiscal year 2019 were $6.17.\n\n“Skyworks delivered solid financial results in the fourth fiscal quarter, closing a year that saw extraordinary market volatility and change,” said Liam K. Griffin, president and chief executive officer of Skyworks. “Looking ahead, we are well positioned to execute on our mission of delivering compelling 5G solutions across a growing and diverse suite of customers and markets. Our systems-level approach, highlighted by our Sky5® platform, now includes strategic capabilities in BAW, Wi-Fi 6, MIMO and custom diversity receive. Collectively, these solutions are unleashing the true potential of 5G – successfully providing a range of options to our customers while increasing the value and utility of each usage case. We are in the early innings of this substantial technology inflection, as we translate these dynamics into sustainable growth and profitability.”\n\nFourth Fiscal Quarter Business Highlights\n\nFirst Fiscal Quarter 2020 Outlook\n\nWe provide earnings guidance on a non-GAAP basis because certain information necessary to reconcile such guidance to GAAP is difficult to estimate and dependent on future events outside of our control. Please refer to the attached Discussion Regarding the Use of Non-GAAP Financial Measures in this press release for a further discussion of our use of non-GAAP measures, including quantification of known expected adjustment items.\n\n“Strategic product ramps, content gains and an expanding footprint across a broad set of customers, end markets and applications are expected to drive sequential revenue and earnings growth in the December quarter,” said Kris Sennesael, senior vice president and chief financial officer of Skyworks. “Specifically, in the first fiscal quarter of 2020, we anticipate revenue to be between $870 and $890 million with non-GAAP diluted earnings per share of $1.65 at the midpoint of our revenue range.”\n\nDividend Payment\n\nSkyworks’ Board of Directors has declared a cash dividend of $0.44 per share of the Company’s common stock, payable on December 24, 2019, to stockholders of record at the close of business on December 3, 2019.\n\nSkyworks’ Fourth Quarter 2019 Conference Call\n\nSkyworks will host a conference call with analysts to discuss its fourth fiscal quarter 2019 results and business outlook today at 5:00 p.m. Eastern time. To listen to the conference call via the Internet, please visit the investor relations section of Skyworks' website. To listen to the conference call via telephone, please call (844) 583-4549 (domestic) or (825) 312-2257 (international), confirmation code: 4255806.\n\nPlayback of the conference call will begin at 9:00 p.m. Eastern time on November 12, and end at 9:00 p.m. Eastern time on November 19. The replay will be available on Skyworks' website or by calling (800) 585-8367 (domestic) or (416) 621-4642 (international), access code: 4255806.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com.\n\nSafe Harbor Statement\n\nThis news release includes \"forward-looking statements\" intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements include without limitation information relating to future results and expectations of Skyworks (e.g., certain projections and business trends, as well as plans for dividend payments and share repurchases). Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will,\" or \"continue,\" and similar expressions and variations or negatives of these words. All such statements are subject to certain risks, uncertainties and other important factors that could cause actual results to differ materially and adversely from those projected, and may affect our future operating results, financial position and cash flows.\n\nThese risks, uncertainties and other important factors include, but are not limited to: the susceptibility of the semiconductor industry and the markets addressed by our, and our customers', products to economic downturns; our reliance on several key customers for a large percentage of our sales; the risks of doing business internationally, including increased import/export restrictions and controls (e.g., the effect of the U.S. Bureau of Industry and Security of the U.S. Department of Commerce placing Huawei Technologies Co., Ltd. and certain of its affiliates on the Bureau’s Entity List), imposition of trade protection measures (e.g., tariffs or taxes), security and health risks, possible disruptions in transportation networks, fluctuations in foreign currency exchange rates, and other economic, social, military and geo-political conditions in the countries in which we, our customers or our suppliers operate; the volatility of our stock price; declining selling prices, decreased gross margins, and loss of market share as a result of increased competition; our ability to obtain design wins from customers; delays in the standardization or commercial deployment of 5G technologies; changes in laws, regulations and/or policies that could adversely affect our operations and financial results, the economy and our customers' demand for our products, or the financial markets and our ability to raise capital; fluctuations in our manufacturing yields due to our complex and specialized manufacturing processes; our ability to develop, manufacture and market innovative products, avoid product obsolescence, reduce costs in a timely manner, transition our products to smaller geometry process technologies, and achieve higher levels of design integration; the quality of our products and any defect remediation costs; our products’ ability to perform under stringent operating conditions; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; our ability to retain, recruit and hire key executives, technical personnel and other employees in the positions and numbers, with the experience and capabilities, and at the compensation levels needed to implement our business and product plans; the timing, rescheduling or cancellation of significant customer orders and our ability, as well as the ability of our customers, to manage inventory; our ability to prevent theft of our intellectual property, disclosure of confidential information, or breaches of our information technology systems; uncertainties of litigation, including potential disputes over intellectual property infringement and rights, as well as payments related to the licensing and/or sale of such rights; our ability to continue to grow and maintain an intellectual property portfolio and obtain needed licenses from third parties; our ability to make certain investments and acquisitions, integrate companies we acquire, and/or enter into strategic alliances; and other risks and uncertainties, including, but not limited to, those detailed from time to time in our filings with the Securities and Exchange Commission.\n\nThe forward-looking statements contained in this news release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only and are the property of their respective owners.\n\nSKYWORKS SOLUTIONS, INC.\n\nDISCUSSION REGARDING THE USE OF NON-GAAP FINANCIAL MEASURES\n\nOur earnings release contains some or all of the following financial measures that have not been calculated in accordance with United States Generally Accepted Accounting Principles (“GAAP”): (i) non-GAAP gross profit and gross margin, (ii) non-GAAP operating income and operating margin, (iii) non-GAAP net income, and (iv) non-GAAP diluted earnings per share. As set forth in the “Unaudited Reconciliations of Non-GAAP Financial Measures” table found above, we derive such non-GAAP financial measures by excluding certain expenses and other items from the respective GAAP financial measure that is most directly comparable to each non-GAAP financial measure. Management uses these non-GAAP financial measures to evaluate our operating performance and compare it against past periods, make operating decisions, forecast for future periods, compare our operating performance against peer companies and determine payments under certain compensation programs. These non-GAAP financial measures provide management with additional means to understand and evaluate the operating results and trends in our ongoing business by eliminating certain non-recurring expenses and other items that management believes might otherwise make comparisons of our ongoing business with prior periods and competitors more difficult, obscure trends in ongoing operations or reduce management’s ability to make forecasts.\n\nWe provide investors with non-GAAP gross profit and gross margin, non-GAAP operating income and operating margin, non-GAAP net income and non-GAAP diluted earnings per share because we believe it is important for investors to be able to closely monitor and understand changes in our ability to generate income from ongoing business operations. We believe these non-GAAP financial measures give investors an additional method to evaluate historical operating performance and identify trends, an additional means of evaluating period-over-period operating performance and a method to facilitate certain comparisons of our operating results to those of our peer companies. We also believe that providing non-GAAP operating income and operating margin allows investors to assess the extent to which our ongoing operations impact our overall financial performance. We further believe that providing non-GAAP net income and non-GAAP diluted earnings per share allows investors to assess the overall financial performance of our ongoing operations by eliminating the impact of share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, restructuring-related charges, certain deferred executive compensation and certain tax items which may not occur in each period presented and which may represent non-cash items unrelated to our ongoing operations. We believe that disclosing these non-GAAP financial measures contributes to enhanced financial reporting transparency and provides investors with added clarity about complex financial performance measures.\n\nWe calculate non-GAAP gross profit by excluding from GAAP gross profit, share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, and restructuring-related charges. We calculate non-GAAP operating income by excluding from GAAP operating income, share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, restructuring-related charges, and certain deferred executive compensation. We calculate non-GAAP net income and diluted earnings per share by excluding from GAAP net income and diluted earnings per share, share-based compensation expense, acquisition-related expenses, amortization of acquisition-related intangibles, settlements, gains, losses and impairments, restructuring-related charges, certain deferred executive compensation, and certain tax items. We exclude the items identified above from the respective non-GAAP financial measure referenced above for the reasons set forth with respect to each such excluded item below:\n\nShare-Based Compensation - because (1) the total amount of expense is partially outside of our control because it is based on factors such as stock price volatility and interest rates, which may be unrelated to our performance during the period in which the expense is incurred, (2) it is an expense based upon a valuation methodology premised on assumptions that vary over time, and (3) the amount of the expense can vary significantly between companies due to factors that can be outside of the control of such companies.\n\nAcquisition-Related Expenses - including such items as, when applicable, amortization of acquired intangible assets, fair value adjustments to contingent consideration, fair value charges incurred upon the sale of acquired inventory, and acquisition-related expenses because they are not considered by management in making operating decisions and we believe that such expenses do not have a direct correlation to our future business operations and thereby including such charges does not necessarily reflect the performance of our ongoing operations for the period in which such charges or reversals are incurred.\n\nRestructuring-Related Charges - these charges have no direct correlation to our future business operations and including such charges or reversals does not necessarily reflect the performance of our ongoing operations for the period in which such charges or reversals are incurred.\n\nSettlements, Gains, Losses and Impairments - because such settlements, gains, losses and impairments (1) are not considered by management in making operating decisions, (2) are infrequent in nature, (3) are generally not directly controlled by management, (4) do not necessarily reflect the performance of our ongoing operations for the period in which such charges are recognized and/or (5) can vary significantly in amount between companies and make comparisons less reliable.\n\nDeferred Executive Compensation - including charges related to any contingent obligation pursuant to an executive severance agreement, because that expense has no direct correlation with our recurring business operations and including such expenses or reversals does not accurately reflect the compensation expense for the period in which incurred.\n\nCertain Income Tax Items - including certain deferred tax charges and benefits that do not result in a current tax payment or tax refund and other adjustments, including but not limited to, items unrelated to the current fiscal year or that are not indicative of our ongoing business operations.\n\nThe non-GAAP financial measures presented in the table above should not be considered in isolation and are not an alternative for the respective GAAP financial measure that is most directly comparable to each such non-GAAP financial measure. Investors are cautioned against placing undue reliance on these non-GAAP financial measures and are urged to review and consider carefully the adjustments made by management to the most directly comparable GAAP financial measures to arrive at these non-GAAP financial measures. Non-GAAP financial measures may have limited value as analytical tools because they may exclude certain expenses that some investors consider important in evaluating our operating performance or ongoing business performance. Further, non-GAAP financial measures are likely to have limited value for purposes of drawing comparisons between companies because different companies may calculate similarly titled non-GAAP financial measures in different ways because non-GAAP measures are not based on any comprehensive set of accounting rules or principles.\n\nOur earnings release contains forward-looking estimates of non-GAAP diluted earnings per share for the first quarter of our 2020 fiscal year (“Q1 2020”). We provide this non-GAAP measure to investors on a prospective basis for the same reasons (set forth above) that we provide it to investors on a historical basis. We are unable to provide a reconciliation of our forward-looking estimate of Q1 2020 GAAP diluted earnings per share to a forward-looking estimate of Q1 2020 non-GAAP diluted earnings per share because certain information needed to make a reasonable forward-looking estimate of GAAP diluted earnings per share for Q1 2020 (other than estimated share-based compensation expense of $0.10 to $0.14 per diluted share, estimated amortization of intangibles of $0.05 to $0.07 per diluted share and certain tax items of $0.00 to $0.05 per diluted share) is difficult to predict and estimate and is often dependent on future events that may be uncertain or outside of our control. Such events may include unanticipated changes in our GAAP effective tax rate, unanticipated one-time charges related to asset impairments (fixed assets, inventory, intangibles or goodwill), unanticipated acquisition-related expenses, unanticipated settlements, gains, losses and impairments and other unanticipated non-recurring items not reflective of ongoing operations. The probable significance of these unknown items, in the aggregate, is estimated to be in the range of $0.00 to $0.08 in quarterly earnings per diluted share on a GAAP basis. Our forward-looking estimates of both GAAP and non-GAAP measures of our financial performance may differ materially from our actual results and should not be relied upon as statements of fact.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191112006072/en/\nMedia Relations:\nPilar Barrigas\n(949) 231-3061\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Sets Date for Fourth Quarter and Fiscal Year 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Oct 22, 2019 8:00AM EDT",
        "content": "\nNovember 12 at 5:00 p.m. Eastern Time\n    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, will conduct a conference call with analysts to discuss its fourth quarter and fiscal year 2019 results and business outlook on November 12, 2019, at 5:00 p.m. Eastern time.\n\nAfter the close of the market on November 12, and prior to the conference call, Skyworks will issue a copy of the earnings press release via Business Wire. The press release may also be viewed on Skyworks' website at www.skyworksinc.com.\n\nTo listen to the conference call via the Internet, please visit the investor relations section of Skyworks' website. To listen to the conference call via telephone, please call (844) 583-4549 (domestic) or (825) 312-2257 (international), confirmation code: 4255806.\n\nPlayback of the conference call will begin at 9:00 p.m. Eastern time on November 12, and end at 9:00 p.m. Eastern time on November 19. The replay will be available on Skyworks' website or by calling (800) 585-8367 (domestic) or (416) 621-4642 (international), access code: 4255806.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com.\n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties, including those identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005337/en/\nMedia Relations:\nPilar Barrigas\n(949) 231-3061\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Ramps Solutions for Next Generation Wi-Fi 6 Applications",
        "subtitle": "",
        "date": "Oct 9, 2019 8:00AM EDT",
        "content": "\nMarket Leaders Choose Skyworks Connectivity Modules\n    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that its advanced connectivity solutions are powering next generation Wi-Fi 6 (802.11ax) devices from the world’s leading connected home and mesh network providers, including Arris, Asus, D-Link, Netgear, Ruckus and TP-Link. Specifically, Skyworks’ modules are being leveraged in all of the latest Wi-Fi 6 routers named in a recent CNET article.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191009005182/en/(Graphic: Business Wire)\nWi-Fi 6 is the newest 802.11 wireless standard that is pushing the performance envelope with speeds up to 30 percent faster than the previous 802.11ac (Wi-Fi 5) protocol. These state-of-the-art routers accommodate the growing number of cloud devices and users in today’s connected home by optimizing overall efficiency and data throughput. Skyworks’ powerful modules facilitate this enhanced functionality with best-in-class linearity and performance in the smallest footprint available.\n\n“Skyworks has decades of experience developing cutting-edge technologies for successive wireless standards and we are proud to partner with industry leaders to bring next generation products to the market, particularly as Wi-Fi 6 quickly gains momentum,” said Dave Stasey, vice president and general manager of diversified analog solutions for Skyworks. “Faster, more reliable and efficient Wi-Fi coverage is becoming increasingly important as more and more devices and users are connected in smart homes. Our portfolio of high performance solutions provides our customers with all the required functionality to deliver maximum Wi-Fi range and speeds to address the need for always-on connectivity.”\n\nAccording to ABI Research estimates, Wi-Fi 6 chipset shipments are expected to grow from approximately 127 million units in 2019 to close to 2 billion units by 2024, representing a compounded annual growth rate of approximately 73 percent.\n\nAbout Skyworks’ Wi-Fi 6 Connectivity Solutions\n\nSkyworks’ innovative solutions expedite time-to-market by incorporating all the required functionality to deliver maximum performance and contain a logarithmic power detector to support wide dynamic ranges, low power consumption and improved thermal management. Select products from Skyworks’ Wi-Fi 6 portfolio include:\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; our products’ ability to perform under stringent operating conditions; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191009005182/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Powers First All-in-One Virtual Reality Gaming System",
        "subtitle": "",
        "date": "Sep 9, 2019 8:00AM EDT",
        "content": "\nOculus Quest Leverages Fully Integrated SkyOne® Connectivity Solution \n    IRVINE, Calif.--(BUSINESS WIRE)--\nSkyworks Solutions, Inc. (Nasdaq: SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today announced that its highly integrated SkyOne® solution for WiFi is enabling Facebook’s Oculus Quest. Quest is the industry’s first all-in-one virtual reality (VR) gaming platform allowing players to wirelessly connect to the cloud for a seamless and immersive experience.\n\nOculus has become a pioneer in VR gaming with its next generation headset which features a camera-based positional tracking system and does not require a wired connection to a PC or phone to operate. By leveraging Skyworks’ innovative capabilities, the device delivers real-time wireless connectivity and offers users untethered six degrees of freedom ─ or the ability to move in any direction and walk through virtual space just as they would in the physical world.\n\n“Skyworks is proud to be at the forefront of wireless technologies, partnering with industry leaders to bring breakthrough applications to market,” said Carlos Bori, senior vice president of sales and marketing for Skyworks. “With our advanced technology portfolio and deep systems expertise we are powering an increasingly diverse array of emerging, high-growth segments across the IoT ecosystem, redefining user experiences and changing the way the world communicates.”\n\nAccording to a March 2019 research report from IDC, worldwide shipments of augmented and virtual reality headsets are forecast to reach 8.9 million units in 2019, up 54 percent from the prior year. Fueled in large part by new devices like the Oculus Quest, units are expected to reach nearly 69 million by 2023, representing a five-year compounded annual growth rate of 67 percent.\n\nAbout Skyworks’ Wireless Connectivity Solutions\n\nSkyworks’ fully integrated SkyOne® WiFi solution (SKY85813-11) expedites time-to-market, incorporating all the required functionality to deliver maximum Wi-Fi range and speed including:\n\nPlease visit Skyworks’ Wi-Fi Connectivity Front-end Modules for more information.\n\nAbout Skyworks\n\nSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.\n\nSkyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (Nasdaq: SWKS). For more information, please visit Skyworks’ website at: www.skyworksinc.com. \n\nSafe Harbor Statement\n\nAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; our products’ ability to perform under stringent operating conditions; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\n\nNote to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190909005173/en/\nMedia Relations:\nTami Stegmaier\n(949) 231-4207\n\nInvestor Relations:\nMitch Haws\n(949) 231-3223\nSource: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Sets Date for Second Quarter Fiscal 2019 Earnings Release and Conference Call",
        "subtitle": "",
        "date": "Apr 16, 2019 8:00AM EDT",
        "content": "May 2 at 5:00 p.m. Eastern TimeIRVINE, Calif.--(BUSINESS WIRE)-- Skyworks Solutions, Inc. (NASDAQ:SWKS), an innovator of high performance analog semiconductors connecting people, places and things, will conduct a conference call with analysts to discuss its second quarter fiscal 2019 results and business outlook on May 2, 2019, at 5:00 p.m. Eastern time.After the close of the market on May 2, and prior to the conference call, Skyworks will issue a copy of the earnings press release via Business Wire. The press release may also be viewed on Skyworks' website at www.skyworksinc.com.To listen to the conference call via the Internet, please visit the investor relations section of Skyworks' website. To listen to the conference call via telephone, please call (800) 230-1092 (domestic) or (612) 288-0329 (international), confirmation code: 466093.Playback of the conference call will begin at 9:00 p.m. Eastern time on May 2, and end at 9:00 p.m. Eastern time on May 9. The replay will be available on Skyworks' website or by calling (800) 475-6701 (domestic) or (320) 365-3844 (international), access code: 466093.About SkyworksSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.Skyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (NASDAQ:SWKS). For more information, please visit Skyworks' website at: www.skyworksinc.com.Safe Harbor StatementAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties, including those identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.Note to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190416005287/en/Source: Skyworks Solutions, Inc."
    },
    {
        "title": "BetterInvesting Magazine Releases May Stock To Study And Undervalued Stock Choices For Investors' Informational And Educational Use",
        "subtitle": "",
        "date": "Mar 1, 2019 4:15PM EST",
        "content": "MADISON HEIGHTS, Mich., March 1, 2019 /PRNewswire/ -- The Editorial Advisory and Securities Review Committee of BetterInvesting Magazine today announced Skyworks Solutions, Inc. (NDQ:SWKS) as its May 2019 \"Stock to Study\" and CarMax, Inc. (NYSE:KMX) as its May 2019 \"Undervalued Stock\" for investors' informational and educational use.\"The committee selected Skyworks Solutions for its opportunities in the internet of things industry and 5G networks, strong management and reasonable stock valuation,\" said Adam Ritt, editor of BetterInvesting Magazine. \"For the Undervalued selection, the committee cited CarMax's reasonable stock valuation in light of its ongoing fundamentals and proven business model.\"Check BetterInvesting's May issue for more details about these selections. Go to the trial version of BetterInvesting's online tools to study the investment potential of Skyworks Solutions and CarMax by viewing their fundamental data and applying judgments.Committee members are Robert M. Bilkie, Jr., CFA; Daniel J. Boyle, CFA; Marisa Bradbury, CFA; Philip S. Dano, CFA; Maury Elvekrog, CFA; Walter J. Kirchberger, CFA; and Adam Ritt.As stated, the BetterInvesting committee's Stock to Study and Undervalued Stock choices are for the informational and educational uses of investors and are not intended as investment recommendations. BetterInvesting urges investors to educate themselves about the stock market so they can make informed decisions about stock purchases.About BetterInvestingBetterInvesting is a national nonprofit organization that has been empowering individual investors since 1951. Founded in Detroit, the association (formerly known as National Association of Investors Corporation) was borne of the conviction that anyone can become a successful long-term investor by following common-sense investing practices. BetterInvesting has helped more than 5 million people become better, more informed investors by providing webinars, in-person events, easy-to-use online tools for analyzing stocks, a monthly magazine and a community of volunteers and like-minded investors. For more information about BetterInvesting, visit its website at www.betterinvesting.org or call toll free (877) 275-6242.Follow us on Twitter and Facebook. View original content:http://www.prnewswire.com/news-releases/betterinvesting-magazine-releases-may-stock-to-study-and-undervalued-stock-choices-for-investors-informational-and-educational-use-300805203.htmlSOURCE BetterInvesting"
    },
    {
        "title": "Skyworks Launches Sky5™ LiTE for Universal 5G Deployments",
        "subtitle": "",
        "date": "Feb 26, 2019 1:00AM EST",
        "content": "First High Performance Platforms to Support Mass Market DevicesBARCELONA, Spain--(BUSINESS WIRE)-- Skyworks Solutions, Inc. (NASDAQ:SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today introduced Sky5™ LiTE—the industry's first fully integrated front-end solution for mass tier 5G cellular applications. With improved RF performance in a uniquely compact package, Skyworks' newest device simplifies designs, enabling faster deployment. The baseband agnostic platform supports up to 100 MHz wide bandwidth of 5G new radio (NR) waveforms with flexible power management options—delivering high-speed network experiences with optimized efficiency and near zero latency. Targeted for mass markets, Sky5™ LiTE interfaces with all leading chipset providers and equips early 5G adopters with differentiated architectures for an open ecosystem - the favored approach when compared with closed, sole-sourced RF front-end products. With the recent introduction of Sky5™ Ultra for premium applications, Skyworks offers the most comprehensive 5G portfolio in the market.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190225006069/en/(Graphic: Business Wire)\"Sky5™ LiTE exceeds the performance requirements demanded by next generation devices while accelerating 5G implementation,\" said Kevin Walsh, vice president of marketing at Skyworks. \"Skyworks is offering truly turnkey, regionally optimized, easily deployable solutions purposefully designed to deliver all of the transmit and receive functionality in a highly integrated form factor. Our Sky5™ portfolio is powering revolutionary applications across mobile, automotive and the Internet of Things, making 5G a reality.\"According to the Global Mobile Suppliers Association, 201 operators in 83 countries are investing in 5G mobile and fixed wireless access networks in the form of tests, trials, pilot deployments and launches.About Sky5™LiTEAll Sky5™ solutions support new 5G NR waveforms and spectrum in addition to enhanced carrier aggregation and 4G/5G dual connectivity, while delivering exceptional levels of integration and performance. Functional core blocks include:Primary Transmit (Regional)Diversity/MIMO (Regional)Antenna Management CoreFor more information about Sky5™ LiTE and our comprehensive Sky5™ portfolio, visit www.skyworksinc.com/Products_Sky5 or contact Sky5@skyworksinc.com.Skyworks at Mobile World CongressSkyworks representatives will be in the Executive Meeting Area in Hall 2, 2G3Ex and 2G5Ex.About SkyworksSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.Skyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (NASDAQ:SWKS). For more information, please visit Skyworks' website at: www.skyworksinc.com.Safe Harbor StatementAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; uncertainties of litigation, including potential disputes over intellectual property infringement and rights; our ability to continue to grow and maintain an intellectual property portfolio and obtain needed licenses from third parties; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.Note to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190225006069/en/Source: Skyworks Solutions, Inc."
    },
    {
        "title": "Skyworks Unveils Breakthrough Sky5™ Ultra Platform",
        "subtitle": "",
        "date": "Feb 25, 2019 1:00AM EST",
        "content": "Leading the 5G Revolution with Differentiated Front-End SolutionsBARCELONA, Spain--(BUSINESS WIRE)-- Skyworks Solutions, Inc. (NASDAQ:SWKS), an innovator of high performance analog semiconductors connecting people, places and things, today launched its most advanced 5G cellular architecture yet, the Sky5™ Ultra. Leveraging decades of systems expertise, Skyworks has developed a fully integrated, baseband agnostic solution that combines all of the critical front-end functionality required to enable high performance 5G mobile devices with global coverage in an exceptionally compact form factor. The world's most comprehensive platform features best-in-class transmit and receive capabilities with unprecedented efficiency and output power, enabling highly reliable network connections while optimizing battery life—both critical for 5G applications. In addition, the Sky5™ Ultra leverages DSBGA packaging, dramatically reducing the footprint, and advanced TC-SAW and BAW filtering, uniquely providing the best performance at each targeted frequency band. The solution also supports up to 100 MHz wide bandwidth, maximizing data throughput at ultra-fast speeds.This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190224005060/en/(Graphic: Business Wire)\"With industry momentum accelerating towards 5G, Skyworks is leading the way with the technological innovations and systems expertise demonstrated by our Sky5™ portfolio, a highly flexible and customizable suite designed to meet customers' global requirements,\" said Joel King, senior vice president and general manager of Mobile Solutions at Skyworks. \"Sky5™ Ultra represents another breakthrough in simplifying the growing complexity of 5G device development—delivering unmatched performance while expediting deployment through full integration and optimized form factors. We are empowering top mobile device manufacturers and network providers with complete, turnkey solutions that will ultimately bring 5G to realization.\"5G rollouts have already begun and will continue to ramp over the next few years. According to the Global Mobile Suppliers Association, 11 worldwide operators have announced limited 5G service launches and seven additional operators have turned on 5G base stations, with commercial services to follow.About Sky5™UltraSky5™ Ultra incorporates Skyworks' high-efficiency transmit, diversity receive (DRx) and MIMO modules with industry-leading noise figure and low insertion loss, in addition to an array of aperture tuners and antenna swap switches for optimal antenna management. Like all Sky5™ solutions, the comprehensive front-end platform supports new 5G NR waveforms and spectrum in addition to enhanced carrier aggregation and 4G/5G dual connectivity, while delivering exceptional levels of integration and performance. Functional core blocks include:Primary Transmit (Global)5G Diversity/MIMO (Global)Connectivity (GPS, Wi-Fi, Bluetooth®)Antenna ManagementFor more information about Sky5™ Ultra and our comprehensive Sky5™ portfolio, visit www.skyworksinc.com/Products_Sky5 or contact Sky5@skyworksinc.com.Skyworks at Mobile World CongressSkyworks representatives will be in the Executive Meeting Area in Hall 2, 2G3Ex and 2G5Ex.About SkyworksSkyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications within the aerospace, automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets.Skyworks is a global company with engineering, marketing, operations, sales and support facilities located throughout Asia, Europe and North America and is a member of the S&P 500® and Nasdaq-100® market indices (NASDAQ:SWKS). For more information, please visit Skyworks' website at: www.skyworksinc.com.Safe Harbor StatementAny forward-looking statements contained in this press release are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation information relating to future events, results and expectations of Skyworks. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"believes,\" \"plans,\" \"may,\" \"will\" or \"continue,\" and similar expressions and variations (or negatives) of these words. Actual events and/or results may differ materially and adversely from such forward-looking statements as a result of certain risks and uncertainties including, but not limited to, our ability to timely and accurately predict market requirements and evolving industry standards and to identify opportunities in new markets; our ability to develop, manufacture, and market innovative products and avoid product obsolescence; our ability to compete in the marketplace and achieve market acceptance of our products; the availability and pricing of third-party semiconductor foundry, assembly and test capacity, raw materials and supplier components; the quality of our products; uncertainties of litigation, including potential disputes over intellectual property infringement and rights; our ability to continue to grow and maintain an intellectual property portfolio and obtain needed licenses from third parties; and other risks and uncertainties identified in the \"Risk Factors\" section of Skyworks' most recent Annual Report on Form 10-K (and/or Quarterly Report on Form 10-Q) as filed with the Securities and Exchange Commission (\"SEC\"). Copies of Skyworks' SEC filings can be obtained, free of charge, on Skyworks' website (www.skyworksinc.com) or at the SEC's website (www.sec.gov). Any forward-looking statements contained in this press release are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.Note to Editors: Skyworks and the Skyworks symbol are trademarks or registered trademarks of Skyworks Solutions, Inc. or its subsidiaries in the United States and other countries. Third-party brands and names are for identification purposes only, and are the property of their respective owners.View source version on businesswire.com: https://www.businesswire.com/news/home/20190224005060/en/Source: Skyworks Solutions, Inc."
    }
]