[
    {
        "title": "Introducing Distrito T-Mobile: Un-carrier Deepens Commitment to Puerto Rico with 10-Year Investment in New Entertainment Complex",
        "subtitle": "",
        "date": "Mar 3, 2020 9:02AM EST",
        "content": "\nWhat’s the news: T-Mobile is deepening its commitment to Puerto Rico, landing exclusive naming rights for Distrito T-Mobile, a massive, new entertainment complex in San Juan. Opening in April 2020, Distrito T-Mobile will serve up incredible concerts, movies, games, dining and so much more to the people of Puerto Rico for the next decade!\n\nWhy it matters: While Verizon remains absent and AT&T exits the island, T-Mobile is all-in on its support for the people of Puerto Rico as the community rebuilds and re-emerges stronger than ever.\n\nWho it’s for: The people of Puerto Rico.\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nT-Mobile (NASDAQ: TMUS) — in partnership with PRISA Group and ASM Global — today unveiled Distrito T-Mobile, a massive new entertainment complex in Puerto Rico, underscoring its commitment to the island as it rebuilds following Hurricane Maria and recent earthquakes. T-Mobile is the founding naming partner with a 10-year commitment, marking the first T-Mobile venue outside the continental U.S. and the first naming rights deal of its kind in Puerto Rico. Opening in April 2020, Distrito T-Mobile will become the hub of all things fun in San Juan, complete with some Un-carrier perks for all venue visitors.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200303005604/en/Introducing Distrito T-Mobile : Un-carrier Deepens Commitment to Puerto Rico with 10-Year Investment in New Entertainment Complex (Photo: Business Wire)\n“The residents of Puerto Rico have shown so much resilience as they rebuild after one of the worst natural disasters ever, and we want them to know T-Mobile is here to support them — this time, through a huge 10-year investment into the region,” said John Legere, CEO of T-Mobile. “We’re honored to expand our role in helping the community bounce back with Distrito T-Mobile — this is going to be epic!”\n\nIt’s true … there’s something for everyone at Distrito T-Mobile. The 476,000-square-foot complex features a Caribbean Cinemas VIP movie theater; Toro Verde ziplines; a virtual reality gaming center complete with laser tag and a bowling alley; a wide range of restaurants and a digital scenery system composed of 14,000 square feet of LED screens, including one of the largest horizontal 4K screens in the U.S. Plus, the Coca-Cola Music Hall will serve as the go-to venue for concerts and shows, while the first Aloft hotel in the Caribbean will become the ultimate place to stay.\n\nThe Un-carrier is providing all Distrito T-Mobile visitors with the awesome perks below — along with a couple of extras thrown in only for T-Mobile customers!\n\n“Today’s announcement and 10-year naming rights commitment underscores the support T-Mobile has consistently shown to Puerto Rico,” said Federico Stubbe Jr., President of PRISA Group. “There’s no finer destination for entertainment on the Island than Distrito T-Mobile, and we’re thrilled to have a disruptive partner in the Un-carrier to help bring this innovative vision of the future of entertainment to life for the benefit of all Puerto Ricans and visitors from throughout the world.”\n\nIn early 2019, T-Mobile rolled out a massive 600 MHz network expansion and in December 2019, T-Mobile launched 5G nationwide across the US, including blanketing nearly all of the island with 5G. And beyond the $450 million invested in building network coverage following Hurricane Maria in 2017, T-Mobile has repeatedly donated towards disaster recovery in the wake of recent hurricanes and earthquakes.\n\n“We at ASM Global are thrilled to have T-Mobile as our premier, naming rights partner at this incredible new venue,” said Bob Newman, President and CEO of ASM Global. “We have worked closely with T-Mobile for years, which makes us confident in our ability to elevate Distrito T-Mobile beyond anything we’ve ever seen in Puerto Rico.”\n\nFor more information on Distrito T-Mobile, visit DistritoT-Mobile.com. Follow T-Mobile’s Official Twitter Newsroom @TMobileNews to stay up-to-date with the latest company news.\n\nAbout T-Mobile US, Inc.\n\nAs America’s Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 86 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout PRISA Group\n\nPRISA Group (“PRISA”) is a Puerto Rican company owned by the Stubbe family that is dedicated to the development and construction of green residential communities and resorts in Puerto Rico and Florida. PRISA has developed residential communities with over 3,000 units in the last 20 years, mainly in its Sabanera communities in Cidra, Gurabo and Dorado, and in Dorado Beach Resort. In recent years, PRISA has completed several tourism projects, including El Dorado Beach, Ritz-Carlton Reserve, first in the Americas, West Beach & East Beach Ritz-Carlton Reserve Residences, Hyatt Place San Juan / Bayamón & El Tropical Casino, Hyatt Place Manatee & Atlantic Casino, Hyatt House San Juan, Hyatt Place San Juan / City Center, Springhill Suites and Residence Inn Millenia, Orlando and AC Hotel by Marriott Metwest International, Westshore, Tampa, the latter in Florida. In the development of these projects, PRISA currently employs over 1,450 people between direct and indirect jobs. PRISA is also developing an Element by Westin in Orlando, Florida and a hospital in association with Johns Hopkins Medicine International in Dorado, Puerto Rico. PRISA has been the recipient of several awards, including Builder of the Decade, three Planned Community of the Year awards granted by the Association of Home Builders (“ACH”) and the highest honor conferred by the AC, the Frank Ramírez de Arellano Award. In November 2014, PRISA was named the Developer of the Year of the Americas by Hyatt Hotel Corporation for the development of its Hyatt portfolio. For more information: www.prisagroup.com.\n\nAbout ASM Global\n\nASM Global is the world’s leading provider of innovative venue services and live experiences. The company was formed by the combination of AEG Facilities and SMG, global leaders in venue and event strategy and management. The company’s elite venue network spans five continents, with a portfolio of more than 300 of the world’s most prestigious arenas, stadiums, convention and exhibition centers, and performing arts venues. From Aberdeen to Anchorage, and Sydney to Stockholm, its venues connect people through the unique power of live experiences.\n\nASM Global’s diverse portfolio of clients benefit from the company’s depth of resources and unparalleled experience, expertise and creative problem-solving. Each day, the company’s 61,000 passionate employees around the world deliver locally tailored solutions and cutting-edge technologies to deliver maximum results for venue owners and amazing experiences for guests. By consistently looking for new ways to envision, innovate and empower the spaces and places that bring people together, ASM Global elevates the human spirit while delivering the highest value for all stakeholders. For more information, please visit www.asmglobal.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200303005604/en/\nMedia Contacts\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\n\nInvestor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "Surprise! T-Mobile Announces Not Just One, But Three Grand Prize Winners of the Second-Annual Changemaker Challenge",
        "subtitle": "",
        "date": "Feb 21, 2020 4:36PM EST",
        "content": "\nT-Mobile, the T-Mobile Foundation and Ashoka reveal that ALL three category winning teams of amazing youth will go home with seed money for their inspiring projects – and more!\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nOops, we did it again! T-Mobile senior leaders were SO impressed by the top three teams competing for the Grand Prize at this year’s T-Mobile Changemaker Challenge, they couldn’t just choose one winner… instead they awarded all three Category Winners the Grand Prize!\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200221005478/en/Surprise! T-Mobile Announces Not Just One, But Three Grand Prize Winners of the Second-Annual Changemaker Challenge (Photo: Business Wire)\nThe Changemaker Challenge is a nationwide search for youth ages 13-23 with big ideas for how to change the world for good. This week, 30 winning teams attended the three-day Changemaker Challenge Lab hosted at T-Mobile’s Bellevue, Wash., headquarters where the three category winning teams, AVA (Technology), Stories Untold (Education) and Youth Climate Action Coalition (Environment) got the chance to pitch their ideas to T-Mobile leadership and compete for the Grand Prize.\n\nInstead of just ONE team walking away with the Grand Prize, all three teams were selected to each receive a total of $10,000 in seed funding for their project, a return trip back to HQ to supercharge their ideas… AND in an unexpected Un-carrier twist, access to some of T-Mobile’s best and brightest senior leaders who will serve as advocates for the winning teams and provide an extra level of support and strategic counsel personalized to their individual projects—including marketing and social media advice, software development support, business advice and mentorship.\n\n“The Changemaker Challenge Lab is always one of THE most inspirational weeks at T-Mobile and this year did NOT disappoint — I was blown away! These young people have proven to me yet again that they have incredible stories and ideas and are willing to take big risks to drive positive, long-term change in their communities,” said Mike Sievert, T-Mobile President and COO. “We were incredibly inspired by what we heard and look forward to rolling up our sleeves alongside these teams to help them amplify their impact. This is just the beginning of their amazing journeys!”\n\nTo learn more about this year’s Changemaker Challenge Grand Prize winners, see below:\n\nThe three-day T-Mobile Changemaker Lab was designed to foster community among young innovators while helping them develop the skills to turn their projects into reality. A highlight of this year’s lab was the mentorship and connection the changemakers had with Nadya Okamoto, CEO of Period, the largest youth-run women’s health NGO and a recent Forbes 30 under 30 honoree. Nadya took time to meet with members of this year’s Changemaker class to give advice and encouragement. The events also included a speaking appearance from Jaclyn Corin, one of the organizers from the historic March for Our Lives. Jaclyn is also the founder of Never Again MSD, a student-led political action committee for gun control.\n\nFor more information about the T-Mobile Changemaker Challenge and to check out this year’s full list of winners, visit T-Mobile.com/Changemaker or visit T-Mobile’s media library to download B-roll or Images.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 86 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout T-Mobile Foundation \n\nThe T-Mobile Foundation is committed to changing the world for good. The Foundation advances positive change in our communities by supporting causes that focus on youth development, and by providing opportunities for T-Mobile employees to engage in causes that benefit the communities where they live and work. The T-Mobile Foundation, created and funded by T-Mobile US, Inc., is recognized by the IRS as a Section 501(c)(3) private foundation.\n\nAbout Ashoka\n\nAshoka is the largest global network of leading social entrepreneurs—individuals with new ideas to systemically address the world’s biggest challenges and the entrepreneurial skill to transform those ideas into national, regional and global social impact. Over 35 years, Ashoka has supported more than 3,500 social entrepreneurs in 90 countries with solutions addressing society’s most pressing issues. Ashoka’s vision is a world in which Everyone is a Changemaker—a society that responds quickly and effectively to challenges, and where each individual has the freedom, confidence and societal support to address any social problem. For more information, visit ashoka.org.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200221005478/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nor\nInvestor Relations\ninvestor.relations@t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile and Sprint Announce Amendment to Business Combination Agreement",
        "subtitle": "",
        "date": "Feb 20, 2020 5:14PM EST",
        "content": "\nCompanies drive forward toward closing the merger to become the New T-Mobile as early as April 1, 2020\n    BELLEVUE, Wash. & OVERLAND PARK, Kan.--(BUSINESS WIRE)--\nT-Mobile US, Inc. (NASDAQ: TMUS) and Sprint Corporation (NYSE: S) today announced that they have entered into an amendment to their definitive Business Combination Agreement to create the New T-Mobile. The Boards of Directors of T-Mobile and Sprint have unanimously approved the amendment. The amendment has no impact on T-Mobile’s previously stated outlook on the New T-Mobile’s synergies, long-term profitability and cash generation.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200220005964/en/\nA separate arrangement entered into by SoftBank Group Corp. in connection with the amendment will result in an effective exchange ratio of approximately 11.00 Sprint shares for each T-Mobile share immediately following the closing of the merger, an increase from the originally agreed 9.75 shares. This is a result of SoftBank agreeing to surrender approximately 48.8 million T-Mobile shares acquired in the merger to New T-Mobile immediately following the closing of the transaction, making SoftBank’s effective ratio 11.31 Sprint shares per T-Mobile share. Sprint shareholders other than SoftBank will continue to receive the original fixed exchange ratio of 0.10256 T-Mobile shares for each Sprint share, or the equivalent of approximately 9.75 Sprint shares for each T-Mobile share.\n\nImmediately following the closing, and after the surrender of shares by SoftBank, Deutsche Telekom and SoftBank are expected to hold approximately 43% and 24%, respectively, of the fully diluted New T-Mobile shares, with the remaining approximately 33% held by public shareholders.\n\nT-Mobile has agreed to re-issue to SoftBank the previously surrendered shares upon the achievement of certain stock price milestones by New T-Mobile during a specified measurement period, and subject to certain additional terms, as outlined in the letter agreement that will be filed by each of T-Mobile and Sprint with the SEC.\n\nIn addition, the amendment extends the “outside date” under the Business Combination Agreement to July 1, 2020, and modifies certain other provisions of the Business Combination Agreement as described in the companies’ SEC filings.\n\n“Today’s announcement is another significant step forward toward finally closing this transaction! Throughout this journey, T-Mobile and Sprint have been singularly focused on one thing: building a supercharged Un-carrier that will offer U.S. consumers a broad and deep nationwide 5G network, more choice and greater competition. We are now on the threshold of achieving our goal. And did I mention how fun it’s going to be sticking it to Dumb, Dumber and Big Cable along the way? This is going to be epic!” said John Legere, CEO of T-Mobile.\n\n“With today’s agreement in place, we are now turning our attention toward our goal of closing this transaction and creating the New T-Mobile as early as April 1, 2020,” said Mike Sievert, COO and President of T-Mobile, and appointed CEO of the company starting on May 1, 2020. “We are on the verge of being able to do what we’ve set out to do from day one -- reshape a broken wireless industry and create the new standard for consumers when it comes to value, speed, quality and service. The New T-Mobile is literally going to change wireless for good and now we’re almost ready to get to the fun part: bringing our teams together, building this supercharged Un-carrier and becoming the envy of the wireless industry and beyond!”\n\n“Completing this step is yet another critical milestone in securing Sprint’s future, and it brings us one step closer to closing this historic transaction that has been years in the making,” said Marcelo Claure, Sprint Executive Chairman. “I’m incredibly thankful for the perseverance and resilience of everyone that has gotten us to this point.”\n\nThe T-Mobile and Sprint combination remains subject to certain closing conditions. Additional information can be found at www.NewTMobile.com.\n\nPJT Partners and Goldman Sachs are acting as financial advisors to T-Mobile. Wachtell, Lipton, Rosen & Katz is providing legal counsel to T-Mobile and Deutsche Telekom. Evercore is acting as financial advisor to the committee of independent directors of T-Mobile and Latham & Watkins is providing legal counsel to the committee of independent directors. Morgan Stanley is serving as a financial advisor to Deutsche Telekom.\n\nThe Raine Group LLC is acting as lead financial advisor to Sprint. J.P. Morgan is also acting as a financial advisor to Sprint. Morrison & Foerster LLP is providing legal counsel to Sprint and SoftBank.\n\nAbout T-Mobile \n\nAs America’s Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 86.0 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout Sprint:\n\nSprint (NYSE: S) is a communications services company that creates more and better ways to connect its customers to the things they care about most. Sprint served 54.2 million connections as of December 31, 2019 and is widely recognized for developing, engineering and deploying innovative technologies, including the first wireless 4G service from a national carrier in the United States; leading no-contract brands including Virgin Mobile USA, Boost Mobile, and Assurance Wireless; instant national and international push-to-talk capabilities; and a global Tier 1 Internet backbone. Today, Sprint’s legacy of innovation and service continues with an increased investment to dramatically improve coverage, reliability, and speed across its nationwide network and commitment to launching a 5G mobile network in the U.S. You can learn more and visit Sprint at www.sprint.com or www.facebook.com/sprint and www.twitter.com/sprint.\n\nImportant Additional Information \n\nIn connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation \n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nCautionary Statement Regarding Forward-Looking Statements \n\nThis communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of thirteen states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com, and in Sprint’s Annual Report on Form 10-K for the fiscal year ended March 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “MD&A — Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.sprint.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile and Sprint assume no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005964/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nor\nInvestor Relations\n877-281-TMUS OR 212-358-3210\ninvestor.relations@t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "Pre-Order Starts Today with Serious Deals for EVERYONE on the Latest Samsung Galaxy S20 5G Smartphones at T-Mobile",
        "subtitle": "",
        "date": "Feb 20, 2020 9:04AM EST",
        "content": "\nThe Un-carrier doesn’t charge more for 5G access on the first and only nationwide 5G network. And, only the New T-Mobile can unlock the full power of this lineup, maxing their potential on all three 5G spectrum bands!\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nT-Mobile (NASDAQ: TMUS) today announced new deals for anyone looking to score the new Samsung Galaxy S20 5G, Galaxy S20+ 5G or Galaxy S20 Ultra 5G at the Un-carrier and jump aboard the first and only nationwide 5G network. And should the merger with Sprint close, only New T-Mobile can supercharge smartphones in this 5G lineup with mid-band spectrum. Get up to HALF OFF the latest Samsung Galaxy smartphones — the first smartphones in the U.S. that can tap into the full potential of 5G with low, mid and high-band — with an eligible trade-in OR snag a BOGO when adding a line. And both new and existing customers who want a sweet new 5G upgrade – from single line, to families, to businesses – can all score these deals. The Samsung Galaxy S20 5G lineup is available for pre-order online starting tonight at 9:01pm PT and will go on sale in T-Mobile stores on March 6.\n\nAnd the best part about these new 5G smartphones? Well, there are really two. ONE: devices in this lineup will be able to use all the Un-carrier’s 5G spectrum — low-band for breadth of coverage across the country, and high-band for blazing-fast, hotspot-like speeds — and is future-proofed to tap into mid-band spectrum with New T-Mobile if the merger with Sprint closes. And TWO, T-Mobile doesn’t charge extra for 5G access. Unlike the Carriers, T-Mobile’s plans include access to 5G — and not just the most expensive plans… at no extra cost. At the Un-carrier, anyone can get two lines starting at just $90/month plus tax for T-Mobile Essentials with 5G access included.\n\nOffer details:\n\nAnd, customers who put Magenta on their smartphone get all the great Un-carrier benefits on the industry’s best unlimited plan with taxes and fees included, Netflix on Us for families, the best customer care in wireless with a dedicated Team of Experts, and free scam protection options to fight robocalls. Customers also score weekly free stuff from T-Mobile Tuesdays along with industry-leading travel benefits.\n\nFor more information on all the Un-carrier’s offers, please visit https://www.t-mobile.com/offers/deals-hub. To see all the places you’ll get T-Mobile’s 5G down to a neighborhood level, check out the map here: www.t-mobile.com/coverage/5g-coverage-map. For more information on the latest Samsung Galaxy S20 5G devices at T-Mobile, visit t-mobile.com/GalaxyS20. For more information on the New T-Mobile, please visit www.NewTMobile.com.\n\nFollow T-Mobile’s Official Twitter Newsroom at @TMobileNews to stay up to date with the latest company news.\n\nDuring congestion, customers using>50GB/mo. may notice reduced speeds; Essentials customers may notice speeds lower than other customers. Tax on full device price due at sale. Limited time offers; subject to change. $10 SIM card, and, in stores & on customer service calls, $20 assisted or upgrade support charge may be required. Must be active & in good standing for promos, allow 6-8 weeks. May not be combined with some offers/discounts (e.g., Carrier Freedom). Max 6/account. $500 rebate: If you cancel service, remaining balance on required finance agreement becomes due. Up to $500 back, depending on trade-in device, via Virtual Express Prepaid Mastercard® Card, which you can use online or via accepted mobile payment apps; no cash access & expires in 6 months. Card is issued by Sunrise Banks N.A., Member FDIC. BOGO: If you cancel your line before receiving 24 bill credits, you may owe up to the full amount of all devices: ($999.99 – Galaxy S20 5G); if canceling your account, you can contact us first to instead make discounted monthly balance payments. If you have canceled voice lines in past 90 days, reactivate them first. T-Mobile Essentials General Terms: Monthly Regulatory Programs (RPF)& Telco Recovery Fee (TRF) totaling $3.18 per voice line ($0.60 for RPF & $2.58 for TRF) applies; taxes/fees approx. 4-38% of bill. Max 6 lines. 5G: Coverage not available in some areas. While 5G access won't require a certain plan or feature, some uses/services might. 5G uplink not yet available. See details at T-Mobile.com. Samsung $200: Terms and conditions apply. Visit: www.samsung.com/us/promotions to learn more.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 86 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005538/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\n\nInvestor Relations\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile and Sprint Win in Court; Companies Moving to Finalize Merger to Create New Supercharged Un-carrier",
        "subtitle": "",
        "date": "Feb 11, 2020 8:45AM EST",
        "content": "\nWith ruling from Federal District Court in New York, Companies Focused on Next, Final Steps in Merger to Become the New T-Mobile \n    BELLEVUE, Wash. & OVERLAND PARK, Kan.--(BUSINESS WIRE)--\nT-Mobile US, Inc. (NASDAQ: TMUS) and Sprint (NYSE: S) today announced that after receiving a favorable decision in Federal Court in New York the companies are now taking final steps to complete their merger to create the New T-Mobile. In a decision issued a short time ago, the Court stated that, “T-Mobile has redefined itself over the past decade as a maverick that has spurred the two largest players in its industry to make numerous pro-consumer changes. The proposed merger would allow the merged company to continue T-Mobile’s undeniably successful business strategy for the foreseeable future.”\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200211005611/en/\n“Today was a huge victory for this merger … and now we are FINALLY able to focus on the last steps to get this merger done! We want to thank the Court for its thorough review of the facts we presented in our case. We’ve said it all along: the New T-Mobile will be a supercharged Un-carrier that is great for consumers and great for competition. The broad and deep 5G network that only our combined companies will be able to bring to life is going to change wireless … and beyond. Look out Dumb and Dumber and Big Cable – we are coming for you … and you haven’t seen anything yet!” said John Legere, Chief Executive Officer of T-Mobile.\n\n“This is a BIG win and a BIG day for the New T-Mobile! Now we can get to work finishing what we set out to do – bringing a new standard for value, speed, coverage, quality and customer service to U.S. consumers everywhere and TRULY changing wireless for good. Now we’re laser-focused on finishing the few open items that remain but our eye is on the prize: finally bringing this long-awaited merger and all the goodness it will deliver to a close as early as April 1, 2020. We are SO ready to bring the New T-Mobile to life!” said Mike Sievert, COO and President of T-Mobile. Sievert has been appointed by the T-Mobile US Board of Directors to become CEO of the company starting on May 1, 2020.\n\n“Judge Marrero’s decision validates our view that this merger is in the best interests of the U.S. economy and American consumers,” said Sprint Executive Chairman Marcelo Claure. “Today brings us a big step closer to creating a combined company that will provide nationwide 5G, lower costs, and a high-performing network that will invigorate competition to the benefit of all mobile wireless and in-home broadband consumers. With the support of federal regulators and now this Court, we will focus on quickly completing the few remaining necessary steps to close this transaction. I am proud of my Sprint team’s dedication, passion and resilience throughout the merger review process, and we are ready to make the vision of a New T-Mobile a reality.”\n\nThe T-Mobile and Sprint combination remains subject to certain closing conditions, including possible additional court proceedings, and satisfactory resolution of outstanding business issues among the parties. Additional information can be found at www.NewTMobile.com.\n\nBenefits of the New T-Mobile include:\n\nAbout T-Mobile \n\nAs America’s Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 86.0 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout Sprint\n\nSprint (NYSE: S) is a communications services company that creates more and better ways to connect its customers to the things they care about most. Sprint served 54.2 million connections as of December 31, 2019 and is widely recognized for developing, engineering and deploying innovative technologies, including the first wireless 4G service from a national carrier in the United States; leading no-contract brands including Virgin Mobile USA, Boost Mobile, and Assurance Wireless; instant national and international push-to-talk capabilities; and a global Tier 1 Internet backbone. Today, Sprint’s legacy of innovation and service continues with an increased investment to dramatically improve coverage, reliability, and speed across its nationwide network and commitment to launching a 5G mobile network in the U.S. You can learn more and visit Sprint at www.sprint.com or www.facebook.com/sprint and www.twitter.com/sprint.\n\nImportant Additional Information \n\nIn connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation \n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nCautionary Statement Regarding Forward-Looking Statements \n\nThis communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com, and in Sprint’s Annual Report on Form 10-K for the fiscal year ended March 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “MD&A — Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.sprint.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile and Sprint assume no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005611/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nor\nInvestor Relations\n877-281-TMUS OR 212-358-3210\ninvestor.relations@t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile Reports Record Financials and Strong Customer Growth in FY 2019, Beating Increased Guidance while Balancing Growth and Profitability",
        "subtitle": "",
        "date": "Feb 6, 2020 4:01PM EST",
        "content": "\nIn Q4 2019 Total Net Additions of 1.9M, Branded Postpaid Phone Net Additions of 1.0M, Record Service Revenues of $8.7B, Strong Q4 Net Income of $751M and Record Q4 Adj. EBITDA of $3.2B\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nT-Mobile US, Inc. (NASDAQ: TMUS):\n\nRecord Financial Performance (all percentages year-over-year)\n\nStrong Customer Growth\n\nFirst Nationwide 5G Network\n\nStrong Standalone Outlook for 2020\n\n____________________________________________\n\nT-Mobile US, Inc. (NASDAQ: TMUS) once again delivered incredible results in the fourth quarter of 2019, reporting strong net customer additions including 1.9 million total net customer additions, the 27th quarter in a row with more than 1 million total net customer additions. Our 1.0 million branded postpaid phone net customer additions led the industry once again. For full-year 2019, T-Mobile had 7.0 million total net customer additions, including 4.5 million branded postpaid net customer additions - beating its increased customer guidance range of 4.1 to 4.3 million for the full-year 2019. In addition, we reported all-time record-high financial results, including service and total revenues, as well as record Q4 Adjusted EBITDA. These results concluded another record-breaking year for the Un-carrier, in which we delivered strong customer growth and record financial results for the full-year 2019 - once again beating our full-year guidance.\n\nIn December 2019, T-Mobile launched America’s first nationwide 5G network, including prepaid 5G with Metro by T-Mobile, covering more than 200 million people and more than 5,000 cities and towns across the United States with 5G. In addition, we introduced two new 600 MHz 5G capable superphones, the exclusive OnePlus 7T Pro 5G McLaren and the Samsung Galaxy Note 10+ 5G and anticipate offering an industry-leading smartphone portfolio built to work on nationwide 5G in 2020. This 5G network is the foundational layer of 5G coverage and it’s just the beginning! With the New T-Mobile, we will be able to combine this foundational layer of 5G with Sprint’s 2.5 GHz mid-band spectrum, resulting in a broad and deep nationwide 5G experience for everyone, everywhere. And, T-Mobile continues to invest in building its nationwide 4G LTE network, which now covers 327 million Americans, and continues to rapidly deploy its 600 MHz spectrum, which now covers 248 million people, and is live in nearly 8,900 cities and towns across 49 states and Puerto Rico.\n\n“T-Mobile continues to deliver incredible results quarter after quarter! In Q4 we set new financial records across the board and recorded our 27th consecutive quarter with over 1 million total net customer additions,” said John Legere, CEO of T-Mobile. “We achieved these spectacular results all while launching the first and only nationwide 5G network, announcing Un-carrier 1.0 for New T-Mobile, and delivering a compelling and fact-based argument in court to support our pending merger. Our results continue to show that the Un-carrier strategy works, and it delivers for both customers and shareholders. I couldn’t be more confident and excited about our future and We Won’t Stop!”\n\nStrong Customer Growth\n\nT-Mobile continues to deliver strong customer growth, and in Q4 2019 set a record of 27 consecutive quarters of more than 1 million total net customer additions. We once again led the industry in branded postpaid phone net customer additions.\n\nRecord Financial Performance\n\nT-Mobile’s strong financial performance in Q4 2019 and full-year 2019 proves that our strategy is not only good for customers, it’s also good for stockholders. We continue to successfully translate customer growth into industry-leading service revenue growth.\n\nThe following discussion is for the three months and year ended December 31, 2019, compared to the same periods in 2018 unless otherwise stated.\n\nFirst Nationwide 5G Network\n\nT-Mobile continues to expand the footprint and improve the quality of its network to better serve its customers. 327 million Americans are covered by our 4G LTE network, and our rapid deployment of 600 MHz spectrum provides customers with even better coverage and supports the launch of our nationwide 5G network. Highlights from Q4 2019 include:\n\nStrong Standalone Outlook for 2020\n\nThe following represents T-Mobile standalone guidance.\n\nWe expect postpaid net customer additions between 2.6 and 3.6 million in 2020.\n\nNet income is not available on a forward-looking basis.\n\nAdjusted EBITDA is expected to be in the range of $13.7 to $14.0 billion in 2020. Our Adjusted EBITDA target includes leasing revenues of $450 to $550 million and takes into account our network expansion, including the continued deployment of our 600 MHz spectrum and 5G network.\n\nCash purchases of property and equipment, including capitalized interest of approximately $400 million, are expected to be between $5.9 and $6.2 billion for full-year 2020. Cash purchases of property and equipment, excluding capitalized interest, are expected to be between $5.5 and $5.8 billion. We expect that cash purchases of property and equipment will be heavily weighted to early in the year, similar to 2019.\n\nIn Q1 2020, pre-close merger-related costs are expected to be $200 to $300 million before taxes.\n\nNet cash provided by operating activities, excluding payments for merger-related costs and any settlement of interest rate swaps, is expected to be in the range of $7.9 to $8.5 billion.\n\nFree Cash Flow, excluding payments for merger-related costs and any settlement of interest rate swaps, is expected to be in the range of $5.4 to $5.8 billion. We expect a similar seasonal development of Free Cash Flow in 2020 as in 2019 with a lower Free Cash Flow in the first quarter, ramping in later quarters, based on expected timing for cash purchases of property and equipment.\n\nFinancial Results\n\nFor more details on T-Mobile’s Q4 2019 financial results, including the Investor Factbook with detailed financial tables and reconciliations of certain historical non-GAAP measures disclosed in this release to the most comparable measures under GAAP, please visit T-Mobile US, Inc.’s Investor Relations website at http://investor.t-mobile.com.\n\nT-Mobile Social Media\n\nInvestors and others should note that we announce material financial and operational information to our investors using our investor relations website, press releases, SEC filings and public conference calls and webcasts. We intend to also use certain social media accounts as means of disclosing information about us and our services and for complying with our disclosure obligations under Regulation FD (the @TMobileIR Twitter account (https://twitter.com/TMobileIR) and through April 30, 2020, the @JohnLegere Twitter (https://twitter.com/JohnLegere), Facebook and Periscope accounts, which Mr. Legere also uses as means for personal communications and observations, and on and after May 1, 2020 the @SievertMike Twitter (https://twitter.com/SievertMike) account, which Mr. Sievert also uses as a means for personal communications and observations). The information we post through these social media channels may be deemed material. Accordingly, investors should monitor these social media channels in addition to following our press releases, SEC filings and public conference calls and webcasts. The social media channels that we intend to use as a means of disclosing the information described above may be updated from time to time as listed on our investor relations website.\n\nAbout T-Mobile US, Inc.\n\nAs America’s Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our nationwide 5G and advanced 4G LTE network delivers outstanding wireless experiences to 86.0 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com or join the conversation on Twitter using $TMUS.\n\nPlease plan on accessing the earnings call ten minutes prior to the scheduled start time.\n\nAccess via Social Media:\n\nThe @TMobileIR Twitter account will live-tweet the earnings call.\n\nSubmit Questions via Twitter:\n\nAccess via Webcast:\n\nThe earnings call will be broadcast live via our Investor Relations website at http://investor.t-mobile.com. A replay of the earnings call will be available for two weeks starting shortly after the call concludes and can be accessed by dialing 888-203-1112 (toll free) or +1 719-457-0820 (international). The passcode required to listen to the replay is 5259088.\n\nTo automatically receive T-Mobile financial news by e-mail, please visit the T-Mobile Investor Relations website, http://investor.t-mobile.com, and subscribe to E-mail Alerts.\n\nForward-Looking Statements\n\nThis communication includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including information concerning T-Mobile US, Inc.’s future results of operations, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate”, “believe”, “estimate”, “expect”, “intend”, “may”, “could” or similar expressions. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties and may cause actual results to differ materially from the forward-looking statements. Important factors that could affect future results and cause those results to differ materially from those expressed in the forward-looking statements include, among others, the following: the failure to obtain, or delays in obtaining, regulatory approval for the merger (the “Merger”) with Sprint Corporation (“Sprint”), pursuant to the Business Combination Agreement with Sprint and other parties therein (as amended, the “Business Combination Agreement”) and the other transactions contemplated by the Business Combination Agreement (collectively, the “Transactions”), risks associated with the actions and conditions we have agreed to in connection with regulatory approval for the Transactions, and the risk that such regulatory approval may result in the imposition of additional conditions that, if accepted by the parties, could adversely affect the combined company or the expected benefits of the Transactions, or the failure to satisfy any of the other conditions to the Transactions on a timely basis or at all; the risk that the antitrust litigation related to the Transactions brought by the attorneys general of certain states and the District of Columbia will result in an order preventing the completion of the Transactions and the risk of other litigation or regulatory or regulatory actions related to the Transactions; the exercise by one or both parties of a right to terminate the Business Combination Agreement; adverse effects on the market price of our common stock or on our operating results because of a failure to complete the Merger in the anticipated time frame, on the anticipated terms or at all; inability to obtain the financing contemplated to be obtained in connection with the Transactions on the expected terms or timing or at all; the ability of us, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of our or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the Transactions on the market price of our common stock and on our or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; the assumption of significant liabilities in connection with, and significant costs related to the Transactions, including financing costs and unknown liabilities of Sprint that may become liabilities of the combined company or that may otherwise arise and financing costs; failure to realize the expected benefits and synergies of the Transactions in the expected time frames, in part or at all; costs or difficulties related to the integration of Sprint’s network and operations into our network and operations, including intellectual property and communications systems, administrative and information technology infrastructure and accounting, financial reporting and internal control systems; differences with Sprint’s control environments, cultures, and auditor expectations may result in future material weaknesses, significant deficiencies, and/or control deficiencies while we work to integrate the companies and align guidelines and practices; costs or difficulties related to the completion of the divestiture of Sprint’s prepaid wireless businesses to DISH Network Corporation and the satisfaction of any related government commitments to such divestiture; the inability of us, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the Business Combination Agreement during the pendency of the Transactions could adversely affect our or Sprint’s ability to pursue business opportunities or strategic transactions; adverse economic, political or market conditions in the U.S. and international markets; competition, industry consolidation, and changes in the market for wireless services, which could negatively affect our ability to attract and retain customers; the effects of any future merger, investment, or acquisition involving us, as well as the effects of mergers, investments, or acquisitions in the technology, media and telecommunications industry; challenges in implementing our business strategies or funding our operations, including payment for additional spectrum or network upgrades; the possibility that we may be unable to renew our spectrum licenses on attractive terms or acquire new spectrum licenses at reasonable costs and terms; difficulties in managing growth in wireless data services, including network quality; material changes in available technology and the effects of such changes, including product substitutions and deployment costs and performance; the timing, scope and financial impact of our deployment of advanced network and business technologies; the impact on our networks and business from major technology equipment failures; inability to implement and maintain effective cyber security measures over critical business systems; breaches of our and/or our third-party vendors’ networks, information technology and data security, resulting in unauthorized access to customer confidential information; natural disasters, terrorist attacks or similar incidents; unfavorable outcomes of existing or future litigation; any changes in the regulatory environments in which we operate, including any increase in restrictions on the ability to operate our networks and changes in data privacy laws; any disruption or failure of our third parties’ or key suppliers’ provisioning of products or services; material adverse changes in labor matters, including labor campaigns, negotiations or additional organizing activity, and any resulting financial, operational and/or reputational impact; changes in accounting assumptions that regulatory agencies, including the Securities and Exchange Commission (“SEC”), may require, which could result in an impact on earnings; changes in tax laws, regulations and existing standards and the resolution of disputes with any taxing jurisdictions; the possibility that the reset process under our trademark license results in changes to the royalty rates for our trademarks; the possibility that we may be unable to adequately protect our intellectual property rights or be accused of infringing the intellectual property rights of others; our business, investor confidence in our financial results and stock price may be adversely affected if our internal controls are not effective; the occurrence of high fraud rates related to device financing, credit cards, dealers, or subscriptions; and interests of our majority stockholder may differ from the interests of other stockholders. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law.\n\nImportant Additional Information\n\nIn connection with the Transactions, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the Transactions with the SEC. The registration statement on Form S-4 was declared effective by the SEC on October 29, 2018, and T-Mobile and Sprint commenced mailing the joint consent solicitation statement/prospectus to their respective stockholders on October 29, 2018. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. Investors and security holders may obtain these documents free of charge from the SEC’s website or from T-Mobile or Sprint. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation\n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nT-Mobile US, Inc.\nReconciliation of Non-GAAP Financial Measures to GAAP Financial Measures\n(Unaudited)\n\nThis Press Release includes non-GAAP financial measures. The non-GAAP financial measures should be considered in addition to, but not as a substitute for, the information provided in accordance with GAAP. Reconciliations for the non-GAAP financial measures to the most directly comparable GAAP financial measures are provided below. T-Mobile is not able to forecast Net income on a forward-looking basis without unreasonable efforts due to the high variability and difficulty in predicting certain items that affect GAAP net income including, but not limited to, Income tax expense, stock-based compensation expense and Interest expense. Adjusted EBITDA should not be used to predict Net income as the difference between the two measures is variable.\n\nAdjusted EBITDA is reconciled to Net income as follows:\n\nAdjusted EBITDA - Earnings before Interest expense, net of Interest income, Income tax expense, Depreciation and amortization expense, non-cash Stock-based compensation and certain expenses not reflective of T-Mobile’s ongoing operating performance, such as merger-related costs. Adjusted EBITDA is a non-GAAP financial measure utilized by T-Mobile’s management to monitor the financial performance of our operations. T-Mobile uses Adjusted EBITDA internally as a measure to evaluate and compensate its personnel and management for their performance, and as a benchmark to evaluate T-Mobile’s operating performance in comparison to its competitors. Management believes analysts and investors use Adjusted EBITDA as a supplemental measure to evaluate overall operating performance and facilitate comparisons with other wireless communications companies because it is indicative of T-Mobile’s ongoing operating performance and trends by excluding the impact of Interest expense from financing, non-cash depreciation and amortization from capital investments, non-cash stock-based compensation, network decommissioning costs and costs related to the Transactions, as they are not indicative of T-Mobile’s ongoing operating performance, as well as certain other nonrecurring income and expenses. Adjusted EBITDA has limitations as an analytical tool and should not be considered in isolation or as a substitute for income from operations, Net income or any other measure of financial performance reported in accordance with U.S. Generally Accepted Accounting Principles (“GAAP”).\n\nNet debt (excluding tower obligations)(1) to last twelve months net income and Adjusted EBITDA ratios are calculated as follows:\n\nNet debt is defined as Short-term debt, Short-term debt to affiliates, Short-term financing lease liabilities, Long-term debt (excluding tower obligations), Long-term debt to affiliates, and Financing lease liabilities less Cash and cash equivalents.\n\nFree Cash Flow is calculated as follows:\n\nFree Cash Flow - Net cash provided by operating activities less Cash purchases of property and equipment, including Proceeds from sales of tower sites and Proceeds related to beneficial interests in securitization transactions and less Cash payments for debt prepayment of debt extinguishment costs. Free Cash Flow is utilized by T-Mobile’s management, investors, and analysts to evaluate cash available to pay debt and provide further investment in the business.\n\nOur guidance range for Free Cash Flow is calculated as follows:\n\nThe following table illustrates the calculation of our operating measure ARPU and reconciles this measure to the related service revenues:\n\nAverage Revenue Per User (ARPU) - Average monthly Service revenues earned from customers. Service revenues for the specified period divided by the average customers during the period, further divided by the number of months in the period.\n\nBranded postpaid phone ARPU excludes branded postpaid other customers and related revenues.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005925/en/\nPress Contact:\nMedia Relations\nT-Mobile US, Inc.\nmediarelations@t-mobile.com\nhttp://newsroom.t-mobile.com\n\nInvestor Relations Contact:\nNils Paellmann\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile & Metro by T-Mobile Nab J.D. Power’s Top Spots for Wireless Customer Care",
        "subtitle": "",
        "date": "Feb 6, 2020 9:20AM EST",
        "content": "\nT-Mobile earns a record-breaking highest score (again) from J.D. Power for Full-Service Wireless Customer Care, marking the 19th time the Un-carrier has snagged the top spot. And, Metro by T-Mobile grabs the top spot among Non-Contract Full-Service providers.\n\n \n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nNew decade, still crushing it. J.D. Power today announced that T-Mobile (NASDAQ: TMUS) has received a record-breaking highest score in the J.D. Power 2020 U.S. Wireless Customer Care Full-Service Performance Study—Volume 1, again. This marks the 19th time T-Mobile has ranked highest among full-service providers — more than anyone in the history of the study! And Metro by T-Mobile claimed the top spot, placing first in the J.D. Power 2020 U.S. Wireless Customer Care Non-Contract Performance Study — Volume 1 among Full-Service wireless providers.\n\n“We launched Team of Experts in August 2018, and we’ve taken the top J.D. Power Wireless Customer Care spot every single time since — that’s no coincidence, it’s just proof that our game-changing customer-first model WORKS,” said John Legere, CEO of T-Mobile. “Team of Experts completely revolutionized Care, giving customers access to real humans, 24/7 … no bots, no bouncing, no BS. We’re the only ones doing customer care this way — the right way — and it’s no surprise we continue to outscore the competition over and over again!”\n\nT-Mobile scored an 848 in the Study, that’s 43 points higher than the wireless industry average. And, the Un-carrier earned top scores in both Assisted Care and Unassisted Care, demonstrating T-Mobile customers are the most satisfied in wireless no matter how they prefer to reach their T-Mobile Care team… calling, texting, going online or heading to a store.\n\n“This incredible Care team has once again broken our own record! We’ve taken the top spot with J.D. Power EVERY TIME since launching Team of Experts. That’s not a coincidence … that’s a plan!” said Callie Field, EVP of Care at T-Mobile. “When you get the bots out of the way and connect customers to real customer-experience-obsessed people, like we did with Team of Experts, it’s an absolute game changer.”\n\nIn 2018, T-Mobile launched Team of Experts, a reinvigorated care experience for not just the wireless industry but for customer care organizations across the world. With a dedicated team of real people available to answer their call or message 24/7, Team of Experts promises no bots, no bouncing, and no BS. When a Magenta postpaid customer calls their T-Mobile Team of Experts, they know they will get a real person delivering real help, every time. It’s no surprise that T-Mobile delivers an unprecedented level of customer delight that’s unmatched among Full Service wireless providers. And the Un-carrier has the J.D. Power results to show it.\n\nThe J.D. Power results demonstrate a strong customer appreciation for the T-Mobile care experience, whether it be on the phone, in-store, via online chat, or easily navigating self-serve options. And while self-service options like the T-Mobile App and MyTMobile.com make life easier, T-Mobile Team of Experts got high marks for being well informed, clear communicators, courteous, prompt in responding and quick to resolve customer issues.\n\nFor more information about T-Mobile and the J.D. Power 2020 U.S. Wireless Customer Care Full-Service Study—Volume 1, please visit: https://www.jdpower.com/business/ratings/industry/telecom.\n\nFollow T-Mobile’s Official Twitter Newsroom at @TMobileNews to stay up-to-date with the latest company news.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005578/en/\nMedia Contacts:\nT-Mobile US, Inc.\nMedia Relations\nMediaRelations@t-mobile.com\n\nInvestor Relations Contact:\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile and Sprint Work Together to Protect Customers from Scam Calls",
        "subtitle": "",
        "date": "Feb 4, 2020 9:07AM EST",
        "content": "\nCross-network STIR/SHAKEN rollout helps stop number-spoofing, keeping consumers safer from scammers\n\n \n    BELLEVUE, Wash. & OVERLAND PARK, Kan.--(BUSINESS WIRE)--\nT-Mobile (NASDAQ: TMUS) and Sprint (NYSE: S) today announced they’re delivering STIR/SHAKEN number-verification across networks, an important step in the industry’s ongoing fight against unwanted scam and spam calls. The new anti-robocalling feature is currently rolling out to T-Mobile and Sprint customers and will give customers peace of mind that calls from the Sprint network to the T-Mobile network (and vice versa) are really coming from the number listed on their caller ID display and are not being spoofed.\n\n“We’re in an arms race with these scammers, and we’ve got to join forces as an industry to keep all wireless customers protected,” said John Legere, CEO of T-Mobile. “We were first to announce readiness for STIR/SHAKEN, first to implement Caller Verified, and today we lead the industry with the most cross-network STIR/SHAKEN partnerships to keep consumers better protected. T-Mobile will keep innovating and delivering on the frontlines in the battle against unwanted calls, and we won’t stop.”\n\n”While all carriers compete fiercely in the marketplace, we all agree that the industry-wide plague of robocalls and scammers must be tackled arm-in-arm with other carriers as we put the latest technology to work to help protect our customers,” said Sprint CEO Michel Combes. “STIR/SHAKEN is one tool among many that Sprint is utilizing in a multi-year anti-robocalling development program to improve our customers’ experience.”\n\nT-Mobile was first to announce readiness for the FCC-recommended STIR/SHAKEN standards in November 2018 and first in the wireless industry to implement STIR/SHAKEN when it launched Caller Verified on the Samsung Galaxy Note 9 in January 2019. T-Mobile leads the industry in STIR/SHAKEN implementation and now works across four networks: Comcast Xfinity Voice home phone service, AT&T Wireless, Inteliquent and Sprint. As more network providers across the industry implement the standards and more device providers participate, more calls will be verified over time, keeping consumers better protected.\n\nAs part of today’s news, T-Mobile also announced that Caller Verified is now operable across 23 smartphones, with more coming soon. Customers with these devices and the latest software update will automatically see “Caller Verified” on their screens for non-spoofed calls from the T-Mobile and Sprint networks.\n\nWith work already underway with additional providers, Sprint’s collaboration with T-Mobile is one of several roll outs of STIR/SHAKEN technology to improve protection from robocalls and scammers for Sprint customers. Sprint also offers customers Sprint Call Screener Basic, a free service that identifies unwanted malicious calls and permits users to block them, and the more feature-rich Sprint Call Screener Plus premium service. In addition to the services provided by the free service, Sprint Call Screen Plus also displays a texter’s name or a caller’s name, city and state, even those not listed in contacts; identifies, blocks, and reports calls that are lower-risk, but still a nuisance; categorizes incoming calls as spam, robocalls or fraud calls; reports an individual phone number as spam; and keeps history of blocked and risky numbers.\n\nThe FCC has recommended STIR/SHAKEN standards to digitally ensure that a call is in fact from the number displayed on Caller ID. The acronym stands for Secure Telephone Identity Revisited (STIR) and Signature-based Handling of Asserted Information Using toKENs (SHAKEN). STIR/SHAKEN, along with other tools such as the use of reasonable analytics, is key to the battle against unwanted robocalls and fraud.\n\nFor more information on all the ways T-Mobile is protecting customers, visit https://www.t-mobile.com/resources/call-protection.\n\nFor Metro by T-Mobile customers, more information is available at https://www.metropcs.com/shop/services/protection.\n\nFor more information on how Sprint is protecting customers, visit: https://www.sprint.com/en/shop/services/screener.html?INTNAV=Newsroom:CallScreener\n\n# # #\n\nQualifying service and capable device required.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout Sprint\n\nSprint (NYSE: S) is a communications services company that creates more and better ways to connect its customers to the things they care about most. Sprint served 54.2 million connections as of December 31, 2019 and is widely recognized for developing, engineering and deploying innovative technologies, including the first wireless 4G service from a national carrier in the United States; leading no-contract brands including Virgin Mobile USA, Boost Mobile, and Assurance Wireless; instant national and international push-to-talk capabilities; and a global Tier 1 Internet backbone. Today, Sprint’s legacy of innovation and service continues with an increased investment to dramatically improve coverage, reliability, and speed across its nationwide network and commitment to launching a 5G mobile network in the U.S. You can learn more and visit Sprint at www.sprint.com or www.facebook.com/sprint and www.twitter.com/sprint.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005640/en/\nT-Mobile Media Contacts\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\n\nSprint Media Relations\nMedia.relations@sprint.com\n\nT-Mobile Investor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "Tell Your Mama: T-Mobile’s Back in Super Bowl LIV",
        "subtitle": "",
        "date": "Jan 31, 2020 7:22PM EST",
        "content": "\nThe spot features the hilarious and talented duo, Anthony Anderson and his real-life mama Doris putting T-Mobile’s nationwide #5GThatWorks to the test.\n\nPlus, the Un-carrier is giving away five 5G smartphones, every five minutes throughout the game. \n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nMama knows best. T-Mobile (NASDAQ: TMUS) is back in the Super Bowl! Check out “Mama Tests 5G,” starring Golden Globe and six-time Emmy nominee Anthony Anderson, and his real-life mama, Doris Hancox, right now here. In the spot, Doris puts T-Mobile’s nationwide 5G network through its paces — from the beach, to her home, in an elevator and beyond. The 60-second spot will air during the fourth quarter on Sunday.\n\nPlus, the Un-carrier is giving fans the opportunity to put T-Mobile’s nationwide 5G to the test, just like Mama, with the first and only nationwide 5G phone giveaway ever. T-Mobile will give away five brand-new free Samsung Galaxy Note 10+ 5G smartphones every five minutes throughout the entire game from kickoff to final buzzer! Fans can enter every quarter by tweeting #5GThat Works and #Contest for a chance to win. And EVERYONE can play, not just T-Mobile customers. Follow T-Mobile on Twitter, Facebook and Instagram for more!\n\n“Everyone knows, mamas don’t mess around — and neither does T-Mobile. This year we came to play in the Super Bowl!” said John Legere, T-Mobile CEO. “And I can’t think of a better combo than this hilarious real-life mother/son duo to share the story of our 5G network. Only T-Mobile has nationwide 5G. Go tell your mama!”\n\nLast year, T-Mobile launched America’s first — and still only — nationwide 5G network. The Un-carrier’s 5G network covers more than 1 million square miles and reaches over 200 million people. Unlike Verizon 5G that can get blocked by walls, windows, people and even an umbrella and covers spotty patches of outdoor areas in just 34 cities, T-Mobile 5G provides far reaching coverage that can go through walls and works indoors and out in more than 5,000 cities and towns. And in parts of seven urban areas, T-Mobile has millimeter wave 5G for speedy, hotspot-like coverage outdoors.\n\nIf T-Mobile’s merger with Sprint closes, the New T-Mobile will have the ability to build on this foundation by adding critical mid-band spectrum for far-reaching coverage and performance as well as additional millimeter wave spectrum for blazing-fast speeds in dense urban areas. Only this combination will deliver a 5G network with both coverage breadth and depth of performance.\n\nFor more information on T-Mobile’s 5G, visit www.T-Mobile.com/coverage.\n\nCredits:\nCreative: Panay Films\nDirector: Steve Pink\n\n# # #\n\nNO PURCHASE NECESSARY. Sweepstakes open to all residents of the 50 U.S., P.R. & D.C. age 18+. Feb 2, 2020, kickoff until end of Q4 or all prizes awarded (whichever comes first). On how to enter and full rules, visit t-mo.co/SB2020. Void where prohibited by law. Sponsored by T-Mobile. 5G: Capable device required; coverage not available in some areas. While 5G access won't require a certain plan or feature, some uses/services might. 5G uplink not yet available. See Coverage details, Terms and Conditions, and Open Internet information for network management details (like video optimization) at T-Mobile.com.\n\nImportant Additional Information\n\nIn connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation\n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nCautionary Statement Regarding Forward-Looking Statements\n\nThis communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2018 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com, and in Sprint’s Annual Report on Form 10-K for the fiscal year ended March 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “MD&A — Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.sprint.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile and Sprint assume no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law. \n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200131005625/en/\nMedia Contacts\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com \n\nInvestor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile to Host Q4 and Full-Year Earnings Call on February 6, 2020",
        "subtitle": "",
        "date": "Jan 31, 2020 8:00AM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nT-Mobile US, Inc. (NASDAQ: TMUS) looks forward to discussing its fourth quarter and full-year 2019 financial and operational results on Thursday, February 6, 2020 at 4:30 p.m. Eastern Time (ET). The event will be live-streamed via the Company’s Investor Relations website at http://investor.t-mobile.com. T-Mobile US, Inc. will issue a press release and Investor Factbook reporting its results at approximately 4:05 p.m. ET on Thursday, February 6, 2020. The press release and Investor Factbook will be posted at the same time on the Company’s Investor Relations website at http://investor.t-mobile.com.\n\nA replay of the earnings call will be available for two weeks starting shortly after the call concludes and can be accessed by dialing 888-203-1112 (toll free) or +1-719-457-0820 (international). The passcode required to listen to the replay is 5259088. To automatically receive T-Mobile financial news by e-mail, please visit the T-Mobile Investor Relations website, http://investor.t-mobile.com, and subscribe to E-mail Alerts.\n\nSubmitting Questions\n\nThose interested in submitting questions during the earnings call can do so also by sending a tweet to @TMobileIR or @JohnLegere using $TMUS.\n\nT-Mobile Social Media\n\nInvestors and others should note that we announce material financial and operational information to our investors using our investor relations website, press releases, SEC filings and public conference calls and webcasts. We also intend to use certain social media accounts as means of disclosing information about us and our services and for complying with our disclosure obligations under Regulation FD (the @TMobileIR Twitter account (https://twitter.com/TMobileIR) and through April 30, 2020, the @JohnLegere Twitter (https://twitter.com/JohnLegere), Facebook and Periscope accounts, which Mr. Legere also uses as means for personal communications and observations, and on and after May 1, 2020 the @SievertMike Twitter (https://twitter.com/SievertMike) account, which Mr. Sievert also uses as a means for personal communications and observations). The information we post through these social media channels may be deemed material. Accordingly, investors should monitor these social media channels in addition to following our press releases, SEC filings and public conference calls and webcasts. The social media channels that we intend to use as a means of disclosing the information described above may be updated from time to time as listed on our investor relations website.\n\nAbout T-Mobile US, Inc.\n\nAs America’s Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our nationwide 5G and advanced 4G LTE network delivers outstanding wireless experiences to 86.0 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200131005008/en/\nInvestor Contact:\nNils Paellmann\ninvestor.relations@t-mobile.com\n\nMedia Contact:\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile Prepares Miami for Football’s Biggest Stage with More Network Capacity and 5G",
        "subtitle": "",
        "date": "Jan 24, 2020 9:07AM EST",
        "content": "\nWhat’s the news: Ahead of Super Bowl LIV, T-Mobile amped its 5G in Miami, adding millimeter wave to its low-band 5G, and rolled out permanent network improvements across the city to get ready for the big game.\n\nWhy it matters: Nearly 150,000 football fans will come to Miami ready to share and stream every special moment. Residents and visitors will benefit from the permanent enhancements long after the big game ends.\n\nWho it’s for: Everyone who lives in or visits Miami … for the Super Bowl and beyond.\n    MIAMI--(BUSINESS WIRE)--\nAs pro football gets set to crown its latest champion, T-Mobile (NASDAQ: TMUS) has put the final touches on its network in Miami to make sure customers have an incredible mobile experience. Over the last year, T-Mobile permanently boosted network capacity at venues throughout Miami so customers can share their game day moments in real time. T-Mobile and Metro by T-Mobile customers already have the biggest 5G network in Miami. And now, customers with capable 5G smartphones can get a speed boost from millimeter wave 5G in places like Hard Rock Stadium and Bayfront Park.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200124005268/en/(Photo: Business Wire)\n“All these network upgrades mean T-Mobile customers in and around the city can snap, share and stream from the big game with great coverage and serious speed,” said Neville Ray, President of Technology at T-Mobile. “And long after the Super Bowl has come and gone, T-Mobile customers will continue to have the biggest 5G footprint in Miami and across the rest of America with the ONLY nationwide 5G network. And we’re just getting started! If the merger with Sprint is approved, we’ll build on this 5G foundation to deliver transformational broad and deep 5G for all.”\n\nWith 150,000 people predicted to travel to Miami for Super Bowl LIV events, T-Mobile focused network enhancements where the biggest crowds will be, including Hard Rock Stadium, Miami Beach Convention Center, Bayfront Park, Miami Beach and Miami and Fort Lauderdale airports. And almost all the updates are permanent, so Miami residents and visitors can enjoy the improvements long after the Super Bowl is over.\n\nT-Mobile more than doubled LTE capacity at Hard Rock Stadium so customers can stream, tweet, post and chat about every big moment from the game. To enhance indoor capacity at key venues throughout Miami, T-Mobile built new distributed antenna systems (DAS) and deployed small cells throughout the city to provide additional performance boosts in places that can be difficult for towers to reach.\n\nAlmost all of Miami is covered with T-Mobile’s far reaching low-band 5G and fast LTE, so whether customers watch the game from the couch or the beach they’ll be ready to share the action. In addition to launching broad 5G coverage last month, T-Mobile has newly deployed millimeter wave 5G for customers with capable smartphones in parts of Miami, including nearly all of Bayfront Park and at Hard Rock Stadium in the lower bowl, parking lot and main entrances.\n\nTo ensure customers with compatible smartphones know where they can access 5G in Miami, T-Mobile has an interactive map of its nationwide low-band 5G to show where coverage is available down to the neighborhood level and created new millimeter wave maps for the city.\n\nOnly T-Mobile has a nationwide 5G network that works for more people in more places. The Un-carrier’s 5G network covers more than 1 million square miles, with much of that in rural America. This foundational layer of 5G provides far reaching coverage that can travel into buildings and work indoors and out. And now, the Un-carrier has millimeter wave 5G deployed in parts of seven cities for speedy, hotspot-like coverage outdoors in dense urban areas.\n\nIf T-Mobile’s merger with Sprint closes, the New T-Mobile will have the ability to build on this foundation by adding critical mid-band spectrum for far reaching coverage and performance as well as additional millimeter wave spectrum for blazing fast speeds in dense urban areas. Only this combination of low, mid and high spectrum will deliver a 5G network with both coverage breadth and depth of performance. T-Mobile expects devices capable of tapping into low, mid and high band spectrum to become available this year and expects to launch more than 15 new 5G smartphones in 2020 with a variety of price points and features.\n\nFor more information about T-Mobile's network, visit https://www.t-mobile.com/coverage.\n\n# # #\n\n5G: Capable device required; coverage not available in some areas. Not all devices & signals are compatible; check device specs. While 5G access won’t require a certain plan or feature, some uses/services might. 5G uplink not yet available. See coverage details, Terms & Conditions, and Open Internet information for network management details (like video optimization) at T-Mobile.com.\n\nImportant Additional Information\n\nIn connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation\n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nCautionary Statement Regarding Forward-Looking Statements\n\nThis communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2018 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com, and in Sprint’s Annual Report on Form 10-K for the fiscal year ended March 31, 2019 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “MD&A — Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.sprint.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile and Sprint assume no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200124005268/en/\nMedia Contacts\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com \n\nInvestor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "Dust Off Your Dancing Boots – T-Mobile Customers Score Early Access to Country Megaticket",
        "subtitle": "",
        "date": "Jan 17, 2020 7:10AM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nCountry fans, rejoice. Today, T-Mobile (NASDAQ: TMUS) announced that customers will get early access to Live Nation’s 2020 Country Megaticket through T-Mobile Tuesdays with a three-day presale starting Tuesday, January 21 for most venues and January 28 for others. The Country Megaticket gives customers a summer pass to the hottest country shows at their favorite amphitheater throughout the 2020 summer concert season — yep, with one pass, customers can see all the Country Megaticket acts that come through their chosen venue and in their chosen seats, all season long.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200117005198/en/Dust Off Your Dancing Boots – T-Mobile Customers Score Early Access to Country Megaticket (Photo: Business Wire)\nUn-carrier customers will get three days to snag their tickets and get their choice of seats before the general public to see some of the biggest names in country music, like Jason Aldean, Brooks & Dunn, Luke Bryan, Kenny Chesney, Lady Antebellum, Tim McGraw, Old Dominion, Brad Paisley, Rascal Flatts, Thomas Rhett, Sugarland, Chris Young and more!\n\nThe deets:\n\nThrough T-Mobile’s partnership with Live Nation, customers get early access to music passes, discount ticket offers to concerts and shows, exclusive access to last-minute concert tickets reserved for T-Mobile customers and more.\n\nAnd, with T-Mobile’s Magenta plan, customers get the industry’s best unlimited plan with taxes and fees included, Netflix on Us for families, the best customer care in wireless with a dedicated Team of Experts, and free scam protection options to fight robocalls. Customers also score weekly free stuff and discounts from T-Mobile Tuesdays along with industry-leading travel benefits.\n\nTo learn more about all the Live Nation benefits for T-Mobile customers, visit: www.T-Mobile.com/music.\n\nIf congested, customers using >50 GB/mo. may notice reduced speeds due to prioritization. Limited time offer; subject to change. Qualifying service required for T-Mobile Tuesdays. Live Nation & Ticketmaster terms apply. Tickets are first-come, first-serve, while supplies last & subject to venue, artist, and age restrictions. Codes cannot be sold, transferred, or combined with other discounts. Codes expire 58 hours after on-sale date at each venue (1/23/20 @10:00 PM OR 1/30/20 @ 10:00 PM). Max number of tickets vary by event. Shipping charges may apply based on delivery method. Magenta: Sales tax & regulatory fees included in monthly service price.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200117005198/en/\nMedia Contacts\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\n\nInvestor Relations\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile Adds 7.0 Million Customers in 2019 – the Sixth Year in a Row with more than 5 Million Net Customers Joining the Un-carrier Movement",
        "subtitle": "",
        "date": "Jan 7, 2020 9:05AM EST",
        "content": "\n      Q4 2019 Delivers 1.9 Million Total Net Additions, including 1.0\n      Million Postpaid Phone Net Additions with Postpaid Phone Churn\n      Continuing at Near Q4 Record Low Levels\n        BELLEVUE, Wash.--(BUSINESS WIRE)--\n      T-Mobile US, Inc. (NASDAQ: TMUS):\n    \n      Preliminary Fourth Quarter 2019 Customer Highlights:\n    \n      Preliminary Full-Year 2019 Customer Highlights:\n    \n      T-Mobile US, Inc. (NASDAQ: TMUS) provided a preliminary view of key\n      customer results for the fourth quarter and full-year 2019. In the\n      fourth quarter, T-Mobile had 1.9 million total net additions, the 27th\n      quarter in a row with more than 1 million total net additions. In\n      addition, the company delivered branded postpaid phone net additions of\n      1.0 million and branded postpaid phone churn of 1.01% in the fourth\n      quarter. For full-year 2019, T-Mobile had 7.0 million total net\n      additions, including 4.5 million branded postpaid net additions -\n      beating its increased customer guidance range of 4.1 to 4.3 million for\n      the full-year 2019. T-Mobile's total customer base was 86.0 million at\n      year-end 2019, an increase of approximately 53 million since T-Mobile\n      launched the Un-carrier in 2013.\n    \n      “T-Mobile delivered another incredible fourth quarter with strong\n      customer growth, despite a very competitive environment - and we did it\n      while lighting up the country's first nationwide 5G network and working\n      to close our merger with Sprint,” said John Legere, CEO of T-Mobile. “7\n      million net customers have chosen to join the Un-carrier movement in\n      2019, and they are choosing T-Mobile because we treat them right, we\n      eliminate their pain points, and we are changing the rules of this\n      industry for customers everywhere.\"\n    \n      Preliminary Fourth Quarter and Full-Year 2019 Customer Results\n    \n      T-Mobile continued to demonstrate the brand’s ongoing strength and\n      momentum in the fourth quarter of 2019, reflected once again by the\n      company’s strong net customer additions. T-Mobile’s unrivaled\n      customer-experience obsession provides customers with access to a host\n      of Un-carrier benefits solving everyday pain points and the best\n      customer service in the industry with T-Mobile’s Team of Experts.\n      T-Mobile added 1.9 million total net customers in the fourth quarter -\n      bringing its total customer base to 86.0 million at year-end 2019. This\n      marks the 27th consecutive quarter that T-Mobile has generated more than\n      1 million total net customer additions. Notably, the company lit up\n      America’s first nationwide 5G network in the fourth quarter of 2019\n      using 600 MHz spectrum – a foundational layer of its 5G network –\n      covering more than 200 million people and more than 1 million square\n      miles across the US.\n    \n      Branded postpaid phone net additions amounted to 1.0 million, flat\n      year-over-year and up 33% from 754,000 net additions in the third\n      quarter of 2019. This result reflects strong gross branded postpaid\n      phone customer additions, up 5% year-over-year, in a very competitive\n      environment.\n    \n      T-Mobile also saw continued strength in total branded postpaid net\n      additions, reporting net additions of 1.3 million in the fourth quarter\n      of 2019. For full-year 2019, the company added 4.5 million branded\n      postpaid net additions, which exceeded the top end of the increased\n      guidance range for branded postpaid net customer additions of 4.1 to 4.3\n      million.\n    \n      Branded prepaid net customer additions were 77,000 in the fourth quarter\n      of 2019 and 339,000 for full-year 2019. Migrations to branded postpaid\n      plans reduced branded prepaid net customer additions by approximately\n      160,000 in the fourth quarter of 2019 and 525,000 for full-year 2019.\n    \n      Wholesale net customer additions were 472,000 in the fourth quarter of\n      2019 and 2.2 million for full-year 2019.\n    \n      Postpaid phone churn amounted to 1.01% in the fourth quarter of 2019, up\n      2 basis points year-over-year, reflecting continued strong brand loyalty\n      in a heightened competitive environment.\n    \n      Branded prepaid churn was 3.97% in the fourth quarter of 2019, down 2\n      basis points year-over-year and down 1 basis point sequentially.\n    \n      Preliminary Customer Results\n    \n      Our customer results for the fourth quarter and full-year 2019 are\n      preliminary and subject to change pending completion of our year-end\n      closing review procedures. America’s Un-carrier plans to share more\n      details and its full financial results for the fourth quarter and\n      full-year 2019 in February.\n    \n      T-Mobile Social Media\n    \n      Investors and others should note that we announce material financial and\n      operational information to our investors using our investor relations\n      website, press releases, SEC filings and public conference calls and\n      webcasts. We also intend to use certain social media accounts as means\n      of disclosing information about us and our services and for complying\n      with our disclosure obligations under Regulation FD (the @TMobileIR\n      Twitter account (https://twitter.com/TMobileIR)\n      and through April 30, 2020, the @JohnLegere Twitter (https://twitter.com/JohnLegere),\n      Facebook and Periscope accounts, which Mr. Legere also uses as means for\n      personal communications and observations, and on and after May 1, 2020\n      the @SievertMike Twitter (https://twitter.com/SievertMike)\n      account, which Mr. Sievert also uses as a means for personal\n      communications and observations). The information we post through these\n      social media channels may be deemed material. Accordingly, investors\n      should monitor these social media channels in addition to following our\n      press releases, SEC filings and public conference calls and webcasts.\n      The social media channels that we intend to use as a means of disclosing\n      the information described above may be updated from time to time as\n      listed on our investor relations website.\n    \n      About T-Mobile US, Inc.:\n    \n      As America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining\n      the way consumers and businesses buy wireless services through leading\n      product and service innovation. Our nationwide 5G and advanced 4G LTE\n      network delivers outstanding wireless experiences to 86.0 million\n      customers who are unwilling to compromise on quality and value. Based in\n      Bellevue, Washington, T-Mobile US provides services through its\n      subsidiaries and operates its flagship brands, T-Mobile and Metro by\n      T-Mobile. For more information, please visit http://www.t-mobile.com\n      or join the conversation on Twitter using $TMUS.\n    \n      Important Additional Information\n    \n      In connection with the Transactions, T-Mobile US, Inc. (“T-Mobile”) has\n      filed a registration statement on Form S-4 (File No. 333-226435), which\n      contains a joint consent solicitation statement of T-Mobile and Sprint\n      Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile\n      (the “joint consent solicitation statement/prospectus”), and each party\n      will file other documents regarding the Transactions with the SEC. The\n      registration statement on Form S-4 was declared effective by the SEC on\n      October 29, 2018, and T-Mobile and Sprint commenced mailing the joint\n      consent solicitation statement/prospectus to their respective\n      stockholders on October 29, 2018. INVESTORS AND SECURITY HOLDERS ARE\n      URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND\n      OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE\n      BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. Investors and security\n      holders may obtain these documents free of charge from the SEC’s website\n      or from T-Mobile or Sprint. The documents filed by T-Mobile may be\n      obtained free of charge at T-Mobile’s website, at www.t-mobile.com,\n      or at the SEC’s website, at www.sec.gov,\n      or from T-Mobile by requesting them by mail at T-Mobile US, Inc.,\n      Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by\n      telephone at 212-358-3210. The documents filed by Sprint may be obtained\n      free of charge at Sprint’s website, at www.sprint.com,\n      or at the SEC’s website, at www.sec.gov,\n      or from Sprint by requesting them by mail at Sprint Corporation,\n      Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679,\n      Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n    \n      No Offer or Solicitation\n    \n      This communication shall not constitute an offer to sell or the\n      solicitation of an offer to buy any securities, nor shall there be any\n      sale of securities in any jurisdiction in which such offer, solicitation\n      or sale would be unlawful prior to registration or qualification under\n      the securities laws of any such jurisdiction. No offering of securities\n      shall be made except by means of a prospectus meeting the requirements\n      of Section 10 of the U.S. Securities Act of 1933, as amended.\n    \n      Cautionary Statement Regarding Forward-Looking Statements\n    \n      This communication includes forward-looking statements within the\n      meaning of the Private Securities Litigation Reform Act of 1995. All\n      statements other than statements of historical fact, including\n      information concerning T-Mobile US, Inc.’s future results of operations,\n      are forward-looking statements. These forward-looking statements are\n      generally identified by the words “anticipate,” “believe,” “estimate,”\n      “expect,” “intend,” “may,” “could,” or similar expressions.\n      Forward-looking statements are based on current expectations and\n      assumptions, which are subject to risks and uncertainties and may cause\n      actual results to differ materially from the forward-looking statements.\n      Important factors that could affect future results and cause those\n      results to differ materially from those expressed in the forward-looking\n      statements include, among others, the following: the failure to obtain,\n      or delays in obtaining, required regulatory approvals for the merger\n      (the “Merger”) with Sprint Corporation (“Sprint”), pursuant to the\n      Business Combination Agreement with Sprint and other parties therein (as\n      amended, the “Business Combination Agreement”) and the other\n      transactions contemplated by the Business Combination Agreement\n      (collectively, the “Transactions”), risks associated with the actions\n      and conditions we have agreed to in connection with such approvals, and\n      the risk that such approvals may result in the imposition of additional\n      conditions that, if accepted by the parties, could adversely affect the\n      combined company or the expected benefits of the Transactions, or the\n      failure to satisfy any of the other conditions to the Transactions on a\n      timely basis or at all; the occurrence of events that may give rise to a\n      right of one or both of the parties to terminate the Business\n      Combination Agreement; adverse effects on the market price of our common\n      stock or on our operating results because of a failure to complete the\n      Merger in the anticipated timeframe, on the anticipated terms or at all;\n      inability to obtain the financing contemplated to be obtained in\n      connection with the Transactions on the expected terms or timing or at\n      all; the ability of us, Sprint and the combined company to make payments\n      on debt or to repay existing or future indebtedness when due or to\n      comply with the covenants contained therein; adverse changes in the\n      ratings of our or Sprint’s debt securities or adverse conditions in the\n      credit markets; negative effects of the announcement, pendency or\n      consummation of the Transactions on the market price of our common stock\n      and on our or Sprint’s operating results, including as a result of\n      changes in key customer, supplier, employee or other business\n      relationships; significant costs related to the Transactions, including\n      financing costs, and unknown liabilities of Sprint or that may arise;\n      failure to realize the expected benefits and synergies of the\n      Transactions in the expected timeframes, in part or at all; costs or\n      difficulties related to the integration of Sprint’s network and\n      operations into our network and operations, including intellectual\n      property and communications systems, administrative and information\n      technology infrastructure and accounting, financial reporting and\n      internal control systems, and the alignment of the two companies’\n      guidelines and practices; costs or difficulties related to the\n      completion of the divestiture of Sprint’s prepaid wireless businesses to\n      DISH Network Corporation and the satisfaction of any related government\n      commitments to such divestiture; the risk of litigation or regulatory\n      actions related to the Transactions, including the antitrust litigation\n      related to the Transactions brought by the attorneys general of certain\n      states and the District of Columbia; the inability of us, Sprint or the\n      combined company to retain and hire key personnel; the risk that certain\n      contractual restrictions contained in the Business Combination Agreement\n      during the pendency of the Transactions could adversely affect our or\n      Sprint’s ability to pursue business opportunities or strategic\n      transactions; adverse economic, political or market conditions in the\n      U.S. and international markets; competition, industry consolidation, and\n      changes in the market for wireless services, which could negatively\n      affect our ability to attract and retain customers; the effects of any\n      future merger, investment, or acquisition involving us, as well as the\n      effects of mergers, investments, or acquisitions in the technology,\n      media and telecommunications industry; challenges in implementing our\n      business strategies or funding our operations, including payment for\n      additional spectrum or network upgrades; the possibility that we may be\n      unable to renew our spectrum licenses on attractive terms or acquire new\n      spectrum licenses at reasonable costs and terms; difficulties in\n      managing growth in wireless data services, including network quality;\n      material changes in available technology and the effects of such\n      changes, including product substitutions and deployment costs and\n      performance; the timing, scope and financial impact of our deployment of\n      advanced network and business technologies; the impact on our networks\n      and business from major technology equipment failures; inability to\n      implement and maintain effective cyber security measures over critical\n      business systems; breaches of our and/or our third-party vendors’\n      networks, information technology and data security, resulting in\n      unauthorized access to customer confidential information; natural\n      disasters, terrorist attacks or similar incidents; unfavorable outcomes\n      of existing or future litigation; any changes in the regulatory\n      environments in which we operate, including any increase in restrictions\n      on the ability to operate our networks and changes in data privacy laws;\n      any disruption or failure of our third parties’ or key suppliers’\n      provisioning of products or services; material adverse changes in labor\n      matters, including labor campaigns, negotiations or additional\n      organizing activity, and any resulting financial, operational and/or\n      reputational impact; changes in accounting assumptions that regulatory\n      agencies, including the Securities and Exchange Commission (“SEC”), may\n      require, which could result in an impact on earnings; changes in tax\n      laws, regulations and existing standards and the resolution of disputes\n      with any taxing jurisdictions; the possibility that the reset process\n      under our trademark license results in changes to the royalty rates for\n      our trademarks; the possibility that we may be unable to adequately\n      protect our intellectual property rights or be accused of infringing the\n      intellectual property rights of others; our business, investor\n      confidence in our financial results and stock price may be adversely\n      affected if our internal controls are not effective; the occurrence of\n      high fraud rates related to device financing, credit card, dealers, or\n      subscriptions; and interests of a majority stockholder may differ from\n      the interests of other stockholders. Given these risks and\n      uncertainties, readers are cautioned not to place undue reliance on such\n      forward-looking statements. We undertake no obligation to revise or\n      publicly release the results of any revision to these forward-looking\n      statements, except as required by law.\n    View source version on businesswire.com: https://www.businesswire.com/news/home/20200107005400/en/\n      Press Contact:Media RelationsT-Mobile US, Inc.mediarelations@t-mobile.comhttp://newsroom.t-mobile.comInvestor\n      Relations Contact:Nils PaellmannT-Mobile US, Inc.investor.relations@t-mobile.comhttp://investor.t-mobile.com\n    Source: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile US, Inc. to Present Keynote at the Citi 2020 Global TMT West Conference in Las Vegas, NV",
        "subtitle": "",
        "date": "Jan 3, 2020 6:00AM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nMike Sievert, President & Chief Operating Officer of T-Mobile US, Inc., Braxton Carter, Executive Vice President & Chief Financial Officer, and Neville Ray, President, Technology of T-Mobile US, Inc. (NASDAQ: TMUS) will present a keynote and provide a business update on Tuesday, January 7, 2020 at 2:45 p.m. Eastern Time (11:45 a.m. Pacific Time) at the Citi 2020 Global TMT West Conference in Las Vegas, NV.\n\nA live webcast of the event will be available on the Company’s Investor Relations website, http://investor.t-mobile.com, on Tuesday, January 7, 2020 at 2:45 p.m. Eastern Time (11:45 a.m. Pacific Time). An on-demand replay will be available shortly after the conclusion of the presentation.\n\nTo automatically receive T-Mobile financial news by e-mail, please visit the T-Mobile Investor Relations website, http://investor.t-mobile.com, and subscribe to E-mail Alerts.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200103005013/en/\nInvestor Contact:\nNils Paellmann\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "Meet the Kotzatoskis, America’s First Family of 5G",
        "subtitle": "",
        "date": "Dec 6, 2019 9:04AM EST",
        "content": "\nNationwide 5G is here, America. \n\nThe Kotzatoskis picked up the very first smartphones available on America’s only nationwide 5G network at a T-Mobile store in Lititz, PA \n\nOther pioneering 5G customers can “flex” on social media for a chance to win a FREE OnePlus 5G smartphone with #5GFlexContest \n    LANCASTER, Pa.--(BUSINESS WIRE)--\nHistory was made at the T-Mobile (NASDAQ: TMUS) store in Lititz, PA, where the Kotzatoski family picked up the first 5G smartphones that work nationwide. With the launch of these 5G-capable superphones, the transformative wireless technology becomes a reality today for the 200 million people in 5,000+ cities and towns from Maine to Florida to California to Hawaii, more than 1 million square miles in total.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191206005261/en/The Kotzatoskis, America's first family to get nationwide 5G, snag a selfie with the new OnePlus 7T Pro 5G McLaren in the T-Mobile store in Lititz, PA. (Photo: Business Wire)\nThat the nation’s first family of 5G hails from the Lancaster area — the heart of Pennsylvania Dutch Country and home to one of America’s oldest Amish settlements — is indicative of T-Mobile’s 5G network strategy. Together with Sprint, the New T-Mobile plans to bring 5G to All wireless customers, not just those in high-density urban areas. If the merger with Sprint moves forward, the New T-Mobile will be able to build on T-Mobile’s broad 5G foundation, adding critical depth. Only this combination will deliver a 5G network with both breadth and depth, something the other guys simply cannot do as quickly.\n\n“To be a part of history is really exciting. Nationwide 5G only launches once, and we’re the very first! That’s so cool!” said Chandra Kotzatoski. Added Eric Kotzatoski, “Both my son and I are huge gamers, and our family loves technology. We want the latest and greatest. Always. That’s why it’s exciting T-Mobile is bringing 5G to places like Central PA and not just the big cities. We can’t wait for what’s next!”\n\n#5GFlexContest\n\nAmerica only gets its first nationwide 5G network once, so to say this is a *moment* for early adopters is an understatement. Customers who buy a 5G superphone between now and December 22nd will have the opportunity to “flex” their 5G status on social media with #5GFlexContest, and when they tag a friend, they’ll enter to win a FREE OnePlus 7T Pro 5G McLaren smartphone. Even more extra, all those 5G OGs out there can use photo backgrounds and props to level-up their 5G flexing in select T-Mobile stores.\n\n5G for All\n\nThe very heart of wireless service is based on spectrum, invisible highways in the atmosphere that transport voice and data from a phone to a cell tower. This first nationwide 5G rollout from T-Mobile is based on a spectrum band called 600 MHz, also referred to as low-band spectrum. It provides the foundational layer for T-Mobile’s 5G network.\n\nIn the coming months and years, T-Mobile will build upon this foundational 5G layer to add capacity, or more “lanes” using the invisible highway analogy, for greater speeds and better coverage. T-Mobile’s proposed merger with Sprint, if approved, will provide the combined company with critical mid-band spectrum it needs to increase capacity and performance even more. Only a combination of low, mid and high-band spectrum will deliver a 5G network with both breadth and depth covering all of America, something that T-Mobile and Sprint simply cannot do alone. The stakes are high for the U.S., as billions in economic growth and jobs are expected to come from 5G and the innovations it will unleash.\n\nT-Mobile’s 5G network is not just bigger, it’s better. Here’s how: \n\nTo celebrate the launch of nationwide 5G, customers who switch to T-Mobile can get the OnePlus 7T Pro 5G McLaren for FREE with 24 monthly bill credits when they trade in an eligible phone. Existing customers can get up to $300 off the OnePlus 7T Pro 5G McLaren or up to HALF off the Galaxy Note10+ 5G via trade-in credit and rebate when they trade in their eligible phone. Plus, customers with good credit can get a free Note10+ 5G with 36 monthly bill credits when they buy one and add a line (two for new customers).\n\nFor more information on the latest 5G devices at T-Mobile, visit www.t-mobile.com/devices/5g-phones. For more information and offer details for the Samsung Galaxy Note10+ 5G at Metro by T-Mobile, visit www.metrobyt-mobile.com/network#5G. For more information on T-Mobile 5G, visit www.t-mobile.com/coverage. And for more information on the New T-Mobile, please visit www.NewTMobile.com.\n\nOnly customers with a 600 MHz 5G capable device will be able to access T-Mobile’s nationwide 5G network. 5G is still developing, not all devices & signals are compatible. Coverage in growing number of areas. While 5G access won’t require a certain plan or feature, some uses/services might. See Coverage details, Terms & Conditions, and Open Internet information for network management details (like video optimization) at T-Mobile.com.\n\nFree device offers via bill credits with finance agreement(s): if you cancel your line before receiving all credits, your remaining balance will become due (e.g., up to $1299.99 for Note 10+ 5G), if cancelling your account, you can contact us first to instead make discounted monthly payments. Tax on pre-credit price due at sale. For well-qualified customers. If you have canceled lines in past 90 days, reactivate them first. $10 SIM card, and, in stores & on customer service calls, $20 assisted or upgrade support charge may be required. Must be active and in good standing to receive credits; allow 2 bill cycles from trade-in. May not be combined with some offers or discounts (Carrier Freedom). Free 7T Pro 5G McLaren: Limit 1/account. Note 10+ 5G: Max 6 offers/account. #5GFlexContest Sweepstakes: NO PURCHASE NECESSARY. Open to US, PR, DC residents 18+, 12/6/19-12/22/19. For how to enter & full rules click here.\n\nImportant Additional Information\n\nIn connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435), which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation\n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nCautionary Statement Regarding Forward-Looking Statements\n\nThis communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2018 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile assumes no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191206005261/en/\nMedia Contacts\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\n\nInvestor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile US, Inc. to Present Keynote at the UBS Global TMT Conference in New York, NY",
        "subtitle": "",
        "date": "Dec 6, 2019 9:00AM EST",
        "content": "    BELLEVUE, Wash.--(BUSINESS WIRE)--\nMike Sievert, President & Chief Operating Officer of T-Mobile US, Inc., Braxton Carter, Executive Vice President & Chief Financial Officer, and Neville Ray, President, Technology of T-Mobile US, Inc. (NASDAQ: TMUS) will present a keynote and provide a business update on Tuesday, December 10, 2019 at 9:15 a.m. Eastern Time at the UBS Global Technology, Media & Telecom Conference in New York, NY.\n\nA live webcast of the event will be available on the Company’s Investor Relations website, http://investor.t-mobile.com, on Tuesday, December 10, 2019 at 9:15 a.m. Eastern Time. An on-demand replay will be available shortly after the conclusion of the presentation.\n\nTo automatically receive T-Mobile financial news by e-mail, please visit the T-Mobile Investor Relations website, http://investor.t-mobile.com, and subscribe to E-mail Alerts.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191206005014/en/\nInvestor Contact:\nNils Paellmann\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile Selects 30 Teams of Visionary Youth from Across the Country as 2019 Changemaker Challenge Winners",
        "subtitle": "",
        "date": "Dec 5, 2019 1:53PM EST",
        "content": "\nTop 30 winners — selected from hundreds of entries — receive seed-funding and a visit to T-Mobile HQ to bring their big ideas to life, and three best-of-best Category Winners will pitch T-Mobile leaders for a chance to earn up to $10,000\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nT-Mobile and the T-Mobile Foundation today announced the winners of the 2019 T-Mobile Changemaker Challenge, the Un-carrier’s nationwide contest that is mobilizing the next generation of young visionaries. For the second consecutive year, T-Mobile, the T-Mobile Foundation, and Ashoka, the world’s largest network of social entrepreneurs, put out a call to youth aged 13 to 23 from the U.S., asking them to submit BIG ideas aimed at changing their communities for good. They received an amazing 428 entries — a 32% increase over last year’s total submissions — which were then narrowed down to the 30 winning teams in three categories, Technology, the Environment and Education. From each category, one team was selected as the category winner.\n\n“T-Mobile is all about finding BOLD solutions and driving CHANGE -- and that is EXACTLY what our Changemaker Challenge is all about! This year we received hundreds of amazing entries from inspiring future leaders who have big ideas about how to create a better world and we were totally blown away by what we saw! These youth are going to ensure a brighter future for us all and we can’t wait to help them make their ideas a reality!” said John Legere, CEO of T-Mobile and president of the T-Mobile Foundation.\n\nWinners receive seed money from the T-Mobile Foundation and a trip to T-Mobile’s headquarters. Here’s how it works:\n\nJudges from T-Mobile and Ashoka reviewed submissions based on the following criteria:\n\nProjects ranging from apps to robots to political advocacy groups offered solutions around topics ranging from mental health to bee colony collapse to flood warning systems to gun violence prevention. Several proposals aimed at better integrating science, technology, engineering and math instruction (STEM) into U.S. classrooms and prioritizing greater diversity and equity within the tech industry. Notably, most of the top-rated Technology entries were submitted by young women!\n\nWinners of the 2019 Changemaker Challenge\nFor more details about each Top 30 winning team, check out the Changemaker 2019 Lookbook.\nWatch as the category winners are surprised in this video!\n\nTechnology\nTop Category Winner\nAva: A Video Game About Space Pirates and Social Situations (Pomona, CA)\nA role-playing video game that gives autistic players a safe space to try out social situations and emotional responses\n\nCategory Winners\nA1Centive (Washington, D.C.)\nAn incentive program that encourages teens with type 1 diabetes to better manage their blood sugar by rewarding them for staying in range\n\nAmityConnections (Aldie, VA)\nAn app that connects family members to the health of their elders by aggregating real-time data from smart medical devices\n\nBringing the Love of Volunteering to Underserved Communities (Houston, TX)\nA technology platform to help disadvantaged students find ways to volunteer and make a change in their communities\n\nConverge (Palos Heights, IL)\nA global interfaith community platform aimed at fostering discussion, awareness and action\n\nGirl Innovation (Gurabo, PR)\nClosing the gender gap in tech through workshops, summer camps and mentoring programs to introduce middle school girls to programming and robotics\n\nnotOK App (Atlanta, GA)\nA mental health app that takes the guesswork out of asking for help \n\nPositive Impact for Kids (Greenville, SC)\nLeveraging technology such as iPads and video games to improve the hospitalization experience for pediatric patients in the U.S.\n\nShe Can Tech (Portage, IN)\nA near-peer technology program for middle school girls made to increase the meaningful participation of women in STEM\n\nWe the Immigrants (Henderson, NV)\nA platform that shares immigrant youth stories around their immigration experiences\n\nThe Environment\nTop Category Winner\nYouth Climate Action Coalition (Granite Bay, CA)\nA youth-led environmental organization mitigating the effects of climate change by reducing the carbon footprint of schools and communities\n\nCategory Winners\nBEEducated (Sammamish, WA)\nA youth-driven organization combating the harmful environmental and economic effects of Colony Collapse Disorder on bees\n\nHomes4Monarchs (Palos Park, IL)\nCreating free seed packets, events and gardens across Chicagoland to restore native ecosystems and save species like the monarch butterfly\n\nHydroAlert (Austin, TX)\nA low-cost flood warning system that measures real-time water levels at high-risk locations and alerts the affected population and emergency personnel\n\nIan's Giving Garden & Frutas Frescas Orchard (Austin, TX)\nA gardening program that encourages youth to volunteer in the construction and maintenance of edible gardens, a food source for families struggling with food insecurity\n\nJee Foods (Hamilton, OH)\nStudent-powered food rescue and hunger relief, rescuing food that would otherwise be wasted and donating it back into the community\n\n1 Week to Save the Earth Challenge (Portland, OR)\nReducing emissions in the fight against climate change by shifting the way we eat\n\nPlantumAI: AI-Automated Crop Analytics for Less-Fortunate Areas (Macungie, PA)\nAn app to help farmers identify crop diseases, receive pesticide advice and optimize yields with understandable analytics\n\nRemora (Corozal, PR)\nFocused on environmental sustainability, water conservation and educational training to provide clean water to communities in need\n\nThe Green Sleep Project (Danbury, CT)\nGiving plastic bags a new life by turning them into sleeping mats for the homeless and educating youth on pollution and climate change\n\nEducation\nTop Category Winner\nStories Untold U.S. (Parkland, FL)\nA platform to give voice to everyone in the U.S. who has been affected by gun violence\n\nCategory Winners\nA Voice for Kids (Muncie, IN)\nRaising awareness and educating schools and other organizations about signs of abuse to provide a voice for kids in foster care or child welfare\n\nBe the Change (Cleveland, OH & Lincoln, NE)\nChanging the way young people are educated and prepared to succeed in undervalued areas of the U.S.\n\nEmpowering Today's Girls to be Tomorrow's Scientists (Wilmington, DE)\nInspiring young inner-city girls to embrace STEM (science, technology, engineering and math) by inviting them to hands-on STEM workshops\n\nFuture Kings Mentoring (Pittsburgh, PA)\nDeveloping male-identifying black youth into Future Kings\n\nHey Schools! Let Teens Take the Wheel (Jacksonville, FL)\nEmpowering teens impacted by crime and violence to talk to and teach school leaders about the problems they face in order to improve policy\n\nHomegirl Project (Oviedo, FL)\nTraining girls of color to become political changemakers through mentorship, digital resources and community-building\n\nObject: Now Girly Means Confident (Menlo Park, CA)\nPromoting confidence in young girls by connecting them with women role models through storytelling and experiential activities \n\n3C Social Youth Entrepreneurship Digital Academy (Sammamish, WA)\nInspiring youth to become social entrepreneurs to advance UN sustainable development goals \n\nYouth Educating Police Training & Workshop (Portland, OR)\nA youth-specific training curriculum educating officers on the teen brain and key youth tendencies\n\nThe T-Mobile Changemaker Challenge was inspired by America’s youth activists and developed in partnership with and sponsored by Ashoka, the world’s leading network of systems-changing social entrepreneurs. The T-Mobile Foundation is partnering with Ashoka for the Changemaker Challenge because for the last 40 years, Ashoka has supported social entrepreneurs as they bring new ideas to systemically address the world’s biggest challenges. Ashoka works around the globe with partners like the T-Mobile Foundation to support youth with developing core competencies of empathy, teamwork, collaborative leadership and changemaking skills.\n\nFor more information about the second annual T-Mobile Changemaker Challenge and to see the full list of entrants, visit t-mobile.com/changemaker, and join the conversation on social with #TMoChangemaker.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout T-Mobile Foundation \n\nThe T-Mobile Foundation is committed to changing the world for good. The Foundation advances positive change in our communities by supporting causes that focus on youth development and by providing opportunities for T-Mobile employees to engage in causes that benefit the communities where they live and work. The T-Mobile Foundation, created and funded by T-Mobile US, Inc., is recognized by the IRS as a Section 501(c)(3) private foundation.\n\nAbout Ashoka \n\nAshoka is the largest global network of leading social entrepreneurs—individuals with new ideas to systemically address the world’s biggest challenges and the entrepreneurial skill to transform those ideas into national, regional and global social impact. Over 35 years, Ashoka has supported more than 3,500 social entrepreneurs in 90 countries with solutions addressing society’s most pressing issues. Ashoka’s vision is a world in which Everyone is a Changemaker—a society that responds quickly and effectively to challenges, and where each individual has the freedom, confidence and societal support to address any social problem. For more information, visit ashoka.org.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005781/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nor\nInvestor Relations\n877-281-TMUS OR 212-358-3210\ninvestor.relations@t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile 5G: It’s On!",
        "subtitle": "",
        "date": "Dec 2, 2019 9:06AM EST",
        "content": "\nAmerica’s First Nationwide 5G Network Is Here\n\nT-Mobile lights up the first nationwide 5G network, first nationwide prepaid 5G with Metro by T-Mobile and first 5G devices that work nationwide, ushering in a new era of 5G accessibility and affordability in first step toward 5G for All with New T-Mobile.\n\nThis holiday season, get a FREE 5G phone when you switch to T-Mobile.\n\nWhat’s the news: America gets its first nationwide 5G network today, covering more than 200 million people and more than 1 million square miles, marking a critical first step and foundation for the New T-Mobile.\n\nWhy it matters: 5G on 600 MHz spectrum goes far beyond the limitations of the carriers’ 5G. With clear 600 MHz spectrum reserved for 5G, T-Mobile is uniquely positioned to deliver 5G that covers more people in more places. Together with Sprint, the New T-Mobile has even bigger plans to supercharge 5G, with a broad and deep network for all Americans.\n\nWho it’s for: Early adopters looking for a cost effective 5G phone that will work indoors and out, across the country.\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nIt’s on! T-Mobile (NASDAQ: TMUS) today lit up the country’s first nationwide 5G network, covering more than 200 million people and more than 5,000 cities and towns all across the country. Today’s launch immediately catapults T-Mobile into the leadership position as the country’s biggest 5G network, covering more than 1 million square miles, much of that in rural America. But today is just the start. If the merger with Sprint closes, the New T-Mobile will be able to build on this foundation to deliver transformational broad and deep 5G for All.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191202005562/en/T-Mobile 5G: It’s On! America’s First Nationwide 5G Network Is Here. (Graphic: Business Wire)\nT-Mobile execs have fun lighting up America’s first nationwide 5G network\n\nTwo new 5G superphones, the exclusive OnePlus 7T Pro 5G McLaren and the Samsung Galaxy Note10+ 5G, are available for pre-order today at www.t-mobile.com/devices/5g-phones and in T-Mobile stores on December 6. Both 5G superphones tap into the Un-carrier’s 600 MHz 5G network where available and T-Mobile’s advanced nationwide LTE network elsewhere. Plus, both are ready to use Sprint’s 5G spectrum (2.5 GHz) when available from the New T-Mobile if the merger closes. To celebrate the launch, customers can get the OnePlus 7T Pro 5G McLaren for FREE with 24 bill credits when they switch to T-Mobile and trade in an eligible phone … or, get a Note10+ 5G for FREE with 24 bill credits when they buy another and add a line (two for new customers).\n\nMetro by T-Mobile will launch America’s first nationwide prepaid 5G on December 6. Because what good is advanced technology if not everyone — absolutely everyone — can get it?\n\n“5G is here on a nationwide scale. This is a HUGE step towards 5G for All,” said John Legere, CEO of T-Mobile. “While Dumb and Dumber focus on 5G for the (wealthy) Few, launching in just a handful of cities — and forcing customers into their most expensive plans to get 5G — we’re committed to building broad, deep nationwide 5G that people and businesses can access at no extra cost with the New T-Mobile … and today is just the start of that journey.”\n\nT-Mobile’s 5G network is not just bigger, it’s better. Here’s how:\n\n“The carriers have been over-hyping 5G for years now, setting expectations beyond what they can deliver. When Verizon says #5GBuiltRight, they must mean sparse, expensive and limited to outdoors only,” said Neville Ray, T-Mobile President of Technology. “Meanwhile at T-Mobile, we built 5G that works for more people in more places, and this is just the start. With the New T-Mobile, we’ll see 5G speeds follow the same path as LTE, increasing exponentially over time. Plus, real broad and deep 5G will unleash whole new categories of innovation that will touch almost every area of the economy. The 5G future is bright, and it starts today.”\n\nOf course, T-Mobile has published an interactive, zoomable 5G map at www.t-mobile.com/5Gmap, so customers can see exactly where they’ll get 5G coverage, down to their neighborhoods. For months (231 days, to be exact), Verizon refused to publish 5G coverage maps, until the Un-carrier forced them to do so with a relentless VerHIDEzon.com campaign aimed at ensuring greater carrier transparency.\n\nT-Mobile is starting by building a 5G foundation with broad nationwide access for more people in more places. Together with Sprint, the New T-Mobile will have the ability to complete the picture, adding critical depth with mid-band spectrum for broad coverage and performance as well as millimeter wave spectrum for hotspot-like coverage in dense urban areas. Only this combination will deliver a 5G network with both breadth and depth, something the carriers simply cannot do as quickly.\n\n5G Superphones\n\nThe Un-carrier isn’t holding back when it comes to making 5G more accessible and affordable. Next year, T-Mobile expects to launch more than 15 new 5G smartphones with a variety of price points and features. For those ready to get 5G now, customers who switch to T-Mobile can get the OnePlus 7T Pro 5G McLaren for FREE with 24 monthly bill credits when they trade in an eligible phone. Existing customers can get up to $300 off the OnePlus 7T Pro 5G McLaren or up to HALF off the Galaxy Note10+ 5G via trade-in credit and rebate when they trade in their eligible phone. Plus, customers with good credit can get a free Note10+ 5G with 36 monthly bill credits when they buy one and add a line (two for new customers).\n\nOnePlus 7T Pro 5G McLaren\n\nThe OnePlus 7T Pro 5G McLaren device is exclusive to T-Mobile customers and sports a 6.67” Fluid QHD+ Display with a 90 Hz refresh rate. It comes packed with three rear cameras, a 4085 mAh battery and Warp Charge 30T. In collaboration with McLaren, the device focuses on innovation and premium design with papaya orange accents. T-Mobile customers can get the OnePlus 7T Pro 5G McLaren in 256GB in Papaya Orange for $37.50/month ($0 down, FRP: $899.99) — all for well qualified customers for 24 months on T-Mobile’s no-interest Equipment Installment Plan.\n\nSamsung Galaxy Note10+ 5G\n\nThe Samsung Galaxy Note10+ 5G touts a 6.8” Cinematic Infinity display, four rear cameras and a 4300 mAh battery. It comes equipped with an enhanced S Pen and Wireless PowerShare capabilities. T-Mobile customers can get the Galaxy Note10+ 5G in 256GB in Aura Glow or Aura Black for $36.12/month ($0 down, FRP: $1,299.99) — all for well qualified customers for 36 months on T-Mobile’s no-interest Equipment Installment Plan.\n\nFor more information on the latest 5G devices at T-Mobile, visit www.t-mobile.com/devices/5g-phones. For more information and offer details for the Samsung Galaxy Note10+ 5G at Metro by T-Mobile, visit www.metrobyt-mobile.com/network#5G. For more information on the New T-Mobile, please visit www.NewTMobile.com.\n\nCustomers with a 600 MHz 5G capable device will be able to access T-Mobile’s nationwide 5G network. 5G is still developing, not all devices & signals are compatible. Coverage not available in some areas. While 5G access won’t require a certain plan or feature, some uses/services might. See Coverage details, Terms & Conditions, and Open Internet information for network management details (like video optimization) at T-Mobile.com.\n\nFree device offers via bill credits with finance agreement(s): if you cancel your line before receiving all credits, your remaining balance will become due (e.g., up to $1299.99 for Note 10+ 5G), if cancelling your account, you can contact us first to instead make discounted monthly payments. Tax on pre-credit price due at sale. For well-qualified customers. If you have canceled lines in past 90 days, reactivate them first. $10 SIM card, and, in stores & on customer service calls, $20 assisted or upgrade support charge may be required. Must be active and in good standing to receive credits; allow 2 bill cycles from trade-in. May not be combined with some offers or discounts (Carrier Freedom). Free 7T Pro 5G McLaren: Limit 1/account. Note 10+ 5G: Max 6 offers/account. Rebate offers: If you cancel service, remaining balance on required financed device becomes due. Rebate via trade-in credit and Virtual Express Prepaid Mastercard Card; no cash access & expires in 6 months. Allow 6-8 weeks. Max 12/account. Wireless PowerShare may not work with non-Samsung accessories or covers. May affect call reception or data services, depending on your network environment.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nImportant Additional Information\n\nIn connection with the proposed transaction, T-Mobile US, Inc. (“T-Mobile”) has filed a registration statement on Form S-4 (File No. 333-226435),which was declared effective by the U.S. Securities and Exchange Commission (the “SEC”) on October 29, 2018, and which contains a joint consent solicitation statement of T-Mobile and Sprint Corporation (“Sprint”), that also constitutes a prospectus of T-Mobile (the “joint consent solicitation statement/prospectus”), and each party will file other documents regarding the proposed transaction with the SEC. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE JOINT CONSENT SOLICITATION STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The documents filed by T-Mobile may be obtained free of charge at T-Mobile’s website, at www.t-mobile.com, or at the SEC’s website, at www.sec.gov, or from T-Mobile by requesting them by mail at T-Mobile US, Inc., Investor Relations, 1 Park Avenue, 14th Floor, New York, NY 10016, or by telephone at 212-358-3210. The documents filed by Sprint may be obtained free of charge at Sprint’s website, at www.sprint.com, or at the SEC’s website, at www.sec.gov, or from Sprint by requesting them by mail at Sprint Corporation, Shareholder Relations, 6200 Sprint Parkway, Mailstop KSOPHF0302-3B679, Overland Park, Kansas 66251, or by telephone at 913-794-1091.\n\nNo Offer or Solicitation\n\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\n\nCautionary Statement Regarding Forward-Looking Statements\n\nThis communication contains certain forward-looking statements concerning T-Mobile, Sprint and the proposed transaction between T-Mobile and Sprint. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction, including anticipated future financial and operating results, synergies, accretion and growth rates, T-Mobile’s, Sprint’s and the combined company’s plans, objectives, expectations and intentions, and the expected timing of completion of the proposed transaction. There are several factors which could cause actual plans and results to differ materially from those expressed or implied in forward-looking statements. Such factors include, but are not limited to, the failure to obtain, or delays in obtaining, required regulatory approvals, and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the proposed transaction, or the failure to satisfy any of the other conditions to the proposed transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the business combination agreement; adverse effects on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results because of a failure to complete the proposed transaction in the anticipated timeframe or at all; inability to obtain the financing contemplated to be obtained in connection with the proposed transaction on the expected terms or timing or at all; the ability of T-Mobile, Sprint and the combined company to make payments on debt or to repay existing or future indebtedness when due or to comply with the covenants contained therein; adverse changes in the ratings of T-Mobile’s or Sprint’s debt securities or adverse conditions in the credit markets; negative effects of the announcement, pendency or consummation of the transaction on the market price of T-Mobile’s or Sprint’s common stock and on T-Mobile’s or Sprint’s operating results, including as a result of changes in key customer, supplier, employee or other business relationships; significant transaction costs, including financing costs, and unknown liabilities; failure to realize the expected benefits and synergies of the proposed transaction in the expected timeframes or at all; costs or difficulties related to the integration of Sprint’s network and operations into T-Mobile; the risk of litigation or regulatory actions, including the antitrust litigation brought by the attorneys general of certain states and the District of Columbia; the inability of T-Mobile, Sprint or the combined company to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect T-Mobile’s or Sprint’s ability to pursue business opportunities or strategic transactions; effects of changes in the regulatory environment in which T-Mobile and Sprint operate; changes in global, political, economic, business, competitive and market conditions; changes in tax and other laws and regulations; and other risks and uncertainties detailed in the Form S-4, as well as in T-Mobile’s Annual Report on Form 10-K for the fiscal year ended December 31, 2018 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” as well as in its subsequent reports on Form 8-K, all of which are filed with the SEC and available at www.sec.gov and www.t-mobile.com. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. T-Mobile assumes no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191202005562/en/\nMedia Contacts\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\n\nInvestor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile to Deliver up to 5M Meals for Giving Tuesday by Inviting Everyone to Do Their #GivingOnUs",
        "subtitle": "",
        "date": "Nov 26, 2019 9:00AM EST",
        "content": "\nOn December 3, the Un-Carrier activates a giving campaign that will mobilize customers, employees and fans to help the 37 million American families facing hunger this holiday season\n\nWhat’s the news: This Giving Tuesday, December 3, T-Mobile is rallying customers, employees and fans to help donate up to 5 million meals* to people in need through a partnership with Feeding America®, the nation’s largest hunger-relief organization. And because T-Mobile employees love to give back to the communities they serve every day, the Un-Carrier is planning 100 employee volunteer events with Feeding America member food banks across the country through the end of the year.\n\nWhy it matters: More than 37 million Americans face hunger at home. By donating financial resources and employee volunteer hours — and by activating fans and followers to do their #GivingOnUs — the Un-carrier is stepping up to make a BIG impact at a time when people need it most.\n\nWho it’s for: Anyone who wants to help T-Mobile feed hungry families this holiday season, and anyone interested in how companies are spreading the love this holiday season.\n    BELLEVUE, Wash.--(BUSINESS WIRE)--\nThis Giving Tuesday, December 3, and throughout the holiday season, T-Mobile is serving up multiple ways for customers, employees and fans to give up to 5 million meals to communities in need. It’s a big goal, and to get there the Un-carrier is continuing its longstanding partnership with Feeding America, the country’s largest hunger-relief organization, as well as activating its T-Mobile Tuesdays app, social media channels and Team Magenta members across the country so everyone has the opportunity to do their #GivingOnUs.\n\n“This year on Giving Tuesday, T-Mobile is ringing in the holiday season and giving back in a BIG way by encouraging our employees, customers and fans to do their #GivingOnUs! We’re going to donate up to 5 million meals to people in need — helping people focus on connecting with their families without having to worry about getting food on their table,” said John Legere, CEO of T-Mobile.\n\nT-Mobile is offering two main ways for everyone to do their #GivingOnUs on December 3.\n\nIn total, via the T-Mobile Tuesdays app and Twitter, T-Mobile will donate up to 5 million meals to Feeding America!\n\nT-Mobile employees are also rolling up their sleeves and carrying the spirit of generosity into the entire holiday season with a goal to host 100 volunteer events with Feeding America member food banks across the country, providing hands-on support to the families facing hunger right in their own backyard.\n\nAnd that’s not all! The T-Mobile Foundation will deposit $25 into every employee’s Giving Account, which they can donate to the charity of their choice. With more than 52,000 Team Magenta members across the U.S., that adds up to a potential $1.3 million of charitable giving! By offering multiple ways to engage, T-Mobile and the T-Mobile Foundation are embracing the passion and enthusiasm of T-Mobile employees who are committed to giving back on a national scale AND connecting personally with the communities they serve every day.\n\n“Everyone has a role to play in ending hunger, whether that’s making a donation, volunteering at a local food bank or using your voice on social media to spread the word,” said Jenn Kovacs, Interim Chief Development Officer at Feeding America. “We can’t end hunger alone. Individuals, businesses, charities and government entities must all join the fight. We’re tremendously grateful for T-Mobile’s commitment in helping to fight hunger and bringing national attention to this critical issue.”\n\nT-Mobile is committed to changing America’s communities for good, which is why the Un-carrier is continuing its partnership with Feeding America to provide families in need with food for the holidays. Feeding America operates a network of 200 member food banks, which provide food and groceries to 60,000 food pantries, soup kitchens and emergency feeding sites around the U.S. Add the potential 5 million meals for Giving Tuesday to the 10 million meals donated through the Slow Cooker Sunday Cookbook campaign earlier this year and T-Mobile’s 2019 contribution to Feeding America could total up to 15 million meals!\n\nThe commitment to giving back is in the Un-carrier’s DNA. So far in 2019, T-Mobile employees have offered more than 53,000 volunteer hours to organizations that support youth, veterans, the environment, disaster recovery, ending hunger in America and more — a 55% increase over this time last year.\n\nFor more information check out T-Mobile.com/Responsibility.\n\n*$1 helps provide at least 10 meals secured by Feeding America on behalf of local member food banks. For more information visit feedingamerica.org. T-Mobile will donate a minimum of 250,000 meals.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout T-Mobile Foundation \n\nThe T-Mobile Foundation is committed to changing the world for good. The Foundation advances positive change in our communities by supporting causes that focus on youth development and by providing opportunities for T-Mobile employees to engage in causes that benefit the communities where they live and work. The T-Mobile Foundation, created and funded by T-Mobile US, Inc., is recognized by the IRS as a Section 501(c)(3) private foundation.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005507/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nor\nInvestor Relations\n877-281-TMUS OR 212-358-3210\ninvestor.relations@t-mobile.com\nSource: T-Mobile US, Inc."
    },
    {
        "title": "T-Mobile, Comcast and Inteliquent Deliver Industry First in War Against Illegal Call Spoofing",
        "subtitle": "",
        "date": "Nov 21, 2019 9:00AM EST",
        "content": "    BELLEVUE, Wash. & PHILADELPHIA--(BUSINESS WIRE)--\nT-Mobile (NASDAQ: TMUS), Comcast (NASDAQ: CMCSA) and Inteliquent, Inc. today announced they’ve achieved an industry first in the war against spoofers and scammers, completing the first end-to-end STIR/SHAKEN call verification across three networks. T-Mobile and Comcast announced STIR/SHAKEN interoperability earlier this year, giving consumers with a growing number of capable smartphones peace of mind that calls from Comcast’s Xfinity Voice phones to T-Mobile phones (and vice versa) are not generated by a scammer spoofing a number. Now, calls can be routed through Inteliquent as well as directly between T-Mobile and the Xfinity Voice landline phone service and still ensure that the number displayed has been verified. With this technical first, our companies are expanding what is possible with STIR/SHAKEN, not only enabling peer-to-peer call verification but also connections via tandem networks.\n\nNeighbor spoofing — where scammers hijack a phone number to match the area code and 3-digit prefix of the person they’re targeting — is a common scam. People are more prone to answer calls from numbers that look familiar, putting them at risk of falling victim to fraudsters. Today’s news means consumers are more protected against these types of spoofed calls.\n\n“Scammers and spoofers are a scourge on the industry, and at T-Mobile, we’re using every tool available to fight against these bad guys on behalf of consumers,” said John Legere, CEO of T-Mobile. “We were first to announce STIR/SHAKEN readiness, first to implement caller verification, and first to launch cross-network caller verification … we continue to be on the front lines to keep Un-carrier customers protected, and we won’t stop.”\n\n“Consumers are tired of getting scammed, and Comcast has developed ways to ensure Xfinity customers know the calls they are answering are legitimate,” said Tony Werner, President of Technology, Product and Xperience for Comcast. “This is another milestone in our efforts to implement STIR/SHAKEN. We were one of the first companies to conduct a non-lab exchange of a verified call and we co-authored many of the core STIR and SHAKEN specifications.”\n\n“The communications industry is committed to stopping call spoofing, which seriously harms consumers,” stated Surendra Saboo, Inteliquent’s President. “Inteliquent fully supports the FCC’s recent STIR/SHAKEN initiative, and we’re excited about our new collaboration with T-Mobile and Comcast. Together, we can prevent scammers from connecting with citizens.”\n\nSTIR (Secure Telephony Identity Revisited) and SHAKEN (Secure Handling of Asserted information using toKENs) standards are recommended by the FCC to identify authentic calls on networks. T-Mobile and Comcast’s Xfinity Voice were the first to deliver network interoperability in April 2019. Comcast has implemented STIR/SHAKEN for all Xfinity Voice home phone subscribers, authenticating outgoing residential calls and validating incoming authenticated calls.\n\nAs part of today’s news, T-Mobile also announced that Caller Verified, the Un-carrier’s implementation of STIR/SHAKEN, is now operable across 17 smartphones, with more coming soon. Caller Verified is live today for all T-Mobile and Metro by T-Mobile customers, and customers with these devices and the latest software update will automatically see “Caller Verified” on their screen for authentic calls from the T-Mobile network and Comcast’s Xfinity Voice home phone service.\n\nFor more information on all the ways T-Mobile is protecting customers, visit https://www.t-mobile.com/resources/call-protection.\n\nFor Metro by T-Mobile customers, more information is available at https://www.metropcs.com/shop/services/protection.\n\nFor additional information about what Comcast is doing to fight robocalls, visit corporate.comcast.com.\n\nCapable device required.\n\nAbout T-Mobile US, Inc.\n\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 84.2 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com.\n\nAbout Comcast\n\nComcast Corporation (Nasdaq: CMCSA) is a global media and technology company with three primary businesses: Comcast Cable, NBCUniversal, and Sky. Comcast Cable is one of the United States’ largest high-speed internet, video, and phone providers to residential customers under the Xfinity brand, and also provides these services to businesses. It also provides wireless and security and automation services to residential customers under the Xfinity brand. NBCUniversal is global and operates news, entertainment and sports cable networks, the NBC and Telemundo broadcast networks, television production operations, television station groups, Universal Pictures, and Universal Parks and Resorts. Sky is one of Europe's leading media and entertainment companies, connecting customers to a broad range of video content through its pay television services. It also provides communications services, including residential high-speed internet, phone, and wireless services. Sky operates the Sky News broadcast network and sports and entertainment networks, produces original content, and has exclusive content rights. Visit www.comcastcorporation.com for more information.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191121005125/en/\nT-Mobile Media Contact\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\n\nInvestor Relations Contact\nT-Mobile US, Inc.\ninvestor.relations@t-mobile.com\nhttp://investor.t-mobile.com\n\nComcast Media Contact\nJoel Shadle, 215-286-2645\nJoel_shadle@comcast.com\n\nInteliquent Media Contact\nAlina Rattanasavanh, 312-380-4562\nalina.rattanasavanh@inteliquent.com\nSource: T-Mobile US, Inc."
    }
]