[
    {
        "title": "Make-A-Wish® Kid William Floyd Joins NBA® 2K20 Roster as First Authentically Scanned and Playable Fan in Basketball Video Game Series’ History",
        "subtitle": "",
        "date": "Mar 4, 2020 8:00AM EST",
        "content": "\nPublishing label and nonprofit organization partner to deliver once-in-a-lifetime experience for 15-year-old from Georgia\n    NEW YORK--(BUSINESS WIRE)--\n2K today announced that Make-A-Wish® kid, William Floyd, a 15-year-old from Georgia with a rare genetic disorder causing severe muscle weakness and heart problems, is the first non-NBA athlete in the popular basketball video game series’ history to be authentically scanned and earn a spot on an NBA® 2K playable roster. Available for download beginning today on the Xbox One family of devices, including Xbox One X, as well as PlayStation®4 system, Windows PC and Nintendo Switch™, William’s NBA® 2K20 player model may be found within Quick Game mode as a free agent for players to include on their teams of choice, as well as through new MyCAREER and MyLEAGUE rosters.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200304005130/en/In-game NBA 2K20 screenshot of Make-A-Wish kid William Floyd dunking in an Atlanta Hawks jersey. (Photo: Business Wire)\nMake-A-Wish sent William and his family from Georgia to 2K’s headquarters in Novato, California, to grant his wish to visit the home of NBA 2K; however, he was unaware that in addition to his unforgettable tour, 2K planned to professionally scan his likeness – just as they had with his favorite NBA stars – and create him as a playable roster member in NBA 2K20 and make him accessible to millions of players around the world to add to their teams.\n\n“When we learned about William’s wish to visit 2K, the whole team was thrilled,” said Ronnie Singh, also known as Ronnie 2K. “Learning about his journey was really humbling, and we wanted to find a way to make William’s wish come true in the biggest way possible. We couldn’t think of a better way to do that than bringing his passion to life in-game and giving millions of NBA 2K fans around the world the chance to enjoy William’s player model.”\n\nMuch like today’s biggest NBA stars, William’s NBA 2K experience began at the 2K Motion Capture Studio, where 140 motion capture cameras caught his every move. William then had his likeness recreated in incredible detail by 146 Pixelgun cameras, each capturing every grimace and grin, and all to help authentically bring his player model to life.\n\n“Each player does a dance move or a celebration before he gets on the court,” William explained. “So, I got one of those, too. I got to create it.”\n\nWilliam also talked to the NBA 2K marketing and video capture teams, and the development team at Visual Concepts. Armed with a list of ideas for the game, William gave his input in potential cover athletes, game modes, and features that he would love to see in the future.\n\nWilliam was 18 months old when he went into heart failure and was diagnosed with a genetic disorder that causes muscle weakness and heart problems. His medical condition does not allow him to play sports like other children his age, but NBA 2K allows him to stay competitive in sports virtually. William’s wish helped him during his treatment by giving him something to look forward to in the future. In addition, he is now eager to explore employment opportunities with 2K when he is older.\n\n“The cool thing is that 2K took what could have been a great wish and brought it to a level that we never expected,” says William’s mom, Julie. “They treated him – and all of us – like royalty and were so interested in everything William had to offer them. It was absolutely unbelievable.”\n\nDeveloped by Visual Concepts, NBA 2K20 is rated E for Everyone by the ESRB. For more information on NBA 2K20, please visit https://nba.2k.com/2k20/.\n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nOnline account (13+) required to access online features. See www.take2games.com/legal and www.take2games.com/privacy for additional details.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games, 31st Union and Cloud Chamber. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated* annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n* According to 2008 – 2020 Metacritic.com\n\nAbout Make-A-Wish®\n\nMake-A-Wish® creates life-changing wishes for children with critical illnesses. We are on a quest to bring every eligible child's wish to life, because a wish is an integral part of a child's treatment journey. Research shows children who have wishes granted can build the physical and emotional strength they need to fight a critical illness. Make-A-Wish is the world’s leading children’s wish-granting organization, serving children in every community in the United States and in 50 countries worldwide. For more information about Make-A-Wish America, visit wish.org.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at http://www.take2games.com/. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005130/en/\nLeah Barash\n2K\n(415) 317-2047\nleah.barash@2k.com\n\nLinda Anderberg\nMake-A-Wish Greater Bay Area\n(415) 321-7388\nlanderberg@sf.wish.org\n\nAmy Alvarez\nMake-A-Wish Georgia\n(770) 916-9474\naalvarez@georgia.wish.org\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Private Division Announces New Seattle-Area Development Studio",
        "subtitle": "",
        "date": "Feb 20, 2020 11:00AM EST",
        "content": "\nPublisher-owned game development studio opens to focus solely on Kerbal Space Program 2\n    NEW YORK--(BUSINESS WIRE)--\nPrivate Division today announced the founding of a new studio located in the greater Seattle area, that is wholly focused on bringing to life the next generation of the Kerbal Space Program franchise, which was acquired by the publisher in 2017.\n\nThe studio includes key members of the original Kerbal Space Program 2 development team, such as studio head Jeremy Ables, creative director Nate Simpson, and lead producer Nate Robinson, each of whom will continue their work on the sequel to the beloved space flight sim game. These skilled industry professionals have shipped multiple successful titles and will continue to lead the development of Kerbal Space Program 2 which is set to release during Take-Two’s fiscal year 2021 (beginning April 1, 2020 to March 31, 2021).\n\n“Since we acquired Kerbal Space Program in 2017, we have consistently produced, high-quality content for our community, which in turn has resulted in strong growth, both in terms of new players engaging with the franchise, and our ambitions to take it to the next level,” said Michael Worosz, EVP and Head of Private Division. “The opening of this new studio, whose purpose is dedicated solely to the ongoing development of KSP, is a reinforcement of our promise to bring the best experiences to our fans and players for Kerbal Space Program 2 and beyond.”\n\nThose interested in working at Private Division’s development studio in the greater Seattle area can view job openings here.\n\nPrivate Division is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ:TTWO).\n\nAbout Kerbal Space Program Franchise\n\nIn the Kerbal Space Program franchise, you take charge of the space program for the alien race known as the Kerbals. You have access to an array of parts to assemble a fully functional spacecraft that flies (or doesn’t) based on realistic aerodynamic and orbital physics. Launch your Kerbal crew into orbit and beyond (while keeping them alive) to explore moons and planets in the Kerbol solar system, constructing bases and space stations to expand the reach of your expedition.\n\nThe original Kerbal Space Program, created and with on-going development by Squad, released on PC in April 2015* and has sold more than 3.5 million units worldwide. The title has been widely popular with the media and consumers alike, earning a Metacritic rating of 88** and a Steam user score of 92%***. Kerbal Space Program 2 is the sequel to the original game and the second in the series for the franchise. It is now being developed by Private Division and is set to release during Take-Two’s fiscal year 2021 (ending March 31, 2021).\n\n*Game became available through Steam Early Access in March 2013, and launched in April 2015.\n\n**Metacritic score for PC as of January 19, 2020.\n\n***Steam user score as of January 19, 2020.\n\nAbout Private Division\n\nPrivate Division is a developer-focused publisher that empowers independent studios to develop the games that they are passionate about creating, while providing the support that they need to make their titles critically and commercially successful on a global scale. The label publishes the Kerbal Space Program franchise, Ancestors: The Humankind Odyssey from Panache Digital Games, and The Outer Worlds from Obsidian Entertainment, and will publish upcoming titles with renowned creative talent at studios including Disintegration from V1 Interactive, and more. Private Division is headquartered in New York City with offices in Seattle, Las Vegas, and Munich. For more information, please visit www.privatedivision.com.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005143/en/\nBrian Roundy\nDirector\nMarketing and Communications\nPrivate Division\n(646) 536-2936\npress@privatedivision.com\n\nAlan Lewis (Corporate Press)\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "2K Silicon Valley Announces Official Studio Name – 31st Union",
        "subtitle": "",
        "date": "Feb 11, 2020 8:00AM EST",
        "content": "\nStudio poised for global recruitment and continued development of unannounced new IP\n    NEW YORK--(BUSINESS WIRE)--\n2K announced today that 2K Silicon Valley, the label’s wholly-owned development studio founded in February 2019 and led by video game industry veteran Michael Condrey, will officially be known as 31st Union. Alongside revealing its new state-of-the-art development facility, branding and core values commitment to further establish its identity, the studio also announced plans to expand its presence internationally, beginning with a European location based in Spain.\n\n“31st Union is off to an incredible start with a passionate and talented team, an intentioned culture that champions inclusivity and greater representation, and an ambitious and inspired new IP that we’re extremely excited about,” said Michael Condrey, President at 31st Union. “Our name and studio represent the spirit of California in its rich diversity of thought, art, music, innovation and cultural representation that have defined the current golden age of entertainment and technology here in Silicon Valley. In revealing our new identity and announcing the expansion of our operations, we’re shifting into an exciting next phase of growth to include more voices and bring our vision to life around the globe.”\n\n“We’re creating a development environment focused on a single new IP where passion is at the center of it all,” said Tyler Michaud, Head of Strategy at 31st Union. “We believe diverse perspectives and experiences are crucial to creating a truly global entertainment experience with a deep connection to passionate fans.”\n\n31st Union will be the fourth 2K-owned game development studio with multiple locations around the globe. In December 2019, Cloud Chamber announced studio locations in Novato, Calif. and Montreal, Quebec, while in June 2018, Hangar 13 opened its third location in Brighton, UK, which joined that studio’s offices in Czech Republic and Novato. In addition, Visual Concepts currently maintains offices in multiple locations around the world.\n\n“We’re pleased to see the team at 31st Union continue to expand and scale internationally,” said David Ismailer, President of 2K. “We’ve seen the benefits of this approach across 2K, from broadening recruitment efforts and attracting the best talent to having more diverse perspectives contributing to the creative process. We’re optimistic the Spain studio will have a positive impact for 31st Union and look forward to sharing more about its new IP in time.”\n\nFor more information, please visit www.thirtyfirstunion.com and follow the studio on Twitter and Facebook. Those interested in careers with 31st Union or any of 2K’s wholly-owned development studios may visit 2k.com/jobs.\n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. The Company develops and publishes products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games, 31st Union and Cloud Chamber. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated* annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n* According to 2008 – 2020 Metacritic.com\n\nCautionary Note Regarding Forward-Looking Statements \n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K for the fiscal year ended March 31, 2016, including the risks summarized in the section entitled \"Risk Factors,\" and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005234/en/\nJaime Jensen\n2K\n(415) 507-7910\njaime.jensen@2k.com\n\nJoe DiMiero\n2K\n(415) 507-7712\njoe.dimiero@2k.com\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Take-Two Interactive Software, Inc. to Present at Morgan Stanley Technology, Media & Telecom Conference",
        "subtitle": "",
        "date": "Feb 7, 2020 8:00AM EST",
        "content": "\nWebcast scheduled for March 5, 2020 at 10:20 a.m. Pacific Time\n    NEW YORK--(BUSINESS WIRE)--\nTake-Two Interactive Software, Inc. (NASDAQ: TTWO) today announced that Strauss Zelnick, the Company’s Chairman and Chief Executive Officer, plans to present at the Morgan Stanley Technology, Media & Telecom Conference in San Francisco. The Company’s presentation is scheduled for Thursday, March 5, 2020 at 10:20 a.m. Pacific Time. A link to the live webcast of the presentation will be available via the Company’s website at http://ir.take2games.com. A replay of the presentation will be archived and available at the same location.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements \n\nDuring the course of the presentation, the Company may make statements that are not historical facts and which are considered forward-looking statements under federal securities laws. These forward-looking statements may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should”, \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200207005004/en/\n(Investor Relations)\nHenry A. Diamond\nSenior Vice President\nInvestor Relations & Corporate Communications\nTake-Two Interactive Software, Inc.\n(646) 536-3005\nHenry.Diamond@take2games.com\n\n(Corporate Press)\nAlan Lewis\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Take-Two Interactive Software, Inc. Reports Results for Fiscal Third Quarter 2020",
        "subtitle": "",
        "date": "Feb 6, 2020 4:05PM EST",
        "content": "\nGAAP net revenue was $930.1 million\n\nGAAP net income per diluted share was $1.43 \n\nGAAP net cash provided by operating activities for the nine-months ended December 31, 2019 increased to $440.0 million\n\nAdjusted Unrestricted Operating Cash Flow (Non-GAAP) for the nine-months ended December 31, 2019 was $547.9 million\n\nNet Bookings were $888.2 million\n    NEW YORK--(BUSINESS WIRE)--\nTake-Two Interactive Software, Inc. (NASDAQ:TTWO) today reported results for its fiscal third quarter 2020 ended December 31, 2019. In addition, the Company provided its initial outlook for its fiscal fourth quarter ending March 31, 2020 and adjusted its outlook for the fiscal year 2020, ending March 31, 2020. For additional information, please see the fiscal third quarter 2020 results slide deck posted to the Company’s investor relations website at http://ir.take2games.com.\n\nFiscal Third Quarter 2020 Financial Highlights\n\nGAAP net revenue was $930.1 million, as compared to $1.249 billion in last year’s fiscal third quarter. Recurrent consumer spending (which is generated from ongoing consumer engagement and includes virtual currency, add-on content and in-game purchases) increased 15% and accounted for 37% of total GAAP net revenue. The largest contributors to GAAP net revenue in fiscal third quarter 2020 were NBA® 2K20 and NBA 2K19; Grand Theft Auto® Online and Grand Theft Auto V; Red Dead Redemption 2 and Red Dead Online; The Outer Worlds; Borderlands® 3; WWE® 2K20 and WWE SuperCard; Sid Meier’s Civilization VI; and Social Point’s mobile offerings.\n\nDigitally-delivered GAAP net revenue increased to $700.3 million, as compared to $594.7 million in last year’s fiscal third quarter, and accounted for 75% of total GAAP net revenue. The largest contributors to GAAP digitally-delivered net revenue in fiscal third quarter 2020 were NBA 2K20 and NBA 2K19; Grand Theft Auto Online and Grand Theft Auto V; The Outer Worlds; Red Dead Redemption 2 and Red Dead Online; Borderlands 3; Sid Meier’s Civilization VI; Social Point’s mobile offerings; and WWE SuperCard and WWE 2K20.\n\nGAAP net income was $163.6 million, or $1.43 per diluted share, as compared to $179.9 million, or $1.57 per diluted share, for the comparable period last year.\n\nDuring the nine-month period ended December 31, 2019, GAAP net cash provided by operating activities increased to $440.0 million, as compared to $390.2 million in the same period last year. During the nine-month period ended December 31, 2019, Adjusted Unrestricted Operating Cash Flow (Non-GAAP), which is defined as GAAP net cash from operating activities, adjusted for changes in restricted cash, was $547.9 million, as compared to $587.0 million in the same period last year (please see the section below titled “Non-GAAP Financial Measure” for additional information). As of December 31, 2019, the Company had cash and short-term investments of $1.984 billion.\n\nThe following data, together with a management reporting tax rate of 17%, are used internally by the Company’s management and Board of Directors to adjust the Company’s GAAP financial results in order to facilitate comparison of its operating performance between periods and to better understand its core business and future outlook:\n\nIn order to calculate net income per diluted share for management reporting purposes, the Company uses its fully diluted share count of 114.25 million.\n\nOperational Metric – Net Bookings\n\nNet Bookings is defined as the net amount of products and services sold digitally or sold-in physically during the period, and includes licensing fees, merchandise, in-game advertising, strategy guides and publisher incentives.\n\nDuring fiscal third quarter 2020, total Net Bookings were $888.2 million, as compared to $1.569 billion during last year’s fiscal third quarter, which had benefited from the launch of Red Dead Redemption 2. Net Bookings from recurrent consumer spending grew 6% and accounted for 41% of total Net Bookings. The largest contributors to Net Bookings in fiscal third quarter 2020 were Grand Theft Auto Online and Grand Theft Auto V; NBA 2K20; Red Dead Redemption 2 and Red Dead Online; The Outer Worlds; Borderlands 3; WWE 2K20 and WWE SuperCard; Sid Meier’s Civilization VI; and Social Point’s mobile offerings.\n\nCatalog accounted for $359.7 million of Net Bookings led by Grand Theft Auto, Red Dead Redemption, and Social Point’s mobile offerings.\n\nDigitally-delivered Net Bookings were $690.6 million, as compared to $703.8 million in last year’s fiscal third quarter, and accounted for 78% of total Net Bookings. The largest contributors to digitally-delivered Net Bookings in fiscal third quarter 2020 were Grand Theft Auto Online and Grand Theft Auto V; NBA 2K20; Red Dead Redemption 2 and Red Dead Online; The Outer Worlds; Borderlands 3; Sid Meier’s Civilization VI; WWE 2K20 and WWE SuperCard; and Social Point’s mobile offerings.\n\nManagement Comments\n\n“Throughout the 2019 holiday season, we experienced robust demand for our offerings that drove third quarter operating results solidly within our increased outlook,” said Strauss Zelnick, Chairman and CEO of Take-Two. “Highlights included the performance of Grand Theft Auto Online and Grand Theft Auto V, NBA 2K20, Red Dead Redemption 2 and Red Dead Online, The Outer Worlds and Borderlands 3, reflecting our ability to deliver some of the most captivating experiences in the entertainment industry. Fiscal 2020 is shaping up to be another terrific year for Take-Two.\n\n“Take-Two’s development pipeline over the coming years is the largest and most diverse in our history, including releases from our largest franchises, new IP and a broad mix of gameplay experiences, all designed to captivate and engage audiences well beyond initial release. In addition, we are actively investing in emerging markets, platforms and business models that have the potential to enhance growth. Take-Two is exceedingly well positioned to capitalize on the many positive trends in our industry and to generate growth and margin expansion over the long-term.”\n\nBusiness and Product Highlights\n\nSince October 1, 2019:\n\nRockstar Games:\n\n2K:\n\nPrivate Division:\n\nOutlook for Fiscal 2020\n\nTake-Two is providing its initial outlook for its fiscal fourth quarter ending March 31, 2020 and is adjusting its outlook for the fiscal year ending March 31, 2020:\n\nFourth Quarter Ending March 31, 2020\n\nThe Company is also providing selected data and its management reporting tax rate of 17%, which are used internally by its management and Board of Directors to adjust the Company’s GAAP financial outlook in order to facilitate comparison of its operating performance between periods and to better understand its core business and future outlook:\n\nFiscal Year Ending March 31, 2020\n\nThe Company is also providing selected data and its management reporting tax rate of 17%, which are used internally by its management and Board of Directors to adjust the Company’s GAAP financial outlook in order to facilitate comparison of its operating performance between periods and to better understand its core business and future outlook:\n\nKey assumptions and dependencies underlying the Company’s outlook include: the timely delivery of the titles included in this financial outlook; continued consumer acceptance of Xbox One and PlayStation 4; the ability to develop and publish products that capture market share for these current generation systems while also leveraging opportunities on PC, mobile and other platforms; and stable foreign exchange rates. See also “Cautionary Note Regarding Forward Looking Statements” below.\n\nProduct Releases\n\nThe following titles were released since October 1, 2019:\n\nConference Call\n\nTake-Two will host a conference call today at 4:30 p.m. Eastern Time to review these results and discuss other topics. The call can be accessed by dialing (877) 407-0984 or (201) 689-8577. A live listen-only webcast of the call will be available by visiting http://ir.take2games.com and a replay will be available following the call at the same location.\n\nNon-GAAP Financial Measure\n\nIn addition to reporting financial results in accordance with U.S. generally accepted accounting principles (GAAP), the Company uses a Non-GAAP measure of financial performance: Adjusted Unrestricted Operating Cash Flow, which is defined as GAAP net cash from operating activities, adjusted for changes in restricted cash. The Company’s management believes it is important to consider Adjusted Unrestricted Operating Cash Flow, in addition to net cash from operating activities, as it provides more transparency into current business trends without regard to the timing of payments from restricted cash, which is primarily related to a dedicated account limited to the payment of certain internal royalty obligations.\n\nThis Non-GAAP financial measure is not intended to be considered in isolation from, as a substitute for, or superior to, GAAP results. This Non-GAAP financial measure may be different from similarly titled measures used by other companies. In the future, Take-Two may also consider whether other items should also be excluded in calculating this Non-GAAP financial measure used by the Company. Management believes that the presentation of this Non-GAAP financial measure provides investors with additional useful information to measure Take-Two's financial and operating performance. In particular, this measure facilitates comparison of our operating performance between periods and may help investors to understand better the operating results of Take-Two. Internally, management uses this Non-GAAP financial measure in assessing the Company's operating results and in planning and forecasting. A reconciliation of this Non-GAAP financial measure to the most comparable GAAP measure is contained in the financial tables to this press release.\n\nFinal Results\n\nThe financial results discussed herein are presented on a preliminary basis; final data will be included in Take-Two’s Quarterly Report on Form 10-Q for the period ended December 31, 2019.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements \n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005841/en/\n(Investor Relations)\nHenry A. Diamond\nSenior Vice President\nInvestor Relations & Corporate Communications\nTake-Two Interactive Software, Inc.\n(646) 536-3005\nHenry.Diamond@take2games.com\n\n(Corporate Press)\nAlan Lewis\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Rockstar Games Breaks New Records with Grand Theft Auto V and Red Dead Redemption 2",
        "subtitle": "",
        "date": "Jan 28, 2020 11:00AM EST",
        "content": "\nGrand Theft Auto V is the Best-Selling Game of the Past Decade*\n\nRed Dead Redemption 2 is the Best-Selling Game of the Past Four Years*\n\nGrand Theft Auto V and Red Dead Redemption 2 have sold-in more than 150 million units worldwide combined since their launches\n\nGTA Online breaks multiple audience records with Diamond Casino Heist Update\n\nRed Dead Online reaches new peak in player numbers after the release of Moonshiners update\n    NEW YORK--(BUSINESS WIRE)--\nRockstar Games® is proud to announce numerous critical and commercial achievements across multiple titles, including Grand Theft Auto V and Red Dead Redemption 2, and a record-breaking holiday season with its two online worlds, GTA Online and Red Dead Online. \n\nGrand Theft Auto V is the best-selling game of the past decade in U.S. dollar sales*, also earning BBC’s top Game of the Decade**. Seven years after release, the shared living world of GTA Online has had its biggest series of back-to-back updates ever in terms of player numbers, with new records set in December and the quarter ending December 31, 2019, following the release of the Diamond Casino & Resort update in July 2019 and the Diamond Casino Heist in December 2019.\n\nIn addition to these blockbuster achievements, Grand Theft Auto V also hit a new record for video engagements in January***, illustrating how compelling Grand Theft Auto V content is to viewers and broadcasters alike.\n\nRed Dead Redemption 2 continues to outperform, achieving a new benchmark as the top-selling title of the last four years in U.S. dollar sales*. Red Dead Online also continues to see strong growth, hitting a new peak in player numbers in December following the release of the latest update, Moonshiners, topping those numbers again in January.\n\nTogether, both award-winning titles have attained incredible benchmarks for Rockstar Games, with collective lifetime sell-in of Grand Theft Auto V and Red Dead Redemption 2 now totaling more than 150 million units worldwide. Rockstar Games’ total online audience is now its biggest ever, having recorded its largest numbers ever throughout the fourth quarter of calendar 2019.\n\nTo celebrate these milestones, Rockstar Games will be offering huge bonuses to players in both games starting this week:\n\nGTA Online will feature bonus cash of up to GTA$2,000,000 in its biggest cash giveaway yet. Starting on January 30, players can earn GTA$1,000,000 simply by playing before February 5 and will be able to earn another GTA$1,000,000 by playing between February 6 and February 12.\n\nRed Dead Online players will receive a series of gifts including free access to select roles, special role item giveaways and more, including:\n\nGrand Theft Auto V is rated M for Mature by the ESRB. For more information, please visit https://www.rockstargames.com/V/.\n\nRed Dead Redemption 2 is rated M for Mature by the ESRB. For more information, please visit www.rockstargames.com/reddeadredemption2.\n\n*According to the NPD Group.\n\n**According to BBC, as sourced from GFK.\n\n***According to Tubular Labs video performance data, based on engagement metrics “likes” and “comments” for week of January 13, 2020.\n\n**** Red Dead Online exited the beta period May 14, 2019\n\nAbout Rockstar Games\n\nRockstar Games cemented their reputation as creators of complex living worlds with the Grand Theft Auto series, one of the most successful entertainment properties of all time with over 270 million units sold-in worldwide. Through a string of critically acclaimed games including the Grand Theft Auto series, the Red Dead Redemption series, the Max Payne series, Bully, L.A. Noire, the Midnight Club series and The Warriors, Rockstar Games has helped propel interactive entertainment into the center of modern culture.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200128005604/en/\nSimon Ramsey\nRockstar Games\n(212) 334-6633\nSimon.Ramsey@rockstargames.com\n\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\n\n\nHenry Diamond (Investor Relations)\nTake-Two Interactive Software, Inc.\n(646) 536-3005\nHenry.Diamond@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Take-Two Interactive Software, Inc. to Report Fiscal Third Quarter 2020 Results on Thursday, February 6, 2020",
        "subtitle": "",
        "date": "Jan 9, 2020 8:00AM EST",
        "content": "    NEW YORK--(BUSINESS WIRE)--\nTake-Two Interactive Software, Inc. (NASDAQ: TTWO) today announced that it plans to report financial results for the third quarter of its fiscal year 2020, ended December 31, 2019, after the market close on Thursday, February 6, 2020. The Company plans to hold a conference call to discuss its results at 4:30 p.m. Eastern Time, which can be accessed by dialing (877) 407-0984 or (201) 689-8577. A live, listen-only webcast and a replay of the call will be available at http://ir.take2games.com/.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005013/en/\n(Investor Relations)\nHenry A. Diamond\nSenior Vice President\nInvestor Relations & Corporate Communications\nAffairs\nTake-Two Interactive Software, Inc.\n(646) 536-3005\nHenry.Diamond@take2games.com\n\n(Corporate Press)\nAlan Lewis\nVice President\nCorporate Communications & Public\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "2K and UnitedMasters Reveal 10 Artists Joining NLE Choppa and Tobe Nwigwe on the NBA 2K20 In-Game Soundtrack",
        "subtitle": "",
        "date": "Dec 17, 2019 10:00AM EST",
        "content": "\nArtists’ original tracks selected by music industry legend Steve Stoute and NBA All-Star Kevin Durant now featured on NBA 2K20 soundtrack\n    NEW YORK--(BUSINESS WIRE)--\n2K and UnitedMasters today announced the 10 winners of a global contest who will have their songs added to the NBA 2K20 in-game soundtrack. Announced in July, the contest gave artists from around the world the chance to submit songs to UnitedMasters for the opportunity to be featured on the in-game soundtrack. This is the first-time users and fans of NBA 2K have been able to submit their own music to be included in an official soundtrack for the video game.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191217005138/en/\n“2K is proud to be a leading music platform for established and up-and-coming artists,” said Alfie Brody, vice president of marketing for NBA 2K. “We strongly feel that music is integral to the NBA 2K experience and we are excited to offer our players a dynamically updated in-game soundtrack, which now includes these aspiring artists.”\n\nThe contest received over 10,000 song submissions from artists throughout the world. 2K and UnitedMasters narrowed the tracks down to a top-25 list with Steve Stoute, UnitedMasters Founder and CEO, and 10x NBA All-Star and 2x NBA Champion, Kevin Durant, selecting the 10 winners to be added to the game.\n\n\"The NBA 2K soundtrack consistently showcases the best artists, and we're excited that these UnitedMasters artists have the opportunity to bring their music to millions of new listeners. We expect that this is just the beginning for these talented musicians,” said Steve Stoute, founder and CEO of UnitedMasters. “We're very proud to work with such a culturally significant and influential game like NBA 2K to showcase these artists and can’t wait for the millions of gamers to hear the next generation of music talent.”\n\n“Music and basketball were always an important part of my life. I think what Steve is doing at UnitedMasters is amazing. If I can help put these talented artists with NBA 2K then it’s all come full circle to music and ball for me,\" said Kevin Durant. \n\nUpon hearing he would be featured on the soundtrack, UM Artist Quantrelle added, \"I thought it was dope because I planned on using a different distribution service to get my music out, but management suggested UnitedMasters and to see what they have done with ‘Momentum’ is a true testament on how UnitedMasters can help propel your career.\"\n\nUM Artist Fourtee reacted upon hearing the news said, “Honestly, it was an out of body experience. It felt unreal, but thank God I have really high expectations for my music.”\n\nThe launch track list for this year’s in-game soundtrack was revealed in July at ComplexCon in Chicago and is available to enjoy in-game and on Spotify. In addition to these 10 songs, the soundtrack will continue to be dynamically updated with new tracks over the coming months.\n\nFollowing are the winning artists/songs and a behind-the-scenes video about the selection process and artists that can be viewed here: https://youtu.be/ePVQQgR8stc.\n\nDeveloped by Visual Concepts, NBA 2K20 is rated E for Everyone by the ESRB. For more information on NBA 2K20, please visit https://nba.2k.com/2k20/.\n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nOnline Account (13+) required to access online features. See www.take2games.com/legal and www.take2games.com/privacy for additional details.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games, 2K Silicon Valley. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated** annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n*According to 2008 - 2019 Metacritic.com\n\nAbout UnitedMasters \n\nLaunched in 2017 by Translation founder and music industry veteran Steve Stoute, UnitedMasters provides a new industry alternative for independent artists. UnitedMasters gives artists access to premium music distribution services, a suite of tools to help them directly connect with fans, and opportunities for unique partnerships with some of the world’s biggest brands. The UnitedMasters platform enables artists to operationalize their independence and maximize their creative and economic potential while allowing them to maintain full ownership over their master recording rights. \n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191217005138/en/\nLeah Barash\n2K\n(415) 317-2047\nleah.barash@2k.com\n\nAaron Bensoua\nFinn Partners\n(310) 418-4389\naaron.bensoua@finnpartners.com\n\nJake Goldman\nUnitedMasters\ndjgoldman@gmail.com\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "2K Announces Newly-Formed Studio – Cloud Chamber™ – Developing Next Iteration in Acclaimed BioShock® Franchise",
        "subtitle": "",
        "date": "Dec 9, 2019 8:00AM EST",
        "content": "\nStudio to establish team across two locations: Novato, Calif. and Montréal, Québec\n    NEW YORK--(BUSINESS WIRE)--\n2K today announced the founding of Cloud Chamber™, the newest, wholly owned game development studio under the Company’s publishing label. A collective of storytellers eager to push the frontlines of interactive entertainment by making unique, entertaining and thoughtful experiences that engage the world, Cloud Chamber will build its team at two locations: 2K’s San Francisco Bay Area headquarters in Novato, Calif., as well as in Montréal, Québec, which marks the first-ever Canadian office for a 2K studio. In addition, 2K announced that Cloud Chamber has started to work on the next iteration of the globally acclaimed BioShock® franchise, which will be in development for the next several years.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191209005224/en/2K today announced the founding of Cloud Chamber™, the newest, wholly owned game development studio under the Company’s publishing label. A collective of storytellers eager to push the frontlines of interactive entertainment by making unique, entertaining and thoughtful experiences that engage the world, Cloud Chamber will build its team at two locations: 2K’s San Francisco Bay Area headquarters in Novato, Calif., as well as in Montréal, Québec, which marks the first-ever Canadian office for a 2K studio. In addition, 2K announced that Cloud Chamber has started to work on the next iteration of the globally acclaimed BioShock® franchise, which will be in development for the next several years. (Photo: Business Wire)\n“As we continue growing our product portfolio, we remain inspired by opportunities to invest further in our valuable IP, great people and their collective, long-term potential,” said David Ismailer, President of 2K. “BioShock is one of the most beloved, critically praised and highest-rated franchises of the last console generation*. We can’t wait to see where its powerful narrative and iconic, first-person shooter gameplay head in the future with our new studio team at Cloud Chamber leading the charge.”\n\nA 22-year industry veteran with more than 40 games shipped to date, Kelley Gilmore will serve as Cloud Chamber’s Global Studio Head and be the first woman in 2K history to launch and lead a development studio. Her wealth of experience transcends executive production, marketing direction and public relations management, including nearly two decades of service to another of 2K’s wholly owned studios, Firaxis Games, on franchises such as Sid Meier’s Civilization® and XCOM®. Her role is based in Novato.\n\n“We founded Cloud Chamber to create yet-to-be-discovered worlds – and their stories within – that push the boundaries of what is possible in the video game medium,” said Kelley Gilmore, Global Studio Head, Cloud Chamber. “Our team believes in the beauty and strength of diversity, in both the makeup of the studio and the nature of its thinking. We are a deeply experienced group of game makers, including many responsible for BioShock’s principal creation, advancement and longstanding notoriety, and honored to be part of the 2K family as stewards of this iconic franchise.”\n\nGilmore has tapped Ken Schachter to be Cloud Chamber’s Studio Manager in Montréal. An executive with extensive experience in development, production, technology and creative roles, Schachter will also be an ambassador for both the studio and 2K in establishing a significant Company presence in Montréal. Prior to joining 2K, Schachter served as General Manager for Zynga in Toronto, as well as founded independent game developer and publisher Trapdoor. He has also held notable positions with companies such as Gameloft, Autodesk and more.\n\nCloud Chamber’s decision to open a new office in Montréal was supported by the Gouvernement du Québec and Montréal International.\n\nCloud Chamber will join the Company’s family of wholly owned development teams, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games and 2K Silicon Valley. Those interested in pursuing career opportunities with the new studio may visit the Cloud Chamber website or 2K Careers for more information.\n\nFor more information on 2K, visit www.2k.com, become a fan on Facebook, follow the Company on Twitter or Instagram or subscribe on YouTube.\n\n* Based on Metacritic.com average ranking across available platforms \n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games, 2K Silicon Valley and Cloud Chamber. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated* annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n*According to 2008 - 2019 Metacritic.com\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at http://www.take2games.com/. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191209005224/en/\nJaime Jensen\n2K\n(415) 507-7910\njaime.jensen@2k.com \n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Ancestors: The Humankind Odyssey Now Available for PlayStation 4 and Xbox One",
        "subtitle": "",
        "date": "Dec 6, 2019 9:00AM EST",
        "content": "\nExperience a wholly unique take on the survival genre with the future of early humankind in the balance\n    NEW YORK--(BUSINESS WIRE)--\nPrivate Division and Panache Digital Games today launched Ancestors: The Humankind Odyssey for PlayStation®4, PlayStation®4 Pro, and across the Xbox One family of devices, including Xbox One X. Ancestors: The Humankind Odyssey is a third-person, exploration, survival game from Panache Digital Games, the independent development studio co-founded in 2014 by Patrice Désilets, the original creative director behind Assassin’s Creed. Previously released on PC in August 2019, Ancestors: The Humankind Odyssey was praised by Comicbook.com as “Truly unique” and “As engrossing as it is dangerous” by Screen Rant.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191206005005/en/Private Division and Squad today announced that Kerbal Space Program Enhanced Edition: Breaking Ground Expansion is now available for PlayStation®4, PlayStation®4 Pro and across the Xbox One family of devices, including Xbox One X. This highly- anticipated second expansion for Kerbal Space Program Enhanced Edition, brings plenty of fresh content for new and current players on console. The fan-favorite expansion Kerbal Space Program: Breaking Ground previously launched on PC in May 2019. (Photo: Business Wire)\nAncestors: The Humankind Odyssey opens at the dawn of humankind and tasks you with a monumental challenge to ensure your clan’s survival through an evolution of millions of years. You will face numerous deadly predators as you explore the game’s multiple biomes. Take advantage of the canopy of the jungle to swing between treetops as you develop your survival skills to prevail. By carefully decoding the world around you, your character will begin to understand how to best use the natural environment to your advantage. For example, after proper manipulation a stick can become a spear to ward off predators, and certain plants become powerful preventatives to combat various poisons or ailments.\n\n“Ancestors is very much a story that is co-written by the player,” said Patrice Désilets, Co-Founder and Creative Director of Panache Digital Games. “We created a world in which you are free to explore and develop this narrative that you control. It’s intentionally challenging, and we give players great freedom to explore and learn on their own, which makes each discovery and accomplishment incredibly rewarding.”\n\nBy analyzing your surroundings, interacting with various objects and creatures, communicating with your clan, and performing physical feats, you will grow the powers of the neuronal network, a system which provides a role-playing system to augment your traits and abilities. You may opt to develop the skill for advanced motor functions, or improve your hominid’s ability to become more resilient. There is a plethora of choices in this evolutionary path, and your choices ultimately determine the preservation of your clan. In Ancestors: The Humankind Odyssey, the journey rests in your hands. You decide how to evolve your clan and if the fiction will be one of prey or predator by how you play the game.\n\n“Ancestors: The Humankind Odyssey pushes new boundaries in gaming and is a worthy addition to anyone’s library,” said Allen Murray, Head of Production at Private Division. “It was built by a small team, yet remains ambitious and will provide a unique experience that no other game out now can.”\n\nAncestors: The Humankind Odyssey is available now digitally across the Xbox One family of devices, including Xbox One X, PlayStation®4, PlayStation®4 Pro, and PC via the Epic Games Store for $39.99. Ancestors: The Humankind Odyssey is rated T for Teen by the ESRB. For more information on Ancestors: The Humankind Odyssey, subscribe on YouTube, follow on Twitter, become a fan on Facebook, and visit www.AncestorsGame.com.\n\nPrivate Division is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ:TTWO).\n\nAbout Panache Digital Games\n\nPanache Digital Games is a Montreal-based independent development studio cofounded in 2014 by acclaimed creative director Patrice Désilets and his acolyte Jean-François Boivin. With a team of industry veterans, Panache Digital Games aims to deliver the very best quality experience for fans with games that are beautiful, original and fun. Pushing boundaries and thinking outside the box is in the team’s DNA and the way we make games is a reflection of that. For more information, please visit our website www.panachedigitalgames.com.\n\nAbout Private Division\n\nPrivate Division is a developer-focused publisher that empowers independent studios to develop the games that they are passionate about creating, while providing the support that they need to make their titles critically and commercially successful on a global scale. The label publishes the Kerbal Space Program franchise, Ancestors: The Humankind Odyssey from Panache Digital Games, and The Outer Worlds from Obsidian Entertainment, and will publish upcoming titles with renowned creative talent at studios including Disintegration from V1 Interactive, Kerbal Space Program 2 from Star Theory Games, and more. Private Division is headquartered in New York City with offices in Seattle, Las Vegas, and Munich. For more information, please visit www.privatedivision.com.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191206005005/en/\nJeremy Gumber (Press)\nSenior Manager\nCommunications\nPrivate Division\n(646) 536-3006\npress@privatedivision.com\n\nAlan Lewis (Corporate Press)\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Kerbal Space Program Enhanced Edition: Breaking Ground Expansion Now Available for PlayStation 4 and Xbox One",
        "subtitle": "",
        "date": "Dec 5, 2019 9:00AM EST",
        "content": "\nRobust expansion adds new robotic parts, additional ways to collect scientific data, and exciting surface features to the critically acclaimed space-flight sim\n    NEW YORK--(BUSINESS WIRE)--\nPrivate Division and Squad today announced that Kerbal Space Program Enhanced Edition: Breaking Ground Expansion is now available for PlayStation®4, PlayStation®4 Pro and across the Xbox One family of devices, including Xbox One X. This highly- anticipated second expansion for Kerbal Space Program Enhanced Edition, brings plenty of fresh content for new and current players on console. The fan-favorite expansion Kerbal Space Program: Breaking Ground previously launched on PC in May 2019.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191205005017/en/Private Division and Squad today announced that Kerbal Space Program Enhanced Edition: Breaking Ground Expansion is now available for PlayStation®4, PlayStation®4 Pro and across the Xbox One family of devices, including Xbox One X. This highly- anticipated second expansion for Kerbal Space Program Enhanced Edition, brings plenty of fresh content for new and current players on console. The fan-favorite expansion Kerbal Space Program: Breaking Ground previously launched on PC in May 2019. (Photo: Business Wire)\n“These new features were highly-praised on PC, and we are very excited to bring this expansion to all our console players,” said Nestor Gomez, Lead Producer at Squad. “Kerbal Space Program Enhanced Edition: Breaking Ground enriches their experience by providing tons of new ways to venture across the celestial bodies of the solar system.”\n\nKerbal Space Program Enhanced Edition: Breaking Ground Expansion brings several new features to improve players’ gameplay experience. The expansion introduces a variety of all new robotic parts in various useful shapes and sizes, including hinges, rotors, pistons, and more. The addition of these new parts allows players to expand beyond their capabilities in the original Kerbal Space Program Enhanced Edition by providing the ability to create more complex vehicles and vessels than ever before.\n\nAdditionally, players now have an entirely new way to harness collected data from celestial bodies through Deployed Science. This feature provides a modular storage container on their vessel that allows Kerbals to hold various tools such as seismometers, weather collection stations, and more. These instruments can be constructed on planetary surfaces to relay information back to the Kerbal’s home planet, increasing the Kerbals’ understanding of their solar system.\n\nKerbal Space Program Enhanced Edition: Breaking Ground Expansion also changes the experience players have when exploring celestial bodies. New surface features are scattered across planets throughout the system and can be analyzed with a new robotic arm attached to rovers. These surface features include cryovolcanoes, meteorites, craters, and many more mysterious objects for players to investigate. Additionally, the expansion includes a new, futuristic space suit that is included in the expansion so Kerbals can travel to space in style.\n\n“Kerbal Space Program has been effective in opening up minds to the initial understandings of exploring space, as well as enjoying widespread critical success, with many hailing it as one of the best science-focused games available,” said Michael Cook, Executive Producer at Private Division. “By continuing to update the game and provide high-quality, great KSP content, we bring in more players and pique their interest in the science behind it all.”\n\nAbout Kerbal Space Program\n\nIn Kerbal Space Program Enhanced Edition, you take charge of the space program for the alien race known as the Kerbals. You have access to an array of parts to assemble a fully functional spacecraft that flies (or doesn’t) based on realistic aerodynamic and orbital physics. Launch your Kerbal crew into orbit and beyond (while keeping them alive) to explore moons and planets in the Kerbolar solar system, constructing bases and space stations to expand the reach of your expedition.\n\nKerbal Space Program features three gameplay modes. In Science Mode, perform space experiments to unlock new technology and advance the knowledge of Kerbalkind. In Career Mode, also oversee every aspect of the space program, including construction, strategy, funding, upgrades, and more. In Sandbox, build any spacecraft you can think of, with all parts and technology in the game.\n\nKerbal Space Program: Breaking Ground Expansion is now available for Xbox One and PlayStation®4 as well as for PC for $14.99 (MSRP). Kerbal Space Program is rated E for Everyone by the ESRB. For more information on Kerbal Space Program, subscribe on YouTube, follow us on Twitter, become a fan on Facebook, and visit www.KerbalSpaceProgram.com.\n\nPrivate Division is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ:TTWO).\n\nAbout Squad\n\nBased in Mexico City, Squad are the developers of the critically acclaimed space simulation game, Kerbal Space Program. Comprised of an international team of talented, passionate and ambitious individuals that love video games, space, and science, they have reinvented themselves into full-time video game development.\n\nAbout Private Division\n\nPrivate Division is a developer-focused publisher that empowers independent studios to develop the games that they are passionate about creating, while providing the support that they need to make their titles critically and commercially successful on a global scale. The label publishes the Kerbal Space Program franchise, Ancestors: The Humankind Odyssey from Panache Digital Games, and The Outer Worlds from Obsidian Entertainment, and will publish upcoming titles with renowned creative talent at studios including Disintegration from V1 Interactive, Kerbal Space Program 2 from Star Theory Games, and more. Private Division is headquartered in New York City with offices in Seattle, Las Vegas, and Munich. For more information, please visit www.privatedivision.com.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005017/en/\nJeremy Gumber (Press)\nAssistant Manager\nCommunications\nPrivate Division\n(646) 536-3006\npress@privatedivision.com\n\nAlan Lewis (Corporate Press)\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "2K Announces $500,000 Donation to The Leukemia & Lymphoma Society®",
        "subtitle": "",
        "date": "Nov 26, 2019 8:00AM EST",
        "content": "    NEW YORK--(BUSINESS WIRE)--\n2K today announced that the Company will donate $500,000 to The Leukemia & Lymphoma Society® (LLS) as the culmination of a partnership and fan activation surrounding the launch of WWE® 2K20 earlier this fall. The donation will support breakthrough blood cancer research to advance lifesaving treatments and critical support for patients and their families.\n\n2K announced a partnership with LLS in September, aligning with the Company’s selection of WWE 2K20 cover Superstar and leukemia survivor Roman Reigns™. The combined efforts of 2K, WWE and Reigns will support LLS’s mission, including its new Children’s Initiative, a comprehensive effort to take on pediatric cancer through more research grants and expanded free education and support services. 2K issued a call to action via the WWE Games Twitter account, urging consumers to retweet and spread the LLS message, as well as the donation link, with a maximum donation commitment of $500,000. The Company is happy to now confirm that the maximum amount of $500,000 will be donated.\n\n“We are proud of the support our fans have shown to The Leukemia & Lymphoma Society,” said Chris Snyder, Vice President of Marketing for 2K. “With their retweets and personal contributions, our partnership with this great patient advocacy organization enables us to give back in a meaningful way and help save lives.”\n\nIn addition to its financial commitment, 2K will provide copies of Company-published video games to blood cancer patients, as well as coordinate visits with 2K personnel and WWE Superstars to LLS hospital partners. 2K previously hosted LLS leaders, patients and their families at a WWE 2K20 promotional event in Las Vegas in October, giving them an opportunity to play WWE 2K20 prior to its release. The attendees also met several WWE Superstars, including WWE 2K20 cover Superstars Roman Reigns and Becky Lynch ®.\n\n“I was honored to be among the first to preview this exciting new WWE 2K offering, and to personally thank 2K’s executives for their support for LLS,” stated Louis J. DeGennaro, PhD, LLS President and Chief Executive Officer. “We are grateful to our partners at WWE and Roman Reigns for introducing us to 2K and their legions of fans, as we aim to create widespread awareness for our mission, and our significant investment in cutting-edge research to advance new treatments and cures for cancer patients, including children with cancer and their parents.”\n\nDeveloped by Visual Concepts, a 2K studio, WWE 2K20 is rated “T” for Teen by the ESRB. WWE 2K20 is now available worldwide for the PS4™ system, Xbox One and Windows PC. For more information on WWE 2K20 and 2K, visit wwe.2k.com, become a fan on Facebook, follow the game on Twitter and Instagram using the hashtag #WWE2K20 or subscribe on YouTube.\n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nAbout WWE\n\nWWE, a publicly traded company (NYSE: WWE), is an integrated media organization and recognized leader in global entertainment. The company consists of a portfolio of businesses that create and deliver original content 52 weeks a year to a global audience. WWE is committed to family-friendly entertainment on its television programming, pay-per-view, digital media and publishing platforms. WWE’s TV-PG, family-friendly programming can be seen in more than 800 million homes worldwide in 28 languages. WWE Network, the first-ever 24/7 over-the-top premium network that includes all live pay-per-views, scheduled programming and a massive video-on-demand library, is currently available in more than 180 countries. The company is headquartered in Stamford, Conn., with offices in New York, Los Angeles, London, Mexico City, Mumbai, Shanghai, Singapore, Dubai, Munich and Tokyo.\n\nAdditional information on WWE (NYSE: WWE) can be found at wwe.com and corporate.wwe.com. For information on our global activities, go to http://www.wwe.com/worldwide/.\n\nTrademarks: All WWE programming, talent names, images, likenesses, slogans, wrestling moves, trademarks, logos and copyrights are the exclusive property of WWE and its subsidiaries. All other trademarks, logos and copyrights are the property of their respective owners.\n\nForward-Looking Statements:\n\nThis press release contains forward-looking statements pursuant to the safe harbor provisions of the Securities Litigation Reform Act of 1995, which are subject to various risks and uncertainties. These risks and uncertainties include, without limitation, risks relating to: entering, maintaining and renewing major distribution and event agreements; WWE Network (including the risk that we are unable to attract, retain and renew subscribers); our need to continue to develop creative and entertaining programs and events; the possibility of a decline in the popularity of our brand of sports entertainment; the continued importance of key performers and the services of Vincent K. McMahon; possible adverse changes in the regulatory atmosphere and related private sector initiatives; the highly competitive, rapidly changing and increasingly fragmented nature of the markets in which we operate and greater financial resources or marketplace presence of many of our competitors; uncertainties associated with international markets including possible disruptions and reputational risks; our difficulty or inability to promote and conduct our live events and/or other businesses if we do not comply with applicable regulations; our dependence on our intellectual property rights, our need to protect those rights, and the risks of our infringement of others’ intellectual property rights; the complexity of our rights agreements across distribution mechanisms and geographical areas; potential substantial liability in the event of accidents or injuries occurring during our physically demanding events including, without limitation, claims alleging traumatic brain injury; large public events as well as travel to and from such events; our feature film business; our expansion into new or complementary businesses and/or strategic investments; our computer systems and online operations; privacy norms and regulations; a possible decline in general economic conditions and disruption in financial markets; our accounts receivable; our indebtedness including our convertible notes; litigation; our potential failure to meet market expectations for our financial performance, which could adversely affect our stock; Vincent K. McMahon exercises control over our affairs, and his interests may conflict with the holders of our Class A common stock; a substantial number of shares are eligible for sale by the McMahons and the sale, or the perception of possible sales, of those shares could lower our stock price; and the volatility of our Class A common stock. In addition, our dividend is dependent on a number of factors, including, among other things, our liquidity and historical and projected cash flow, strategic plan (including alternative uses of capital), our financial results and condition, contractual and legal restrictions on the payment of dividends (including under our revolving credit facility), general economic and competitive conditions and such other factors as our Board of Directors may consider relevant. Forward-looking statements made by the Company speak only as of the date made and are subject to change without any obligation on the part of the Company to update or revise them. Undue reliance should not be placed on these statements. For more information about risks and uncertainties associated with the Company’s business, please refer to the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors” sections of the Company’s SEC filings, including, but not limited to, our annual report on Form 10-K and quarterly reports on Form 10-Q.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games and 2K Silicon Valley. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated* annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n*According to 2008 - 2019 Metacritic.com\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at http://www.take2games.com/. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\n\nAbout the Leukemia & Lymphoma Society\n\nThe Leukemia & Lymphoma Society® (LLS) is a global leader in the fight against cancer. The LLS mission: Cure leukemia, lymphoma, Hodgkin's disease and myeloma, and improve the quality of life of patients and their families. LLS funds lifesaving blood cancer research around the world, provides free information and support services, and is the voice for all blood cancer patients seeking access to quality, affordable, coordinated care.\n\nFounded in 1949 and headquartered in Rye Brook, NY, LLS has chapters throughout the United States and Canada. To learn more, visit www.LLS.org. Patients should contact the Information Resource Center at (800) 955-4572, Monday through Friday, 9 a.m. to 9 p.m. ET.\n\nFor additional information visit lls.org/lls-newsnetwork. Follow us on Facebook, Twitter, and Instagram.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191126005159/en/\nAl Stavola\n2K\n(415) 483-8453\nal.stavola@2k.com\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\n\nNathan Rillo\nFINN Partners for 2K\n(310) 552-4145\nnathan.rillo@finnpartners.com\n\nMark Vasquez\nWWE\n(203) 352-1521\nmark.vasquez@wwecorp.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Sid Meier’s Civilization® VI Now Available on Xbox One and PlayStation®4",
        "subtitle": "",
        "date": "Nov 22, 2019 8:00AM EST",
        "content": "\nLegendary strategy franchise returns to Xbox and PS4™ system;\n\nRise and Fall and Gathering Storm expansions available in separate single bundle\n    NEW YORK--(BUSINESS WIRE)--\n2K today announced that Sid Meier’s Civilization® VI is now available worldwide for the Xbox One family of devices including the Xbox One X, as well as the PlayStation®4 system. Winner of The Game Awards’ Best Strategy Game and DICE Awards’ Best Strategy Game in 2016, Civilization VI’s release on Xbox One and PS4™ system ushers in a new era of strategy games on consoles where players attempt to build empires to stand the test of time.\n\nIn Civilization VI, you will explore a new land, research technology, conquer your enemies and go head-to-head with history’s most renowned leaders as you attempt to build the greatest civilization the world has ever known. Civilization VI on Xbox One and PS4™ system includes many features, such as:\n\nAlso launching today, is the Civilization VI Expansion Bundle for Xbox One, PS4™ system and Nintendo Switch™ system. The Civilization VI Expansion Bundle, which combines both the Rise and Fall and Gathering Storm expansions, takes the turn-based strategy classic to new heights. With 16 new civilizations, 18 new leaders and major enhancements to gameplay, such as Great Ages and natural disasters influenced by the player’s impact on the living planet, the pursuit of building the greatest empire is as exciting as ever.\n\nThe base game is available for $59.99 SRP, while the separate Civilization VI Expansion Bundle is available for $49.99 SRP. On iOS, the Gathering Storm expansion is also now available for $39.99 SRP.\n\nOriginally developed for Windows PC by Firaxis Games, Sid Meier’s Civilization VI was developed in collaboration with Aspyr to bring the beloved franchise to Xbox One and PS4™ system. Sid Meier’s Civilization VI is rated E10+ for Everyone 10 and up by the ESRB and is now available on Windows PC, Xbox One, PS4™ system, Nintendo Switch system, iPhone, iPad, Mac and Linux.\n\nFor more information on Sid Meier’s Civilization VI, visit www.civilization.com, become a fan on Facebook, subscribe on YouTube, follow Civilization on Twitter and Instagram or join the conversation using the hashtag #OneMoreTurn.\n\n*27 total leaders for PS4™ system version of Civilization VI\n\nFiraxis Games is a 2K studio. 2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nNintendo Switch is a trademark of Nintendo.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games and 2K Silicon Valley. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated* annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n*According to 2008 - 2019 Metacritic.com\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at http://www.take2games.com/. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191122005022/en/\nMatt Chang\n2K\n(415) 507-7594\nmatt.chang@2k.com\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Take-Two Interactive Software, Inc. Reports Strong Results for Fiscal Second Quarter 2020",
        "subtitle": "",
        "date": "Nov 7, 2019 4:05PM EST",
        "content": "\nGAAP net revenue grew 74% to $857.8 million\n\nGAAP net income per diluted share grew 186% to $0.63 \n\nGAAP net cash provided by operating activities for the six-months ended September 30, 2019 increased to $144.2 million\n\nAdjusted Unrestricted Operating Cash Flow (Non-GAAP) for the six-months ended September 30, 2019 increased to $41.2 million\n\nNet Bookings grew 63% to $950.5 million\n\nCompany raises operating outlook for fiscal year 2020\n    NEW YORK--(BUSINESS WIRE)--\nTake-Two Interactive Software, Inc. (NASDAQ:TTWO) today reported strong results for its fiscal second quarter 2020 ended September 30, 2019. In addition, the Company provided its initial outlook for its fiscal third quarter ending December 31, 2019, and raised its operating outlook for its fiscal year ending March 31, 2020. For additional information, please see the fiscal second quarter 2020 results slide deck posted to the Company’s investor relations website at http://ir.take2games.com.\n\nFiscal Second Quarter 2020 Financial Highlights\n\nGAAP net revenue grew 74% to $857.8 million, as compared to $492.7 million in last year’s fiscal second quarter. Recurrent consumer spending (which is generated from ongoing consumer engagement and includes virtual currency, add-on content and in-game purchases) increased 32% and accounted for 37% of total GAAP net revenue. The largest contributors to GAAP net revenue in fiscal second quarter 2020 were Borderlands® 3; NBA® 2K20 and NBA 2K19; Grand Theft Auto® Online and Grand Theft Auto V; Red Dead Redemption 2 and Red Dead Online; Social Point’s mobile offerings; and WWE® 2K19 and WWE SuperCard.\n\nDigitally-delivered GAAP net revenue grew 72% to $615.8 million, as compared to $358.4 million in last year’s fiscal second quarter, and accounted for 72% of total GAAP net revenue. The largest contributors to GAAP digitally-delivered net revenue in fiscal second quarter 2020 were NBA 2K20 and NBA 2K19; Borderlands 3; Grand Theft Auto Online and Grand Theft Auto V; Red Dead Redemption 2 and Red Dead Online; Social Point’s mobile offerings; and WWE 2K19 and WWE SuperCard.\n\nGAAP net income was $71.8 million, or $0.63 per diluted share, as compared to $25.4 million, or $0.22 per diluted share, for the comparable period last year.\n\nDuring the 6-month period ended September 30, 2019, GAAP net cash provided by (used in) operating activities increased to $144.2 million, as compared to ($206.0) million in the same period last year. During the 6-month period ended September 30, 2019, Adjusted Unrestricted Operating Cash Flow (Non-GAAP), which is defined as GAAP net cash from operating activities, adjusted for changes in restricted cash, increased to $41.2 million, as compared to ($139.4) million in the same period last year (please see the section below titled “Non-GAAP Financial Measure” for additional information). As of September 30, 2019, the Company had cash and short-term investments of $1.505 billion.\n\nThe following data, together with a management reporting tax rate of 17%, are used internally by the Company’s management and Board of Directors to adjust the Company’s GAAP financial results in order to facilitate comparison of its operating performance between periods and to better understand its core business and future outlook:\n\nIn order to calculate net income per diluted share for management reporting purposes, the Company uses its fully diluted share count of 114.1 million.\n\nOperational Metric – Net Bookings\n\nNet Bookings is defined as the net amount of products and services sold digitally or sold-in physically during the period, and includes licensing fees, merchandise, in-game advertising, strategy guides and publisher incentives.\n\nDuring fiscal second quarter 2020, total Net Bookings grew 63% to $950.5 million, as compared to $583.4 million during last year’s fiscal second quarter. Net Bookings from recurrent consumer spending grew 39% and accounted for 45% of total Net Bookings. The largest contributors to Net Bookings in fiscal second quarter 2020 were NBA 2K20 and NBA 2K19; Borderlands 3; Grand Theft Auto Online and Grand Theft Auto V; Red Dead Redemption 2 and Red Dead Online; Social Point’s mobile offerings; and WWE SuperCard and WWE 2K19.\n\nCatalog accounted for $372.1 million of Net Bookings led by Grand Theft Auto, NBA 2K, Red Dead Redemption, and Social Point’s mobile offerings.\n\nDigitally-delivered Net Bookings grew 63% to $695.3 million, as compared to $426.2 million in last year’s fiscal second quarter, and accounted for 73% of total Net Bookings. The largest contributors to digitally-delivered Net Bookings in fiscal second quarter 2020 were NBA 2K20 and NBA 2K19; Grand Theft Auto Online and Grand Theft Auto V; Borderlands 3; Red Dead Redemption 2 and Red Dead Online; Social Point’s mobile offerings; and WWE SuperCard and WWE 2K19.\n\nManagement Comments\n\n“Our positive momentum continued in the second quarter, enabling our Company to generate operating results that significantly exceeded our expectations,” said Strauss Zelnick, Chairman and CEO of Take-Two. “We delivered strong Net Bookings, cash flow and earnings growth, fueled by the performance of NBA 2K, Borderlands 3, Grand Theft Auto Online and Grand Theft Auto V, and Red Dead Redemption 2 and Red Dead Online. Once again, our strategy of creating the highest-quality entertainment in the industry translated into outstanding results.\n\n“As a result of our better-than-expected second quarter operating results, we are once again raising our operating outlook for fiscal 2020. The third quarter is off to a solid start with the launches of The Outer Worlds, Red Dead Redemption 2 for PC and WWE 2K20, and we will bolster our holiday line-up with offerings for Google Stadia and Sid Meier’s Civilization VI for PlayStation 4 and Xbox One. Throughout the fiscal year, we will continue to support our titles with experiences designed to captivate audiences and drive ongoing engagement, including new content for Grand Theft Auto Online and Red Dead Online.\n\n“Looking ahead, Take-Two has the strongest development pipeline in its history, including sequels from our biggest franchises as well as exciting new IP. We are actively investing in emerging markets, platforms and business models, and are exceedingly well positioned to capitalize on the positive trends in our industry and to generate growth and margin expansion over the long-term.”\n\nBusiness and Product Highlights\n\nSince July 1, 2019:\n\nRockstar Games:\n\n2K:\n\nPrivate Division:\n\n* According to 2000 - 2019 Metacritic.com and Gamerankings.com.\n\nOutlook for Fiscal 2020\n\nTake-Two is providing its initial outlook for its fiscal third quarter ending December 31, 2019 and is raising its operating outlook for the fiscal year ending March 31, 2020:\n\nThird Quarter Ending December 31, 2019\n\nThe Company is also providing selected data and its management reporting tax rate of 17%, which are used internally by its management and Board of Directors to adjust the Company’s GAAP financial outlook in order to facilitate comparison of its operating performance between periods and to better understand its core business and future outlook:\n\nFiscal Year Ending March 31, 2020\n\nThe Company is also providing selected data and its management reporting tax rate of 17%, which are used internally by its management and Board of Directors to adjust the Company’s GAAP financial outlook in order to facilitate comparison of its operating performance between periods and to better understand its core business and future outlook:\n\nKey assumptions and dependencies underlying the Company’s outlook include: the timely delivery of the titles included in this financial outlook; continued consumer acceptance of Xbox One and PlayStation 4; the ability to develop and publish products that capture market share for these current generation systems while also leveraging opportunities on PC, mobile and other platforms; and stable foreign exchange rates. See also “Cautionary Note Regarding Forward Looking Statements” below.\n\nProduct Releases\n\nThe following titles were released since July 1, 2019:\n\nConference Call\n\nTake-Two will host a conference call today at 4:30 p.m. Eastern Time to review these results and discuss other topics. The call can be accessed by dialing (877) 407-0984 or (201) 689-8577. A live listen-only webcast of the call will be available by visiting http://ir.take2games.com and a replay will be available following the call at the same location.\n\nNon-GAAP Financial Measure \n\nIn addition to reporting financial results in accordance with U.S. generally accepted accounting principles (GAAP), the Company uses a Non-GAAP measure of financial performance: Adjusted Unrestricted Operating Cash Flow, which is defined as GAAP net cash from operating activities, adjusted for changes in restricted cash. The Company’s management believes it is important to consider Adjusted Unrestricted Operating Cash Flow, in addition to net cash from operating activities, as it provides more transparency into current business trends without regard to the timing of payments from restricted cash, which is primarily related to a dedicated account limited to the payment of certain internal royalty obligations.\n\nThis Non-GAAP financial measure is not intended to be considered in isolation from, as a substitute for, or superior to, GAAP results. This Non-GAAP financial measure may be different from similarly titled measures used by other companies. In the future, Take-Two may also consider whether other items should also be excluded in calculating this Non-GAAP financial measure used by the Company. Management believes that the presentation of this Non-GAAP financial measure provides investors with additional useful information to measure Take-Two's financial and operating performance. In particular, this measure facilitates comparison of our operating performance between periods and may help investors to understand better the operating results of Take-Two. Internally, management uses this Non-GAAP financial measure in assessing the Company's operating results and in planning and forecasting. A reconciliation of this Non-GAAP financial measure to the most comparable GAAP measure is contained in the financial tables to this press release.\n\nFinal Results\n\nThe financial results discussed herein are presented on a preliminary basis; final data will be included in Take-Two’s Quarterly Report on Form 10-Q for the period ended September 30, 2019.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements \n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191107005978/en/\n(Investor Relations)\nHenry A. Diamond\nSenior Vice President\nInvestor Relations & Corporate Communications\nTake-Two Interactive Software, Inc.\n(646) 536-3005\nHenry.Diamond@take2games.com\n\n(Corporate Press)\nAlan Lewis\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Red Dead Redemption 2 Now Available for PC",
        "subtitle": "",
        "date": "Nov 5, 2019 9:00AM EST",
        "content": "    NEW YORK--(BUSINESS WIRE)--\nRockstar Games® is proud to announce that Red Dead Redemption 2 is now available for the PC. Originally released on October 26, 2018, Red Dead Redemption 2 for the PlayStation®4 and Xbox One was a critical and commercial success with approximately 25 million copies sold-in worldwide and remains the highest rated game of the current console generation*.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191105005403/en/Rockstar Games® is proud to announce that Red Dead Redemption 2 is now available for the PC. Originally released on October 26, 2018, Red Dead Redemption 2 for the PlayStation®4 and Xbox One was a critical and commercial success with approximately 25 million copies sold-in worldwide and remains the highest rated game of the current console generation. (Graphic: Business Wire)\nThe first game in the Red Dead Redemption series to be featured on the PC platform, Red Dead Redemption 2 for PC debuts with a range of graphical and technical enhancements to bring new life and detail to the story of Arthur Morgan and the Van Der Linde gang, on the run from the law across America in the final days of the 19th Century. Red Dead Redemption 2 for PC also includes new content for Story mode, including new Bounty Hunting Missions, Gang Hideouts, Weapons and more, plus a fully-featured photo mode for players to capture and share their favorite moments from the game.\n\nPre-release media previews have been outstanding:\n\nRed Dead Redemption 2 for PC also includes free access to the shared living world of Red Dead Online, featuring all previously released improvements and the latest content updates for the complete online experience, including Frontier Pursuits and the specialist Roles of Bounty Hunter, Trader and Collector for players to progress through and earn unique rewards.\n\nRed Dead Redemption 2 is available for purchase via the Rockstar Games Launcher and at the Epic Games Store, Greenman Gaming, the Humble Store, GameStop and additional digital retailers. Red Dead Redemption 2 for PC will also be available to purchase on Steam this December.\n\nAbout Red Dead Redemption 2\n\nRed Dead Redemption 2 is the highest-rated game of the current console generation with over 250 perfect scores and more than 175 Game of the Year Awards, having achieved the single-biggest opening weekend in the history of entertainment**. With over $725 million in worldwide retail sell-through during its first three days, Red Dead Redemption 2 is the second-highest grossing entertainment launch of all time next to Rockstar Games’ previously released title, Grand Theft Auto V, which achieved over $1 billion in retail sell-through in three days.*\n\nRed Dead Redemption 2 is rated M for Mature by the ESRB. For more information, please visit www.rockstargames.com/reddeadredemption2.\n\n*According to Metacritic 2018-2019.\n\n**Red Dead Redemption 2 launched on a Friday so that its ‘opening weekend’ (Friday, Saturday and Sunday) is the same as its first three days, while Grand Theft Auto V launched on a Tuesday.\n\nAbout Rockstar Games\n\nRockstar Games cemented their reputation as creators of complex living worlds with the Grand Theft Auto series, one of the most successful entertainment properties of all time with over 270 million units sold-in worldwide. Through a string of critically acclaimed games including the Grand Theft Auto series, the Red Dead Redemption series, the Max Payne series, Bully, L.A. Noire, the Midnight Club series and The Warriors, Rockstar Games has helped propel interactive entertainment into the center of modern culture.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191105005403/en/\nSimon Ramsey\nRockstar Games\n(212) 334-6633\nSimon.Ramsey@rockstargames.com\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com \nSource: Take-Two Interactive"
    },
    {
        "title": "The Outer Worlds is Now Available Worldwide",
        "subtitle": "",
        "date": "Oct 25, 2019 8:00AM EDT",
        "content": "\nThe character you decide to become determines how this dark and witty single-player sci-fi RPG from Obsidian Entertainment and Private Division unfolds\n    NEW YORK--(BUSINESS WIRE)--\nToday, Private Division and Obsidian Entertainment are proud to announce that The Outer Worlds is now available across the Xbox One family of devices, including Xbox One X, PlayStation®4, PlayStation®4 Pro, and Windows PC*, and will be coming to Nintendo Switch in 2020. The Outer Worlds won the best original game at E3 2019 and is developed by co-game directors Tim Cain and Leonard Boyarsky, original creators of Fallout, who reunited for this thrilling new single-player RPG, and from the renowned team at Obsidian, developers of Fallout: New Vegas, Star Wars: Knights of the Old Republic II, South Park: The Stick of Truth, and the Pillars of Eternity franchise.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191025005010/en/Private Division and Obsidian Entertainment are proud to announce that The Outer Worlds is now available across the Xbox One family of devices, including Xbox One X, PlayStation®4, PlayStation®4 Pro, and Windows PC*, and will be coming to Nintendo Switch in 2020. The Outer Worlds won the best original game at E3 2019 and is developed by co-game directors Tim Cain and Leonard Boyarsky, original creators of Fallout, who reunited for this thrilling new single-player RPG, and from the renowned team at Obsidian, developers of Fallout: New Vegas, Star Wars: Knights of the Old Republic II, South Park: The Stick of Truth, and the Pillars of Eternity franchise. (Graphic: Business Wire)\nThe Outer Worlds has already earned significant praise from critics:\n\n“A tremendous achievement from one of the most accomplished developers of the genre”\n– The Daily Dot, 4.5 out of 5\n\n“The most-promising new IP in years” – Windows Central, 4.5 out of 5\n\n“An excellent space Western adventure” – GameSpot, 9 out of 10\n\n“One of the best games of 2019” – DualShockers, 9.5 out of 10\n\n“A hallmark of excellence” – Destructoid, 9 out of 10\n\n“Brilliant” – Game Informer, 9.25 out of 10\n\n“Impressive” – EGM, 5 out of 5\n\nIn The Outer Worlds, you awake from hibernation after drifting in space for seventy years on a lost colonist ship, the Hope. Here at the edge of the galaxy, corporations control all aspects of life in Halcyon, and they are hiding a dark secret that could destroy the colony. As you explore multiple, distinct locations in the game’s vibrant world, you will encounter various factions, and meet a host of multi-faceted characters who may offer assistance in your missions. But choose carefully, as the actions and choices you make will determine how this player-driven story unfolds. Your choices affect not only the game’s narrative, but your character progression, companion stories, and different endgame scenarios.\n\n“When we set out to create a new RPG universe for players to explore, meaningful player choice was at the core of everything we wanted to build,” said Tim Cain, co-game director at Obsidian. “The Outer Worlds is our love letter to fans who want to role play as any character they’d like, whether it’s a hero, a villain, or even Leonard Boyarsky.”\n\nIn addition to fluidity in conversation, there are multiple ways to handle combat in The Outer Worlds. Players can augment their stealth skills and don a holographic disguise and slip unnoticed past watchful guards; enhance one’s engineering skills and take control of security systems to distract the enemy; or players can take a direct approach with head-on combat, and wield melee weapons, a host of firearms, or a variety of sci-fi weapons including the Shrink Ray, all to dominate the opposition.\n\n“Player choice in The Outer Worlds extends beyond the decisions players will make narratively, it applies to how players approach the gameplay as well,” said Leonard Boyarsky, co-game director at Obsidian. “It was important for us to create an experience where players can not only enjoy shooting their way through the game with a bunch of crazy science weapons, but also have an equally enjoyable experience if they opt to avoid combat by focusing on dialogue or stealth. No matter what your play style, even if it’s ridiculous as how Tim Cain plays, there’s a great way to experience The Outer Worlds.”\n\nPlayers will meet a variety of companions throughout the Halcyon colony, each of them with their own storyline and unique skills to aid the player in combat, and boost stats during conversations to unlock new dialogue options. These companions open new paths in a multitude of ways to play The Outer Worlds.\n\n“With The Outer Worlds, Tim, Leonard, and the entire team at Obsidian Entertainment once again demonstrate why they’re among the best developers of roleplaying games in the industry,” said Michael Worosz, executive vice president and head of Private Division. “The fantastic narrative, dark humor, and engaging combat set in an all-new sci-fi universe dripping with character, combine in an excellent single-player RPG that players have been asking for.”\n\nCheck out The Outer Worlds official launch trailer on YouTube now.\n\nThe Outer Worlds is available now for $59.99 physically and digitally for Xbox One and PS4™ system, and digitally for Windows PC through the Epic Games Store and Microsoft Store*. The Outer Worlds is also available with Xbox Game Pass for Console and PC. The Outer Worlds is coming to Nintendo Switch in 2020. The Outer Worlds is rated M for mature by the ESRB. More information can be found by subscribing on YouTube, following on Twitter, by becoming a fan on Facebook, and visiting www.TheOuterWorlds.com.\n\n*The Outer Worlds is available digitally on Windows PC through the Epic Games Store and Microsoft Store for the first year, at which point it will come to additional digital PC retailers.\n\nPrivate Division is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ:TTWO).\n\nAbout Obsidian\n\nObsidian Entertainment specializes in creating the world's most beloved interactive role-playing games including Fallout: New Vegas, South Park: The Stick of Truth, Alpha Protocol, Star Wars: Knights of the Old Republic II: The Sith Lords, the Pillars of Eternity franchise, and the recently released The Outer Worlds. Founded by veterans of Black Isle Studios, with roots in Icewind Dale, Planescape: Torment, Fallout, and Fallout 2, Obsidian continues its commitment to deliver to fans and newcomers alike the most compelling RPGs its wildly creative developers can imagine as part of the Xbox Game Studios.\n\nAbout Private Division\n\nPrivate Division is a developer-focused publisher that empowers independent studios to develop the games that they are passionate about creating, while providing the support that they need to make their titles critically and commercially successful on a global scale. The label publishes the Kerbal Space Program franchise, Ancestors: The Humankind Odyssey from Panache Digital Games, and The Outer Worlds from Obsidian Entertainment, and will publish upcoming titles with renowned creative talent at studios including Disintegration from V1 Interactive, Kerbal Space Program 2 from Star Theory Games, and more. Private Division is headquartered in New York City with offices in Seattle, Las Vegas, and Munich. For more information, please visit www.privatedivision.com.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191025005010/en/\nJeremy Gumber (Press)\nAssistant Manager\nCommunications\nPrivate Division\n(646) 536-3006\npress@privatedivision.com\n\nAlan Lewis (Corporate Press)\nVice President\nCorporate Communications & Public Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Step Inside – WWE® 2K20 Now Available",
        "subtitle": "",
        "date": "Oct 22, 2019 8:00AM EDT",
        "content": "\nPremier WWE® video game experience developed by Visual Concepts offers franchise firsts including Women’s Evolution inspired 2K Showcase, diversified MyCAREER, streamlined controls and reality-defying WWE 2K20 Originals\n    NEW YORK--(BUSINESS WIRE)--\n2K today announced that WWE® 2K20, the newest addition to the flagship WWE video game franchise, is now available worldwide for the PlayStation®4 computer entertainment system and Xbox One family of devices, including the Xbox One X, as well as Windows PC. Highlighting fan-favorite Superstars, Legends and Hall of Famers, WWE 2K20 offers engaging gameplay across a wide variety of match types, giving players the chance to live their ultimate WWE dreams.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191022005144/en/2K today announced that WWE® 2K20, the newest addition to the flagship WWE video game franchise, is now available worldwide for the PlayStation®4 computer entertainment system and Xbox One family of devices, including the Xbox One X, as well as Windows PC. (Photo: Business Wire)\nWWE 2K20 features include the female-fronted 2K Showcase: The Women’s Evolution; the ability to compete as both male and female Superstars in MyCAREER and mixed tag matches; new 2K Towers: Roman’s Reign that highlights Reigns’ epic career; as well as WWE 2K20 Originals, which offer substantially more content than previous post-launch additions.\n\n“We’re incredibly excited to invite players to step inside the world of WWE with a deeper, more personal experience than we’ve ever offered,” said Greg Thomas, President at Visual Concepts. “Our goal was to create a more immersive and representative experience than ever before, with game modes, options, updates and refinements that we hope will please returning fans and welcome in new players. We’re really excited to drive the WWE 2K franchise into the future and show players the vision and creativity Visual Concepts has to offer.”\n\nWWE 2K20 feature highlights include:\n\nDeveloped by Visual Concepts, a 2K studio, WWE 2K20 is rated “T” for Teen by the ESRB. WWE 2K20 is now available worldwide for the PS4™ system, Xbox One and Windows PC. For more information on WWE 2K20 and 2K, visit wwe.2k.com, become a fan on Facebook, follow the game on Twitter and Instagram using the hashtag #WWE2K20 or subscribe on YouTube.\n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\n* PlayStation™Network, Xbox Live or Steam account and Internet connection required. Copy of WWE 2K20 required to play.\n\nAbout WWE\n\nWWE, a publicly traded company (NYSE: WWE), is an integrated media organization and recognized leader in global entertainment. The company consists of a portfolio of businesses that create and deliver original content 52 weeks a year to a global audience. WWE is committed to family-friendly entertainment on its television programming, pay-per-view, digital media and publishing platforms. WWE’s TV-PG, family-friendly programming can be seen in more than 800 million homes worldwide in 28 languages. WWE Network, the first-ever 24/7 over-the-top premium network that includes all live pay-per-views, scheduled programming and a massive video-on-demand library, is currently available in more than 180 countries. The company is headquartered in Stamford, Conn., with offices in New York, Los Angeles, London, Mexico City, Mumbai, Shanghai, Singapore, Dubai, Munich and Tokyo.\n\nAdditional information on WWE (NYSE: WWE) can be found at wwe.com and corporate.wwe.com. For information on our global activities, go to http://www.wwe.com/worldwide/.\n\nTrademarks: All WWE programming, talent names, images, likenesses, slogans, wrestling moves, trademarks, logos and copyrights are the exclusive property of WWE and its subsidiaries. All other trademarks, logos and copyrights are the property of their respective owners.\n\nForward-Looking Statements: This press release contains forward-looking statements pursuant to the safe harbor provisions of the Securities Litigation Reform Act of 1995, which are subject to various risks and uncertainties. These risks and uncertainties include, without limitation, risks relating to: WWE Network; major distribution agreements; our need to continue to develop creative and entertaining programs and events; a decline in the popularity of our brand of sports entertainment; the continued importance of key performers and the services of Vincent K. McMahon; possible adverse changes in the regulatory atmosphere and related private sector initiatives; the highly competitive, rapidly changing and increasingly fragmented nature of the markets in which we operate and greater financial resources or marketplace presence of many of our competitors; uncertainties associated with international markets; our difficulty or inability to promote and conduct our live events and/or other businesses if we do not comply with applicable regulations; our dependence on our intellectual property rights, our need to protect those rights, and the risks of our infringement of others’ intellectual property rights; the complexity of our rights agreements across distribution mechanisms and geographical areas; potential substantial liability in the event of accidents or injuries occurring during our physically demanding events including, without limitation, claims relating to CTE; large public events as well as travel to and from such events; our feature film business; our expansion into new or complementary businesses and/or strategic investments; our computer systems and online operations; a possible decline in general economic conditions and disruption in financial markets; our accounts receivable; our revolving credit facility; litigation; our potential failure to meet market expectations for our financial performance, which could adversely affect our stock; Vincent K. McMahon exercising control over our affairs, and his interests may conflict with the holders of our Class A common stock; a substantial number of shares which are eligible for sale by the McMahons and the sale, or the perception of possible sales, of those shares could lower our stock price; and the relatively small public “float” of our Class A common stock. In addition, our dividend is dependent on a number of factors, including, among other things, our liquidity and cash flow, strategic plan (including alternative uses of capital), our financial results and condition, contractual and legal restrictions on the payment of dividends (including under our revolving credit facility), general economic and competitive conditions and such other factors as our Board of Directors may consider relevant. Forward-looking statements made by the Company speak only as of the date made, are subject to change without any obligation on the part of the Company to update or revise them, and undue reliance should not be placed on these statements.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\n\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games and 2K Silicon Valley. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated* annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n*According to 2008 - 2019 Metacritic.com\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at http://www.take2games.com/. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191022005144/en/\nAl Stavola\n2K\n(415) 483-8453\nal.stavola@2k.com\n\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\n\n\nNathan Rillo\nFINN Partners for 2K\n(310) 552-4145\nnathan.rillo@finnpartners.com\n\n\nMark Vasquez\nWWE\n(203) 352-1521\nmark.vasquez@wwecorp.com\nSource: Take-Two Interactive"
    },
    {
        "title": "NBA 2K20 x Nike Gamer Exclusive Program Gives Players Chance at In-Game and Real-Life Exclusive New Kicks",
        "subtitle": "",
        "date": "Oct 21, 2019 5:00PM EDT",
        "content": "\n10 shoes will only be available to unlock and purchase by completing in-game challenges in NBA 2K20 and the new MyPLAYER Nation mode\n    NEW YORK--(BUSINESS WIRE)--\nToday, 2K and Nike announced the NBA 2K20 x Nike Gamer Exclusive Program, a first-of-its-kind gaming and sneaker partnership, which launches alongside the new MyPLAYER Nation mode and NBA season tip-off, on October 22, 2019. The Program will allow NBA 2K20 players the opportunity to earn up to 10 pairs of soon-to-be-released virtual Nike Basketball signature shoes for their MyPLAYER by completing in-game challenges and the chance to purchase the real-life version of the limited-edition shoes from Nike.* MyPLAYER is NBA 2K’s player creation feature that allows gamers the opportunity to build their own basketball player, get drafted, rise through the ranks of the NBA elite, and help take their team to glory.\n\n2K is now taking MyPLAYER to the next level with MyPLAYER Nation, which integrates the community of NBA 2K20 MyPLAYER gamers with the real-life NBA – and the opportunity to unlock exclusive Nike gear. Once gamers create a player, are drafted by a team and join the new season-long NBA 2K20 MyPLAYER Nation mode, they will represent their MyPLAYER’s real-life team as part of a community with other players who also play for the same team. They will play through the NBA schedule, with individual matchup wins and losses determined by the overall community's winning percentage.\n\nAlong the way, players will earn double progression on all games played as well as other bonuses, like the chance to unlock the virtual Nike Gamer Exclusive sneakers for your MyPLAYER to wear in-game and purchase real-life versions of the shoes.*\n\n“We’re excited to be the first sports game to offer our players the chance to buy exclusive shoes from their favorite Nike athletes,” said Alfie Brody, VP of Global Marketing at 2K. “We always strive to push the boundaries of in-game partnerships and offer our players unique experiences alongside traditional basketball gameplay. We can’t wait to see our fans progress through the challenges to unlock and purchase each pair.”\n\nNBA 2K20 players will need to link their 2K account with a Nike account and download the Nike SNKRS App, as the shoes won’t be available for direct purchase from Nike without completing specific in-game challenges. The first challenge will take place on October 29, 2019 and other shoes will be available at key moments during the NBA season including NBA All-Star 2020, NBA Playoffs and the NBA Finals.\n\n“The Nike Basketball Gamer Exclusive program is a natural and innovative extension of our great partnership with NBA 2K,\" said Eric Wood, Nike’s VP of Digital Partnerships. “By now giving NBA 2K gamers the opportunity to connect their membership platforms we are unlocking a new way for those who live the game virtually, and physically, to earn access to a very cool range of exclusive Nike products.”\n\nTo stay up to date about when each shoe and the specific challenges start, visit https://www.nba2k.com/nike, become a fan on Facebook or follow NBA2K on Twitter and Instagram.\n\n*Nike Gamer Exclusive Sneakers are only available for players who complete Gamer Exclusive challenges in NBA 2K20 on the Xbox One, PlayStation 4, or Nintendo Switch. Ability to purchase real-life shoes from Nike is only available to legal residents of the 50 United States who are 13+. Physical quantities are extremely limited and only available while supplies last. Nike Gamer Exclusive Sneakers (physical or virtual) are not available for PC players. Terms@ http://nba.2k.com/nike-terms.\n\nDeveloped by Visual Concepts, NBA 2K20 is rated E for Everyone by the ESRB. For more information on NBA 2K20, please visit https://nba.2k.com/2k20/.\n\n2K is a publishing label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO).\n\nOnline Account (13+) required to access online features. See www.take2games.com/legal and www.take2games.com/privacy for additional details.\n\nAbout Take-Two Interactive Software\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAbout 2K\nFounded in 2005, 2K develops and publishes global interactive entertainment for console and handheld gaming systems, personal computers and mobile devices, with product availability including physical retail and digital download. The Company is home to many talented development studios, including Visual Concepts, Firaxis Games, Hangar 13, Cat Daddy Games and 2K Silicon Valley. 2K’s portfolio currently includes the renowned BioShock®, Borderlands™, Mafia and XCOM® franchises; NBA® 2K, the global phenomenon and highest rated** annual sports title for the current console generation; the critically acclaimed Sid Meier’s Civilization® series; the popular WWE® 2K and WWE® SuperCard franchises, as well as emerging properties NBA® 2K Playgrounds 2, Carnival Games and more. Additional information about 2K and its products may be found at 2k.com.\n\n*According to 2008 - 2019 Metacritic.com\n\nAbout Nike\nNIKE, Inc. based near Beaverton, Ore., is the world’s leading designer, marketer and distributor of authentic athletic footwear, apparel, equipment and accessories for a wide variety of sports and fitness activities. Wholly-owned NIKE, Inc. subsidiaries include Converse Inc., which designs, markets and distributes athletic lifestyle footwear, apparel and accessories; and Hurley International LLC, which designs, markets and distributes surf and youth lifestyle footwear, apparel and accessories. For more information, visit www.nikeinc.com and follow @Nike.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005780/en/\nRod Jago\n2K\n(+44) 7899714126\nrod.jago@2k.com\n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nalan.lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Take-Two Interactive Software, Inc. to Report Fiscal Second Quarter 2020 Results on Thursday, November 7, 2019",
        "subtitle": "",
        "date": "Oct 10, 2019 8:00AM EDT",
        "content": "    NEW YORK--(BUSINESS WIRE)--\nTake-Two Interactive Software, Inc. (NASDAQ: TTWO) today announced that it plans to report financial results for the second quarter of its fiscal year 2020, ended September 30, 2019, after the market close on Thursday, November 7, 2019. The Company plans to hold a conference call to discuss its results at 4:30 p.m. Eastern Time, which can be accessed by dialing (877) 407-0984 or (201) 689-8577. A live, listen-only webcast and a replay of the call will be available at http://ir.take2games.com/.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005013/en/\n(Investor Relations)\nHenry A. Diamond\nSenior Vice President\nInvestor Relations & Corporate Communications Affairs\nTake-Two Interactive Software, Inc.\n(646) 536-3005\nHenry.Diamond@take2games.com\n\n(Corporate Press)\nAlan Lewis\nVice President\nCorporate Communications & Public\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\nSource: Take-Two Interactive"
    },
    {
        "title": "Red Dead Redemption 2 Coming to PC November 5th",
        "subtitle": "",
        "date": "Oct 4, 2019 11:18AM EDT",
        "content": "\nPre-purchase via the Rockstar Games Launcher starting October 9th for free classic titles, Premium Edition upgrades and more\n    NEW YORK--(BUSINESS WIRE)--\nRockstar Games® is proud to announce that Red Dead Redemption 2 is coming to PC on November 5th, 2019, with special bonuses available to players who pre-purchase through the Rockstar Games Launcher starting October 9th.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191004005383/en/Rockstar Games® is proud to announce that Red Dead Redemption 2 is coming to PC on November 5th, 2019, with special bonuses available to players who pre-purchase through the Rockstar Games Launcher starting October 9th. (Graphic: Business Wire)\nPlayers can still download the Rockstar Games Launcher by Tuesday, October 8th to get Grand Theft Auto: San Andreas for free.\n\nThe first game in the Red Dead Redemption series to be featured on the PC platform, Red Dead Redemption 2 for PC includes a range of graphical and technical enhancements for increased immersion along with new Bounty Hunting Missions, Gang Hideouts, Weapons and more.\n\nRed Dead Redemption 2 for PC also includes free access to the shared living world of Red Dead Online, featuring all previously released improvements and the latest content updates for the complete online experience, including Frontier Pursuits and the specialist Roles of Bounty Hunter, Trader and Collector for players to progress through and earn unique rewards.\n\nPre-purchases for Red Dead Redemption 2 for PC begin at 11:00 a.m. ET on October 9th exclusively on the Rockstar Games Launcher through October 22nd, with a limited time offer during this period of two free Rockstar Games PC titles from the following:\n\nPre-purchases made on the Rockstar Games Launcher also include free upgrades to the Premium Editions of Red Dead Redemption 2, with both the Special Edition and Ultimate Edition discounted by $20 each.\n\nFurther pre-purchase bonuses via the Rockstar Games Launcher include:\n\nRed Dead Redemption 2 for PC will also be available to pre-order at the Epic Games Store, Greenman Gaming, the Humble Store, GameStop and additional digital retailers starting October 23 with a pre-order bonus of 25 Gold Bars for Red Dead Online. Red Dead Redemption 2 for PC will also be available to purchase on Steam this December.\n\nRed Dead Redemption 2 is currently available on PlayStation 4 and Xbox One systems and will also be available this November as a launch title for Google Stadia.\n\nAbout Red Dead Redemption 2\n\nRed Dead Redemption 2 is the highest-rated game of the current console generation with over 250 perfect scores and more than 175 Game of the Year Awards, having achieved the single-biggest opening weekend in the history of entertainment*. With over $725 million in worldwide retail sell-through during its first three days, Red Dead Redemption 2 is the second-highest grossing entertainment launch of all time next to Rockstar Games’ previously released title, Grand Theft Auto V, which achieved over $1 billion in retail sell-through in three days.*\n\nRed Dead Redemption 2 is rated M for Mature by the ESRB. For more information, please visit www.rockstargames.com/reddeadredemption2.\n\n*Red Dead Redemption 2 launched on a Friday so that its ‘opening weekend’ (Friday, Saturday and Sunday) is the same as its first three days, while Grand Theft Auto V launched on a Tuesday.\n\nAbout Rockstar Games\n\nRockstar Games cemented their reputation as creators of complex living worlds with the Grand Theft Auto series, one of the most successful entertainment properties of all time with over 270 million units sold-in worldwide. Through a string of critically acclaimed games including the Grand Theft Auto series, the Red Dead Redemption series, the Max Payne series, Bully, L.A. Noire, the Midnight Club series and The Warriors, Rockstar Games has helped propel interactive entertainment into the center of modern culture.\n\nAbout Take-Two Interactive Software\n\nHeadquartered in New York City, Take-Two Interactive Software, Inc. is a leading developer, publisher and marketer of interactive entertainment for consumers around the globe. We develop and publish products through our labels Rockstar Games, 2K, and Private Division, as well as Social Point, a leading developer of mobile games. Our products are designed for console systems and personal computers, including smartphones and tablets, and are delivered through physical retail, digital download, online platforms and cloud streaming services. The Company’s common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at http://www.take2games.com.\n\nAll trademarks and copyrights contained herein are the property of their respective holders.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThe statements contained herein which are not historical facts are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" “should,” \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for the Company's future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including: our dependence on key management and product development personnel, our dependence on our Grand Theft Auto products and our ability to develop other hit titles, the timely release and significant market acceptance of our games, the ability to maintain acceptable pricing levels on our games, and risks associated with international operations. Other important factors and information are contained in the Company's most recent Annual Report on Form 10-K, including the risks summarized in the section entitled \"Risk Factors,\" the Company’s most recent Quarterly Report on Form 10-Q, and the Company's other periodic filings with the SEC, which can be accessed at www.take2games.com. All forward-looking statements are qualified by these cautionary statements and apply only as of the date they are made. The Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191004005383/en/\nSimon Ramsey\nRockstar Games\n(212) 334-6633\nSimon.Ramsey@rockstargames.com \n\nAlan Lewis (Corporate Press)\nTake-Two Interactive Software, Inc.\n(646) 536-2983\nAlan.Lewis@take2games.com\n\n \nSource: Take-Two Interactive"
    }
]