[
    {
        "title": "Texas Instruments prices $750 million of investment grade notes",
        "subtitle": "",
        "date": "Mar 3, 2020 4:10PM EST",
        "content": "DALLAS, March 3, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) today announced the pricing of $750 million of 1.375% senior unsecured notes due March 12, 2025.TI expects to use the net proceeds of this offering for general corporate purposes, including to replenish TI's cash on hand following the expected repayment of $500 million principal amount of its 1.75% Notes due May 1, 2020. The offering is expected to close on March 12, 2020.BofA Securities, Inc.; MUFG Securities Americas Inc.; Barclays Capital Inc.; Citigroup Global Markets Inc.; J.P. Morgan Securities LLC; Mizuho Securities USA LLC; and Morgan Stanley & Co. LLC are serving as joint book-running managers for the offering.The offering of the notes is made only by means of a prospectus and a related prospectus supplement, copies of which may be obtained for free by visiting EDGAR on the Securities and Exchange Commission website at www.sec.gov or, in the alternative, from BofA Securities, Inc., Attention: Prospectus Department, NC1-004-03-43, 200 North College Street, 3rd Floor, Charlotte, North Carolina 28255, or by email at dg.prospectus_requests@bofa.com, or by calling (800) 294-1322; MUFG Securities Americas Inc., Attention: Capital Markets Group, 1221 Avenue of the Americas, 6th Floor, New York, New York 10020, or by calling (877) 649-6848; Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by email at Barclaysprospectus@broadridge.com, or by calling (888) 603-5847; Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by email at prospectus@citi.com, or by calling (800) 831-9146; J.P. Morgan Securities LLC, Investment Grade Syndicate Desk, 383 Madison Avenue, New York, New York 10179, or by calling (212) 834-4533; Mizuho Securities USA LLC, Attention: Debt Capital Markets, 1271 Avenue of the Americas, 3rd Floor, New York, New York 10020, or by calling (866) 271-7403; or Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, New York 10014, or by calling (866) 718-1649.This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the notes or any other securities, nor will there be any sale of the notes or any other securities in any state or jurisdiction in which such an offer, solicitation or sale is not permitted. About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology.TXN-G View original content:http://www.prnewswire.com/news-releases/texas-instruments-prices-750-million-of-investment-grade-notes-301015769.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "Industry's first Grade 0 digital isolator enables reliable communication and protection in HEV/EV systems that exceed 125°C",
        "subtitle": "",
        "date": "Mar 2, 2020 9:00AM EST",
        "content": "DALLAS, March 2, 2020 /PRNewswire/ -- Texas Instruments (TI) (Nasdaq: TXN) today introduced the industry's first digital isolator that is qualified to the Grade 0 ambient operating temperature specification of the Automotive Electronics Council (AEC)-Q100 standard. The ISO7741E-Q1 features an industry-leading 1.5-kVRMS working voltage and supports temperatures up to the Grade 0 maximum of 150°C. The new isolator enables engineers to better protect low-voltage circuitry from high-voltage events in hybrid electric vehicle (HEV) and electric vehicle (EV) systems and avoid having to design in cooling systems to reduce temperatures to below 125°C – the maximum temperature Grade 1-qualified integrated circuits (ICs) can support. For more information on the ISO7741E-Q1, see www.ti.com/ISO7741E-Q1-pr.In addition, when implementing Controller Area Network Flexible Data Rate (CAN FD) communications in system designs, engineers can increase in-vehicle network (IVN) signal protection and reach by using the ISO7741E-Q1 with the new TCAN1044EV-Q1 Grade 0 CAN FD transceiver. To learn more about the TCAN1044EV-Q1, see www.ti.com/TCAN1044EV-Q1-pr.High-temperature device operation increases design flexibilityGrade 0-qualified ICs meet the requirements of the AEC-Q100's highest temperature grade (-40°C to 150°C) and are designed to help engineers simplify design of HEV/EV systems in harsh environments, such as 48-V HEVs where the co-existence of internal combustion engines and battery systems can heat the air around ICs beyond 125°C. With reliable performance up to 150°C, TI's new Grade 0 devices, the ISO7741E-Q1 and the TCAN1044EV-Q1, can be placed in high-temperature areas of HEV/EV systems without increasing bill of materials or design complexity.To learn more about AEC-Q100 automotive temperature grades and why Grade 0 matters for IVN signal isolation, read the technical article, \"Solving high-temperature isolation design challenges with Grade 0 digital isolators.\"Highest isolation rating and high electromagnetic compatibilityThe ISO7741E-Q1 uses TI's capacitive isolation technology to provide the industry's highest working voltage of 1.5 kVRMS and an isolation voltage of 5 kVRMS, enabling engineers to achieve more reliable operation of HEV/EV powertrain and HVAC systems that require signal transmission across an isolation barrier, such as starter generators, cooling fans and traction inverters. Learn more about capacitive isolation and TI's full portfolio of power and signal isolation technologies at www.ti.com/isolation.This device provides additional system-level protection in harsh automotive environments due to its high typical common-mode transient immunity of ±100 kV/µs and a ±8-kV International Electrotechnical Commission (IEC) 61000-4-2 contact discharge protection.Fast signal throughput for reliable IVN performance over longer distancesBy combining the ISO7741E-Q1 and the TCAN1044EV-Q1 in CAN FD bus designs, engineers can meet the International Organization for Standardization (ISO) 11898-2:2016 timing standard for high-speed automotive communications, allowing for extended reach and reliability of signals across IVNs without diminishing data rates.Package, availability and pricingThe ISO7741E-Q1 Grade 0 digital isolator is available now from TI and authorized distributors in a 10.3-mm-by-7.5-mm, 16-pin small-outline integrated circuit (SOIC) package and is priced at US$1.49 in 1,000-unit quantities. Preproduction TCAN1044EV-Q1 Grade 0 CAN FD transceivers are available now, only from TI, in 4.9-mm-by-3.91-mm, 8-pin SOIC packages and are priced at US$0.43 in 1,000-unit quantities.About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.ti.com.TrademarksAll trademarks belong to their respective owners.  View original content to download multimedia:http://www.prnewswire.com/news-releases/industrys-first-grade-0-digital-isolator-enables-reliable-communication-and-protection-in-hevev-systems-that-exceed-125c-301013345.htmlSOURCE  Texas Instruments"
    },
    {
        "title": "Kimberly-Clark CEO Michael Hsu to join TI board of directors",
        "subtitle": "",
        "date": "Feb 20, 2020 4:05PM EST",
        "content": "DALLAS, Feb. 20, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) today announced that Michael D. Hsu, chairman and chief executive officer of Kimberly-Clark Corporation, has been elected to TI's board of directors, effective April 1.\"We're pleased to welcome Mike to our board,\" said Rich Templeton, TI's chairman, president and CEO. \"His experience driving growth in competitive markets and leading a complex, multibillion-dollar global organization will be a valuable addition to our strategic discussions.\"  Mr. Hsu, 55, has more than 25 years of experience in the consumer products industry. He joined Kimberly-Clark in 2012 as group president of the company's nearly $8 billion North American Consumer Products business. In 2017, he became the president and chief operating officer, leading day-to-day operations of Kimberly-Clark's business units, along with the global innovation, marketing and supply chain functions. Mr. Hsu assumed the role of chief executive officer in January 2019 and chairman of the board a year later. Prior to joining Kimberly-Clark, Mr. Hsu was executive vice president and chief commercial officer at Kraft Foods and held leadership roles at H.J. Heinz. He launched his career in the consumer products industry as a consultant with Booz Allen Hamilton, where he rose to partner in the firm's consumer practice.He earned a bachelor's degree from Carnegie Mellon University and a Master of Business Administration from the University of Chicago.\"In addition to Mike's background in global operations and markets, he understands the importance of the customer's perspective, innovation and the people who drive results – the employees. These are also important at TI,\" said Ron Kirk, chair of the board's governance and stockholder relations committee. \"He'll bring new insights and will be a great addition to the board.\"About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.ti.com.TXN-G  View original content:http://www.prnewswire.com/news-releases/kimberly-clark-ceo-michael-hsu-to-join-ti-board-of-directors-301008702.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "TI Chief Financial Officer Rafael Lizardi to speak at Morgan Stanley investor conference",
        "subtitle": "",
        "date": "Feb 19, 2020 4:40PM EST",
        "content": "DALLAS, Feb. 19, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) Senior Vice President and Chief Financial Officer Rafael Lizardi will speak at the Morgan Stanley Technology, Media & Telecom Conference in San Francisco on Wednesday, March 4, at 11:15 a.m. Pacific time. Lizardi will field questions from analysts and investors, as well as discuss TI's business outlook and its strategy to address key markets for its analog and embedded processing technologies and how these capabilities position the company for growth. The audio webcast for the conference can be accessed live through the Investor Relations section (www.ti.com/ir) of TI's website. An archived replay will be available on the website after his remarks.   About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.ti.com.TXN-G View original content:http://www.prnewswire.com/news-releases/ti-chief-financial-officer-rafael-lizardi-to-speak-at-morgan-stanley-investor-conference-301007870.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "Smallest 36-V, 4-A power module cuts solution size by 30%",
        "subtitle": "",
        "date": "Feb 19, 2020 9:00AM EST",
        "content": "DALLAS, Feb. 19, 2020 /PRNewswire/ -- Texas Instruments (TI) (Nasdaq: TXN) today introduced the industry's smallest 36-V, 4-A power module in a quad flat no-lead (QFN) package. The TPSM53604 DC/DC buck module's 5-mm-by-5.5-mm footprint enables engineers to shrink the size of their power supply by 30% while reducing power loss by 50% when compared to similar competing modules. The new power module comes with a single thermal pad to optimize heat transfer, enabling engineers to simplify board mounting and layout. For more information, samples and evaluation modules, see www.ti.com/TPSM53604-pr.The TPSM53604 can operate in ambient temperatures as high as 105°C to support rugged applications in factory automation and control, grid infrastructure, test and measurement, industrial transport, and aerospace and defense.By pairing the TPSM53604 with a compact step-down module such as the TPSM82813 and TPSM82810, engineers can create a complete power solution from a 24-V input down to the point of load, while minimizing design time and effort.Key benefits and features of the TPSM53604Package, availability and pricingThe TPSM53604 is now available from TI and authorized distributors in a 5-mm-by-5.5-mm QFN package. Pricing starts at US$3.65 in 1,000-unit quantities. The TPSM53604 evaluation module is available on TI.com for US$49. Production quantities of the TPSM53602 (2-A) and TPSM53603 (3-A) modules are also now available from TI and authorized distributors. Pricing starts at US$2.64 and US$3.21 in 1,000-unit quantities, respectively.Learn more from TI's power expertsAbout Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and they work every day to shape the future of technology. Learn more at www.ti.com.TrademarksTI E2E is a trademark of Texas Instruments. All other trademarks belong to their respective owners.  View original content to download multimedia:http://www.prnewswire.com/news-releases/smallest-36-v-4-a-power-module-cuts-solution-size-by-30-301007342.htmlSOURCE  Texas Instruments"
    },
    {
        "title": "Industry's smallest linear thermistors help engineers reach new thermal limits",
        "subtitle": "",
        "date": "Feb 17, 2020 9:00AM EST",
        "content": "DALLAS, Feb. 17, 2020 /PRNewswire/ -- Texas Instruments (TI) (Nasdaq: TXN) today expanded its temperature sensing portfolio to include linear thermistors that deliver up to 50% higher accuracy than negative temperature coefficient (NTC) thermistors. The higher accuracy of TI's thermistors enables operation closer to the thermal limits of the other components and the overall system, helping engineers maximize performance while reducing bill-of-materials (BOM) and total solution cost. For more information, see www.ti.com/thermistors-pr. NTC thermistors are widely used due to their low price; however, they present several challenges to design engineers, including degraded performance at temperature extremes and complex calibration requirements, which increases design time. TI's new linear thermistors are available at a similar price while providing significantly more value – most notably minimizing design time, reducing component count and increasing system performance. Extend system performance and reliabilityTI's new thermistors deliver reliable, highly accurate thermal measurements, particularly at temperatures above 80°C. This is especially important for industrial, automotive and consumer applications where precise, real-time temperature readings are fundamental to system performance and protection. To learn more about the differences between NTCs and TI's linear thermistors, read the white paper, \"Temperature sensing with thermistors.\"NTC thermistors provide less accurate temperature readings due to their low sensitivity and high resistance tolerance at temperature extremes. To compensate for these challenges, many engineers calibrate at three points across the temperature range or use multiple thermistors to monitor different temperature ranges. These approaches can still produce unreliable temperature readings, which can require systems to shut down before reaching their true thermal limit. The linearity and high accuracy of TI's thermistors enable single-point calibration, which maximizes system performance and simplifies design. TI's thermistors also offer very low typical drift of 0.5% to improve the reliability of temperature measurements, enabling designers to boost system performance while maintaining safe operation. Engineers can use TI's thermistor design tool, available on the thermistor product pages and data sheets on TI.com, to quickly and easily calculate temperature resistance values and kick-start their design with example conversion methods and code.Reduce system cost and sizeBy eliminating the need for additional linearization circuitry or redundant NTC thermistors, TI's thermistors help engineers simplify design, lower system cost and reduce printed circuit board (PCB) layout size by at least 33%, compared to NTC thermistors. In addition, TI's thermistors are one-tenth the size of similar silicon-based linear thermistors, with a low profile and small package area that enable placement closer to thermal hot spots for faster thermal response and more consistent temperature measurements. Package, availability and pricingTI's new thermistor portfolio, which includes the TMP61, TMP63 and TMP64, is available now through TI and authorized distributors with starting prices as low as US$0.05 in 1,000-unit quantities. The devices are offered in through-hole packaging and surface-mount 0402 and 0603 footprint options.About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.ti.com.TrademarksAll registered trademarks and other trademarks belong to their respective owners.  View original content to download multimedia:http://www.prnewswire.com/news-releases/industrys-smallest-linear-thermistors-help-engineers-reach-new-thermal-limits-301005487.htmlSOURCE  Texas Instruments"
    },
    {
        "title": "TI's EMI-optimized integrated transformer technology miniaturizes isolated power transfer into IC-sized packaging",
        "subtitle": "",
        "date": "Feb 11, 2020 9:00AM EST",
        "content": "DALLAS, Feb. 11, 2020 /PRNewswire/ -- Texas Instruments (TI) (Nasdaq: TXN) today introduced the first integrated circuit (IC) developed with a new proprietary integrated transformer technology: a 500-mW high-efficiency isolated DC/DC converter with the industry's lowest electromagnetic interference (EMI), the UCC12050. Its 2.65-mm height enables designers to reduce their solution volume by as much as 80% compared to discrete solutions and 60% compared to power modules – with twice the efficiency of competing devices. Built for industrial performance, the UCC12050's 5-kVrms reinforced isolation and 1.2-kVrms working voltage protect against high-voltage spikes in systems such as industrial transport, grid infrastructure and medical equipment. For more information, see www.ti.com/UCC12050-pr.TI's breakthrough integrated transformer technology enables high-density isolated DC/DC power conversion, while maintaining low EMI. The single-package, surface-mount architecture gives designers an easy-to-use, low-profile IC that reduces the bill of materials (BOM), and efficiently operates across a wide temperature range. An EMI-optimized, low capacitance transformer and quiet control scheme streamline EMI compliance while providing a reliable solution with options for reinforced or basic isolation. Download the white paper, \"Power Through the Isolation Barrier: The Landscape of Isolated DC/DC Bias Power Supplies\" to learn more about this new family of reinforced isolated DC/DC bias supplies.  TI will demonstrate the UCC12050 in booth No. 1001 at the Applied Power Electronics Conference (APEC) in New Orleans, Louisiana, March 15-19, 2020.Key features and benefits of the UCC12050This new high-density isolated power converter, the latest industry-leading device in TI's power-management portfolio, offers small size and ease of use for any industrial application requiring isolation. Additionally, the new UCC12040 provides all of the same benefits with 3-kVrms basic isolation.Package, availability and pricingThe UCC12050 and UCC12040 are available in volume production from TI and authorized distributors in a 16-pin, 10.3-mm-by-10.3-mm-by-2.65-mm SOIC package. Pricing starts at US$3.90 and US$3.15, respectively, in 1,000-unit quantities. Engineers can evaluate this product with the UCC12050EVM-022 evaluation module, available on TI.com for US$99.Learn more from TI's power and isolation expertsFor more information on TI's new integrated transformer technology and products, see www.ti.com/isolatedpower to view additional technical content, including application notes and a video, and to discover TI's diverse selection of low-power offline and isolated DC/DC converters. To learn more about TI's full portfolio of power and signal isolation technologies and how they deliver the industry's highest isolation ratings and device lifetimes, see www.ti.com/isolation. About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and they work every day to shape the future of technology. Learn more at www.ti.com.TrademarksAll trademarks belong to their respective owners.  View original content to download multimedia:http://www.prnewswire.com/news-releases/tis-emi-optimized-integrated-transformer-technology-miniaturizes-isolated-power-transfer-into-ic-sized-packaging-301001222.htmlSOURCE  Texas Instruments"
    },
    {
        "title": "TI CEO Rich Templeton to speak at Goldman Sachs investor conference",
        "subtitle": "",
        "date": "Jan 30, 2020 6:46PM EST",
        "content": "DALLAS, Jan. 30, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) Chairman, President and Chief Executive Officer Rich Templeton will speak at the Goldman Sachs Technology and Internet Conference 2020 in San Francisco on Wednesday, February 12, at 9:40 a.m. Pacific time. Templeton will field questions from analysts and investors, as well as discuss TI's business outlook and its strategy to address key markets for its analog and embedded processing technologies and how these capabilities position the company for growth. The audio webcast for the conference can be accessed live through the Investor Relations section (www.ti.com/ir) of TI's website. An archived replay will be available on the website after his remarks.   About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.ti.com.TXN-G View original content:http://www.prnewswire.com/news-releases/ti-ceo-rich-templeton-to-speak-at-goldman-sachs-investor-conference-300996628.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "TI to webcast review and update of capital management strategy",
        "subtitle": "",
        "date": "Jan 23, 2020 11:30AM EST",
        "content": "DALLAS, Jan. 23, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) will webcast a review and update of the company's capital management strategy on Tuesday, February 4, at 10 a.m. Central time.  During the webcast, Rafael Lizardi, senior vice president and chief financial officer, and Dave Pahl, vice president and head of Investor Relations, will review how TI is in a unique class of companies able to grow, generate and return cash to shareholders over the long term. They will also review TI's 2019 performance against its stated capital management metrics and discuss management's expectations for performance in the years ahead.     You may access the webcast on the Investor Relations section of the company's website at www.ti.com/ir. An archived copy of the webcast will be available shortly after the call concludes.  About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/ti-to-webcast-review-and-update-of-capital-management-strategy-300992263.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "TI reports Q4 2019 and 2019 financial results and shareholder returns",
        "subtitle": "",
        "date": "Jan 22, 2020 4:01PM EST",
        "content": "DALLAS, Jan. 22, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) today reported fourth quarter revenue of $3.35 billion, net income of $1.07 billion and earnings per share of $1.12. Earnings per share include a 1-cent benefit for items that were not in the company's original guidance.Regarding the company's performance and returns to shareholders, Rich Templeton, TI's chairman, president and CEO, made the following comments:Free cash flow, a non-GAAP financial measure, is cash flow from operations less capital expenditures.Earnings summaryAmounts are in millions of dollars, except per-share amounts.Cash generationAmounts are in millions of dollars.Cash returnAmounts are in millions of dollars.     Quarterly segment resultsAmounts are in millions of dollars.Compared with the year-ago quarter:Analog: (includes Power, Signal Chain and High Volume)Embedded Processing: (includes Connected Microcontrollers and Processors)Other: (includes DLP® products, calculators and custom ASIC products) Annual segment resultsAmounts are in millions of dollars.Compared with the prior year:Analog:Embedded Processing:Other: Non-GAAP financial informationThis release includes references to free cash flow and ratios based on that measure. These are financial measures that were not prepared in accordance with GAAP. Free cash flow was calculated by subtracting capital expenditures from the most directly comparable GAAP measure, cash flows from operating activities (also referred to as cash flow from operations).We believe that free cash flow and the associated ratios provide insight into our liquidity, our cash-generating capability and the amount of cash potentially available to return to shareholders, as well as insight into our financial performance. These non-GAAP measures are supplemental to the comparable GAAP measures.Reconciliation to the most directly comparable GAAP measures is provided in the table below.Amounts are in millions of dollars.This release also includes references to an annual operating tax rate, a non-GAAP term we use to describe the estimated annual effective tax rate, a GAAP measure that by definition does not include discrete tax items. We believe the term annual operating tax rate helps differentiate from the effective tax rate, which includes discrete tax items.Notice regarding forward-looking statementsThis release includes forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by phrases such as TI or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts,\" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe TI's business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements. We urge you to carefully consider the following important factors that could cause actual results to differ materially from the expectations of TI or our management:For a more detailed discussion of these factors, see the Risk factors discussion in Item 1A of TI's most recent Form 10-K. The forward-looking statements included in this release are made only as of the date of this release, and we undertake no obligation to update the forward-looking statements to reflect subsequent events or circumstances. If we do update any forward-looking statement, you should not infer that we will make additional updates with respect to that statement or any other forward-looking statement.About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com. TI trademarks:          DLPOther trademarks are the property of their respective owners.TXN-G  View original content:http://www.prnewswire.com/news-releases/ti-reports-q4-2019-and-2019-financial-results-and-shareholder-returns-300991604.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "Texas Instruments board declares first quarter 2020 quarterly dividend",
        "subtitle": "",
        "date": "Jan 16, 2020 4:10PM EST",
        "content": "DALLAS, Jan. 16, 2020 /PRNewswire/ -- The board of directors of Texas Instruments Incorporated (Nasdaq: TXN) today declared a quarterly cash dividend of $0.90 per share of common stock, payable February 10, 2020, to stockholders of record on January 31, 2020.About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/texas-instruments-board-declares-first-quarter-2020-quarterly-dividend-300988489.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "New low-power, high-performance TI Jacinto(TM) 7 processors enable mass-market adoption of automotive ADAS and gateway technology",
        "subtitle": "Highly integrated processors support the needs of your entire vehicle lineup with specialized accelerators and functional safety features on-chip and a unified software platform",
        "date": "Jan 7, 2020 11:30AM EST",
        "content": "LAS VEGAS, Jan. 7, 2020 /PRNewswire/ -- Texas Instruments (TI) (NASDAQ: TXN) today introduced the new Jacinto™ 7 processor platform. Built on the foundation of TI's decades of automotive systems and functional safety expertise, the new Jacinto processor platform brings enhanced deep learning capabilities and advanced networking to solve design challenges in advanced driver assistance systems (ADAS) and automotive gateway applications. The first two automotive devices in the platform, TDA4VM processors for ADAS and DRA829V processors for gateway systems, include specialized on-chip accelerators to segment and expedite data-intensive tasks, like computer vision and deep learning. Additionally, TDA4VM and DRA829V processors incorporate a functional safety microcontroller, making it possible for original equipment manufacturers (OEMs) and Tier-1 suppliers to support both ASIL-D safety-critical tasks and convenience features with one chip. Both devices share a single software platform, which alleviates system complexity and cost by enabling developers to reuse their software investment across multiple vehicle domains. For more information about Jacinto 7 processors, see www.ti.com/Jacinto7-prImproving vehicle awareness within low power budgets Through in-bound camera, radar and LIDAR data, ADAS technology helps cars see and adapt to the world around them. The influx of information coming into the car underscores the need for processors or systems-on-chip to quickly and efficiently manage multilevel processing in real time, all while operating within the system's power budget. TI's new processors execute high-performance ADAS operations using just 5 to 20 W of power, eliminating the need for active cooling.The TDA4VM processor offers on-chip analytics combined with sensor pre-processing, enabling more efficient system performance. This allows OEMs and Tier-1 suppliers to support front camera applications using high-resolution 8-MP cameras to see farther and add enhanced features, such as drive assist. Additionally, TDA4VM processors are capable of simultaneously operating four to six 3MP cameras while also fusing other sensing modalities such as radar, LIDAR and ultrasonic on one chip. This multilevel capability enables TDA4VM to act as the centralized processor for ADAS and enables the critical features for automated parking, like surround view and image processing for displays, enhancing vehicle perception for 360 degrees of awareness. Accelerating the data highway for the software-defined carThe DRA829V processor seamlessly integrates the computing functions required for modern vehicles. As vehicle technology advances, automotive gateways need a flexible processor to manage higher volumes of data and support evolving requirements for autonomy and enhanced connectivity. The DRA829V processor is the first in the industry to incorporate a PCIe switch on-chip in addition to integrating an eight-port gigabit TSN-enabled Ethernet switch for faster high-performance computing functions and communications throughout the car. Combined with the ability to support both ASIL-D safety-critical and non-safety-critical operations, these computing and communication features enable OEMs and Tier-1 suppliers to support mixed-criticality applications on one device. Higher bandwidth on-chip also allows developers to manage software development and validation in vehicles, which translates to more dynamic updates and upgrades. Availability and pricingDevelopers can get started immediately with Jacinto 7 processors development kits, and buy the new TDA4VMXEVM and DRA829VXEVM evaluation modules on TI.com for US$1,900 each. Preproduction TDA4VM and DRA8329V processors are available now, only from TI, at US$97 in 1,000-unit quantities. Volume production is expected to be available in the second half of 2020.Additional design support for next-generation Jacinto processorsAbout Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TrademarksJacinto is a trademark of Texas Instruments. All registered trademarks and other trademarks belong to their respective owners. View original content to download multimedia:http://www.prnewswire.com/news-releases/new-low-power-high-performance-ti-jacinto-7-processors-enable-mass-market-adoption-of-automotive-adas-and-gateway-technology-300980992.htmlSOURCE  Texas Instruments"
    },
    {
        "title": "Texas Instruments to webcast Q4 2019 and 2019 earnings conference call",
        "subtitle": "",
        "date": "Jan 2, 2020 3:25PM EST",
        "content": "DALLAS, Jan. 2, 2020 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) will webcast its fourth quarter and year-end 2019 earnings conference call Wednesday, January 22, at 3:30 p.m. Central time. Rafael Lizardi, senior vice president and chief financial officer, and Dave Pahl, vice president and head of Investor Relations, will discuss TI's financial results and answer questions from the investor audience. You may access the audio webcast on the Investor Relations section of the company's website at www.ti.com/ir. An archived copy of the webcast will be available shortly after the call concludes.  About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/texas-instruments-to-webcast-q4-2019-and-2019-earnings-conference-call-300980635.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "TI Vice President Dave Pahl to speak at Barclays investor conference",
        "subtitle": "December 12, 2019, 10:30 a.m. Pacific time",
        "date": "Nov 25, 2019 11:35AM EST",
        "content": "DALLAS, Nov. 25, 2019 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) Vice President Dave Pahl will speak at the Barclays Capital Global Technology, Media and Telecommunications Conference in San Francisco, California, on Thursday, December 12, at 10:30 a.m. Pacific time. Pahl, head of Investor Relations, will field questions from analysts and investors, as well as discuss TI's business outlook and its strategy to address key markets for its analog and embedded processing technologies and how these capabilities position the company for growth. The audio webcast for the conference can be accessed live through the Investor Relations section (www.ti.com/ir) of TI's website. An archived replay will be available on the website after his remarks.   About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/ti-vice-president-dave-pahl-to-speak-at-barclays-investor-conference-300964670.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "TI Vice President Dave Pahl to speak at UBS investor conference",
        "subtitle": "December 10, 2019, 10 a.m. Eastern time",
        "date": "Nov 21, 2019 2:10PM EST",
        "content": "DALLAS, Nov. 21, 2019 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) Vice President Dave Pahl will speak at the UBS Global TMT Conference in New York City on Tuesday, December 10, at 10 a.m. Eastern time. Pahl, head of Investor Relations, will field questions from analysts and investors, as well as discuss TI's business outlook and its strategy to address key markets for its analog and embedded processing technologies and how these capabilities position the company for growth. The audio webcast for the conference can be accessed live through the Investor Relations section (www.ti.com/ir) of TI's website. An archived replay will be available on the website after his remarks.   About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G  View original content:http://www.prnewswire.com/news-releases/ti-vice-president-dave-pahl-to-speak-at-ubs-investor-conference-300963322.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "TI CEO Rich Templeton to speak at Credit Suisse investor conference",
        "subtitle": "December 3, 2019, 9:20 a.m. Mountain time",
        "date": "Nov 18, 2019 3:25PM EST",
        "content": "DALLAS, Nov. 18, 2019 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) Chairman, President and Chief Executive Officer Rich Templeton will speak at the 2019 Credit Suisse 23rd   Annual Technology Conference in Scottsdale, Arizona, on Tuesday, December 3, at 9:20 a.m. Mountain time. Templeton will field questions from analysts and investors, as well as discuss TI's business outlook and its strategy to address key markets for its analog and embedded processing technologies and how these capabilities position the company for growth. The audio webcast for the conference can be accessed live through the Investor Relations section (www.ti.com/ir) of TI's website. An archived replay will be available on the website after his remarks.About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/ti-ceo-rich-templeton-to-speak-at-credit-suisse-investor-conference-300960236.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "No more yelling at smart speakers: New TI Burr-Brown(TM) audio ADC enables far-field voice capture at four times the distance",
        "subtitle": "Engineers can now achieve a 120-dB dynamic range for clear, high-fidelity audio in smart home applications",
        "date": "Nov 5, 2019 9:00AM EST",
        "content": " DALLAS, Nov. 5, 2019 /PRNewswire/ -- Texas Instruments (TI) (Nasdaq: TXN) today introduced a new audio analog-to-digital converter (ADC) capable of capturing clear audio up to four times farther away than competing devices. The TLV320ADC5140 is the industry's smallest quad-channel audio ADC with this level of performance. The device is part of a new family of three TI Burr-Brown™ audio ADCs that enable low-distortion audio recordings in loud environments, along with far-field, high-fidelity recordings in any environment. For more information, see www.ti.com/TLV320ADC5140-pr. Smart home systems face challenges with far-field audio capture. In today's systems, a limited number of microphones and restricted signal processing capability make it difficult to capture and understand voice commands in loud environments. To meet this challenge, the TLV320ADC5140 enables engineers to improve audio capture from across rooms and boost recognition of soft-spoken commands in applications such as high-end smart speakers, sound bars, wireless speakers, high definition TVs, IP network cameras, teleconferencing systems and smart appliances. The ADC, which joins the portfolio of TI Burr-Brown premium audio devices, including high-performance Class-D amplifiers, data converters and operational amplifiers, can also help engineers save system design costs by reducing the number of microphones in the array.Key features and benefits of the TLV320ADC5140Package, availability and pricingThe TLV320ADC5140 is available now through the TI store. Offered in 4-mm-by-4-mm, 24-pin wafer quad flatpack no-lead (WQFN) packaging, it is priced at US$2.99 in 1,000-unit quantities. The TLV320ADC5140 quad-channel 768-kHz TI Burr-Brown™ audio ADC evaluation module, ADC5140EVM-PDK, is available for $199 in limited quantities.Find out more about TI's TLV320ADC5140About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TrademarksTI Burr-Brown and E2E are trademarks of Texas Instruments. All registered trademarks and other trademarks belong to their respective owners. View original content to download multimedia:http://www.prnewswire.com/news-releases/no-more-yelling-at-smart-speakers-new-ti-burr-brown-audio-adc-enables-far-field-voice-capture-at-four-times-the-distance-300951217.htmlSOURCE  Texas Instruments"
    },
    {
        "title": "TI reports third quarter 2019 financial results and shareholder returns",
        "subtitle": "Conference call on TI website at 3:30 p.m. Central time today",
        "date": "Oct 22, 2019 4:01PM EDT",
        "content": "DALLAS, Oct. 22, 2019 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) today reported third quarter revenue of $3.77 billion, net income of $1.43 billion and earnings per share of $1.49. Earnings per share include a 9-cent benefit for items that were not in the company's original guidance.Regarding the company's performance and returns to shareholders, Rich Templeton, TI's chairman, president and CEO, made the following comments:Free cash flow, a non-GAAP financial measure, is cash flow from operations less capital expenditures.Earnings summaryAmounts are in millions of dollars, except per-share amounts. Cash generationAmounts are in millions of dollars. Cash returnAmounts are in millions of dollars.    Segment resultsAmounts are in millions of dollars. Compared with the year-ago quarter:Analog: (includes Power, Signal Chain and High Volume)Embedded Processing: (includes Connected Microcontrollers and Processors)Other: (includes DLP® products, calculators and custom ASIC products) Non-GAAP financial informationThis release includes references to free cash flow and ratios based on that measure. These are financial measures that were not prepared in accordance with GAAP. Free cash flow was calculated by subtracting capital expenditures from the most directly comparable GAAP measure, cash flows from operating activities (also referred to as cash flow from operations).We believe that free cash flow and the associated ratios provide insight into our liquidity, our cash-generating capability and the amount of cash potentially available to return to shareholders, as well as insight into our financial performance. These non-GAAP measures are supplemental to the comparable GAAP measures.Reconciliation to the most directly comparable GAAP measures is provided in the table below.Amounts are in millions of dollars.  This release also includes references to an annual operating tax rate, a non-GAAP term we use to describe the estimated annual effective tax rate, a GAAP measure that by definition does not include discrete tax items. We believe the term annual operating tax rate helps differentiate from the effective tax rate, which includes discrete tax items.Notice regarding forward-looking statementsThis release includes forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by phrases such as TI or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts,\" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe TI's business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements. We urge you to carefully consider the following important factors that could cause actual results to differ materially from the expectations of TI or our management:For a more detailed discussion of these factors, see the Risk Factors discussion in Item 1A of TI's most recent Form 10-K. The forward-looking statements included in this release are made only as of the date of this release, and we undertake no obligation to update the forward-looking statements to reflect subsequent events or circumstances. If we do update any forward-looking statement, you should not infer that we will make additional updates with respect to that statement or any other forward-looking statement.About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TI trademarks:      DLP Other trademarks are the property of their respective owners.TXN-G View original content:http://www.prnewswire.com/news-releases/ti-reports-third-quarter-2019-financial-results-and-shareholder-returns-300943318.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "Texas Instruments board declares fourth quarter 2019 quarterly dividend",
        "subtitle": "",
        "date": "Oct 17, 2019 4:20PM EDT",
        "content": "DALLAS, Oct. 17, 2019 /PRNewswire/ -- The board of directors of Texas Instruments Incorporated (Nasdaq: TXN) today declared a quarterly cash dividend of $0.90 per share of common stock, payable November 18, 2019, to stockholders of record on October 31, 2019. About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/texas-instruments-board-declares-fourth-quarter-2019-quarterly-dividend-300940884.htmlSOURCE  Texas Instruments Incorporated"
    },
    {
        "title": "Texas Instruments to webcast third quarter 2019 earnings conference call",
        "subtitle": "",
        "date": "Oct 1, 2019 2:45PM EDT",
        "content": "DALLAS, Oct. 1, 2019 /PRNewswire/ -- Texas Instruments Incorporated (TI) (Nasdaq: TXN) will webcast its third quarter 2019 earnings conference call Tuesday, October 22, at 3:30 p.m. Central time. Rafael Lizardi, senior vice president and chief financial officer, and Dave Pahl, vice president and head of Investor Relations, will discuss TI's financial results and answer questions from the investor audience. You may access the audio webcast on the Investor Relations section of the company's website at www.ti.com/ir. An archived copy of the webcast will be available shortly after the call concludes.  About Texas InstrumentsFrom connected cars and intelligent homes to self-monitoring health devices and automated factories, Texas Instruments Incorporated (TI) (Nasdaq: TXN) products are at work in virtually every type of electronic system. With operations in more than 30 countries, we engineer, manufacture, test and sell analog and embedded semiconductor chips. Our employees, about 30,000 worldwide, are driven by core values of integrity, innovation and commitment, and work every day to shape the future of technology. Learn more at www.TI.com.TXN-G View original content:http://www.prnewswire.com/news-releases/texas-instruments-to-webcast-third-quarter-2019-earnings-conference-call-300928877.htmlSOURCE  Texas Instruments Incorporated"
    }
]