[
    {
        "title": "United Airlines to Present at the 2020 J.P. Morgan Industrials Conference",
        "subtitle": "",
        "date": "Mar 4, 2020 5:00PM EST",
        "content": "CHICAGO, March 4, 2020 /PRNewswire/ -- United Airlines will present at the J.P. Morgan Industrials Conference on Tuesday, March 10. United Airlines' President Scott Kirby will be the keynote speaker at the conference beginning at 11:50 a.m. CT / 12:50 p.m. ET. The live webcast will be available on the investor relations section of United's website at ir.united.com. The company will archive the audio webcast on the website within 24 hours of the presentation, and the webcast will be available for a limited time.Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".   View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-to-present-at-the-2020-jp-morgan-industrials-conference-301016765.htmlSOURCE  United Airlines"
    },
    {
        "title": "Take a Break in the Big Easy: United Airlines Debuts New Club Location in New Orleans",
        "subtitle": "",
        "date": "Feb 28, 2020 11:47AM EST",
        "content": "NEW ORLEANS, Feb. 28, 2020 /PRNewswire/ -- United Airlines will unveil the newest addition to its network of United Club locations with the opening of a brand-new 6,000-square-foot United Club at Louis Armstrong New Orleans International Airport. Located in the airport's brand-new terminal, near gate C7, the club offers customers a wide variety of amenities to work, relax and refresh during their travels. The new United Club opens starting Saturday, Feb. 29. \"Our expansion into New Orleans showcases United's commitment to transforming the customer experience across all touch points and complements the beautiful new terminal at Louis Armstrong New Orleans International Airport,\" said Alexander Dorow, United's managing director of premium services. \"It's a fresh location for us to begin our evolution to become more local and reach new audiences.\" Menu highlights in the new club location include inventive twists on regional favorites such as muffuletta sliders with pimento cheese, gumbo and rice, Cajun pepper dip and Creole egg salad. The drink selection includes local staples like Abita Amber beer and Southern Comfort, along with a variety of beer, wine and cocktail options. The New Orleans United Club features 95 seats, with a variety of seating areas for productivity, privacy and dining. For customers looking to stay connected, the club offers complimentary high-speed Wi-Fi and many power outlets and USB ports.The New Orleans United Club location is the first United Club to open this year and is part of United's ongoing commitment to renovate and introduce new United Club locations throughout its network. The company is also working on brand-new United Club locations at Newark Liberty International Airport – to open in 2021 – and Phoenix Sky Harbor International Airport, which will open later this year. Construction will also begin on a brand-new and larger United Club location at Daniel K. Inouye International Airport in Honolulu. Additionally, this summer, United will unveil its United Polaris lounge at Washington Dulles International Airport – the sixth location in the United Polaris lounge network. For more information on United Club locations, visit united.com/unitedclub.  Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".   View original content to download multimedia:http://www.prnewswire.com/news-releases/take-a-break-in-the-big-easy-united-airlines-debuts-new-club-location-in-new-orleans-301013429.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines, Chase and Visa Announce Multi-Year Extension of United MileagePlus Credit Card Program",
        "subtitle": "",
        "date": "Feb 21, 2020 4:15PM EST",
        "content": "CHICAGO, Feb. 21, 2020 /PRNewswire/ -- United Airlines, Chase Card Services and Visa today announced a multi-year extension of the United MileagePlus credit card program. The extension continues the more than 30-year relationship between the number one card issuer in the U.S., the U.S. airline with service to the most U.S. cities and most countries around the world and the world's leader in digital payments.The agreement, which extends into 2029, builds on one of the industry's strongest co-brand card portfolios with seven consecutive quarters of double-digit year-over-year growth and a long history of providing cardmembers with extra benefits that reward people traveling United's expansive global route network. \"United Airlines, Chase and Visa have a longstanding partnership that delivers top benefits to customers to help them get the most out of their travel, while returning robust value to our respective businesses,\" said Luc Bondar, United's vice president of Loyalty. \"This extension strengthens ties with our partners at Chase and Visa and is expected to drive growth across our industry-leading credit card portfolio, enhance our cardholders travel experience and provide more opportunities to easily earn and redeem miles to travel United's industry leading route network.\"\"We're pleased to extend our decades-long relationship with United and Visa in order to deliver even more value to our joint cardmembers,\" said Ed Olebe, president of Chase Co-Brand Cards. \"The program has deep cardmember loyalty and fantastic momentum, with exciting new offerings and experiences for our customers to look forward to in 2020 and beyond.\"The extended agreement will build on one of the world's strongest co-brand card portfolios, with premium customers in premium markets. The portfolio of cards includes the new United Business Card, United Explorer Card, United Club Card, United Club Business Card and United TravelBank Card. Customers traveling with eligible MileagePlus credit cards have access to benefits that make traveling United's leading route network better than ever including perks such as free checked bags, priority boarding and increased mileage earn on every day spending. \"Visa is proud to extend our partnership with United and Chase to bring best-in-class card benefits and travel experiences to cardholders,\" said Kirk Stuart, senior vice president, head of North America Merchant at Visa. \"We look forward to building on the program's success to deliver more value, enhance cardholder engagement and create rewarding payment experiences.\"Earlier this year, United and Chase launched a new Business card and celebrated with the highest ever bonuses for all United co-brand cards for the first time ever. In 2018, United and Chase launched the award-winning United Explorer card, with even more best-in-class benefits including an up to $100 Global Entry or TSA Pre-Check statement credit and 2X earn on hotel stays and restaurant purchases. United also continues to invest in making MileagePlus the top loyalty program for its members. Last year the airline announced that MileagePlus miles never expire and announced a partnership with CLEAR to offer free and discounted memberships to MileagePlus members. United also introduced PlusPoints, a new industry-leading upgrade benefit for Premier members.  About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\". About ChaseChase is the U.S. consumer and commercial banking business of JPMorgan Chase & Co. (NYSE: JPM), a leading global financial services firm with assets of $2.7 trillion and operations worldwide. Chase serves nearly half of America's households with a broad range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans and payment processing. Customers can choose how and where they want to bank: More than 4,900 branches in 38 states and the District of Columbia, 16,000 ATMs, mobile, online and by phone. For more information, go to chase.com.About VisaVisa Inc. (NYSE: V) is the world's leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network - enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's relentless focus on innovation is a catalyst for the rapid growth of digital commerce on any device, for everyone, everywhere.  As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, visa.com/blog and @VisaNews  View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-chase-and-visa-announce-multi-year-extension-of-united-mileageplus-credit-card-program-301009329.htmlSOURCE  United Airlines"
    },
    {
        "title": "Making Travel Easier - United Airlines and Vistara Launch Codeshare Agreement",
        "subtitle": "",
        "date": "Feb 19, 2020 1:15PM EST",
        "content": "CHICAGO, Feb. 19, 2020 /PRNewswire/ -- United Airlines and Vistara announced the start of a new codeshare agreement allowing United customers to book travel on 68 Vistara-operated flights to 26 destinations throughout India for travel beginning February 28. The codeshare builds on the agreement between the airlines in which MileagePlus and Vistara's loyalty program members earn and redeem miles when flying on either of the airline's route network.  The United and Vistara agreement offers customers a simplified experience when planning travel between dozens of destinations throughout India including Ahmedabad, Bengaluru, Chandigarh, Goa, Hyderabad, Jodhpur, Srinagar, Thiruvananthapuram, Udaipur, Varanasi and more. \"We are excited to offer our shared customers the option of building a seamless itinerary when planning travel to cities beyond New Delhi and Mumbai,\" said John Gebo, United's senior vice president of Alliances. \"United has connected customers to India for more than 15 years with daily flights between New York/Newark and Delhi and Mumbai and our new service between San Francisco and New Delhi. Our relationship with Vistara opens up even more options for customers to travel between our East and West Coast hubs and multiple destinations throughout India.\"Vistara's Chief Commercial Officer, Vinod Kannan said, \"Vistara today connects the length and breadth of India, and we are delighted to offer the country's only five-star flying experience to customers of United on their Indian domestic flights. The U.S. continues to be one of the biggest source markets for foreign travelers into India and the region, and this partnership allows us to provide a seamless travel offering for customers to and from the U.S.\" As India's highest-rated airline on Skytrax and TripAdvisor, winner of several 'Best Airline' awards, and the only 5-star rated airline in India (Apex 2020), Vistara has consistently raised the bar for operations and service delivery in the Indian aviation industry in a short span of five years. The airline is poised to grow its fleet by adding more than 50 narrow-body and wide-body aircraft, including Airbus A321neo and Boeing B787-9, in the next three years. Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".About Vistara (TATA SIA Airlines Limited)TATA SIA Airlines Limited, known by the brand name Vistara, is a joint venture between Tata Sons Limited and Singapore Airlines Limited (SIA) with Tata Sons holding the majority stake of 51% in the company and SIA holding the remaining 49%. Vistara brings together Tata's and SIA's legendary hospitality and renowned service excellence to offer the finest full-service flying experience in India. Vistara commenced its commercial operations on January 9, 2015 with an aim to set new standards in the aviation industry in India and it today connects destinations across India and abroad. The airline now connects 35 destinations, operates over 200 flights a day with a fleet of 32 Airbus A320 and 7 Boeing 737-800NG aircraft, and has flown more than 20 million customers since starting operations.  View original content to download multimedia:http://www.prnewswire.com/news-releases/making-travel-easier---united-airlines-and-vistara-launch-codeshare-agreement-301007707.htmlSOURCE  United Airlines"
    },
    {
        "title": "More than a 'Nosh' - United Airlines Expands Kosher Culinary Choices for Customers Traveling Between the U.S. and Tel Aviv",
        "subtitle": "",
        "date": "Feb 10, 2020 8:00AM EST",
        "content": "NEW YORK, Feb. 10, 2020 /PRNewswire/ -- This month, United is taking Kosher cuisine to new heights by introducing a variety of new options for customers traveling between the U.S. and Tel Aviv, from the airline's Newark / New York, San Francisco and Washington, D.C. / Dulles based hubs. These exciting menu additions include popular choices from several leading Kosher food and beverage brands and reflects United's commitment to elevate the travel experience for our customers.\"We are thrilled to expand our already high-quality Kosher culinary choices to include new options we know our customers will love,\" said Charlean Gmunder, United's vice president of Catering Operations. \"We know our customers and listen to their feedback and all of these new menu items – from savory new snacks to wonderful wines – are the result of our on-going efforts to exceed customer expectations. We will continue to embrace suggestions as well as seek out ways to create the best possible onboard dining experience for everyone we proudly serve.\"Partnering with New Jersey-based fresh food provider Fresko, meals on the Newark to Tel Aviv flight will feature an entirely new menu. Options will include dishes such as fresh bagels, a cheese omelet, blintzes, chicken marsala, a kale quinoa burger and traditional bakery items like rugelach and black and white cookies. As part of the introduction of these new dining options, United is also testing a menu offering for its youngest customers – a Kosher child's meal in all cabins between Tel Aviv, Newark and San Francisco. If the testing is successful, the airline will roll out the meal selection on additional Tel Aviv routes.For those customers traveling in Polaris and United Premium Plus, additional dining enhancements can be found in the all Kosher snack choices for mid-flight enjoyment. The new offerings include Deep River Potato Chips, Cheez-It® crackers, Drizzilicious Cinnamon Swirl crisps, Madi K's Almonds and M&M'S®. New beverage options will include Kosher wine provided by Royal Wine, another New Jersey-based company, which includes Herzog Lineage Cabernet Sauvignon and Herzog Lineage Sauvignon Blanc throughout the Polaris cabin. Additionally, building on the airline's partnership with Illy coffee, United is upgrading its Kosher coffee to provide both regular and decaf Illy coffee within all cabins over the next several months.Part of the Kosher expansion includes the airport experience where United is testing the addition of a hot Kosher à la carte meal option in the Newark Polaris Lounge to complement the already featured Kosher wines. Additionally, at both the Polaris lounge and United Clubs in Newark and LaGuardia Airports the offerings will include Kosher packaged snacks upon request. For images please visit: https://app.box.com/s/pp4w09s7mw8699n9zwj46thsdd6qllmp Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".   View original content to download multimedia:http://www.prnewswire.com/news-releases/more-than-a-nosh--united-airlines-expands-kosher-culinary-choices-for-customers-traveling-between-the-us-and-tel-aviv-301001600.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines to Offer Denver Travelers More Flights to More Places Than Ever Before",
        "subtitle": "",
        "date": "Feb 7, 2020 11:00AM EST",
        "content": "DENVER, Feb. 7, 2020 /PRNewswire/ -- United Airlines today hosted an event in partnership with Denver International Airport (DEN) celebrating the recent decision from Denver City Council to approve the lease of an additional 24 gates by the airline at DEN, paving the way for local travelers to access more flights to more places than ever before. United Airlines CEO Oscar Munoz joined Denver Mayor Michael B. Hancock to sign United's proposal to amend its current lease, solidifying United's plans to grow its Denver hub from 500 to as many as 700 daily flights by 2025. The additional gates are a combination of newly constructed and existing gates, and part of DEN's $1.5 billion Concourse Expansion Program. \"United Airlines is a vital partner for Denver International Airport, and we're proud they are continuing to invest and grow right here in Denver,\" said Mayor Michael B. Hancock. \"As United increases daily flights and continues to add new routes, they are creating economic opportunities that benefit our entire community.\"On Jan. 21, the Denver City Council unanimously approved an amendment for United's lease of additional gates.\"Just over twenty years ago I moved to Denver with what was then my young, growing family. Ever since, wherever I've lived, I continue to feel great pride at how the Mile High City seems to reach even greater heights, as well as the role United's service plays in driving the region's success,\" said Oscar Munoz, CEO of United Airlines. \"These additional gates will take the starring role Denver plays in our growth strategy to a new level. It will mean more seats, more connections and more destinations as Denver continues to extend the global reach of its businesses and communities. This growth complements the investments we make in key infrastructure, such as the Western Hemisphere's largest flight training center at DEN, and in local communities; because Denver is not just a hub, it feels like home for so many of us in the United family.\"In the past five years, United has added more than 100 flights and almost 40 new markets departing from Denver as the company continues to connect Denver to the world conveniently, comfortably and reliably. United has consistently outperformed its peers at DEN – achieving better on-time performance than its top competitor for each of the last 59 months and, despite operating twice as many flights, United had fewer cancellations the last two years than Denver's second-largest airline. United's international offerings are also growing and the airline's Denver to London route, introduced in 2018, quickly shifted from seasonal to a daily, year-round flight. And due to the success of flights between Denver and London, Frankfurt and Tokyo, United will begin using a larger aircraft, the Boeing 787-9, on these routes starting in June, adding nearly 100 daily seats each way to these popular destinations. United's growing domestic and international flight offerings have also created thousands of additional connection opportunities for customers traveling through Denver.United is proud to employ more than 7,000 professionals in Denver who are committed to delivering an exceptional travel experience to every customer, on every flight, every day. With their continued contributions and the airline's future growth, United will create more than a thousand new, high-quality job opportunities in the coming years.The additional gates, located in Concourse A and B, will offer more mainline and regional capabilities. In addition to the gates, United will expand existing United Clubs and add a new Club on Concourse A. United Airlines in DenverUnited is Denver's largest airline offering more flights and more seats from the Mile High City to more destinations around the world than any other carrier. United operates approximately 500 daily flights to over 170 airports worldwide from Denver. United has a storied history in Denver, serving the community for more than 80 years, and benefits from a great partnership with local leaders who understand the importance of a thriving aviation sector. The company's commitment to Denver extends beyond the airport and is home to United's Flight Training Center, a state-of-the-art facility where the company's more than 12,000 pilots train every year. The company has a commitment to giving back to the community where many of its customers and employees live and work. United supports local organizations like Girls Inc., Mile High Youth Corps, Wings Over the Rockies and the Denver Public Schools Foundation and, in 2018, announced a $1 million grant to local Denver nonprofit Warren Village. Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".   View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-to-offer-denver-travelers-more-flights-to-more-places-than-ever-before-301000742.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines to Become Only Major U.S. Carrier To Own and Operate a Flight Training Academy Focused on Training and Developing Aspiring Pilots",
        "subtitle": "",
        "date": "Feb 5, 2020 11:00AM EST",
        "content": "CHICAGO, Feb. 5, 2020 /PRNewswire/ -- United Airlines today further expanded its innovative Aviate pilot program by signing a purchase agreement to become the only major U.S. carrier to own a flight training academy. The United Aviate Academy will give the airline more visibility and direction over the recruitment, development and training of future pilots, enabling United to increase the percentage of women and minorities who become pilots. United expects approximately 300 students to graduate from the United Aviate Academy in its first full year of operation.  The flight training academy – currently operating as Westwind School of Aeronautics in Phoenix, Arizona – will be an extension of the airline's Aviate program, a pilot development and recruitment program that offers aspiring aviators the most direct path to achieve their dreams of becoming a United pilot. The airline anticipates hiring more than 10,000 pilots by 2029.\"We have developed the Aviate program in collaboration with the Air Line Pilots Association, International to have greater influence on the next generation of aviators at United,\" said Captain Bebe O'Neil, United's managing director of Aviate. \"Launching our own academy provides us with the unique opportunity to not only ensure we maintain the ideal number of quality candidates within our pilot pipeline, but also play a significant role in recruiting, developing and welcoming those with diverse backgrounds to the United family.\"In addition to launching the flight academy, United plans to reduce financial barriers to joining the program, making the dream of becoming a United pilot even more accessible to more individuals. The carrier is currently engaging with financial institutions with the goal of making attractive financing terms – such as industry-tailored grace periods and competitive interest rates – available to qualified individuals. Additionally, United plans to launch a scholarship program specifically focused on encouraging women and minorities to consider joining the United family. The airline will provide more details regarding these financing options as they become available. Aviate partners currently include:Aviate: Love to fly, born to leadLast year, United launched Aviate, its innovative pilot recruitment and development program. Those who apply to Aviate and are successful in the selection process will receive a program acceptance job offer with United. Aviate also provides support and coaching for pilots to develop into leaders who exemplify the professionalism, level of excellence and commitment to providing safe, caring, dependable and efficient service that United expects from its pilots. Additionally, Aviate provides those who aspire to a career as a United captain with the most direct route to achieving that goal. United's Aviate career path program offers pilots competitive benefits, including:For more information on Aviate, please visit unitedaviate.com About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 5,000 flights a day to 362 airports across five continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 579 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".   View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-to-become-only-major-us-carrier-to-own-and-operate-a-flight-training-academy-focused-on-training-and-developing-aspiring-pilots-300999566.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines Earns 100% Score on Human Rights Campaign Foundation's Annual Scorecard on LGBTQ+ Workplace Equality",
        "subtitle": "",
        "date": "Jan 27, 2020 12:15PM EST",
        "content": "CHICAGO, Jan. 27, 2020 /PRNewswire/ -- United Airlines today announced it has received a perfect score of 100% on the 2020 Corporate Equality Index (CEI), a premier benchmarking survey and report on corporate policies and practices related to LGBTQ+ workplace equality, administered by the Human Rights Campaign (HRC) Foundation. This is the ninth consecutive year the airline receives a 100% score.   \"United is proud to receive this recognition as it speaks to our commitment to not only promoting an LGBTQ+-friendly workplace but LGBTQ+-friendly skies,\" said Kate Gebo, United's Executive Vice President of Human Resources and Labor Relations. \"We will continue working with organizations like the Human Rights Campaign to help champion LGBTQ+ inclusion because United believes in breaking down barriers to create a more welcoming world for all who explore it.\"\"The impact of the Human Rights Campaign's Corporate Equality Index over its 18-year history is profound. In this time, the corporate community has worked with us to adopt LGBTQ+-inclusive policies, practices and benefits, establishing the Corporate Equality Index as a primary driving force for LGBTQ+ workplace inclusion in America and across the globe,\" said HRC President Alphonso David. \"These companies know that protecting their LGBTQ+ employees and customers from discrimination is not just the right thing to do -- it is also the best business decision.\"United's commitment to LGBTQ+ equality includes being the first U.S. airline to fully recognize domestic partnerships in 1999 to becoming the first U.S. airline to offer non-binary gender options throughout all of its booking channels in 2019. Additionally, during its Pride Month celebration in 2019, United became the first public company to be inducted into Pride Live's Stonewall Ambassador program United has partnered with the Human Rights Campaign on training initiatives including educating employees about preferred pronouns and the persistence of gender norms and other steps to make United an inclusive space for both customers and employees. The airline's latest efforts include developing comprehensive training modules and exercises to continue employee education on how to be a better ally in both the workplace and to customers. Over the past year, United has also opened more LGBTQ+ Business Resource Groups across the country, reaching more employees.Alongside partner organizations, customers and employees, United will continue working to build the world's most inclusive airline. For more information on United's commitment to diversity and inclusion, visit https://hub.united.com/diversity-inclusion-fact-sheet/.Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".  View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-earns-100-score-on-human-rights-campaign-foundations-annual-scorecard-on-lgbtq-workplace-equality-300993651.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Adds 29 New Flights to Miami for the Big Game",
        "subtitle": "",
        "date": "Jan 23, 2020 12:18PM EST",
        "content": "CHICAGO, Jan. 23, 2020 /PRNewswire/ -- United Airlines is offering football fans across the United States more options to get to Miami for the Big Game. United is offering fans more than 5,600 seats through 29 additional nonstop flights to Miami from its seven U.S. hubs including Los Angeles and seven special point-to-point flights between Kansas City and Miami. Tickets are now available for purchase on united.com. \"This year we're offering football fans from every corner of the country more opportunities than ever to get to Miami for the Big Game including extra flights between San Francisco and Miami and new service between Kansas City and Miami,\" said Ankit Gupta, United's vice president of Domestic Network Planning. \"In addition to our expanded network to Miami for the game, travelers can easily get to Miami via United's 25 daily flights to Fort Lauderdale's Hollywood International Airport from Chicago, Denver, Houston, New York/Newark, San Francisco, Washington Dulles and Cleveland.\"Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".  View original content to download multimedia:http://www.prnewswire.com/news-releases/united-adds-29-new-flights-to-miami-for-the-big-game-300992322.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines Reaches 2020 Adjusted Earnings Per Share Target One Year Ahead Of Schedule",
        "subtitle": "",
        "date": "Jan 21, 2020 4:15PM EST",
        "content": "CHICAGO, Jan. 21, 2020 /PRNewswire/ -- United Airlines (UAL) today announced it reached its 2020 goal -- first announced in January 2018 -- to achieve adjusted diluted earnings per share (EPS) target2 of $11 to $13 a full year ahead of schedule. The company also achieved full year pre-tax margin growth of 2.6 points, which is expected to outpace its largest competitors for 2019.\"2019 was a great year for our United team -- highlighted by achieving our $11 to $13 adjusted EPS target a full year ahead of schedule,\" said Oscar Munoz, CEO of United Airlines. \"With a four-quarter streak of expanding profit margins, when all the results are in we expect our full year 2019 pre-tax margin growth to be the highest amongst our largest competitors. When I look at United's fundamental strength, I could not be prouder of what we've accomplished in such a short time. This is the New United we set out to build more than four years ago. As we embark on a new year and decade, I believe the outlook for United's future has never been brighter.\"For more information on UAL's first quarter and full year 2020 guidance, please visit ir.united.com for the company's investor update.2019 HighlightsOperations and EmployeesCustomer ExperienceNetworkFleetCommunity and EnvironmentEarnings CallUAL will hold a conference call to discuss its fourth quarter and full year 2019 financial results as well as its financial and operational outlook for first quarter and full year 2020 on Wednesday, January 22, at 9:30 a.m. Central time / 10:30 a.m. Eastern time. A live, listen-only webcast of the conference call will be available at ir.united.com. The webcast will be available for replay within 24 hours of the conference call and then archived on the website for three months.About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".Safe Harbor Statement under the Private Securities Litigation Reform Act of 1995: Certain statements included in this release are forward-looking and thus reflect our current expectations and beliefs with respect to certain current and future events and anticipated financial and operating performance. Such forward-looking statements are and will be subject to many risks and uncertainties relating to our operations and business environment that may cause actual results to differ materially from any future results expressed or implied in such forward-looking statements. Words such as \"expects,\" \"will,\" \"plans,\" \"anticipates,\" \"indicates,\" \"believes,\" \"estimates,\" \"forecast,\" \"guidance,\" \"outlook,\" \"goals,\" \"targets\" and similar expressions are intended to identify forward-looking statements. Additionally, forward-looking statements include statements that do not relate solely to historical facts, such as statements which identify uncertainties or trends, discuss the possible future effects of current known trends or uncertainties, or which indicate that the future effects of known trends or uncertainties cannot be predicted, guaranteed or assured. All forward-looking statements in this release are based upon information available to us on the date of this release. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances or otherwise, except as required by applicable law. Our actual results could differ materially from these forward-looking statements due to numerous factors including, without limitation, the following: our ability to execute our strategic operating plan, including our growth, revenue-generating and cost-control initiatives; general economic conditions (including interest rates, foreign currency exchange rates, investment or credit market conditions, crude oil prices, costs of aircraft fuel and energy refining capacity in relevant markets); risks of doing business globally, including instability and political developments that may impact our operations in certain countries; demand for travel and the impact that global economic and political conditions have on customer travel patterns; our capacity decisions and the capacity decisions of our competitors; competitive pressures on pricing and on demand; changes in aircraft fuel prices; disruptions in our supply of aircraft fuel; our ability to cost-effectively hedge against increases in the price of aircraft fuel, if we decide to do so; the effects of any technology failures or cybersecurity breaches; disruptions to services provided by third-party service providers; potential reputational or other impact from adverse events involving our aircraft or operations, the aircraft or operations of our regional carriers or our code share partners or the aircraft or operations of another airline; our ability to attract and retain customers; the effects of any terrorist attacks, international hostilities or other security events, or the fear of such events; the mandatory grounding of aircraft in our fleet; disruptions to our regional network; the impact of regulatory, investigative and legal proceedings and legal compliance risks; the success of our investments in other airlines, including in other parts of the world; industry consolidation or changes in airline alliances; the ability of other air carriers with whom we have alliances or partnerships to provide the services contemplated by the respective arrangements with such carriers; costs associated with any modification or termination of our aircraft orders; disruptions in the availability of aircraft, parts or support from our suppliers; our ability to maintain satisfactory labor relations and the results of any collective bargaining agreement process with our union groups; any disruptions to operations due to any potential actions by our labor groups; labor costs; an outbreak of a disease that affects travel demand or travel behavior; the impact of any management changes; extended interruptions or disruptions in service at major airports where we operate; U.S. or foreign governmental legislation, regulation and other actions (including Open Skies agreements, environmental regulations and the United Kingdom's withdrawal from the European Union); the seasonality of the airline industry; weather conditions; the costs and availability of aviation and other insurance; the costs and availability of financing; our ability to maintain adequate liquidity; our ability to comply with the terms of our various financing arrangements; our ability to realize the full value of our intangible assets and long-lived assets; and other risks and uncertainties set forth under Part I, Item 1A., \"Risk Factors,\" of our Annual Report on Form 10-K for the fiscal year ended December 31, 2018, our Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as well as other risks and uncertainties set forth from time to time in the reports we file with the U.S. Securities and Exchange Commission.-tables attached-On January 1, 2019, United Airlines Holdings, Inc. (\"UAL\") adopted Accounting Standards Update No. 2016-02, Leases (\"Topic 842\"). As such, certain previously reported 2018 figures are adjusted in this report on a basis consistent with Topic 842.            View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-reaches-2020-adjusted-earnings-per-share-target-one-year-ahead-of-schedule-300990678.htmlSOURCE  United Airlines"
    },
    {
        "title": "First of Its Kind Jet to Shuttle Travelers Between the Beltway and the Big Apple",
        "subtitle": "",
        "date": "Jan 17, 2020 12:00AM EST",
        "content": "WASHINGTON, Jan. 17, 2020 /PRNewswire/ -- United Airlines today announced a new hourly shuttle service between Washington's Reagan National Airport and New York/Newark Liberty International Airport. United will operate the world's only two-cabin 50-seat regional aircraft – the Bombardier CRJ-550 on most flights. The CRJ-550 is designed for business and leisure travelers who want true-first-class seating, Wi-Fi, more leg room and enough space for every customer to bring a roller bag on board. With this new shuttle service, United will now offer more travel opportunities between these two cities than any other airline in the world. Tickets for the 13 daily flights between New York/Newark and Washington, D.C. will be available for purchase beginning January 18 and service starts on March 29.\"Our customers who regularly travel between Washington, D.C. and New York – one of the busiest routes in the country – have told us they value convenient flights and a comfortable ride above all else,\" said Sarah Murphy, United's senior vice president of United Express. \"With our new shuttle service aboard the one-of-a-kind CRJ-550, United Airlines is the only carrier to deliver both.\"The CRJ-550 is a first-of-its-kind jet boasting a wide variety of premium amenities, including:United's daily shuttle service between New York/Newark-and D.C. starts March 29, 2020Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 581 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".  View original content to download multimedia:http://www.prnewswire.com/news-releases/first-of-its-kind-jet-to-shuttle-travelers-between-the-beltway-and-the-big-apple-300988704.htmlSOURCE  United Airlines"
    },
    {
        "title": "UATP Reports Back-To-Back Record-Breaking Years",
        "subtitle": "The results reflect continuous growth across Key Performance Indicators",
        "date": "Jan 14, 2020 1:35PM EST",
        "content": "WASHINGTON, Jan. 14, 2020 /PRNewswire/ -- The UATP payment network is pleased to announce another multi-record-breaking year in 2019.UATP's Network Charge Volume grew 3% year-over-year while transactions grew by a healthy 15% resulting in all-time records.  \"We are thrilled to start 2020 with back-to-back record-breaking years.  In addition to the continuous growth across key metrics, UATP's Alternative Payment Processing business set an astounding record of 24% year-over-year growth,\" said Ralph Kaiser, president and CEO, UATP. \"UATP continues to deliver sophisticated payment solutions that create value for our Shareholders and Stakeholders.\"  Kaiser continued, \"Our hard work has successfully positioned the Network to accomplish these excellent results allowing UATP to flourish and work towards yet another highly successful year in 2020.\"  UATP's core program consists of the Network Charge Card and AFP Processing business lines.  UATP's offerings allow airlines to reduce the high cost of credit card use and provide important data for accurate travel management. UATP provides corporate data tools, DataStream® and DataMine®, to ensure accurate travel management and supply Level III Data.For more information, visit UATP.com.ABOUT UATPUATP is a global payment network owned and operated by the world's airlines and accepted by thousands of merchants for air, rail and travel agency payments. UATP connects airlines to Alternative Forms of Payment which can expand reach and generate incremental sales globally. UATP offers easy-to-use data tools, DataStream® and DataMine®, which provide comprehensive account details to Issuers and corporate travel buyers for accurate travel management.Accepted as a form of payment for corporate business travel worldwide by airlines, travel agencies and Amtrak®; UATP accounts are issued by: Aeromexico; Air Canada (TSE:AC); Air New Zealand (ANZFF.PK); Air Niugini; Air Serbia; American Airlines (NASDAQ: AAL); APG Airlines; Austrian Airlines; China Eastern Airlines (NYSE: CEA); Delta Air Lines (NYSE: DAL); EL AL Israel Airlines; Etihad Airways; Frontier Airlines; GOL Linhas aereas inteligentes S.A. (NYSE: GOL and Bovespa: GOLL4); Hahn Air; Japan Airlines (9201:JP); JetBlue Airways; Qantas Airways (QUBSF.PK); Shandong Airlines;  Sichuan Airlines; Southwest Airlines; Sun Country Airlines; TUIfly GmbH; Turkish Airlines (ISE:THYAO); United Airlines (NYSE: UAL) and WestJet.AirPlus International issues the UATP-based Company Account for Lufthansa German Airlines.Contact:UATP Corporate CommunicationsWendy Ward, wward@uatp.com +1 202 774 5017  View original content to download multimedia:http://www.prnewswire.com/news-releases/uatp-reports-back-to-back-record-breaking-years-300986838.htmlSOURCE  Universal Air Travel Plan, Inc. (UATP)"
    },
    {
        "title": "New United x Carhartt Uniforms Hit the \"Runway\" Right on Time for Winter",
        "subtitle": "America's premium workwear brand designs one-of-a-kind, weather-resistant uniforms for United's ramp, operations and catering workers across the country",
        "date": "Jan 14, 2020 1:02PM EST",
        "content": "CHICAGO, Jan. 14, 2020 /PRNewswire/ -- Customers are seeing a new look on United Airlines runways. Welcoming the new year, United is debuting new uniforms designed by Carhartt Company Gear (CCG) exclusively for the airline's 28,000 Technical Operations, Ramp Service and Catering Operations employees. CCG worked directly with United employees for nearly three years to create a collection of uniform pieces that deliver hard-working designs that stand up to the unique demands of their jobs.   \"This is more than a fashion statement for United Airlines,\" said Kate Gebo, executive vice president of Human Resources and Labor Relations at United Airlines. \"This highly inclusive design process reflects how highly we value the input of our employees and union leadership.  Every day all over the globe our employees on the ground are facing the coldest colds and the hottest hots. Through our partnership with Carhartt – the leader in workwear – we've confidently created a uniform collection enabling our employees to look good and feel good while continuing to deliver the best service for our customers.\"Approximately 1,000 employees from both domestic and international operations participated in focus groups and \"wear tests\" where their input was used to enhance garment features and functionality.  The Carhartt collection includes over 50 pieces, each designed to address our below-wing workforce's specific needs, like bottoms with custom-design pockets to fit wands and other tools, color-blocking on hi-visibility gear to address dirt and grime and fabrics designed to address the wide range of climate conditions across our system. As a part of this effort, Carhartt also put an emphasis on the women's collection, ensuring these employees have garments that have both proper fit and function. These various design elements and options created will help employees perform safely and efficiently. \"Carhartt Company Gear offers one of the most comprehensive and innovative workwear solutions in the marketplace and our relationship with United is a testament to our custom product offering,\" said Andi Donovan, senior vice president of Carhartt Company Gear. \"Our goal is to work collaboratively with companies to outfit their entire operation with the best gear that fits their specific needs and based on the feedback we've received from those on the front lines at United, the new uniforms are working hard for each and every one of them.\"Download photos and view video of the new uniforms here. The uniform refresh is part of a larger effort to revamp all United uniforms for more than 75,000 employees. Each decision with United's uniform design partners, Tracy Reese, Brooks Brothers and Carhartt, have been driven by employee feedback, with a focus on high quality fabrics, improved breathability and overall enhanced fit. The next step in this cohesive collection will be to complete a second wear test before revealing final designs from Brooks Brothers and Tracy Reese for flight attendants, pilots, and customer service representatives. United expects to share more information in summer 2020. This is one of many recent investments United has made in its employees, demonstrating United's evolving employee culture which has been most recently recognized by the popular job search site indeed.com as a Top 50 Workplace for 2019.Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 5,000 flights a day to 362 airports across five continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 579 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\". About CarharttEstablished in 1889, Carhartt is a global premium workwear brand with a rich heritage of developing rugged products for workers on and off the job. Headquartered in Dearborn, Michigan, with more than 5,500 associates worldwide, Carhartt is family-owned and managed by the descendants of the company's founder, Hamilton Carhartt. For more information, visit www.carhartt.com.Carhartt Company Gear service model provides a wide range of businesses with the brands iconic and rugged products, which were built to serve and protect hardworking people. Learn more about Carhartt Company Gear partnering with United here: https://www.carhartt.com/LeadGeneratorView?storeId=10201&catalogId=10551&langId=-1&campaign=CCG).  View original content:http://www.prnewswire.com/news-releases/new-united-x-carhartt-uniforms-hit-the-runway-right-on-time-for-winter-300986795.htmlSOURCE  United Airlines"
    },
    {
        "title": "New United x Carhartt Uniforms Hit the \"Runway\" Right on Time for Winter",
        "subtitle": "",
        "date": "Jan 14, 2020 1:02PM EST",
        "content": "CHICAGO, Jan. 14, 2020 /PRNewswire/ -- Customers are seeing a new look on United Airlines runways. Welcoming the new year, United is debuting new uniforms designed by Carhartt Company Gear (CCG) exclusively for the airline's 28,000 Technical Operations, Ramp Service and Catering Operations employees. CCG worked directly with United employees for nearly three years to create a collection of uniform pieces that deliver hard-working designs that stand up to the unique demands of their jobs.   \"This is more than a fashion statement for United Airlines,\" said Kate Gebo, executive vice president of Human Resources and Labor Relations at United Airlines. \"This highly inclusive design process reflects how highly we value the input of our employees and union leadership.  Every day all over the globe our employees on the ground are facing the coldest colds and the hottest hots. Through our partnership with Carhartt – the leader in workwear – we've confidently created a uniform collection enabling our employees to look good and feel good while continuing to deliver the best service for our customers.\"Approximately 1,000 employees from both domestic and international operations participated in focus groups and \"wear tests\" where their input was used to enhance garment features and functionality.  The Carhartt collection includes over 50 pieces, each designed to address our below-wing workforce's specific needs, like bottoms with custom-design pockets to fit wands and other tools, color-blocking on hi-visibility gear to address dirt and grime and fabrics designed to address the wide range of climate conditions across our system. As a part of this effort, Carhartt also put an emphasis on the women's collection, ensuring these employees have garments that have both proper fit and function. These various design elements and options created will help employees perform safely and efficiently. \"Carhartt Company Gear offers one of the most comprehensive and innovative workwear solutions in the marketplace and our relationship with United is a testament to our custom product offering,\" said Andi Donovan, senior vice president of Carhartt Company Gear. \"Our goal is to work collaboratively with companies to outfit their entire operation with the best gear that fits their specific needs and based on the feedback we've received from those on the front lines at United, the new uniforms are working hard for each and every one of them.\"Download photos and view video of the new uniforms here. The uniform refresh is part of a larger effort to revamp all United uniforms for more than 75,000 employees. Each decision with United's uniform design partners, Tracy Reese, Brooks Brothers and Carhartt, have been driven by employee feedback, with a focus on high quality fabrics, improved breathability and overall enhanced fit. The next step in this cohesive collection will be to complete a second wear test before revealing final designs from Brooks Brothers and Tracy Reese for flight attendants, pilots, and customer service representatives. United expects to share more information in summer 2020. This is one of many recent investments United has made in its employees, demonstrating United's evolving employee culture which has been most recently recognized by the popular job search site indeed.com as a Top 50 Workplace for 2019.Every customer. Every flight. Every day.United continues to strengthen its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, United recently:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 5,000 flights a day to 362 airports across five continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 579 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\". About CarharttEstablished in 1889, Carhartt is a global premium workwear brand with a rich heritage of developing rugged products for workers on and off the job. Headquartered in Dearborn, Michigan, with more than 5,500 associates worldwide, Carhartt is family-owned and managed by the descendants of the company's founder, Hamilton Carhartt. For more information, visit www.carhartt.com.Carhartt Company Gear service model provides a wide range of businesses with the brands iconic and rugged products, which were built to serve and protect hardworking people. Learn more about Carhartt Company Gear partnering with United here: https://www.carhartt.com/LeadGeneratorView?storeId=10201&catalogId=10551&langId=-1&campaign=CCG).  View original content:http://www.prnewswire.com/news-releases/new-united-x-carhartt-uniforms-hit-the-runway-right-on-time-for-winter-300986795.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines to Hold Live Webcast of Fourth-Quarter and Full-Year 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 7, 2020 4:15PM EST",
        "content": "CHICAGO, Jan. 7, 2020 /PRNewswire/ -- United Airlines will hold a conference call to discuss fourth-quarter and full-year 2019 financial results on Wednesday, January 22, at 9:30 a.m. CT/10:30 a.m. ET. A live, listen-only webcast of the conference call will be available at ir.united.com. The company will issue its fourth-quarter and full-year 2019 financial results and first-quarter 2020 investor update after market close on Tuesday, January 21.The webcast will be available for replay within 24 hours of the conference call and then archived on the website for three months.Notable Special ChargesFor fourth quarter 2019, the company expects to record a special non-cash impairment charge of $90 million associated with its Hong Kong routes. The company conducted its annual impairment review of intangible assets in the fourth quarter of 2019, which consisted of a comparison of the book value of specific assets to the fair value of those assets calculated using the discounted cash flow method. Due to a decrease in demand for the Hong Kong market and the resulting decrease in unit revenue, the company determined that the value of its Hong Kong routes had been fully impaired. Notwithstanding such impairments, the collateral pledged under the company's term loan continues to be sufficient to satisfy the loan covenants.About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 362 airports across six continents. In 2019, United and United Express operated more than 1.7 million flights carrying more than 162 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York / Newark, San Francisco and Washington, D.C. United operates 791 mainline aircraft and the airline's United Express partners operate 579 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".Safe Harbor Statement under the Private Securities Litigation Reform Act of 1995: Certain statements included in this release are forward-looking and thus reflect our current expectations and beliefs with respect to certain current and future events and anticipated financial and operating performance. Such forward-looking statements are and will be subject to many risks and uncertainties relating to our operations and business environment that may cause actual results to differ materially from any future results expressed or implied in such forward-looking statements. Words such as \"expects,\" \"will,\" \"plans,\" \"anticipates,\" \"indicates,\" \"believes,\" \"estimates,\" \"forecast,\" \"guidance,\" \"outlook,\" \"goals,\" \"targets\" and similar expressions are intended to identify forward-looking statements. Additionally, forward-looking statements include statements that do not relate solely to historical facts, such as statements which identify uncertainties or trends, discuss the possible future effects of current known trends or uncertainties, or which indicate that the future effects of known trends or uncertainties cannot be predicted, guaranteed or assured. All forward-looking statements in this release are based upon information available to us on the date of this release. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances or otherwise, except as required by applicable law. Our actual results could differ materially from these forward-looking statements due to numerous factors including, without limitation, the following: our ability to execute our strategic operating plan, including our growth, revenue-generating and cost-control initiatives; general economic conditions (including interest rates, foreign currency exchange rates, investment or credit market conditions, crude oil prices, costs of aircraft fuel and energy refining capacity in relevant markets); risks of doing business globally, including instability and political developments that may impact our operations in certain countries; demand for travel and the impact that global economic and political conditions have on customer travel patterns; our capacity decisions and the capacity decisions of our competitors; competitive pressures on pricing and on demand; changes in aircraft fuel prices; disruptions in our supply of aircraft fuel; our ability to cost-effectively hedge against increases in the price of aircraft fuel, if we decide to do so; the effects of any technology failures or cybersecurity breaches; disruptions to services provided by third-party service providers; potential reputational or other impact from adverse events involving our aircraft or operations, the aircraft or operations of our regional carriers or our code share partners or the aircraft or operations of another airline; our ability to attract and retain customers; the effects of any terrorist attacks, international hostilities or other security events, or the fear of such events; the mandatory grounding of aircraft in our fleet; disruptions to our regional network; the impact of regulatory, investigative and legal proceedings and legal compliance risks; the success of our investments in other airlines, including in other parts of the world; industry consolidation or changes in airline alliances; the ability of other air carriers with whom we have alliances or partnerships to provide the services contemplated by the respective arrangements with such carriers; costs associated with any modification or termination of our aircraft orders; disruptions in the availability of aircraft, parts or support from our suppliers; our ability to maintain satisfactory labor relations and the results of any collective bargaining agreement process with our union groups; any disruptions to operations due to any potential actions by our labor groups; labor costs; an outbreak of a disease that affects travel demand or travel behavior; the impact of any management changes; extended interruptions or disruptions in service at major airports where we operate; U.S. or foreign governmental legislation, regulation and other actions (including Open Skies agreements, environmental regulations and the United Kingdom's withdrawal from the European Union); the seasonality of the airline industry; weather conditions; the costs and availability of aviation and other insurance; the costs and availability of financing; our ability to maintain adequate liquidity; our ability to comply with the terms of our various financing arrangements; our ability to realize the full value of our intangible assets and long-lived assets; and other risks and uncertainties set forth under Part I, Item 1A., \"Risk Factors,\" of our Annual Report on Form 10-K for the fiscal year ended December 31, 2018, our Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as well as other risks and uncertainties set forth from time to time in the reports we file with the U.S. Securities and Exchange Commission.  View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-to-hold-live-webcast-of-fourth-quarter-and-full-year-2019-financial-results-300983062.htmlSOURCE  United Airlines"
    },
    {
        "title": "ExpressJet Airlines, a United Express Carrier, and TWU Reach Tentative Agreement Covering Dispatchers",
        "subtitle": "",
        "date": "Dec 21, 2019 11:43AM EST",
        "content": "ATLANTA, Dec. 21, 2019 /PRNewswire/ -- ExpressJet Airlines, a United Express carrier, announced today that it has reached a tentative agreement with the Transport Workers Union (TWU) covering the carrier's Dispatchers.\"This new agreement recognizes the valuable operational role our Dispatchers play in ensuring ExpressJet's future growth as a trusted United Express Partner,\" said Larry Snyder, Managing Director of the Operations Support Center.  Representatives from TWU and ExpressJet negotiated a four-year agreement that raises wages and acknowledges the continued contributions of ExpressJet's Flight Dispatchers who work in the carrier's Operation Support Center (OSC) in Atlanta, GA. Communication from the Transport Workers Union on the Tentative Agreement can be found at: http://www.twu.org/release-twu-local-592-reaches-tentative-agreement-with-expressjet/. About ExpressJet AirlinesExpressJet Airlines operates as United Express, on behalf of United Airlines (NASDAQ: UAL), to serve more than 100 airports across the United States, Canada and Mexico, with over 3,300 weekly flights from bases in Chicago, Cleveland, Houston and Newark. ExpressJet's fleet includes more than 100 aircraft, including the Embraer ERJ145 and 25 new Embraer E175 aircraft. ExpressJet is a subsidiary of ManaAir, LLC. ManaAir is majority-owned by KAir Enterprises and minority-owned by United Airlines. For further information, contact 404-856-1199, corpcomm@expressjet.com.Corporate Communications Atlanta, Georgia404-856-1199corpcomm@expressjet.com View original content to download multimedia:http://www.prnewswire.com/news-releases/expressjet-airlines-a-united-express-carrier-and-twu-reach-tentative-agreement-covering-dispatchers-300978705.htmlSOURCE  ExpressJet Airlines"
    },
    {
        "title": "United Airlines' MileagePlus Named Best Overall Airline Loyalty Program for 16th Year",
        "subtitle": "MileagePlus also earns award for Best Frequent Flyer Bonus Program",
        "date": "Dec 12, 2019 2:06PM EST",
        "content": "CHICAGO, Dec. 12, 2019 /PRNewswire/ -- For the 16th consecutive year, Global Traveler readers named United Airlines' MileagePlus program the Best Overall Frequent Flyer program in the industry. Global Traveler is a monthly publication with an audience of over half a million business and luxury travelers who vote in the Global Traveler Reader Survey to determine this award. MileagePlus has earned the top spot for loyalty programs since the survey's first year in 2004.Readers also voted MileagePlus Best Frequent-Flyer Bonus Program for the seventh consecutive year. The airline's co-brand MileagePlus Club Card from Chase was voted Best Overall Credit Card Program and Best Credit Card Rewards Program for the eighth consecutive year. The United Explorer Card from Chase was named Best Frequent-Flyer Affinity Credit Card Redemptions in this year's survey.\"MileagePlus earning the Best Overall Frequent Flyer program for the 16th straight year is a sweet achievement for us, most importantly because it is voted on by members and frequent travelers around the world,\" said Luc Bondar, president of MileagePlus and vice president of loyalty at United. \"This year we made a number of improvements to the MileagePlus program, including announcing that miles never expire, and we know these changes continue to make MileagePlus an award-winning program for our members.\"This year, United made numerous enhancements to MileagePlus to make it a more rewarding loyalty program for members at each level. The airline announced that MileagePlus miles never expire, began offering discounted or free CLEAR memberships for members and introduced an industry leading way for Premier Platinum members and above to manage upgrades with the introduction of PlusPoints. United and Star Alliance offer members more than 1,300 destinations for award travel, more than any other U.S. airline. MileagePlus members also have more ways to earn and use their miles than any other U.S. airline loyalty program including opportunities to use miles for once in a lifetime experiences through MileagePlus Exclusives and opportunities to redeem as low as 1,000 miles for eGift cards. Every customer. Every flight. Every day.In 2019, United is focusing more than ever on its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, this year United:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 358 airports across five continents. In 2018, United and United Express operated more than 1.7 million flights carrying more than 158 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 788 mainline aircraft and the airline's United Express partners operate 560 regional aircraft. United is a founding member of Star Alliance, which provides service to 195 countries via 26 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".   View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-mileageplus-named-best-overall-airline-loyalty-program-for-16th-year-300974279.htmlSOURCE  United Airlines"
    },
    {
        "title": "ExpressJet Airlines, a United Express Carrier, Announces a Sign-On Bonus for Qualified A&P Maintenance Technicians",
        "subtitle": "",
        "date": "Dec 9, 2019 5:28PM EST",
        "content": "ATLANTA, Dec. 9, 2019 /PRNewswire/ -- ExpressJet Airlines, a United Express carrier, today announced a sign-on bonus program for new-hire A&P Maintenance Technicians. The bonus program will award Maintenance Technicians up to $18,000 for joining ExpressJet. The specific bonus varies by maintenance base and years of experience. More details on the bonus program are available at: www.expressjet.com/careers/maintenance.\"We are excited to offer this competitive new program to incentivize qualified A&P Maintenance Technicians to come work with us,\" said Bruce Jones, Vice President of Maintenance and Engineering. \"With the new sign-on bonus and the addition of 25 Embraer E175 aircraft to our fleet this year, it has never been a more exciting time to join the ExpressJet maintenance team.\" The bonus will be available to new hire A&P Maintenance Technicians joining the Company in Chicago, Cleveland, Richmond, Knoxville and Houston.About ExpressJet AirlinesExpressJet Airlines operates as United Express, on behalf of United Airlines (NASDAQ: UAL), to serve more than 100 airports across the United States, Canada and Mexico, with over 3,300 weekly flights from bases in Chicago, Cleveland, Houston and Newark. ExpressJet's fleet includes more than 100 aircraft, including the Embraer ERJ145 and 25 new Embraer E175 aircraft. ExpressJet pilots enjoy top-tier pay and quality of life and can choose the Aviate career path to United Airlines. ExpressJet is a subsidiary of ManaAir, LLC. ManaAir is majority-owned by KAir Enterprises and minority-owned by United Airlines. For further information, contact 404-856-1199, corpcomm@expressjet.com.Corporate CommunicationsAtlanta, Georgia404-856-1199corpcomm@expressjet.com View original content to download multimedia:http://www.prnewswire.com/news-releases/expressjet-airlines-a-united-express-carrier-announces-a-sign-on-bonus-for-qualified-ap-maintenance-technicians-300971707.htmlSOURCE  ExpressJet Airlines"
    },
    {
        "title": "United Airlines Announces Leadership Transition",
        "subtitle": "Oscar Munoz, CEO, to become Executive Chairman of the Board of Directors",
        "date": "Dec 5, 2019 8:01AM EST",
        "content": " CHICAGO, Dec. 5, 2019 /PRNewswire/ -- United Airlines (NASDAQ: UAL) today announced that Oscar Munoz, Chief Executive Officer, will transition to the role of Executive Chairman of the Board of Directors of United Airlines Holdings, Inc. in May 2020. As CEO, Munoz has transformed United's culture and set new standards of operational and financial performance. J. Scott Kirby, President, will succeed Munoz as Chief Executive Officer.  \"With United in a stronger position than ever, now is the right time to begin the process of passing the baton to a new leader,\" Munoz said. \"One of my goals as CEO was to put in place a successful leadership transition for United Airlines. I brought Scott to United three years ago, and I am confident that there is no one in the world better equipped to lead United to even greater heights. It has been the honor of my career to lead the 95,000 dedicated professionals who serve United's customers every day. I look forward to continuing to work closely with Scott in the months ahead and supporting the company's ongoing success in my new role.\"Kirby was recruited to United Airlines by Munoz in August 2016, after a three-decade career in the commercial airline business. His appointment reflects a commitment from Munoz and the Board to preserve leadership continuity and demonstrates confidence in the airline's strategy and current trajectory. \"When I joined United as CEO, I laid out ambitious goals to build a new spirit of United by regaining the trust of our employees and customers – and I'm proud of how far we've come,\" Munoz said. \"Along with the successful implementation of the plan our team laid out in January 2018, United's operational and financial performance isn't just better – it's better than ever. By instilling a culture of 'proof not promise,' we have transformed United even faster than we expected and there's an incredible sense of excitement about the future.\"Kirby, a highly-regarded industry leader, has played a pivotal role in enabling United's cultural transformation and successfully executing the company's strategic growth plan.\"I am honored to be named the next CEO of United and to succeed Oscar, whose leadership has been truly transformational for United Airlines,\" Kirby said. \"I look forward to working with Oscar, the Board, our established leadership team and every United employee as we drive forward our proven strategy and focus on being the airline customers choose to fly and return to time and again.\"Munoz will serve as Executive Chairman for a one-year term and will continue to work closely with Kirby, the Board and the United team in shaping United's employee and customer-centric culture. He will also lead the company's Board and continue to engage on behalf of United with a range of external stakeholders. As part of this transition, United's current Chairman, Jane Garvey, will retire from the Board in May 2020 after more than a decade of exceptional service, including serving as Chairman since May 2018. At the request of the Board, Garvey agreed to remain in her role for a year beyond the Board's mandatory retirement age.\"On behalf of the Board of Directors, I cannot thank Oscar enough for his outstanding leadership and commitment to United, and we are pleased that we will continue to benefit from his expertise and experience in his role as Executive Chairman,\" Garvey said. \"Oscar became CEO at one of the most challenging points in United's history, and his focus on putting customers and employees first has transformed United's culture today and successfully positioned the company for tomorrow. One of Oscar's greatest legacies is the best-in-class leadership team he has built, and we have full confidence that Scott is the ideal candidate to lead United into the bright future that lies ahead.\" The company also announced that Ted Philip will become Lead Independent Director following the 2020 Annual Meeting of Shareholders. Philip joined the Board in July 2016 and chairs the Nominating/Governance Committee. He also currently serves on the Board of Directors of Hasbro, Inc. and BRP Inc. \"I could not be more excited about the opportunity that we have at United over the next several years to fulfill this airline's incredible potential,\" Philip said. \"I am proud to work alongside Oscar in guiding United's Board and leadership team, and I am eager to get to work on delivering for all of our stakeholders. The entire Board and I want to thank Jane for her many contributions to United over the last decade, including her highly successful tenure as Chairman.\"All of the changes announced today will take effect following the company's Annual Meeting of Shareholders, scheduled for May 20, 2020.Every customer. Every flight. Every day.In 2019, United is focusing more than ever on its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's news, United recently announced that MileagePlus miles will now never expire, giving members a lifetime to use miles on flights and experiences. Customers now have more free on board snack options as well, with a choice of Lotus Biscoff cookies, pretzels and the Stroopwafel. The airline also recently released a re-imagined version of the most downloaded app in the airline industry, introduced ConnectionSaver – a tool dedicated to improving the experience for customers connecting from one United flight to the next – and launched PlusPoints, a new upgrade benefit for MileagePlus premier members.About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 356 airports across five continents. In 2018, United and United Express operated more than 1.7 million flights carrying more than 158 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 783 mainline aircraft and the airline's United Express partners operate 561 regional aircraft. United is a founding member of Star Alliance, which provides service to 193 countries via 27 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".Safe Harbor Statement under the Private Securities Litigation Reform Act of 1995: Certain statements included in this release are forward-looking and thus reflect our current expectations and beliefs with respect to certain current and future events and anticipated financial and operating performance. Such forward-looking statements are and will be subject to many risks and uncertainties relating to our operations and business environment that may cause actual results to differ materially from any future results expressed or implied in such forward-looking statements. Words such as \"expects,\" \"will,\" \"plans,\" \"anticipates,\" \"indicates,\" \"believes,\" \"estimates,\" \"forecast,\" \"guidance,\" \"outlook,\" \"goals,\" \"targets\" and similar expressions are intended to identify forward-looking statements. Additionally, forward-looking statements include statements that do not relate solely to historical facts, such as statements which identify uncertainties or trends, discuss the possible future effects of current known trends or uncertainties, or which indicate that the future effects of known trends or uncertainties cannot be predicted, guaranteed or assured. All forward-looking statements in this release are based upon information available to us on the date of this release. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances or otherwise, except as required by applicable law. Our actual results could differ materially from these forward-looking statements due to numerous factors including, without limitation, the following: our ability to execute our strategic operating plan, including our growth, revenue-generating and cost-control initiatives; general economic conditions (including interest rates, foreign currency exchange rates, investment or credit market conditions, crude oil prices, costs of aircraft fuel and energy refining capacity in relevant markets); risks of doing business globally, including instability and political developments that may impact our operations in certain countries; demand for travel and the impact that global economic and political conditions have on customer travel patterns; our capacity decisions and the capacity decisions of our competitors; competitive pressures on pricing and on demand; changes in aircraft fuel prices; disruptions in our supply of aircraft fuel; our ability to cost-effectively hedge against increases in the price of aircraft fuel, if we decide to do so; the effects of any technology failures or cybersecurity breaches; disruptions to services provided by third-party service providers; potential reputational or other impact from adverse events involving our aircraft or operations, the aircraft or operations of our regional carriers or our code share partners or the aircraft or operations of another airline; our ability to attract and retain customers; the effects of any terrorist attacks, international hostilities or other security events, or the fear of such events; the mandatory grounding of aircraft in our fleet; disruptions to our regional network; the impact of regulatory, investigative and legal proceedings and legal compliance risks; the success of our investments in other airlines, including in other parts of the world; industry consolidation or changes in airline alliances; the ability of other air carriers with whom we have alliances or partnerships to provide the services contemplated by the respective arrangements with such carriers; costs associated with any modification or termination of our aircraft orders; disruptions in the availability of aircraft, parts or support from our suppliers; our ability to maintain satisfactory labor relations and the results of any collective bargaining agreement process with our union groups; any disruptions to operations due to any potential actions by our labor groups; labor costs; an outbreak of a disease that affects travel demand or travel behavior; the impact of any management changes; extended interruptions or disruptions in service at major airports where we operate; U.S. or foreign governmental legislation, regulation and other actions (including Open Skies agreements, environmental regulations and the United Kingdom's withdrawal from the European Union); the seasonality of the airline industry; weather conditions; the costs and availability of aviation and other insurance; the costs and availability of financing; our ability to maintain adequate liquidity; our ability to comply with the terms of our various financing arrangements; our ability to realize the full value of our intangible assets and long-lived assets; and other risks and uncertainties set forth under Part I, Item 1A., \"Risk Factors,\" of our Annual Report on Form 10-K for the fiscal year ended December 31, 2018, our Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, as well as other risks and uncertainties set forth from time to time in the reports we file with the U.S. Securities and Exchange Commission.  View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-announces-leadership-transition-300969566.htmlSOURCE  United Airlines"
    },
    {
        "title": "United Airlines Sets a Course for the Future With Order of 50 Airbus A321XLR Aircraft",
        "subtitle": "New aircraft will improve operational efficiency, elevate the inflight travel experience and reduce environmental impact",
        "date": "Dec 3, 2019 6:50PM EST",
        "content": "CHICAGO, Dec. 3, 2019 /PRNewswire/ -- United Airlines today announced an order to purchase 50 new Airbus A321XLR aircraft, enabling the carrier to begin replacing and retiring its existing fleet of Boeing 757-200 aircraft and further meet the airline's operational needs by pairing the optimal aircraft with select transatlantic routes. The state-of-the-art aircraft, which United expects to introduce into international service in 2024, will also allow United to explore serving additional destinations in Europe from its East Coast hubs in Newark/New York and Washington. \"The new Airbus A321XLR aircraft is an ideal one-for-one replacement for the older, less-efficient aircraft currently operating between some of the most vital cities in our intercontinental network,\" said Andrew Nocella, United's executive vice president and chief commercial officer. \"In addition to strengthening our ability to fly more efficiently, the A321XLR's range capabilities open potential new destinations to further develop our route network and provide customers with more options to travel the globe.\"The next-generation A321XLR offers customers an elevated inflight experience and features modern amenities including LED lighting, larger overhead bin space and Wi-Fi connectivity. Additionally, the new aircraft lowers overall fuel burn per seat by about 30% when compared to previous generation aircraft, enabling United to further minimize its environmental impact as the carrier moves towards its ambitious goal of reducing its carbon footprint by 50% relative to 2005 levels by 2050.United plans to begin taking delivery of the Airbus A321XLR in 2024. Additionally, the airline will defer the delivery of its order of Airbus A350s until 2027 to better align with the carrier's operational needs.Every customer. Every flight. Every day.In 2019, United is focusing more than ever on its commitment to its customers, looking at every aspect of its business to ensure that the carrier keeps customers' best interests at the heart of its service. In addition to today's announcement, this year United:About UnitedUnited's shared purpose is \"Connecting People. Uniting the World.\" We are more focused than ever on our commitment to customers through a series of innovations and improvements designed to help build a great experience: Every customer. Every flight. Every day. Together, United and United Express operate approximately 4,900 flights a day to 358 airports across five continents. In 2018, United and United Express operated more than 1.7 million flights carrying more than 158 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. United operates 788 mainline aircraft and the airline's United Express partners operate 560 regional aircraft. United is a founding member of Star Alliance, which provides service to 193 countries via 27 member airlines. For more information, visit united.com, follow @United on Twitter and Instagram or connect on Facebook. The common stock of United's parent, United Airlines Holdings, Inc., is traded on the Nasdaq under the symbol \"UAL\".  View original content to download multimedia:http://www.prnewswire.com/news-releases/united-airlines-sets-a-course-for-the-future-with-order-of-50-airbus-a321xlr-aircraft-300968734.htmlSOURCE  United Airlines"
    }
]