[
    {
        "title": "Ulta Beauty Announces Earnings Release Date, Conference Call and Webcast for Fourth Quarter 2019 Results",
        "subtitle": "",
        "date": "Feb 27, 2020 4:03PM EST",
        "content": "    BOLINGBROOK, Ill.--(BUSINESS WIRE)--\nUlta Beauty, Inc. (NASDAQ: ULTA) today announced that the Company will conduct a conference call to discuss its fourth quarter 2019 results on Thursday, March 12, 2020 at 5:00 p.m. Eastern Time / 4:00 p.m. Central Time. A press release detailing the Company’s fourth quarter 2019 results will be issued after the market closes and prior to the call. The conference call will be hosted by Mary Dillon, Chief Executive Officer, and Scott Settersten, Chief Financial Officer.\n\nInvestors and analysts interested in participating in the call are invited to dial (877) 705-6003. The conference call will also be webcast live at http://ir.ultabeauty.com. A replay of the webcast will remain available for 90 days. A replay of the conference call will be available until 11:59 p.m. ET on March 26, 2020 and can be accessed by dialing (844) 512-2921 and entering conference ID number 13699174.\n\nAbout Ulta Beauty \n\nAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.\n\nUlta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.\n\nUlta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of February 1, 2020, Ulta Beauty operates 1,254 retail stores across 50 states and also distributes its products through its website. For more information, visit www.ulta.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200227005749/en/\nInvestor Contacts:\nKiley Rawlins\nVice President, Investor Relations\nkrawlins@ulta.com\n(331) 757-2206\n\nPatrick Flaherty\nSenior Manager, Investor Relations\npflaherty@ulta.com\n(331) 253-3521\n\nMedia Contact:\nOlivia Mata\nSenior Manager, Public Relations\n(630) 410-5408\nSource: Ulta Beauty, Inc."
    },
    {
        "title": "Ulta Beauty Announces Third Quarter Fiscal 2019 Results",
        "subtitle": "",
        "date": "Dec 5, 2019 4:03PM EST",
        "content": "\nNet Sales Increased 7.9%\nComparable Sales Increased 3.2%\nDiluted EPS Increased 3.2% to $2.25\nCompany Updates Fiscal 2019 Guidance\n    BOLINGBROOK, Ill.--(BUSINESS WIRE)--\nUlta Beauty, Inc. (NASDAQ: ULTA) today announced financial results for the thirteen-week period (“Third Quarter”) and thirty-nine week period (“First Nine Months”) ended November 2, 2019 compared to the same periods ended November 3, 2018.\n\n“Our differentiated model is winning in the marketplace,” said Mary Dillon, Chief Executive Officer. “The Ulta Beauty team delivered another quarter of solid top-line performance, gross margin expansion, and EPS growth, despite the current challenges facing the U.S. cosmetics category. We continue to gain market share across all major beauty categories, and we are extending our leadership position by creating stronger connections with our guests and engaging with them in better and more exciting ways.”\n\nFor the Third Quarter of Fiscal 2019\n\nFor the First Nine Months of Fiscal 2019\n\nBalance Sheet\n\nMerchandise inventories, net at the end of the third quarter of fiscal 2019 totaled $1,616.9 million compared to $1,484.6 million at the end of the third quarter of fiscal 2018, representing an increase of $132.4 million. The increase in total inventory was driven by 78 net new stores and timing of shipments ahead of the holiday season. Average inventory per store increased 2.1% compared to the third quarter of fiscal 2018.\n\nThe Company ended the third quarter of fiscal 2019 with $208.8 million in cash and cash equivalents.\n\nRecent Accounting Pronouncement – Leases\n\nOn February 3, 2019, the Company adopted Accounting Standards Codification (ASC) 842 using the modified retrospective approach. The new standard requires leases to be recorded on the balance sheet as lease liabilities with corresponding right-of-use assets. Upon adoption, the Company recognized and measured leases without revising comparative period information or disclosures. The adoption of ASC 842 resulted in the recording of operating lease assets and liabilities of $1.46 billion and $1.84 billion, respectively, as of February 3, 2019. As part of the adoption, the Company recorded an adjustment to retained earnings of $2.4 million.\n\nShare Repurchase Program\n\nDuring the third quarter of fiscal 2019, the Company repurchased 529,404 shares of its common stock at a cost of $128.6 million. During the first nine months of fiscal 2019, the Company repurchased 1,639,438 shares of its common stock at a cost of $506.9 million. As of November 2, 2019, $388.8 million remained available under the $875.0 million share repurchase program announced in March 2019.\n\nStore Expansion\n\nDuring the third quarter of fiscal 2019, the Company opened 31 stores located in Albuquerque, NM; Bethlehem, GA; Cleveland, TN; Columbus, OH; Conroe, TX; Davenport, FL; El Segundo, CA; Georgetown, TX; Germantown, TN; Grand Rapids, MI; Jacksonville, NC; Jeffersonville, IN; Johns Creek, GA; Kearny, NJ; Lake Stevens, WA; Lakewood, WA; Matthews, NC; Millbury, MA; Parsippany, NJ; Pasadena, MD; Perris, CA; Philadelphia, PA; Raleigh, NC; Shirley, NY; Southfield, MI; Topeka, KS; Wareham, MA; West Mifflin, PA; Wheat Ridge, CO; Williamsville, NY; and Yuma, AZ. In addition, the Company closed three stores.\n\nThe Company ended the third quarter of fiscal 2019 with 1,241 stores and square footage of 13,061,791, representing a 6.9% increase in square footage compared to the third quarter of fiscal 2018.\n\nOutlook\n\nThe Company has updated its fiscal 2019 outlook and now expects to:\n\nAs previously discussed, to more closely align with industry practices the Company no longer provides a quarterly outlook. The Company will continue to provide an annual outlook, which it will update on a quarterly basis, as appropriate.\n\nConference Call Information\n\nA conference call to discuss third quarter of fiscal 2019 results is scheduled for today, December 5, 2019, at 5:00 p.m. Eastern Time / 4:00 p.m. Central Time. Investors and analysts interested in participating in the call are invited to dial (877) 705‑6003. The conference call will also be webcast live at http://ir.ultabeauty.com. A replay of the webcast will remain available for 90 days. A replay of the conference call will be available until 11:59 p.m. ET on December 19, 2019 and can be accessed by dialing (844) 512‑2921 and entering conference ID number 13696497.\n\nAbout Ulta Beauty\n\nAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.\n\nUlta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.\n\nUlta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of November 2, 2019, Ulta Beauty operates 1,241 retail stores across 50 states and also distributes its products through its website, which includes a collection of tips, tutorials, and social content. For more information, visit www.ulta.com.\n\nForward‑Looking Statements\n\nThis press release contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, which reflect our current views with respect to, among other things, future events and financial performance. You can identify these forward-looking statements by the use of forward-looking words such as “outlook,” “believes,” “expects,” “plans,” “estimates,” “targets,” “strategies” or other comparable words. Any forward-looking statements contained in this press release are based upon our historical performance and on current plans, estimates and expectations. The inclusion of this forward-looking information should not be regarded as a representation by us or any other person that the future plans, estimates, targets, strategies or expectations contemplated by us will be achieved. Such forward-looking statements are subject to various risks and uncertainties, which include, without limitation: changes in the overall level of consumer spending and volatility in the economy; the possibility that we may be unable to compete effectively in our highly competitive markets; the possibility that the capacity of our distribution and order fulfillment infrastructure and the performance of our newly opened and to be opened distribution centers may not be adequate to support our recent growth and expected future growth plans; our ability to sustain our growth plans and successfully implement our long-range strategic and financial plan; the ability to execute our Efficiencies for Growth cost optimization program; the possibility that cybersecurity breaches and other disruptions could compromise our information or result in the unauthorized disclosure of confidential information; the possibility of material disruptions to our information systems; our ability to gauge beauty trends and react to changing consumer preferences in a timely manner; changes in the wholesale cost of our products; the possibility that new store openings and existing locations may be impacted by developer or co-tenant issues; our ability to attract and retain key executive personnel; natural disasters that could negatively impact sales; our ability to successfully execute our common stock repurchase program or implement future common stock repurchase programs; and other risk factors detailed in our public filings with the Securities and Exchange Commission (the “SEC”), including risk factors contained in our Annual Report on Form 10‑K for the fiscal year ended February 2, 2019, as such may be amended or supplemented in our subsequently filed Quarterly Reports on Form 10‑Q. Our filings with the SEC are available at www.sec.gov. Except to the extent required by the federal securities laws, the Company does not undertake to publicly update or revise its forward-looking statements, whether as a result of new information, future events or otherwise.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191205005817/en/\nInvestor Contacts:\nKiley Rawlins, CFA\nVice President, Investor Relations\nkrawlins@ulta.com\n(331) 757-2206\n\nPatrick Flaherty\nSenior Manager, Investor Relations\npflaherty@ulta.com\n(331) 253-3521\n\nMedia Contact:\nOlivia Mata\nSenior Manager, Public Relations\n(630) 410-5408\nSource: Ulta Beauty, Inc."
    },
    {
        "title": "Ulta Beauty Announces Addition to Board of Directors",
        "subtitle": "",
        "date": "Nov 27, 2019 9:00AM EST",
        "content": "\nPatricia Little Appointed Independent Director \n    BOLINGBROOK, Ill.--(BUSINESS WIRE)--\nUlta Beauty, Inc. (NASDAQ:ULTA) today announced that Patricia Little, former Senior Vice President and Chief Financial Officer of The Hershey Company (NASDAQ: HSY), has been appointed to its Board of Directors effective November 27, 2019.\n\nMs. Little joins the Ulta Beauty board with more than 30 years of professional financial and leadership experience. Patricia retired from her role as Senior Vice President and Chief Financial Officer of The Hershey Company in 2019. Prior to joining Hershey, Patricia was the Executive Vice President and Chief Financial Officer at Kelly Services, Inc. and spent 24 years with Ford Motor Company holding a variety of leadership roles. Ms. Little holds a B.S. from Drake University and an MBA from Carnegie Mellon University.\n\nMs. Little currently serves as a member of the Board of Directors of McCormick & Company, Inc. and is the chair of its Audit Committee.\n\n“We are delighted to welcome Patricia Little to Ulta Beauty’s Board of Directors,” said Mary Dillon, Chief Executive Officer. “Patricia’s deep financial expertise and insights gained from her experience with consumer-oriented and brand-driven companies will be great additions to our Board.”\n\nAbout Ulta Beauty \n\nAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.\n\nUlta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.\n\nUlta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of November 2, 2019, Ulta Beauty operates 1,241 retail stores across 50 states and also distributes its products through its website, which includes a collection of tips, tutorials and social content. For more information, visit www.ulta.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191127005126/en/\nInvestor Contacts:\nKiley Rawlins, CFA\nVice President, Investor Relations\nkrawlins@ulta.com\n(331) 757-2206\n\nPatrick Flaherty\nSenior Manager, Investor Relations\npflaherty@ulta.com\n(331) 253-3521\n\nMedia Contact:\nOlivia Mata\nSenior Manager, Public Relations\n(630) 410-5408\nSource: Ulta Beauty, Inc."
    },
    {
        "title": "Ulta Beauty Announces Earnings Release Date, Conference Call and Webcast for Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Nov 21, 2019 4:03PM EST",
        "content": "    BOLINGBROOK, Ill.--(BUSINESS WIRE)--\nUlta Beauty, Inc. (NASDAQ: ULTA) today announced that the Company will conduct a conference call to discuss its third quarter 2019 results on Thursday, December 5, 2019 at 5:00 p.m. Eastern Time / 4:00 p.m. Central Time. A press release detailing the Company’s third quarter 2019 results will be issued after the market closes and prior to the call. The conference call will be hosted by Mary Dillon, Chief Executive Officer, and Scott Settersten, Chief Financial Officer.\n\nInvestors and analysts interested in participating in the call are invited to dial (877) 705-6003. The conference call will also be webcast live at http://ir.ultabeauty.com. A replay of the webcast will remain available for 90 days. A replay of the conference call will be available until 11:59 p.m. ET on December 19, 2019 and can be accessed by dialing (844) 512-2921 and entering conference ID number 13696497.\n\nAbout Ulta Beauty \n\nAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.\n\nUlta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.\n\nUlta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of November 2, 2019, Ulta Beauty operates 1,241 retail stores across 50 states and also distributes its products through its website. For more information, visit www.ulta.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191121005706/en/\nInvestor Contacts:\nKiley Rawlins\nVice President, Investor Relations\nkrawlins@ulta.com\n(331) 757-2206\n\nPatrick Flaherty\nSenior Manager, Investor Relations\npflaherty@ulta.com\n(331) 253-3521\n\nMedia Contact:\nOlivia Mata\nSenior Manager, Public Relations\n(630) 410-5408\nSource: Ulta Beauty, Inc."
    },
    {
        "title": "Ulta Beauty to Participate in Upcoming Investor Conference",
        "subtitle": "",
        "date": "Sep 24, 2019 4:03PM EDT",
        "content": "    BOLINGBROOK, Ill.--(BUSINESS WIRE)--\nUlta Beauty, Inc. (NASDAQ: ULTA) today announced that the Company will present at the 2019 Wells Fargo Consumer Conference & Beauty Forum on Thursday, September 26, 2019 at 4:40 p.m. Eastern Time / 3:40 p.m. Central Time. The presentation will be hosted by Scott Settersten, Chief Financial Officer, and Dave Kimbell, President & Chief Merchandising and Marketing Officer.\n\nThe presentation will be webcast live at http://ir.ultabeauty.com. A replay of the webcast will remain available for 180 days.\n\nAbout Ulta Beauty\n\nAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.\n\nUlta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.\n\nUlta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of August 3, 2019, Ulta Beauty operates 1,213 retail stores across 50 states and also distributes its products through its website, which includes a collection of tips, tutorials, and social content. For more information, visit www.ulta.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190924005925/en/\nInvestor Contacts:\nKiley Rawlins, CFA\nVice President, Investor Relations\nkrawlins@ulta.com\n(331) 757-2206\n\nPatrick Flaherty\nSenior Manager, Investor Relations\npflaherty@ulta.com\n(331) 253-3521\n\nMedia Contact:\nKaren May\nDirector, Public Relations\n(630) 410-5457\nSource: Ulta Beauty, Inc."
    },
    {
        "title": "Ulta Beauty Announces Addition to Board of Directors",
        "subtitle": "",
        "date": "Sep 19, 2019 9:00AM EDT",
        "content": "\nMike Smith Appointed Independent Director\n    BOLINGBROOK, Ill.--(BUSINESS WIRE)--\nUlta Beauty, Inc. (NASDAQ:ULTA) today announced that Mike Smith, President and Chief Operating Officer of Stitch Fix, Inc. (NASDAQ: SFIX), has been appointed to its Board of Directors effective September 18, 2019.\n\nMr. Smith joins the Ulta Beauty board with more than 27 years of professional experience in the financial services, technology and retail industries. Mike is the President & Chief Operating Officer at Stitch Fix, overseeing operations, styling and client experience, and merchandising. Previously, Mike was COO at Walmart.com where he oversaw all operations for a $5 billion division. Prior to Walmart, Mike worked in business and corporate development in software and consumer internet. He holds a B.A. from the University of Virginia and an M.B.A. from the Haas School at University of California, Berkeley.\n\nMr. Smith currently serves as a member of the Board of Directors of Herman Miller, Inc. and is a member of its Audit Committee.\n\n“We are delighted to welcome Mike Smith to Ulta Beauty’s Board of Directors,” said Mary Dillon, Chief Executive Officer. “Mike’s deep retail experience and strong understanding of data analytics and logistics through a customer-centric lens will be of great value to Ulta Beauty as we continue execute our strategies to drive long-term shareholder value.”\n\nAbout Ulta Beauty \n\nAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.\n\nUlta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.\n\nUlta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of August 3, 2019, Ulta Beauty operates 1,213 retail stores across 50 states and also distributes its products through its website, which includes a collection of tips, tutorials, and social content. For more information, visit www.ulta.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190919005091/en/\nInvestor Contacts:\nKiley Rawlins, CFA\nVice President, Investor Relations\nkrawlins@ulta.com\n(331) 757-2206\n\nPatrick Flaherty\nSenior Manager, Investor Relations\npflaherty@ulta.com\n(331) 253-3521\n\nMedia Contact:\nKaren May\nDirector, Public Relations\n(630) 410-5457\nSource: Ulta Beauty, Inc."
    },
    {
        "title": "Thinking about trading options or stock in Citigroup, Home Depot, Procter & Gamble, Ulta Beauty, or UnitedHealth Group?",
        "subtitle": "",
        "date": "Sep 3, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 3, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for C, HD, PG, ULTA, and UNH.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-citigroup-home-depot-procter--gamble-ulta-beauty-or-unitedhealth-group-300910541.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Ulta Beauty Guests Raise More Than $1.1 Million for Save the Children",
        "subtitle": "Mother's Day Retail Donations Support Brighter Future for Moms and Children Nationwide",
        "date": "May 22, 2019 12:54PM EDT",
        "content": "BOLINGBROOK, Ill., May 22, 2019 /PRNewswire/ -- Ulta Beauty guests brought possibilities to life for mothers and children in rural communities this past Mother's Day season through in-store and online donations totaling more than $1.1 million. All proceeds will benefit Save the Children's Early Steps to School Success program and families impacted by natural disasters in the United States. The partnership reflects the Ulta Beauty Charitable Foundation's (UBCF) mission to increase the number of women and families Ulta Beauty can empower and strengthen through financial support.\"This past Mother's Day season, guests at more than 1,100 stores and online experienced the beauty of giving back with 100 percent of donations benefiting Save the Children's critical early learning and disaster relief programs in the United States,\" said Mary Dillon, Ulta Beauty's chief executive officer. \"We know that in order to ensure a bright future for all children, women and their families need access to early learning opportunities and protection from harm. For 100 years, Save the Children has done whatever it takes – every day and in times of crisis – to transform children's lives and the future we share.\"\"I've never met a mom who didn't want the best for her child, and with Ulta Beauty's partnership, we helped more moms ensure their children are getting the early learning opportunities they need. With 85 percent of a child's brain developed by age three, the quality time moms spend with their young children at home is so very crucial for a child's success – and Save the Children is equipping moms with the tools they need to turn every day moments into brain-building moments,\" said Mark Shriver, Save the Children's senior vice president of U.S. programs & advocacy. \"We're incredibly grateful to Ulta Beauty – and your generous shoppers – for supporting Save the Children this year during the Mother's Day shopping season.\" In addition to its early learning work in America, Save the Children's emergency response teams are on the front lines of every major emergency in the United States, helping meet children's most urgent and unique needs. \"Disasters are scary and disruptive for kids – they take children away from their homes, their schools, their friends and can have lasting consequences,\" said Shriver. \"Save the Children gets parents the essential items they need to continue to care for their children during an emergency and sets up safe spaces in shelters where kids can play, learn and begin to cope. We're on the ground for the long term, partnering with local communities to restore childcare centers and preschools – so kids can get back to learning and recover.\"For more information, please visit www.ulta.com and www.savethechildren.org.   About Ulta BeautyAt Ulta Beauty (NASDAQ: ULTA), the possibilities are beautiful. Ulta Beauty is the largest U.S. beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. In 1990, the Company reinvented the beauty retail experience by offering a new way to shop for beauty – bringing together all things beauty, all in one place. Today, Ulta Beauty has grown to become the top national retailer offering the complete beauty experience.Ulta Beauty brings possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty's own private label. Ulta Beauty also offers a full-service salon in every store featuring hair, skin, brow, and make-up services.Ulta Beauty is recognized for its commitment to personalized service, fun and inviting stores and our industry-leading Ultamate Rewards loyalty program. As of May 4, 2019, Ulta Beauty operates 1,196 retail stores across 50 states and also distributes its products through its website, which includes a collection of tips, tutorials and social content. For more information, visit www.ulta.com.About Save the Children Save the Children believes every child deserves a future. Since our founding 100 years ago, we've changed the lives of more than 1 billion children. In the United States and around the world, we give children a healthy start in life, the opportunity to learn and protection from harm. We do whatever it takes for children – every day and in times of crisis – transforming their lives and the future we share. Follow us on Facebook, Instagram, Twitter and YouTube.   View original content to download multimedia:http://www.prnewswire.com/news-releases/ulta-beauty-guests-raise-more-than-1-1-million-for-save-the-children-300855277.htmlSOURCE  Ulta Beauty"
    },
    {
        "title": "ULTA INVESTIGATION UPDATE BY FORMER LOUISIANA ATTORNEY GENERAL:  Kahn Swick & Foti, LLC Continues to Investigate the Officers and Directors of Ulta Beauty, Inc. - ULTA",
        "subtitle": "",
        "date": "Mar 29, 2019 10:50PM EDT",
        "content": "NEW ORLEANS, March 29, 2019 /PRNewswire/ -- Former Attorney General of Louisiana, Charles C. Foti, Jr., Esq., a partner at the law firm of Kahn Swick & Foti, LLC (\"KSF\"), announces that KSF continues its investigation into Ulta Beauty, Inc. (NasdaqGS: ULTA).  On February 9, 2018, media reports revealed a consumer class action lawsuit filed against Ulta based on a wide-ranging scheme involving employees reselling returned, used products as new.  Then, on February 23, 2018, further media reports recounted statements from a former Ulta employee of being pressured by store managers to resell used products.  Thereafter, the Company and certain of its executives were sued in a securities class action lawsuit, charging them with failing to disclose material information during the Class Period, violating federal securities laws, which is ongoing. Recently, an Ulta shareholder filed a shareholder derivative lawsuit on behalf of the Company against its current and former directors and executives for breaches of fiduciary duty and unjust enrichment stemming from its widespread use of deceptive sales practices, failure to disclose that information to shareholders, and selling off shares of personal Ulta stock for proceeds of more than $97 million before the adverse information became public knowledge.KSF's investigation is focusing on whether Ulta's officers and/or directors breached their fiduciary duties to Ulta's shareholders or otherwise violated state or federal laws.  If you have information that would assist KSF in its investigation, or have been a long-term holder of Ulta shares and would like to discuss your legal rights, you may, without obligation or cost to you, call toll-free at 1-877-515-1850 or email KSF Managing Partner Lewis Kahn (lewis.kahn@ksfcounsel.com), or visit https://www.ksfcounsel.com/cases/nasdaqgs-ulta/ to learn more.About Kahn Swick & Foti, LLCKSF, whose partners include the Former Louisiana Attorney General Charles C. Foti, Jr., is a law firm focused on securities, antitrust and consumer class actions, along with merger & acquisition and breach of fiduciary litigation against publicly traded companies on behalf of shareholders. The firm has offices in New York, California and Louisiana.To learn more about KSF, you may visit www.ksfcounsel.com.Contact:Kahn Swick & Foti, LLCLewis Kahn, Managing Partnerlewis.kahn@ksfcounsel.com1-877-515-18501100 Poydras St., Suite 3200New Orleans, LA 70163  View original content to download multimedia:http://www.prnewswire.com/news-releases/ulta-investigation-update-by-former-louisiana-attorney-general--kahn-swick--foti-llc-continues-to-investigate-the-officers-and-directors-of-ulta-beauty-inc---ulta-300821238.htmlSOURCE  Kahn Swick & Foti, LLC"
    }
]