[
    {
        "title": "Verisk Expands Inspection Collaboration Tool, OneXperience, to Commercial Lines",
        "subtitle": "",
        "date": "Mar 4, 2020 10:00AM EST",
        "content": "JERSEY CITY, N.J., March  04, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, announced today the expansion of its new InsurTech solution OneXperience™ into commercial insurance. This expansion will enable agents and businesses to engage and closely collaborate with insurers by sharing video surveys of commercial properties in real time, helping insurers and their customers accelerate the underwriting process.“Commercial property insurers often rely on sight-unseen or unverified data when underwriting a policy, especially since conducting in-person surveys of some properties can be time-consuming and expensive and can delay quotes,” said Maroun Mourad, president of global underwriting at Verisk. “OneXperience provides agents and policyholders with the ability to conduct live-feed video surveys of commercial properties in collaboration with insurers. Insurers can improve digital engagement with customers and make quicker underwriting decisions with confidence.”OneXperience provides insurers with the ability to engage digitally, empowering them to conduct real-time virtual surveys of commercial buildings, obtain critical insights, and share photos, forms, and documents with all stakeholders. OneXperience, launched last year for home inspections, is built on proven virtual technology: Shared architecture, already used by many insurers for claim settlement through Verisk’s ClaimXperience® platform, is now enabled to facilitate workflow integration throughout the policy life cycle from quote to claim.With OneXperience, insurers can direct the survey to reveal granular details on potential risks and eliminate the gaps between actual conditions at the property and the coverage being provided. Insurers can also use OneXperience to request that Verisk review data submitted through the platform and provide analysis. The platform can be used by agents and insureds at multiple points of engagement from quote to renewal.For more information, visit http://www.verisk.com/onexperience-cl..About Verisk  Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com."
    },
    {
        "title": "Verisk Financial | G2 Partners with KYC SiteScan to Provide Enhanced Merchant Onboarding Automation and Persistent Merchant Monitoring",
        "subtitle": "",
        "date": "Mar 2, 2020 10:00AM EST",
        "content": "BELLEVUE, Wash., and PALO ALTO, Calif., March  02, 2020  (GLOBE NEWSWIRE) -- Verisk Financial | G2, a Verisk (Nasdaq:VRSK) business, has entered a strategic alliance with KYC SiteScan to provide an automated onboarding, underwriting, and ongoing monitoring solution delivered in a single application programming interface (API) or via web terminal. Clients using the combined solution enjoy state-of-the-art KYC business process automation as well as new and ongoing merchant risk detection.G2 has assimilated KYC SiteScan into its product suite. At the same time, KYC SiteScan has integrated the G2 Compass Score® into its reports and API data. Existing and new clients from both organizations will have access to the combined solution with a single request.KYC SiteScan automates the merchant KYC (Know Your Customer) process, enabling merchant processors, independent sales organizations, and acquiring banks to scale merchant underwriting, while providing consistency, quality, speed, auditability, and valuable data that further streamline the merchant underwriting process.G2 can enable safer, more profitable commerce for payments companies and digital platforms. With G2, clients can distinguish bad actors from good actors among the merchants they serve. G2’s Compass Score is a real-time risk assessment tool that provides proprietary merchant-history data, which helps predict the likelihood of fraud or compliance violations.Merging the two products gives clients the information they need to help accelerate merchant onboarding. The joint solution provides data and reports to create automated rule sets and weighted scorecards for underwriting along with data to implement machine learning for underwriting decisions.  “In today’s competitive landscape, boarding velocity can mean the difference between growing or going out of business,” said G2 President Dan Frechtling. “G2 is proud to collaborate with KYC SiteScan to give acquirers the state-of-the-art data and technology they need to automate their merchant onboarding, underwriting, KYC, decisioning, and persistent monitoring.”“KYC SiteScan and G2 provide complementary products that help our many shared clients during the merchant onboarding and ongoing monitoring life cycle,” said Matthew Parker, principal and cofounder of KYC SiteScan. “It’s a natural progression that we band together to make the KYC automation and ongoing merchant monitoring process even easier for existing and new clients.”Both G2 and KYC SiteScan will be participating at the MAC Level Up 20 conference in Las Vegas, March 2–5, 2020, and the upcoming ETA TRANSACT show, April 27–30, 2020.About Verisk Financial | G2G2, a Verisk (Nasdaq:VRSK) business and division of Verisk Financial, has been the world leader in merchant onboarding and monitoring since 2004. Every 30 seconds, clients using G2 discover suspicious activity, such as fraud, illegal medicines, illicit drugs, counterfeit, transaction laundering, and other violations. G2 clients leverage the most complete merchant risk data ever compiled for greater protection and productivity for their businesses. Risk professionals gain insights, refined by machine learning and expert analysts, along with unparalleled client service—all at enterprise scale. To learn more, visit www.g2llc.com.About KYC SiteScanKYC SiteScan, a product of KYC Systems, LLC, was founded in 2011 and operated by veteran payments industry professionals that have automated the business requirements and technology needs for clients seeking worldwide Know Your Customer due diligence on merchants and other businesses. For more information, visit www.kycsitescan.com."
    },
    {
        "title": "Verisk Is Launching New Analytics Platform for Life Insurance Underwriting in Collaboration with SCOR",
        "subtitle": "",
        "date": "Feb 28, 2020 10:00AM EST",
        "content": "JERSEY CITY, N.J., Feb.  28, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, is launching its new analytics platform for automated underwriting of life insurance in collaboration with SCOR, a Tier 1 global reinsurer. Verisk’s new analytics platform is designed to help improve the life insurance buying experience for consumers and support insurers’ digital transformation. The solution uses artificial intelligence (AI) to help life insurers ingest and interpret electronic health records (EHRs) for real-time underwriting decisions once the appropriate consumer consents have been obtained.“Electronic medical records have the potential to become a critical source of data for life insurers looking to streamline underwriting and transform the customer experience,” said Maroun Mourad, president of global underwriting at Verisk. “But it’s been difficult for many insurers to extract and interpret unstructured EHR data, such as doctor’s notes, and make decisions based on the available data. Our new analytics platform—which we’re developing in collaboration with SCOR Global Life—uses advanced AI to automate the process: ingesting EHRs, analyzing their structured and unstructured data, and applying the insurer’s underwriting guidelines.” The new platform will pull records from EHR providers and apply machine learning and natural language processing algorithms to analyze both the structured and unstructured data in those records. The platform will return a score based on Verisk’s medically researched underwriting model. That score can then be modified by insurers based on their proprietary underwriting insights.This solution is ultimately intended to substantially reduce the time needed to obtain an attending physician statement and enable accelerated underwriting. The scores will be validated against SCOR Global Life’s underwriting manual and vetted by its medical research and data science teams. “Our collaboration with Verisk demonstrates our investment in underwriting innovation in order to make life insurance more readily available and more relevant,” said J.C. Brueckner, CEO of SCOR Global Life – U.S. “Access to electronic medical information is essential for life insurers using rules-based decision models for accelerated underwriting. Over time, implementation of EHRs will boost process optimization, lower costs, and reduce application time. By working with Verisk on its new platform, we’ll be helping develop a solution that our clients can use to improve the customer journey and extend protection and peace of mind, which is central to our purpose as a reinsurer.”Verisk plans to incorporate the new solution into SCOR Global Life’s Velogica underwriting system as well as make it available via a stand-alone API. Verisk is actively seeking carrier development partners to help develop, test, and validate the solution.  To learn more about how Verisk is bringing data to life, visit www.verisk.com/life.About VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.About SCOR SESCOR, the fourth largest reinsurer in the world, provides insurance companies with a diversified and innovative range of solutions and services to control and manage risk. Using its experience and expertise (“The Art & Science of Risk”), SCOR provides cutting-edge financial solutions, analytics tools and services in all areas related to risk—in Life & Health insurance (longevity, mortality, LTC, etc.) as well as in P&C insurance (natural catastrophes, agriculture, industry, transport, engineering, etc.). For more information, please visit www.scor.com."
    },
    {
        "title": "NICB Renews Verisk Contract to Manage Aggregated Medical Database",
        "subtitle": "",
        "date": "Feb 25, 2020 10:00AM EST",
        "content": "JERSEY CITY, N.J., Feb.  25, 2020  (GLOBE NEWSWIRE) -- Verisk [Nasdaq:VRSK], a leading data analytics provider, announced today that the National Insurance Crime Bureau (NICB) has renewed its contract for the third time to host and maintain the Aggregated Medical Database (AMD). The partnership has resulted in the development of the AMD’s award-winning platform to identify medical provider fraud for NICB and its member companies.“We’re committed to delivering the highest-quality service, and our ongoing collaboration with Verisk is yet another reason NICB continues to be the thought leader when it comes to insurance fraud and theft,” said Joe Wehrle, president and CEO of NICB. “It’s in the best interest of NICB, our members, and law enforcement partners to use medical and prescription billing data to create innovative solutions that combat medical fraud.”Identifying suspicious behavior in provider billing offers an opportunity for property/casualty insurers to contain expenditures in claims that have a medical component. “Our predictive analytics are applied to the AMD’s contributory information to quickly discover markers of potential fraud, waste, and abuse in medical billing data,” said Richard Della Rocca, president of ISO Claims Analytics, a Verisk business. “This large-scale analysis produces actionable reports that allow NICB to create MedAWARE Alerts that identify suspicious providers that may be negatively affecting their members’ claims costs.” Della Rocca added, “We’re proud of our near 50-year commitment to fighting fraud, and our partnership with NICB strengthens our efforts focused on exposing medical provider fraud.”Through its partnership with NICB on the AMD, Verisk has developed ISO MedSentry®, a predictive analytic solution that detects potential fraud, waste, and abuse across an insurer’s entire book of business. About Verisk  Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com. "
    },
    {
        "title": "Verisk CEO Scott Stephenson to Present at 2020 CEO Investor Forum",
        "subtitle": "",
        "date": "Feb 20, 2020 10:00AM EST",
        "content": "JERSEY CITY, N.J., Feb.  20, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, announced today that Scott Stephenson, chairman, president, and chief executive officer, will present at the 2020 CEO Investor Forum (CIF) at 2 p.m. ET Monday, February 24. Stephenson will provide an overview of Verisk’s business strategy and the company’s approach to balancing strong growth with a commitment to a responsible environmental, social, and governance (ESG) framework.Stephenson will share with investors the global trends Verisk is tracking, including the increasing demand for data analytics, the opportunities and risks of automation, and the challenge of scalability as we transition from fossil fuel energy to alternative sources.In addition, Stephenson will discuss how Verisk harnesses its data analytics to help mitigate global risks in the climate and energy arenas as well as in other areas of concern, such as cyber exposure and building and fire safety. Stephenson will also highlight some of the company’s ESG-related milestones, including balancing 100 percent of its greenhouse gas emissions through investments in purposeful energy reduction initiatives, renewable energy certificates, and carbon offsets.“Verisk welcomes the increased expectations of stakeholders for businesses to play a larger role in making a positive impact on the world. We’re committed to achieving sustained growth while acting responsibly and innovating so our customers can make more informed decisions about risks that affect millions of people around the world each day,” said Stephenson. “We believe that profit and purpose are compatible, and we take steps such as leveraging our own climate change research to inform our customers’ ESG strategies and investments as well as our own.”The CIF provides a platform for select CEOs to share their companies’ long-term plans for sustainable value creation through financial and ESG strategies. The event is hosted by Chief Executives for Corporate Purpose (CECP) and attracts an institutional investor audience that represents a combined $25 trillion in assets under management.To watch Stephenson’s presentation, join the live webcast.About Verisk Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com."
    },
    {
        "title": "Verisk Reports Fourth-Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Feb 18, 2020 4:30PM EST",
        "content": "JERSEY CITY, N.J., Feb.  18, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, today announced results for the fourth quarter and fiscal year ended December 31, 2019.Scott Stephenson, chairman, president, and CEO, said, “The year 2019 was another solid year for Verisk, marked by strong organic constant currency growth in both revenues and adjusted EBITDA. As we move into our second decade as a public company, we’re actively managing our portfolio of businesses to capitalize on our key distinctives and our core competitive advantages. We’re strongly positioned to continue to deliver on our long-term growth model and to drive long-term value creation for all our stakeholders.”Lee Shavel, CFO and executive vice president, said, “Normalizing for the impact of the injunction, Verisk delivered organic constant currency revenue growth of 6.3% and organic constant currency adjusted EBITDA growth of 11.0% in the fourth quarter. Our dividend increase of 8% underscores our confidence in our long-term growth, the stability of our business, and our capital management discipline.”Summary of Results (GAAP and Non-GAAP)(in millions, except per share amounts)Note: Adjusted EBITDA, diluted adjusted EPS, and free cash flow are non-GAAP measures.RevenuesConsolidated revenues increased 10.2% for fourth-quarter 2019 and 5.4% on an OCC basis. Normalizing for the impact of the injunction on roof measurement solutions, which adjusts for $5 million of associated revenue in the prior year period, OCC revenue grew 6.3% in fourth-quarter 2019.Revenues and Revenue Growth by Segment(in millions)Insurance segment revenues grew 7.5% in the fourth quarter of 2019 and 5.2% on an OCC basis.Energy and Specialized Markets segment revenue increased 23.3% in the quarter and 7.1% on an OCC basis, resulting primarily from increases in market and cost intelligence solutions, core research revenues, and environmental health and safety service revenues.Financial Services segment revenue decreased 0.3% in the quarter and increased 2.1% on an OCC basis. Fraud and credit risk management solutions as well as portfolio management solutions experienced growth, but this was partially offset by declines in enterprise data management revenues.Net Income and Adjusted EBITDANet income decreased 9.6%, negatively affected by higher acquisition-related costs (earn-outs) and a higher effective tax rate in the fourth quarter of 2019 versus the prior-year period. Adjusted EBITDA increased 10.3%, and on an OCC basis, adjusted EBITDA increased 9.0% for the fourth quarter of 2019. Normalizing for the impact of the injunction on roof measurement solutions, which adjusts for $5 million of associated revenue in the prior year period, OCC adjusted EBITDA grew 11.0% for fourth-quarter 2019. These increases were positively affected by leverage on solid sales growth and cost discipline.EBITDA and Adjusted EBITDA by Segment(in millions)Note: Consolidated EBITDA and adjusted EBITDA are non-GAAP measures. Margin is calculated as a percentage of revenues.Earnings Per ShareDiluted EPS decreased 8.0% to $0.80 for the fourth quarter of 2019 due to higher acquisition-related costs (earn-outs) and a higher effective tax rate in the fourth quarter of 2019 versus the prior-year period.Diluted adjusted EPS grew 8.7% to $1.13 for the fourth quarter of 2019, reflecting organic growth in the business, contributions from acquisitions, and lower average share count. These increases were offset in part by increases in depreciation and amortization expense, interest expense, and a higher effective tax rate.Cash FlowNet cash provided by operating activities was $176 million for the fourth quarter of 2019, up 1.7%. Capital expenditures were $64 million for the fourth quarter of 2019, down 16.3%. Free cash flow was $112 million for the fourth quarter of 2019, up 16.0%, primarily due to lower capital expenditures.Free cash flow represented 35.3% of adjusted EBITDA for the fourth quarter of 2019, compared with 33.5% in the prior-year period.Business Portfolio ChangesThe company has recently engaged in a series of transactions that focus our portfolio of businesses and position Verisk for continued long-term sustainable growth. On February 1, 2020, the company closed on the previously announced sale of its aerial imagery sourcing group to Vexcel Imaging in exchange for a minority interest in Vexcel. This transaction creates a leading geospatial data library to which Verisk will have full access. In addition, the transaction allows Verisk to focus exclusively on aerial data analytic solutions to better service commercial and insurance customers.On February 5, 2020, the company entered into an agreement to transition its Argus Data Warehouse business to a partner to focus on its core analytics capabilities. This business was in the Financial Services segment.On February 14, 2020, the company closed on the sale of its compliance background screening business for cash proceeds of $24 million. This business was in the Claims vertical of our Insurance segment.DividendOn December 31, 2019, Verisk paid a cash dividend of 25 cents per share of common stock issued and outstanding to the holders of record as of December 13, 2019.On February 12, 2020, Verisk’s Board of Directors approved an 8% increase in our cash dividend to 27 cents per share of common stock issued and outstanding, payable on March 31, 2020, to holders of record as of March 13, 2020.Share RepurchasesIncluding the accelerated share repurchase (ASR) settled in fourth-quarter 2019, the company repurchased approximately 700 thousand shares at an average price of $145.07, for a total cost of $100 million for the fourth quarter of 2019. The company also entered into an additional $50 million ASR agreement; the associated shares will be delivered and settled in February 2020. At December 31, 2019, the company had $128 million remaining under its share repurchase authorization. On February 12, 2020, Verisk’s Board of Directors approved an additional authorization of $500 million.Conference CallVerisk’s management team will host a live audio webcast on Wednesday, February 19, 2020, at 8:30 a.m. EST (5:30 a.m. PST, 1:30 p.m. GMT) to discuss the financial results and business highlights. All interested parties are invited to listen to the live event via webcast on the Verisk investor website at http://investor.verisk.com. The discussion is also available through dial-in number 1-877-755-3792 for U.S./Canada participants or 1-512-961-6560 for international participants.A replay of the webcast will be available for 30 days on the Verisk investor website and also through the conference call number 1-855-859-2056 for U.S./Canada participants or 1-404-537-3406 for international participants using conference ID #2274045.About VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.Forward-Looking StatementsThis release contains forward-looking statements. These statements relate to future events or to future financial performance and involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance, or achievements to be materially different from any future results, levels of activity, performance, or achievements expressed or implied by these forward-looking statements. This includes, but is not limited to, Verisk’s expectation and ability to pay a cash dividend on its common stock in the future, subject to the determination by the Board of Directors and based on an evaluation of company earnings, financial condition and requirements, business conditions, capital allocation determinations, and other factors, risks, and uncertainties. In some cases, you can identify forward-looking statements by the use of words such as “may,” “could,” “expect,” “intend,” “plan,” “target,” “seek,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” or “continue” or the negative of these terms or other comparable terminology. You should not place undue reliance on forward-looking statements, because they involve known and unknown risks, uncertainties, and other factors that are, in some cases, beyond our control and that could materially affect actual results, levels of activity, performance, or achievements.Other factors that could materially affect actual results, levels of activity, performance, or achievements can be found in Verisk’s quarterly reports on Form 10-Q, annual reports on Form 10-K, and current reports on Form 8-K filed with the Securities and Exchange Commission. If any of these risks or uncertainties materialize or if our underlying assumptions prove to be incorrect, actual results may vary significantly from what we projected. Any forward-looking statement in this release reflects our current views with respect to future events and is subject to these and other risks, uncertainties, and assumptions relating to our operations, results of operations, growth strategy, and liquidity. We assume no obligation to publicly update or revise these forward-looking statements for any reason, whether as a result of new information, future events, or otherwise.Notes Regarding the Use of Non-GAAP Financial MeasuresThe company has provided certain non-GAAP financial information as supplemental information regarding its operating results. These measures are not in accordance with, or an alternative for, U.S. GAAP and may be different from non-GAAP measures reported by other companies. The company believes that its presentation of non-GAAP measures provides useful information to management and investors regarding certain financial and business trends relating to its financial condition and results of operations. In addition, the company’s management uses these measures for reviewing the financial results of the company, for budgeting and planning purposes, and for evaluating the performance of senior management.EBITDA, Adjusted EBITDA, and Adjusted EBITDA Expenses: EBITDA represents GAAP net income adjusted for (i) depreciation and amortization of fixed assets; (ii) amortization of intangible assets; (iii) interest expense; and (iv) provision for income taxes. Adjusted EBITDA represents EBITDA adjusted for acquisition-related costs (earn-outs), gain/loss from dispositions (which includes businesses held for sale), nonrecurring gain/loss, and interest income on the subordinated promissory note. Adjusted EBITDA expenses represent adjusted EBITDA net of revenues. The company believes these measures are useful and meaningful because they allow for greater transparency regarding the company’s operating performance and facilitate period-to-period comparison.Adjusted Net Income and Diluted Adjusted EPS: Adjusted net income represents GAAP net income adjusted for (i) amortization of intangible assets, net of tax; (ii) acquisition-related costs (earn-outs), net of tax; (iii) gain/loss from dispositions (which includes businesses held for sale), net of tax; (iv) nonrecurring gain/loss, net of tax; and (v) interest income on the subordinated promissory note, net of tax. Diluted adjusted EPS represents adjusted net income divided by weighted-average diluted shares. The company believes these measures are useful and meaningful because they allow evaluation of the after-tax profitability of the company’s results excluding the after-tax effect of acquisition-related costs and nonrecurring items.Free Cash Flow: Free cash flow represents net cash provided by operating activities determined in accordance with GAAP minus payments for capital expenditures. The company believes free cash flow is an important measure of the recurring cash generated by the company’s operations that may be available to repay debt obligations, repurchase its stock, invest in future growth through new business development activities, or make acquisitions.Organic Constant Currency (OCC): The company’s operating results, such as, but not limited to, revenue and adjusted EBITDA, reported in U.S. dollars are affected by foreign currency exchange rate fluctuations because the underlying foreign currencies in which it transacts change in value over time compared with the U.S. dollar; accordingly, it presents certain constant currency financial information to assess how the company performed excluding the impact of foreign currency exchange rate fluctuations. The company calculates constant currency by translating comparable prior-year-period results at the currency exchange rates used in the current period. The company defines “organic” as operating results excluding the effect of recent acquisitions and dispositions (which include businesses held for sale) that have occurred over the past year. An acquisition is included as organic at the beginning of the calendar quarter that occurs subsequent to the one-year anniversary of the acquisition date. Once an acquisition is included in its current-period organic base, its comparable prior-year-period operating results are also included to calculate organic growth. A disposition (which includes a business held for sale) is excluded from organic at the beginning of the calendar quarter in which the disposition occurs (or when a business meets the held-for-sale criteria under U.S. GAAP). Once a disposition is excluded from its current-period organic base, its comparable prior-year-period operating results are also excluded to calculate organic growth. The organic presentation enables investors to assess the growth of the business without the impact of recent acquisitions for which there is no prior-year comparison. A disposition’s results are removed from all prior periods presented to allow for comparability. The company believes organic constant currency is a useful and meaningful measure to enhance investors’ understanding of the continuing operating performance of its business and to facilitate the comparison of period-to-period performance because it excludes the impact of foreign exchange rate movements, acquisitions, and dispositions.See page 11 for a reconciliation of consolidated adjusted EBITDA. See pages 11 and 12 for a segment results summary and a reconciliation of adjusted EBITDA. See page 12 for a reconciliation of segment adjusted EBITDA margin. See page 13 for a reconciliation of adjusted EBITDA expenses and a reconciliation of diluted adjusted EPS. See page 14 for a reconciliation of net cash provided by operating activities to free cash flow.Attached Financial StatementsPlease refer to the full Form 10-K filing for the complete financial statements and related notes.VERISK ANALYTICS, INC.CONSOLIDATED BALANCE SHEETSAs of December 31, 2019 and 2018VERISK ANALYTICS, INC.CONSOLIDATED STATEMENTS OF OPERATIONSFor the Three and Twelve Months Ended December 31, 2019 and 2018VERISK ANALYTICS, INC.CONSOLIDATED STATEMENTS OF CASH FLOWSFor the Years Ended December 31, 2019 and 2018Non-GAAP ReconciliationsConsolidated Adjusted EBITDA Reconciliation(in millions)Note: Adjusted EBITDA is a non-GAAP measure. Margin is calculated as a percentage of consolidated revenues.Segment Results Summary and Adjusted EBITDA Reconciliation(in millions)Note: Organic revenues and adjusted EBITDA are non-GAAP measures.Segment Results Summary and Adjusted EBITDA Reconciliation (continued)(in millions)Note: Organic revenues and adjusted EBITDA are non-GAAP measures.Segment Adjusted EBITDA Margin ReconciliationNote: Segment adjusted EBITDA margin is calculated as a percentage of respective segment revenues.Consolidated Adjusted EBITDA Expense Reconciliation(in millions)Note: Adjusted EBITDA expenses are a non-GAAP measure.Diluted Adjusted EPS Reconciliation(in millions, except per share amounts)Note: Diluted adjusted EPS is a non-GAAP measure.Free Cash Flow Reconciliation(in millions)Note: Free cash flow is a non-GAAP measure."
    },
    {
        "title": "Duck Creek Technologies and Verisk Announce Additional Verisk Solutions for Duck Creek Platform",
        "subtitle": "",
        "date": "Feb 12, 2020 10:00AM EST",
        "content": "JERSEY CITY, N.J., Feb.  12, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, and Duck Creek Technologies, a leading provider of core system solutions for the property/casualty insurance industry, announced today additional Verisk underwriting solutions, available on Duck Creek’s Content Exchange, that will enable insurer customers to easily access robust data on applicants’ previous coverage and loss history.One of Verisk’s solutions, Coverage VerifierSM, will enable insurers that use Duck Creek solutions to seamlessly submit auto coverage history data to Verisk and gain access to tools to verify coverages of policyholders. Another Verisk solution, A-PLUSTM, will allow Duck Creek’s insurer customers to easily contribute property and auto claims data to Verisk and obtain loss run reports with detailed claim histories on risks they’re looking to insure.These additional solutions are the latest Verisk products currently available on Duck Creek’s Content Exchange. Duck Creek customers can currently access a wide range of Verisk tools through the Content Exchange, including detailed information on the relative risk of vehicles, the replacement costs for specific homes, and robust telematics data from consenting drivers for usage-based insurance programs.“Quick and easy access to robust data is critical for insurers today looking to meet the changing needs of their customers,” said Robert Fletcher, head of global solution partnerships at Duck Creek. “With these new Verisk solutions in the Duck Creek Content Exchange, insurers who use our software will now be able to easily access Verisk tools and make more informed and efficient underwriting decisions.”“Improving the experience for our customers and enhancing their access to our products is a high priority at Verisk,” said Mitch Bierman, assistant vice president of strategic alliances at Verisk. “By integrating these new solutions to Duck Creek’s platform, we’re reducing the need for ad hoc integrations and making it simple for Duck Creek insurers to access detailed information about potential insureds.”Verisk’s Coverage Verifier and A-PLUS solutions are set to launch in the Duck Creek Content Exchange during the first quarter of 2020.About VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.About Duck Creek TechnologiesDuck Creek Technologies is a leading provider of core system solutions to the P&C and General insurance industry. By accessing Duck Creek OnDemand, the company’s enterprise Software-as-a-Service solution, insurance carriers are able to navigate uncertainty and capture market opportunities faster than their competitors. Duck Creek’s functionally rich solutions are available on a stand-alone basis or as a full suite, and all are available via Duck Creek OnDemand. For more information, visit www.duckcreek.com."
    },
    {
        "title": "Verisk Publishes A-PLUS Auto and Property Contribution Accelerators on Guidewire Marketplace",
        "subtitle": "",
        "date": "Feb 6, 2020 10:03AM EST",
        "content": "JERSEY CITY, N.J., Feb.  06, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, has joined with Guidewire, provider of the industry platform that property/casualty insurers rely upon, to publish the A-PLUS™ auto and property contribution accelerators for personal lines. The Ready for Guidewire validated accelerators enable Guidewire customers to easily submit loss history data to Verisk and unlock access to innovative tools that insurers can use to verify past claims activity, make informed pricing decisions, and improve customer satisfaction.With the A-PLUS auto and property contribution accelerators for personal lines, insurers can contribute loss history information to Verisk in the preferred A-PLUS format from within Guidewire ClaimCenter. Data within the Guidewire system is automatically mapped to the A-PLUS record layout, saving insurers the time and expense of manually formatting and uploading this data to Verisk.The new accelerators build on several Verisk data tools already available for users of Guidewire InsuranceSuite and A-PLUS auto and property. Guidewire customers that submit loss history data to Verisk are immediately eligible to purchase the A-PLUS auto and property data ordering service and quickly access loss history data from Verisk using existing accelerators from the Guidewire Marketplace: A-PLUS Auto for PolicyCenter and A-PLUS Property Integration for PolicyCenter.In addition, new contributing carriers will be able to take advantage of the A-PLUS Claims Activity Profiler, which enables insurers to optimize loss history report costs via an innovative point-of-quote indicator of an applicant’s existing claims history. The claims history solution can help reduce new business acquisition costs by alerting insurers early in the quoting process to the presence of claims, giving them the option to order a detailed loss history report. If the solution indicates that a prospective customer has no claims, the insurer can decide to avoid the expense of ordering a full loss history report.“It’s critical for insurers to streamline their workflows and focus development efforts to maximize their return on investment,” said Doug Caccese, president of personal lines at ISO, a Verisk business. “The new A-PLUS auto and property contribution accelerators for personal lines make it easy for Guidewire customers to contribute loss information to Verisk in a streamlined manner and gain timelier access to innovative tools, like Claims Activity Profiler, that can help them make more informed pricing decisions.”Verisk is a member of the Guidewire PartnerConnect Solution program, a network of select companies that provide complementary software, technology, data, and insurance support solutions to enhance and extend the capabilities of Guidewire products. Guidewire is also a member of Verisk Strategic Alliances and licenses a wide variety of ISO data, information, and related products.The A-PLUS auto and property contribution accelerators for personal lines are available now in the Guidewire Marketplace.For more information on A-PLUS Auto, visit www.verisk.com/aplus.About VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com. "
    },
    {
        "title": "Verisk to Announce Fiscal Fourth-Quarter 2019 Results on February 18, 2020",
        "subtitle": "",
        "date": "Jan 28, 2020 4:10PM EST",
        "content": "JERSEY CITY, N.J., Jan.  28, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, will report its financial results for the fiscal fourth quarter ended December 31, 2019, on Tuesday, February 18, 2020, after the market close. The press release, with accompanying financial information, will be posted on the Verisk investor website at http://investor.verisk.com.Verisk’s management team will host a live audio webcast to discuss the financial results and business highlights on Wednesday, February 19, 2020, at 8:30 a.m. EST (5:30 a.m. PST, 1:30 p.m. GMT). All interested parties are invited to listen to the live event via webcast on the Verisk investor website at http://investor.verisk.com. The discussion will also be available through dial-in number 1-877-755-3792 for U.S./Canada participants or 512-961-6560 for international participants.A replay of the webcast will be available for 30 days on the Verisk investor website and through the conference call number 1-855-859-2056 for U.S./Canada participants or 404-537-3406 for international participants using Conference ID #2274045.About Verisk   Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.        "
    },
    {
        "title": "Verisk Introduces TrueVIN to Give Auto Insurers Granular Vehicle Details for Underwriting and Pricing",
        "subtitle": "",
        "date": "Jan 22, 2020 10:00AM EST",
        "content": "JERSEY CITY, N.J., Jan.  22, 2020  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, has introduced TrueVIN, a new way for insurers to gain greater insight into detailed physical attributes of vehicles they cover. TrueVIN, the advanced vehicle identification number (VIN) decoder, provides insurers with precise details about how cars and trucks are equipped from the factory, using the complete 17-digit VIN.“A more comprehensive picture of the vehicle is now available, featuring critical information about physical characteristics that often aren’t encoded in the VIN itself,” said Jimmy Engström, director of analytic products at ISO, a Verisk business. “Without access to build sheet data, those vehicle characteristics can be hard to identify, especially for equipment that’s optional. Having that granular knowledge can be extremely helpful in pricing the coverage correctly for the specific vehicle that’s being insured.”TrueVIN can uncover vehicle-specific, as-built details, such as advanced driver-assistance systems (ADAS), and high repair-cost equipment like panoramic sunroofs. The solution supports ISO’s recently introduced ADAS rating factors, which include a manual rule and related rating factors for the ISO Personal Auto Program. Both TrueVIN and the ADAS rating factors can help insurers seamlessly account for the presence of these safety features when underwriting and pricing coverage.“With the spread of ADAS technology such as blind spot intervention, lane departure prevention, and forward collision warning, it’s valuable for insurers to know precisely which features are installed on a specific vehicle,” said Jared Smollik, vice president of personal lines actuarial and analytic products at ISO. “Our analysis of these technologies has revealed a range of implications due to safety on the road as well as repair costs when this sensitive equipment is damaged in accidents.”TrueVIN functions within Verisk’s full suite of ADAS solutions that range from rating factors to VIN-level identification of ADAS features for supporting micro-segmentation of risk.For more information about TrueVIN, visit verisk.com/truevin.About Verisk Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com."
    },
    {
        "title": "Vexcel Imaging to Acquire Image Survey Expertise and Data Assets from Verisk to Support New Strategic Partnership",
        "subtitle": "",
        "date": "Jan 21, 2020 4:30PM EST",
        "content": "JERSEY CITY, N.J., and BOULDER, Colo., Jan.  21, 2020  (GLOBE NEWSWIRE) -- Vexcel Imaging, a leader in aerial imagery data, large-format aerial cameras, and photogrammetry software, today signed a definitive agreement to acquire the imagery sourcing group from Verisk’s Geomni business. The acquisition will combine Geomni’s imagery surveying and content-related teams and assets into Vexcel. Verisk (Nasdaq:VRSK), a leading data analytics provider, will be a minority owner in Vexcel with full access to all aerial imagery libraries.The combination of Geomni’s fleet of fixed-wing aircraft and aerial operations, mapping business, and oblique aerial image library together with Vexcel’s sensor business and data program will create the world’s leading geospatial data library.Geomni’s analytics team and assets will remain part of Verisk and continue to focus on world-class advanced analytics. The team will work closely with Vexcel on a strategic road map and joint projects.“The strategic alliance between Vexcel and Verisk demonstrates both companies’ resolve to drive rapid innovation across imagery and analytics—to enter new markets, create new categories, and better serve commercial and insurance customers,” said Jeffrey C. Taylor, president of Geomni. “Partnering with Vexcel is a huge leap forward in the services we can provide customers.”Vexcel Imaging was founded in 1992. The company’s highly successful line of UltraCam systems was launched with the first UltraCam in 2003. Vexcel is headquartered in Boulder, Colorado; operates an office in Graz, Austria; and will now have teams and operational hubs strategically located throughout the United States and in Spain.“Our alliance with Vexcel benefits our customers through a unified, robust, and rapidly expanding global aerial imagery library that will deepen their understanding of ground truth,” said Mark Anquillare, chief operating officer of Verisk. “The combination of Verisk’s and Vexcel’s data will provide tremendous coverage for customers and help drive Verisk’s proven ability to innovate advanced analytic solutions.”“By combining forces with Verisk, we’re making a progressive move to accelerate innovation within the geospatial data industry,” said Erik Jorgensen, chairman and CEO of Vexcel Imaging. “Vexcel and Verisk share tremendous synergies, and we look forward to bringing the definitive imagery and geospatial data library to the market—unmatched in its size, quality, and breadth.”Vexcel maintains a strong partnership with the Geospatial Intelligence Center (GIC), an insurance industry consortium spearheaded by the National Insurance Crime Bureau (NICB), a nonprofit organization dedicated to fighting insurance fraud and crime, and powered by Vexcel’s data program. The GIC empowers its member insurers to improve their decision making and risk management by leveraging aerial imagery and data in visual tools and automated processes. The partnership will provide enhanced support to GIC member insurers in the form of additional flying and processing capabilities as well as access to the newly scaled and unified geospatial library and enhanced analytics.The transaction is expected to close the first quarter of this year, subject to the completion of customary closing conditions.About Vexcel ImagingFounded in 1992, Vexcel Imaging boasts over twenty-five years of photogrammetric and remote sensing expertise. Its highly successful line of UltraCam systems was launched with the first UltraCam in 2003. In 2006, Vexcel Imaging was acquired by Microsoft Corporation and contributed as a subsidiary to the success of Microsoft’s Bing program by pushing the envelope of photogrammetric hardware and software technology with innovations that underpinned the Bing Maps web service and mapping platform.As a direct result of these advancements, the UltraMap photogrammetric workflow software solution was born and today offers customers an extremely rapid and efficient solution for generating aerial imagery and downstream data products, such as high-density point clouds, digital surface models, and orthophotos. Ten years later, Vexcel Imaging is again a private company and continuing its story of success with renewed and greater flexibility and agility. Learn more about Vexcel Imaging at http://www.vexcel-imaging.com/.About VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.Contact:Investor Relations Stacey Brodbar Head of Investor Relations Verisk 201-469-4327IR@verisk.com  Media Brett Garrison Edelman (for Verisk) 917-639-4903Brett.Garrison@edelman.comBrianna SwalesSwales + Co. PR (for Vexcel)407-924-4497brianna@swalesandcopr.com"
    },
    {
        "title": "Property/Casualty Insurers See Increase in Net Underwriting Gains and Record Surplus in the First Nine Months of 2019",
        "subtitle": "",
        "date": "Jan 16, 2020 12:02PM EST",
        "content": "JERSEY CITY, N.J., Jan.  16, 2020  (GLOBE NEWSWIRE) --  The private U.S. property/casualty insurance industry saw its net underwriting gains increase to $5.4 billion in the first nine months of 2019 from $4.7 billion a year earlier, bolstered by growth in premiums and a drop in catastrophe losses, and its surplus reach a record high of $812.2 billion, according to Verisk (Nasdaq:VRSK), a leading data analytics provider, and the American Property Casualty Insurance Association (APCIA).The surplus grew $70.1 billion in nine-months 2019 as the stock market recovered from a significant downturn at the end of 2018.The industry’s net income after taxes and underwriting gains remained strong despite small declines compared with the prior year. Net income after taxes declined to $48.1 billion for nine-months 2019 from $49.4 billion a year earlier, and insurers’ combined ratio deteriorated to 97.8% from 97.4% a year earlier. Net losses and loss adjustment expenses from catastrophes declined to $21.5 billion for nine-months 2019 from $26.0 billion a year earlier.Net written premium growth slowed to 2.7% in nine-months 2019, after jumping 11.4% a year earlier; in both years, growth was significantly affected by one-time increases in net written premiums caused by the changes multiple insurers made to their reinsurance arrangements in 2018. Net earned premiums grew 4.7%.“The strong economy, along with a drop in catastrophe losses, has helped insurers continue to enjoy strong results and build a record surplus,” said Neil Spector, president of ISO. “But as competition grows and customer expectations rise, insurers increasingly need to boost the speed and precision of their decisions, from underwriting to claims. Those carriers equipped with robust data, powerful analytics, and experienced talent will be the best poised to meet the challenges that lie ahead.”“The U.S. property/casualty insurers’ financial results during the first nine months of 2019 paint a picture of a strong industry with a rock-solid foundation that enables consumers to rest assured that they will be protected when they need it most,” said Robert Gordon, senior vice president for policy, research and international, at APCIA. “Insurers’ capital gains increased during 2019 as global markets rebounded from their worst quarterly fall in seven years during the fourth quarter of 2018. While insurers’ investment income and net income after taxes declined, industry surplus grew, creating an increasingly stable underwriting foundation.”Third-Quarter ResultsInsurers’ net income after taxes fell to $15.3 billion in third-quarter 2019 from $15.4 billion in third-quarter 2018. Their combined ratio improved to 98.8% in third-quarter 2019 from 99.7% a year earlier.Net written premiums rose $9.8 billion, or 6.2%, to $166.2 billion in third-quarter 2019 from $156.5 billion in third-quarter 2018.The contribution of underwriting activities was essentially zero; that is, underwriting had break-even results in third-quarter 2019, which contrasts with a $1.3 billion net underwriting loss in third-quarter 2018.View the full report from Verisk and APCIA here. Net Income Chart_2019 Q3 9-month Net Income Chart_2019 Q3 9-month 2019_Q3_By_The_Numbers_HorizontalAbout VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.About APCIARepresenting nearly 60 percent of the U.S. property casualty insurance industry, the American Property Casualty Insurance Association (APCIA) promotes and protects the viability of a competitive private insurance market for the benefit of consumers and insurers. APCIA represents the broadest cross section of home, auto, and business insurers of any national trade association. APCIA members represent all sizes, structures, and regions, which protect families, communities, and businesses in the U.S. and across the globe. For more information, visit www.pciaa.net.Contact:Brett Garrison Edelman (for Verisk) 917-639-4903 Brett.Garrison@edelman.comJeffrey Brewer for APCIA 847-553-3763Loretta Worters for I.I.I. 212-346-5575\n    Attachments\n"
    },
    {
        "title": "AER Scientists Lead Review Article on the Relationship between Severe Winter Weather and Arctic Warmth",
        "subtitle": "",
        "date": "Jan 13, 2020 9:00AM EST",
        "content": "Lexington, Mass., Jan.  13, 2020  (GLOBE NEWSWIRE) -- A new review article published in Nature Climate Change evaluates the contentious topic of whether severe winter weather in the United States, Europe, and Asia is sensitive to Arctic temperatures. The lead author is Dr. Judah Cohen, director of seasonal forecasting at AER, a Verisk (Nasdaq:VRSK) business.Despite a warming planet, winter weather has remained surprisingly resilient across the midlatitudes of the Northern Hemisphere; and the winter weather headlines have often been about severe cold, heavy snowfalls, and the polar vortex. The unexpected frequency of severe winter weather was not projected by global climate models used to study climate change. It has been challenging for climate scientists to attribute the recent streak of cold, snowy winters to a particular cause.One relatively novel idea has been to attribute severe winter weather across the United States, Europe, and Asia to Arctic amplification, the accelerated warming of the Arctic region at a rate 2 to 3 times faster than the rest of the globe. This accelerated Arctic warming was thought to be mostly due to rapidly melting Arctic sea ice. By contrast, the review article discusses why Arctic warming—which is faster than warming in all other regions—is complicated and not solely due to melting sea ice or snow cover. Increasing water vapor and clouds as well as the transport of heat and moisture from lower latitudes are all contributing to accelerated Arctic warming.Much of the study discusses whether Arctic amplification, including decreasing Arctic sea ice and increasing Eurasian snow cover extent in the fall, is contributing to more severe winter weather across the midlatitudes. The idea is strongly debated among climate scientists and is considered controversial; therefore, until now, the topic has been considered lacking consensus. But the authors of the review article argue there are actually two divergent camps of consensus. One camp of consensus represents the observational studies that strongly argue that Arctic amplification is contributing to more severe winter weather. Low Arctic sea ice coupled with high Eurasian snow cover extent in the fall is ideally located for amplifying naturally occurring waves in the atmosphere that are most favorable for disrupting the polar vortex. Following polar vortex disruptions, the probability of severe winter weather in the United States, Europe, and Asia is greater for up to two months. During the past two winters, polar vortex disruptions unleashed record cold, the “bomb cyclone,” the “Beast from the East,” and other notable severe winter weather events across the United States, Europe, and Asia.The other camp of consensus cites studies based on simulations of low Arctic sea ice using global climate models. The majority of those studies conclude that any observed increase in recent severe winter weather is likely due to chance and not Arctic amplification. In the simulations, sea ice loss does not result in more polar vortex disruptions and contributes to milder winter weather (not severe winter weather) across the United States, Europe, and Asia. Therefore, as the Arctic continues to experience profound changes, it will only contribute to milder winters across the Northern Hemisphere, according to these simulations.“The publication of the paper is especially timely given the extreme winters of 2017/18 and 2018/19 in the U.S., including Alaska and Canada, with a record-warm Arctic and low sea ice especially near Alaska; record-breaking polar vortex disruptions; record-breaking cold; disruptive snowfalls, including severe ‘bomb cyclones’; and costly nor’easters,” said Cohen. “Correctly attributing these disruptive weather events to Arctic change or not should help society better anticipate these events and make the appropriate preparations. Also, properly contextualizing severe winter weather vis-à-vis Arctic change will better educate society to understand the full impacts of climate change.”Cohen adds, “Realizing the dichotomy between observational and modeling studies will possibly break the impasse the climate community is experiencing in trying to understand the linkages between the Arctic and midlatitude weather.”The research is funded by the National Science Foundation’s Division of Atmospheric and Geospace Sciences and Office of Polar Programs.The study can be viewed here.About Atmospheric and Environmental Research (AER) Atmospheric and Environmental Research (AER) provides science-based solutions to global environmental challenges. AER’s internationally renowned scientists and software engineers collaborate to transform state-of-the-art predictive science and analytical tools into practical systems that address both civilian government and defense needs for geophysical understanding, computer simulation, and forecasting. AER customers include government agencies and national laboratories, aerospace and defense contractors, and academia. Areas of expertise comprise atmospheric and environmental science, air quality, remote sensing, meteorology, oceanography, space science, climate change, and software engineering. A Verisk (Nasdaq:VRSK) business, AER was established in 1977 and is headquartered in Lexington, Massachusetts. Visit www.aer.com."
    },
    {
        "title": "Verisk Partners with the International Association of Fire Chiefs to Identify Communities Actively Participating in Recognized Wildfire Mitigation Initiatives",
        "subtitle": "",
        "date": "Dec 17, 2019 10:00AM EST",
        "content": "JERSEY CITY, N.J., Dec.  17, 2019  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, is partnering with the International Association of Fire Chiefs (IAFC) to help insurers identify properties that are located in communities taking action to mitigate wildfire risk.Verisk can now provide insurers with greater insight into mitigation efforts by indicating if a property is part of a community participating in the Ready, Set, Go! (RSG) Program administered by the IAFC. RSG works with local fire departments and community organizations in wildland and wildland-urban interface areas to fight wildfire hazard with risk mitigation measures.“I’m truly excited about this new partnership with Verisk and the ongoing efforts to mitigate the wildfire problem,” said Fire Chief Gary Ludwig, IAFC president and chairman of the board. “This partnership will amplify the crucial importance of proactive mitigation efforts with insurers and open lines of communication between local fire departments and the communities they serve to better protect life and property in the event of a wildland fire.”“Verisk supports coordinated research and education to potentially reduce the scope and severity of wildfire losses,” said Dr. Arindam Samanta, director of product management and innovation at Verisk. “As part of this commitment, we’re partnering with the IAFC through the RSG! Program to help insurers better understand the protective measures communities are taking toward wildfire mitigation at the property level.”This collaboration represents another step in Verisk’s efforts to help carriers manage wildfire risk. The new data is now available upon request to customers of FireLine®, Verisk’s wildfire risk management tool. This first-of-its-kind feature provides address-specific data indicating whether the address is within a community that actively participates in the RSG! Program by implementing wildfire risk reduction actions.About Verisk Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com.About IAFC and the RSG! ProgramSince 1873, the International Association of Fire Chiefs (IAFC) has served as a channel for fire and emergency service expert leaders to collaborate on mitigation efforts. IAFC members are the world’s leading experts in firefighting, emergency medical services, terrorism response, hazardous materials spills, wildfire and natural disasters, search and rescue, and public safety policy. Launched in 2011, the Ready, Set, Go! (RSG) Program is managed by the IAFC to improve collective communication between communities and fire departments on how best to prepare residents and properties in the event of a wildfire. Find out more about the IAFC at www.iafc.org and RSG at www.wildlandfirersg.org."
    },
    {
        "title": "Verisk and Equifax Codevelop Insurance Scoring Solution",
        "subtitle": "The Inflection Insurance Score Helps Personal Auto and Property Insurers Improve Growth and Profitability",
        "date": "Dec 12, 2019 7:48AM EST",
        "content": "JERSEY CITY, N.J., and ATLANTA, Dec. 12, 2019 /PRNewswire/ -- Verisk (Nasdaq:VRSK), a leading data analytics provider, and Equifax Inc. (NYSE:EFX), a data, analytics, and technology leader, have entered into a strategic agreement to jointly develop the InflectionTM Insurance Score. Inflection is a new credit-based scoring solution that combines the robust credit data of Equifax with the insurance expertise and analytics of Verisk to help personal auto and property insurers enhance underwriting and improve growth and profitability. \"Credit-based insurance scores can provide valuable insight into policyholder risk. But these scores must be based on powerful data analytics and delivered quickly to meet the needs of insurers today,\" said Rod Bazzani, general manager of insurance solutions at Equifax. \"The Inflection Insurance Score will leverage comprehensive credit data and advanced predictive modeling, enabling insurers to evaluate and price risk with greater speed and precision.\"  Inflection will provide insurers with a balanced framework in which to evaluate consumers, based on two years of trended credit data. The score will supplement traditional point-in-time snapshots, helping insurers gain a more dynamic picture of risk levels and quickly develop more precise quotes for increased profitability and customer satisfaction. \"Evaluating risk and uncovering growth opportunities are increasing challenges for insurers in today's highly competitive marketplace,\" said Doug Caccese, president of personal lines for ISO, a Verisk business. \"Inflection presents a way for insurers to take their underwriting to the next level, with a solution that can help improve risk segmentation, pricing, and the customer experience across the policy life cycle.\" The Inflection Insurance Score will be available to insurers from both Equifax and Verisk and can be easily integrated with existing insurance workflows. For more information, please visit https://www.verisk.com/inflection or equifax.com/inflection.About VeriskVerisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor's S&P 500® Index. In 2018, Forbes magazine named Verisk to its World's Best Employers list. For more information, please visit www.verisk.com.ABOUT EQUIFAX INC.Equifax is a global data, analytics, and technology company and believes knowledge drives progress. The Company blends unique data, analytics, and technology with a passion for serving customers globally, to create insights that power decisions to move people forward. Headquartered in Atlanta, Equifax operates or has investments in 24 countries in North America, Central and South America, Europe, and the Asia Pacific region. It is a member of Standard & Poor's (S&P) 500® Index, and its common stock is traded on the New York Stock Exchange (NYSE) under the symbol EFX. Equifax employs approximately 11,000 employees worldwide. For more information, visit Equifax.com and follow the company's news on Twitter and LinkedIn. CONTACT: Brett GarrisonEdelman for Verisk917-639-4903Brett.Garrison@edelman.com Kate Walker for Equifax USIS404-885-8058 MediaInquiries@equifax.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/verisk-and-equifax-codevelop-insurance-scoring-solution-300973822.htmlSOURCE  Equifax Inc."
    },
    {
        "title": "Verisk to Acquire FAST to Strengthen Its Data and Analytics Solutions in Life Insurance and Annuities Market",
        "subtitle": "",
        "date": "Dec 4, 2019 9:15AM EST",
        "content": "JERSEY CITY, N.J., Dec.  04, 2019  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, announced today it has signed a definitive agreement to acquire FAST, a leading software company for the life insurance and annuity industry. FAST offers a flexible policy administration system that helps insurers accelerate underwriting and claims to enhance the customer experience and support profitable growth.“As customer expectations for a fast and easy insurance experience rapidly increase, life insurers are being pressured to modernize operations across the policy life cycle,” said Neil Spector, president of ISO, a Verisk business. “But transitioning from legacy solutions is a major investment in time and money. The plug-and-play software that FAST has developed lets life insurers make this transition in stages and without a large up-front capital commitment.”FAST, which stands for “Flexible Architecture, Simplified Technology,” provides a SaaS suite of out-of-the-box components that life insurers can use to quickly enhance or replace their legacy policy administration systems. FAST software, which is used by a wide range of life insurers, also provides a channel for Verisk to deliver its new innovative analytics to support straight-through underwriting.“The acquisition of FAST will extend our offerings to the life insurance market as we build a comprehensive suite of innovative solutions to support insurer modernization,” said Mark Anquillare, chief operating officer of Verisk. “By working with FAST technology and its customers, we’ll be able to improve our predictive models and offer integrated data analytics to life insurers through an end-to-end workflow solution.”“Verisk has become a leader in developing solutions that help insurers make critical decisions with increased speed and precision,” said Tom Famularo, CEO of FAST. “As part of Verisk, we’ll be able to enhance our software, expand our reach, and provide robust analytics to meet the rapidly changing needs of life insurers and their customers.”To support life insurers across the policy life cycle, Verisk has developed a suite of solutions that apply advanced analytics, automation, and machine learning to existing and emerging data sources. The solutions are designed to transform existing workflows in life insurance underwriting, life and pension analytics, claim insights, compliance and fraud detection, and actuarial and portfolio modeling. To learn more about Verisk’s life insurance solutions, visit verisk.com/life. The purchase price is $193.5 million. The transaction is subject to the completion of customary closing conditions.About FAST FAST, which stands for “Flexible Architecture, Simplified Technology,” is a privately held company located in Iselin, N.J. FAST focuses on solving the challenges our financial services and insurance clients face as they seek to modernize their systems environments or completely replace legacy systems. To learn more about FAST, visit www.fasttechnology.com/.About Verisk  Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com."
    },
    {
        "title": "Verisk's Robert L. Andrews Named Federal Alliance for Safe Homes (FLASH) Board Member of the Year",
        "subtitle": "Award presented during annual National Disaster Resilience Conference",
        "date": "Nov 21, 2019 1:30PM EST",
        "content": "CLEARWATER BEACH, Fla., Nov. 21, 2019 /PRNewswire/ -- Today, the Federal Alliance for Safe Homes (FLASH) presented Robert L. Andrews, vice president and chief field operations officer at Verisk, with the prestigious Board Member of the Year Award at the 2019 National Disaster Resilience Conference. This award is presented to board members who have demonstrated outstanding leadership and made significant contributions to the advancement of disaster safety.Andrews has nationwide operational oversight of all Verisk commercial property field data collection, including survey service (commercial property), public protection, building code, community rating system, and technical training. He joined ISO, a Verisk business, in 1995 and has served as regional manager, regional vice president, and vice president of ISO Community Hazard Mitigation. \"Robert's commitment to the case for strong building codes and standards is unparalleled. Since joining the board in 2016, his experience and insights have been invaluable,\" said FLASH President and CEO Leslie Chapman-Henderson. \"His collaborative nature, contributions, and expertise not only strengthen the FLASH partnership, they also strengthen future building performance and the disaster resilience community.\" Verisk performs site inspections on more than 350,000 commercial properties a year, continually refreshing a database of more than 3.7 million commercial properties to ensure it is accurate, complete, and current. Property insurers use the data to assess risk. \"ISO Community Hazard Mitigation actively works with fire departments, building departments, water suppliers, and municipalities with our Public Protection Classification [PPC®], Building Code Effectiveness Grading Schedule [BCEGS®], water outreach, and emergency communication center review programs,\" said Andrews. \"The participation and partnership of organizations like FLASH can help support the common goal of safer communities.\"About Verisk Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor's S&P 500® Index. In 2018, Forbes magazine named Verisk to its World's Best Employers list. For more information, please visit www.verisk.com.About FLASHThe nonprofit Federal Alliance for Safe Homes (FLASH) is the country's leading consumer advocate for strengthening homes and safeguarding families from natural and man-made disasters. The FLASH partnership includes more than 100 innovative and diverse organizations that share a vision of making America a more disaster-resilient nation, including BASF Corporation, FEMA, Florida Division of Emergency Management, Huber Engineered Woods, International Code Council, ISO / Verisk Analytics, Lowe's, National Weather Service, Portland Cement Association, Simpson Strong-Tie, State Farm, and USAA. In 2008, FLASH and Disney opened the interactive weather experience StormStruck: A Tale of Two Homes, in Lake Buena Vista, Florida. Learn more about FLASH and access free consumer resources by visiting www.flash.org, calling toll-free (877) 221-SAFE (7233), and following @federalalliance on Twitter, on Facebook.com/federalalliance, and the FLASH blog – Protect Your Home in a FLASH.  View original content:http://www.prnewswire.com/news-releases/verisks-robert-l-andrews-named-federal-alliance-for-safe-homes-flash-board-member-of-the-year-300959034.htmlSOURCE  Federal Alliance for Safe Homes (FLASH)"
    },
    {
        "title": "Verisk Launches New Home Inspection Customer Collaboration Tool, OneXperience",
        "subtitle": "",
        "date": "Nov 21, 2019 10:00AM EST",
        "content": "JERSEY CITY, N.J., Nov.  21, 2019  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, announced today the launch of OneXperienceä, a new InsurTech solution that enables digital engagement between policyholders and their insurers during a critical underwriting step—the home inspection.Traditional home inspections, conducted after coverage is bound, can be intrusive for customers, costly for insurers, and time-consuming for everyone involved. And a completed inspection may still miss valuable information. OneXperience helps insurers gain quick, cost-effective access to accurate, current risk data on properties and their contents—without compromising the customer experience—to price and underwrite homeowners policies correctly.“Many insurance consumers today are looking for easy digital interactions when they buy a policy,” said Doug Caccese, president of personal lines at ISO, a Verisk business. “OneXperience enables insurers to engage easily with customers across the policy life cycle—from quote to renewal—as well as gain operational efficiencies that help reduce the cost and time associated with traditional inspections.”OneXperience is built on proven virtual technology: Shared architecture, already used by many insurers for claim settlement through Verisk’s ClaimXperience® platform, is now enabled to facilitate workflow integration throughout the policy life cycle from quote to claim. It enables policyholders to share and upload photos, videos, and other documents that support the inspection process via an app on their mobile devices. The solution yields valuable risk information for insurers on more of the homes they cover, and it gives customers control of a process they may otherwise perceive as intrusive.Insurers can continue to use these tools for customer collaboration at multiple points of engagement, including reinspection upon renewal. OneXperience features customer collaboration tools, including instant messaging and shared calendars, to enable easy two-way communication and help maintain touchpoints over time. The solution also allows insurers to centralize and organize documents at the customer level.For more information, visit https://www.verisk.com/insurance/products/onexperience/.About Verisk Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com."
    },
    {
        "title": "Verisk Elects Laura K. Ipsen to Board of Directors",
        "subtitle": "",
        "date": "Nov 19, 2019 4:05PM EST",
        "content": "JERSEY CITY, N.J., Nov.  19, 2019  (GLOBE NEWSWIRE) -- Verisk (Nasdaq:VRSK), a leading data analytics provider, announces the addition of Laura K. Ipsen to its board of directors, effective January 1. Ipsen has more than 25 years of experience as a technology executive. She’s currently president and chief executive officer of Ellucian, which provides software and services that power more than 2,500 higher education institutions in more than 50 countries.“Verisk serves a spectrum of industries in data- and technology-rich environments, and Laura’s decades of experience in these arenas will further strengthen the composition of our board,” said Verisk Chairman, President, and CEO Scott G. Stephenson. “Her knowledge of the cloud, AI, and global energy efforts will challenge our assumptions and push us to continue finding new ways to solve customer problems using emerging technology.”Previously, Ipsen was general manager and senior vice president for Oracle Marketing Cloud—leading all customer-facing aspects of the business, including sales, account management, marketing, and customer services. Before that, she was corporate vice president of Microsoft’s worldwide public sector organization, where she led a team of more than 2,000 sales and marketing professionals serving government, education, and public healthcare customers in more than 100 countries.Her experience also includes more than a decade at Cisco Systems, where she spearheaded an effort to transform how the world manages energy supplies and built smart-grid solutions for utilities around the world. During her time with Cisco, Ipsen established the company’s global policy and government affairs division, with a focus on Cisco’s policy related to the Internet as well as adoption of broadband access. She’s also held leadership roles at PricewaterhouseCoopers, Acer America, and Hitachi Data Systems.Ipsen served as a member of the Monsanto board of directors from 2010 until 2018, when it was acquired by Bayer. She is also the former chair of the board of the Washington, D.C.–based Information Technology Industry Council.About Verisk  Verisk (Nasdaq:VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor’s S&P 500® Index. In 2018, Forbes magazine named Verisk to its World’s Best Employers list. For more information, please visit www.verisk.com."
    },
    {
        "title": "MIB to Provide Verisk's MVR Indicator to Its 400 Life Insurance Members",
        "subtitle": "MIB Carriers Can Use Tool to Help Control Costs of Ordering Motor Vehicle Reports (MVRs)",
        "date": "Nov 5, 2019 10:13AM EST",
        "content": "BRAINTREE, Mass., and JERSEY CITY, N.J., Nov. 5, 2019 /PRNewswire/ -- MIB, the life insurance industry's most trusted and secure resource for the exchange of life insurance underwriting information, today announced an agreement with Verisk (Nasdaq: VRSK), a leading data analytics provider, to make Verisk's MVR Indicator available to MIB's 400 life insurance members at special pricing. The MVR Indicator1 identifies which applicants have driving violations, helping insurers prioritize their ordering of motor vehicle reports. By providing this driving history information through its platform, MIB is arming the life industry with critical tools that can help accelerate underwriting, improve the customer experience, and drive successful growth.\"The MVR Indicator is an important step toward reducing underwriting expenses, eliminating 'empty' MVR reports that do nothing but add needless expense,\" said Lee Oliphant, MIB President and CEO. \"MIB has long been known for protecting the financial integrity of our members. This Verisk service aligns with our mission, enabling our members to put the cost savings directly to their bottom line.\"  \"Driving history can be an important indicator of mortality risk, but its value comes with a significant impact on insurers' underwriting expenses,\" said Maroun Mourad, President of Commercial Lines at ISO, a Verisk business. \"Verisk's partnership with MIB will streamline the life market's access to this crucial information while helping keep costs in check.\"MVR Indicator is the third in a series of ancillary services MIB has added to its underwriting services portfolio this past year, helping member life insurers improve fraud detection and reduce costs in their underwriting workflow. About MIBMIB is the life and health insurance industry's most trusted and secure resource for data-driven risk management services that protect the financial integrity of its members and address their evolving needs. Owned by its members, MIB is uniquely positioned to securely collect and analyze confidential data. MIB services help to detect fraud, errors, and omissions on insurance applications; to analyze industry data needed to manage a variety of financial risks; and to make regulatory reporting compliance less onerous and more efficient. MIB Group, Inc., a membership corporation, provides services through its wholly owned operating subsidiaries, MIB, Inc., and MIB Solutions, Inc. For more information, visit www.mibgroup.com.About Verisk Verisk (Nasdaq: VRSK) is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations that are integrated into customer workflows. Verisk offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, and many other fields. Around the world, Verisk helps customers protect people, property, and financial assets.Headquartered in Jersey City, N.J., Verisk operates in 30 countries and is a member of Standard & Poor's S&P 500® Index. In 2018, Forbes magazine named Verisk to its World's Best Employers list. For more information, please visit www.verisk.com. Contacts:David O. AronsonMIB Group, Inc.781-751-6136daronson@mib.comBrett GarrisonEdelman (for Verisk)917-639-4903Brett.Garrison@edelman.com1 The MVR Indicator is provided through MIB, Inc. to MIB member insurers by the Insurance Information Exchange unit (iiX) of ISO Claims Services, Inc., a Verisk business. View original content to download multimedia:http://www.prnewswire.com/news-releases/mib-to-provide-verisks-mvr-indicator-to-its-400-life-insurance-members-300951911.htmlSOURCE  MIB"
    }
]