[
    {
        "title": "Verisign Reports Fourth Quarter and Full Year 2019 Results",
        "subtitle": "",
        "date": "Feb 6, 2020 4:05PM EST",
        "content": "    RESTON, Va.--(BUSINESS WIRE)--\nVeriSign, Inc. (NASDAQ: VRSN), a global provider of domain name registry services and internet infrastructure, today reported financial results for the fourth quarter and full year 2019.\n\nFourth Quarter GAAP Financial Results\nVeriSign, Inc. and subsidiaries (“Verisign”) reported revenue of $311 million for the fourth quarter of 2019, up 1.0 percent from the same quarter in 2018. Verisign reported net income of $148 million and diluted earnings per share (diluted “EPS”) of $1.26 for the fourth quarter of 2019, compared to net income of $182 million and diluted EPS of $1.50 for the same quarter in 2018. The operating margin was 63.9 percent for the fourth quarter of 2019 compared to 63.1 percent for the same quarter in 2018.\n\nFourth Quarter Non-GAAP Financial Results\nVerisign reported, on a non-GAAP basis, net income of $154 million and diluted EPS of $1.31 for the fourth quarter of 2019, compared to net income of $191 million and diluted EPS of $1.58 for the same quarter in 2018. The non-GAAP operating margin was 67.9 percent for the fourth quarter of 2019 compared to 66.7 percent for the same quarter in 2018. A table reconciling the GAAP to the non-GAAP results (which excludes items described below) is appended to this release.\n\n2019 GAAP Financial Results\nVerisign reported revenue of $1.23 billion for 2019, up 1.4 percent from $1.21 billion in 2018. Verisign reported net income of $612 million and diluted EPS of $5.15 for 2019, compared to net income of $582 million and diluted EPS of $4.75 in 2018. The operating margin for 2019 was 65.5 percent compared to 63.2 percent in 2018.\n\n2019 Non-GAAP Financial Results\nVerisign reported, on a non-GAAP basis, net income of $631 million and diluted EPS of $5.31 for 2019, compared to net income of $620 million and diluted EPS of $5.05 in 2018. The non-GAAP operating margin for 2019 was 69.6 percent compared to 67.5 percent in 2018.\n\nFourth quarter and full year 2018 GAAP net income and non-GAAP net income included $52.0 million and $42.8 million, respectively, related to the gain on the sale of the customer contracts of the security services business. The gain increased GAAP diluted EPS and non-GAAP diluted EPS by $0.43 and $0.36 in the fourth quarter of 2018 and by $0.43 and $0.35 for full year 2018.\n\n“Focused execution yielded another solid quarter that caps off not only a solid year but a strong decade in which we’ve focused on our core business, expanded the domain name base and returned value to our shareholders. In 2019 we marked more than 22 years of uninterrupted availability of the Verisign DNS for .com and .net,” said Jim Bidzos, Executive Chairman, President and Chief Executive Officer.\n\nFinancial Highlights\n\nBusiness Highlights\n\nNon-GAAP Financial Measures and Adjusted EBITDA\n\nVerisign provides quarterly and annual financial statements that are prepared in accordance with generally accepted accounting principles (GAAP). Along with this information, management typically discloses and discusses certain non-GAAP financial measures in quarterly earnings news releases, on investor conference calls and during investor conferences and related events. These non-GAAP financial measures do not include stock-based compensation, non-cash interest expense through June 30, 2018, and loss on debt extinguishment, which are included in the comparable GAAP financial measures. Non-GAAP net income is also adjusted for an income tax rate of 22 percent which differs from the GAAP income tax rate.\n\nOn a quarterly basis, Verisign also provides Adjusted EBITDA. Adjusted EBITDA is a non-GAAP financial measure and is calculated in accordance with the terms of the indentures governing Verisign’s senior notes. Adjusted EBITDA refers to net income before interest, taxes, depreciation and amortization, stock-based compensation, unrealized gain / loss on hedging agreements, and gain on the sale of a business.\n\nManagement believes that this non-GAAP financial data supplements the GAAP financial data by providing investors with additional information that allows them to have a clearer picture of Verisign’s operations and financial performance and the comparability of Verisign’s operating results from period to period. The presentation of these non-GAAP financial measures is not meant to be considered in isolation nor as a substitute for results prepared in accordance with GAAP.\n\nThe tables appended to this release include a reconciliation of the non-GAAP financial information to the comparable financial information reported in accordance with GAAP for the given periods.\n\nToday’s Conference Call\n\nVerisign will host a live conference call today at 4:30 p.m. (EST) to review the fourth quarter and full year 2019 results. The call will be accessible by direct dial at (888) 676-VRSN (U.S.) or (786) 789-4776 (international), conference ID: Verisign. A listen-only live web cast of the conference call and accompanying slide presentation will also be available at https://investor.verisign.com. An audio archive of the call will be available at https://investor.verisign.com/events.cfm. This news release and the financial information discussed on today’s conference call are available at https://investor.verisign.com.\n\nAbout Verisign\n\nVerisign, a global provider of domain name registry services and internet infrastructure, enables internet navigation for many of the world’s most recognized domain names. Verisign enables the security, stability, and resiliency of key internet infrastructure and services, including providing root zone maintainer services, operating two of the 13 global internet root servers, and providing registration services and authoritative resolution for the .com and .net top-level domains, which support the majority of global e-commerce. To learn more about what it means to be Powered by Verisign, please visit Verisign.com.\n\nVRSNF\n\nStatements in this announcement other than historical data and information constitute forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934 as amended. These statements involve risks and uncertainties that could cause our actual results to differ materially from those stated or implied by such forward-looking statements. The potential risks and uncertainties include, among others, risks arising from the agreements governing our business; new or existing governmental laws and regulations in the U.S. or other applicable foreign jurisdictions; system interruptions, security breaches, attacks on the internet by hackers, viruses, or intentional acts of vandalism; the uncertainty of the impact of changes to the multi-stakeholder model of internet governance; risks arising from our operation of two root zone servers and our performance of the Root Zone Maintainer functions; changes in internet practices and behavior and the adoption of substitute technologies; the success or failure of the evolution of our markets; the highly competitive business environment in which we operate; whether we can maintain strong relationships with registrars and their resellers to maintain their marketing focus on our products and services; the possibility of system interruptions or failures; challenging global economic conditions; economic, legal and political risk associated with our international operations; our ability to protect and enforce our rights to our intellectual property and ensure that we do not infringe on others’ intellectual property; the outcome of legal or other challenges resulting from our activities or the activities of registrars or registrants, or litigation generally; the impact of our new strategic initiatives, including our IDN gTLDs; whether we can retain and motivate our senior management and key employees; and the impact of unfavorable tax rules and regulations. More information about potential factors that could affect our business and financial results is included in our filings with the SEC, including in our Annual Report on Form 10-K for the year ended Dec. 31, 2018, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. Verisign undertakes no obligation to update any of the forward-looking statements after the date of this announcement.\n\n©2020 VeriSign, Inc. All rights reserved. VERISIGN, the VERISIGN logo, and other trademarks, service marks, and designs are registered or unregistered trademarks of VeriSign, Inc. and its subsidiaries in the United States and in foreign countries. All other trademarks are property of their respective owners.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200206005770/en/\nInvestor Relations: David Atchley, datchley@verisign.com, 703-948-4643\nMedia Relations: David McGuire, dmcguire@verisign.com, 703-948-3800\nSource: VeriSign, Inc."
    },
    {
        "title": "ICANN and Verisign Announce Proposed Amendment to .COM Registry Agreement",
        "subtitle": "",
        "date": "Jan 3, 2020 9:00AM EST",
        "content": "\nTerms of the Agreement are Open for Public Comment Until Feb. 14, 2020\n    LOS ANGELES & RESTON, Va.--(BUSINESS WIRE)--\nThe Internet Corporation for Assigned Names and Numbers (ICANN) and VeriSign, Inc. (Verisign), the registry operator of the .COM top-level domain (TLD) today announced that they have reached a proposed agreement to amend the .COM Registry Agreement (RA). In addition, ICANN and Verisign announced a new proposed framework for working together on initiatives related to the security, stability and resiliency of the Domain Name System (DNS) in the form of a binding Letter of Intent (LOI) between the two organizations.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200103005209/en/\nTogether, these agreements fulfill commitments that ICANN and Verisign made in 2016 when they previously amended the .COM RA. The new terms, which are now open for public comment, will enhance the security, stability and resiliency of the DNS; provide limited and transparent pricing flexibility for .COM registry services; and standardize the .COM RA by including certain technical and reporting requirements based on terms in other registry agreements between ICANN and the registry operators of other TLDs.\n\nVerisign’s operation of the .COM TLD is governed by two separate agreements: the .COM RA, and the Cooperative Agreement between Verisign and the U.S. Department of Commerce. In 2016, Verisign and ICANN formally agreed that if and when the Department of Commerce and Verisign made changes to the Cooperative Agreement, ICANN and Verisign would negotiate in good faith to ensure those changes were reflected in the .COM RA.\n\nOn Oct. 26, 2018, following a review and deliberation by the U.S. Government, Verisign and the Department of Commerce entered into an amendment that included an extension of the Cooperative Agreement.\n\nUnder the amended Cooperative Agreement, the Department of Commerce noted that the domain name marketplace had grown more dynamic and concluded that it was in the public interest that, among other things, Verisign and ICANN may agree to amend the .COM Registry Agreement to permit an increase to the price for .COM registry services, up to a maximum of 7 percent in each of the final four years of each six-year period (the first six-year period commenced on Oct. 26, 2018). The proposed agreement announced today updates the .COM RA to reflect those changes. ICANN is not a price regulator and defers to the Department of Commerce and the U.S. Department of Justice for the regulation of pricing for .COM registry services.\n\nWhile Verisign does not set retail prices for .COM domain names, the proposed amendment to the .COM RA will provide pricing certainty by limiting the potential maximum wholesale price for .COM domain names. For example, if the four standard price increases are taken in this six-year period, the maximum wholesale price for .COM domain names would be $8.39 no earlier than Oct. 26, 2020 (compared to $7.85 today), and cannot exceed $10.26 until October 2026.\n\nIn addition to aligning the pricing for .COM registry services with the Cooperative Agreement, the updated .COM RA and LOI achieve four additional important objectives:\n\nBecause of the significance of the .COM TLD, these security, stability and resiliency enhancements will benefit internet users worldwide. The .COM TLD is an important part of the internet’s global addressing system, providing the foundation for hundreds of millions of websites, apps, email accounts and core internet infrastructure elements across the globe. The .COM TLD is an important part of global commerce, making its continued secure, stable and resilient operation a top priority for both ICANN and Verisign.\n\nThese obligations expand on Verisign’s long-standing commitment to evolving and improving DNS security, stability and resiliency, through technical innovation, active participation in groups like ICANN’s Root Server System Advisory Committee and the Security and Stability Advisory Committee, as well as in Verisign’s role as root zone maintainer, and operator of two of the world’s 13 authoritative root servers. For more than 22 years, Verisign has maintained 100 percent operational accuracy and stability for the .COM DNS.\n\nICANN facilitates the coordination of the 12 operators of the 13 authoritative root servers. These root servers are the foundation of the DNS. In keeping with ICANN’s mission to help ensure a stable, secure, and unified global internet, a pillar of its 2021-2025 Strategic Plan is to strengthen the security of the DNS and the DNS Root Server System by partnering with relevant stakeholders to strengthen DNS root server operations governance and coordination; improve awareness of security threats to the DNS; and foster greater diversity of thought to best anticipate, respond to and mitigate potential threats.\n\nAbout ICANN\n\nICANN's mission is to help ensure a stable, secure, and unified global Internet. To reach another person on the Internet, you have to type an address – a name or a number – into your computer or other device. That address must be unique, so computers know where to find each other. ICANN helps coordinate and support these unique identifiers across the world. ICANN was formed in 1998 as a not-for-profit public-benefit corporation and a community with participants from all over the world.\n\nAbout Verisign \n\nVerisign, a global provider of domain name registry services and internet infrastructure, enables internet navigation for many of the world’s most recognized domain names. Verisign enables the security, stability, and resiliency of key internet infrastructure and services, including providing root zone maintainer services, operating two of the 13 global internet root servers, and providing registration services and authoritative resolution for the .com and .net top-level domains, which support the majority of global e-commerce. To learn more about what it means to be Powered by Verisign, please visit Verisign.com.\n\nVRSNF\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200103005209/en/\nBrad White\nICANN Director of Communications, North America\n+1 202-570-7118\nbrad.white@icann.org\n\nDavid McGuire\nVerisign\n+1 703-948-3800\ndmcguire@verisign.com\nSource: VeriSign, Inc."
    },
    {
        "title": "Verisign to Report Fourth Quarter and Full Year 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 2, 2020 4:05PM EST",
        "content": "    RESTON, Va.--(BUSINESS WIRE)--\nVeriSign, Inc. (NASDAQ: VRSN), a global provider of domain name registry services and internet infrastructure, today announced that its earnings call for the fourth quarter and full year 2019, will take place on Thursday, Feb. 6, 2020, at 4:30 p.m. (EST). The earnings news release will be distributed to the wire services at approximately 4:05 p.m. (EST) that day and will also be available directly from the company’s website at https://investor.verisign.com.\n\nVerisign will host a live teleconference call on Feb. 6, 2020, at 4:30 p.m. (EST), which will be accessible by direct dial at (888) 676-VRSN (U.S.) or (786) 789-4776 (international), conference ID: Verisign. A listen-only live webcast of the earnings conference call will also be available at https://investor.verisign.com. An audio archive of the call will be available at https://investor.verisign.com/events.cfm.\n\nAbout Verisign \n\nVerisign, a global provider of domain name registry services and internet infrastructure, enables internet navigation for many of the world’s most recognized domain names. Verisign enables the security, stability, and resiliency of key internet infrastructure and services, including providing root zone maintainer services, operating two of the 13 global internet root servers, and providing registration services and authoritative resolution for the .com and .net top-level domains, which support the majority of global e-commerce. To learn more about what it means to be Powered by Verisign, please visit Verisign.com.\n\nVRSNF\n\n©2020 VeriSign, Inc. All rights reserved. VERISIGN, the VERISIGN logo, and other trademarks, service marks, and designs are registered or unregistered trademarks of VeriSign, Inc. and its subsidiaries in the United States and in foreign countries. All other trademarks are property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200102005286/en/\nInvestor Relations: David Atchley, datchley@verisign.com, 703-948-4643\nMedia Relations: David McGuire, dmcguire@verisign.com, 703-948-3800\nSource: VeriSign, Inc."
    },
    {
        "title": "Internet Grows to 359.8 Million Domain Name Registrations in the Third Quarter of 2019",
        "subtitle": "",
        "date": "Dec 19, 2019 4:30PM EST",
        "content": "    RESTON, Va.--(BUSINESS WIRE)--\nVeriSign, Inc. (NASDAQ: VRSN), a global provider of domain name registry services and internet infrastructure, today announced that the third quarter of 2019 closed with 359.8 million domain name registrations across all top-level domains (TLDs), an increase of 5.1 million domain name registrations, or 1.4 percent, compared to the second quarter of 2019.1,2 Domain name registrations have grown by 17.4 million, or 5.1 percent, year over year.1,2\n\nThe .com and .net TLDs had a combined total of 157.4 million domain name registrations in the domain name base3 at the end of the third quarter of 2019, an increase of 1.3 million domain name registrations, or 0.8 percent, compared to the second quarter of 2019. The .com and .net TLDs had a combined increase of 5.7 million domain name registrations, or 3.8 percent, year over year. As of Sept. 30, 2019, the .com domain name base totaled 144.0 million domain name registrations, while the .net domain name base totaled 13.4 million domain name registrations.\n\nNew .com and .net domain name registrations totaled 9.9 million at the end of the third quarter of 2019, compared to 9.5 million domain name registrations at the end of the third quarter of 2018.\n\nVerisign publishes the Domain Name Industry Brief to provide internet users throughout the world with statistical and analytical research and data on the domain name industry. The third quarter 2019 Domain Name Industry Brief, as well as previous reports, can be obtained at Verisign.com/DNIB.\n\nAbout Verisign \n\nVerisign, a global provider of domain name registry services and internet infrastructure, enables internet navigation for many of the world’s most recognized domain names. Verisign enables the security, stability, and resiliency of key internet infrastructure and services, including providing root zone maintainer services, operating two of the 13 global internet root servers, and providing registration services and authoritative resolution for the .com and .net top-level domains, which support the majority of global e-commerce. To learn more about what it means to be Powered by Verisign, please visit Verisign.com.\n\nVRSNF\n\n© 2019 VeriSign, Inc. All rights reserved. VERISIGN, the VERISIGN logo, and other trademarks, service marks, and designs are registered or unregistered trademarks of VeriSign, Inc. and its subsidiaries in the United States and in foreign countries. All other trademarks are property of their respective owners.\n\n1 The figure(s) includes domain names in the .tk ccTLD. .tk is a free ccTLD that provides free domain names to individuals and businesses. Revenue is generated by monetizing expired domain names. Domain names no longer in use by the registrant or expired are taken back by the registry and the residual traffic is sold to advertising networks. As such, there are no deleted .tk domain names. https://www.businesswire.com/news/home/20131216006048/en/Freenom-Closes-3M-Series-Funding#.UxeUGNJDv9s.\n2The generic top-level domain and ccTLD data cited in the brief: (i) includes ccTLD Internationalized Domain Names, (ii) is an estimate as of the time the brief was developed and (iii) is subject to change as more complete data is received. Some numbers in the brief may reflect standard rounding.\n3 The domain name base is the active zone plus the number of domain names that are registered but not configured for use in the respective TLD zone file plus the number of domain names that are in a client or server hold status. The .com and .net domain name registration figures are as reported in Verisign’s most recent SEC filings.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191219005777/en/\nMedia Relations: David McGuire, dmcguire@verisign.com, + 1 703-948-3800\nInvestor Relations: David Atchley, datchley@verisign.com, + 1 703-948-4643\nSource: VeriSign, Inc."
    },
    {
        "title": "Verisign Reports Third Quarter 2019 Results",
        "subtitle": "",
        "date": "Oct 24, 2019 4:05PM EDT",
        "content": "    RESTON, Va.--(BUSINESS WIRE)--\nVeriSign, Inc. (NASDAQ: VRSN), a global provider of domain name registry services and internet infrastructure, today reported financial results for the third quarter of 2019.\n\nThird Quarter GAAP Financial Results\n\nVeriSign, Inc. and its subsidiaries (“Verisign”) reported revenue of $308 million for the third quarter of 2019, up 0.9 percent from the same quarter in 2018. Verisign reported net income of $154 million and diluted earnings per share (diluted “EPS”) of $1.30 for the third quarter of 2019, compared to net income of $138 million and diluted EPS of $1.13 for the same quarter in 2018. The operating margin was 66.7 percent for the third quarter of 2019 compared to 63.8 percent for the same quarter in 2018.\n\nThird Quarter Non-GAAP Financial Results\n\nVerisign reported, on a non-GAAP basis, net income of $161 million and diluted EPS of $1.36 for the third quarter of 2019, compared to net income of $151 million and diluted EPS of $1.23 for the same quarter in 2018. The non-GAAP operating margin was 70.8 percent for the third quarter of 2019 compared to 68.7 percent for the same quarter in 2018. A table reconciling the GAAP to the non-GAAP results (which excludes the items described under “Non-GAAP Financial Measures and Adjusted EBITDA” below) is appended to this news release.\n\n“Our third quarter results are the product of focused execution and our commitment to delivering shareholder value,” said Jim Bidzos, Executive Chairman, President and Chief Executive Officer.\n\nFinancial Highlights\n\nBusiness Highlights\n\nNon-GAAP Financial Measures and Adjusted EBITDA\n\nVerisign provides quarterly and annual financial statements that are prepared in accordance with generally accepted accounting principles (GAAP). Along with this information, management typically discloses and discusses certain non-GAAP financial measures in quarterly earnings news releases, on investor conference calls and during investor conferences and related events. These non-GAAP financial measures do not include stock-based compensation which is included in the comparable GAAP financial measures. Non-GAAP net income is also adjusted for an income tax rate of 22 percent which differs from the GAAP income tax rate.\n\nOn a quarterly basis, Verisign also provides Adjusted EBITDA. Adjusted EBITDA is a non-GAAP financial measure and is calculated in accordance with the terms of the indentures governing Verisign’s senior notes. Adjusted EBITDA refers to net income before interest, taxes, depreciation and amortization, stock-based compensation, unrealized gain / loss on hedging agreements, and gain on the sale of a business.\n\nManagement believes that these non-GAAP financial measures supplement the GAAP financial measures by providing investors with additional information that allows them to have a clearer picture of Verisign’s operations and financial performance and the comparability of Verisign’s operating results from period to period. The presentation of these non-GAAP financial measures is not meant to be considered in isolation nor as a substitute for financial measures prepared in accordance with GAAP.\n\nThe tables appended to this release include a reconciliation of the non-GAAP financial measures to the comparable financial measures reported in accordance with GAAP for the given periods.\n\nToday’s Conference Call\n\nVerisign will host a live conference call today at 4:30 p.m. (EDT) to review the third quarter 2019 results. The call will be accessible by direct dial at (888) 676-VRSN (U.S.) or (786) 789-4776 (international), conference ID: Verisign. A listen-only live web cast of the conference call and accompanying slide presentation will also be available at https://investor.Verisign.com. An audio archive of the call will be available at https://investor.Verisign.com/events.cfm. This news release and the financial information discussed on today’s conference call are available at https://investor.Verisign.com.\n\nAbout Verisign\n\nVerisign, a global provider of domain name registry services and internet infrastructure, enables internet navigation for many of the world’s most recognized domain names. Verisign enables the security, stability, and resiliency of key internet infrastructure and services, including providing root zone maintainer services, operating two of the 13 global internet root servers, and providing registration services and authoritative resolution for the .com and .net top-level domains, which support the majority of global e-commerce. To learn more about what it means to be Powered by Verisign, please visit Verisign.com.\n\nVRSNF\n\nStatements in this announcement other than historical data and information constitute forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934 as amended. These statements involve risks and uncertainties that could cause our actual results to differ materially from those stated or implied by such forward-looking statements. The potential risks and uncertainties include, among others, risks arising from the agreements governing our Registry Services business; new or existing governmental laws and regulations in the U.S. or other applicable foreign jurisdictions; system interruptions, security breaches, attacks on the internet by hackers, viruses, or intentional acts of vandalism; the uncertainty of the impact of changes to the multi-stakeholder model of internet governance; risks arising from our operation of two root zone servers and our performance of the Root Zone Maintainer functions; changes in internet practices and behavior and the adoption of substitute technologies; the success or failure of the evolution of our markets; the highly competitive business environment in which we operate; whether we can maintain strong relationships with registrars and their resellers to maintain their marketing focus on our products and services; the possibility of system interruptions or failures; challenging global economic conditions; economic, legal and political risk associated with our international operations; our ability to protect and enforce our rights to our intellectual property and ensure that we do not infringe on others’ intellectual property; the outcome of legal or other challenges resulting from our activities or the activities of registrars or registrants, or litigation generally; the impact of our new strategic initiatives, including our IDN gTLDs; whether we can retain and motivate our senior management and key employees; and the impact of unfavorable tax rules and regulations. More information about potential factors that could affect our business and financial results is included in our filings with the SEC, including in our Annual Report on Form 10-K for the year ended Dec. 31, 2018, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. Verisign undertakes no obligation to update any of the forward-looking statements after the date of this announcement.\n\n©2019 VeriSign, Inc. All rights reserved. VERISIGN, the VERISIGN logo, and other trademarks, service marks, and designs are registered or unregistered trademarks of VeriSign, Inc. and its subsidiaries in the United States and in foreign countries. All other trademarks are property of their respective owners.\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191024005836/en/\nInvestor Relations: David Atchley, datchley@verisign.com, 703-948-4643\nMedia Relations: David McGuire, dmcguire@verisign.com, 703-948-3800\nSource: VeriSign, Inc."
    },
    {
        "title": "Verisign to Report Third Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 1, 2019 4:05PM EDT",
        "content": "    RESTON, Va.--(BUSINESS WIRE)--\nVeriSign, Inc. (NASDAQ: VRSN), a global provider of domain name registry services and internet infrastructure, today announced that its earnings call for the third quarter 2019, will take place on Thursday, Oct. 24, 2019, at 4:30 p.m. (EDT). The earnings news release will be distributed to the wire services at approximately 4:05 p.m. (EDT) that day and will also be available directly from the company’s website at https://investor.verisign.com.\n\nVerisign will host a live teleconference call on Oct. 24, 2019, at 4:30 p.m. (EDT), which will be accessible by direct dial at (888) 676-VRSN (U.S.) or (786) 789-4776 (international), conference ID: Verisign. A listen-only live webcast of the earnings conference call will also be available at https://investor.verisign.com. An audio archive of the call will be available at https://investor.verisign.com/events.cfm.\n\nAbout Verisign \n\nVerisign, a global provider of domain name registry services and internet infrastructure, enables internet navigation for many of the world’s most recognized domain names. Verisign enables the security, stability, and resiliency of key internet infrastructure and services, including providing root zone maintainer services, operating two of the 13 global internet root servers, and providing registration services and authoritative resolution for the .com and .net top-level domains, which support the majority of global e-commerce. To learn more about what it means to be Powered by Verisign, please visit Verisign.com.\n\nVRSNF\n\n©2019 VeriSign, Inc. All rights reserved. VERISIGN, the VERISIGN logo, and other trademarks, service marks, and designs are registered or unregistered trademarks of VeriSign, Inc. and its subsidiaries in the United States and in foreign countries. All other trademarks are property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191001005962/en/\nInvestor Relations: David Atchley, datchley@verisign.com, 703-948-4643\nMedia Relations: David McGuire, dmcguire@verisign.com, 703-948-3800\nSource: VeriSign, Inc."
    }
]