[
    {
        "title": "Vertex Announces Cancellation of its March 3 Presentation at the Cowen Health Care Conference",
        "subtitle": "",
        "date": "Mar 2, 2020 3:44PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced the cancellation of its planned March 3 presentation and webcast at the Cowen Health Care Conference. Following implementation of a companywide travel and meetings policy that is designed to reduce potential disruption from coronavirus, the Vertex senior management team will, as a precautionary measure, no longer attend the conference.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has multiple approved medicines that treat the underlying cause of cystic fibrosis (CF) - a rare, life-threatening genetic disease - and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational small molecule medicines in other serious diseases where it has deep insight into causal human biology, including pain, alpha-1 antitrypsin deficiency, and APOL1-mediated kidney disease. In addition, Vertex has a rapidly expanding pipeline of genetic and cell therapies for diseases such as sickle cell disease, beta thalassemia, Duchenne muscular dystrophy and type 1 diabetes mellitus.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005943/en/\nInvestors:\nMichael Partridge, 617-341-6108\nZach Barber, 617-341-6470\nLeah Gibson, 617-961-1507\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex Announces Availability of Cystic Fibrosis Medicine KALYDECO® (ivacaftor) in New Zealand",
        "subtitle": "",
        "date": "Feb 25, 2020 5:03PM EST",
        "content": "    LONDON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that KALYDECO® (ivacaftor) will be available to eligible patients with cystic fibrosis (CF) in New Zealand from March 1. Clinicians are able to apply for patient access using the exceptional circumstances framework set up by the Pharmaceutical Management Agency (PHARMAC).\n\n“Today is an important day for the CF community in New Zealand. For the first time in New Zealand CF patients will have access to a medicine that treats the underlying cause of their disease. We appreciate the engagement and collaboration from PHARMAC, and other involved parties, to bring this important medicine to patients,” said Ludovic Fenaux, Senior Vice President, Vertex International.\n\nVertex’s CF medicines are reimbursed in more than 20 countries around the world including Australia, France, Germany, the Republic of Ireland, Italy, the Netherlands, Sweden, the UK and the U.S.\n\nAbout Cystic Fibrosis\n\nCystic fibrosis (CF) is a rare, life-shortening genetic disease affecting approximately 75,000 people worldwide. CF is a progressive, multi-system disease that affects the lungs, liver, GI tract, sinuses, sweat glands, pancreas and reproductive tract. CF is caused by a defective and/or missing CFTR protein resulting from mutations in the CFTR gene. Children must inherit two defective CFTR genes — one from each parent — to have CF. While there are many different types of CFTR mutations that can cause the disease, the vast majority of all people with CF have at least one F508del mutation. These mutations, which can be determined by a genetic test, or genotyping test, lead to CF by creating non-working or too few CFTR proteins at the cell surface. The defective function and/or absence of CFTR protein results in poor flow of salt and water into and out of the cell in a number of organs. In the lungs, this leads to the buildup of abnormally thick, sticky mucus that can cause chronic lung infections and progressive lung damage in many patients that eventually leads to death. The median age of death is in the early 30s.\n\nAbout KALYDECO® (ivacaftor)\n\nIvacaftor is the first medicine to treat the underlying cause of CF in people with specific mutations in the CFTR gene. Known as a CFTR potentiator, ivacaftor is an oral medicine designed to keep CFTR proteins at the cell surface open longer to improve the transport of salt and water across the cell membrane, which helps hydrate and clear mucus from the airways.\n\nPeople with CF who have specific mutations in the CFTR gene are currently benefiting from ivacaftor in countries across North America, Europe and in Australia.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has multiple approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational small molecule medicines in other serious diseases where it has deep insight into causal human biology, including pain, alpha-1 antitrypsin deficiency and APOL1-mediated kidney diseases. In addition, Vertex has a rapidly expanding pipeline of genetic and cell therapies for diseases such as sickle cell disease, beta thalassemia, Duchenne muscular dystrophy and type 1 diabetes mellitus.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes.\n\nSpecial Note Regarding Forward-Looking Statements\n\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, statements by Mr. Fenaux and statements regarding the availability of and access to KALYDECO in New Zealand. While Vertex believes the forward-looking statements contained in this press release are accurate, these forward-looking statements represent the company's beliefs only as of the date of this press release and there are a number of factors that could cause actual events or results to differ materially from those indicated by such forward-looking statements. Those risks and uncertainties include, among other things, that data from the company's development programs may not support registration or further development of its compounds due to safety, efficacy or other reasons, and other risks listed under Risk Factors in Vertex's annual report and quarterly reports filed with the Securities and Exchange Commission and available through the company's website at www.vrtx.com. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\n(VRTX-GEN)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225006077/en/\nMedia: +44 20 3204 5275\nMediaInfo@vrtx.com\n\nInvestors: +1 617-961-7163\nInvestorInfo@vrtx.com\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex to Present at the Cowen Health Care Conference on March 3",
        "subtitle": "",
        "date": "Feb 25, 2020 4:01PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that management will present at the Cowen Health Care Conference on Tuesday, March 3, 2020 at 10:00 a.m. ET.\n\nThe audio portion of management's remarks will be available live through Vertex's website, www.vrtx.com in the \"Investors\" section under the \"News and Events\" page. A replay of the conference webcast will be archived on the company's website.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has multiple approved medicines that treat the underlying cause of cystic fibrosis (CF) - a rare, life-threatening genetic disease - and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational small molecule medicines in other serious diseases where it has deep insight into causal human biology, including pain, alpha-1 antitrypsin deficiency, and APOL1-mediated kidney disease. In addition, Vertex has a rapidly expanding pipeline of genetic and cell therapies for diseases such as sickle cell disease, beta thalassemia, Duchenne muscular dystrophy and type 1 diabetes mellitus.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225005993/en/\nInvestors:\nMichael Partridge, 617-341-6108\nZach Barber, 617-341-6470\nLeah Gibson, 617-961-1507\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex Reports Full-Year and Fourth-Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Jan 30, 2020 4:01PM EST",
        "content": "\n- Full-year 2019 total GAAP product revenues of $4.16 billion -\n\n- Full-year 2019 total non-GAAP product revenues of $4.00 billion, a 32% increase compared to the full-year 2018 -\n\n- Company provides full-year 2020 total product revenue guidance of $5.1 billion to $5.3 billion -\n    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today reported consolidated financial results for the full year and fourth quarter ended December 31, 2019 and provided full-year 2020 financial guidance.\n\n\"In 2019, our differentiated strategy of investing in serial scientific innovation to create transformative medicines delivered remarkable performance. This was marked by the early approval of TRIKAFTA, the rapid progression of our pipeline in additional diseases and continued financial growth as we continued to treat more patients with our medicines worldwide,\" said Jeffrey Leiden, M.D., Ph.D., Chairman, President and Chief Executive Officer of Vertex. \"This success is the culmination of many years of hard work to build a team, a pipeline and a company that we believe will discover, develop and commercialize transformative medicines for years to come.\"\n\nFourth-Quarter and Full-Year 2019 Financial Highlights\n\nFull-Year 2019 Results\n\nTotal GAAP and Non-GAAP product revenues increased 37% and 32%, respectively, compared to 2018, primarily driven by the global uptake of SYMDEKO and SYMKEVI in patients ages 12 and older, label expansions for the company's CF medicines globally, and the early approval and launch of TRIKAFTA in the U.S.\n\nGAAP net income decreased compared to 2018, largely driven by the release of Vertex's tax valuation allowance in 2018.\n\nNon-GAAP net income increased compared to 2018, driven by the strong growth in total product revenues.\n\nCash, cash equivalents and marketable securities as of December 31, 2019 were $3.8 billion, an increase of approximately $600 million compared to $3.2 billion as of December 31, 2018.\n\nFull-Year 2019 Expenses\n\nCombined GAAP and Non-GAAP R&D and SG&A expenses increased compared to 2018, primarily due to the incremental investment to support the global use of Vertex's medicines and the expansion of Vertex's pipeline in CF and other new disease areas. Combined GAAP R&D and SG&A expenses also increased compared to 2018 due to Vertex's business development activities.\n\nGAAP and Non-GAAP income taxes increased significantly compared to 2018 due to Vertex's release of its valuation allowance on the majority of its deferred tax assets in the fourth quarter of 2018. GAAP and non-GAAP income taxes in 2019 include a provision for income taxes on Vertex's pre-tax income using an estimated effective tax rate approximating statutory rates. This provision for income taxes includes a significant non-cash charge due to Vertex's ability to offset its pre-tax income against previously benefited net operating losses. Refer to \"Supplemental Income Tax Information\" for discussion of the cash versus non-cash components of Vertex's provision for income taxes.\n\nFourth-Quarter 2019 Results\n\nTotal GAAP and Non-GAAP product revenues increased 63% and 45%, respectively, compared to the fourth quarter of 2018, primarily driven by the early approval and launch of TRIKAFTA in the U.S. and the global uptake of SYMDEKO and SYMKEVI in patients ages 12 and older.\n\nGAAP net income decreased compared to the fourth quarter of 2018, largely driven by the release of Vertex's tax valuation allowance in the fourth quarter of 2018.\n\nNon-GAAP net income increased compared to the fourth quarter of 2018, driven by the strong growth in total product revenues.\n\nFourth-Quarter 2019 Expenses\n\nCombined GAAP and Non-GAAP R&D and SG&A expenses increased compared to the fourth quarter of 2018, primarily due to the incremental investment to support the global use of Vertex's medicines and the expansion of Vertex's pipeline in CF and other new disease areas.\n\nGAAP and Non-GAAP income taxes increased significantly compared to the fourth quarter of 2018 due to Vertex's release of its tax valuation allowance in the fourth quarter of 2018. Refer to \"Full-Year 2019 Expenses\" for further information. Refer to \"Supplemental Income Tax Information\" for discussion of the cash versus non-cash components of Vertex's provision for income taxes.\n\nFull-Year 2020 Financial Guidance\n\nVertex today provided its full-year 2020 financial guidance. A summary of the company's current financial expectations is below:\n\n\"Entering 2020, Vertex has never been stronger,\" said Reshma Kewalramani, M.D., Executive Vice President and Chief Medical Officer. \"We are well-positioned for both near- and long-term growth based on treating more people with our CF medicines and from other future medicines in diseases aligned with our strategy, including alpha-1 antitrypsin deficiency, APOL1-mediated kidney diseases, pain and severe hemoglobinopathies. Going forward, our financial strength will enable us to continue to significantly invest in internal R&D and external innovation, which will provide access to new technologies, programs and expertise that will lead to further growth in the years ahead.\"\n\nClinical Development\n\nCystic Fibrosis (CF):\n\nAlpha-1 Antitrypsin (AAT) Program:\n\nSickle Cell Disease and Beta Thalassemia:\n\nAPOL1-Mediated Kidney Diseases:\n\nPain:\n\nType 1 Diabetes:\n\nNon-GAAP Financial Measures\n\nIn this press release, Vertex's financial results and financial guidance are provided in accordance with accounting principles generally accepted in the United States (GAAP) and using certain non-GAAP financial measures. In particular, non-GAAP financial results and guidance exclude from Vertex's pre-tax income (i) stock-based compensation expense, (ii) an adjustment to revenues and related cost of sales to reflect the conclusion of the early access program for ORKAMBI in France, (iii) revenues and expenses related to business development transactions including collaboration agreements, asset acquisitions and consolidated variable interest entities, (iv) gains or losses related to the fair value of the company's strategic investments, (v) acquisition-related costs and (vi) other adjustments. The company's non-GAAP financial results also exclude from its provision for or benefit from income taxes the estimated tax impact related to its non-GAAP adjustments to pre-tax income described above. These results are provided as a complement to results provided in accordance with GAAP because management believes these non-GAAP financial measures help indicate underlying trends in the company's business, are important in comparing current results with prior period results and provide additional information regarding the company's financial position. Management also uses these non-GAAP financial measures to establish budgets and operational goals that are communicated internally and externally and to manage the company's business and to evaluate its performance. The company adjusts, where appropriate, for both revenues and expenses in order to reflect the company's operations. The company provides guidance regarding product revenues in accordance with GAAP and provides guidance regarding combined research and development and sales, general, and administrative expenses on both a GAAP and non-GAAP basis. The company also provides guidance regarding its anticipated income taxes as a percentage of pre-tax income on a non-GAAP basis. The guidance regarding GAAP research and development expenses and sales, general and administrative expenses does not include estimates associated with any potential future business development activities. A reconciliation of the GAAP financial results to non-GAAP financial results is included in the attached financial information.\n\nNotes and Explanations\n\n1: The company records gains and losses related to changes in the fair value of its strategic investments to \"Other income, net.\"\n\n2: In the fourth quarter of 2018, the company recorded a non-cash benefit from income taxes of approximately $1.5 billion related to the release of its valuation allowance on the majority of its net operating losses and other deferred tax assets. As a result, the company recorded deferred tax assets of $1.5 billion on its consolidated balance sheet as of December 31, 2018, which were previously subject to its valuation allowance. Starting in the first quarter of 2019, the company began recording a provision for income taxes on its pre-tax income using an estimated effective tax rate that approximates statutory rates. The provision includes a significant non-cash charge due to the company's ability to offset its pre-tax income against previously benefited net operating losses. The company expects the majority of its tax provision to represent a non-cash expense until its net operating losses have been fully utilized. As of December 31, 2019, the company's federal net operating losses and credits that were available to offset future pre-tax income were approximately $3.5 billion.\n\n3: During the three and twelve months ended December 31, 2019, the increase in the fair value of the contingent consideration relates to payments potentially payable to Exonics' former equity holders. During the three and twelve months ended December 31, 2018, the company consolidated the financial statements of a variable interest entity, or VIE, resulting in changes in the fair value of contingent consideration.\n\n4: \"ORKAMBI adjustment\" in the three and twelve months ended December 31, 2019 includes an adjustment to net product revenues and cost of sales related to the conclusion of the early access program for ORKAMBI in France in the fourth quarter of 2019. The company had previously recognized a portion of net product revenues related to ORKAMBI distributed through the early access program in France. As a result, the company recognized an adjustment to increase net product revenues and cost of sales, which related to prior period shipments of ORKAMBI distributed through the early access program in France. The company has excluded the adjustment to net product revenues and cost of sales from its Non-GAAP measures for the three and twelve months ended December 31, 2019. Beginning in 2020, the company does not expect to adjust any revenues from its GAAP net product revenues.\n\n5: \"Collaborative revenues and expenses\" in the three and twelve months ended December 31, 2019 and 2018 primarily related to collaborative upfront and milestone payments. \"Collaborative revenues and expenses\" in the three and twelve months ended December 31, 2018 also included revenues and expenses attributable to our VIE's operations.\n\n6: \"Acquisition-related costs\" in the three and twelve months ended December 31, 2019 primarily related to costs associated with the company's acquisitions of Semma and Exonics. There were no comparable amounts during the three and twelve months ended December 31, 2018.\n\n7: In the three and twelve months ended December 31, 2019, \"Estimated income taxes related to non-GAAP adjustments to pre-tax income\" primarily related to (i) stock-based compensation (including an adjustment for excess tax benefits related to stock-based compensation), (ii) increases or decreases in the fair value of the company's strategic investments and (iii) collaborative upfront payments. In the three and twelve months ended December 31, 2018, \"Estimated income taxes related to non-GAAP adjustments to pre-tax income\" were related to a provision for income taxes attributable to the company's VIE and excess tax benefits related to stock-based compensation.\n\nAbout Vertex\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has multiple approved medicines that treat the underlying cause of cystic fibrosis (CF) - a rare, life-threatening genetic disease - and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational small molecule medicines in other serious diseases where it has deep insight into causal human biology, including pain, alpha-1 antitrypsin deficiency, and APOL1-mediated kidney disease. In addition, Vertex has a rapidly expanding pipeline of genetic and cell therapies for diseases such as sickle cell disease, beta thalassemia, Duchenne muscular dystrophy and type 1 diabetes mellitus.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\nSpecial Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, Dr. Leiden's statements in this press release, Dr. Kewalramani's statements in this press release, the information provided regarding future financial performance, the section captioned \"Full Year 2020 Financial Guidance\" and statements regarding (i) regulatory filings and (ii) the development plan and timelines for our drug candidates. While Vertex believes the forward-looking statements contained in this press release are accurate, these forward-looking statements represent the company's beliefs only as of the date of this press release and there are a number of risks and uncertainties that could cause actual events or results to differ materially from those expressed or implied by such forward-looking statements. Those risks and uncertainties include, among other things, that the company's expectations regarding its 2020 CF net product revenues, expenses and effective tax rates may be incorrect (including because one or more of the company's assumptions underlying its expectations may not be realized), that data from the company's development programs may not support registration or further development of its potential medicines due to safety, efficacy or other reasons, and other risks listed under Risk Factors in Vertex's annual report and subsequent quarterly reports filed with the Securities and Exchange Commission and available through the company's website at www.vrtx.com. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\nConference Call and Webcast\nThe company will host a conference call and webcast today at 4:30 p.m. ET. To access the call, please dial (866) 501-1537 (U.S.) or +1 (720) 545-0001 (International). The conference call will be webcast live and a link to the webcast can be accessed through Vertex's website at www.vrtx.com in the \"Investors\" section under \"Events and Presentations.\" To ensure a timely connection, it is recommended that users register at least 15 minutes prior to the scheduled webcast. An archived webcast will be available on the company's website.\n\n(VRTX-E)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005796/en/\nInvestors:\nMichael Partridge, 617-341-6108\nor\nZach Barber, 617-341-6470\nor\nLeah Gibson, 617-961-1507\n\nMedia:\n617-341-6992\nmediainfo@vrtx.com\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex to Announce Full-Year and Fourth-Quarter 2019 Financial Results on January 30",
        "subtitle": "",
        "date": "Jan 21, 2020 4:01PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) will report its full-year and fourth-quarter 2019 financial results on Thursday, January 30, 2020 after the financial markets close. The company will host a conference call and webcast at 4:30 p.m. ET. To access the call, please dial (866) 501-1537 (U.S.) or +1 (720) 545-0001 (International).\n\nThe conference call will be webcast live and a link to the webcast can be accessed through Vertex's website at www.vrtx.com in the \"Investors\" section. To ensure a timely connection, it is recommended that participants register at least 15 minutes prior to the scheduled webcast. An archived webcast will be available on the company's website.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has multiple approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational small molecule medicines in other serious diseases where it has deep insight into causal human biology, including pain, alpha-1 antitrypsin deficiency, and APOL1-mediated kidney disease. In addition, Vertex has a rapidly expanding pipeline of genetic and cell therapies for diseases such as sickle cell disease, beta thalassemia, Duchenne muscular dystrophy and type 1 diabetes mellitus.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121006011/en/\nVertex Pharmaceuticals Incorporated\nInvestors:\nMichael Partridge, 617-341-6108\nZach Barber, 617-341-6470\nLeah Gibson, 617-961-1507\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Thinking about trading options or stock in Electronic Arts, Tesla, UnitedHealth Group, Vertex Pharmaceuticals, or Workday?",
        "subtitle": "",
        "date": "Jan 9, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 9, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for EA, TSLA, UNH, VRTX, and WDAY.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)   View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-electronic-arts-tesla-unitedhealth-group-vertex-pharmaceuticals-or-workday-300984334.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Vertex to Present at the J.P. Morgan Healthcare Conference on January 13",
        "subtitle": "",
        "date": "Jan 8, 2020 4:01PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that management will present at the J.P. Morgan Healthcare Conference on Monday, January 13, 2020 at 2:30 p.m. ET (11:30 a.m. PT).\n\nThe audio portion of management’s remarks can be accessed live through Vertex’s website, www.vrtx.com, in the “Investors” section under the “News and Events” page. A replay of the conference webcast will be archived on the company’s website.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has multiple approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational small molecule medicines in other serious diseases where it has deep insight into causal human biology, including pain, alpha-1 antitrypsin deficiency, and APOL1-mediated kidney disease. In addition, Vertex has a rapidly expanding pipeline of genetic and cell therapies for diseases such as sickle cell disease, beta thalassemia, Duchenne muscular dystrophy and type 1 diabetes mellitus.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005802/en/\nVertex Pharmaceuticals Incorporated\n\nInvestors:\nMichael Partridge, 617-341-6108\nZach Barber, 617-341-6470\nLeah Gibson, 617-961-1507\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex Confirms Northern Ireland Offer Accepted for Cystic Fibrosis Medicines",
        "subtitle": "",
        "date": "Nov 12, 2019 10:51AM EST",
        "content": "\n-Eligible patients in Northern Ireland will soon have access to ORKAMBI® (lumacaftor/ivacaftor) and SYMKEVI® (tezacaftor/ivacaftor), expanded access to KALYDECO® (ivacaftor) under same terms as NHS England agreement- \n    LONDON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today confirms that the Regional Pharmaceutical Procurement Service in Northern Ireland has accepted an offer for access to all currently licensed Vertex cystic fibrosis (CF) medicines and any future indications of these medicines under the same terms as the recently announced agreement with NHS England.\n\nThis means that once the contract is finalized, patients with CF in Northern Ireland ages 2 years and older who have two copies of the F508del mutation in the cystic fibrosis transmembrane conductance regulator (CFTR) gene will have access to ORKAMBI® (lumacaftor/ivacaftor) and CF patients ages 12 years and older who either have two copies of the F508del mutation or one copy of the F508del mutation and a copy of one of the other 14 licensed mutations will have access to SYMKEVI® (tezacaftor/ivacaftor) in combination with ivacaftor. We will support the arrangements being put in place to ensure clinicians will be able to prescribe to eligible patients within the next few weeks.\n\nThe agreement also offers expanded access to KALYDECO® (ivacaftor) to include people ages 18 years and older who have the R117H mutation and those patients ages 12 months and older who have one of the nine licensed gating mutations.\n\n“We are pleased that the nearly 280 eligible cystic fibrosis patients in Northern Ireland will soon have access to CFTR modulators to treat the underlying cause of their disease and we thank the authorities in Northern Ireland for their collaboration and commitment in this agreement,” said Ludovic Fenaux, Senior Vice President, Vertex International.\n\nAbout CF in the UK\nOver 10,000 people in the UK have CF — the second highest number in the world. Nearly 480 people in Northern Ireland have CF. CF is a debilitating, life-shortening inherited condition that causes progressive damage to organs across the body from birth. Currently, there is no cure for CF and half of people in the UK with CF die before they are 32. The daily impact of treatment is significant. It can take up to four or more hours, involving nebulizers, physiotherapy and up to 70 tablets a day. CF accounts for 9,500 hospital admissions and over 100,000 hospital bed days a year. A third of these are used by children under 15.\n\nAbout ORKAMBI® (lumacaftor/ivacaftor) and the F508del mutation\nIn people with two copies of the F508del mutation, the CFTR protein is not processed and trafficked normally within the cell, resulting in little-to-no CFTR protein at the cell surface. Patients with two copies of the F508del mutation are easily identified by a simple genetic test.\n\nLumacaftor/ivacaftor is a combination of lumacaftor, which is designed to increase the amount of mature protein at the cell surface by targeting the processing and trafficking defect of the F508del-CFTR protein, and ivacaftor, which is designed to enhance the function of the CFTR protein once it reaches the cell surface.\n\nFor complete product information, please see the Summary of Product Characteristics that can be found on www.ema.europa.eu.\n\nAbout SYMKEVI® (tezacaftor/ivacaftor) in combination with ivacaftor\nSome mutations result in CFTR protein that is not processed or folded normally within the cell, and that generally does not reach the cell surface. Tezacaftor is designed to address the trafficking and processing defect of the CFTR protein to enable it to reach the cell surface and ivacaftor is designed to enhance the function of the CFTR protein once it reaches the cell surface.\n\nSYMKEVI is indicated for people with CF ages 12 and older who either have two copies of the F508del mutation or one copy of the F508del mutation and have one of the following 14 mutations in which the CFTR protein shows residual function: P67L, R117C, L206W, R352Q, A455E, D579G, 711+3A→G, S945L, S977F, R1070W, D1152H, 2789+5G→A, 3272-26A→G, or 3849+10kbC→T.\n\nFor complete product information, please see the Summary of Product Characteristics that can be found on www.ema.europa.eu.\n\nAbout KALYDECO® (ivacaftor)\nKALYDECO® (ivacaftor) is the first medicine to treat the underlying cause of CF in people with specific mutations in the CFTR gene. Known as a CFTR potentiator, ivacaftor is an oral medicine designed to keep CFTR proteins at the cell surface open longer to improve the transport of salt and water across the cell membrane, which helps hydrate and clear mucus from the airways.\n\nKALYDECO is indicated in people ages 12 months and older who have one of the following mutations in the CFTR gene: G551D, G1244E, G1349D, G178R, G551S, S1251N, S1255P, S549N or S549R. KALYDECO is also indicated for the treatment of patients with CF ages 18 years and older who have an R117H mutation in the CFTR gene.\n\nFor complete product information, please see the Summary of Product Characteristics that can be found on www.ema.europa.eu.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has four approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes.\n\nSpecial Note Regarding Forward-looking Statements\n\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, the statements by Mr. Fenaux in the fourth paragraph of this press release and statements regarding our expectations for the patient populations that will be able to access Vertex’s medicines and the timing of such access. While Vertex believes the forward-looking statements contained in this press release are accurate, these forward-looking statements represent the company's beliefs only as of the date of this press release and there are a number of risks and uncertainties that could cause actual events or results to differ materially from those expressed or implied by such forward-looking statements. Those risks and uncertainties include, among other things, that data from the company's development programs may not support registration or further development of its compounds due to safety, efficacy or other reasons, and other risks listed under Risk Factors in Vertex's annual report and subsequent quarterly reports filed with the Securities and Exchange Commission and available through the company's website at www.vrtx.com. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\n(VRTX-GEN)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191112005777/en/\nVertex Pharmaceuticals Incorporated\nUK Media: +44 20 3204 5275\nMediaInfo@vrtx.com\n\nU.S. Media: 617-341-6992\nMediaInfo@vrtx.com\n\nInvestors: 617-961-7163\nInvestorInfo@vrtx.com\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex to Present at the Credit Suisse Healthcare Conference on November 12",
        "subtitle": "",
        "date": "Nov 7, 2019 4:01PM EST",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that management will present at the Credit Suisse Healthcare Conference on Tuesday, November 12, 2019 at 1:30 p.m. ET.\n\nManagement’s remarks will be available live through Vertex’s website at www.vrtx.com in the “Investors” section under the “News and Events” page. A replay of the conference webcast will be archived on the company’s website.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has four approved medicines that treat the underlying cause of cystic fibrosis (CF) - a rare, life-threatening genetic disease - and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191107005925/en/\nVertex Investor Contacts:\nMichael Partridge, 617-341-6108\nZach Barber, 617-341-6470\nLeah Gibson, 617-961-1507\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Phase 3 Results from Two Studies of TRIKAFTA (elexacaftor/tezacaftor/ivacaftor and ivacaftor) Triple Combination Treatment for Cystic Fibrosis Concurrently Published in The New England Journal of Medicine and The Lancet",
        "subtitle": "",
        "date": "Oct 31, 2019 12:15PM EDT",
        "content": "\n- Both studies met primary and all key secondary endpoints demonstrating significant improvements in lung function and other measures of the disease -\n\n- Results of both studies to be presented today at the 33rd Annual North American Cystic Fibrosis Conference as part of six presentations from Vertex at the meeting -\n    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced the concurrent publication in The New England Journal of Medicine (NEJM) and The Lancet of results from two Phase 3 studies of TRIKAFTA™ (elexacaftor/tezacaftor/ivacaftor and ivacaftor) for the treatment of cystic fibrosis (CF) in people ages 12 years and older who have at least one F508del mutation in the cystic fibrosis transmembrane conductance regulator (CFTR) gene, the most common CF-causing mutation. Data highlighting primary and secondary endpoints from a 24-week Phase 3 study in 403 people with one F508del mutation and one minimal function mutation (F/MF) in the CFTR gene were published in NEJM. In addition, The Lancet published data highlighting primary and secondary endpoints from a 4-week Phase 3 study in 107 people with two F508del mutations (F/F). Both studies met primary and all key secondary endpoints, demonstrating statistically significant and clinically meaningful improvements in lung function and other measures of disease. In these studies, TRIKAFTA was generally well tolerated.\n\n“The results of the TRIKAFTA studies published in both The Lancet and NEJM are impressive and represent a historic moment in CF care, with the medicine demonstrating improvements in multiple CF outcome measures in clinical trials, while being generally well tolerated,” said Raksha Jain, M.D., M.S.C.I., Associate Professor, Internal Medicine, Pulmonary and Critical Care, The University of Texas Southwestern Medical Center and lead author of the NEJM publication.\n\nDetailed outcomes from these studies were previously communicated in May 2019. Data published in both NEJM and The Lancet contain additional analyses for these studies, including subgroup analyses, distribution of responses and safety.\n\n“Following our recent FDA approval of TRIKAFTA in people ages 12 and older who have at least one F508del mutation, the simultaneous publication in NEJM and The Lancet and concurrent presentation at NACFC are further testament to the unprecedented results shown in these studies,” said Reshma Kewalramani, M.D., Executive Vice President, Global Medicines Development and Medical Affairs and Chief Medical Officer at Vertex. “We have made significant progress toward bringing medicines targeting the underlying cause of disease to all people with CF, and we are grateful to all of the individuals and families who put their trust in us and participated in these studies.”\n\nThe results were published online in conjunction with the presentation of both studies at the 33rd Annual North American Cystic Fibrosis Conference (NACFC), October 31 through November 2 in Nashville. The oral presentation highlighting key outcomes from both studies is scheduled on Friday, November 1 at 2:15 p.m. CT.\n\nThese studies form the basis of the recent approval of TRIKAFTA by the U.S. FDA and support the Marketing Authorization Application (MAA) currently under review with the European Medicines Agency. Other global submissions are also being prepared and will be submitted in 2020.\n\nAdditional presentations at NACFC highlight data from across Vertex’s CF portfolio, including 96-week long-term safety and efficacy data for SYMDEKO® (tezacaftor/ivacaftor and ivacaftor) in patients ages >12 years with CF homozygous for F508del-CFTR (F/F) or heterozygous for F508del-CFTR and a residual function mutation (F/RF), as well as data demonstrating the burden of illness in F/MF patients >12 years of age.\n\nAbout Cystic Fibrosis \n\nCystic Fibrosis (CF) is a rare, life-shortening genetic disease affecting approximately 75,000 people worldwide. CF is a progressive, multi-system disease that affects the lungs, liver, GI tract, sinuses, sweat glands, pancreas and reproductive tract. CF is caused by a defective and/or missing CFTR protein resulting from certain mutations in the CFTR gene. Children must inherit two defective CFTR genes — one from each parent — to have CF. While there are many different types of CFTR mutations that can cause the disease, the vast majority of all people with CF have at least one F508del mutation. These mutations, which can be determined by a genetic test, or genotyping test, lead to CF by creating non-working and/or too few CFTR proteins at the cell surface. The defective function and/or absence of CFTR protein results in poor flow of salt and water into and out of the cells in a number of organs. In the lungs, this leads to the buildup of abnormally thick, sticky mucus that can cause chronic lung infections and progressive lung damage in many patients that eventually leads to death. The median age of death is in the early 30s.\n\nU.S. INDICATION AND IMPORTANT SAFETY INFORMATION FOR TRIKAFTATM (elexacaftor/tezacaftor/ivacaftor and ivacaftor) TABLETS\n\nTRIKAFTA is a prescription medicine used for the treatment of cystic fibrosis (CF) in patients aged 12 years and older who have at least one copy of the F508del mutation in the cystic fibrosis transmembrane conductance regulator (CFTR) gene. Patients should talk to their doctor to learn if they have an indicated CF gene mutation. It is not known if TRIKAFTA is safe and effective in children under 12 years of age.\n\nPatients should not take TRIKAFTA if they take certain medicines, such as: antibiotics such as rifampin or rifabutin; seizure medicines such as phenobarbital, carbamazepine, or phenytoin; St. John’s wort.\n\nBefore taking TRIKAFTA, patients should tell their doctor about all of their medical conditions, including if they: have kidney problems, have or have had liver problems, are pregnant or plan to become pregnant because it is not known if TRIKAFTA will harm an unborn baby, or are breastfeeding or planning to breastfeed because it is not known if TRIKAFTA passes into breast milk.\n\nTRIKAFTA may affect the way other medicines work, and other medicines may affect how TRIKAFTA works. Therefore, the dose of TRIKAFTA may need to be adjusted when taken with certain medicines. Patients should especially tell their doctor if they take: antifungal medicines including ketoconazole, itraconazole, posaconazole, voriconazole, or fluconazole; antibiotics including telithromycin, clarithromycin, or erythromycin; other medicines including rifampin, rifabutin, phenobarbital, carbamazepine, phenytoin, and St. John’s wort.\n\nTRIKAFTA may cause dizziness in some people who take it. Patients should not drive a car, operate machinery, or do anything that requires alertness until they know how TRIKAFTA affects them.\n\nPatients should avoid food or drink that contains grapefruit while they are taking TRIKAFTA.\n\nTRIKAFTA can cause serious side effects, including:\n\nHigh liver enzymes in the blood, which is a common side effect in people treated with TRIKAFTA. These can be serious and may be a sign of liver injury. The patient’s doctor will do blood tests to check their liver before they start TRIKAFTA, every 3 months during the first year of taking TRIKAFTA, and every year while taking TRIKAFTA. Patients should call their doctor right away if they have any of the following symptoms of liver problems: pain or discomfort in the upper right stomach (abdominal) area; yellowing of the skin or the white part of the eyes; loss of appetite; nausea or vomiting; dark, amber-colored urine.\n\nAbnormality of the eye lens (cataract) in some children and adolescents treated with TRIKAFTA. If the patient is a child or adolescent, their doctor should perform eye examinations before and during treatment with TRIKAFTA to look for cataracts.\n\nThe most common side effects of TRIKAFTA include headache, diarrhea, upper respiratory tract infection (common cold) including stuffy and runny nose, stomach (abdominal) pain, inflamed sinuses, increase in liver enzymes, increase in a certain blood enzyme called creatine phosphokinase, rash, flu (influenza), and increase in blood bilirubin.\n\nThese are not all the possible side effects of TRIKAFTA. Please click here to see the full U.S. Prescribing Information for TRIKAFTA (elexacaftor/tezacaftor/ivacaftor and ivacaftor) tablets. \n\nAbout SYMDEKO® (tezacaftor/ivacaftor and ivacaftor)\n\nSome mutations result in CFTR protein that is not processed or folded normally within the cell, and that generally does not reach the cell surface. SYMDEKO is a combination of tezacaftor and ivacaftor. Tezacaftor is designed to address the trafficking and processing defect of the CFTR protein to enable it to reach the cell surface where ivacaftor can increase the amount of time the protein stays open.\n\nU.S. INDICATION AND IMPORTANT SAFETY INFORMATION FOR SYMDEKO® (tezacaftor/ivacaftor and ivacaftor) TABLETS\n\nSYMDEKO is a prescription medicine used for the treatment of cystic fibrosis (CF) in patients aged 6 years and older who have two copies of the F508del mutation, or who have at least one mutation in the CF gene that is responsive to treatment with SYMDEKO. Patients should talk to their doctor to learn if they have an indicated CF gene mutation. It is not known if SYMDEKO is safe and effective in children under 6 years of age.\n\nPatients should not take SYMDEKO if they take certain medicines or herbal supplements such as: the antibiotics rifampin or rifabutin; seizure medicines such as phenobarbital, carbamazepine, or phenytoin; St. John’s wort.\n\nBefore taking SYMDEKO, patients should tell their doctor if they: have or have had liver problems; have kidney problems; are pregnant or plan to become pregnant because it is not known if SYMDEKO will harm an unborn baby; are breastfeeding or planning to breastfeed because it is not known if SYMDEKO passes into breast milk.\n\nSYMDEKO may affect the way other medicines work, and other medicines may affect how SYMDEKO works. Therefore, the dose of SYMDEKO may need to be adjusted when taken with certain medicines. Patients should especially tell their doctor if they take antifungal medicines such as ketoconazole, itraconazole, posaconazole, voriconazole, or fluconazole; or antibiotics such as telithromycin, clarithromycin, or erythromycin.\n\nSYMDEKO may cause dizziness in some people who take it. Patients should not drive a car, use machinery, or do anything that requires alertness until they know how SYMDEKO affects them.\n\nPatients should avoid food or drink that contains grapefruit or Seville oranges while they are taking SYMDEKO.\n\nSYMDEKO can cause serious side effects, including:\n\nHigh liver enzymes in the blood, which have been reported in people treated with SYMDEKO or treated with ivacaftor alone. The patient’s doctor will do blood tests to check their liver before they start SYMDEKO, every 3 months during the first year of taking SYMDEKO, and every year while taking SYMDEKO. Patients should call their doctor right away if they have any of the following symptoms of liver problems: pain or discomfort in the upper right stomach (abdominal) area; yellowing of the skin or the white part of the eyes; loss of appetite; nausea or vomiting; dark, amber-colored urine.\n\nAbnormality of the eye lens (cataract) in some children and adolescents treated with SYMDEKO or with ivacaftor alone. If the patient is a child or adolescent, their doctor should perform eye examinations before and during treatment with SYMDEKO to look for cataracts.\n\nThe most common side effects of SYMDEKO include headache, nausea, sinus congestion, and dizziness.\n\nThese are not all the possible side effects of SYMDEKO. Please click here to see the full U.S. Prescribing Information for SYMDEKO (tezacaftor/ivacaftor and ivacaftor) tablets.\n\nAbout Vertex \n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has four approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\nSpecial Note Regarding Forward-looking Statements\n\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, the statements by Dr. Jain in the second paragraph and Dr. Kewalramani in the fourth paragraph, and statements regarding our expectations for the preparation and timing of our global regulatory submissions. While Vertex believes the forward-looking statements contained in this press release are accurate, these forward-looking statements represent the company's beliefs only as of the date of this press release and there are a number of risks and uncertainties that could cause actual events or results to differ materially from those expressed or implied by such forward-looking statements. Those risks and uncertainties include, among other things, that data from the company's development programs may not support registration or further development of its compounds due to safety, efficacy or other reasons, obtaining approval and commercializing elexacaftor/tezacaftor/ivacaftor in Europe, developing additional medicines to treat cystic fibrosis, and other risks listed under Risk Factors in Vertex's annual report and subsequent quarterly reports filed with the Securities and Exchange Commission and available through the company's website at www.vrtx.com. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\n(VRTX-GEN)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191031005294/en/\nVertex Pharmaceuticals Incorporated\nInvestors:\nMichael Partridge, 617-341-6108\nor\nLeah Gibson, 617-961-1507\nor\nZach Barber, 617-341-6470\nor\n\nMedia:\nmediainfo@vrtx.com\n+ 1-617-341-6992\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex Reports Third-Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Oct 30, 2019 4:01PM EDT",
        "content": "\n- Product revenues of $950 million, a 21% increase compared to Q3 2018 -\n\n- Continued progression of pipeline of investigational medicines in multiple diseases -\n    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today reported consolidated financial results for the third quarter ended September 30, 2019 and reiterated its full-year 2019 total product revenue guidance.\n\n\"2019 has been a year of significant progress for Vertex across all parts of our business. With the historic approval of TRIKAFTA, we are now one step closer to providing treatment for up to 90% of all people with CF. We've also had tremendous success bringing our CF medicines to more patients globally with reimbursement agreements recently reached in England, Spain, Australia, and Scotland, and through label expansions to younger patients,\" said Jeffrey Leiden, M.D., Ph.D., Chairman, President and Chief Executive Officer of Vertex. \"The company also continues to successfully execute on our strategy of creating transformative medicines for serious diseases through serial innovation. The rapid progress of our pipeline is expected to yield proof-of-concept data in multiple diseases in 2020, which will position Vertex for continued growth in the years ahead.\"\n\nThird-Quarter 2019 Financial Highlights\n\nTotal product revenues increased 21% compared to the third quarter of 2018, primarily driven by the global uptake of SYMDEKO and SYMKEVI in patients ages 12 and older.\n\nGAAP net income decreased compared to the third quarter of 2018, primarily driven by a $175 million upfront payment as part of Vertex's recently expanded collaboration with CRISPR Therapeutics, and was partially offset by the strong growth in total product revenues.\n\nNon-GAAP net income increased compared to the third quarter of 2018, driven by the strong growth in total product revenues, and was partially offset by increased operating expenses and income taxes.\n\nCash, cash equivalents and marketable securities as of September 30, 2019 were $4.0 billion, an increase of approximately $800 million compared to $3.2 billion as of December 31, 2018.\n\nThird-Quarter 2019 Expenses\n\nCombined GAAP R&D and SG&A expenses increased compared to the third quarter of 2018, primarily due to the $175 million upfront payment to CRISPR Therapeutics.\n\nCombined Non-GAAP R&D and SG&A expenses increased compared to the third quarter of 2018, primarily due to the incremental investment to support the global use of Vertex's medicines and the expansion of Vertex's pipeline in CF and other new disease areas.\n\nGAAP and Non-GAAP income taxes increased significantly compared to the third quarter of 2018 due to Vertex's release of its valuation allowance on the majority of its deferred tax assets in the fourth quarter of 2018. GAAP and non-GAAP income taxes in the third quarter of 2019 include a provision for income taxes on Vertex's pre-tax income using an estimated effective tax rate approximating statutory rates. This provision for income taxes includes a significant non-cash charge due to Vertex's ability to offset its pre-tax income against previously benefited net operating losses. Refer to \"Supplemental Income Tax Information\" for discussion of the cash versus non-cash components of Vertex's provision for income taxes.\n\nFull-Year 2019 Financial Guidance\n\nVertex today reiterated its 2019 revenue guidance that was updated on October 21, 2019. A summary of the company's current financial expectations is below:\n\nClinical Development\n\nCystic Fibrosis (CF):\n\nAlpha-1 Antitrypsin (AAT) Program:\n\nSickle Cell Disease and Beta Thalassemia:\n\nAPOL1-Mediated Kidney Diseases:\n\nPain:\n\nInvestments in External Innovation\n\nType 1 Diabetes:\n\nNon-GAAP Financial Measures\n\nIn this press release, Vertex's financial results and financial guidance are provided in accordance with accounting principles generally accepted in the United States (GAAP) and using certain non-GAAP financial measures. In particular, non-GAAP financial results and guidance exclude from Vertex's pre-tax income (i) stock-based compensation expense, (ii) revenues and expenses related to business development transactions including collaboration agreements, asset acquisitions and consolidated variable interest entities, (iii) gains or losses related to the fair value of the company's strategic investments, (iv) acquisition-related costs and (v) other adjustments. The company's non-GAAP financial results also exclude from its provision for or benefit from income taxes the estimated tax impact related to its non-GAAP adjustments to pre-tax income described above. These results are provided as a complement to results provided in accordance with GAAP because management believes these non-GAAP financial measures help indicate underlying trends in the company's business, are important in comparing current results with prior period results and provide additional information regarding the company's financial position. Management also uses these non-GAAP financial measures to establish budgets and operational goals that are communicated internally and externally and to manage the company's business and to evaluate its performance. The company adjusts, where appropriate, for both revenues and expenses in order to reflect the company's operations. The company provides guidance regarding product revenues in accordance with GAAP and provides guidance regarding combined research and development and sales, general, and administrative expenses on both a GAAP and non-GAAP basis. The company also provides guidance regarding its anticipated income taxes as a percentage of pre-tax income on a non-GAAP basis. The guidance regarding GAAP research and development expenses and sales, general and administrative expenses does not include estimates associated with any potential future business development activities. A reconciliation of the GAAP financial results to non-GAAP financial results is included in the attached financial information.\n\nNotes and Explanations\n\n1: The company records gains and losses related to changes in the fair value of its strategic investments to \"Other income, net.\"\n\n2: In the fourth quarter of 2018, the company recorded a non-cash benefit from income taxes of approximately $1.5 billion related to the release of its valuation allowance on the majority of its net operating losses and other deferred tax assets. As a result, the company recorded deferred tax assets of $1.5 billion on its consolidated balance sheet as of December 31, 2018, which were previously subject to its valuation allowance. Starting in the first quarter of 2019, the company began recording a provision for income taxes on its pre-tax income using an estimated effective tax rate that approximates statutory rates. The provision includes a significant non-cash charge due to the company's ability to offset its pre-tax income against previously benefited net operating losses. The company expects the majority of its tax provision to represent a non-cash expense until its net operating losses have been fully utilized. As of December 31, 2018, the company's federal net operating losses and credits that were available to offset future pre-tax income were approximately $4.5 billion.\n\n3: During the three and nine months ended September 30, 2018, the company consolidated the financial statements of a variable interest entity, or VIE, because Vertex had licensed the rights to develop the VIE's most significant intellectual property asset. During the nine months ended September 30, 2018, the fair value of the contingent payments payable by Vertex to the VIE increased by $23.1 million. This increase was attributable to noncontrolling interest and resulted in a decrease in net income attributable to Vertex on a dollar-for-dollar basis. The company deconsolidated the VIE as of December 31, 2018; therefore, there were no comparable amounts during the three and nine months ended September 30, 2019.\n\n4: \"Collaborative revenues and expenses\" in the three and nine months ended September 30, 2019 and 2018 primarily related to collaborative upfront and milestone payments. \"Collaborative revenues and expenses\" in the three and nine months ended September 30, 2018 also included revenues and expenses attributable to our VIE's operations.\n\n5: \"Acquisition-related costs\" in the three and nine months ended September 30, 2019 primarily related to costs associated with the company's acquisition of Exonics. There were no comparable amounts during the three and nine months ended September 30, 2018.\n\n6: In the three and nine months ended September 30, 2019, \"Estimated income taxes related to non-GAAP adjustments to pre-tax income\" primarily related to (i) stock-based compensation (including an adjustment for excess tax benefits related to stock-based compensation), (ii) increases or decreases in the fair value of the company's strategic investments and (iii) collaborative upfront payments. In the three and nine months ended September 30, 2018, \"Estimated income taxes related to non-GAAP adjustments to pre-tax income\" were related to a provision for income taxes attributable to the company's VIE and excess tax benefits related to stock-based compensation.\n\nAbout Vertex\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has four approved medicines that treat the underlying cause of cystic fibrosis (CF) - a rare, life-threatening genetic disease - and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including 10 consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\nSpecial Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, Dr. Leiden's statements in this press release, the information provided regarding future financial performance, including in the section captioned \"Full Year 2019 Financial Guidance\" and statements regarding (i) the timing and expected outcome of regulatory applications and reimbursement for CF medicines globally and (ii) the development plan and timelines for our product development candidates, including our next-generation triple combination regimen, CTX001, VX-814, VX-864, VX-147 and VX-961. While Vertex believes the forward-looking statements contained in this press release are accurate, these forward-looking statements represent the company's beliefs only as of the date of this press release and there are a number of risks and uncertainties that could cause actual events or results to differ materially from those expressed or implied by such forward-looking statements. Those risks and uncertainties include, among other things, that the company's expectations regarding its 2019 CF net product revenues, expenses and effective tax rates may be incorrect (including because one or more of the company's assumptions underlying its expectations may not be realized), that data from the company's development programs may not support registration or further development of its compounds due to safety, efficacy or other reasons, and other risks listed under Risk Factors in Vertex's annual report and subsequent quarterly reports filed with the Securities and Exchange Commission and available through the company's website at www.vrtx.com. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\nConference Call and Webcast\nThe company will host a conference call and webcast today at 5:00 p.m. ET. To access the call, please dial (866) 501-1537 (U.S.) or +1 (720) 545-0001 (International). The conference call will be webcast live and a link to the webcast can be accessed through Vertex's website at www.vrtx.com in the \"Investors\" section under \"Events and Presentations.\" To ensure a timely connection, it is recommended that users register at least 15 minutes prior to the scheduled webcast. An archived webcast will be available on the company's website.\n\n(VRTX-E)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005943/en/\nInvestors:\nMichael Partridge, 617-341-6108\nor\nZach Barber, 617-341-6470\nor\nLeah Gibson, 617-961-1507\n\n\nMedia:\n617-341-6992\nmediainfo@vrtx.com\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex to Announce Third-Quarter 2019 Financial Results on October 30",
        "subtitle": "",
        "date": "Oct 21, 2019 4:07PM EDT",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) will report its third quarter 2019 financial results on Wednesday, October 30, 2019 after the financial markets close. The company will host a conference call and webcast at 5:00 p.m. ET. To access the call, please dial (866) 501-1537 (U.S.) or +1 (720) 545-0001 (International).\n\nThe conference call will be webcast live and a link to the webcast can be accessed through Vertex's website at www.vrtx.com in the \"Investors\" section. To ensure a timely connection, it is recommended that participants register at least 15 minutes prior to the scheduled webcast. An archived webcast will be available on the company's website.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has three approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including nine consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005799/en/\nVertex Investor Contacts:\nMichael Partridge, 617-341-6108\nZach Barber, 617-341-6470\nLeah Gibson, 617-961-1507\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "ADDING MULTIMEDIA FDA Approves TRIKAFTA (elexacaftor/tezacaftor/ivacaftor and ivacaftor) to Treat the Underlying Cause of Cystic Fibrosis in People Ages 12 and Older Who Have at Least One F508del Mutation",
        "subtitle": "",
        "date": "Oct 21, 2019 3:55PM EDT",
        "content": "\n- For the first time, approximately 6,000 patients with one minimal function mutation and one F508del mutation have a medicine to treat the underlying cause of their disease–\n\n-12,000 people with one or two F508del mutations who are currently eligible for one of Vertex’s three other FDA-approved cystic fibrosis medicines are now also eligible for TRIKAFTA-\n\n-Approval is based on two positive global Phase 3 studies in people with cystic fibrosis ages 12 and older with one F508del mutation and one minimal function mutation and in people with two F508del mutations-\n    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced the U.S. Food and Drug Administration (FDA) has approved TRIKAFTA™ (elexacaftor/tezacaftor/ivacaftor and ivacaftor) for the treatment of cystic fibrosis (CF) in people ages 12 years and older who have at least one F508del mutation in the cystic fibrosis transmembrane conductance regulator (CFTR) gene, the most common CF-causing mutation. With this approval, for the first time, approximately 6,000 people with CF ages 12 years and older who have one F508del mutation and one minimal function mutation (F/MF) have a medicine that targets the underlying cause of their CF. Additionally, approximately 12,000 people with one or two F508del mutations who are currently eligible for one of Vertex’s three other FDA-approved CF medicines are now also eligible for TRIKAFTA.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191021005792/en/TRIKAFTA Product Shot (Photo: Business Wire)\n“Today marks a milestone for CF patients, their families and Vertex. After a 20-year journey together, we have received FDA approval of TRIKAFTA: a single breakthrough medicine with the potential to treat up to 90% of all people with CF in the future. For approximately 6,000 people with CF in the U.S., TRIKAFTA is the first medicine that can treat the underlying cause of their disease,” said Jeffrey Leiden, M.D., Ph.D., Vertex's Chairman, President and Chief Executive Officer. “I want to personally thank the hundreds of Vertex scientists who have been working on this program for nearly 20 years – many of whom have dedicated their entire careers to changing the course of this disease; the CF Foundation which has provided support, encouragement and help throughout the journey; and most importantly the thousands of patients, caregivers, doctors and advocates who have courageously and persistently worked side-by-side with us to get to where we are today.”\n\n“Today’s approval is a historic moment in cystic fibrosis care, with the potential for more people to benefit from CFTR modulator therapy to treat the basic defect of their disease,” said Steven Rowe, M.D., Director, Gregory Fleming James Cystic Fibrosis Research Center, University of Alabama at Birmingham. “In clinical trials, TRIKAFTA was generally well tolerated and demonstrated improvements in multiple outcome measures in CF, including improvements in FEV1, improvements in respiratory symptoms and, in the 24-week F/MF study, a reduced rate of pulmonary exacerbations and improvements in BMI.”\n\n“The incredible speed of this approval underscores our shared sense of urgency with the FDA and the CF community for bringing this medicine to eligible people with CF, particularly those without a medicine targeting the underlying cause of their disease,” said Reshma Kewalramani, M.D., Executive Vice President, Global Medicines Development and Medical Affairs and Chief Medical Officer at Vertex. “We remain committed to relentlessly pursuing the development of transformative therapies for all people living with this disease.”\n\nVertex has submitted a Marketing Authorization Application (MAA) to the European Medicines Agency (EMA) for the elexacaftor/tezacaftor/ivacaftor combination regimen. Vertex is currently evaluating elexacaftor/tezacaftor/ivacaftor in people ages 6 through 11 with F/MF and F/F CF mutations in an ongoing Phase 3 study and is committed to evaluating elexacaftor/tezacaftor/ivacaftor in children "
    },
    {
        "title": "Vertex Receives European CHMP Positive Opinion for KALYDECO® (ivacaftor) to Treat Eligible Infants with Cystic Fibrosis as Early as 6 Months of Age",
        "subtitle": "",
        "date": "Oct 18, 2019 8:37AM EDT",
        "content": "\n- If approved, ivacaftor will be the first and only medicine to treat the underlying cause of cystic fibrosis for children this young -\n    LONDON--(BUSINESS WIRE)--\nVertex Pharmaceuticals (Europe) Limited today announces that the European Medicines Agency’s (EMA) Committee for Medicinal Products for Human Use (CHMP) adopted a positive opinion for KALYDECO® (ivacaftor), to include use in infants with cystic fibrosis (CF) ages 6 months to less than 12 months who have one of the following mutations in their cystic fibrosis transmembrane conductance regulator (CFTR) gene: G551D, G1244E, G1349D, G178R, G551S, S1251N, S1255P, S549N or S549R.\n\nIf the European Commission issues a favorable adoption of the EMA CHMP opinion for the extension of indication, ivacaftor will be the first and only medicine approved in Europe to treat the underlying cause of CF in patients ages 6 months to less than 12 months, who have specific mutations in the CFTR gene.\n\n“Cystic fibrosis is present from birth and symptoms frequently manifest in infancy, which is why it is so important to treat the condition as early as possible” said Reshma Kewalramani, M.D., Executive Vice President and Chief Medical Officer at Vertex. “We are committed to treating every person with this life-limiting disease and today brings us one step closer to providing a medicine for very young children with cystic fibrosis.”\n\nThe submission was supported by data from the ongoing Phase 3 open-label safety study (ARRIVAL) of children with CF ages 6 months to less than 12 months who have certain mutations in the CFTR gene. The study showed a safety profile similar to that observed in previous Phase 3 studies of older children and adults, and improvements in sweat chloride, a key secondary efficacy endpoint.\n\nIvacaftor is already approved in Europe for the treatment of CF in patients ages 12 months and older who have one of the following mutations in the CFTR gene: G551D, G1244E, G1349D, G178R, G551S, S1251N, S1255P, S549N or S549R. It is also approved for the treatment of CF in patients 18 years and older who have the R117H mutation in the CFTR gene.\n\nAbout Cystic Fibrosis\nCystic Fibrosis (CF) is a rare, life-shortening genetic disease affecting approximately 75,000 people worldwide. CF is a progressive, multi-system disease that affects the lungs, liver, GI tract, sinus, sweat gland, pancreas and reproductive tract. CF is caused by a defective and/or missing CFTR protein resulting from certain mutations in the CFTR gene. Children must inherit two defective CFTR genes — one from each parent — to have CF. While there are many different types of CFTR mutations that can cause the disease, the vast majority of all people with CF have at least one F508del mutation. These mutations, which can be determined by a genetic test, or genotyping test, lead to CF by creating non-working and/or too few CFTR proteins at the cell surface. The defective function and/or absence of CFTR protein results in poor flow of salt and water into and out of the cells in a number of organs. In the lungs, this leads to the buildup of abnormally thick, sticky mucus that can cause chronic lung infections and progressive lung damage in many patients that eventually leads to death. The median age of death is in the early 30s.\n\nAbout KALYDECO® (ivacaftor)\nKALYDECO® (ivacaftor) is the first medicine to treat the underlying cause of CF in people with specific mutations in the CFTR gene. Known as a CFTR potentiator, ivacaftor is an oral medicine designed to keep CFTR proteins at the cell surface open longer to improve the transport of salt and water across the cell membrane, which helps hydrate and clear mucus from the airways.\n\nPeople with CF who have specific mutations in the CFTR gene are currently benefiting from ivacaftor in countries across North America, Europe and in Australia.\n\nAbout Vertex\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has three approved medicines that treat the underlying cause of cystic fibrosis (CF) – a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha- 1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including nine consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes.\n\nSpecial Note Regarding Forward-looking Statements\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, the statements in the second and third paragraphs of the press release. While Vertex believes the forward-looking statements contained in this press release are accurate, these forward-looking statements represent the company's beliefs only as of the date of this press release and there are a number of factors that could cause actual events or results to differ materially from those indicated by such forward-looking statements. Those risks and uncertainties include, among other things, that data from the company's development programs may not support registration or further development of its compounds due to safety, efficacy or other reasons, and other risks listed under Risk Factors in Vertex's annual report and quarterly reports filed with the Securities and Exchange Commission and available through the company's website at www.vrtx.com. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\n(VRTX-GEN)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191018005285/en/\nVertex Pharmaceuticals Incorporated\nInvestors:\nMichael Partridge, +1-617-341-6108\nor\nZach Barber, +1-617-341-6470\nor\nLeah Gibson, +1-857-526-6027\n\nMedia: mediainfo@vrtx.com\nor\nNorth America:\nSarah D'Souza, +1-617-341-6341\nor\nEurope & Australia:\nPatricia Dessert, +44 7543 237825\nSource: Vertex Pharmaceuticals"
    },
    {
        "title": "Vertex Appoints Carmen Bozic, M.D., as New Chief Medical Officer and Nia Tatsis, Ph.D., as New Chief Regulatory Officer",
        "subtitle": "",
        "date": "Oct 1, 2019 8:00AM EDT",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that Carmen Bozic, M.D., has been appointed as the company’s Executive Vice President, Global Medicines Development and Medical Affairs. Dr. Bozic will assume the additional role of Chief Medical Officer on April 1, 2020 when Reshma Kewalramani, M.D., the company’s current Chief Medical Officer, becomes President and Chief Executive Officer of Vertex. Dr. Bozic has served as Senior Vice President and Head of Global Clinical Development since May of this year.\n\nVertex also announced the appointment of Nia Tatsis, Ph.D., currently Vertex’s Senior Vice President, Global Regulatory Affairs, as Senior Vice President, Chief Regulatory Officer, effective immediately.\n\n“The addition of Carmen and Nia to Vertex’s executive team further strengthens our leadership ranks as we work towards completing our CF journey and bringing new therapies into the clinic in a variety of new disease areas,” said Jeffrey Leiden, M.D., Ph.D., Chairman, President and Chief Executive Officer of Vertex.\n\nDr. Bozic received her M.D. and completed her residency in Internal medicine at McGill University in Montreal, Canada, and then completed a fellowship in Pulmonary and Critical Care Medicine at Brigham and Women’s Hospital in Boston. Since joining Vertex, she has been leading Clinical Development of the company’s cystic fibrosis and alpha-1 antitrypsin deficiency programs, as well as leading Clinical Operations across the pipeline, among other areas. Prior to joining Vertex, Dr. Bozic spent more than 20 years at Biogen, including as Senior Vice President, Global Development. During her tenure at Biogen, she led multiple functions, including Global Clinical Development, Safety, Preclinical Safety, Regulatory, Clinical Operations and Biometrics.\n\n“I am thrilled to take on the leadership of Vertex’s talented Global Medicines Development and Medical Affairs team at such an exciting time for the company,” said Dr. Bozic. “Vertex advanced its cystic fibrosis portfolio through the clinic with unprecedented speed and purpose, and now has seven potential therapies in the clinic with the opportunity to transform the treatment of patients with other serious diseases.”\n\nDr. Tatsis received her Ph.D. in Cell and Molecular Biology from the University of Vermont and holds a B.S. in Biology from Temple University. She was a Post-Doctoral Fellow at the Wistar Institute and has held positions of increasing responsibility at pharmaceutical companies including Sanofi, Pfizer, and Wyeth prior to joining Vertex in 2017. Most recently, she was Vice President, Head of Global Regulatory Affairs of the Sanofi Genzyme Business Unit focused on Immunology, Rare Diseases, Multiple Sclerosis and Oncology.\n\n“Vertex is a company that is relentlessly focused on scientific innovation and bringing transformative advances in medicine to patients with serious diseases,” said Dr. Tatsis. “We have an outstanding regulatory team and I am honored to lead them in this role as we work to deliver on our mission and strategy.”\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has three approved medicines that treat the underlying cause of cystic fibrosis (CF) — a rare, life-threatening genetic disease — and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including nine consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\nVertex Special Note Regarding Forward-Looking Statements\n\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, the statements in the first, third, fifth, and seventh paragraphs of this press release. While Vertex believes the forward-looking statements contained in this press release are accurate, there are a number of factors that could cause actual events or results to differ materially from those indicated by such forward-looking statements. Those risks and uncertainties include, among other things, risks listed under Risk Factors in Vertex's annual report and quarterly reports filed with the Securities and Exchange Commission. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.\n\n(VRTX-GEN)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191001005204/en/\nVertex Investor Contacts:\nMichael Partridge, 617-341-6108\nor\nLeah Gibson, 617-961-1507\nor\nZach Barber, 617-341-6470\n\nVertex Media Contact:\nHeather Nichols\n617-341-6992\nmediainfo@vrtx.com\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex to Present at the Morgan Stanley Global Healthcare Conference on September 11",
        "subtitle": "",
        "date": "Sep 10, 2019 8:30AM EDT",
        "content": "    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that management will present at the Morgan Stanley Global Healthcare Conference on Wednesday, September 11, 2019 at 12:15 p.m. ET.\n\nThe audio portion of management’s remarks can be accessed live through Vertex’s website, www.vrtx.com, in the “Investors” section under the “News and Events” page. A replay of the conference webcast will be archived on the company’s website.\n\nAbout Vertex\n\nVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious diseases. The company has three approved medicines that treat the underlying cause of cystic fibrosis (CF) - a rare, life-threatening genetic disease - and has several ongoing clinical and research programs in CF. Beyond CF, Vertex has a robust pipeline of investigational medicines in other serious diseases where it has deep insight into causal human biology, such as sickle cell disease, beta thalassemia, pain, alpha-1 antitrypsin deficiency, Duchenne muscular dystrophy and APOL1-mediated kidney diseases.\n\nFounded in 1989 in Cambridge, Mass., Vertex's global headquarters is now located in Boston's Innovation District and its international headquarters is in London, UK. Additionally, the company has research and development sites and commercial offices in North America, Europe, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including nine consecutive years on Science magazine's Top Employers list and top five on the 2019 Best Employers for Diversity list by Forbes. For company updates and to learn more about Vertex's history of innovation, visit www.vrtx.com or follow us on Facebook, Twitter, LinkedIn, YouTube and Instagram.\n\n(VRTX-WEB)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190910005201/en/\nVertex Pharmaceuticals Incorporated\nInvestors:\nMichael Partridge, 617-341-6108\nEric Rojas, 617-961-7205\nZach Barber, 617-341-6470\nSource: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex Reports Second-Quarter 2019 Financial Results",
        "subtitle": "",
        "date": "Jul 31, 2019 4:01PM EDT",
        "content": "\n- Product revenues of $940 million, a 25% increase compared to 2018 -\n\n- Company increases full-year 2019 total product revenue guidance to $3.6 to $3.7 billion -\n\n- Company advancing programs in 5 additional diseases beyond cystic fibrosis -\n    BOSTON--(BUSINESS WIRE)--\nVertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today reported consolidated financial results for the second quarter ended June 30, 2019 and increased its full-year 2019 total product revenue guidance.\n\n\"We have made tremendous progress across our business in 2019 thus far. In CF, we submitted a New Drug Application to the FDA for our VX-445 triple combination regimen, which we believe has the potential to treat up to 90% of all CF patients in the future. We continue to focus on ensuring all eligible patients have access to our CF medicines as early as possible,\" said Jeffrey Leiden, M.D., Ph.D., Chairman, President and Chief Executive Officer of Vertex. \"Additionally, we have rapidly grown our pipeline beyond CF, advancing seven new potential medicines across five disease areas, including beta thalassemia, sickle cell disease, alpha-1 antitrypsin deficiency, APOL1-mediated kidney diseases and pain. And through our expanded collaboration with CRISPR Therapeutics and acquisition of Exonics Therapeutics, we have now established a leading gene editing platform for the treatment of Duchenne Muscular Dystrophy and Myotonic Dystrophy Type 1.\"\n\nSecond-Quarter 2019 Financial Highlights\n\nTotal product revenues increased 25% compared to the second quarter of 2018, primarily driven by the uptake of SYMDEKO in the U.S. and SYMKEVI in Germany.\n\nGAAP net income increased compared to the second quarter of 2018, driven by the strong growth in total product revenues, and was partially offset by increases in operating expenses, including a $50 million upfront payment as part of Vertex's recent collaboration with Kymera Therapeutics, and income taxes.\n\nNon-GAAP net income increased compared to the second quarter of 2018, driven by the strong growth in total product revenues, and was partially offset by increased income taxes.\n\nCash, cash equivalents and marketable securities as of June 30, 2019 were $4.0 billion, an increase of approximately $800 million compared to $3.2 billion as of December 31, 2018.\n\nSecond-Quarter 2019 Expenses\n\nCombined GAAP R&D and SG&A expenses increased compared to the second quarter of 2018 primarily due to the $50 million upfront payment to Kymera Therapeutics.\n\nCombined Non-GAAP R&D and SG&A expenses were similar to the second quarter of 2018.\n\nGAAP and Non-GAAP income taxes increased significantly compared to the second quarter of 2018 due to Vertex's release of its valuation allowance on the majority of its deferred tax assets in the fourth quarter of 2018. GAAP and non-GAAP income taxes in the second quarter of 2019 include a provision for income taxes on Vertex's pre-tax income using an estimated effective tax rate approximating statutory rates. This provision for income taxes includes a significant non-cash charge due to Vertex's ability to offset its pre-tax income against previously benefited net operating losses. Refer to \"Supplemental Income Tax Information\" for discussion of the cash versus non-cash components of Vertex's provision for income taxes.\n\nShare Repurchase Program\n\nIn order to reduce the impact of dilution from employee equity programs, the Board of Directors has authorized a share repurchase program of up to $500 million of common stock through December 31, 2020.\n\nThe repurchase is expected to be executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans.\n\nFull-Year 2019 Financial Guidance\n\nVertex today announced updates to its 2019 financial guidance as summarized below:\n\nThe increase in total product revenue guidance is based on the strong product performance in the first half of 2019.\n\nThe company's revised combined GAAP R&D and SG&A expense guidance reflects upfront payments made to CRISPR Therapeutics and Kymera Therapeutics for transactions announced in the second quarter of 2019.\n\nBusiness Highlights\n\nCF CLINICAL DEVELOPMENT\n"
    },
    {
        "title": "CRISPR Therapeutics and Vertex Announce FDA Fast Track Designation for CTX001 for the Treatment of Beta Thalassemia",
        "subtitle": "",
        "date": "Apr 16, 2019 7:00AM EDT",
        "content": "ZUG, Switzerland and CAMBRIDGE, Mass. and BOSTON, April 16, 2019 (GLOBE NEWSWIRE) -- CRISPR Therapeutics (Nasdaq:CRSP) and Vertex Pharmaceuticals Incorporated (Nasdaq:VRTX) today announced that the U.S. Food and Drug Administration (FDA) has granted Fast Track Designation for CTX001 for the treatment of transfusion-dependent beta thalassemia (TDT). CTX001 is an investigational, autologous, gene-edited hematopoietic stem cell therapy for patients suffering from severe hemoglobinopathies.The FDA's Fast Track program is designed to facilitate the development and expedite the review of drugs that treat serious conditions and fill unmet medical needs. A drug granted Fast Track Designation may be eligible for several benefits, including more frequent meetings and communications with the FDA and, if relevant criteria are met, the potential for Accelerated Approval, Priority Review or Rolling Review of a Biologics License Application (BLA).In February 2019, CRISPR Therapeutics and Vertex announced that the first patient had been treated with CTX001 in a Phase 1/2 clinical study of patients with TDT, marking the first company-sponsored use of a CRISPR/Cas9 therapy in a clinical trial. The Phase 1/2 open-label trial is designed to assess the safety and efficacy of a single dose of CTX001 in patients ages 18 to 35 with TDT, non-beta zero/beta zero subtypes. The companies are also evaluating CTX001 for the treatment of sickle cell disease (SCD) and received Fast Track Designation for CTX001 from the FDA in January 2019 for SCD. The companies announced in February 2019 that the first patient had been enrolled in a Phase 1/2 clinical study of CTX001 in severe SCD in the U.S. and is expected to be infused with CTX001 in mid-2019. Enrollment in both studies is ongoing.About CTX001CTX001 is an investigational ex vivo CRISPR gene-edited therapy that is being evaluated for patients suffering from TDT or severe SCD in which a patient's hematopoietic stem cells are engineered to produce high levels of fetal hemoglobin (HbF; hemoglobin F) in red blood cells. HbF is a form of the oxygen carrying hemoglobin that is naturally present at birth and is then replaced by the adult form of hemoglobin. The elevation of HbF by CTX001 has the potential to alleviate transfusion requirements for TDT patients and painful and debilitating sickle crises for SCD patients.CTX001 is being developed under a co-development and co-commercialization agreement between CRISPR Therapeutics and Vertex.About the CRISPR-Vertex CollaborationCRISPR Therapeutics and Vertex entered into a strategic research collaboration in 2015 focused on the use of CRISPR/Cas9 to discover and develop potential new treatments aimed at the underlying genetic causes of human disease. CTX001 represents the first treatment to emerge from the joint research program. CRISPR Therapeutics and Vertex will jointly develop and commercialize CTX001 and equally share all research and development costs and profits worldwide.About CRISPR TherapeuticsCRISPR Therapeutics is a leading gene editing company focused on developing transformative gene-based medicines for serious diseases using its proprietary CRISPR/Cas9 platform. CRISPR/Cas9 is a revolutionary gene editing technology that allows for precise, directed changes to genomic DNA. CRISPR Therapeutics has established a portfolio of therapeutic programs across a broad range of disease areas including hemoglobinopathies, oncology, regenerative medicine and rare diseases. To accelerate and expand its efforts, CRISPR Therapeutics has established strategic collaborations with leading companies including Bayer AG, Vertex Pharmaceuticals and ViaCyte, Inc.CRISPR Therapeutics AG is headquartered in Zug, Switzerland, with its wholly-owned U.S. subsidiary, CRISPR Therapeutics, Inc., and R&D operations based in Cambridge, Massachusetts, and business offices in London, United Kingdom. For more information, please visit www.crisprtx.com.CRISPR Forward-Looking StatementThis press release may contain a number of \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including statements regarding CRISPR Therapeutics' expectations about any or all of the following: (i) clinical trials (including, without limitation, the timing of filing of clinical trial applications and INDs, any approvals thereof and the timing of commencement of clinical trials), development timelines and discussions with regulatory authorities related to product candidates under development by CRISPR Therapeutics and its collaborators; (ii) the number of patients that will be evaluated, the anticipated date by which enrollment will be completed and the data that will be generated by ongoing and planned clinical trials, and the ability to use that data for the design and initiation of further clinical trials; (iii) the scope and timing of ongoing and potential future clinical trials; (iv) the intellectual property coverage and positions of CRISPR Therapeutics, its licensors and third parties; (v) the sufficiency of CRISPR Therapeutics' cash resources; and (vi) the therapeutic value, development, and commercial potential of CRISPR/Cas9 gene editing technologies and therapies. Without limiting the foregoing, the words \"believes,\" \"anticipates,\" \"plans,\" \"expects\" and similar expressions are intended to identify forward-looking statements. You are cautioned that forward-looking statements are inherently uncertain. Although CRISPR Therapeutics believes that such statements are based on reasonable assumptions within the bounds of its knowledge of its business and operations, forward-looking statements are neither promises nor guarantees and they are necessarily subject to a high degree of uncertainty and risk. Actual performance and results may differ materially from those projected or suggested in the forward-looking statements due to various risks and uncertainties. These risks and uncertainties include, among others: the outcomes for each CRISPR Therapeutics' planned clinical trials and studies may not be favorable; that one or more of CRISPR Therapeutics' internal or external product candidate programs will not proceed as planned for technical, scientific or commercial reasons; that future competitive or other market factors may adversely affect the commercial potential for CRISPR Therapeutics' product candidates; uncertainties inherent in the initiation and completion of preclinical studies for CRISPR Therapeutics' product candidates; availability and timing of results from preclinical studies; whether results from a preclinical trial will be predictive of future results of the future trials; uncertainties about regulatory approvals to conduct trials or to market products; uncertainties regarding the intellectual property protection for CRISPR Therapeutics' technology and intellectual property belonging to third parties; and those risks and uncertainties described under the heading \"Risk Factors\" in CRISPR Therapeutics' most recent annual report on Form 10-K, and in any other subsequent filings made by CRISPR Therapeutics with the U.S. Securities and Exchange Commission, which are available on the SEC's website at www.sec.gov. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they are made. CRISPR Therapeutics disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release, other than to the extent required by law.About VertexVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious and life-threatening diseases. In addition to clinical development programs in cystic fibrosis, Vertex has more than a dozen ongoing research programs focused on the underlying mechanisms of other serious diseases.Founded in 1989 in Cambridge, Mass., Vertex's headquarters is now located in Boston'sInnovation District. Today, the company has research and development sites and commercial offices in the United States, Europe, Canada, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including being named to Science magazine's Top Employers in the life sciences ranking for nine years in a row.For additional information and the latest updates from the Company, please visit www.vrtx.com.(VRTX-GEN)Vertex Special Note Regarding Forward-Looking StatementsThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, statements regarding the potential benefits of Fast Track Designation and the ongoing clinical trials for CTX001. While Vertex believes the forward-looking statements contained in this press release are accurate, there are a number of factors that could cause actual events or results to differ materially from those indicated by such forward-looking statements. Those risks and uncertainties include, among other things, risks related to developing drug candidates and the other risks listed under Risk Factors in Vertex's annual report and quarterly reports filed with the Securities and Exchange Commission. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.CRISPR Investor Contact:Susan Kim+1 617-307-7503susan.kim@crisprtx.comCRISPR Media Contact:Jennifer PaganelliWCG on behalf of CRISPR+1 347-658-8290jpaganelli@wcgworld.comVertex Pharmaceuticals IncorporatedInvestors:Michael Partridge, +1 617-341-6108orEric Rojas, +1 617-961-7205orZach Barber, +1 617-341-6470Media: mediainfo@vrtx.comorNorth America:Heather Nichols, +1 617-341-6992Heather_Nichols@vrtx.comSource: CRISPR Therapeutics AG"
    },
    {
        "title": "Vertex to Announce First-Quarter 2019 Financial Results on April 30",
        "subtitle": "",
        "date": "Apr 12, 2019 8:00AM EDT",
        "content": "BOSTON--(BUSINESS WIRE)-- Vertex Pharmaceuticals Incorporated (Nasdaq:VRTX) will report its first quarter 2019 financial results on Tuesday, April 30, 2019 after the financial markets close. The company will host a conference call and webcast at 4:30 p.m. ET. To access the call, please dial (866) 501-1537 (U.S.) or +1 (720) 545-0001 (International).The conference call will be webcast live and a link to the webcast can be accessed through Vertex's website at www.vrtx.com in the \"Investors\" section. To ensure a timely connection, it is recommended that participants register at least 15 minutes prior to the scheduled webcast. An archived webcast will be available on the company's website.About VertexVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious and life-threatening diseases. In addition to clinical development programs in CF, Vertex has more than a dozen ongoing research programs focused on the underlying mechanisms of other serious diseases.Founded in 1989 in Cambridge, Mass., Vertex's headquarters is now located in Boston's Innovation District. Today, the company has research and development sites and commercial offices in the United States, Europe, Canada, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including being named to Science magazine's Top Employers in the life sciences ranking for nine years in a row.For additional information and the latest updates from the company, please visit www.vrtx.com.(VRTX-WEB)View source version on businesswire.com: https://www.businesswire.com/news/home/20190412005070/en/Source: Vertex Pharmaceuticals Incorporated"
    },
    {
        "title": "Vertex Appoints Charles Wagner as Chief Financial Officer",
        "subtitle": "",
        "date": "Apr 2, 2019 8:00AM EDT",
        "content": "BOSTON--(BUSINESS WIRE)-- Vertex Pharmaceuticals Incorporated (Nasdaq:VRTX) today announced the appointment of Charles (Charlie) Wagner as Executive Vice President and Chief Financial Officer (CFO), effective April 10, 2019. Mr. Wagner will report directly to Vertex Chairman, President and Chief Executive Officer Jeffrey Leiden, M.D., Ph.D., and oversee the finance, internal audit, investor relations, and global security and facilities functions. Mr. Wagner joins Vertex with deep corporate finance and health care experience, including more than a decade in public and private company CFO roles.\"Charlie is a proven finance leader with extensive experience working in a public company setting, and he will be a tremendous asset to Vertex and our strong team,\" said Dr. Leiden. \"As we continue to build Vertex for the future, Charlie's strategic mindset, operational expertise, and broad leadership experience will prove invaluable. I'd like to thank our interim CFO, Paul Silva, for his contributions and leadership. Paul will continue in his role as Corporate Controller upon Charlie's arrival.\"Mr. Wagner joins Vertex from Ortho Clinical Diagnostics, Inc. - a Carlyle Group portfolio company, where he served as CFO and EVP, Finance. In this role, he had leadership responsibilities for all aspects of finance, accounting, tax, treasury, global information systems, lender relations, and acquisitions and divestitures, as well as shared responsibility for several enterprise-wide projects. Prior to this, Mr. Wagner served as CFO for publicly- traded Bruker Corporation, Progress Software Corporation and Millipore Corporation. In addition to his corporate finance roles, Mr. Wagner served as an advisor at Bain & Company and Coopers & Lybrand. He received his BS in accounting from Boston College and his MBA from Harvard Business School.\"I am excited to be joining Vertex at such a dynamic time as the company continues to deliver more transformational medicines for cystic fibrosis patients and accelerates its pipeline of innovative and novel life-changing treatments for patients with other serious diseases,\" said Mr. Wagner. \"I look forward to working with Vertex's senior leadership team and employees to help the company continue to drive value through its remarkable innovation.\"About VertexVertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious and life-threatening diseases. In addition to clinical development programs in CF, Vertex has more than a dozen ongoing research programs focused on the underlying mechanisms of other serious diseases.Founded in 1989 in Cambridge, Mass., Vertex's headquarters is now located in Boston'sInnovation District. Today, the company has research and development sites and commercial offices in the United States, Europe, Canada, Australia and Latin America. Vertex is consistently recognized as one of the industry's top places to work, including being named to Science magazine's Top Employers in the life sciences ranking for nine years in a row.For additional information and the latest updates from the company, please visit www.vrtx.com.Special Note Regarding Forward-looking StatementsThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, including, without limitation, the statements in the second and fourth paragraphs of this press release. While Vertex believes the forward-looking statements contained in this press release are accurate, there are a number of factors that could cause actual events or results to differ materially from those indicated by such forward-looking statements. Those risks and uncertainties include, among other things, risks listed under Risk Factors in Vertex's annual report and quarterly reports filed with the Securities and Exchange Commission. Vertex disclaims any obligation to update the information contained in this press release as new information becomes available.(VRTX-GEN)View source version on businesswire.com: https://www.businesswire.com/news/home/20190402005193/en/Source: Vertex Pharmaceuticals Incorporated"
    }
]