[
    {
        "title": "Walgreens Boots Alliance Schedules Fiscal 2020 Second Quarter Earnings Announcement for April 2, 2020",
        "subtitle": "",
        "date": "Mar 2, 2020 10:34AM EST",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) will release its fiscal 2020 second quarter earnings results at 7 a.m. Eastern time Thursday, April 2, 2020 followed by a one-hour conference call with Walgreens Boots Alliance management beginning at 8:30 a.m. Eastern time.\n\nThe conference call will be simulcast through the Walgreens Boots Alliance investor relations website at: http://investor.walgreensbootsalliance.com. A replay of the conference call will be archived on the website for 12 months after the call.\n\nThe replay also will be available from 11:30 a.m. Eastern time, April 2, 2020, through April 9, 2020, by calling +1 800 585 8367 within the U.S. and Canada, or +1 416 621 4642 internationally, using replay code 4048187.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2020 list of the World’s Most Admired Companies. This is the 27th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release and related conference call and webcast that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ended August 31, 2019 and in other documents that we file or furnish with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, we do not undertake, and expressly disclaim, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200302005668/en/\nMedia Relations\nUSA / Fiona Ortiz\n+1 847 527 2210\nInternational\n+44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance"
    },
    {
        "title": "Championing Global Health: Walgreens Boots Alliance New Global Sustainability Report Details Support for People Living with Cancer and Efforts to Improve Child and Maternal Health",
        "subtitle": "",
        "date": "Feb 11, 2020 7:00AM EST",
        "content": "\nCompany Continues Progress on Reducing Carbon Footprint\n    LONDON--(BUSINESS WIRE)--\nWalgreens Boots Alliance (Nasdaq: WBA) today announced the publication of its 2019 Corporate Social Responsibility (CSR) Report, which details the company’s global sustainability initiatives, including efforts to improve access to quality healthcare, deliver support programs for people living with cancer and reduce its carbon footprint.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200211005125/en/Walgreens stores sponsored more than 1,800 health fairs in local communities where they provided flu clinics, diabetes screening and information on opioid safety and drug takeback during fiscal year ending August 31, 2019. (Photo: Business Wire)\n“Our purpose at WBA is to help people live healthier and happier lives,” said Ornella Barra, WBA’s co-chief operating officer and the chairman of the company’s Corporate Social Responsibility Committee. “Everyone deserves the opportunity to fulfill his or her potential, regardless of where one lives. That’s why we mobilize our incredible employees and invest resources in issues that impact our patients, customers and society. We believe in our ability to effect positive change in communities around the world.”\n\nWBA is a leading global pharmacy retailer and wholesaler, present in 25 countries, including equity method investments. The company includes Boots UK, Boots Ireland, Alliance Healthcare and Walgreens and reaches millions of customers and patients through its retail pharmacy businesses every day.\n\nHighlights from this year’s report include:\n\nExpansion of In-Store Support for People Living with Cancer \n\nFor the past 20 years, Walgreens Boots Alliance and its businesses has sought to create innovative and meaningful support for cancer patients and their loved ones.\n\nFor more than 10 years, Boots UK and Macmillan Cancer Support, one of the largest British charities, have worked together to train beauty consultants and pharmacists to deliver in-store advice to patients and customers on managing physical and emotional side effects of cancer and cancer treatments.\n\nFollowing the UK in-store model, in March 2019, Walgreens launched Feel More Like You™ which also positions trained beauty consultants and pharmacists to advise and support people with cancer at more than 3,000 U.S. locations.\n\n“The experience of cancer can be incredibly lonely,” said Jonathan, a cancer survivor. “Being able to talk with a Boots pharmacist who understood what I was going through and could give me advice on how to manage my physical and emotional side effects helped me feel less lonely and gave me the confidence to tackle my diagnosis head on.”\n\nLife-Changing Vitamins to More Than 200 Million Women and Children\n\nIn addition to addressing cancer, WBA has also dedicated efforts to improving healthcare in communities around the world.\n\nSix years ago, Walgreens and nonprofit Vitamin Angels teamed up to improve maternal and child health around the world. To date, the partners have provided vitamins to more than 200 million women and children around the world.\n\nThe charitable partnership works in two ways: For every customer purchase of vitamins from select suppliers, Walgreens donates one percent of sales to Vitamin Angels’ outreach efforts across the U.S. and globally. Additionally, for the past two years, Walgreens ‘Quarter Drive’ customer donation campaign in January has raised more than $3 million for the Vitamin Angels’ mission.\n\n“You cannot underestimate the impact of Walgreens partnership with Vitamin Angels,” said Dr. Nikhil Harikrishnan, MPH, Vitamin Angels program manager in Asia. “I have seen first-hand what a small intervention like a prenatal vitamin or vitamin A can do. We are literally changing lives, and that’s why the 200 million women and children impacted by our partnership is so incredible.”\n\nWaste Reduction and First-of-its-Kind Sustainable Shopping Experience \n\nThe new CSR report also details efforts across WBA businesses to reduce energy consumption, cut the amount of waste that goes to landfill and empower employees and customers to adopt environmentally friendly actions.\n\nIn July 2019, Boots UK launched its flagship Covent Garden store, a first-of-its-kind retail environment. The store features a water station where customers can refill their reusable water bottles and a refilling station for products such as shampoo. All Boots UK stores are also eliminating single-use plastic bags in favor of unbleached paper bags, a continuation of Boots journey to reduce plastic use across its business.\n\n“In building the Covent Garden store, we wanted to design the Boots retail experience of the future, one built with sustainability front of mind,” said Sebastian James, managing director of Boots UK and Republic of Ireland. “As a global business, we view sustainability holistically, from our supply chain to the in-store experience we deliver for customers. It’s all connected to our desire to operate as a responsible and best-in-class company.”\n\nThe WBA 2019 CSR Report was prepared in accordance with the GRI Standards: Core option, which are the world’s most widely used set of sustainability reporting standards.\n\nYou can read more about WBA’s Corporate Social Responsibility efforts here.\n\nAbout Walgreens Boots Alliance (WBA)\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community. WBA is included in FORTUNE’s 2020 list of the World’s Most Admired Companies. This is the 27th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release and related CSR report that are not historical, including program goals, the expected execution and effect of our Corporate Social Responsibility strategies and initiatives and the amounts and timing of their expected impact, are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, known or unknown, including those described in Item 1A (Risk Factors) of Walgreens Boots Alliance’s Form 10-K for the fiscal year that ended August 31, 2019 and in other documents that Walgreens Boots Alliance files or furnishes with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, Walgreens Boots Alliance does not undertake, and expressly disclaims, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200211005125/en/\nMedia Relations\nUSA / Pamela Morris\npamela.morris@walgreens.com\n+1 224 419 0375\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance"
    },
    {
        "title": "Walgreens Boots Alliance Appoints Richard Ashworth President of Walgreens",
        "subtitle": "",
        "date": "Feb 5, 2020 10:15AM EST",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) today announced the appointment of Richard Ashworth as President of Walgreens. Ashworth will be responsible for developing the strategies and plans for all Walgreens operations and will have full responsibility for the leadership, development and management of the business. He will report to Alex Gourlay, Co-Chief Operating Officer, Walgreens Boots Alliance.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200205005051/en/Richard Ashworth, President of Walgreens (Photo: Business Wire)\nPreviously, Ashworth served as President of Operations, Walgreens, and has held a variety of leadership positions with increasing responsibility overseeing pharmacy, health care commercial, retail and other segments during his 28-year tenure with the company. He began his career as a service clerk with Walgreens in 1992, holds a Doctor of Pharmacy degree (PharmD) as well as his master’s degree in business administration. Ashworth also serves as vice chairman on the board of directors of the National Association of Chain Drug Stores, and will assume the board’s chairmanship in April.\n\n“Richard is a strong leader who grew up with the Walgreens brand and who has a great appreciation for its storied heritage. He truly understands our customers and is passionate about the role we play in their daily lives,” said Stefano Pessina, Executive Vice Chairman and CEO, Walgreens Boots Alliance. “We are pleased to have Richard lead the Walgreens business, and lead the charge as we create the Walgreens of the future. His experience will be incredibly valuable as we continue to accelerate our ongoing transformation to best meet the needs of our customers, communities and team members.”\n\nGourlay, who has served as President of Walgreens since 2014, and Co-Chief Operating Officer, Walgreens Boots Alliance, will focus on his broader responsibilities in his role as Co-Chief Operating Officer. He is responsible for oversight of the Walgreens and Boots businesses, execution and transformation, and will continue to oversee global operations along with Co-Chief Operating Officer, Ornella Barra. Gourlay reports to Pessina.\n\nPessina continued, “I would also like to thank Alex for his leadership and dedication through a pivotal time, following the formation of Walgreens Boots Alliance, and most recently into a period of rapid change across pharmacy and retail. He will continue in a key, global role as a member of my leadership team, advancing our health and wellness strategy while working closely with Richard.”\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2019 list of the World’s Most Admired Companies, ranked first in the food and drugstore category. This is the 26th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-GEN)\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200205005051/en/\nMedia Relations\nUSA / Jim Cohn\n+1 847 315 2950\nInternational\n+44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance"
    },
    {
        "title": "Walgreens Boots Alliance Advances Transformation of its Global Information Technology Operating Model to Accelerate Digitalization, Drive Efficiencies and Savings",
        "subtitle": "",
        "date": "Feb 3, 2020 9:00AM EST",
        "content": "\nCompany Expands Strategic Partnership with Tata Consultancy Services\n    DEERFIELD, Ill. & MUMBAI, India--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) and Tata Consultancy Services (TCS) (BSE: 532540, NSE: TCS), a leading global information technology (IT) services, consulting and business solutions organization, today announced that the companies have expanded their strategic partnership to advance WBA’s transformation of its global IT function by launching a new operating model for IT Run and Operational services, enabling WBA to accelerate its digitalization program to advance innovation for customers, drive organizational efficiencies across the company and further reduce its cost base.\n\nThe expansion of the WBA and TCS strategic partnership is based on WBA’s review of its IT operating model and vendor landscape. As a result, the WBA global IT team will focus on leading and supporting strategic technology projects that create customer value through the development of new digital products and services on its business platforms. Following a period of transition, TCS will provide Run and Operational managed services, including application maintenance and support, infrastructure and security operations. The TCS approach will blend artificial intelligence, machine learning and advanced software engineering to enhance operational resilience and boost productivity.\n\n“WBA is building a scalable, sustainable and globally unified IT operating model that is focused on digital transformation, automation of service delivery and innovation,” said Francesco Tinto, senior vice president, global chief information officer, WBA. “The TCS strategic partnership will enhance our ability to rapidly address evolving business needs, support large-scale global technology solutions and promote investment in truly differentiating capabilities through a modernized platform.”\n\n“We are delighted to build on our long-standing relationship with WBA and enable its growth and transformation,” said Ashish Khurana, Head, Retail Industry Solutions, TCS. “We will leverage our contextual knowledge of WBA’s business ecosystem to harness the power of digital technologies to streamline and scale-up their IT operations, while helping accelerate transformational initiatives that enhance the customer experience.”\n\nThe new WBA global IT operating model is part of the company’s strategic priority to save to invest to grow, while managing costs efficiently under the Transformational Cost Management Program.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2020 list of the World’s Most Admired Companies. This is the 27th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n*© 2019, Fortune Media IP Limited. Used under license.\n\nAbout Tata Consultancy Services Ltd. (TCS)\n\nTata Consultancy Services is an IT services, consulting and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys for the last 50 years. TCS offers a consulting-led, cognitive powered, integrated portfolio of business, technology and engineering services and solutions. This is delivered through its unique Location Independent Agile delivery model, recognized as a benchmark of excellence in software development.\n\nA part of the Tata group, India's largest multinational business group, TCS has over 446,000 of the world’s best-trained consultants in 46 countries. The company generated consolidated revenues of US $20.9 billion in the fiscal year ended March 31, 2019 and is listed on the BSE (formerly Bombay Stock Exchange) and the NSE (National Stock Exchange) in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the Dow Jones Sustainability Index (DJSI), MSCI Global Sustainability Index and the FTSE4Good Emerging Index. For more information, visit us at www.tcs.com.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements:\n\nAll statements included in or incorporated by reference in this report that are not historical, including statements relating to Walgreens Boots Alliance’s ability to accelerate its digitalization efforts and the ability of the strategic partnership to contribute to Walgreens Boots Alliance’s transformational cost management program, are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of Walgreens Boots Alliance’s Form 10-K for the fiscal year ended August 31, 2019, regulatory filings made by TCS with applicable authorities and in other documents that Walgreens Boots Alliance or TCS files or furnishes with the Securities and Exchange Commission or other applicable authorities. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, each of Walgreens Boots Alliance and TCS does not undertake, and expressly disclaims, any duty or obligation to update publicly any forward-looking statement after the date of this report, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200203005432/en/\nWBA Contacts:\nMedia Relations\nUSA / Morry Smulevitz\n+1 847 315 0517\nInternational / Finsbury\n+44 (0)20 7251 3801\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\n\nTCS Media Contacts:\nAsia Pacific: charlene.lee@tcs.com | +65 9138 4370\nANZ: kelly.ryan@tcs.com | +61 422 989 682\nBenelux: joost.galema@tcs.com | +31 615 903387\nCanada: tia.thomas@tcs.com | +1 647 790 7602\nCentral Europe: anke.maibach@tcs.com | + 49 172 6615789\nEurope: mattias.afgeijerstam@tcs.com | +46723989188\nIndia: arushie.sinha@tcs.com | +91 22 6778 9960\nJapan: douglas.foote@tcs.com | +81 80-2115-0989\nLatin America: martin.karich@tcs.com | +569 6170 9013\nNordics: roland.bagen@tcs.com | +46 70 317 80 24\nUK: peter.devery@tcs.com | +44 20 3155 2421\nUSA: b.trounson@tcs.com | +1 646 313 4594\nSource: Walgreens Boots Alliance"
    },
    {
        "title": "Walgreens Boots Alliance Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Jan 30, 2020 12:15PM EST",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) today announced that its board of directors has declared a quarterly dividend of 45.75 cents per share, unchanged from the previous quarter and an increase of 4 percent from the year-ago quarter. The dividend is payable March 12, 2020, to stockholders of record as of February 19, 2020.\n\nWalgreens Boots Alliance and its predecessor company, Walgreen Co., have paid a dividend in 349 straight quarters (more than 87 years) and have raised the dividend for 44 consecutive years.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2020 list of the World’s Most Admired Companies. This is the 27th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-DIV)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ended August 31, 2019, and in other documents that Walgreens Boots Alliance files or furnishes with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, Walgreens Boots Alliance does not undertake, and expressly disclaims, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005681/en/\nMedia Relations\nUSA / Fiona Ortiz, +1 847 315 6402\nInternational, +44 (0) 20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer, +1 847 315 2922\nSource: Walgreens Boots Alliance"
    },
    {
        "title": "Walgreens Boots Alliance to Webcast Annual Meeting of Stockholders",
        "subtitle": "",
        "date": "Jan 23, 2020 8:30AM EST",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) will provide a live webcast of its annual meeting of stockholders beginning at 8:30 a.m. EST on Thursday, January 30, 2020. The meeting will be held at the HOTEL DU PONT, Gold Ballroom, 42 West 21th Street, Wilmington, Delaware 19801.\n\nThe meeting’s webcast will be available through the Walgreens Boots Alliance investor relations website at https://investor.walgreensbootsalliance.com. A replay of the meeting will be archived on the website for 12 months after the event.\n\nIn addition to the business meeting, Executive Chairman Jim Skinner and Executive Vice Chairman and Chief Executive Officer Stefano Pessina will make brief presentations. Management will answer questions from stockholders in attendance after the formal meeting concludes.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2019 list of the World’s Most Admired Companies, ranked first in the food and drugstore category. This is the 26th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release and related event and webcast that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ended August 31, 2019, and in other documents that Walgreens Boots Alliance files or furnishes with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, Walgreens Boots Alliance does not undertake, and expressly disclaims, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200123005175/en/\nMedia Relations\nUSA / Fiona Ortiz +1 847 315 6402\nInternational +44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer +1 847 315 2922\nSource: Walgreens Boots Alliance, Inc."
    },
    {
        "title": "Walgreens Boots Alliance to Participate in 38th Annual J.P. Morgan Healthcare Conference",
        "subtitle": "",
        "date": "Jan 13, 2020 8:14AM EST",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance Inc. (Nasdaq: WBA) today announced that Co-Chief Operating Officer Alex Gourlay and Executive Vice President and Global Chief Financial Officer James Kehoe will participate in a fireside chat at the 38th Annual J.P. Morgan Healthcare Conference, Wednesday, January 15 at 2:00 pm Pacific time (5:00 pm Eastern time).\n\nThis conference is being held at the Westin St. Francis Hotel in San Francisco. An audio portion of the discussion will be webcast live and can be accessed through the Walgreens Boots Alliance investor relations website at https://investor.walgreensbootsalliance.com/news-and-events/default.aspx#event.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2019 list of the World’s Most Admired Companies, ranked first in the food and drugstore category. This is the 26th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release and related event and webcast that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ended August 31, 2019, and in other documents that Walgreens Boots Alliance files or furnishes with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, Walgreens Boots Alliance does not undertake, and expressly disclaims, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200113005504/en/\nMedia Relations\nUSA / Morry Smulevitz\n+1 847 315 0517\nInternational\n+44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance, Inc."
    },
    {
        "title": "Walgreens Boots Alliance Reports Fiscal 2020 First Quarter Results",
        "subtitle": "",
        "date": "Jan 8, 2020 7:00AM EST",
        "content": "\nMaintains Full Year Adjusted EPS Guidance\n\nFirst quarter highlights, year-over-year\n\nFiscal 2020 outlook\n\nTransformational Cost Management Program\n\nStrategic updates announced after end of quarter\n    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) today announced financial results for the first quarter of fiscal 2020, which ended November 30, 2019.\n\nExecutive Vice Chairman and CEO Stefano Pessina said, “We are maintaining our outlook for the year despite a soft first quarter. We are confident our strategic plans are the right ones to drive long-term sustainable growth going forward. In addition, during the quarter we were very satisfied with the progress made in our Transformational Cost Management Program and with the strong cash flow we delivered.”\n\nOverview of First Quarter Results\n\nFiscal 2020 first quarter net earnings attributable to Walgreens Boots Alliance decreased 24.8 percent to $845 million compared with the same quarter a year ago, while net earnings per share1 decreased 19.8 percent to $0.95 compared with the same quarter a year ago.\n\nAdjusted net earnings attributable to Walgreens Boots Alliance2 decreased 11.8 percent to $1.2 billion, down 11.6 percent on a constant currency basis, compared with the same quarter a year ago. Adjusted earnings per share were $1.37, a decrease of 6.0 percent on a reported currency basis and a decrease of 5.7 percent on a constant currency basis, compared with the same quarter a year ago.\n\nSales in the first quarter were $34.3 billion, an increase of 1.6 percent from the year-ago quarter, and an increase of 2.3 percent on a constant currency basis.\n\nCompared to the same quarter a year ago, operating income was $1.0 billion, a decrease of 27.6 percent, and adjusted operating income was $1.5 billion, a decrease of 15.6 percent, down 15.4 percent on a constant currency basis, including more than 5 percentage points of adverse items such as year-over-year bonus changes. Operating income also reflected costs related to the acquisition of Rite Aid stores and to the implementation of the Transformational Cost Management Program.\n\nNet cash provided by operating activities was $1.1 billion in the first quarter, an increase of $601 million from the same quarter last year, and free cash flow was $674 million, an increase of $684 million from the same quarter a year earlier, reflecting working capital efficiencies as the company executed against optimization initiatives.\n\nCompany Outlook\n\nThe company maintained guidance of roughly flat growth in fiscal 2020 adjusted earnings per share at constant currency rates, with a range of plus or minus 3 percent.\n\nProgress on Strategic Priorities\n\nDuring the first quarter of fiscal 2020, and since the close of the quarter, the company made substantial progress on its four strategic priorities: accelerating digitalization; transforming and restructuring retail offering; creating neighborhood health destinations; and the Transformational Cost Management Program.\n\nSelected highlights include the following:\n\nBusiness Divisions\n\nRetail Pharmacy USA:\n\nRetail Pharmacy USA had first quarter sales of $26.1 billion, an increase of 1.6 percent over the year-ago quarter. Sales in comparable stores increased by the same percentage.\n\nPharmacy sales increased 2.9 percent compared with the year-ago quarter, reflecting higher brand inflation and prescription volume, and strong growth in central specialty. Comparable pharmacy sales increased 2.5 percent. The division filled 294.0 million prescriptions, including immunizations, adjusted to 30-day equivalents in the quarter, an increase of 1.4 percent over the year-ago quarter. Prescriptions filled in comparable stores increased 2.8 percent compared with the same quarter a year ago.\n\nThe division’s retail prescription market share on a 30-day adjusted basis in the first quarter decreased approximately 55 basis points over the year-ago quarter to 20.9 percent, which was in line with the fourth quarter of fiscal 2019, as reported by IQVIA.3 The year-over-year change includes the impact of the store optimization program.\n\nRetail sales decreased 2.2 percent in the first quarter compared with the year-ago period. Comparable retail sales were down 0.5 percent in the quarter, mostly due to continued de-emphasis of tobacco. Excluding tobacco and e-cigarettes, comparable retail sales increased around 0.8 percent, reflecting solid growth in the core health and wellness and beauty categories.\n\nGross profit decreased 5.2 percent compared with the same quarter a year ago and adjusted gross profit decreased 4.9 percent, with procurement savings and pharmacy prescription growth insufficient to offset year-on-year reimbursement pressure.\n\nFirst quarter selling, general and administrative expenses (SG&A) as a percentage of sales decreased by 0.3 percentage point compared with the year-ago quarter. Adjusted SG&A as a percentage of sales decreased by 0.6 percentage point in the same period. Both decreases reflect strong cost savings, which more than offset incremental investments, impact of inflation and higher year-on-year bonus impact.\n\nOperating income in the first quarter decreased 27.3 percent from the year-ago quarter to $848 million. Excluding costs related to the acquisition of Rite Aid stores and to the Transformational Cost Management Program, adjusted operating income in the first quarter decreased 16.2 percent from the year-ago quarter to $1.2 billion.\n\nRetail Pharmacy International:\n\nRetail Pharmacy International had first quarter sales of $2.7 billion, a decrease of 5.4 percent from the year-ago quarter, reflecting an adverse currency impact of 2.7 percent. Sales decreased 2.7 percent on a constant currency basis, mainly due to lower retail sales in Boots UK and lower sales in Chile, reflecting social unrest.\n\nComparable pharmacy sales increased 0.6 percent on a constant currency basis, primarily due to the UK, driven by higher National Health Service (NHS) reimbursement and increased sales of services, partially offset by lower prescription volume. Comparable retail sales decreased 3.0 percent on a constant currency basis, with Boots UK holding share in a declining market.\n\nGross profit decreased 6.3 percent compared with the same quarter a year ago, including an adverse currency impact of 2.6 percent. On a constant currency basis, gross profit and adjusted gross profit decreased 3.7 percent and 3.6 percent, respectively, reflecting lower retail sales and margin in Boots UK.\n\nSG&A as a percentage of sales increased 0.7 percentage point and adjusted SG&A as a percentage of sales, on a constant currency basis, increased 1.3 percentage points, both reflecting higher year-on-year bonus impact and technology investments.\n\nOperating income in the first quarter decreased 43.7 percent from the year-ago quarter to $44 million, while adjusted operating income decreased 40.5 percent to $79 million, down 39.1 percent on a constant currency basis.\n\nPharmaceutical Wholesale:\n\nPharmaceutical Wholesale had first quarter sales of $6.0 billion, an increase of 5.2 percent from the year-ago quarter, including an adverse currency impact of 3.0 percent. On a constant currency basis, comparable sales increased 8.3 percent, led by emerging markets and the UK, including a customer contract change in the UK.\n\nOperating income in the first quarter was $122 million, which included $13 million from the company’s equity earnings in AmerisourceBergen. This compared with operating income of $155 million in the year-ago quarter, which included $39 million from the company's equity earnings in AmerisourceBergen.\n\nAdjusted operating income increased 4.1 percent to $229 million, up 4.9 percent on a constant currency basis, reflecting strong revenue growth and higher contribution from AmerisourceBergen.\n\nDividends Declared\n\nDuring the first quarter, the company declared a quarterly dividend of 45.75 cents per share, unchanged from the previous quarter and an increase of 4 percent from the year-ago quarter. The dividend was payable December 12, 2019 to stockholders of record as of November 18, 2019.\n\nConference Call\n\nWalgreens Boots Alliance will hold a one-hour conference call to discuss the first quarter results beginning at 8:30 a.m. Eastern time today, January 8, 2020. The conference call will be simulcast through the Walgreens Boots Alliance investor relations website at: http://investor.walgreensbootsalliance.com. A replay of the conference call will be archived on the website for 12 months after the call.\n\nThe replay also will be available from 11:30 a.m. Eastern time, January 8, 2020 through January 15, 2020, by calling +1 800 585 8367 within the U.S. and Canada, or +1 416 621 4642 outside the U.S. and Canada, using replay code 4998459.\n\n1 All references to earnings per share (EPS) are to diluted EPS attributable to Walgreens Boots Alliance.\n\n2 Please see the “Supplemental Information (Unaudited) Regarding Non-GAAP Financial Measures” at the end of this press release for more detailed information regarding non-GAAP financial measures used, including all measures presented as \"adjusted\" or on a \"constant currency\" basis, and free cash flow.\n\n3 Due to revisions made by IQVIA to the methodology used for its retail prescription database, market share has been restated for the comparable year-ago period.\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release that are not historical including, without limitation, those regarding estimates of and goals for future tax, financial and operating performance and results (including those under “Company Outlook” and “Progress on Strategic Priorities” above), the expected execution and effect of our business strategies, our cost-savings and growth initiatives, pilot programs, strategic partnerships and initiatives, and restructuring activities and the amounts and timing of their expected impact and the delivery of annual cost savings are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Words such as “expect,” “likely,” “outlook,” “forecast,” “preliminary,” “pilot,” “would,” “could,” “should,” “can,” “will,” “project,” “intend,” “plan,” “goal,” “guidance,” “target,” “aim,” “transform,” “accelerate,” “model,” “long-term,” “continue,” “sustain,” “synergy,” “on track,” “on schedule,” “headwind,” “tailwind,” “believe,” “seek,” “estimate,” “anticipate,” “upcoming,” “to come,” “may,” “possible,” “assume,” and variations of such words and similar expressions are intended to identify such forward-looking statements. These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions, known or unknown, that could cause actual results to vary materially from those indicated or anticipated, including, but not limited to, those relating to the impact of private and public third-party payers’ efforts to reduce prescription drug reimbursements, fluctuations in foreign currency exchange rates, the timing and magnitude of the impact of branded to generic drug conversions and changes in generic drug prices, our ability to realize synergies and achieve financial, tax and operating results in the amounts and at the times anticipated, the inherent risks, challenges and uncertainties associated with forecasting financial results of large, complex organizations in rapidly evolving industries, particularly over longer time periods, our supply, commercial and framework arrangements and transactions with AmerisourceBergen and their possible effects, the risks associated with the company’s equity method investment in AmerisourceBergen, circumstances that could give rise to the termination, cross-termination or modification of any of our contractual obligations, the amount of costs, fees, expenses and charges incurred in connection with strategic transactions, whether the costs and charges associated with restructuring initiatives will exceed estimates, our ability to realize expected savings and benefits from cost-savings initiatives, restructuring activities and acquisitions and joint ventures in the amounts and at the times anticipated, the timing and amount of any impairment or other charges, the timing and severity of cough, cold and flu season, risks related to pilot programs and new business initiatives and ventures generally, including the risks that anticipated benefits may not be realized, changes in management’s plans and assumptions, the risks associated with governance and control matters, the ability to retain key personnel, changes in economic and business conditions generally or in particular markets in which we participate, changes in financial markets, credit ratings and interest rates, the risks relating to the terms, timing, and magnitude of any share repurchase activity, the risks associated with international business operations, including the risks associated with the proposed withdrawal of the United Kingdom from the European Union and international trade policies, tariffs, including tariff negotiations between the United States and China, and relations, the risks associated with cybersecurity or privacy breaches related to customer information, changes in vendor, customer and payer relationships and terms, including changes in network participation and reimbursement terms and the associated impacts on volume and operating results, risks related to competition, including changes in market dynamics, participants, product and service offerings, retail formats and competitive positioning, risks associated with new business areas and activities, risks associated with acquisitions, divestitures, joint ventures and strategic investments, including those relating to the asset acquisition from Rite Aid, the risks associated with the integration of complex businesses, regulatory restrictions and outcomes of legal and regulatory matters, and risks associated with changes in laws, including those related to the December 2017 U.S. tax law changes, regulations or interpretations thereof. These and other risks, assumptions and uncertainties are described in Item 1A (Risk Factors) of our Annual Report on Form 10-K for the fiscal year ended August 31, 2019 and in other documents that we file or furnish with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by such forward-looking statements. Accordingly, you are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they are made. Except to the extent required by law, we do not undertake, and expressly disclaim, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\n\nPlease refer to the supplemental information presented below for reconciliations of the non-GAAP financial measures used in this release to the most comparable GAAP financial measure and related disclosures.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2019 list of the World’s Most Admired Companies, ranked first in the food and drugstore category. This is the 26th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-ER)\n\nWALGREENS BOOTS ALLIANCE, INC. AND SUBSIDIARIES\nSUPPLEMENTAL INFORMATION (UNAUDITED)\nREGARDING NON-GAAP FINANCIAL MEASURES\n(in millions, except per share amounts)\n\nThe following information provides reconciliations of the supplemental non-GAAP financial measures, as defined under SEC rules, presented in this press release to the most directly comparable financial measures calculated and presented in accordance with generally accepted accounting principles in the United States (GAAP). The company has provided the non-GAAP financial measures in the press release, which are not calculated or presented in accordance with GAAP, as supplemental information and in addition to the financial measures that are calculated and presented in accordance with GAAP.\n\nThese supplemental non-GAAP financial measures are presented because management has evaluated the company’s financial results both including and excluding the adjusted items or the effects of foreign currency translation, as applicable, and believe that the supplemental non-GAAP financial measures presented provide additional perspective and insights when analyzing the core operating performance of the company’s business from period to period and trends in the company’s historical operating results. These supplemental non-GAAP financial measures should not be considered superior to, as a substitute for or as an alternative to, and should be considered in conjunction with, the GAAP financial measures presented in the press release. The company does not provide a reconciliation for non-GAAP estimates on a forward-looking basis (including the information under “Company Outlook” above) where it is unable to provide a meaningful or accurate calculation or estimation of reconciling items and the information is not available without unreasonable effort. This is due to the inherent difficulty of forecasting the timing or amount of various items that have not yet occurred, are out of the company’s control and/or cannot be reasonably predicted, and that would impact diluted net earnings per share, the most directly comparable forward-looking GAAP financial measure. For the same reasons, the company is unable to address the probable significance of the unavailable information. Forward-looking non-GAAP financial measures provided without the most directly comparable GAAP financial measures may vary materially from the corresponding GAAP financial measures.\n\nConstant currency\n\nThe company also presents certain information related to current period operating results in “constant currency,” which is a non-GAAP financial measure. These amounts are calculated by translating current period results at the foreign currency exchange rates used in the comparable period in the prior year. The company presents such constant currency financial information because it has significant operations outside of the United States reporting in currencies other than the U.S. dollar and this presentation provides a framework to assess how its business performed excluding the impact of foreign currency exchange rate fluctuations.\n\nComparable sales\n\nFor the company's Retail Pharmacy divisions, comparable stores are defined as those that have been open for at least twelve consecutive months without closure for seven or more consecutive days and without a major remodel or being subject to a natural disaster in the past twelve months. Relocated stores are not included as comparable stores for the first twelve months after the relocation. Acquired stores are not included as comparable stores for the first twelve months after acquisition or conversion, when applicable, whichever is later. Comparable store sales, comparable pharmacy sales and comparable retail sales refer to total sales, pharmacy sales and retail sales, respectively, in such stores. For the Retail Pharmacy USA division, comparable numbers of prescriptions refer to number of prescriptions in such stores. For the Pharmaceutical Wholesale division, comparable sales are defined as sales excluding acquisitions and dispositions. The method of calculating comparable sales varies across the retail industry. As a result, the company's method of calculating comparable sales may not be the same as other retailers’ methods.\n\nWith respect to the Retail Pharmacy Internal division, comparable store sales, comparable pharmacy sales and comparable retail sales, and with respect to the Pharmaceutical Wholesale division, comparable sales, are presented on a constant currency basis, which are non-GAAP financial measures. Refer to the discussion above in \"Constant currency\" for further details on constant currency calculations.\n\nNET EARNINGS AND DILUTED NET EARNINGS PER SHARE\n\nEQUITY EARNINGS IN AMERISOURCEBERGEN\n\nADJUSTED EFFECTIVE TAX RATE\n\nFREE CASH FLOW\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200108005237/en/\nMedia Relations\nU.S. / Fiona Ortiz\n+1 847 315 6402\nInternational\n+44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance, Inc."
    },
    {
        "title": "Kroger and Walgreens Form Group Purchasing Organization as Companies Expand Collaboration with New Joint Venture",
        "subtitle": "GPO aims to deliver cost savings and other efficiencies across several sourcing categories for both companies",
        "date": "Dec 11, 2019 8:00AM EST",
        "content": " CINCINNATI and DEERFIELD, Ill., Dec. 11, 2019 /PRNewswire/ -- Building on a unique collaboration that first brought together The Kroger Co.'s (NYSE: KR) food and grocery experience with Walgreens' expertise in health and beauty, the companies have formed a new group purchasing organization (GPO) aimed at delivering purchasing efficiencies, lower costs and combined resources to help drive further innovation. The new joint venture will be called Retail Procurement Alliance.  \"This collaboration is an extension of the strategic collaboration announced last year to create value for customers and shareholders of both companies,\" said Gary Millerchip, Kroger's Chief Financial Officer. \"Kroger and Walgreens share a commitment to finding value and efficiency improvements by increasing innovation and competition through sourcing. This concept brings together the best of two great organizations to reinvent critical components of our sourcing practices.\" \"Through this unique joint venture, Walgreens and Kroger have the opportunity to use our collective resources to create efficiencies across our supply chains,\" said Alex Gourlay, co-chief operating officer, Walgreens Boots Alliance. \"This collaboration will also enhance our ability to drive innovation for customers, including both of our private-label brands, to further meet their evolving needs for value and convenience.\" Kroger and Walgreens initially announced an exploratory pilot in October 2018 to develop a one-stop shopping experience, which launched in December 2018 as the Kroger Express concept in 13 Walgreens stores in Northern Kentucky. In August 2019, Walgreens and Kroger announced an expansion of the pilot at 35 Walgreens locations in Knoxville, Tennessee and introduced a curated assortment of Walgreens health and beauty products at 17 Kroger stores in the same area. For photography of the pilots, visit here.About The Kroger Co.At The Kroger Co. (NYSE: KR), we are Fresh for Everyone™ and dedicated to our Purpose: To Feed the Human Spirit®. We are, across our family of companies, nearly half a million associates who serve over 11 million customers daily through a seamless shopping experience under a variety of banner names. We are committed to creating #ZeroHungerZeroWaste communities by 2025. To learn more about us, visit our newsroom and investor relations site.About WalgreensWalgreens (walgreens.com), one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc. (Nasdaq: WBA), a global leader in retail and wholesale pharmacy. Walgreens is proud to be a neighborhood health, beauty and retail destination supporting communities across the country, and was named to FORTUNE* magazine's 2019 Companies that Change the World list. Approximately 8 million customers interact with Walgreens in stores and online each day. As of August 31, 2019, Walgreens operates 9,277 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands, along with its omnichannel business, Walgreens.com. Walgreens also provides specialty pharmacy and mail services and convenient access to in-store clinics and other health care services throughout the United States, most of which are operated by our health care strategic partners. *© 2019, Fortune Media IP Limited. Used under license.  View original content to download multimedia:http://www.prnewswire.com/news-releases/kroger-and-walgreens-form-group-purchasing-organization-as-companies-expand-collaboration-with-new-joint-venture-300972933.htmlSOURCE  The Kroger Co."
    },
    {
        "title": "Walgreens Boots Alliance Schedules Fiscal 2020 First Quarter Earnings Announcement for January 8, 2020",
        "subtitle": "",
        "date": "Dec 6, 2019 9:00AM EST",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) will release its fiscal 2020 first quarter earnings results at 7 a.m. Eastern time Wednesday, January 8, 2020 followed by a one-hour conference call with Walgreens Boots Alliance management beginning at 8:30 a.m. Eastern time.\n\nThe conference call will be simulcast through the Walgreens Boots Alliance investor relations website at: http://investor.walgreensbootsalliance.com. A replay of the conference call will be archived on the website for 12 months after the call.\n\nThe replay also will be available from 11:30 a.m. Eastern time, January 8, 2020, through January 15, 2020, by calling +1 800 585 8367 within the U.S. and Canada, or +1 416 621 4642 internationally, using replay code 4998459.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2019 list of the World’s Most Admired Companies, ranked first in the food and drugstore category. This is the 26th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release and related conference call and webcast that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ended August 31, 2019 and in other documents that we file or furnish with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, we do not undertake, and expressly disclaim, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191206005074/en/\nMedia Relations\nUSA / Fiona Ortiz\n+1 847 315 6402\nInternational\n+44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance, Inc."
    },
    {
        "title": "Buckeye Health Plan expands pharmacy partnership to increase access to members",
        "subtitle": "254 Walgreens will be added to Buckeye's Network",
        "date": "Nov 21, 2019 9:30AM EST",
        "content": "COLUMBUS, Ohio, Nov. 21, 2019 /PRNewswire/ -- Buckeye Health Plan has contracted with Walgreens to add 254 pharmacies to its statewide network effective November 21, 2019. The expansion is part of Buckeye's ongoing commitment to continually improve local access to quality healthcare and services for Medicaid members. Buckeye is Ohio's second largest Medicaid managed care plan with more than 330,000 Medicaid members statewide. The contract with Walgreens, Ohio's second largest pharmaceutical retailer, expands Buckeye's network by 10%. Buckeye is rated number one in quality by the Ohio Department of Medicaid's 2018 Managed Care Plans Report Card. \"Walgreens is a highly respected pharmacy retailer that brings our members more options and greater convenience to fill their prescriptions,\" said Buckeye President and CEO Steve Province. \"We welcome and are honored to serve Ohio Medicaid members.  Partnering with Walgreens is another way for us to provide more options and greater convenience for our members.\" \"We look forward to the opportunity to welcome Buckeye Health Plan members to any of Walgreens pharmacies in Ohio,\" said Rick Gates, senior vice president of pharmacy and healthcare, Walgreens. \"This decision supports increased patient choice and accessibility to the health services and medications they need, and reinforces Walgreens continued commitment to serving patients in Ohio, particularly the Medicaid population.\"During open enrollment in November, eligible Medicaid members can choose their managed care plan including Buckeye Health Plan by contacting the Ohio Department of Medicaid at 1-800-324-8680.About Buckeye Health Plan (www.buckeyehealthplan.com)  Buckeye Health Plan offers managed healthcare for Ohioans on Medicaid, Medicare, integrated Medicaid-Medicare (called MyCare Ohio) and the Health Insurance Exchange. Since 2004, Buckeye has been dedicated to improving the health of Ohioans, many with low incomes, by providing coordinated healthcare and other essential supports that individuals and families need to grow and thrive. Follow Buckeye on Twitter @Buckeye_Health and on Facebook at http://www.facebook.com/BuckeyeHealthPlan. Buckeye is a wholly-owned subsidiary of Centene Corporation, a leading multi-national healthcare enterprise offering core Medicaid, Medicare and specialty services.About Walgreens (www.walgreens.com)  Walgreens, one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc. (Nasdaq: WBA), a global leader in retail and wholesale pharmacy. Walgreens is proud to be a neighborhood health, beauty and retail destination supporting communities across the country, and was named to FORTUNE* magazine's 2019 Companies that Change the World list. Approximately 8 million customers interact with Walgreens in stores and online each day. As of August 31, 2019, Walgreens operates 9,277  drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands, along with its omnichannel business, Walgreens.com. Walgreens also provides specialty pharmacy and mail services and offers in-store clinics and other health care services throughout the United States, most of which are operated by our health care strategic partners.*© 2019, Fortune Media IP Limited. Used under license.  View original content:http://www.prnewswire.com/news-releases/buckeye-health-plan-expands-pharmacy-partnership-to-increase-access-to-members-300962660.htmlSOURCE  Buckeye Health Plan"
    },
    {
        "title": "Thinking about buying stock in Apple, Bristol-Myers Squibb, Cronos Group, Coca-Cola, or Walgreens Boots Alliance?",
        "subtitle": "",
        "date": "Nov 12, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 12, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AAPL, BMY, CRON, KO, and WBA.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-apple-bristol-myers-squibb-cronos-group-coca-cola-or-walgreens-boots-alliance-300956374.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "TriHealth to Operate Retail Health Clinics in Cincinnati Area Walgreens Stores",
        "subtitle": "",
        "date": "Oct 28, 2019 8:00AM EDT",
        "content": "DEERFIELD, Ill. & CINCINNATI, Oct. 28, 2019 /PRNewswire/ -- Today Walgreens and TriHealth, a comprehensive not-for-profit health system with six hospitals and 130 sites of care, announced that Walgreens will be transitioning seven of its existing company-managed Cincinnati-area Walgreens Healthcare Clinics to TriHealth.  Slated to open in the first quarter of 2020, TriHealth will own & operate and provide clinical services at these \"TriHealth at Walgreens\" clinics inside Walgreens stores. TriHealth at Walgreens will provide patients in the Cincinnati area with access to convenient and affordable health care for treating common illnesses and injuries, as well as services for chronic care follow-ups, with no appointment necessary. The clinics will be staffed by TriHealth's nurse practitioners and will operate daily, including evenings and weekends. \"Today's announcement demonstrates our ongoing commitment to collaborate with community health systems, like TriHealth, to offer convenient access to affordable healthcare services while helping to ensure a true continuum of care for our patients,\" said Dr. Chet Robson, Walgreens acting chief medical officer. \"We look forward to working with TriHealth as it shares our commitment to delivering exceptional and personalized patient care.\"TriHealth at Walgreens clinics will be located at the following Cincinnati-area Walgreens stores:\"This agreement with Walgreens is yet another example of TriHealth's strategy to meet the evolving needs of healthcare consumers and get healthcare right for our community by delivering care when, where and how consumers are seeking care,\" said Mark C. Clement, President and CEO of TriHealth. \"In collaboration with the largest network of primary care providers in the area, our priority care centers and our 130 sites of care, these retail clinics enhance our ability to provide the right care at the right place. And since these clinics are connected to a trusted health system, patients can be assured access to the appropriate level of care for their condition.\"When the new TriHealth at Walgreens clinics open, TriHealth will be one of the newest additions to the Walgreens Find Care™ platform which helps connect Walgreens mobile and online customers and patients to health care offerings and a growing selection of recognized health care providers. All Walgreens Find Care offerings are accessible through the Find Care section of the Walgreens mobile app and online at www.walgreens.com/findcare.About Walgreens Walgreens (walgreens.com), one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc. (Nasdaq: WBA) , a global leader in retail and wholesale pharmacy. Walgreens is proud to be a neighborhood health, beauty and retail destination supporting communities across the country, and was named to FORTUNE* magazine's 2019 Companies that Change the World list. Approximately 8 million customers interact with Walgreens in stores and online each day. As of August 31, 2019, Walgreens operates 9,277 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands, along with its omnichannel business, Walgreens.com. Walgreens also provides specialty pharmacy and mail services and offers in-store clinics and other health care services throughout the United States, most of which are operated by our health care strategic partners. *© 2019, Fortune Media IP Limited. Used under license.About TriHealthTriHealth is hospitals, physicians and the community working together to help people live better. We provide clinical, educational, preventive and social programs through Bethesda North, Bethesda Butler, TriHealth Evendale, Good Samaritan and McCullough-Hyde hospitals and more than 130 other locations throughout Greater Cincinnati. This includes an ambulatory network, physician practices, research division, employer-based health services, hospice care, and fitness and health facilities. Learn more at trihealth.com, Facebook.com/TriHealth, @TriHealth on Twitter, and at YouTube.com/TriHealth. View original content to download multimedia:http://www.prnewswire.com/news-releases/trihealth-to-operate-retail-health-clinics-in-cincinnati-area-walgreens-stores-300946167.htmlSOURCE  TriHealth"
    },
    {
        "title": "Walgreens Boots Alliance Reports Fiscal Year 2019 Results in Line with Guidance",
        "subtitle": "",
        "date": "Oct 28, 2019 7:00AM EDT",
        "content": "\nCompany Making Progress on Strategic Priorities to Deliver Long-Term Growth\n\nFiscal 2019 Walgreens Boots Alliance highlights, year-over-year\n\nFourth quarter highlights, year-over-year\n\nTransformational Cost Management Program\n\nFiscal 2020 guidance\n    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) today announced financial results for the fiscal year and fourth quarter that ended August 31, 2019.\n\nExecutive Vice Chairman and CEO Stefano Pessina said, “We are pleased to report fiscal 2019 results in line with our previously stated guidance despite a challenging operating environment. We are also making progress on our four strategic priorities, which we remain confident are positioning us to deliver long-term growth. While we still face headwinds, I am encouraged by the improvement in U.S. comparable sales performance in the second half of fiscal 2019 and our progress in managing costs in order to save to invest to grow. We are introducing guidance for fiscal 2020 adjusted earnings per share, which we expect will be roughly consistent with fiscal 2019 at constant currency rates - very much in line with our expectations.”\n\nOverview of Fiscal Year Results\n\nFiscal 2019 net earnings attributable to Walgreens Boots Alliance decreased 20.7 percent to $4.0 billion, while net earnings per share1 decreased 14.6 percent to $4.31, compared with the prior year.\n\nAdjusted net earnings attributable to Walgreens Boots Alliance2 in fiscal 2019 decreased 7.6 percent to $5.5 billion, down 6.7 percent on a constant currency basis, compared with the prior year. Adjusted earnings per share decreased 0.5 percent to $5.99, up 0.5 percent on a constant currency basis, compared with the prior year.\n\nSales increased 4.1 percent to $136.9 billion in fiscal 2019 compared with the prior year. On a constant currency basis, sales increased 5.8 percent.\n\nOperating income in fiscal 2019 was $5.0 billion, a decrease of 20.5 percent from the prior year. Adjusted operating income was $6.9 billion, a decrease of 9.6 percent, and a decrease of 8.6 percent on a constant currency basis.\n\nNet cash provided by operating activities was $5.6 billion in fiscal 2019, a decrease of $2.7 billion from fiscal 2018. Free cash flow was $3.9 billion, a decrease of $3.0 billion from fiscal 2018. These decreases primarily reflect cash flows relating to the integration of Rite Aid stores, non-recurring cash tax benefits in fiscal 2018, and transition tax payments, legal settlements and cash charges relating to the implementation of the Transformational Cost Management Program in fiscal 2019.\n\nOverview of Fourth Quarter Results\n\nFiscal 2019 fourth quarter net earnings attributable to Walgreens Boots Alliance decreased 55.2 percent to $677 million compared with the same quarter a year ago, while net earnings per share1 decreased 51.4 percent to $0.75 compared with the same quarter a year ago. These results reflect higher charges as the company accelerated its Transformational Cost Management Program.\n\nAdjusted net earnings attributable to Walgreens Boots Alliance2 decreased 11.3 percent to $1.3 billion, down 10.6 percent on a constant currency basis, compared with the same quarter a year ago. Adjusted earnings per share were $1.43, down 3.7 percent on a reported currency basis and down 2.9 percent on a constant currency basis, compared with the same quarter a year ago.\n\nSales in the fourth quarter were $34.0 billion, an increase of 1.5 percent from the year-ago quarter, and an increase of 2.6 percent on a constant currency basis.\n\nOperating income was $878 million, a decrease of 37.0 percent from the same quarter a year ago. Adjusted operating income was $1.6 billion, a decrease of 11.9 percent from the same quarter a year ago, and a decrease of 11.1 percent on a constant currency basis.\n\nNet cash provided by operating activities was $2.4 billion in the fourth quarter, a decrease of $439 million from the same quarter a year ago. Free cash flow was $1.9 billion, a decrease of $510 million versus the same quarter last year.\n\nCompany Outlook\n\nThe company today introduced guidance of roughly flat growth in fiscal 2020 adjusted earnings per share at constant currency rates, with a range of plus or minus 3 percent. Excluding the impact of lower fiscal 2019 bonus payout, this expected performance represents a year-over-year increase in the mid-single digits.\n\nProgress on Strategic Priorities\n\nDuring fiscal 2019, the company made progress on its four strategic priorities: accelerating digitalization; transforming and restructuring retail offering; creating neighborhood health destinations; and the Transformational Cost Management Program.\n\nSelected highlights include the following:\n\nThe Transformational Cost Management Program is on track and today the company announced it is increasing targeted annual savings from the program from in excess of $1.5 billion to in excess of $1.8 billion, by fiscal 2022.\n\nBusiness Divisions\n\nRetail Pharmacy USA:\n\nRetail Pharmacy USA had fourth quarter sales of $26.0 billion, an increase of 2.1 percent over the year-ago quarter. Excluding the impact of store optimization following the acquisition of Rite Aid stores, organic sales growth was 2.9 percent in the quarter. Sales in comparable stores increased 3.4 percent compared with the same quarter a year ago.\n\nPharmacy sales, which accounted for 75.1 percent of the division’s sales in the quarter, increased 4.2 percent compared with the year-ago quarter, primarily due to higher brand inflation and prescription volume, and strong growth in central specialty. Comparable pharmacy sales increased 5.4 percent. The division filled 283 million prescriptions (including immunizations) adjusted to 30-day equivalents in the quarter, an increase of 1.2 percent over the year-ago quarter. Prescriptions filled in comparable stores adjusted to 30-day equivalents increased 3.3 percent compared with the same quarter a year ago.\n\nRetail prescription market share on a 30-day adjusted basis in the fourth quarter decreased approximately 55 basis points over the year-ago quarter to 21.0 percent, as reported by IQVIA3. This decrease is primarily due to store optimization. Retail prescription market share in fiscal 2019 expanded by 35 basis points to 21.3 percent, the division's highest ever annual share, compared with 20.9 percent in fiscal 2018.\n\nRetail sales decreased 3.9 percent in the fourth quarter compared with the year-ago period, including the impact of store optimization following the acquisition of Rite Aid stores. Comparable retail sales decreased 1.2 percent in the quarter, entirely due to continued de-emphasis of tobacco.\n\nGross profit decreased 3.9 percent compared with the same quarter a year ago and includes a decrease of 2.4 percentage points related to LIFO and a decrease in adjusted gross profit. Adjusted gross profit decreased 1.1 percent, reflecting a decrease in retail, partially offset by pharmacy.\n\nFourth quarter selling, general and administrative expenses (SG&A) as a percentage of sales improved 0.1 percentage point compared with the year-ago quarter due to lower legal and regulatory accruals and settlements, partially offset by costs incurred under the Transformational Cost Management Program. Adjusted SG&A as a percentage of sales remained unchanged compared to the same quarter a year ago. The fourth quarter of 2019 was impacted by a one-time benefit of $69 million in the prior year associated with a previously disclosed adjustment related to certain legal and regulatory accruals and settlements. The quarter also included $53 million of costs related to previously announced labor, store and digital investments.\n\nOperating income in the fourth quarter decreased 30.3 percent from the year-ago quarter to $700 million, reflecting lower gross margin, and includes a 16.1 percent impact from charges incurred under the Transformational Cost Management Program. Adjusted operating income in the fourth quarter decreased 12.2 percent from the year-ago quarter to $1.1 billion. Adjusted operating income includes an adverse impact of 5.3 percentage points from the prior year legal and regulatory accruals and settlements adjustment mentioned above, as well as 4.1 percentage points from the store, labor and digital investments.\n\nRetail Pharmacy International:\n\nRetail Pharmacy International had fourth quarter sales of $2.7 billion, a decrease of 6.3 percent from the year-ago quarter, primarily reflecting an adverse currency impact of 4.5 percent. Sales decreased 1.8 percent on a constant currency basis, mainly due to a 2.1 percent decline in Boots UK.\n\nComparable pharmacy sales decreased 1.0 percent on a constant currency basis, primarily due to lower volume and lower National Health System (NHS) funding levels in the UK. Comparable retail sales decreased 2.7 percent on a constant currency basis, with Boots UK maintaining share in a retail market that remains challenging.\n\nGross profit decreased 9.9 percent compared with the same quarter a year ago, and on a constant currency basis, adjusted gross profit decreased 5.4 percent, in each case, mainly due to lower retail sales and margin in Boots UK, and to lower pharmacy margin.\n\nSG&A as a percentage of sales increased by 4.5 percentage points. Adjusted SG&A as a percentage of sales, on a constant currency basis, increased by 0.2 percentage point.\n\nOperating income in the fourth quarter decreased 78.7 percent from the year-ago quarter to $49 million, while adjusted operating income decreased 23.8 percent to $194 million, down 20.7 percent on a constant currency basis.\n\nPharmaceutical Wholesale:\n\nPharmaceutical Wholesale had fourth quarter sales of $5.7 billion, an increase of 3.1 percent from the year-ago quarter. On a constant currency basis, comparable sales increased 7.9 percent, led by emerging markets and the UK.\n\nOperating income in the fourth quarter was $129 million, which included a gain of $59 million from the company’s equity earnings in AmerisourceBergen, compared with operating income of $163 million in the year-ago quarter, which included a gain of $49 million from the company’s equity earnings in AmerisourceBergen. Adjusted operating income increased 3.7 percent to $229 million, up 6.9 percent on a constant currency basis.\n\nDividends Declared\n\nDuring the fourth quarter, the company declared a quarterly dividend of 45.75 cents per share, an increase of 4 percent. The dividend was payable September 12, 2019 to stockholders of record as of August 20, 2019 and raised the annual rate from $1.76 per share to $1.83 per share. This marked the 44th consecutive year that Walgreens Boots Alliance and its predecessor company, Walgreen Co., have raised the dividend.\n\nConference Call\n\nWalgreens Boots Alliance will hold a one-hour conference call to discuss the fourth quarter results beginning at 8:30 a.m. Eastern time today, October 28, 2019. The conference call will be simulcast through the Walgreens Boots Alliance investor relations website at: http://investor.walgreensbootsalliance.com. A replay of the conference call will be archived on the website for 12 months after the call.\n\nThe replay also will be available from 11:30 a.m. Eastern time, October 28, 2019 through November 4, 2019 by calling +1 855 859 2056 within the U.S. and Canada, or +1 404 537 3406 outside the U.S. and Canada, using replay code 9494436.\n\n1 All references to earnings per share (EPS) are to diluted EPS attributable to Walgreens Boots Alliance.\n\n2 Please see the “Supplemental Information (Unaudited) Regarding Non-GAAP Financial Measures” at the end of this press release for more detailed information regarding non-GAAP financial measures used, including all measures presented as “adjusted” or on a “constant currency” basis, and organic sales and free cash flow.\n\n3 Due to revisions made by IQVIA to the methodology used for its retail prescription database, market share has been restated for the comparable year-ago period.\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release that are not historical including, without limitation, those regarding estimates of and goals for future tax, financial and operating performance and results (including those under “Company Outlook” and “Progress on Strategic Priorities” above), the expected execution and effect of our business strategies, our cost-savings and growth initiatives, pilot programs, strategic partnerships and initiatives, and restructuring activities and the amounts and timing of their expected impact and the delivery of annual cost savings are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Words such as “expect,” “likely,” “outlook,” “forecast,” “preliminary,” “pilot,” “would,” “could,” “should,” “can,” “will,” “project,” “intend,” “plan,” “goal,” “guidance,” “target,” “aim,” “transform,” “accelerate,” “model,” “long-term,” “continue,” “sustain,” “synergy,” “on track,” “on schedule,” “headwind,” “tailwind,” “believe,” “seek,” “estimate,” “anticipate,” “upcoming,” “to come,” “may,” “possible,” “assume,” and variations of such words and similar expressions are intended to identify such forward-looking statements. These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions, known or unknown, that could cause actual results to vary materially from those indicated or anticipated, including, but not limited to, those relating to the impact of private and public third-party payers’ efforts to reduce prescription drug reimbursements, fluctuations in foreign currency exchange rates, the timing and magnitude of the impact of branded to generic drug conversions and changes in generic drug prices, our ability to realize synergies and achieve financial, tax and operating results in the amounts and at the times anticipated, the inherent risks, challenges and uncertainties associated with forecasting financial results of large, complex organizations in rapidly evolving industries, particularly over longer time periods, our supply, commercial and framework arrangements and transactions with AmerisourceBergen and their possible effects, the risks associated with the company’s equity method investment in AmerisourceBergen, circumstances that could give rise to the termination, cross-termination or modification of any of our contractual obligations, the amount of costs, fees, expenses and charges incurred in connection with strategic transactions, whether the costs and charges associated with restructuring initiatives will exceed estimates, our ability to realize expected savings and benefits from cost-savings initiatives, restructuring activities and acquisitions and joint ventures in the amounts and at the times anticipated, the timing and amount of any impairment or other charges, the timing and severity of cough, cold and flu season, risks related to pilot programs and new business initiatives and ventures generally, including the risks that anticipated benefits may not be realized, changes in management’s plans and assumptions, the risks associated with governance and control matters, the ability to retain key personnel, changes in economic and business conditions generally or in particular markets in which we participate, changes in financial markets, credit ratings and interest rates, the risks relating to the terms, timing, and magnitude of any share repurchase activity, the risks associated with international business operations, including the risks associated with the proposed withdrawal of the United Kingdom from the European Union and international trade policies, tariffs, including tariff negotiations between the United States and China, and relations, the risks associated with cybersecurity or privacy breaches related to customer information, changes in vendor, customer and payer relationships and terms, including changes in network participation and reimbursement terms and the associated impacts on volume and operating results, risks related to competition, including changes in market dynamics, participants, product and service offerings, retail formats and competitive positioning, risks associated with new business areas and activities, risks associated with acquisitions, divestitures, joint ventures and strategic investments, including those relating to the asset acquisition from Rite Aid, the risks associated with the integration of complex businesses, regulatory restrictions and outcomes of legal and regulatory matters, and risks associated with changes in laws, including those related to the December 2017 U.S. tax law changes, regulations or interpretations thereof. These and other risks, assumptions and uncertainties are described in Item 1A (Risk Factors) of our Annual Report on Form 10-K for the fiscal year ended August 31, 2018, the Quarterly Report on Form 10-Q for the quarter ended February 28, 2019 and in other documents that we file or furnish with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by such forward-looking statements. Accordingly, you are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they are made. Except to the extent required by law, we do not undertake, and expressly disclaim, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\n\nPlease refer to the supplemental information presented below for reconciliations of the non-GAAP financial measures used in this release to the most comparable GAAP financial measure and related disclosures.\n\nCertain amounts in the tables in the appendix to this press release may not add due to rounding. All percentages have been calculated using unrounded amounts for the three and twelve months ended August 31, 2019.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is a global leader in retail and wholesale pharmacy, touching millions of lives every day through dispensing and distributing medicines, its convenient retail locations, digital platforms and health and beauty products. The company has more than 100 years of trusted health care heritage and innovation in community pharmacy and pharmaceutical wholesaling.\n\nIncluding equity method investments, WBA has a presence in more than 25 countries, employs more than 440,000 people and has more than 18,750 stores.\n\nWBA’s purpose is to help people across the world lead healthier and happier lives. The company is proud of its contributions to healthy communities, a healthy planet, an inclusive workplace and a sustainable marketplace. The company’s businesses have been recognized for their Corporate Social Responsibility. Walgreens was named to FORTUNE* magazine’s 2019 Companies that Change the World list and Boots UK was recognized as Responsible Business of the Year 2019-2020 by Business in the Community.\n\nWBA is included in FORTUNE’s 2019 list of the World’s Most Admired Companies, ranked first in the food and drugstore category. This is the 26th consecutive year that WBA or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n*© 2019, Fortune Media IP Limited. Used under license.\n\n(WBA-ER)\n\n \n\n \n\nWALGREENS BOOTS ALLIANCE, INC. AND SUBSIDIARIES\nSUPPLEMENTAL INFORMATION (UNAUDITED)\nREGARDING NON-GAAP FINANCIAL MEASURES\n(in millions, except per share amounts)\n\nThe following information provides reconciliations of the supplemental non-GAAP financial measures, as defined under SEC rules, presented in this press release to the most directly comparable financial measures calculated and presented in accordance with generally accepted accounting principles in the United States (GAAP). The company has provided the non-GAAP financial measures in the press release, which are not calculated or presented in accordance with GAAP, as supplemental information and in addition to the financial measures that are calculated and presented in accordance with GAAP.\n\nThese supplemental non-GAAP financial measures are presented because management has evaluated the company’s financial results both including and excluding the adjusted items or the effects of foreign currency translation, as applicable, and believe that the supplemental non-GAAP financial measures presented provide additional perspective and insights when analyzing the core operating performance of the company’s business from period to period and trends in the company’s historical operating results. These supplemental non-GAAP financial measures should not be considered superior to, as a substitute for or as an alternative to, and should be considered in conjunction with, the GAAP financial measures presented in the press release. The company does not provide a reconciliation for non-GAAP estimates on a forward-looking basis (including the information under “Company Outlook” above) where it is unable to provide a meaningful or accurate calculation or estimation of reconciling items and the information is not available without unreasonable effort. This is due to the inherent difficulty of forecasting the timing or amount of various items that have not yet occurred, are out of the company’s control and/or cannot be reasonably predicted, and that would impact diluted net earnings per share, the most directly comparable forward-looking GAAP financial measure. For the same reasons, the company is unable to address the probable significance of the unavailable information. Forward-looking non-GAAP financial measures provided without the most directly comparable GAAP financial measures may vary materially from the corresponding GAAP financial measures.\n\nConstant currency\n\nThe company also presents certain information related to current period operating results in “constant currency,” which is a non-GAAP financial measure. These amounts are calculated by translating current period results at the foreign currency exchange rates used in the comparable period in the prior year. The company presents such constant currency financial information because it has significant operations outside of the United States reporting in currencies other than the U.S. dollar and this presentation provides a framework to assess how its business performed excluding the impact of foreign currency exchange rate fluctuations.\n\nComparable sales\n\nFor our Retail Pharmacy divisions, comparable stores are defined as those that have been open for at least twelve consecutive months without closure for seven or more consecutive days and without a major remodel or being subject to a natural disaster in the past twelve months. Relocated stores are not included as comparable stores for the first twelve months after the relocation. Acquired stores are not included as comparable stores for the first twelve months after acquisition or conversion, when applicable, whichever is later. Comparable store sales, comparable pharmacy sales and comparable retail sales refer to total sales, pharmacy sales and retail sales, respectively, in such stores. For our Pharmaceutical Wholesale division, comparable sales are defined as sales excluding acquisitions and dispositions. The method of calculating comparable sales varies across the retail industry. As a result, our method of calculating comparable sales may not be the same as other retailers’ methods.\n\nComparable sales are presented on a constant currency basis for the Retail Pharmacy and Pharmaceutical Wholesale divisions. In the fourth quarter of fiscal 2019 compared to the year-ago quarter, the Retail Pharmacy International division’s comparable store sales on a reported currency basis decreased 6.5 percent, comparable pharmacy sales on a reported currency basis decreased 5.7 percent and comparable retail sales on a reported currency basis decreased 7.1 percent. The Pharmaceutical Wholesale division’s comparable sales excluding acquisitions and dispositions on a reported currency basis increased 3.1 percent.\n\nOrganic sales\n\nOrganic sales is a non-GAAP financial measure defined as sales excluding certain sales relating to non-comparable acquisitions, divestitures and joint ventures that have been consummated in the past twelve months. Retail Pharmacy USA’s fourth quarter sales were $26.0 billion, an increase of 2.1 percent over the year-ago quarter. Non-comparable acquisitions, divestitures and joint ventures had a negative impact of 0.8 percentage point, or $139 million.\n\nNET EARNINGS AND DILUTED NET EARNINGS PER SHARE\n\nReconciliation of Non-GAAP Measures by Division\n\nReconciliation of Non-GAAP Measures by Division\n\nReconciliation of Non-GAAP Measures by Division\n\nReconciliation of Non-GAAP Measures by Division\n\nEQUITY EARNINGS IN AMERISOURCEBERGEN\n\nADJUSTED EFFECTIVE TAX RATE\n\nFREE CASH FLOW\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191028005267/en/\nMedia Relations\nU.S. / Fiona Ortiz\n+1 847 315 6402\nInternational\n+44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer\n+1 847 315 2922\nSource: Walgreens Boots Alliance, Inc."
    },
    {
        "title": "Walgreens Boots Alliance Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Oct 23, 2019 1:26PM EDT",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) today announced that its board of directors has declared a quarterly dividend of 45.75 cents per share, unchanged from the previous quarter and an increase of 4 percent from the year-ago quarter. The dividend is payable December 12, 2019, to stockholders of record as of November 18, 2019.\n\nWalgreens Boots Alliance and its predecessor company, Walgreen Co., have paid a dividend in 348 straight quarters (more than 87 years) and have raised the dividend for 44 consecutive years.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is the first global pharmacy-led, health and wellbeing enterprise. The company's heritage of trusted health care services through community pharmacy care and pharmaceutical wholesaling dates back more than 100 years.\n\nWalgreens Boots Alliance is the largest retail pharmacy, health and daily living destination across the U.S. and Europe. Walgreens Boots Alliance and the companies in which it has equity method investments together have a presence in more than 25 countries and employ more than 415,000 people. The company is a global leader in pharmacy-led, health and wellbeing retail and, together with its equity method investments, has more than 18,500 stores in 11 countries as well as one of the largest global pharmaceutical wholesale and distribution networks, with more than 390 distribution centers delivering to more than 230,000 pharmacies, doctors, health centers and hospitals each year in more than 20 countries. In addition, Walgreens Boots Alliance is one of the world’s largest purchasers of prescription drugs and many other health and wellbeing products.\n\nThe company’s portfolio of retail and business brands includes Walgreens, Duane Reade, Boots and Alliance Healthcare, as well as increasingly global health and beauty product brands, such as No7, Soap & Glory, Liz Earle, Sleek MakeUP and Botanics.\n\nWalgreens Boots Alliance is proud to be a force for good, leveraging many decades of experience and its international scale, to care for people and the planet through numerous social responsibility and sustainability initiatives that have an impact on the health and wellbeing of millions of people.\n\nWalgreens Boots Alliance is included in Fortune magazine’s 2019 list of the World’s Most Admired Companies and ranked first in the food and drugstore category. This is the 26th consecutive year that Walgreens Boots Alliance or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at www.walgreensbootsalliance.com.\n\n(WBA-DIV)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ended August 31, 2018 and Form 10-Q for the fiscal quarter ended February 28, 2019, and in other documents that Walgreens Boots Alliance files or furnishes with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, Walgreens Boots Alliance does not undertake, and expressly disclaims, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191023005691/en/\nMedia Relations\nUSA / Fiona Ortiz +1 847 315 6402\nInternational +44 (0) 20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer +1 847 315 2922\nSource: Walgreens Boots Alliance, Inc."
    },
    {
        "title": "Centene, Walgreens and RxAdvance Announce Partnership to Provide Innovative Pharmacy Management Model",
        "subtitle": "",
        "date": "Oct 17, 2019 7:00AM EDT",
        "content": "ST. LOUIS and DEERFIELD, Ill., Oct. 17, 2019 /PRNewswire/ -- Centene Corporation (NYSE: CNC), Walgreens and RxAdvance today announced a strategic partnership to introduce an innovative model for pharmacy management that aims to increase transparency, enhance customer experience and ultimately result in better health outcomes at lower costs. The partnership builds upon an existing Centene and Walgreens relationship, leveraging Walgreens trusted retail pharmacy expertise and Centene's national leadership in providing comprehensive health care services to the underserved, while also utilizing RxAdvance's innovative pharmacy benefit management model powered by its Collaborative PBM Cloud platform.There is a growing need for new approaches to pharmacy benefit management, particularly to serve the Medicaid population. This partnership addresses the need for leading companies to collaborate on a better model, and one which provides higher quality care and lower pricing for drugs.\"Centene is committed to supporting a transparent pharmacy benefit management model that is sustainable with higher quality care for members at a lower cost to our customers,\" said Michael F. Neidorff, chairman, president and CEO, Centene. \"This new approach to pharmacy management will improve the transparency and quality of care, while reducing unnecessary medical costs for millions of people.\"Using RxAdvance's Collaborative PBM Cloud™ transactional platform and clinical intelligence, the companies will work together to improve overall patient care across the continuum of health care and to offer such a model to other large payers.\"Collaboration between retail pharmacies and payers like Centene can further transform the way we provide care,\" said Stefano Pessina, executive vice chairman and CEO, Walgreens Boots Alliance, Inc. \"Using RxAdvance's Collaborative PBM Cloud, our partnership can empower our pharmacists to make critical decisions at the point of sale to help improve adherence and also to reduce avoidable medical costs.\"The parties have identified initial markets to deploy the partnership model and are working with community leaders on new pharmacy models.Further exemplifying this commitment, Walgreens has made a small investment in RxAdvance, and Centene has increased its stake in RxAdvance, following its initial investment announced in March 2018.\"I am excited that today we have partners across the care continuum – Centene and Walgreens – who are committed to the power of RxAdvance's collaborative PBM model, and to completely reimagine what is possible in this industry,\" said Ravi Ika, founder and CEO, RxAdvance. \"By pushing the limits of innovative technology and existing transaction standards, there is a clear path forward to reduce administrative costs, avoidable medical costs, and to improve overall quality of care.\"About Centene CorporationCentene Corporation, a Fortune 100 company, is a diversified, multi-national healthcare enterprise that provides a portfolio of services to government sponsored and commercial healthcare programs, focusing on under-insured and uninsured individuals. Many receive benefits provided under Medicaid, including the State Children's Health Insurance Program (CHIP), as well as Aged, Blind or Disabled (ABD), Foster Care and Long-Term Services and Supports (LTSS), in addition to other state-sponsored programs, Medicare (including the Medicare prescription drug benefit commonly known as \"Part D\"), dual eligible programs and programs with the U.S. Department of Defense. Centene also provides healthcare services to groups and individuals delivered through commercial health plans. Centene operates local health plans and offers a range of health insurance solutions. It also contracts with other healthcare and commercial organizations to provide specialty services including behavioral health management, care management software, correctional healthcare services, dental benefits management, commercial programs, home-based primary care services, life and health management, vision benefits management, pharmacy benefits management, specialty pharmacy and telehealth services.Centene uses its investor relations website to publish important information about the Company, including information that may be deemed material to investors. Financial and other information about Centene is routinely posted and is accessible on Centene's investor relations website, http://www.centene.com/investors. About WalgreensWalgreens (walgreens.com), one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc. (NASDAQ: WBA), the first global pharmacy-led, health and wellbeing enterprise. Approximately 8 million customers interact with Walgreens in stores and online each day, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. As of Aug. 31, 2018, Walgreens operates 9,560 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands, along with its omni-channel business, Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.About RxAdvanceRxAdvance is an innovative national full-service pharmacy benefit manager (PBM) that leverages their Collaborative PBM Cloud™ platform to deliver integrated services that reduce overall pharmacy costs and avoidable drug-impacted medical costs while optimizing specialty spend. In addition, standing shoulder-to-shoulder with plan sponsors, RxAdvance offers a global pharmacy risk partnership model. Our tailored, world-class services are for all plan sponsors — health plans, accountable care organizations (ACOs), exchanges, state Medicaid programs, and employer groups. We provide contractually guaranteed savings in administrative costs, ingredient unit costs, and rebate revenues. For more information, visit www.rxadvance.com.Forward-Looking StatementsAll statements in this release that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Without limiting the foregoing, forward-looking statements often use words such as \"believe,\" \"anticipate,\" \"plan,\" \"expect,\" \"estimate,\" \"intend,\" \"seek,\" \"target,\" \"goal,\" \"may,\" \"will,\" \"would,\" \"could,\" \"should,\" \"can,\" \"continue\" and other similar words or expressions (and the negative thereof). In particular, these statements include, without limitation, statements about our future operating or financial performance, market opportunity, growth strategy, competition and investments. These forward-looking statements reflect current views with respect to future events and are based on numerous assumptions and assessments made in light of current experience and perception of historical trends, current conditions, business strategies, operating environments, future developments and other factors believed to be appropriate. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in: \"Risk Factors\" appearing in the registration statement on Form S-4 filed by Centene Corporation with the Securities Exchange Commission on May 23, 2019; Item 1A (Risk Factors) of the Walgreens Boots Alliance, Inc. Form 10-K for the fiscal year ended August 31, 2018; and in other documents that Centene Corporation, Walgreens Boots Alliance and RxAdvance may file or furnish with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results from this collaborative effort may vary materially. These forward-looking statements speak only as of the date they are made and are based only on information available on the date hereof. Except to the extent required by law, Centene Corporation, Walgreens Boots Alliance, Walgreens and RxAdvance do not undertake, and expressly disclaim, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise. You should not place undue reliance on any forward-looking statements, as actual results may differ materially.  View original content:http://www.prnewswire.com/news-releases/centene-walgreens-and-rxadvance-announce-partnership-to-provide-innovative-pharmacy-management-model-300940240.htmlSOURCE  Centene Corporation"
    },
    {
        "title": "Walgreens And Postmates Meet Customers' Needs With On-Demand Delivery In New York City",
        "subtitle": "Companies to expand delivery of hundreds of health and wellness, beauty and grocery products to Manhattan and Brooklyn",
        "date": "Oct 2, 2019 7:00AM EDT",
        "content": "SAN FRANCISCO and DEERFIELD, Ill., Oct. 2, 2019 /PRNewswire/ -- Walgreens and Postmates announced today their collaboration designed to provide quick, convenient, on-demand delivery for customers looking for over-the-counter medications, health and wellness, beauty and grocery products. Postmates will deliver hundreds of Walgreens' most popular items from 174 Walgreens and Duane Reade locations in Manhattan and Brooklyn. \"In the last year, orders from convenience and drugstores have increased by 68%. By collaborating with Walgreens, we are able to provide our customers with even more convenience when it comes to everyday items that they need now,\" said Craig Whitmer, VP, Merchant Business Development, Postmates. Bringing together the scale of Walgreens with the on-demand delivery service of Postmates will allow both businesses to better meet the needs of their customers. Postmates found that its customers are seeking many of the everyday items found at Walgreens. For example, the top items New Yorkers order are Smart Water, Gatorade, San Pellegrino, Tylenol and Pedialyte. Further, during last flu season, from August 2018 to January 2019, Postmates saw a 173% increase in orders for cough relief items, a 111% increase in sinus relief aids and a 50% spike in soup orders.\"We share Postmates' commitment to providing customers with convenient, differentiated shopping experiences, and together we can help ensure our customers are getting what they need, when they need it,\" said Joe Hartsig, Chief Merchandising Officer, Walgreens. \"Particularly as we head into the peak season for flu, being able to bring our customers convenience items as well as cough and cold relief directly to their home can take the stress out of being sick.\" This news comes as the latest addition to Postmates roster of leading restaurants and retailers while continuing to solidify them as a leader in offering the most choice in on-demand delivery— including more than 500,000 restaurants, grocery and convenience stores, as well as traditional retailers. The company now operates in more than 3,500 cities and has added some of the most sought-after local and national restaurants, serving 75 of the top 100 restaurants in the US.To order items from participating Walgreens stores, visit Postmates.com or download Postmates on iOS or Android. Customers can pay zero delivery fees when they subscribe to Postmates membership service, Postmates Unlimited, for $9.99 per month.To get more information about being a merchant on the Postmates platform, please visit https://postmates.com/partner. About PostmatesPostmates enables you to get anything you want on-demand. Launched in 2011, Postmates led the creation of on-demand delivery in the U.S and has grown to be the #1 platform in Los Angeles, amongst other markets and has the most merchant selection in the country, including hundreds of exclusive LA merchants such as Sugarfish, Salt + Straw, Trejos Tacos and The Coffee Bean and Tea Leaf. The company now operates in more than 3,500 cities across the U.S. and Mexico, provides access to over 500,000 merchants and has recently launched innovative new products including Postmates Party. Postmates is headquartered in San Francisco and has more than 1,000 employees. Learn more:www.postmates.com.About WalgreensWalgreens (walgreens.com), one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc. (NASDAQ: WBA), the first global pharmacy-led, health and wellbeing enterprise. Approximately 8 million customers interact with Walgreens in stores and online each day, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. As of August 31, 2018, Walgreens operates 9,560 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands, along with its omnichannel business, Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.  View original content to download multimedia:http://www.prnewswire.com/news-releases/walgreens-and-postmates-meet-customers-needs-with-on-demand-delivery-in-new-york-city-300929397.htmlSOURCE  Postmates"
    },
    {
        "title": "Walgreens and Novant Health announce retail health care collaboration in North Carolina",
        "subtitle": "Novant Health to operate retail health clinics located in Walgreens stores in North Carolina; Walgreens to acquire nine Novant Health retail pharmacies",
        "date": "Oct 1, 2019 1:15PM EDT",
        "content": " DEERFIELD, Ill. and WINSTON-SALEM, N.C., Oct. 1, 2019 /PRNewswire/ -- Today, Walgreens and Novant Health, a leading health care provider with 15 medical centers and more than 640 locations offering advanced medical treatments in North Carolina, South Carolina and Virginia, announced a retail health clinical collaboration and services agreement, as well as a retail pharmacy-focused transaction. Walgreens will acquire nine of Novant Health's retail pharmacies, while Novant Health will open new retail health care clinics at Walgreens stores in the Winston-Salem, Charlotte and Brunswick County, North Carolina, areas.\"Our customers have come to rely on their local Walgreens to provide accessible and convenient health care options,\" said Dr. Chet Robson, Walgreens acting chief medical officer. \"Our collaboration with Novant Health is a great example of how we're integrating care and bringing a simplified health care experience to North Carolina residents.\"Once the pharmacy acquisition closes, Novant Health patients will be able to receive their prescriptions at the acquired Walgreens pharmacy locations or any neighborhood Walgreens stores. Novant Health will continue to operate specialty pharmacies.\"Novant Health is dedicated to making health care remarkable and this strategic partnership with Walgreens will allow us to make it even more convenient, affordable and accessible,\" said Dr. Pam Oliver, executive vice president and president of Novant Health Physician Network. \"Our new clinics at Walgreens will allow patients to avoid the emergency room by expanding access to quality care for minor illnesses and injuries, and create a new avenue for Novant Health to support and care for our patients with chronic conditions.\"The retail clinics, which will be branded \"Novant Health Express at Walgreens\" and staffed with Novant Health advanced practice clinicians (physician assistants and nurse practitioners), will provide patients in North Carolina with access to convenient and affordable health care for treating common illnesses and injuries, as well as services for chronic care follow-ups, with no appointment necessary. The first locations are expected to open in the first half of 2020, with continued expansion in North Carolina over two years. The first three locations are expected to be on Fairview Road in Charlotte, N.C., on Stratford Road in Winston-Salem, N.C., and on Village Road in Leland, N.C.The Novant Health Express at Walgreens retail clinics will operate seven days a week.About Novant HealthNovant Health is an integrated network of physician clinics, outpatient facilities and hospitals that delivers a seamless and convenient healthcare experience to communities in Virginia, North and South Carolina, and Georgia. The Novant Health network consists of more than 1,600 physicians and over 28,000 employees that provide care at over 640 locations, including 15 hospitals and hundreds of outpatient facilities and physician clinics. In 2019, Forbes ranked the organization first in North Carolina and 38th nationally on its 2019 Best Employers for Diversity list. Diversity MBA Magazine has also ranked Novant Health third on its 2019 list of \"Best Places for Women & Diverse Managers to Work.\" Novant Health provided more than $883 million in community benefit, including financial assistance and services, in 2018. For more information, please visit our website at NovantHealth.org. You can also follow us on Twitter and Facebook.About WalgreensWalgreens (walgreens.com), one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc. (NASDAQ: WBA), the first global pharmacy-led, health and wellbeing enterprise. Approximately 8 million customers interact with Walgreens in stores and online each day, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. As of August 31, 2018, Walgreens operates 9,560 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands, along with its omnichannel business, Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.  View original content to download multimedia:http://www.prnewswire.com/news-releases/walgreens-and-novant-health-announce-retail-health-care-collaboration-in-north-carolina-300928939.htmlSOURCE  Novant Health"
    },
    {
        "title": "Walgreens Boots Alliance Schedules Fourth Quarter and Fiscal 2019 Earnings Announcement for October 28, 2019",
        "subtitle": "",
        "date": "Sep 19, 2019 4:15PM EDT",
        "content": "    DEERFIELD, Ill.--(BUSINESS WIRE)--\nWalgreens Boots Alliance, Inc. (Nasdaq: WBA) will release its fourth quarter and fiscal 2019 earnings results at 7 a.m. Eastern time Monday, October 28, 2019 followed by a one-hour conference call with Walgreens Boots Alliance management beginning at 8:30 a.m. Eastern time.\n\nThe conference call will be simulcast through the Walgreens Boots Alliance investor relations website at: http://investor.walgreensbootsalliance.com. A replay of the conference call will be archived on the website for 12 months after the call.\n\nThe replay also will be available from 11:30 a.m. Eastern time, October 28, 2019, through November 4, 2019, by calling +1 800 585 8367 within the U.S. and Canada, or +1 416 621 4642 internationally, using replay code 9494436.\n\nNotes to Editors:\n\nAbout Walgreens Boots Alliance\n\nWalgreens Boots Alliance (Nasdaq: WBA) is the first global pharmacy-led, health and wellbeing enterprise. The company's heritage of trusted health care services through community pharmacy care and pharmaceutical wholesaling dates back more than 100 years.\n\nWalgreens Boots Alliance is the largest retail pharmacy, health and daily living destination across the U.S. and Europe. Walgreens Boots Alliance and the companies in which it has equity method investments together have a presence in more than 25 countries and employ more than 415,000 people. The company is a global leader in pharmacy-led, health and wellbeing retail and, together with its equity method investments, has more than 18,500 stores in 11 countries as well as one of the largest global pharmaceutical wholesale and distribution networks, with more than 390 distribution centers delivering to more than 230,000 pharmacies, doctors, health centers and hospitals each year in more than 20 countries. In addition, Walgreens Boots Alliance is one of the world’s largest purchasers of prescription drugs and many other health and wellbeing products.\n\nThe company’s portfolio of retail and business brands includes Walgreens, Duane Reade, Boots and Alliance Healthcare, as well as increasingly global health and beauty product brands, such as No7, Soap & Glory, Liz Earle, Sleek MakeUP and Botanics.\n\nWalgreens Boots Alliance is proud to be a force for good, leveraging many decades of experience and its international scale, to care for people and the planet through numerous social responsibility and sustainability initiatives that have an impact on the health and wellbeing of millions of people.\n\nWalgreens Boots Alliance is included in Fortune magazine’s 2019 list of the World’s Most Admired Companies and ranked first in the food and drugstore category. This is the 26th consecutive year that Walgreens Boots Alliance or its predecessor company, Walgreen Co., has been named to the list.\n\nMore company information is available at http://www.walgreensbootsalliance.com.\n\n(WBA-GEN)\n\nCautionary Note Regarding Forward-Looking Statements: All statements in this release and related conference call and webcast that are not historical are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including those described in Item 1A (Risk Factors) of our Form 10-K for the fiscal year ending August 31, 2018, Item 1A (Risk Factors) of our Form 10-Q for the fiscal quarter ended February 28, 2019 and in other documents that we file or furnish with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially. These forward-looking statements speak only as of the date they are made. Except to the extent required by law, we do not undertake, and expressly disclaim, any duty or obligation to update publicly any forward-looking statement after the date of this release, whether as a result of new information, future events, changes in assumptions or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190919005677/en/\nMedia Relations\nUSA / Fiona Ortiz +1 847 315 6402\nInternational +44 (0)20 7980 8585\n\nInvestor Relations\nGerald Gradwell and Jay Spitzer +1 847 315 2922\nSource: Walgreens Boots Alliance"
    },
    {
        "title": "Thinking about trading options or stock in Docusign, JPMorgan Chase, Microsoft, Square, or Walgreens Boots Alliance?",
        "subtitle": "",
        "date": "Sep 10, 2019 9:31AM EDT",
        "content": "NEW YORK, Sept. 10, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for DOCU, JPM, MSFT, SQ, and WBA.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-docusign-jpmorgan-chase-microsoft-square-or-walgreens-boots-alliance-300915098.htmlSOURCE  InvestorsObserver"
    }
]