[
    {
        "title": "Wells Fargo Selects Workday to Help Transform HR",
        "subtitle": "",
        "date": "Feb 28, 2020 8:30AM EST",
        "content": "PLEASANTON, Calif., Feb.  28, 2020  (GLOBE NEWSWIRE) -- Workday, Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, today announced that Wells Fargo & Company (NYSE: WFC) has chosen Workday Human Capital Management to help elevate the user experience and increase HR efficiencies across the organization for its approximately 260,000 global employees. In addition, Wells Fargo’s delivery roadmap includes Adaptive Insights Business Planning Cloud, Workday Payroll, Workday Prism Analytics, Workday Recruiting, and Workday Time Tracking to help the company plan, execute, and analyze across the enterprise all in one system powered by machine learning.Headquartered in San Francisco, Wells Fargo provides banking, investment, and mortgage products and services, as well as consumer and commercial finance.With Workday, Wells Fargo will aim to: Comments on the News“We are on a multi-year journey to transform the HR experience at Wells Fargo, and adopting industry-leading technology through our partnership with Workday is key to that transformation,” said David Galloreese, head of human resources, Wells Fargo. “By investing in best-in-class tools, we’re working to deliver a best-in-class experience for our people.”“We continue to see financial services leaders select Workday to help advance their HR functions globally with one system to plan for, execute on, and analyze people-related initiatives,” said Chano Fernandez, co-president, Workday. “Wells Fargo joins several other Fortune 50 financial services organizations that are leveraging Workday’s innovative HR technology to better engage their workforce and inform people decisions that help meet customers’ financial needs.”About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.Forward-Looking Statements This press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday’s offerings. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “seek,” “plan,” “project,” and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in our filings with the Securities and Exchange Commission (SEC), including our Form 10-Q for the fiscal quarter ended October 31, 2019 and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's discretion and may not be delivered as planned or at all. Customers who purchase Workday, Inc. services should make their purchase decisions based upon services, features, and functions that are currently available.© 2020. Workday, Inc. All rights reserved. Workday, Adaptive Insights, and the Workday logo are trademarks or registered trademarks of Workday, Inc. registered in the United States and elsewhere. All other brand and product names are trademarks or registered trademarks of their respective holders.Investor Relations Contact:Justin Furby+1 (925) 379-6000justin.furby@workday.comMedia Contact:Nina Oestlien+1 (415) 828-3034nina.oestlien@workday.com"
    },
    {
        "title": "Workday Announces Fourth Quarter and Full Year Fiscal 2020 Financial Results",
        "subtitle": "",
        "date": "Feb 27, 2020 4:01PM EST",
        "content": "Fourth Quarter Total Revenues of $976.3 Million, Up 23.8% Year Over Year Subscription Revenue of $839.7 Million, Up 24.7% Year Over Year Subscription Revenue Backlog of $8.29 Billion, Up 23.0% Year Over YearFull Year Fiscal 2020 Total Revenues of $3.63 Billion, Up 28.5% Year Over YearSubscription Revenue of $3.10 Billion, Up 29.8% Year Over YearOperating Cash Flows of $864.6 Million, Up 42.5% Year Over YearPLEASANTON, Calif., Feb.  27, 2020  (GLOBE NEWSWIRE) --  Workday, Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, today announced results for the fourth quarter and full fiscal year ended January 31, 2020.Fourth Quarter Fiscal 2020 ResultsFull Year Fiscal 2020 ResultsComments on the News “We ended the fiscal year with significant momentum, including a record quarter for our financial management applications, great progress with our analytics and planning applications, and an excellent initial quarter with Scout RFP. Our industry leading HCM solutions also continue to see strong adoption with 45 percent of the Fortune 500 and 60 percent of the Fortune 50 having selected Workday,” said Aneel Bhusri, co-founder and CEO, Workday. “We believe our relentless focus on creating great experiences for our employees and customers drives our success and leads so many of the world’s leading organizations to trust their business with Workday.”“Our fourth quarter capped a strong year driven by solid execution across the company,” said Robynne Sisco, co-president and chief financial officer, Workday. “We enter the year with considerable momentum, and we see significant opportunity ahead to support both our near- and long-term growth ambitions. We are raising our fiscal 2021 subscription revenue outlook to a range of $3.755 billion to $3.770 billion. We expect first quarter subscription revenue to be $873.0 million to $875.0 million.”Recent HighlightsEarnings Call DetailsWorkday plans to host a conference call today to review its fourth quarter and full year fiscal 2020 financial results and to discuss its financial outlook. The call is scheduled to begin at 1:30 p.m. PT/ 4:30 p.m. ET and can be accessed via webcast. The webcast will be available live, and a replay will be available following completion of the live broadcast for approximately 90 days.Workday uses the Workday Blog as a means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD.1 Non-GAAP operating income excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, and amortization expense for acquisition-related intangible assets. See the section titled “About Non-GAAP Financial Measures” in the accompanying financial tables for further details.2 Non-GAAP net income per share excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, amortization expense for acquisition-related intangible assets, non-cash interest expense related to our convertible senior notes, and income tax effects. See the section titled “About Non-GAAP Financial Measures” in the accompanying financial tables for further details.Required DisclaimersGartner Peer Insights Customers’ Choice constitute the subjective opinions of individual end-user reviews, ratings, and data applied against a documented methodology; they neither represent the views of, nor constitute an endorsement by, Gartner or its affiliates.About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world's largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.Use of Non-GAAP Financial MeasuresReconciliations of non-GAAP financial measures to Workday's financial results as determined in accordance with GAAP are included at the end of this press release following the accompanying financial data. For a description of these non-GAAP financial measures, including the reasons management uses each measure, please see the section of the tables titled “About Non-GAAP Financial Measures.” A reconciliation of our forward outlook for non-GAAP operating margin with our forward-looking GAAP operating margin is not available without unreasonable efforts as the quantification of share-based compensation expense, which is excluded from our non-GAAP operating margin, requires additional inputs such as the number of shares granted and market prices that are not ascertainable.Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding Workday’s first quarter and full year fiscal 2021 subscription revenue outlook, as well as Workday’s opportunities and growth. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “seek,” “plans,” “project,” “looking ahead,” “look to,” “move into,” and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to: (i) risks related to our ability to successfully integrate Scout RFP’s operations or failure to achieve the expected benefits of this or any other acquisition; (ii) our ability to implement our plans, objectives, and other expectations with respect to the Scout RFP business or that of any other acquired company; (iii) breaches in our security measures, unauthorized access to our customers' or other users’ personal data, or disruptions in our data center or computing infrastructure operations; (iv) service outages, delays in the deployment of our applications, and the failure of our applications to perform properly; (v) our ability to manage our growth effectively; (vi) competitive factors, including pricing pressures, industry consolidation, entry of new competitors and new applications, advancements in technology, and marketing initiatives by our competitors; (vii) the development of the market for enterprise cloud applications and services; (viii) acceptance of our applications and services by customers and individuals, including any new features, enhancements, and modifications, as well as the acceptance of any underlying technology such as machine learning, artificial intelligence, and blockchain; (ix) adverse changes in general economic or market conditions; (x) the regulatory, economic, and political risks associated with our domestic and international operations; (xi) the regulatory risks related to new and evolving technologies such as machine learning, artificial intelligence, and blockchain; (xii) delays or reductions in information technology spending; and (xiii) changes in sales, which may not be immediately reflected in our results due to our subscription model. Further information on these and additional risks that could affect Workday's results is included in our filings with the Securities and Exchange Commission (“SEC”), including our Form 10-Q for the quarter ended October 31, 2019, and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's discretion and may not be delivered as planned or at all. Customers who purchase Workday services should make their purchase decisions based upon services, features, and functions that are currently available.© 2020 Workday, Inc. All rights reserved. Workday, Adaptive Insights, Scout, and the Workday Logo are trademarks or registered trademarks of Workday, Inc. registered in the United States and elsewhere. All other brand and product names are trademarks or registered trademarks of their respective holders.Workday, Inc.Condensed Consolidated Balance Sheets(in thousands)(unaudited)Workday, Inc.Condensed Consolidated Statements of Operations(in thousands, except per share data)(unaudited)Workday, Inc.Condensed Consolidated Statements of Cash Flows(in thousands)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataThree Months Ended January 31, 2020 (in thousands, except percentages and per share data)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataThree Months Ended January 31, 2019 (in thousands, except percentages and per share data)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataYear Ended January 31, 2020 (in thousands, except percentages and per share data)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataYear Ended January 31, 2019 (in thousands, except percentages and per share data)(unaudited)About Non-GAAP Financial MeasuresTo provide investors and others with additional information regarding Workday’s results, we have disclosed the following non-GAAP financial measures: non-GAAP operating income (loss) and non-GAAP net income (loss) per share. Workday has provided a reconciliation of each non-GAAP financial measure used in this earnings release to the most directly comparable GAAP financial measure. Non-GAAP operating income (loss) differs from GAAP in that it excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, and amortization expense for acquisition-related intangible assets. Non-GAAP net income (loss) per share differs from GAAP in that it excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, amortization expense for acquisition-related intangible assets, non-cash interest expense related to our convertible senior notes, and income tax effects.Workday’s management uses these non-GAAP financial measures to understand and compare operating results across accounting periods, for internal budgeting and forecasting purposes, for short- and long-term operating plans, and to evaluate Workday’s financial performance. Management believes these non-GAAP financial measures reflect Workday’s ongoing business in a manner that allows for meaningful period-to-period comparisons and analysis of trends in Workday’s business. Management also believes that these non-GAAP financial measures provide useful information to investors and others in understanding and evaluating Workday’s operating results and prospects in the same manner as management and in comparing financial results across accounting periods and to those of peer companies.Management believes excluding the following items from the GAAP Condensed Consolidated Statements of Operations is useful to investors and others in assessing Workday’s operating performance due to the following factors:The use of non-GAAP operating income (loss) and non-GAAP net income (loss) per share measures have certain limitations as they do not reflect all items of income and expense that affect Workday’s operations. Workday compensates for these limitations by reconciling the non-GAAP financial measures to the most comparable GAAP financial measures. These non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from, measures prepared in accordance with GAAP. Further, these non-GAAP measures may differ from the non-GAAP information used by other companies, including peer companies, and therefore comparability may be limited. Management encourages investors and others to review Workday’s financial information in its entirety and not rely on a single financial measure.Investor Relations Contact:Justin Furby+1 (925) 379-6000Justin.Furby@Workday.com Media Contact:Nina Oestlien+1 (415) 828-3034Nina.Oestlien@Workday.com "
    },
    {
        "title": "Workday Announces Date of Fiscal 2020 Fourth Quarter and Full Year Financial Results",
        "subtitle": "",
        "date": "Feb 6, 2020 8:30AM EST",
        "content": "PLEASANTON, Calif., Feb.  06, 2020  (GLOBE NEWSWIRE) -- Workday, Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, plans to announce its fiscal 2020 fourth quarter and full year financial results after market close on Thursday, Feb. 27, 2020. The company will host a conference call at 1:30 p.m. Pacific Time / 4:30 p.m. Eastern Time to review its financial results and business outlook.A live webcast of the event will be available on the Workday Investor Relations site. The replay of the webcast will be available for a minimum of 90 days after the conference call.About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.© 2020. Workday, Inc. All rights reserved. Workday and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Investor Relations Contact: Justin Furby +1 (925) 379-6000 Justin.Furby@Workday.com  Media Contact: Nina Oestlien+1 (415) 828-3034Nina.Oestlien@Workday.com"
    },
    {
        "title": "Adaptive Insights, a Workday Company, is Recognized as a November 2019 Gartner Peer Insights Customers’ Choice for Cloud Financial Planning and Analysis Solutions",
        "subtitle": "",
        "date": "Jan 21, 2020 9:00AM EST",
        "content": "PALO ALTO, Calif., Jan.  21, 2020  (GLOBE NEWSWIRE) -- Adaptive Insights, a Workday company (NASDAQ: WDAY), has been named a November 2019 Gartner Peer Insights Customers’ Choice for Cloud Financial Planning and Analysis Solutions. Gartner defines Cloud Financial Planning and Analysis (FP&A) solutions as those that “support the office of finance's budgeting, planning, and forecasting efforts. Many also supplement the office's budgeting and planning process support with modeling, collaboration analytics, and performance-reporting capabilities, all of which enhance finance’s ability to manage performance by linking corporate strategy and execution.”In addition to being recognized by its customers, Adaptive Insights has also received the highest score for product or service for Upper Midsize Organizations in the 2019 Gartner Critical Capabilities for Cloud Financial Planning and Analysis Solutions report. The report provides insight into providers’ product and service offerings based on key capabilities. Adaptive Insights was also positioned as a Leader for the third time in the 2019 Gartner Magic Quadrant for Cloud Financial Planning and Analysis Solutions.“Modern planning drives real-time business insights, so that companies can successfully plan for what’s next,” said Sean Cox, vice president of customer success, Adaptive Insights. “We believe our recognition in Gartner Peer Insights and Gartner Critical Capabilities, as well as our position as a Leader in the 2019 Gartner Magic Quadrant for Cloud FP&A Solutions, is a direct result of more than 4,500 customers using our business planning platform for informed, faster decision making. In an era where agility is a competitive differentiator, our customers can be one step ahead to course-correct and maximize business opportunities.”The November 2019 Gartner Peer Insights Customers’ Choice distinction is based on feedback and ratings from end-user professionals who have experience purchasing, implementing, and/or using the product or service. Adaptive Insights received the same distinction in the same category in April 2019.Adaptive Insights believes that its distinction is based on excellent customer satisfaction, high-performance modeling capabilities, and ease of use experience. Customers rated Adaptive Insights with a 4.6 out of 5 for the Financial Planning and Analysis Solutions market based on 216 ratings (source: Gartner Peer Insights, as of January 13, 2020).Reviews from customers across multiple industries and organization sizes can be found on Gartner Peer Insights including:For more information about Adaptive Insights and Workday:About Peer Insights Peer Insights is an online platform of ratings and reviews of IT software and services that are written and read by IT professionals and technology decision-makers. The goal is to help IT leaders make more insightful purchase decisions and help technology providers improve their products by receiving objective, unbiased feedback from their customers. Gartner Peer Insights includes more than 215,000 verified reviews in more than 340 markets. For more information, please visit www.gartner.com/reviews/home.Sources: Gartner, Magic Quadrant for Cloud Financial Planning and Analysis Solutions, Robert Anderson, John Van Decker, Greg Leiter, 8 August 2019. Gartner Peer Insights 'Voice of the Customer': Cloud Financial Planning and Analysis Solutions, Peer Contributors, December 2019.DisclaimersGartner Peer Insights Customers’ Choice constitute the subjective opinions of individual end-user reviews, ratings, and data applied against a documented methodology; they neither represent the views of, nor constitute an endorsement by, Gartner or its affiliates.Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact. Gartner disclaims all warranties, express or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.About Adaptive InsightsAdaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com.© 2020 Workday, Inc. All rights reserved. Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Vanessa McNultyAdaptive Insights, a Workday companyvmcnulty@adaptiveinsights.com650-314-7993"
    },
    {
        "title": "Thinking about trading options or stock in Electronic Arts, Tesla, UnitedHealth Group, Vertex Pharmaceuticals, or Workday?",
        "subtitle": "",
        "date": "Jan 9, 2020 9:31AM EST",
        "content": "NEW YORK, Jan. 9, 2020 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for EA, TSLA, UNH, VRTX, and WDAY.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)   View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-electronic-arts-tesla-unitedhealth-group-vertex-pharmaceuticals-or-workday-300984334.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Workday Completes Acquisition of Scout RFP",
        "subtitle": "",
        "date": "Dec 9, 2019 4:01PM EST",
        "content": "Leading Strategic Sourcing and Supplier Engagement Platform to Operate as Scout RFP, a Workday CompanyCombination to Help Transform Office of Procurement and Accelerate Workday’s Investment in the Spend Management Market PLEASANTON, Calif., Dec.  09, 2019  (GLOBE NEWSWIRE) -- Workday, Inc. (NASDAQ:WDAY), a leader in enterprise cloud applications for finance and human resources, has completed its acquisition of Scout RFP, a leading cloud-based platform for strategic sourcing and supplier engagement. With Scout RFP now part of Workday, customers will be able to expand how they plan, execute, analyze, and extend in one system, with a modern source-to-pay solution that helps better optimize spend. The company will operate as Scout RFP, a Workday company. Comments on the News“With Scout RFP now part of Workday, we will equip procurement teams with a modern source-to-pay solution to help optimize spend with greater efficiency, engagement, and transparency,” said Aneel Bhusri, co-founder and CEO, Workday. “I’m thrilled to welcome this talented team to Workday. By bringing together our joint focus on employees, customers, and innovation, we will be able to set the new standard for spend management.”“We founded Scout RFP with the idea to rethink strategic sourcing and help businesses create even more impact with their procurement processes. Five years later, we have nearly 300,000 global Scout RFP users and a growing team of innovators,” said Alex Yakubovich, CEO, Scout RFP. “As part of Workday, we’ll be able to pioneer simpler, smarter, and streamlined procurement solutions – at a greater scale – all while unifying our two great company cultures.” “The office of procurement is undergoing significant transformation, and the combination of Scout RFP and Workday will provide organizations with a robust source-to-pay solution to help support this transition,” said Mickey North Rizza, program vice president, Enterprise Applications & Digital Commerce, IDC. “As the back office navigates new complexities, it’s essential they have modern solutions that help enable them to better optimize spend and engage with key stakeholders in order to drive business growth and remain competitive.” About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.About Scout RFPScout RFP, a Workday company, is the sourcing and supplier engagement platform trusted by procurement teams to streamline their processes, manage a unified pipeline of projects, and collaborate with stakeholders and suppliers to achieve greater business impact. More than 240 global brands trust Scout RFP’s automated sourcing and auction platform to deliver greater impact through seamless business engagement. Managing over $38.5 billion in project spend, Scout RFP’s powerful platform helps make enterprise commerce faster and more transparent, reduces risk, and drives profitability. Forward-Looking StatementsThis press release contains forward-looking statements related to Workday, Scout RFP, and the acquisition of Scout RFP by Workday (the “Transaction”) that are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Forward-looking statements in this communication include, among other things, statements about the potential benefits and effects of the Transaction, Workday’s plans, objectives, expectations and intentions, and the financial condition, results of operations and business of Workday. Risks include, but are not limited to: (i) risks related to our ability to successfully integrate Scout RFP’s operations or failure to achieve the expected benefits of the Transaction; (ii) Workday’s ability to implement its plans, objectives and other expectations with respect to Scout RFP’s business and its ability to accelerate its growth in the procurement software market; (iii) negative effects of the announcement or the consummation of the Transaction on Workday’s business operations, operating results or share price; (iv) significant transaction costs; (v) unknown liabilities; (vi) breaches in our security measures, unauthorized access to our customers’ data or disruptions in our data center operations; (vii) our ability to manage our growth effectively; (viii) competitive factors, including pricing pressures, industry consolidation, entry of new competitors and new applications, advancements in technology, and marketing initiatives by our competitors; (ix) the development of the market for enterprise cloud applications and services; (x) acceptance of our applications and services by customers, including any underlying technology such as machine learning, artificial intelligence, and blockchain; (xi) adverse changes in general economic or market conditions; (xii) the regulatory, economic, and political risks associated with our domestic and international operations; (xiii) the regulatory risks related to new and evolving technologies such as machine learning, artificial intelligence, and blockchain; (xiv) delays or reductions in information technology spending; (xv) changes in sales, which may not be immediately reflected in our results due to our subscription model; and (xvi) additional risks included in our filings with the Securities and Exchange Commission (“SEC”), including our Form 10-Q for the fiscal quarter ended October 31, 2019 and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday’s discretion and may not be delivered as planned or at all. Customers who purchase Workday services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019. Workday, Inc. All rights reserved. Workday and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Investor Relations Contact:Justin Furby, Workday +1 (925) 379-6000Justin.Furby@Workday.comMedia Contact:Nina Oestlien, Workday +1 (415) 828-3034Nina.Oestlien@Workday.com"
    },
    {
        "title": "Workday Announces Fiscal 2020 Third Quarter Financial Results",
        "subtitle": "",
        "date": "Dec 3, 2019 4:01PM EST",
        "content": "Third Quarter Total Revenues of $938.1 million, Up 26.2% Year Over YearSubscription Revenue of $798.5 million, Up 27.9% Year Over YearSubscription Revenue Backlog of $7.19 billion, Up 21.8% Year Over YearPLEASANTON, Calif., Dec.  03, 2019  (GLOBE NEWSWIRE) -- Workday, Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, today announced results for the fiscal 2020 third quarter ended October 31, 2019.Fiscal 2020 Third Quarter ResultsComments on the News“Companies of all sizes and industries continue to select Workday, and we’re thrilled that as of the end of Q3, we have more than 3,000 customers and 42 million users,” said Aneel Bhusri, co-founder and CEO, Workday. “As our community grows, so do our applications. We recently announced plans to deepen our offering for the office of finance with the intended acquisition of Scout RFP. We also unveiled several ways our customers can leverage leading machine learning capabilities that are powering our applications – helping them to make more informed decisions as they navigate this changing world of work.”“We executed well in the third quarter and delivered strong results, with subscription revenue growth of 28% and non-GAAP operating margin of 15%,” said Robynne Sisco, co-president and chief financial officer, Workday. “We are well positioned as we enter our seasonally strongest quarter, and we are raising our fiscal 2020 subscription revenue outlook to $3.085 billion to $3.087 billion. We expect fourth-quarter subscription revenue of $828.0 million to $830.0 million. Our focus remains on driving durable growth, while also progressing towards our longer-term margin goals.”Recent HighlightsEarnings Call DetailsWorkday plans to host a conference call today to review its fiscal 2020 third quarter financial results and to discuss its financial outlook. The call is scheduled to begin at 1:30 p.m. PT / 4:30 p.m. ET and can be accessed via webcast. The webcast will be available live, and a replay will be available following completion of the live broadcast for approximately 90 days.Workday uses the Workday Blog as a means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD.1 Non-GAAP operating income excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, and amortization expense for acquisition-related intangible assets. See the section titled “About Non-GAAP Financial Measures” in the accompanying financial tables for further details.2 Non-GAAP net income per share excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, amortization expense for acquisition-related intangible assets, non-cash interest expense related to our convertible senior notes, and income tax effects. See the section titled “About Non-GAAP Financial Measures” in the accompanying financial tables for further details.3 Gartner, “Magic Quadrant for Cloud Financial Planning and Analysis Solutions,” by Robert Anderson, John Van Decker, and Greg Leiter, August 8, 2019.4 Gartner, “Magic Quadrant for Cloud HCM Suites for 1,000+ Employee Enterprises,” by Melanie Lougee, Ranadip Chandra, Jason Cerrato, Chris Pang, Ron Hanscome, Jeff Freyermuth, Sam Grinter, and Helen Poitevin, September 23, 2019.Required Disclaimers Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact. Gartner disclaims all warranties, express or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.Use of Non-GAAP Financial MeasuresReconciliations of non-GAAP financial measures to Workday's financial results as determined in accordance with GAAP are included at the end of this press release following the accompanying financial data. For a description of these non-GAAP financial measures, including the reasons management uses each measure, please see the section of the tables titled “About Non-GAAP Financial Measures.” A reconciliation of our forward outlook for non-GAAP operating margin with our forward-looking GAAP operating margin is not available without unreasonable efforts as the quantification of share-based compensation expense, which is excluded from our non-GAAP operating margin, requires additional inputs such as the number of shares granted and market prices that are not ascertainable.Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding Workday’s proposed acquisition of Scout RFP (the “Transaction”); our fiscal year and fourth quarter subscription revenue outlook; and our ability to drive durable growth while meeting long-term margin goals. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “seek,” “plans,” “project,” “looking ahead,” “look to,” “move into,” and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to: (i) the risk that the Transaction may not be completed in a timely manner or at all; (ii) risks related to our ability to successfully integrate Scout RFP’s operations or failure to achieve the expected benefits of the Transaction or any other acquisition; (iii) our ability to implement our plans, objectives, and other expectations with respect to the Scout RFP business or that of any other acquired company; (iv) breaches in our security measures, unauthorized access to our customers' or personal data, or disruptions in our data center operations; (v) our ability to manage our growth effectively; (vi) competitive factors, including pricing pressures, industry consolidation, entry of new competitors and new applications, advancements in technology, and marketing initiatives by our competitors; (vii) the development of the market for enterprise cloud applications and services; (viii) acceptance of our applications and services by customers and individuals, including any underlying technology such as machine learning, artificial intelligence, and blockchain; (ix) adverse changes in general economic or market conditions; (x) the regulatory, economic, and political risks associated with our domestic and international operations; (xi) the regulatory risks related to new and evolving technologies such as machine learning, artificial intelligence, and blockchain; (xii) delays or reductions in information technology spending; and (xiii) changes in sales, which may not be immediately reflected in our results due to our subscription model. Further information on these and additional risks that could affect Workday's results is included in our filings with the Securities and Exchange Commission (“SEC”), including our Form 10-Q for the quarter ended July 31, 2019, and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's discretion and may not be delivered as planned or at all. Customers who purchase Workday services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019. Workday, Inc. All rights reserved. Workday, WayTo, Adaptive Insights, and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Workday, Inc.Condensed Consolidated Balance Sheets(in thousands)(unaudited)Workday, Inc.Condensed Consolidated Statements of Operations(in thousands, except per share data)(unaudited)Workday, Inc.Condensed Consolidated Statements of Cash Flows(in thousands)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataThree Months Ended October 31, 2019(in thousands, except percentages and per share data)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataThree Months Ended October 31, 2018(in thousands, except percentages and per share data)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataNine Months Ended October 31, 2019(in thousands, except percentages and per share data)(unaudited)Workday, Inc.Reconciliation of GAAP to Non-GAAP DataNine Months Ended October 31, 2018(in thousands, except percentages and per share data)(unaudited)About Non-GAAP Financial MeasuresTo provide investors and others with additional information regarding Workday’s results, we have disclosed the following non-GAAP financial measures: non-GAAP operating income (loss) and non-GAAP net income (loss) per share. Workday has provided a reconciliation of each non-GAAP financial measure used in this earnings release to the most directly comparable GAAP financial measure. Non-GAAP operating income (loss) differs from GAAP in that it excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, and amortization of acquisition-related intangible assets. Non-GAAP net income (loss) per share differs from GAAP in that it excludes share-based compensation expenses, employer payroll tax-related items on employee stock transactions, amortization of acquisition-related intangible assets, non-cash interest expense related to our convertible senior notes, and income tax effects.Workday’s management uses these non-GAAP financial measures to understand and compare operating results across accounting periods, for internal budgeting and forecasting purposes, for short- and long-term operating plans, and to evaluate Workday’s financial performance. Management believes these non-GAAP financial measures reflect Workday’s ongoing business in a manner that allows for meaningful period-to-period comparisons and analysis of trends in Workday’s business as they exclude expenses that are not reflective of ongoing operating results. Management also believes that these non-GAAP financial measures provide useful information to investors and others in understanding and evaluating Workday’s operating results and prospects in the same manner as management and in comparing financial results across accounting periods and to those of peer companies.Management believes excluding the following items from the GAAP Condensed Consolidated Statements of Operations is useful to investors and others in assessing Workday’s operating performance due to the following factors:The use of non-GAAP operating income (loss) and non-GAAP net income (loss) per share measures have certain limitations as they do not reflect all items of income and expense that affect Workday’s operations. Workday compensates for these limitations by reconciling the non-GAAP financial measures to the most comparable GAAP financial measures. These non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from, measures prepared in accordance with GAAP. Further, these non-GAAP measures may differ from the non-GAAP information used by other companies, including peer companies, and therefore comparability may be limited. Management encourages investors and others to review Workday’s financial information in its entirety and not rely on a single financial measure.Investor Relations Contact:Michael Magaro+1 (925) 379-6000Michael.Magaro@Workday.comMedia Contact:Nina Oestlien+1 (415) 828-3034Nina.Oestlien@Workday.com"
    },
    {
        "title": "Workday Announces Intent to Acquire Scout RFP",
        "subtitle": "",
        "date": "Nov 4, 2019 4:01PM EST",
        "content": "Combination Will Provide Customers with a Leading Cloud Solution to Help Transform the Office of Procurement Accelerates Investment and Momentum in the Spend Management Market Workday Announces Date of Fiscal 2020 Third Quarter Financial ResultsPLEASANTON, Calif., Nov.  04, 2019  (GLOBE NEWSWIRE) -- Workday, Inc. (NASDAQ:WDAY), a leader in enterprise cloud applications for finance and human resources, and Scout RFP, a leading cloud-based platform for strategic sourcing and supplier engagement, have signed a definitive agreement under which Workday will acquire Scout RFP in an all cash transaction.Comments on the News“Scout RFP is an industry leader that is loved by procurement teams who are undergoing a significant shift to better optimize spend,” said Aneel Bhusri, co-founder and CEO, Workday. “Together, we will deliver a modern source-to-pay solution that accelerates our momentum in the spend management market and expands how customers can plan, execute, analyze, and extend in one system.”“As a Workday Ventures portfolio company and Workday Software Partner, we’ve been incredibly impressed with Workday's team, culture, customer focus, and products,” said Alex Yakubovich, CEO, Scout RFP. “In addition to our common passion for innovative technologies, our two companies also share a commitment to employee and customer satisfaction, which will enable us to advance our vision to transform strategic sourcing.”Optimizing Spend to Drive Better Business OutcomesLeading procurement organizations partner with lines of business to maximize opportunities to support growth as well as drive critical cost savings to impact the bottom line. With Scout RFP, Workday will provide organizations a comprehensive source-to-pay solution with a best-in-class strategic sourcing offering to transform the procurement organization and deliver better business outcomes, including reduction in spend, greater policy compliance, and maximized engagement across key stakeholders.Scout RFP provides an intuitive and modern cloud-based platform for strategic sourcing and supplier engagement that makes sourcing simpler, smarter, and more streamlined. Hundreds of customers use Scout RFP to source faster, drive efficiency, and maximize the value of supplier relationships.Details Regarding Proposed Acquisition of Scout RFPUnder the terms of the definitive agreement, Workday will acquire Scout RFP for consideration of approximately $540 million in cash, subject to adjustments. The transaction is expected to close in the fourth quarter of Workday's fiscal year 2020, ending Jan. 31, 2020, subject to the satisfaction of customary closing conditions, including required regulatory approval.Cooley LLP is serving as legal advisor to Workday, and Fenwick & West is serving as Scout RFP’s legal advisor.Details Regarding Workday’s Fiscal 2020 Third Quarter Financial ResultsWorkday plans to announce its fiscal 2020 third quarter financial results after market close on Tuesday, Dec. 3, 2019. The company will host a conference call at 1:30 p.m. Pacific Time / 4:30 p.m. Eastern Time to review financial results, additional details on the acquisition, and business outlook.A live webcast of the event will be available on the Workday Investor Relations site. The replay of the webcast will be available for a minimum of 90 days after the conference call.About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.About Scout RFPScout RFP is the sourcing and supplier engagement platform trusted by procurement teams to streamline their processes, manage a unified pipeline of projects, and collaborate with stakeholders and suppliers to achieve greater business impact. More than 240 global brands trust Scout RFP’s automated sourcing and auction platform to deliver greater impact through seamless business engagement. Managing over $38.5 billion in project spend, Scout RFP’s powerful platform helps make enterprise commerce faster and more transparent, reduces risk, and drives profitability. Scout RFP is headquartered in San Francisco and funded by Scale Ventures, Menlo Ventures, New View Capital, Salesforce Ventures, Workday Ventures, and Google Ventures.Forward-Looking StatementsThis press release contains forward-looking statements related to Workday, Scout RFP and the acquisition of Scout RFP by Workday that are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Forward-looking statements in this communication include, among other things, statements about the potential benefits and effects of the proposed transaction, Workday’s plans, objectives, expectations and intentions, and the anticipated timing of closing of the proposed transaction. Risks include, but are not limited to: (i) the risk that the transaction may not be completed in a timely manner or at all; (ii) failure to achieve the expected benefits of the transaction; (iii) Workday’s ability to implement its plans, objectives and other expectations with respect to Scout RFP’s business and its ability to accelerate its growth in the procurement software market; (iv) negative effects of the announcement or the consummation of the transaction on Workday’s business operations, operating results or share price; (v) significant transaction costs; (vi) unknown liabilities; (vii) breaches in our security measures, unauthorized access to our customers’ data or disruptions in our data center operations; (viii) our ability to manage our growth effectively; (ix) competitive factors, including pricing pressures, industry consolidation, entry of new competitors and new applications, advancements in technology, and marketing initiatives by our competitors; (x) the development of the market for enterprise cloud applications and services; (xi) acceptance of our applications and services by customers, including any underlying technology such as machine learning and artificial intelligence; (xii) adverse changes in general economic or market conditions; (xiii) the regulatory, economic, and political risks associated with our international operations; (xiv) delays or reductions in information technology spending; (xv) changes in sales, which may not be immediately reflected in our results due to our subscription model; and (xvi) additional risks included in our filings with the Securities and Exchange Commission (SEC), including our Form 10-Q for the fiscal quarter ended July 31, 2019 and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday’s discretion and may not be delivered as planned or at all. Customers who purchase Workday services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019. Workday, Inc. All rights reserved. Workday and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Investor Relations Contact:Michael Magaro, Workday+1 (925) 379-6000Michael.Magaro@Workday.comMedia Contact:Nina Oestlien, Workday+1 (415) 828-3034Nina.Oestlien@Workday.com"
    },
    {
        "title": "Workday Extends Technology Leadership With Innovations for the Changing World of HR",
        "subtitle": "",
        "date": "Oct 15, 2019 9:20AM EDT",
        "content": "PLEASANTON, Calif. and ORLANDO, Fla., Oct.  15, 2019  (GLOBE NEWSWIRE) -- Workday Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, today announced a series of new innovations to help customers better navigate the changing world of HR.At Workday Rising, the company’s annual customer conference, Workday underscored how organizations can reimagine their businesses with new applications including Workday People Experience, Workday People Analytics, Workday Credentials, and more. With a technology architecture based on the Power of One—one source for data, one security model, one user experience, and one community—Workday is uniquely suited to deliver insights that help drive more strategic decision-making and improve employee engagement. Workday customers, which include 40 percent of the Fortune 500 and 50 percent of Fortune 50 companies, are better equipped to plan, execute, analyze, and extend—all in one system powered by machine learning, and backed by Workday’s unwavering commitment to customer service. Leveraging newer technologies including machine learning, blockchain, and advanced analytics, Workday helps organizations achieve greater productivity.Innovations for the Changing World of HR HR leaders are under more pressure than ever to effectively manage and develop their people as they encounter a new world where technology is reshaping every job, alternative work arrangements are becoming the norm, and speed of agility is key to survival. Driven by customer demand, Workday has made significant and unique investments to build solutions that support a multi-faceted workforce, new ways of working, and a distributed workplace. With new advancements announced at Workday Rising, customers are able to:Personalize and Elevate Employee ExperiencesPeople are overwhelmed with more tools than they know what to do with—and employers are relying on static portals that push them into various systems to find information or complete tasks. Workday has set out to create an experience that is personalized for each user, to help people feel more informed, agile, and truly supported.Meet Evolving Talent Demands and Unlock Opportunity Skills have emerged as a critical data source for fueling the talent lifecycle, prompting Workday to build a core Skills Graph foundation using machine learning to map relationships between more than 200,000 skills. With this foundation, Workday created the skills cloud to link skills to people and then connect them to jobs, opportunities, projects, and much more, enabling new solutions such as:Make Faster, Smarter People Decisions Data science, once available to only a few, is now democratized and being applied to all aspects of HR. But most organizations’ efforts to be more data-driven still run into challenges around fragmented data, data literacy, lack of specialized resources, and stringent data privacy and governance requirements. Utilizing one source for data, Workday can help customers make more fact-based decisions with the following advancements: Automate and Digitize Time-Consuming ProcessesOrganizations are constantly seeking out tools that improve operational efficiencies in order to drive productivity. Workday aims to streamline and automate time-consuming manual processes across HR, enabling people to focus their time on more strategic efforts with the following solutions and capabilities:Comment on the News“Today’s organizations need new ways to engage and inspire a fluid workforce that brings its consumer technology expectations to the workplace,” said David Somers, vice president and general manager, Talent Optimization, Workday. “Workday is infusing new technologies such as machine learning, blockchain, and advanced analytics into every inch of our solutions. This enables us to surface meaningful insights, create greater efficiencies, and deliver a more intelligent experience that is unmatched by other vendors—for the broader benefit of our customers, their employees, and their bottom line.” Additional Information AvailabilityAll products and features are available or planned for availability in the next calendar year.About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday’s offerings. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “seek,” “plan,” “project,” and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in our filings with the Securities and Exchange Commission (SEC), including our Form 10-Q for the fiscal year ended July 31, 2019 and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's discretion and may not be delivered as planned or at all. Customers who purchase Workday, Inc. services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019. Workday, Inc. All rights reserved. Workday and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Media ContactSamantha SokWorkday+1 (312) 315-8190Samantha.Sok@workday.com "
    },
    {
        "title": "Workday Upends Legacy Technology With Innovations for the Changing World of Finance",
        "subtitle": "",
        "date": "Oct 15, 2019 9:20AM EDT",
        "content": "PLEASANTON, Calif. and ORLANDO, Fla., Oct.  15, 2019  (GLOBE NEWSWIRE) -- Workday Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, today unveiled new advancements across Workday Financial Management and Adaptive Insights Business Planning Cloud to help enterprise customers better navigate the changing world of finance. At Workday Rising, the company’s annual customer conference, Workday highlighted how organizations will be able to reimagine their businesses with a new application, Workday Accounting Center, and machine learning-powered capabilities such as anomaly detection for accounting entries. Leveraging the Power of One—one source for data, one security model, one user experience, and one community—Workday is uniquely suited to deliver solutions to help enterprise customers streamline financial processes and make faster, data-driven decisions.With Workday, businesses have a single system to plan, execute, analyze, and extend—powered by machine learning, and backed by an unwavering commitment to customer service. Using advanced analytics to surface trends and insights, and machine learning to automate manual processes and save time, Workday continuously innovates so organizations can increase their business agility.Innovations to Transform Finance and PlanningToday’s chief financial officers (CFOs) and finance leaders are faced with constant change and new challenges in a rapidly-evolving environment driven by technological advancements, shifting business models, and new competitors. This leads to mounting pressure to innovate faster, provide more accurate forecasts, and deliver insights that will help the business quickly respond and adapt to market changes. With these new responsibilities at hand, CFOs find themselves in the driver's seat of navigating organizational transformation. With new solutions announced at Workday Rising, customers are able to:Streamline Accounting Processes With External and Internal DataWorkday will help business users better manage the end-to-end process of creating journal entries and reporting on enriched data from sources outside of Workday—all in one centralized solution. Automate Labor-Intensive Processes With Machine Learning Workday leverages data science capabilities, which span state-of-the-art neural networks and classic machine learning techniques, to intelligently automate traditionally labor-intensive finance processes. With this approach to machine learning, the system is able to better understand the relationships between financial entities. For example, it can learn about the relationships between cost centers, spend categories, projects, regions, currencies, and more to understand that expenses like taxis, airfare, and hotels are all related. This approach enables various features that help save time and resources, including: Make Faster, More Informed DecisionsEvery user can be empowered to make smarter, data-driven decisions with operational insights the business needs, and capabilities that enable a more seamless transition from planning to execution.Comment on the News“As the finance function continues to evolve, CFOs and finance leaders are looking for tools that will help their teams focus on more strategic work and innovate in a way that enhances revenue,” said Barbara Larson, general manager, Workday Financial Management. “Workday is weaving new technologies such as machine learning and advanced analytics into every aspect of our accounting and finance solutions to save time and enable faster, data-driven decisions. By creating more efficiencies across the board, we can help drive agility and immediate business value for our customers’ benefit.”Additional Information Availability All products and features are available or planned for availability in the next calendar year.About WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world’s largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday’s offerings. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “seek,” “plan,” “project,” and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in our filings with the Securities and Exchange Commission (SEC), including our Form 10-Q for the fiscal year ended July 31, 2019 and our future reports that we may file with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's discretion and may not be delivered as planned or at all. Customers who purchase Workday, Inc. services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019. Workday, Inc. All rights reserved. Workday and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Media ContactSamantha SokWorkday+1 (312) 315-8190Samantha.Sok@workday.com "
    },
    {
        "title": "Workday Announces Livestreams and On-Demand Sessions for Workday Rising 2019",
        "subtitle": "",
        "date": "Sep 25, 2019 8:30AM EDT",
        "content": "PLEASANTON, Calif., Sept.  25, 2019  (GLOBE NEWSWIRE) -- Workday, Inc. (NASDAQ: WDAY), a leader in enterprise cloud applications for finance and human resources, today announced livestreams, on-demand sessions, and more details about Workday Rising, held from Oct. 14 - 17 at the Orange County Convention Center in Orlando, Fla. At Workday Rising, customers, prospective customers, sponsoring partners, and employees will come together to collaborate and learn how Workday helps organizations globally plan, execute, analyze, and extend in one system, powered by machine learning, to achieve their growth objectives for a changing world.Workday Rising offers more than 500 learning opportunities including customer case studies, interactive courses, deep dive product demonstrations, and theater sessions for customers to share best practices and ideas with each other.Workday Innovation Keynote and Product Strategy and Vision Keynotes to be LivestreamedThe Workday innovation keynote address, hosted by Workday Co-Founder and CEO Aneel Bhusri, will be livestreamed and take place on Tuesday, Oct. 15 at 9:00 a.m. ET. It will showcase the company’s vision for the future and how it partners with its customers to fuel innovation.In addition, the product strategy and vision keynotes featuring Workday executives will be livestreamed and take place during the following times:Please register online to join the livestreams. A replay of the Workday innovation keynote address and product strategy and vision keynotes will be available for 30 days after they are posted to http://live.workday.com. Additional sessions will also be available on demand.Workday Rising Sponsors and Exhibitors  Partners are an important part of Workday Rising and work closely with Workday to help customers achieve great business results. At the event, the company will host the Workday Experience and Expo where customers can meet a variety of advisory, services, and software partners to discuss their business goals and learn how to gain the most value possible from their Workday deployments.Workday partner sponsors and exhibitors at Workday Rising include:In addition to Workday Ventures companies that are sponsoring Workday Rising, including Automation Anywhere, Beamery, BetterUp, Guild Education, Mya Systems, Scout RFP, and Workato, several Workday Ventures companies are exhibitors at the conference, including:More InformationAbout WorkdayWorkday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, planning, and analytics applications designed for the world's largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday.© 2019. Workday, Inc. All rights reserved. Workday and the Workday logo are registered trademarks of Workday, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.Media ContactAllison KubotaWorkday+1 (805) 512-1796Allison.Kubota@Workday.com                    "
    },
    {
        "title": "Adaptive Insights, a Workday Company, Named to Constellation ShortList(TM) for Cloud-Based Planning Platforms",
        "subtitle": "Adaptive Insights named to seventh consecutive ShortList",
        "date": "Sep 4, 2019 9:00AM EDT",
        "content": " PALO ALTO, Calif., Sept. 4, 2019 /PRNewswire/ -- Adaptive Insights, a Workday company (NASDAQ: WDAY), today announced it was again named to the Constellation ShortList for Cloud-Based Planning Platforms in Q3 2019. The technology vendors and service providers included in the Constellation ShortList offer the key requirements for early adopters pursuing digital transformation initiatives. Adaptive Insights has been named to the Constellation Research ShortLists for business planning since inception.\"We're living in disruptive times and companies have to move faster than ever to keep up with innovation,\" said Doug Henschen, vice president and principal analyst at Constellation Research, Inc. \"We see cloud-based planning platforms that support agile planning and analysis as the future. It's vital for companies to take an active, continuous approach to planning, as this will be the distinction between leaders and laggards.\"Businesses of all sizes – and across all industries – must operate more quickly and with more agility than ever before. To achieve this, more than 4,500 organizations have selected Adaptive Insights Business Planning Cloud for a continuous, comprehensive, and collaborative approach to business planning, empowering them to make more informed decisions in less time. \"Adaptive Insights is honored to be included again on the Constellation ShortList for Cloud-Based Planning Platforms,\" said Tom Bogan, CEO of Adaptive Insights. \"Our Business Planning Cloud helps businesses plan, report, and analyze across their organization, so they can better navigate change in today's dynamic business environment. The result is greater business agility, which lets market leaders make better decisions faster to course correct for true competitive advantage.\"  For more information:Constellation Research advises leaders on leveraging disruptive technologies to achieve business model transformation. Products and services named to the Constellation ShortList meet the threshold criteria for this category as determined through client inquiries, partner conversations, customer references, vendor selection projects, market share, and internal research. The portfolio is frequently updated every six months with the rapidly changing market conditions.About Adaptive Insights Adaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com.Disclaimer Constellation Research does not endorse any solution or service named in its research. Forward-Looking Statements This press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday's and Adaptive Insights' offerings. The words \"believe,\" \"may,\" \"will,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect,\" \"seek,\" \"plan,\" \"project,\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in Workday's filings with the Securities and Exchange Commission (SEC), including Workday's Form 10-Q for the fiscal quarter ended July 31, 2019 and future reports that may be filed with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's and Adaptive Insights' discretion and may not be delivered as planned or at all. Customers who purchase Workday and/or Adaptive Insights services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019 Workday, Inc.  All rights reserved.  Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights.  All other brand and product names are trademarks or registered trademarks of their respective holders. View original content to download multimedia:http://www.prnewswire.com/news-releases/adaptive-insights-a-workday-company-named-to-constellation-shortlist-for-cloud-based-planning-platforms-300911358.htmlSOURCE  Adaptive Insights"
    },
    {
        "title": "Humanity Completes Workday Approved Integration",
        "subtitle": "Cloud-Based Employee Scheduling Platform and Workday Human Capital Management Provide Customers with Optimized and Compliant Work Schedules",
        "date": "Jun 18, 2019 3:01AM EDT",
        "content": "SAN FRANCISCO, June 18, 2019 /PRNewswire/ --  Humanity, a Workday (NASDAQ:WDAY) Access software partner, today announced that it has achieved Workday Approved Integration status. Humanity provides customers with a seamless integration that connects Workday Human Capital Management (HCM) with Humanity's cloud-based employee scheduling platform.Workday HCM is a single system that enables organizations to make faster decisions, gain operational visibility, prepare for future talent shifts and build effective teams. Humanity is a cloud-based employee scheduling platform that enables global organizations to reduce time spent creating schedules by as much as 80 percent. Through this partnership, customers can gain real-time visibility into labor costs, and create optimized, data-driven schedules – easily manageable via a mobile device. Additionally, customers can benefit from increased efficiencies as Humanity's integration with Workday HCM allows employee data to be stored in a single system of record without double data entry. \"Humanity's Workday Approved Integration supports the value we bring to our customers with dynamic and flexible scheduling,\" said Chris Amani, CEO, Humanity. \"By partnering with Workday, our joint customers are able to further streamline the employee scheduling process, enhancing business operations and increasing employee retention and engagement.\"\"In order to manage 1,000 stores across the U.S. and Canada, we needed a powerful HCM platform with advanced scheduling capabilities,\" said Dasha Stupak, director of human resources, Pet Valu. \"The partnership between Workday and Humanity provides us with a fully-integrated solution that requires no double entry on employee data, giving us a simple process for onboarding employees in addition to providing real-time insight into schedules for easy updates and modifications.\"About HumanityHumanity offers a cloud-based employee scheduling platform that accelerates schedule creation by up to 80 percent while providing organizations of all sizes with unprecedented insight into their operations and empowering them with actionable data to optimize staffing based on historical sales and sales forecasts, employee skill set, and staff availability. Humanity is offered as Software as a Service (SaaS) and can be deployed as a stand-alone solution in the cloud or integrated quickly and easily with today's leading HCM platforms—without the need for any customization. Since 2010, more than 10,000 customers representing 1.3M users have scheduled over half-a-billion shifts on Humanity. For more information or to schedule a free 30-day trial, visit humanity.com. Product and brand names are trademarks and/or registered trademarks of their respective companies. Humanity disclaims any and all rights in these marks. View original content to download multimedia:http://www.prnewswire.com/news-releases/humanity-completes-workday-approved-integration-300869990.htmlSOURCE  Humanity"
    },
    {
        "title": "Adaptive Insights Celebrates Business Planning Transformations at #AdaptiveLive19",
        "subtitle": "Torchie Award winners implement active planning strategies for business agility, showcase best practices for future organizations",
        "date": "Jun 11, 2019 9:03AM EDT",
        "content": "PALO ALTO, Calif., June 11, 2019 /PRNewswire/ -- Adaptive Insights, a Workday company (NASDAQ: WDAY), announced today the winners of its annual Torchie Awards, which were created to honor innovators who have achieved excellence in business planning across their organizations. The Torchie Award winners for 2019 include Bishop-Wisecarver Group, Branch Group, Bucknell University,  CareStar, MINDBODY, and TELUS Communications.The winners were presented with Torchie Awards at Adaptive Live 2019, Adaptive Insights' annual global gathering of business planning professionals held May 21-23 in Las Vegas. This year, more than 1,600 industry professionals from over 600 organizations attended the conference to network with peers, share planning best practices, and gain insight into future planning technologies. \"I'm inspired by our customers who continue to lead planning transformation in their organizations,\" said Rob Hull, founder of Adaptive Insights. \"With our Adaptive Insights Business Planning Cloud, these organizations are able to expand planning beyond finance and deliver greater value to the business. We're thrilled to recognize these winners for both the planning best practices they've established and the dramatic impact they've made.\" This year's Torchie Award honorees represent significant achievements globally across multiple industries. The categories for the awards range from best use of dashboard and analytics to exceptional collaboration, all in support of greater business agility. The Torchie Award winners this year include:Bishop-Wisecarver Group—Largest Business ImpactWith finance team members at Bishop-Wisecarver, that helps manufacturers and automation solution providers engineer linear and rotary motion products for harsh and extreme environments, spending up to 40-50% of their time on data collection and validation and not on analysis, it was time for a change. Using Business Planning Cloud, Bishop-Wisecarver saves an estimated total of 600 hours in the accounting and finance department alone. And with more time to focus on analysis, the finance team gained a deeper understanding of the business. This resulted in significant operational improvements, including the manufacturing shop floor in the assembly increasing efficiency by about 30% and improving returns by 60%, sales improving its quote-to-close ratio by 10% year over year, and accounting reducing its month-end close cycle by 10 business days to a mere three days total.Branch Group—Excellence in Operational PlanningWith a diverse group of construction subsidiaries, Branch Group, a provider of construction management, design build, general contracting, and preconstruction services, needed to simplify and streamline planning and reporting. Using Business Planning Cloud, each subsidiary of Branch Group now collaborates and reports to other groups at a project level with geographic, product, and subsidiary dimensionality, driving multiple 24-month forecasting cycles throughout the year. Operational and financial KPIs are reported to managers using dashboards in Business Planning Cloud, giving these decision-makers better planning, reporting, and analytics, and making finance a more strategic partner. Bucknell University—Exceptional CollaborationAt Bucknell University, a private liberal arts college, planning has gotten easier for more than 150 users--ranging from academic assistants to deans and vice presidents of the university. What was previously a frustrating and an error-prone approach is now a simplified process all managed in a single cloud platform. Business Planning Cloud speeds decision-making with the right information at the right time, and, as important, enables the finance team to be the value-added partner to everybody in the organization that plans.CareStar—Best Use of Dashboard and Analytics  CareStar, a provider of home- and community-based case management and assessment services for people who are disabled and developmentally delayed, broke through the silos created by a top-down planning process. The home and community-based case management company uses Business Planning Cloud to automate and simplify budgeting and reporting processes by converting its financial statement and operational metrics into reports and dashboards. By integrating operational data from multiple source systems into Adaptive Insights, CareStar's finance team has visibility into diverse operational details such as mileage, assessments completed, patient census, time reporting, caseloads, IT call center metrics, and software development productivity. Planning is now bottoms-up, becoming a collaborative process across the business.MINDBODY—Outstanding Business PlanningMINDBODY, the leading technology platform for the wellness industry, has been able to model and integrate multiple acquisitions. This has helped the company as it has grown from ~ $70 million in revenue in 2014 to ~ $250 million in revenue in 2018. With Business Planning Cloud, the company is able to easily integrate with NetSuite and does extensive reporting using OfficeConnect. It now creates weekly rolling forecasts and has created long-term plans as well. The finance team is now able to highlight and spot trends in the business and to respond quickly when issues arise by providing data and strategic advice that supports overall business objectives.TELUS Communications—Greatest Improvement in Forecasting Telus, a Canadian national telecommunications company, is uniquely using Adaptive Insights not for traditional financial planning, but for resource planning and forecasting of a multi-billion dollar project. The project — a fiber optic rollout across their wireline network in British Columbia, Alberta, and parts of Quebec — is quite complex given the magnitude of the investment and impact to the communities they serve. The ability to constantly adjust the course of the project based on real-time data provided via Adaptive Insights has been pivotal to ensure the project delivers its annual targets such as the amount of homes and businesses connected and capital spend. As a result, accuracy improved to less than 0.5 percent variance per year, which has significantly improved forecast credibility.To learn more about the customer successes shared at Adaptive Live, read the blog \"Agents of change in the age of urgency.\"Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday's and Adaptive Insights' offerings. The words \"believe,\" \"may,\" \"will,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect,\" \"seek,\" \"plan,\" \"project,\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in Workday's filings with the Securities and Exchange Commission (\"SEC\"), including Workday's Form 10-Q for the fiscal quarter ended April 30, 2019 and future reports that may be filed with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's and Adaptive Insights' discretion and may not be delivered as planned or at all. Customers who purchase Workday and/or Adaptive Insights services should make their purchase decisions based upon services, features, and functions that are currently available.About Adaptive InsightsAdaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com.© 2019 Workday, Inc.  All rights reserved.  Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights LLC.  All other brand and product names are trademarks or registered trademarks of their respective holders. View original content to download multimedia:http://www.prnewswire.com/news-releases/adaptive-insights-celebrates-business-planning-transformations-at-adaptivelive19-300865108.htmlSOURCE  Adaptive Insights"
    },
    {
        "title": "Adaptive Insights Showcases Product and Technology Innovation at Adaptive Live",
        "subtitle": "Customers realize significant performance gains with Business Planning Cloud",
        "date": "May 23, 2019 1:01PM EDT",
        "content": "LAS VEGAS, May 23, 2019 /PRNewswire/ -- Adaptive Insights, a Workday company (NASDAQ: WDAY), showcased continued innovations for Adaptive Insights Business Planning Cloud on day two at Adaptive Live 2019, the annual gathering of finance and business planning professionals that trust Business Planning Cloud for planning, modeling, and reporting. Centered around collaborative planning, company-wide modeling, and an intelligent and scalable platform, the new enhancements continue to support business planning for organizations of all sizes.At the core of the product innovations is Elastic Hypercube Technology, the planning, reporting, and analytics engine for Business Planning Cloud. Now in use by more than 4,000 customers, Elastic Hypercube Technology has dramatically increased calculation efficiency making the 90th percentile response time more than 50% faster.  Taking the stage at Adaptive Live, Chief Product Officer Bhaskar Himatsingka noted, \"Elastic Hypercube Technology has brought unprecedented levels of performance for our customers, including the largest enterprises with hundreds of thousands of employees. We're fiercely committed to innovation that supports both distributed planning—the ability for non-finance users to contribute expenses and forecasts directly to finance through our platform—and functional planning such as workforce, sales, and operational planning, where non-finance users can easily build and manage models to create a holistic, company-wide plan. Elastic Hypercube Technology has proven it is the engine to power the next generation of planning.\"Large enterprises, such as the American Family Mutual Insurance Company, use Business Planning Cloud to manage business performance across geographies and distributed business units. American Family Mutual Insurance Company uses a monthly rolling forecast cadence involving hundreds of business users to plan and manage billions of dollars in operating expenses. Its sophisticated planning models leverage insurance-specific drivers like premium revenues, new business applications, and claim counts for advanced forecasting and reporting.\"Our performance as a company is dependent on accurate, continuous planning and a deep understanding of our risks and variables,\" said Shawn DeBoer, business technology and planning director, American Family Mutual Insurance Company. \"We've seen our model performance improve and calculation times speed up since the release of Elastic Hypercube Technology, which is significant for our teams given the planning, reporting and analysis demands we see on a daily—even hourly—basis.\"Product Innovation Takes Center StageA future powered by machine learning (ML) technology was highlighted and a new anomaly detection capability for Business Planning Cloud was unveiled during the morning keynote. A live demonstration of the new capability showcased the ability for both finance and business planners to easily catch potential errors in budgets, forecasts, scenarios, and other models. Working with financial and operational data, the system detects when data is outside the historical norm, flagging it for the user. Innovative ML algorithms enable the system to then learn from user feedback—determining if the anomaly was in error—to continually improve the process and better predict where anomalies occur. Anomaly detection on Business Planning Cloud is expected to be available next month to a select customer set with general availability later this year. Enhancements Target Functional Planners as Planning Expands Beyond FinanceHimatsingka noted that the strong adoption of Adaptive Insights' planning platform beyond finance continues with more organizations using Business Planning Cloud for workforce, sales, and other operational planning. Continued innovation for product enhancements focus on collaborative planning and company-wide modeling.Among the upcoming features demonstrated were active dashboards that allow business planners to enter data and immediately see the impact on analytical dashboards for visual optimization. For functional planners across the organization, next-generation security features with very fine-grained data access control are expected to be added to Business Planning Cloud. Deeper Integration with WorkdayBusiness Planning Cloud continues to integrate more deeply with Workday through the Power of One, with joint customers now able to more easily access Business Planning Cloud through single sign-on. Built-in access to Workday data and metadata from within Adaptive Insights lets customers build and drive comprehensive planning models and analyses. Drill-through from Adaptive Insights to Workday Human Capital Management and Workday Financial Management allows customers to immediately access transactional data for deeper insights into business performance and plans. Enhanced Integration with Oracle NetSuiteNew two-factor authentication and enhanced metadata integration for Oracle NetSuite builds on the long-standing integration between Oracle NetSuite and Adaptive Insights and enhances the user experience for joint customers. Adaptive Insights will continue to invest in its proven interface with Oracle NetSuite, enriching the ability to use ERP data in planning, reporting, and analysis with Business Planning Cloud.For more information about continued innovation with Business Planning Cloud, read the blog, \"Innovation in overdrive.\"About Adaptive Insights Adaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com. Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday's and Adaptive Insights' offerings. The words \"believe,\" \"may,\" \"will,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect,\" \"seek,\" \"plan,\" \"project,\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in Workday's filings with the Securities and Exchange Commission (SEC), including Workday's Form 10-K for the fiscal year ended January 31, 2019 and future reports that may be filed with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's and Adaptive Insights' discretion and may not be delivered as planned or at all. Customers who purchase Workday and/or Adaptive Insights services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019 Workday, Inc.  All rights reserved.  Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights, Inc.  All other brand and product names are trademarks or registered trademarks of their respective holders. View original content to download multimedia:http://www.prnewswire.com/news-releases/adaptive-insights-showcases-product-and-technology-innovation-at-adaptive-live-300855720.htmlSOURCE  Adaptive Insights"
    },
    {
        "title": "Adaptive Insights Lights Path to Business Agility at Adaptive Live",
        "subtitle": "Anomaly detection launches machine learning innovations for Business Planning Cloud",
        "date": "May 22, 2019 1:00PM EDT",
        "content": "LAS VEGAS, May 22, 2019 /PRNewswire/ -- Adaptive Insights, a Workday company (NASDAQ: WDAY), today opened Adaptive Live 2019, the annual gathering of finance and business planning professionals that trust Adaptive Insights Business Planning Cloud for company-wide planning, modeling, and reporting. The conference theme, \"Plan for What's Next,\" is represented in breakout sessions focusing on today's planning best practices, emerging product innovation and digital transformation keynotes, and insight into machine learning (ML) technologies that will offer continuous guidance and power business planning processes of the future.In the opening keynote, Tom Bogan, CEO of Adaptive Insights, shared his vision for how companies will achieve agility in today's fast-paced business environment. Emphasizing the need for even faster and more informed decision making, Bogan noted that company-wide planning driven by finance will be powered by ML technologies. \"Companies that will thrive in the coming decade are those that can harness their data to work even harder for them,\" said Bogan. \"Our vision is to enable our customers to leverage historical information with forward-looking analytics to see any number of options almost instantly, so decision makers can select the best path forward. We'll embrace machine learning technologies and create 'business navigation systems' that offer continuous guidance and deliver the level of agility companies need to remain competitive, or risk being left behind. This is the future of planning.\"Seattle Sounders Embrace Anomaly Detection Anomaly detection is the first ML feature to be offered on Business Planning Cloud, scheduled for availability next month to a select customer set with general availability later this year. Customers like Seattle Sounders, a Major League Soccer franchise, will be among the first to use the technology. Today the franchise blends financial and operational data for scenario planning, to evaluate multi-year deals for players, and to determine which clubs to select for international friendly matches by weighing variables including ticket sales, travel costs, etc.  \"We use Business Planning Cloud to make multi-million dollar decisions with confidence, basing those decisions on data in the platform,\" said Tom Riley, vice president of finance, Seattle Sounders. \"As we look ahead, machine learning will let us take a large amount of data and use it to analyze in ways we never could before, like weather data to forecast ticket sales based on what the temperature is that day. That's far more powerful than what any human can do. Having been an early design partner for anomaly detection, we're excited to be on this innovation journey with Adaptive Insights.\" Anomaly detection on Business Planning Cloud uses ML to catch potential errors in budgets, forecasts, scenarios, and other models. The ML algorithm compares prior data to detect anomalies and alert planning users of possible errors or inputs not reflective of seasonality, for both finance or operational planning users. Users can provide feedback by accepting or rejecting the anomaly designation provided. The system learns from user feedback to continually improve the process and better predict where anomalies occur.A Look Ahead: Intelligent Planning with Continuous Guidance Looking ahead, emerging ML technologies for Business Planning Cloud will help shift the role of finance from describing the past and modeling the future to instead prescribing what should happen. Bogan noted the intelligent planning system of the future will include capabilities like augmented analytics to automatically identify trends and opportunities, empowering both finance and business users with the capability to harness data in a way previously reserved for data scientists. Much like a navigation system, the intelligent planning system of the future will take in data and make continuous adjustments, recommend various scenarios, and provide a path forward that is optimized for each user and each business.For more information about the future of planning, read the blog, \"Planning for what's next\" or download the book \"Plan to Win: Achieving business agility in the age of urgency.\"About Adaptive InsightsAdaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com. Forward-Looking StatementsThis press release contains forward-looking statements including, among other things, statements regarding the expected performance and benefits of Workday's and Adaptive Insights' offerings. The words \"believe,\" \"may,\" \"will,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect,\" \"seek,\" \"plan,\" \"project,\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Risks include, but are not limited to, risks described in Workday's filings with the Securities and Exchange Commission (SEC), including Workday's Form 10-K for the fiscal year ended January 31, 2019 and future reports that may be filed with the SEC from time to time, which could cause actual results to vary from expectations. Workday assumes no obligation to, and does not currently intend to, update any such forward-looking statements after the date of this release.Any unreleased services, features, or functions referenced in this document, our website, or other press releases or public statements that are not currently available are subject to change at Workday's and Adaptive Insights' discretion and may not be delivered as planned or at all. Customers who purchase Workday and/or Adaptive Insights services should make their purchase decisions based upon services, features, and functions that are currently available.© 2019 Workday, Inc. All rights reserved. Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights, Inc. All other brand and product names are trademarks or registered trademarks of their respective holders.  View original content to download multimedia:http://www.prnewswire.com/news-releases/adaptive-insights-lights-path-to-business-agility-at-adaptive-live-300854817.htmlSOURCE  Adaptive Insights"
    },
    {
        "title": "Adaptive Insights is recognized as an April 2019 Gartner Peer Insights Customers' Choice for Cloud Financial Planning and Analysis Solutions",
        "subtitle": "Customers rated Adaptive Insights with a 4.6 out of 5 for the Cloud Strategic Corporate Performance Management Solutions market based on 169 ratings",
        "date": "May 1, 2019 9:02AM EDT",
        "content": "PALO ALTO, Calif., May 1, 2019 /PRNewswire/ -- Adaptive Insights, a Workday company (NASDAQ: WDAY), has been named a 2019 Gartner Peer Insights Customers' Choice for Cloud Financial Planning Analysis Solutions. Gartner defines Cloud Financial Planning and Analysis Solutions as FP&A solutions that support the office of finance's budgeting, planning, and forecasting efforts. Many also supplement the office's budgeting and planning process support with modeling, collaboration analytics, and performance-reporting capabilities, to increase its ability to manage performance by linking corporate strategy and execution. According to the July 2018 Gartner Magic Quadrant for the same market, \"The FP&A market is accelerating its shift from mature on-premises offerings to cloud solutions. Finance application leaders are seeking SaaS solutions to reduce application support costs, increase application flexibility, and shorten time to value.\"\"Adaptive Insights is honored to be recognized as a 2019 Gartner Peer Insights Customers' Choice for Cloud Financial Planning Analysis Solutions,\" said Sean Cox, vice president of customer success, Adaptive Insights. \"As a cloud planning pioneer, we have consistently focused on delivering business value for our more than 4,000 customers through our SaaS platform. Our Business Planning cloud lets companies plan and make informed decisions quickly, giving them business agility to course-correct in our fast-paced world.\"The 2019 Gartner Peer Insights Customers' Choice distinction is based on feedback and ratings from end-user professionals who have experience purchasing, implementing, and/or using the product or service.Adaptive Insights feels that its distinction is based on excellent customer satisfaction, high-performance modeling capabilities, and ease of use experience. Customers rated Adaptive Insights with a 4.6 out of 5 for the Cloud Strategic Corporate Performance Management Solutions market based on 169 ratings (source: Gartner Peer Insights, as of April 26, 2019). Recent reviews on Gartner Peer Insights include, \"Performance management software with detailed, real-time data for your entire business,\" said a customer in the manufacturing industry. \"Moving from Excel-based budgeting to an actual cloud software system has been the best thing for our organization. We have been able to create dashboards, reports, views specific to each budget owner/department and help them really dig into the department metrics,\" said another customer in the healthcare industry.To learn more about how customers are using Adaptive Insights Business Planning Cloud, read the blog \"And now a few words from our customers.\"About Peer Insights Peer Insights is an online platform of ratings and reviews of IT software and services that are written and read by IT professionals and technology decision-makers. The goal is to help IT leaders make more insightful purchase decisions and help technology providers improve their products by receiving objective, unbiased feedback from their customers. Gartner Peer Insights includes more than 215,000 verified reviews in more than 340 markets. For more information, please visit www.gartner.com/reviews/home.Gartner Peer Insights Customers' Choice constitute the subjective opinions of individual end-user reviews, ratings, and data applied against a documented methodology; they neither represent the views of, nor constitute an endorsement by, Gartner or its affiliates.About Adaptive InsightsAdaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com.© 2019 Workday, Inc.  All rights reserved.  Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights, Inc.  All other brand and product names are trademarks or registered trademarks of their respective holders.  View original content to download multimedia:http://www.prnewswire.com/news-releases/adaptive-insights-is-recognized-as-an-april-2019-gartner-peer-insights-customers-choice-for-cloud-financial-planning-and-analysis-solutions-300841384.htmlSOURCE  Adaptive Insights"
    },
    {
        "title": "Adaptive Insights Celebrates Nonprofit Customers, Showcases Room to Read During National Volunteer Month",
        "subtitle": "Better planning at Room to Read delivers greater benefit for communities worldwide",
        "date": "Apr 16, 2019 9:02AM EDT",
        "content": "PALO ALTO, Calif., April 16, 2019 /PRNewswire/ -- Adaptive Insights, a Workday (NASDAQ: WDAY) company, honors its nearly 750 nonprofit customers during National Volunteer Month. National Volunteer Month was established in 1981 and is an opportunity to recognize and thank volunteers who lend their time, talent, voice, and support to causes they care about in their community, as well as inspire volunteerism. Organizations like Room to Read have benefited from volunteer resources that support their mission and cause. Room to Read was founded in 2000 on the basis that World Change Starts with Educated Children®. The organization focuses on deep, systemic transformation within schools in low-income communities during two time periods that are most critical in a child's schooling: early primary school for literacy acquisition and secondary school for girls' education. Since 2000, the organization has impacted 16.8 million children across 37,000 low-income communities around the world. Room to Read's volunteer network consists of over 45 volunteer chapters globally that support Room to Read through awareness raising and fundraising activities. \"Our volunteers are critical to our mission and the revenue they generate helps us reach more deserving children each year,\" said Nancy Shyer, senior director of finance, at Room to Read. \"We're proud to say that 86 percent of all donations are directed toward our programs. Efficient planning for revenue deployment, including investments sourced from volunteers, is critical to achieving our goals for benefiting children each year.\"\"It's an honor to be associated with impactful organizations like Room to Read,\" said Sean Cox, vice president of customer success at Adaptive Insights. \"With the ability to better plan, these organizations are able to make every dollar and every volunteer hour count toward their mission. Volunteers sacrifice so much to give back to their communities, and we salute them today and every day for the difference they make in our world.\"  Adaptive Insights has a long history working with nonprofit organizations across the globe. To increase value to donors and constituents, organizations turn to Adaptive Insights Business Planning Cloud. Spanning the arts, education, mental health, conservation, and more, nonprofit organizations use cloud planning software to manage donations, staffing, facilities, and trusts. With better insights into their financial and operational performance, nonprofits can optimize budgets and resources, giving more to their mission and cause.Read more about how nonprofit Room to Read has helped improve the lives of millions of children here. About Adaptive Insights Adaptive Insights, a Workday company, is powering a new generation of business planning. Driving business agility in a fast-moving world, Adaptive Insights Business Planning Cloud leads the way for people in companies to collaborate, gain insights, and make smarter decisions, faster. Powerful modeling for any size organization, yet so easy for everybody who plans. To learn more, visit www.adaptiveinsights.com. © 2019 Workday, Inc.  All rights reserved.  Adaptive Insights and the Adaptive Insights logo are registered trademarks of Adaptive Insights, Inc.  All other brand and product names are trademarks or registered trademarks of their respective holders.  View original content to download multimedia:http://www.prnewswire.com/news-releases/adaptive-insights-celebrates-nonprofit-customers-showcases-room-to-read-during-national-volunteer-month-300832461.htmlSOURCE  Adaptive Insights"
    }
]