[
    {
        "title": "Western Digital Empowering Small and Medium Enterprises (SMEs) in Transition to NVMe with New WD Gold NVMe SSDs",
        "subtitle": "",
        "date": "Mar 4, 2020 8:00AM EST",
        "content": "\nNew WD Gold Enterprise-class NVMe SSDs Designed to Dramatically Improve Application Responsiveness and Performance\n\nNews highlights:\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital (NASDAQ: WDC) is enabling small and medium-sized enterprises (SMEs) to easily transition to NVMe™ storage and dramatically improve application performance with a new addition to its portfolio of data center NVMe SSDs: the first enterprise-class NVMe SSD in the WD Gold™ family.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200304005094/en/Western Digital Empowering Small and Medium Enterprises in Transition to NVMe with New WD Gold NVMe SSDs (Photo: Business Wire)\nIndustry analyst firm IDC expects NVMe unit shipments to reach more than 79 percent of the market by 20231. With advancements in multi-core, multi-threaded CPUs, legacy storage technology has become a bottleneck to maximum application performance.\n\nShipping in early CQ2 2020, the new WD Gold NVMe SSDs will be available in four capacities to channel partners and end customers. The WD Gold NVMe SSD is designed to be the primary storage in servers delivering superior response times, higher throughput and greater scale than existing SATA devices for enterprise applications. WD Gold NVMe SSDs complement recently launched WD Gold HDDs by providing a high-performance storage tier for applications and data sets that requires low latency or high throughput.\n\nThe new WD Gold NVMe SSDs are designed with Western Digital’s silicon-to-system expertise, from its 3D TLC NAND SSD media to its purpose-built firmware and own integrated controller. Customers have the high reliability for peace of mind that power-loss and data-path protection provide, as well as an extended five-year limited warranty. Secure boot and secure erase provide customers with additional data-management protections.\n\n“Pick any industry - the world is being transformed by data. There is transformation and innovation happening across many IT fronts, and across virtually every industry, large and small, and it's all driven by data,” said Phil Bullinger, senior vice president and general manager, Data Center Business at Western Digital. “Transitioning to NVMe is fundamental to unlocking the performance potential of high-speed storage media, enabling new applications, use cases and workloads. The addition of WD Gold NVMe SSDs to our currently shipping high-capacity WD Gold HDDs means channel partners and customers have expanded, robust options to achieve faster time-to-value.”\n\nWestern Digital's data center solutions address a variety of needs in a fast-moving and ever-changing data technology landscape. Its broad data center portfolio includes its family of Ultrastar® HDDs and SSDs; WD Gold HDDs and SSDs; OpenFlex™ NVMe over Fabrics (NVMe-oF™) open composable infrastructure; Ultrastar JBOF/JBOD storage platforms; NVMe-oF bridge solutions; and the Ultrastar memory extension drive.\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n1Worldwide Solid State Drive Forecast Update, 2019–2023 (Dec 2019, IDC Doc #US44492119)\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved.\n\nWestern Digital, the Western Digital logo, OpenFlex, Ultrastar and WD Gold are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries. The NVMe and NVMe-oF word marks are trademarks of NVM Express, Inc. All other marks are the property of their respective owners. Product specifications subject to change without notice. Pictures shown may vary from actual products. Not all products are available in all regions of the world.\n\nForward-Looking Statements\n\nThis news release contains certain forward-looking statements, including the expected availability, benefits, capabilities, capacity, performance, speed and/or other features of the WD Gold NVMe SSD. There are a number of risks and uncertainties that may cause these forward-looking statements to be inaccurate including, among others: changes to specifications from standards organizations, volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, divestitures, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company's filings with the Securities and Exchange Commission, including the company's most recently filed periodic report, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200304005094/en/\nHeather Davis\nWestern Digital Product Communications\n949-672-7920\nheather.davis@wdc.com\n\nT. Peter Andrew\nWestern Digital Investor Relations\n1-800-695-6399\npeter.andrew@wdc.com\ninvestor@wdc.com\nSource: Western Digital Corporation"
    },
    {
        "title": "Western Digital Named One of the ‘2020 World’s Most Ethical Companies’ by Ethisphere",
        "subtitle": "",
        "date": "Feb 25, 2020 6:00AM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced that it has been recognized by Ethisphere, a global leader in defining and advancing the standards of ethical business practices, as one of the 2020 World’s Most Ethical Companies. The recognition honors companies that strive to create positive change throughout the global communities in which they operate.\n\n\"We are honored to be recognized by Ethisphere as a World’s Most Ethical Company for the second time,\" said Steve Milligan, CEO of Western Digital. \"Our commitment to ethics and integrity is at the foundation of everything we do and believe at Western Digital. We continue to invest in sound ethics and compliance programs and work hard to earn the trust of our customers, business partners, shareholders and employees through fair business practices, delivering products responsibly and sustainably, and having a positive impact on the communities in which we operate.”\n\nThis is the second consecutive year that Western Digital has earned this recognition. In 2020, 132 honorees were recognized in 21 countries and 51 industries. Honorees are measured by a variety of criteria related to culture, environmental and social practices, ethics and compliance activities, governance, diversity and initiatives to support a strong value chain. The process serves as an operating framework to capture and codify the leading practices of organizations across industries and around the globe. All companies that participate in the assessment process receive an Analytical Scorecard providing them a holistic assessment of where their programs stand against the demanding standards of leading companies.\n\n“Congratulations to Western Digital for once again being named as one of the World’s Most Ethical Companies,” said Ethisphere’s Chief Executive Officer, Timothy Erblich. “This recognition honors outstanding companies like Western Digital who excel in driving a company culture of integrity and who are taking a leadership role in shaping tomorrow’s ethics and sustainability business practices.”\n\nThe full list of the 2020 World's Most Ethical Companies can be found at: https://worldsmostethicalcompanies.com/honorees.\n\nTo learn more about Western Digital’s corporate responsibility and sustainability practices, view the company’s 2018 Corporate Responsibility and Sustainability Report here: https://www.westerndigital.com/company/corporate-sustainability\n\nStay connected to Western Digital:\n\nTwitter, LinkedIn, Blog, Facebook, YouTube\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved. Western Digital, the Western Digital logo, G-Technology, SanDisk, and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200225005086/en/\nLaura Bakken\nCorporate Media Relations:\n+1 408.801.7653\nlaura.bakken@wdc.com\n\nPeter Andrew\nInvestor Relations\n+1 949.672.9655\npeter.andrew@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital OpenFlex™ NVMe-oF™ Device Selected as a Product of the Year by Storage Magazine",
        "subtitle": "",
        "date": "Feb 20, 2020 3:13PM EST",
        "content": "\nTechTarget Editors Designate OpenFlex F3100 Series Fabric Device as “Most Composable,” Lone NVMe-oF Product of the Year Award Winner Takes Silver in HCI and Composable Infrastructures Category\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital (NASDAQ: WDC) has been selected as one of the winners of Storage Magazine’s prestigious Products of the Year Awards for 2019. The company’s OpenFlex F3100 Series Fabric Device was recognized as “groundbreaking” and “the most composable” product in the Hyperconverged (HCI) and Composable Infrastructures category, highlighting impressive performance and density, innovative hardware design and open API. According to TechTarget editors, the OpenFlex F3100 “offers a look at what is, perhaps, the future of hyperconvergence by disaggregating storage from servers over NVMe-oF.”\n\nNow in its 18th year, the enterprise data storage Products of the Year Awards compare the best technology hardware, software and services offerings available across five categories. TechTarget’s expert panel of analysts, consultants and end users judged this year’s entrants based on technological innovation, performance, ease of integration into enterprise IT environments, ease of use and manageability, functionality and value.\n\nProducts that were selected for the HCI and Composable Infrastructures category included solutions that combine storage, compute and virtualization resources for management as a single system through a common tool set. Composable systems and software that use a unifying API to disaggregate and manage shared pools of physical resources also qualified.\n\nAs described by judges, “OpenFlex's disaggregated architecture embraces open source to scale across public and private clouds. Impressive performance and density in a 3U all-flash array, the system is the only NVMe™ over Fabrics (NVMe-oF) award winner in this category. Disaggregating storage from servers by using NVMe-oF will certainly improve storage utilization and performance balancing.” One judge stated that the OpenFlex F3100 was singled out “given how critical NVMe-oF will be to future composable infrastructure designs,” adding that “the support of an open API is also very innovative and makes the adoption of composable infrastructure far more realistic.”\n\nThe OpenFlex platform provides a new architectural approach to software-defined storage (SDS) infrastructure, enabling storage, networking, and compute to be disaggregated into shareable resource pools. Combined with an open standards-based, scalable and easy-to-use Open Composability API, OpenFlex helps IT Managers better provision on the fly with simplified operations, eliminate underutilized resources and reduce TCO by up to 40 percent1 when compared to hyperconverged infrastructure. The OpenFlex F3100 NVMe-oF storage device provides blazing-fast speeds up to 2.1 million IOPS, 11.7 GBps throughput, and latencies less than 48 microseconds. Each fabric-attached device is available in capacities of up to 61TB2, delivering extreme performance over two 50 gigabit Ethernet ports.\n\n“Western Digital is fully committed to driving ecosystem-wide support and adoption of open composable infrastructure, and OpenFlex is the NVMe-oF foundational building block to help enterprises optimize their data storage environments,” said Kurt Chan, vice president and general manager, Data Center Platforms at Western Digital. “It’s a great honor to have OpenFlex among this year’s Products of the Year award winners as it further validates our innovation and efforts to enable open, next-generation IT infrastructures.”\n\nIn addition to the OpenFlex platform, Western Digital’s full data center portfolio includes: Ultrastar® storage servers and storage platforms; Ultrastar memory extension drive; and its family of Ultrastar data center-class HDDs and SSDs.\n\nResources: \n\nBlog: The Next Step in the Evolution of Composability\nData Sheet: OpenFlex F3100 Series Fabric Device\n\nStay connected to Western Digital:\n\nTwitter, LinkedIn, Blog, Facebook, YouTube\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n1Based on internal estimates of utilization efficiencies and component pricing as of July 2018\n2 One GB is equal to one billion bytes and one TB equals 1,000GB (one trillion bytes) when referring to storage capacity. Accessible capacity will vary from the stated capacity due to operating environment.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved. Western Digital, the Western Digital logo, G-Technology, SanDisk, WD, OpenFlex and Ultrastar are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. The NVMe and NVMe-oF word marks are trademarks of NVM Express, Inc. All other marks are the property of their respective owners. Product specifications subject to change without notice. Pictures shown may vary from actual products. Not all products will be available in all regions of the world.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005869/en/\nMatthew Flynn\nWestern Digital Public Relations\n949-672-6750\nmatthew.flynn@wdc.com\n\nPeter Andrew\nWestern Digital Investor Relations\n1-800-695-6399\ninvestor@wdc.com\nSource: Western Digital"
    },
    {
        "title": "Western Digital Powers Mobile Applications in the 5G Era",
        "subtitle": "",
        "date": "Feb 18, 2020 8:00AM EST",
        "content": "\nNew iNAND MC EU521 Features Turbo Sequential Write Speeds of up to 800MB/s; Offers UFS 3.1 JEDEC-compliant Write Booster Storage Technology for Smartphones \n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWith its new Western Digital® iNAND® MC EU521, an embedded Universal Flash Storage (UFS) device, Western Digital Corp. (NASDAQ: WDC) equips mobile developers to enhance the 5G smartphone user experience. An early supporter of JEDEC’s implementation of Write Booster under the UFS 3.1 standard, Western Digital is among the first in the industry to deliver commercial storage solutions optimized for UFS 3.1 5G applications and capabilities.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200218005108/en/The Western Digital iNAND MC EU521 embedded flash device is optimized for UFS 3.1 offering enhanced user experiences for 5G applications and capabilities. (Graphic: Business Wire)\nThe Western Digital iNAND MC EU521 embedded flash device allows mobile developers to take full advantage of UFS 3.1 high-interface bandwidth (Gear 4 / 2 Lanes) as well as SLC (single-level cell) NAND caching. It also offers turbo sequential write speeds up to 800MB/s* to better enable enhanced user experiences for applications such as downloading 4K and 8K media, large file transfers from the cloud, and gaming. The iNAND EU521 will be available in March in 128GB** and 256GB capacities.\n\n“Smartphones now demand more performance and capacity as they often serve as the primary computing device for everything from streaming video, playing music, gaming and photography, to payments and mapping,” said senior vice president and general manager, Huibert Verhoeven, Western Digital’s Automotive, Mobile and Emerging business unit. “The SLC caching in the iNAND EU521 with Write Booster offers users several key performance improvements that when coupled with 5G are expected to bring faster movie downloads than ever before. This, and other capabilities make the EU521 a great option for today’s mobile equipment manufacturers.”\n\n“Western Digital’s implementation of the new JEDEC storage standard, UFS 3.1, provides 5G applications with added write capability and improved caching will help smartphones deliver higher speed downloads, accelerate large file ‘saves’ and support other data-intense applications,” said Craig Stice, senior director, Memory and Storage at Omdia, a global technology research leader, established following the merger of the research brands of Informa Tech (Ovum, Heavy Reading and Tractica) and the acquired IHS Markit technology research portfolio. “Western Digital’s effort to meet the standard quickly is intended to give mobile device equipment manufacturers a market-ready solution to choose from.”***\n\nReferences:\n\n5G Turbo Speeds? We First Need to Remove the Bottlenecks\n\nWestern Digital in Mobile Devices\n\nWestern Digital iNAND storage solutions for smartphones and mobile devices leverage 96-layer 3D NAND and advanced UFS interface technologies to enable an exceptional user experience. This family of commercial, embedded products is designed to maintain high and persistent performance for data-intensive applications such 4K/8K video, augmented reality, virtual reality and AI. The company also offers after-market memory cards, and innovative data backup and charging devices for mobile users.\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved.\n\n*As used for transfer rate, 1 MB/s = 1 million bytes per second. Based on internal testing; performance may vary depending upon host device, usage conditions, drive capacity, and other factors.\n\n** As used for storage capacity, 1GB = 1 billion bytes. Actual user capacity may be less, depending on operating environment.\n\n***Source – Omdia, NAND Memory Intelligence Services, February 2020. Results are not an endorsement of Western Digital. Any reliance on these results is at the third-party’s own risk.\n\nWestern Digital, the Western Digital logo and iNAND are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries. Qualcomm and Snapdragon are registered trademarks of Qualcomm Incorporated. All other marks are the property of their respective owners. Product specifications subject to change without notice. Pictures shown may vary from actual products. Not all products are available in all regions of the world.\n\nForward-Looking Statements\n\nThis news release contains certain forward-looking statements, including the expected availability, benefits, capabilities, capacity, performance, speed and/or other features of the Western Digital® iNAND® MC EU521. There are a number of risks and uncertainties that may cause these forward-looking statements to be inaccurate including, among others: changes to specifications from standards organizations, volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company's filings with the Securities and Exchange Commission (the \"SEC\"), including the company's most recently filed periodic report, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200218005108/en/\nKarin Taylor\nWestern Digital Public Relations\n1-408-717-8869\nkarin.taylor@wdc.com\n\nPeter Andrew\nWestern Digital Investor Relations\n1-800-695-6399\ninvestor@wdc.com\nSource: Western Digital"
    },
    {
        "title": "Western Digital Board Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Feb 13, 2020 4:45PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced that the board of directors declared a quarterly cash dividend of $0.50 per share of common stock (the \"cash dividend\"). The cash dividend will be paid on April 17, 2020, to the company's stockholders of record as of April 3, 2020.\n\nThe amount of future dividends under the company's dividend policy, and the declaration and payment thereof, will be based upon all relevant factors, including the company's financial position, results of operations, cash flows, capital requirements and restrictions under the company's financing documents, and shall be in compliance with applicable law. The board retains the power to modify, suspend or cancel the company's dividend policy in any manner and at any time as it may deem necessary or appropriate in the future.\n\nAbout Western Digital\n\nWestern Digital, a leader in data infrastructure, creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands. Financial and investor information is available on the company's Investor Relations website at investor.wdc.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include statements concerning the company's quarterly dividend. These forward-looking statements are based on management's current expectations and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements, including: volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of restructuring activities and cost saving initiatives; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; the development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, divestitures, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company’s filings with the Securities and Exchange Commission (the “SEC”), including the company’s Form 10-Q filed with the SEC on February 11, 2020, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\n\nWestern Digital, the Western Digital logo, G-Technology, HGST, SanDisk and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200213005919/en/\nWestern Digital Corp.\n\nInvestor Contact:\nT. Peter Andrew\n949-672-9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nMedia Contact:\nJim Pascoe\n408-717-6999\njim.pascoe@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Feb 4, 2020 5:00PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced participation in two upcoming investor conferences:\n\nThe live and archived presentations will be available via webcast on the company’s Investor Relations website at investor.wdc.com.\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved. Western Digital, the Western Digital logo, G-Technology, SanDisk, and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200204005956/en/\nInvestor Relations Contact:\nT. Peter Andrew\nWestern Digital Corp.\n+1-949-672-9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nPress Contact:\nJim Pascoe\nWestern Digital Corp.\n+1-408-717-6999\njim.pascoe@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital Announces Sale of ActiveScale Business to Quantum",
        "subtitle": "",
        "date": "Feb 3, 2020 8:00AM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced that its subsidiary Western Digital Technologies, Inc. has entered into a definitive agreement to sell its ActiveScale™ business to Quantum Corp. (NASDAQ: QMCO), an industry leader in storing and managing video content and unstructured data. Under the agreement, Quantum will acquire Western Digital’s full line of ActiveScale products.\n\nThe announcement follows Western Digital’s announced strategic intent to exit Storage Systems and optimize its Data Center Systems business around Storage Platforms. Western Digital completed the sale of its IntelliFlash™ product lines to DDN last year.\n\n“With their complementary portfolio of software defined solutions and technologies, and established customer base, Quantum is well positioned to build on the ActiveScale systems business,“ said Phil Bullinger, senior vice president & general manager of the Data Center business. “Both Western Digital and Quantum are committed to executing a smooth transition for all stakeholders and ensuring that customers will continue to receive best-in-class service and support.”\n\nThe transaction is expected to close by the end of this quarter, March 31, 2020, subject to the satisfaction of customary closing conditions. Financial terms of the transaction were not disclosed.\n\nAbout Western Digital\n\nWestern Digital, a leader in data infrastructure, creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are marketed under the G-Technology™, SanDisk®, WD®, and the Western Digital® brands.\n\nWestern Digital, the Western Digital logo, G-Technology, SanDisk, WD, and ActiveScale are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. All other marks are the property of their respective owners.\n\nForward-Looking Statements\n\nThis news release contains forward-looking statements that involve risks and uncertainties, including, but not limited to, statements regarding the expected closing and impact of the sale of the ActiveScale business to Quantum, business strategies and growth opportunities, and product and technology portfolio. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved, if at all. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward-looking statements.\n\nKey risks and uncertainties include the possibility that conditions to closing the transaction may not be satisfied, such that the transaction will not close or that the closing may be delayed; volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company's filings with the Securities and Exchange Commission (the \"SEC\") and available on the SEC's website at www.sec.gov, including our most recently filed periodic report, to which your attention is directed. We do not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise, except as required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200203005266/en/\nLaura Bakken\nCorporate Communications\n408.801.7653\nlaura.bakken@wdc.com\n\nPeter Andrew\nInvestor Relations\n949.672.9655\npeter.andrew@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital Announces Financial Results for Second Quarter Fiscal Year 2020",
        "subtitle": "",
        "date": "Jan 30, 2020 4:15PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (Nasdaq: WDC) today reported revenue of $4.2 billion for its second fiscal quarter ended January 3, 2020. Operating income was $50 million with a net loss of $139 million, or ($0.47) per share. Excluding certain non-GAAP adjustments, the company achieved non-GAAP operating income of $333 million and non-GAAP net income of $187 million, or $0.62 per share.\n\nIn the year-ago quarter, the company reported revenue of $4.2 billion, operating income of $176 million and a net loss of $487 million, or ($1.68) per share. Non-GAAP operating income in the year-ago quarter was $589 million and non-GAAP net income was $424 million, or $1.45 per share.\n\nThe company generated $257 million in cash from operations during the second fiscal quarter of 2020, and ended the quarter with $3.1 billion of total cash and cash equivalents. The company returned $149 million to shareholders through dividends and used $388 million to reduce debt. On November 14, 2019, the company declared a cash dividend of $0.50 per share of its common stock, which was paid to shareholders on January 21, 2020.\n\n“The December quarter results reflect strong execution in our product roadmap, success in increasing our hard drive gross margin, and an improving flash market,” said Steve Milligan, chief executive officer, Western Digital. “We expect an accelerated recovery in our flash gross margins, which coupled with ongoing strength in demand for both hard drives and flash, positions us well for continued profitable growth in calendar year 2020.”\n\nBusiness Outlook for Third Fiscal Quarter of 2020\n\n_______________\n\n(1) Non-GAAP gross margin guidance excludes amortization of acquired intangible assets, stock-based compensation expense, and charges related to cost saving initiatives totaling approximately $150 million to $170 million. The company’s non-GAAP operating expenses guidance excludes amortization of acquired intangible assets; stock-based compensation expense; employee termination, asset impairment and other charges; and charges related to cost saving initiatives totaling approximately $100 million to $120 million. The company's non-GAAP interest and other expense guidance excludes approximately $5 million of convertible debt activity. In the aggregate, non-GAAP diluted earnings per share guidance excludes these items totaling $255 million to $295 million. The timing and amount of these charges excluded from non-GAAP gross margin, non-GAAP operating expenses, non-GAAP interest and other expense, net and non-GAAP diluted earnings per share cannot be further allocated or quantified with certainty. Additionally, the timing and amount of additional charges the company excludes from its non-GAAP tax rate and non-GAAP diluted earnings per share are dependent on the timing and determination of certain actions and cannot be reasonably predicted. Accordingly, full reconciliations of non-GAAP gross margin, non-GAAP operating expenses, non-GAAP interest and other expense, non-GAAP tax rate and non-GAAP diluted earnings per share to the most directly comparable GAAP financial measures (gross margin, operating expenses, interest and other expense, tax rate and diluted earnings per share, respectively) are not available without unreasonable effort.\n\n(2) The non-GAAP tax rates provided are based on a percentage of non-GAAP pre-tax income.\n\nInvestor Communications\n\nThe investment community conference call to discuss these results and the company’s business outlook for the third fiscal quarter of 2020 will be broadcast live online today at 2:00 p.m. Pacific/5:00 p.m. Eastern. The live and archived conference call/webcast and the earnings presentation can be accessed online at investor.wdc.com.\n\nAbout Western Digital\n\nWestern Digital, a leader in data infrastructure, creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, the company's industry-leading solutions deliver the possibilities of data. Western Digital data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands. Financial and investor information is available on the company's Investor Relations website at investor.wdc.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements concerning the company’s preliminary financial results for its second fiscal quarter ended January 3, 2020; the company’s business outlook for the third fiscal quarter of 2020; expectations regarding market conditions; the company's product portfolio; and our expected future financial performance. These forward-looking statements are based on management’s current expectations and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements. The preliminary financial results for the company’s second fiscal quarter ended January 3, 2020 included in this press release represent the most current information available to management. The company’s actual results when disclosed in its Form 10-Q may differ from these preliminary results as a result of the completion of the company’s financial closing procedures; final adjustments; completion of the review by the company’s independent registered accounting firm; and other developments that may arise between now and the disclosure of the final results. Other risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements include: volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of restructuring activities and cost saving initiatives; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, divestitures, mergers and joint ventures; difficulties or delays in manufacturing; the outcome of legal proceedings; and other risks and uncertainties listed in the company’s filings with the Securities and Exchange Commission (the “SEC”), including the company’s Form 10-Q filed with the SEC on November 12, 2019, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect new information or events.\n\nWestern Digital, the Western Digital logo, G-Technology, SanDisk and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries.\n\nTo supplement the condensed consolidated financial statements presented in accordance with U.S. generally accepted accounting principles (“GAAP”), the table above sets forth non-GAAP cost of revenue; non-GAAP gross profit; non-GAAP operating expenses; non-GAAP operating income; non-GAAP interest and other expense, net; non-GAAP income tax expense; non-GAAP net income; and non-GAAP diluted income per common share (“Non-GAAP measures”). These Non-GAAP measures are not in accordance with, or an alternative for, measures prepared in accordance with GAAP and may be different from Non-GAAP measures used by other companies. The company believes the presentation of these Non-GAAP measures, when shown in conjunction with the corresponding GAAP measures, provides useful information to investors for measuring the company’s earnings performance and comparing it against prior periods. Specifically, the company believes these Non-GAAP measures provide useful information to both management and investors as they exclude certain expenses, gains and losses that the company believes are not indicative of its core operating results or because they are consistent with the financial models and estimates published by many analysts who follow the company and its peers. As discussed further below, these Non-GAAP measures exclude the amortization of acquired intangible assets, stock-based compensation expense, employee termination, asset impairment and other charges, charges related to acquisitions and dispositions, charges related to cost saving initiatives, manufacturing underutilization charges, power outage charges, convertible debt activity, other adjustments, and income tax adjustments, and the company believes these measures along with the related reconciliations to the GAAP measures provide additional detail and comparability for assessing the company's results. These Non-GAAP measures are some of the primary indicators management uses for assessing the company's performance and planning and forecasting future periods. These measures should be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for, or superior to, GAAP results.\n\nAs described above, the company excludes the following items from its Non-GAAP measures:\n\nAmortization of acquired intangible assets. The company incurs expenses from the amortization of acquired intangible assets over their economic lives. Such charges are significantly impacted by the timing and magnitude of the company's acquisitions and any related impairment charges.\n\nStock-based compensation expense. Because of the variety of equity awards used by companies, the varying methodologies for determining stock-based compensation expense, the subjective assumptions involved in those determinations, and the volatility in valuations that can be driven by market conditions outside the company's control, the company believes excluding stock-based compensation expense enhances the ability of management and investors to understand and assess the underlying performance of its business over time and compare it against the company's peers, a majority of whom also exclude stock-based compensation expense from their non-GAAP results.\n\nEmployee termination, asset impairment and other charges. From time-to-time, in order to realign the company's operations with anticipated market demand or to achieve cost synergies from the integration of acquisitions, the company may terminate employees and/or restructure its operations. From time-to-time, the company may also incur charges from the impairment of intangible assets and other long-lived assets. These charges (including any reversals of charges recorded in prior periods) are inconsistent in amount and frequency, and the company believes are not indicative of the underlying performance of its business.\n\nCharges related to acquisitions and dispositions. In connection with the company's business combinations or dispositions, the company incurs expenses which it would not have otherwise incurred as part of its business operations. These expenses include third-party professional service and legal fees, third-party integration services, severance costs, non-cash adjustments to the fair value of acquired inventory, contract termination costs, and retention bonuses. The company may also experience other accounting impacts in connection with these transactions. These charges and impacts are related to acquisitions and dispositions, are inconsistent in amount and frequency, and the company believes are not indicative of the underlying performance of its business.\n\nCharges related to cost saving initiatives. In connection with the transformation of the company's business, the company has incurred charges related to cost saving initiatives which do not qualify for special accounting treatment as exit or disposal activities. These charges, which the company believes are not indicative of the underlying performance of its business, primarily relate to costs associated with rationalizing the company's channel partners or vendors, transforming the company's information systems infrastructure, integrating the company's product roadmap, and accelerated depreciation of assets.\n\nManufacturing underutilization charges. In response to flash business conditions, the company temporarily reduced its wafer starts during fiscal 2019 at its flash-based memory manufacturing facilities operated through its strategic partnership with Kioxia Corporation. The temporary abnormal reduction in output resulted in flash manufacturing underutilization charges which were expensed as incurred. These charges are inconsistent in amount and frequency, and the company believes these charges are not part of the ongoing operation of its business.\n\nPower outage charges. In June 2019, an unexpected power outage incident occurred at the flash-based memory manufacturing facilities operated through the company's strategic partnership with Kioxia Corporation in Yokkaichi, Japan. The power outage incident resulted in the write-off of damaged inventory and unabsorbed manufacturing overhead costs which are expensed as incurred. These charges are inconsistent in amount and frequency, and the company believes these charges are not part of the ongoing production operation of its business.\n\nConvertible debt activity. The company excludes non-cash economic interest expense associated with its convertible notes. These charges do not reflect the company's operating results, and the company believes are not indicative of the underlying performance of its business.\n\nOther adjustments. From time-to-time, the company sells or impairs investments or other assets which are not considered necessary to its business operations, or incurs other charges or gains that the company believes are not a part of the ongoing operation of its business. The resulting expense or benefit is inconsistent in amount and frequency.\n\nIncome tax adjustments. Income tax adjustments include the difference between income taxes based on a forecasted annual non-GAAP tax rate and a forecasted annual GAAP tax rate as a result of the timing of certain non-GAAP pre-tax adjustments. The income tax adjustments include the company’s final adjustments for the tax effects of the Tax Cuts and Jobs Act allowed within the one-year measurement period that ended on December 22, 2018, as well as estimates related to the current status of the rules and regulations governing the transition to the Tax Cuts and Jobs Act. These adjustments are excluded because they are infrequent and the company believes that they are not indicative of the underlying performance of its business.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005777/en/\nWestern Digital Corp.\n\nInvestor Contact:\nT. Peter Andrew\n949.672.9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nMedia Contact:\nJim Pascoe\n408.717.6999\njim.pascoe@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital Extends Storage Leadership With BiCS5 3D NAND Technology",
        "subtitle": "",
        "date": "Jan 30, 2020 4:05PM EST",
        "content": "\nTechnology and Manufacturing Advancements Enable New Approach to 3D NAND Scaling\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced that it has successfully developed its fifth-generation 3D NAND technology, BiCS5, continuing the company’s leadership in delivering the industry’s most advanced flash memory technologies. BiCS5, built on triple-level-cell (TLC) and quad-level-cell (QLC) technologies, delivers exceptional capacity, performance and reliability at a compelling cost. This makes it ideal to address the exponential growth of data associated with connected cars, mobile devices and artificial intelligence.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200130005821/en/WESTERN DIGITAL EXTENDS STORAGE LEADERSHIP WITH BiCS5 3D NAND TECHNOLOGY (Photo: Business Wire)\nWestern Digital has commenced initial production of BiCS5 TLC in a 512-gigabit (Gb) chip and is currently shipping consumer products built on the new technology. Production of BiCS5 in meaningful commercial volumes is expected in the second half of calendar 2020. BiCS5 TLC and BiCS5 QLC will be available in a range of capacities, including 1.33 terabit (Tb).***\n\n“As we move into the next decade, a new approach to 3D NAND scaling is critical to continuing to meet the demands of the rising volume and velocity of data,” said Dr. Steve Paak, senior vice president of memory technology and manufacturing at Western Digital. “Our successful production of BiCS5 is an illustration of Western Digital’s ongoing leadership in flash memory technology and strong execution to our roadmap. By leveraging new advancements to our multi-tier memory hole technology to increase density laterally as well as adding more storage layers, we have significantly scaled the capacity and performance of our 3D NAND technology, while continuing to deliver the reliability and cost which our customers expect.”\n\nBuilt utilizing a wide range of new technology and manufacturing innovations, BiCS5 is Western Digital’s highest density and most advanced 3D NAND technology to date. Second-generation multi-tier memory hole technology, improved engineering processes and other 3D NAND cell enhancements significantly increase cell array density horizontally across the wafer. These “lateral scaling” advancements in combination with 112 layers of vertical memory capability enables BiCS5 to offer up to 40 percent* more bits of storage capacity per wafer compared to Western Digital’s 96-layer BiCS4 technology, while optimizing cost. New design enhancements also accelerate performance, enabling BiCS5 to offer up to 50 percent faster I/O performance compared to BiCS4.**\n\nBiCS5 technology was developed jointly with technology and manufacturing partner Kioxia Corporation. It will be manufactured at the joint venture fabrication facilities in Yokkaichi in Mie Prefecture, Japan and Kitakami City, Iwate Prefecture, Japan.\n\nThe introduction of BiCS5 technology builds on a full portfolio of Western Digital 3D NAND technologies for use in data-centric personal electronics, smartphones, IoT devices and data centers.\n\nStay connected to Western Digital:\nTwitter, LinkedIn, Blog, Facebook, YouTube\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved. Western Digital, the Western Digital logo, G-Technology, SanDisk, and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. All other marks are the property of their respective owners.\n\n*Based on Western Digital BiCS4 and BiCS5 TLC lowest available and expected-available capacity dies (256Gb and 512Gb die)\n**Based on Western Digital internal testing of I/O performance in toggle mode for select applications\n***1 Terabit (Tb) = 1,000,000,000,000 bits\n\nForward-Looking Statements \n\nThis news release contains certain forward-looking statements, including expectations for 3D NAND technology, including its development, timing for initial output, commercial volume production, product sampling and shipment, capabilities, performance improvements, applications, capacities, Western Digital’s position in NAND flash and execution to its technology roadmap and operations at its joint venture manufacturing facilities in Japan. There are a number of risks and uncertainties that may cause these forward-looking statements to be inaccurate including, among others: volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, divestitures, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company's filings with the Securities and Exchange Commission, including the company's most recently filed periodic report, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005821/en/\nLaura Bakken\nMedia Relations:\n+1 408.801.7653\nlaura.bakken@wdc.com\n\nPeter Andrew\nInvestor Relations\n+1 949.672.9655\npeter.andrew@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital to Announce Second Quarter Financial Results on January 30, 2020",
        "subtitle": "",
        "date": "Jan 9, 2020 4:45PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) plans to announce financial results for its second quarter of fiscal 2020 after the market closes on Thursday, January 30, 2020. The investment community conference call to discuss these results will be held that day at 2:00 p.m. Pacific / 5:00 p.m. Eastern. A live broadcast and a webcast replay of the conference call will be available at investor.wdc.com.\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved.\n\nWestern Digital, the Western Digital logo, G-Technology, SanDisk, and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200109005732/en/\nInvestor Relations Contact:\nT. Peter Andrew\nWestern Digital Corp.\n+1-949-672-9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nMedia Relations Contact:\nJim Pascoe\nWestern Digital Corp.\n+1-408-717-6999\njim.pascoe@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital Brings Innovations to CES 2020 With Demo of Industry-First 8TB SuperSpeed USB 20Gbps Portable SSD Prototype",
        "subtitle": "",
        "date": "Jan 6, 2020 9:00PM EST",
        "content": "    LAS VEGAS--(BUSINESS WIRE)--\nAt the Consumer Electronics Show 2020 (CES® 2020) Western Digital Corporation (NASDAQ: WDC) will showcase new innovations in its extensive lineup of storage solutions built for every consumer use, including a demonstration of the world’s highest capacity, pocket-sized, portable SSD prototype featuring a SuperSpeed USB 20Gbps interface. The company is also releasing the 1TB* SanDisk Ultra® Dual Drive Luxe USB Type-C™ drive for smartphones and laptops.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20200106005229/en/Groundbreaking SanDisk 8TB SSD Prototype (Photo: Business Wire)\nWestern Digital’s unmatched portfolio offers a range of storage solutions for everything from mobile to highly specialized performance drives. At CES 2020, Western Digital will show its consumer storage solutions from its G-Technology™, SanDisk®, WD® and Western Digital® brands. Highlights include:\n\nGroundbreaking SanDisk 8TB SSD Prototype\n\nContinuing its legacy of technology milestones, the company will demonstrate the world’s highest capacity, pocket-sized SuperSpeed USB 20Gbps portable SSD. Inspired by consumers’ desire to capture rich content and keep it with them, Western Digital continues to push the boundaries of what’s possible with an 8TB SSD prototype. Combining its expertise in flash memory with skillful design, the company continues to be at the forefront of developing revolutionary solutions that keep up with and surpass today’s consumer needs. Western Digital will also showcase its extensive lineup of portable SSDs available today.\n\nAll-New 1TB SanDisk Ultra® Dual Drive Luxe USB Type-C\n\nLaunching at CES, the SanDisk brand will release its newest dual connector drive that works with the latest USB Type-C smartphones and laptops.1\n\nIndustry-First WD_Black® P50 Game Drive SSD with SuperSpeed USB 20Gbps\n\nThe WD_Black portfolio provides the performance, capacity and reliability that allow PC and console gamers to drive their game and play without limits. Five gaming solutions from the WD_Black lineup will be shown, including:\n\nibi™ a SanDisk brand device for photos and videos\n\nibi is a smart photo management device from SanDisk that offers consumers local storage that works like a personal cloud for photos and videos. Features include:\n\n“Consumers are generating more content than ever and require more advanced solutions to help them capture, access, share and manage it all. Our top priority is to empower people by giving them complete control of their content, so they have peace of mind that it’s reliably stored and at their fingertips when and where they need it,” said David Ellis, vice president, product marketing, Western Digital.\n\nFor more information, visit our websites: WD, WD_Black and SanDisk.\n\n*As used for storage capacity, 1GB = 1,000,000,000 bytes and 1TB = 1,000,000,000,000 bytes. Actual user capacity may be less, depending on operating environment.\n\n**Available for a limited time. See product packaging for full details.\n\n1 Mobile device requires USB Type-C port and On-The-Go (OTG) support. See www.sandisk.com/dualdrive-c for list of compatible devices.\n\n2 Social Media or Cloud account registration may be required. Social Media and Cloud services may be changed, terminated or interrupted at any time and may vary by country.\n\n3 Based on a 13.75 MP, JPEG image with an average file size of 3.5MB. Examples of the number of photos that can be stored are provided for illustrative purposes only. Your results will vary based on resolution, content, file compression, file format, file size, host device, pre-loaded files, settings, software and other factors.\n\n4 The number of hours for videos is based on the 1920*1080 Full HD @ 30fps, 145MB/min, DV format. Examples of the hours of video that can be stored are provided for illustrative purposes only. Your results will vary based on bit rate, content, file compression, file format, file size, host device, pre-loaded files, resolution, settings, software and other factors.\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital, G-Technology, SanDisk, and WD brands.\n\n© 2020 Western Digital Corporation or its affiliates. All rights reserved.\n\nWestern Digital, the Western Digital logo, G-Technology, the G-Technology logo, SanDisk, the SanDisk logo, WD, the WD logo, ibi, SanDisk Ultra and WD_BLACK are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries. USB Type-C and USB-C are trademarks of USB Implementers Forum. All other marks are the property of their respective owners. Product specifications subject to change without notice. Pictures shown may vary from actual products. Not all products are available in all regions of the world.\n\nWestern Digital Technologies, Inc. is the seller of record and licensee in the Americas of SanDisk® products.\n\nForward-Looking Statements\n\nThis news release contains certain forward-looking statements, including the expected availability, benefits, capabilities, capacity, performance, speed and/or other features of the SanDisk Ultra® Dual Drive Luxe USB Type-C™ and SanDisk 8TB portable SSD prototype. There are a number of risks and uncertainties that may cause these forward-looking statements to be inaccurate including, among others: changes to specifications from standards organizations, volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company's filings with the Securities and Exchange Commission (the \"SEC\"), including the company's most recently filed periodic report, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005229/en/\nInvestor Contact:\nT. Peter Andrew\n+1 (949) 672-9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nMedia Contact:\nJoanna Andrade\n+1 (408) 801-1792\njoanna.andrade@wdc.com\nSource: Western Digital"
    },
    {
        "title": "Western Digital Now Sampling World’s First 20TB SMR and 18TB CMR Hard Disk Drives",
        "subtitle": "",
        "date": "Dec 20, 2019 1:30PM EST",
        "content": "\nCompany Continues its Leadership in High-Capacity Enterprise HDDs, Delivering Unprecedented TCO Value, Enabling Customers to Efficiently Scale their Data Centers for the Zettabyte Age \n\nNews Highlights: \n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital (NASDAQ: WDC) announced that it has started shipping the industry’s highest-capacity HDD samples to enterprise OEMs and hyperscale customers worldwide. The 20TB Ultrastar DC HC650 SMR HDDs and 18TB Ultrastar DC HC550 CMR HDDs, first previewed in June 2019, and announced in September 2019, feature its first-ever commercial implementation of energy-assisted magnetic recording technology on a nine-disk platform, enabling customers to more efficiently provision and scale their data center environments with unmatched total cost of ownership.\n\nWith zettabyte-scale data growth, the need for higher-capacity data storage across a broad spectrum of applications and workloads can be reliably met only with high Capacity Enterprise HDDs. The industry-leading capacities of Western Digital’s Ultrastar 20TB SMR and 18TB CMR HelioSeal HDDs enable customers to deploy up to 22 percent fewer racks and reduce their TCO by up to 11 percent, along with the corresponding reductions in power consumption, cooling costs, and data center infrastructure needs when compared with today’s 14TB CMR HDDs.1\n\nWestern Digital achieves the industry’s highest areal density performance in these drives through the innovative use of energy-assisted magnetic recording. Together with the company’s HelioSeal and SMR technologies, triple-stage micro actuation and 9-disk platform, the energy-assisted recording technology provides an integrated solution, resulting in the dramatic gain in drive capacities.\n\n“The market outlook for capacity-optimized enterprise HDDs remains very positive as IDC expects petabytes shipped to hyperscale cloud data centers and for OEM storage systems and servers to grow at a combined compound annual growth rate of 28% through 2023,” said Ed Burns, Research Director, HDD and Storage Technologies at IDC. “Western Digital’s new 20TB and 18TB HDDs should make a compelling case for customers to transition to higher capacity points as they seek greater storage and energy efficiencies in the near-term while building more cost-effective and scalable infrastructures for the future.”\n\n“Delivering samples of our Ultrastar 20TB SMR and 18TB CMR HDDs marks a significant milestone for Western Digital—demonstrating our enduring commitment to the open SMR-based ecosystem, as well as our strong track record of innovation to provide great value for our customers,” said Phil Bullinger, senior vice president and general manager of Western Digital’s Data Center Business Unit. “These new HDDs deliver unsurpassed capacity and are our first to leverage energy-assisted magnetic recording technology, enabling new levels of data center efficiency and driving value creation from data at scale.”\n\nAvailability\n\nWestern Digital is now sampling the 20TB Ultrastar DC HC650 SMR HDD and the 18TB Ultrastar DC HC550 CMR HDD, with qualification and volume shipments expected in the first half of 2020.\n\nResources: \n\nSMR: What we learned in our first year\nOne Year Later…Dropbox Continues to Innovate with Western Digital\n\nStay connected to Western Digital:\n\nTwitter, LinkedIn, Blog, Facebook, YouTube\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk®, and WD® brands.\n\n1TCO savings based on Western Digital calculations of typical system component and operations costs of a 4U 100 HDD system as of 12/2019.\n\nAs used for storage capacity, one terabyte (TB) = 1,000,000,000,000 bytes. Accessible capacity may be less depending on operating environment.\n\n© 2019 Western Digital Corporation or its affiliates. All rights reserved.\n\nWestern Digital, the Western Digital logo, G-Technology, SanDisk, WD, HelioSeal, and Ultrastar are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. All other marks are the property of their respective owners. Product specifications subject to change without notice. Pictures shown may vary from actual products. Not all products will be available in all regions of the world.\n\nForward-Looking Statements\n\nThis news release contains forward-looking statements that involve risks and uncertainties, including, but not limited to, statements regarding market positioning; product features, cost and availability; and market trends. Forward-looking statements should not be read as a guarantee of future results, and will not necessarily be accurate indications of the times at, or by, which such results will be achieved, if at all. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those expressed in or suggested by the forward-looking statements.\n\nKey risks and uncertainties include volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company’s filings with the Securities and Exchange Commission (the “SEC”) and available on the SEC’s website at www.sec.gov, including our most recently filed periodic report, to which your attention is directed. We do not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise, except as required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191220005512/en/\nCompany contacts:\nErin Hartin\nWestern Digital Public Relations\n303-601-8035\nerin.hartin@wdc.com\n\nPeter Andrew\nWestern Digital Investor Relations\n1-800-695-6399\ninvestor@wdc.com\nSource: Western Digital"
    },
    {
        "title": "Thinking about trading options or stock in Adobe, Boeing, Roku, Verizon, or Western Digital?",
        "subtitle": "",
        "date": "Dec 16, 2019 9:31AM EST",
        "content": " NEW YORK, Dec. 16, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for ADBE, BA, ROKU, VZ, and WDC.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.)  View original content:http://www.prnewswire.com/news-releases/thinking-about-trading-options-or-stock-in-adobe-boeing-roku-verizon-or-western-digital-300975278.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Western Digital’s WD Blue SN550 NVMe SSD Can Deliver up to 4x the Speed of SATA SSD for Tech Savvy Professionals",
        "subtitle": "",
        "date": "Dec 10, 2019 8:00AM EST",
        "content": "\nNext-Generation NVMe SSD Helps Achieve Optimal Performance and Accessibility to Content Creators and PC Enthusiasts \n\nStory Highlights\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) is capable of delivering up to four times the speed of SATA SSDs with the new WD Blue SN550 NVMe SSD. The newest member of the award-winning WD Blue portfolio, as well as another performance-focused NVMe SSD, the new drive is purpose-built for content creators and PC users, allowing them to boot faster and work smarter.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20191210005101/en/Introducing Western Digital's WD Blue SN550 NVMe SSD for Computing (Graphic: Business Wire)\nSupports the Four Core Storage Demands\n\nToday’s content creators use data storage at ever-increasing rates. Whether it’s working with 4K/8K video, large document files or storage-intensive applications, these digital environments demand reliable performance, durability, speed, and capacity that the NVMe interface can deliver. According to Forward Insights, NVMe is forecast to account for more than 75 percent of the storage shipped in the PC segment by 2021.1 Leveraging the proven reliability of Western Digital’s NVMe product portfolio, the WD Blue SN550 NVMe SSD is built to address these four core demands, transforming them from pain points to creative productivity.\n\n“Taking an NVMe-first approach can speed up system performance tremendously. This translates to less time waiting on data, so creators can work smarter, not harder, to increase both output and potential income,” said Eric Spanneut, vice president and general manager, Client Business Unit, Western Digital.\n\n“The WD Blue SN550 is a great option for customers looking for an all-NVMe portfolio. For a system builder, it means Western Digital delivers a full portfolio of NVMe and SATA SSDs, as well as high-capacity hard drives. This gives them immense flexibility to build systems for our customers’ varying needs.”\n\nPowerful Internal Speeds to Do More, Faster\n\nWhether working, creating, casual gaming or processing large amounts of data, the WD Blue SN550 NVMe SSD can deliver over four times the speed of Western Digital’s fastest SATA drives. With boosted internal speeds, this brings a better overall computing experience for multitaskers and resource-heavy application users who want a fast and responsive system to tackle tough workloads. In addition, an upgraded thermal design enables ultra-responsive PC performance and sustained performance during intense use.\n\nWD Blue SN550 NVMe SSD Specs and Availability\n\nAbout Western Digital \n\nWestern Digital creates environments for data to thrive. As a leader in data infrastructure, the company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Western Digital data-centric solutions are comprised of the Western Digital®, G-Technology™, SanDisk® and WD® brands.\n\nWestern Digital, the Western Digital logo, G-Technology, SanDisk, WD, WD Black, and WD Blue are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries. The NVMe word mark is a trademark of NVM Express, Inc. All other trademarks are the property of their respective owners. Product specifications subject to change without notice. Pictures shown may vary from actual products. Not all products are available in all regions of the world.\n\n© 2019 Western Digital Corporation or its affiliates. All rights reserved\n\nForward-Looking Statements\n\nThis news release contains certain forward-looking statements, including the availability, benefits, capabilities, capacity, performance and/or other features of the WD Blue and WD Black branded products. There are a number of risks and uncertainties that may cause these forward-looking statements to be inaccurate including, among others: changes to specifications from standards organizations, volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company's filings with the Securities and Exchange Commission (the \"SEC\"), including the company's most recently filed periodic report, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\n\n1 SSD Insights Q419” report # FI-NFL-SSD-Q419, November 2019\n\n*As used for storage capacity, 1GB = 1 billion bytes and 1TB = one trillion bytes. Actual user capacity may be less, depending on operating environment.\n\n**Based on read speed, unless otherwise specified. As used for transfer rate, 1 MB/s = one million bytes per second. Based on internal testing; performance may vary depending on host device, usage conditions, drive capacity, and other factors.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191210005101/en/\nCompany contacts:\nT. Peter Andrew\nWestern Digital Corporation\nInvestor Relations\n949.672.9655\npeter.andrew@wdc.com\n\nHeather Davis\nWestern Digital Corporation\nPublic Relations\n949.672.7920\nheather.davis@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "DDN Recognized by IDC as Fastest Growing Supplier of All-Flash Arrays",
        "subtitle": "DDN is Positioned as a Storage Market Leader Heading into 2020, Demonstrated by Superlative Growth and Ranking by Coldago Research",
        "date": "Dec 5, 2019 3:15AM EST",
        "content": "SANTA CLARA, Calif., Dec. 5, 2019 /PRNewswire/ -- DDN®, the global leader in artificial intelligence (AI) and multicloud data management, today announced that it has leaped into the rankings of major all-flash array vendors as tracked by IDC, a leading global analyst firm, over the first half of 2019. Through organic growth, investment in recent acquisitions and the closing of the transaction with Western Digital (NASDAQ: WDC) for the IntelliFlash™ business unit, DDN built an all-flash array portfolio which grew at a much larger percentage (78.7%) than rivals such as Dell Technologies, NetApp, Pure Storage and IBM. Organizations are increasingly looking for easy-to-use, robust and highly scalable data management solutions, that can be flexibly deployed in multicloud environments and deliver faster insight while maximizing the value of their complex distributed data. To address the emergence of AI and Deep Learning, the move to multicloud and the need for real-time business insights that rely on vast amounts of data, DDN has created a portfolio ready to deliver best-in-class AI-enabled data management solutions across analytics, IoT, multicloud, and virtualized environments.This completeness of vision, coupled with a strong history of execution, is validated by Coldago Research's File Storage Map, placing DDN as a leader in the market. Coldago has identified the convergence of HPC and enterprise file sharing, the rise of parallelism to address IO bottlenecks, and the adoption of technologies like NVMe, as key factors affecting the file storage market. In addition, the research firm identified integrated data management as a key capability going forward.\"In the pursuit of digital modernization, many of our customers are facing a future that appears more complex and difficult to manage, especially in unpredictable multicloud deployments,\" said Alex Bouzari, CEO and co-founder, DDN. \"It is increasingly critical for organizations to connect the right data to the right compute over the right interface at the right time. Our products and services are engineered to excel across all platforms and all providers, simultaneously. No one else in the marketplace delivers such a degree of data management freedom, flexibility and scalability.\"Over the past 18 months, DDN has delivered an AI infrastructure architecture with its A3I™ platforms, reinvigorated the Tintri® business unit, integrated the Nexenta® software defined storage offerings and completed the acquisition of IntelliFlash. The latter three offerings will be the foundation for DDN's Enterprise division. Combined, the DDN family of companies is the premier provider of AI and Data Management software and hardware solutions, spanning edge to core for intensive workloads such as AI, Big Data and IoT, while being platform and vendor agnostic, and fully enabling to private and multiple public clouds deployment models.About DDN  DataDirect Networks (DDN) is the world's leading big data storage supplier to data-intensive, global organizations. For more than 20 years, DDN has designed, developed, deployed and optimized systems, software and storage solutions that enable enterprises, service providers, universities and government agencies to generate more value and to accelerate time to insight from their data and information, on premise and in the cloud. Organizations leverage the power of DDN storage technology and the deep technical expertise of its team to capture, store, process, analyze, collaborate and distribute data, information and content at the largest scale in the most efficient, reliable and cost-effective manner. DDN customers include many of the world's leading financial services firms and banks, healthcare and life science organizations, manufacturing and energy companies, government and research facilities, and web and cloud service providers.For For more information, follow us on twitter: @ddn_limitless, go to ddn.com or call 1-800-837-2298.Contact:Press Relations at DDNpr@ddn.com Walt & Company, on behalf of DDNSharon Sumrit, 408.369.7200 x2981ddn@walt.com ©2019 All rights reserved. A3I, DDN, IntelliFlash, Nexenta, Tintri are trademarks owned by DataDirect Networks. All other trademarks are the property of their respective owners.    View original content to download multimedia:http://www.prnewswire.com/news-releases/ddn-recognized-by-idc-as-fastest-growing-supplier-of-all-flash-arrays-300969703.htmlSOURCE  DataDirect Networks (DDN)"
    },
    {
        "title": "Thinking about buying stock in Intel, Microsoft, Charles Schwab, Western Digital, or Wells Fargo?",
        "subtitle": "",
        "date": "Nov 21, 2019 9:31AM EST",
        "content": "NEW YORK, Nov. 21, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for INTC, MSFT, SCHW, WDC, and WFC.To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting the corresponding link.(Note: You may have to copy this link into your browser then press the [ENTER] key.)InvestorsObserver's PriceWatch Alerts are based on our proprietary scoring methodology. Each stock is evaluated based on short-term technical, long-term technical and fundamental factors. Each of those scores is then combined into an overall score that determines a stock's overall suitability for investment.  View original content:http://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-intel-microsoft-charles-schwab-western-digital-or-wells-fargo-300963025.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "DDN Completes Acquisition of Western Digital's IntelliFlash NVMe, Hybrid Flash and Predictive Analytics Enterprise Business Unit",
        "subtitle": "Strategic Acquisition Adds AI-Enabled High Performance NVMe, Virtualized and Hybrid Flash Technology to DDN's Enterprise Offerings, Enhanced by Partnership with Western Digital",
        "date": "Nov 20, 2019 3:01AM EST",
        "content": "SANTA CLARA, Calif., Nov. 20, 2019 /PRNewswire/ -- DDN®, the global leader in artificial intelligence (AI) and multicloud data management, today announced that it has completed its acquisition of the IntelliFlashTM business from Western Digital Corp. (NASDAQ: WDC). The acquisition of IntelliFlash expands DDN's portfolio of intelligent infrastructure offerings for the enterprise with best-in-class NVMe flash solutions and highly versatile hybrid storage arrays, backed by an industry leading AI-enabled, predictive analytics platform. With IntelliFlash, DDN extends its market leadership in end-to-end data management solutions and enables enterprises to solve their most demanding data center requirements across AI, analytics, IoT, multicloud, and virtualized environments.  \"IntelliFlash adds the most powerful and versatile NVMe, hybrid flash and predictive analytics platform in the industry to DDN's market leading enterprise storage offering for virtualized environments, IoT and data at scale requirements,\" said Alex Bouzari, CEO and co-founder, DDN. \"Our customers can truly enhance the value and simplify the management of their data in the multicloud with insight, ease of use and flexibility across the broadest range of platforms, applications and environments.\"  The acquisition of IntelliFlash adds more than 1,700 customers and partners, seven years of flash storage innovation, a strong patent portfolio and a great engineering and global go-to-market team to DDN's Enterprise Division. With today's enterprise and cloud-scale data initiatives, it is essential for IT infrastructures to deliver ease of management, high performance, flexibility and stability to meet and exceed digital modernization demands. DDN's enterprise business unit now combines IntelliFlash, Tintri's market leading virtualized storage offerings and Nextenta's IoT and telco offerings, thereby fully addressing the widest range of data management enterprise needs.\"I am excited to have the IntelliFlash organization join the DDN Enterprise family. Both the people, as well as the technology, are a natural fit for our organization and now provide us a broader set of offerings that will further enhance our intelligent infrastructure portfolio for enterprise customers,\" said Tom Ellery, general manager and senior vice president of field operations, Tintri by DDN. \"As we combine the organization, we are eager to engage with the entire IntelliFlash community of customers and partners. The opportunity to become more intimate with their business challenges and share our vision of how intelligent infrastructure is fundamentally changing all operational aspects for the large enterprise is incredibly invigorating for the entire company.\"For more information on IntelliFlash, visit http://www.intelliflash.io. About the DDN Family of Companies  DDN is the world's largest privately held storage company. As organizations look for increasingly easy to use, robust, and highly scalable data management solutions for flexible deployment in multicloud environments, the DDN family of technology brands delivers faster insight into and maximum value from their complex, distributed data. Our products and services are ideally suited for emerging and demanding AI, IOT, multicloud, Big Data, streaming and mixed workloads at scale. Over the last two decades, DDN has established itself as the data management provider of choice for over 5000 enterprise, government, and public-sector customers. For more information, follow us on twitter: @ddn_limitless, go to www.ddn.com or call 1-800-837-2298.  Contact: Press Relations at DDN pr@ddn.com Walt & Company, on behalf of DDN Sharon Sumrit, 408.369.7200 x2981 ddn@walt.com ©2019 All rights reserved. DDN, Tintri by DDN and Nexenta by DDN are trademarks owned by DataDirect Networks. All other trademarks are the property of their respective owners.   View original content to download multimedia:http://www.prnewswire.com/news-releases/ddn-completes-acquisition-of-western-digitals-intelliflash-nvme-hybrid-flash-and-predictive-analytics-enterprise-business-unit-300961616.htmlSOURCE  DataDirect Networks (DDN)"
    },
    {
        "title": "Western Digital Board Declares Quarterly Dividend",
        "subtitle": "",
        "date": "Nov 14, 2019 5:00PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced that the board of directors declared a quarterly cash dividend of $0.50 per share of common stock (the \"cash dividend\"). The cash dividend will be paid on January 21, 2020, to the company's stockholders of record as of January 3, 2020.\n\nThe amount of future dividends under the company's dividend policy, and the declaration and payment thereof, will be based upon all relevant factors, including the company's financial position, results of operations, cash flows, capital requirements and restrictions under the company's financing documents, and shall be in compliance with applicable law. The board retains the power to modify, suspend or cancel the company's dividend policy in any manner and at any time as it may deem necessary or appropriate in the future.\n\nAbout Western Digital\n\nWestern Digital creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Western Digital® data-centric solutions are marketed under the G-Technology™, HGST™, SanDisk® and WD® brands. Financial and investor information is available on the company's Investor Relations website at investor.wdc.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include statements concerning the company's quarterly dividend. These forward-looking statements are based on management's current expectations and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements, including: volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of restructuring activities and cost saving initiatives; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; the development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, mergers and joint ventures; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company’s filings with the Securities and Exchange Commission (the “SEC”), including the company’s Form 10-Q filed with the SEC on November 12, 2019, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect subsequent events or circumstances.\n\nWestern Digital, the Western Digital logo, G-Technology, HGST, SanDisk and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191114005802/en/\nCompany contacts:\nWestern Digital Corp.\n\nInvestor Contact:\nT. Peter Andrew\n949-672-9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nMedia Contact:\nJim Pascoe\n408-717-6999\njim.pascoe@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital to Present at Upcoming Investor Conferences",
        "subtitle": "",
        "date": "Nov 13, 2019 5:00PM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced participation in four upcoming investor conferences:\n\nThe live and archived presentations will be available via webcast on the company’s Investor Relations website at investor.wdc.com.\n\nAbout Western Digital\n\nWestern Digital, a leader in data infrastructure, creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are marketed under the G-Technology™, SanDisk®, WD®, and the Western Digital® brands.\n\nWestern Digital, the Western Digital logo, G-Technology, SanDisk and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191113005844/en/\nInvestor Relations Contact:\nT. Peter Andrew\nWestern Digital Corp.\n+1-949-672-9655\npeter.andrew@wdc.com\ninvestor@wdc.com\n\nPress Contact:\nJim Pascoe\nWestern Digital Corp.\n+1-408-717-6999\njim.pascoe@wdc.com\nSource: Western Digital Corp."
    },
    {
        "title": "Western Digital Collaborates With lowRISC and Google to Increase Security Transparency in Data-Centric Platforms",
        "subtitle": "",
        "date": "Nov 5, 2019 9:00AM EST",
        "content": "\nOpenTitan Open-Source Project Aims to Deliver Silicon ‘Root of Trust’ Chips for Integration from the Data Center to the Edge\n    SAN JOSE, Calif.--(BUSINESS WIRE)--\nWestern Digital Corp. (NASDAQ: WDC) today announced that it has teamed up with lowRISC, Google and a coalition of partners in support of OpenTitan, the first open-source project building transparent, high-quality reference design and integration guidelines for silicon root of trust (RoT) chips that can be used in data storage, compute, and other hardware platforms. Leveraging the company’s expertise in data infrastructure and open-source technologies, Western Digital is working with ecosystem partners to optimize the OpenTitan framework to meet the diverse security demands of data-centric storage use cases from the core to the edge, including machine-learning applications, smartphones and connected Internet of Things (IoT) devices.\n\nThe OpenTitan project was established with the belief that the ability to understand, inspect and verify a device from the chip to the application is critical in data security. As it’s open, adopters of the new OpenTitan framework can now review, audit and contribute to OpenTitan’s register-transfer level (RTL) reference design, firmware and integration guidelines. This transparency will help to create more secure RoT solutions and enable continued innovation.\n\n“As the volume and value of data continues to grow exponentially, so does the need to keep that data safe and secure,” said Dr. Richard New, vice president of research and development at Western Digital. “OpenTitan leverages the power and transparency of the open-source development model to enable root of trust chips that can be fully inspected and verified, thereby providing strong security against malware, physical hardware modifications and other threats. Our work with the OpenTitan project, and ongoing collaboration with the open-source community and security ecosystem, furthers our commitment to accelerating the development of more secure data infrastructure as we move into the zettabyte era.”\n\nAs part of the company’s ongoing participation in the OpenTitan project, Western Digital is collaborating with lowRISC, Google and others to develop the OpenTitan RoT, including contributing to its initial overall design, hardware block implementation and firmware. Western Digital’s support of the project further extends the company’s leadership in advancing open-source innovation, including significant investments in the open-source software and hardware ecosystem, broad participation in open industry standard security groups, and leadership in open-source organizations.\n\nOpenTitan Helps to Make RoT Chips More Transparent, Trustworthy and Secure\n\nA RoT is a function or element in a computing module that is always trusted by the computer's operating system. It serves as the foundational trusted element in a linked chain, in which each element is secured by a prior trusted element. In this way, a RoT can ensure the overall security for multiple constituent elements in a larger complex system. Key benefits of the OpenTitan RoT include:\n\n“Customers are asked to put faith in proprietary hardware RoT chips for their mission-critical systems without the ability to fully understand, inspect and, therefore, trust them,” said Dominic Rizzo, OpenTitan Lead, Google Cloud. “By creating OpenTitan with technology leaders like Western Digital and the broader hardware and academic community, we can leverage the experience and security principles used to create Google’s own Titan chips to make hardware RoT designs more transparent, inspectable, and accessible to the rest of the industry. Security should never be built on opacity.”\n\nOpenTitan is managed by lowRISC, an independent not-for-profit engineering organization that uses collaborative engineering to develop and maintain open-source silicon designs and tools.\n\n“At lowRISC, our mission is to establish a vibrant ecosystem around open silicon designs and to help lower the barrier to producing custom chips,” said Gavin Ferris, lowRISC CIC board member. “The collaboration between lowRISC, Google, Western Digital and the OpenTitan ecosystem of like-minded organizations focused on the goal of improving transparency around chips helps increase trust in the overall security of the infrastructure on which software runs. With OpenTitan, enterprise organizations and consumers alike will benefit from services built on a more secure infrastructure that is anchored in transparently implemented OpenTitan chips.”\n\nAdditional Resources\n\nAbout Western Digital\n\nWestern Digital, a leader in data infrastructure, creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Our data-centric solutions are marketed under the G-Technology™, SanDisk®, WD®, and the Western Digital® brands.\n\nForward-Looking Statements\n\nThis news release contains forward-looking statements that involve risks and uncertainties, including, but not limited to, statements regarding the OpenTitan framework and its benefits, our collaborations in connection with the OpenTitan framework, business strategies and growth opportunities, market trends, and data growth and its drivers. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved, if at all. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward-looking statements.\n\nKey risks and uncertainties include volatility in global economic conditions; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; actions by competitors; unexpected advances in competing technologies; our development and introduction of products based on new technologies and expansion into new data storage markets; difficulties or delays in manufacturing; and other risks and uncertainties listed in the company’s filings with the Securities and Exchange Commission (the “SEC”) and available on the SEC’s website at www.sec.gov, including our most recently filed periodic report, to which your attention is directed. We do not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise, except as required by law.\n\n© 2019 Western Digital Corporation or its affiliates. All rights reserved. Western Digital, the Western Digital logo, G-Technology, SanDisk, and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the US and/or other countries. All other marks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191105005497/en/\nLaura Bakken\nWestern Digital Media Relations\n408.801.7653\nlaura.bakken@wdc.com\n\nPeter Andrew\nWestern Digital Investor Relations\n949.672.9655\npeter.andrew@wdc.com\nSource: Western Digital Corp."
    }
]