[
    {
        "title": "North American companies take steps to protect employees from coronavirus epidemic",
        "subtitle": "",
        "date": "Mar 5, 2020 9:41AM EST",
        "content": "ARLINGTON, Va., March  05, 2020  (GLOBE NEWSWIRE) -- Amid growing concern over COVID-19, a majority of North American companies are taking steps to protect their employees from respiratory infection and to prevent the spread of the new coronavirus, according to a recent survey by Willis Towers Watson (NASDAQ: WLTW), a leading advisory, broking and solutions company. These initiatives include launching employee communication campaigns, expanding the number of employees working remotely, and restricting travel to and from countries deemed to be high risk.“The coronavirus is a wake-up call for companies to review their strategies, policies and procedures about safeguarding employees, customers and operations in this and future epidemics,” said Jeff Levin-Scherz, co-leader, North American Health Management practice, Willis Towers Watson. “From boosting communication to increasing access to hand sanitizers, employers need a plan of action to protect their workers and reduce the risk of business interruption.”One of the key initiatives aimed toward reducing the spread of the virus is to restrict travel. According to the survey of 158 national and multinational employers, nearly two in three (63%) have cancelled planned trips to select countries for their North American employees who travel internationally for business, and 55% are encouraging virtual meetings to decrease travel. Nearly half (47%) have cancelled planned conferences in select countries.Remote work is advised by the Centers for Disease Control and Prevention, and it’s one of the policies that nearly half (46%) of organizations are implementing because of the COVID-19 epidemic. Other prevention policies being implemented include required screening for visitors or employees who have recently travelled (30%) and clarifying pay policy if worksites are closed or employees are furloughed (28%).Almost half of respondents (45%) have done research to determine which employees are at risk of COVID-19, based on their travel. Over half (59%) have deployed communication campaigns geared toward preventing spread of respiratory disease.To help prevent spread of respiratory disease, 44% of respondents said they have increased access to hand sanitizers for their North American employees, and 38% are reviewing and or/revising HR policies and procedures; however, only 5% are evaluating and/or reserving for potential increased health plan liabilities.The survey also identified actions employers in China and Asia implemented that North American organizations can learn from, should the virus continue to spread. For example, most worksites in China have closed, and 82% of employees in China are being directed to work from home; however, most furloughed employees in China and other locations in Asia are being paid in full, and nearly all employers in Asia will continue to pay employee benefits, even if the worksite is closed.“While the risks to those organizations with multinational operations or expatriate workers may seem more obvious, all companies can face a wide range of business risks due to the virus — from supply chain disruptions to shortages of computer chips and cell phone parts. It’s important that companies stay on top of developments as the virus is still in its early stages and its full impact is not yet known,” said Francis Coleman, managing director, Global Services and Solutions, Willis Towers Watson.About the surveyA total of 158 U.S. companies, of which 64% of the respondents were multinationals, participated in the Willis Towers Watson COVID-19 Survey, which was conducted in mid-February. Respondents employ nearly 1.5 million workers.   About Willis Towers Watson  Willis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactEd Emerman: +1 609 275 5162eemerman@eaglepr.com "
    },
    {
        "title": "Companies divesting assets in 2019 post second worst performance on record",
        "subtitle": "",
        "date": "Mar 3, 2020 9:05AM EST",
        "content": "ARLINGTON, Va., March  03, 2020  (GLOBE NEWSWIRE) -- Six out of 10 companies that sold portions of their business in 2019 lost shareholder value, according to leading global advisory, broking and solutions company Willis Towers Watson’s Divestment Performance Monitor, in partnership with Cass Business School.1Based on share price performance, companies actively engaged in divestment deals in 2019 underperformed the Global Index by an average of –6.3 percentage points (pp). This is the second worst year since the launch of the database in 2010, only fractionally better than 2018, the worst year on record with an underperformance of –6.5 pp.“During the past decade, in the wake of the 2007 to 2008 financial crisis, divesting assets has been challenging for many companies, in terms of their share price performance,” said Duncan Smithson, senior director, M&A, Willis Towers Watson.The latest data show the performance of divestitures in the second half of 2019 was negative with a performance of –6.1 pp lower than the index. Although this is an improvement compared with the first six months of 2019 (–7.1 pp), divestments have now, on average, failed to add value for six consecutive years.“Even in the most difficult years, over 40% of companies managed to add shareholder value post-divestment,” said Smithson. “These companies have understood the time, complexity and cost involved — from implementing thorough due diligence, to navigating often overlooked human capital issues — allow sellers to approach a deal from a position of strength and command the highest price for the asset.”The study also shows that acquirers of divested assets, which managed to outperform their industry benchmarks by an average of +1 pp in the first six months of 2019, found the second half of the year much more challenging and underperformed by –12.7 pp.Deal volume in the second half of 2019 (320) was high compared with the first six months of the year (251). This is consistent with every second-half period since 2010; last year, this was due to a significant upsurge in deals across Europe and Asia Pacific. Despite increased activity, the total number of deals completed in 2019 (571) is a record low since 2010.Insights from the data, which look at companies selling portions of a parent company to both listed companies and private equity buyers, include:“Notwithstanding the dip in deal volume, the uncertainty of tariffs, geopolitical concerns and shareholder pressure, companies will continue to divest, driven by the need to streamline their operating models to pursue new growth opportunities,” said Smithson. “Despite the scale of challenges companies face to divest well in such difficult conditions, the data also point to where sellers are successfully bucking the negative global trend. A disciplined and rigorous approach to the complex separation process will help attract better buyers, position the remaining business for future growth and drive shareholder value.”Willis Towers Watson methodologyAbout Willis Towers Watson M&AWillis Towers Watson’s M&A practice combines our expertise in risk and human capital to offer a full range of M&A services and solutions covering all stages of the M&A process. We have particular expertise in the areas of planning, due diligence, risk transfer and post-transaction integration, areas that define the success of any transaction.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving in more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactEd Emerman: +1 609 275 5162eemerman@eaglepr.com_______________________________1 The global database analyzes the share price performance of companies selling assets, from six months prior to the divestment announcement to up to six months after the divestment has completed."
    },
    {
        "title": "Willis Towers Watson makes its pay data survey participation experience easier",
        "subtitle": "",
        "date": "Feb 27, 2020 9:43AM EST",
        "content": "ARLINGTON, Va., Feb.  27, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, today announced significant enhancements to its compensation survey participation experience. The improvements provide a faster, more simplified and automated data submission user experience for compensation professionals tasked with benchmarking pay data through a streamlined participation portal. The portal includes a single location for all data submission and real-time tracking needs, allowing users to filter by keywords, review status of existing submissions and track team members’ submission progress. All new features of the portal are available immediately for all 2020 participants.The new portal allows users to leverage data they submitted in previous years by automatically downloading pre-populated workbooks, and submissions are automatically checked for completeness before they are accepted. In addition, all files exchanged within the portal now offer seamless data import; the use of other applications or emails to share data is no longer required, thereby improving data security and protecting highly confidential data. Further, users can distribute the workload with team members by inviting them to collaborate on survey submissions directly and securely through the portal.“Compensation and benefit professionals increasingly expect to spend less time assembling data and more time analyzing it to get the best return on investment for their talent,” said Sam Rakyan, global leader, Rewards Data & Software, Willis Towers Watson. “As we continue to leverage artificial intelligence and machine learning technology, we will provide compensation and benefit professionals with a faster, automated, more secure and convenient way to submit their data.”About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving in more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactIleana Feoli: +1 212 309 5504ileana.feoli@willistowerswatson.com"
    },
    {
        "title": "Willis Towers Watson Announces Upcoming Conference Presentation",
        "subtitle": "",
        "date": "Feb 26, 2020 6:49PM EST",
        "content": "ARLINGTON, Va. and LONDON, Feb.  26, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, announced today that it will participate in the Raymond James 41st Annual Institutional Investors Conference on March 3, 2020 in Orlando.Mike Burwell, Willis Towers Watson’s chief financial officer, is scheduled to present at the conference at 10:25 a.m. Eastern Time on March 3, 2020.A live webcast of the conference presentation will be available at the Investor Relations section of www.willistowerswatson.com.  Additionally, a replay of the conference presentation will be available online shortly after the conclusion of the live presentation.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.CONTACTINVESTORSRich Keefe | +1 215 246 3961 | rich.keefe@willistowerswatson.com"
    },
    {
        "title": "Willis Towers Watson Announces Regular Quarterly Dividend",
        "subtitle": "",
        "date": "Feb 26, 2020 5:20PM EST",
        "content": "ARLINGTON, Va. and LONDON, Feb.  26, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, announced that it approved a regular quarterly cash dividend of $0.68 per ordinary share for the quarter ended December 31, 2019. This represents a 5% increase to the prior quarter’s dividend. The dividend is payable on or around April 15, 2020 to shareholders of record at the close of business on March 31, 2020.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW ) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.CONTACTINVESTORSRich Keefe | +1 215 246 3961 | Rich.Keefe@willistowerswatson.com"
    },
    {
        "title": "Many public sector workers fear their retirement will not include the employer-sponsored health care benefits they were promised",
        "subtitle": "",
        "date": "Feb 19, 2020 9:14AM EST",
        "content": "ARLINGTON, Va., Feb.  19, 2020  (GLOBE NEWSWIRE) -- Roughly half of public sector workers surveyed (46%) are worried that the health care benefits they were promised in retirement will evaporate when they need them most. This is according to the 2020 Keeping Benefit Promises Study by Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company. Public sector workers also expressed the importance of retiree health care coverage, with 58% saying it was extremely or highly influential in their decision to work in the public sector.Many public sector workers acknowledged they likely earn less in base pay and bonuses than their private sector counterparts but expect their employers to make up this difference by offering robust benefits in retirement. “What public sector workers give up in salary, they make up in benefits,” said Jon Andrews, managing director, Benefits Delivery and Administration, Willis Towers Watson. “As costs climb and budgets are cut, public sector retiree health care benefits are increasingly at risk of disappearing. But slashing these benefits could have a catastrophic effect on our communities’ ability to attract top talent to teach our children and keep our towns safe.”Almost two-thirds (64%) of public sector workers said their financial security in retirement depends on the promise of employer-sponsored health care coverage. However, retiree health care is becoming an unsustainable financial burden on public sector organizations, with state unfunded retiree health care liabilities nationwide reaching $700 billion.i Many cities are reacting by cutting retiree health care altogether or adopting short-term solutions, such as reducing spousal benefits or requiring more years of service to qualify.“When balancing their budgets, public sector organizations are stuck between a rock and a hard place,” said Andrews. “They do not want to increase taxpayer burden nor deprive employees of the benefits that initially attracted them to the job. The good news is a solution exists. Employers should consider an often-overlooked remedy: providing funding via a health reimbursement arrangement and allowing retirees to shop for health plans (with these funds) on the individual Medicare marketplace.”Notably, 41% of public sector workers said they would give notice if their benefits were reduced, and more than half (54%) expect to be supported in retirement because they served their community. “Public sector workers are the strongest thread in the fabric of our communities. We need to honor the benefits they were promised in retirement, especially when there’s a viable, cost-saving solution,” said Andrews.About the individual Medicare marketplaceWith retiree health coverage being reduced across the country, there is hope in an overlooked solution: The individual Medicare marketplace — or Medicare exchange — is a marketplace that provides affordable plan options for retirees through a defined contribution model while making retiree health care sustainable for plan sponsors.Willis Towers Watson runs an individual Medicare marketplace for Medicare-eligible retirees (65 or older). Retirees get one-on-one concierge service to make informed plan decisions and save money because plans found on the Marketplace are often less expensive.About the surveyThe Willis Towers Watson 2020 Keeping Benefit Promises Study was conducted online from November 6 through November 13, 2019. A total of 1,522 public sector employees and retirees participated.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactJulia Mellon: +1 212 584 5474julia@blissintegrated.comi Liz Farmer, “As Retiree Health-Care Costs Soar, Public Employers Turn to Private Insurers,” Governing, January 9, 2019, https://www.governing.com/topics/finance/gov-retiree-health-care-costs-soar-government-solutions.html"
    },
    {
        "title": "Despite improvement in their financial wellbeing, U.S. workers remain worried",
        "subtitle": "",
        "date": "Feb 11, 2020 9:08AM EST",
        "content": "ARLINGTON, Va., Feb.  11, 2020  (GLOBE NEWSWIRE) -- U.S. employees’ financial wellbeing has improved, but many still live paycheck to paycheck, overspend and remain worried over the future state of their finances. The fallout from these financial problems leads to a broad set of issues that negatively affect many workers’ lives. These findings are according to a survey of 8,000 U.S. employees by Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company.The Global Benefits Attitudes Survey found 43% of U.S. workers are satisfied with their financial situation, an increase from 35% in 2017. Employee satisfaction with their finances has now recovered to levels seen between 2011 and 2015. Additionally, four in 10 (42%) say their financial situation has improved over the past two years, and nearly six in 10 (58%) believe their finances are heading in the right direction. However, the survey revealed some worrisome findings:“Financial health is not just about income. The impact of financial problems on employees’ health and stress, even for those who aren’t living paycheck to paycheck, is unmistakeable,” said Steve Nyce, senior economist, Willis Towers Watson. “Many employees are struggling with their financial situation even as the job market and economic conditions improve. Some employees struggle to pay for their basic needs, including health care, while others are falling behind in saving for retirement. No matter the source, financial stress has a negative impact on their lives, underscored by hampering their ability to perform effectively at work.”Financial stress is having a negative effect on employee productivity, engagement and health. This is especially true among “struggling” employees, identified as those who live paycheck to paycheck and have difficulty controlling spending. About one-fourth (27%) of respondents are classified as struggling. Among struggling employees, four in 10 (39%) said money concerns keep them from doing their best at work. Roughly half of struggling employees (49%) reported suffering from stress, anxiety or depression over the past two years, compared with just 16% of employees without any financial worries. And only 39% of struggling employees were fully engaged at work.Employers’ role in helping employeesThe survey also found that providing employees with tools and resources can help boost their financial wellbeing. Seven in 10 employees (69%) who were given the most access to several tools and resources (four or more) said their finances are heading in the right direction versus just 51% who had no access to tools. Similarly, two-thirds (66%) of workers with the most access to financial management resources said these resources met their needs, compared to 39% with less access to resources. Nearly as many (64%) respondents with the most access said the resources encouraged them to improve their financial situation versus 40% with just some access to tools or resources.“We believe, with the right actions and insights, employers can help lower the financial risks that workers face. Access to the appropriate benefits and decision tools is a great start. These employer resources should include supportive social connections, such as coworkers and family, all of which can help employees keep and enjoy more of their money and, ultimately, improve wellbeing,” concluded Shane Bartling, senior director, Retirement, Willis Towers Watson.About the Global Benefits Attitudes SurveyThe Willis Towers Watson 2019/2020 Global Benefits Attitudes Survey measured attitudes of over 40,000 employees at medium and large private sector companies in 27 countries. A total of 8,000 U.S. workers participated in the survey, which was conducted between July and September 2019.About Willis Towers Watson  Willis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactEd Emerman: +1 609 275 5162eemerman@eaglepr.com"
    },
    {
        "title": "Global pension assets on the rise",
        "subtitle": "",
        "date": "Feb 10, 2020 9:21AM EST",
        "content": "ARLINGTON, Va., Feb.  10, 2020  (GLOBE NEWSWIRE) -- Global institutional pension fund assets in the 22 largest major markets (the P22) bounced back in 2019, soaring by 15% to $46.7 trillion at year-end, according to the latest figures in the Thinking Ahead Institute’s Global Pension Assets Study. The growth recovery was driven, in part, by strong gains in equity markets during the year, with Mexico (22.2%), Canada (18.9%) and the U.S. (17.8%) leading the way. This represents a significant swing in fortunes from 2018, which saw an overall 3.3% decline in global pension assets.The seven largest markets for pension assets (the P7) — Australia, Canada, Japan, the Netherlands, Switzerland, the U.K. and the U.S. — account for 92% of the P22, marginally higher than the previous year. The U.S. also remains the largest pension market, representing 62% of worldwide pension assets, followed by the U.K. and Japan with 7.4% and 7.2%, respectively.The research also shows the shift to alternative assets continues apace and marks two decades of considerable change in pension fund asset allocation globally. In 1999, just 6% of P7 pension fund assets were allocated to private markets and other alternatives, compared to nearly a quarter of assets (23%) in 2019. This shift comes largely at the expense of equities and bonds, down 16% and 1%, respectively, in the period. The average P7 asset allocation is now equities 45%, bonds 29%, alternatives 23% and cash 3%.“Besides strong growth in assets last year, there was a noticeable pickup in the decade-long trend of funds developing stronger strategies around their people. Larger funds, particularly those above $25 billion, continued to build larger, more sophisticated internal teams, with stronger leadership through CEO and CIO roles and greater role specialization in certain asset classes such as private markets. Smaller funds continue to outsource all or part of their CIO-type decisions, and we expect this to continue,” said Marisa Hall, co-head, Thinking Ahead Institute.According to the research, total defined contribution (DC) assets continue to grow, representing slightly over 50% of total P7 pension assets. Last year, DC exceeded defined benefit (DB) assets for the first time, a culmination of 10 years of faster DC assets growth than DB (8.4% versus 4.8% annually), reflecting increased member coverage and, in some markets, higher contributions.“The DC market has retained its newly found position as the larger of the two, as DB assets grow at a far slower pace. But the challenge of participant engagement, critical for stronger DC effectiveness, remains an unresolved issue for many sponsors,” said Michele Brennan, U.S. Defined Contribution Solutions leader, Willis Towers Watson. “As such, in the U.S. we expect this to be a particular focus for leading DC organizations as the next generation of plans takes shape. Also, with more flexible DC legislation and advances in technology, we see innovation in DC plans continuing. All leading to improvements within the nature of sponsor and participant interactions and resetting expectations.” Other highlights from the study   Global asset data for the P22 in 2019Asset allocation for the P7DC/DB assets for P7Notes to editorsAbout the Thinking Ahead InstituteThe Thinking Ahead Institute was established in January 2015 and is a global not-for-profit investment research and innovation member group made up of engaged institutional asset owners and service providers committed to mobilizing capital for a sustainable future. It has over 40 members around the world and is an outgrowth of the Willis Towers Watson Investments’ Thinking Ahead Group, which was set up in 2002. Learn more at www.thinkingaheadinstitute.org.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.The information included in this presentation is intended for general educational purposes only and does not take into consideration individual circumstances. Such information should not be relied upon without further review with your Willis Towers Watson consultant. The views expressed herein are as of the date given. Material developments may occur subsequent to this presentation rendering it incomplete and inaccurate. Willis Towers Watson assumes no obligation to advise you of any such developments or to update the presentation to reflect such developments. The information included in this presentation is not based on the particular investment situation or requirements of any specific trust, plan, fiduciary, plan participant or beneficiary, endowment or any other fund; any examples or illustrations used in this presentation are hypothetical. As such, this presentation should not be relied upon for investment or other financial decisions, and no such decisions should be taken on the basis of its contents without seeking specific advice. Willis Towers Watson does not intend for anything in this presentation to constitute “investment advice” within the meaning of 29 CFR § 2510.3-21 to any employee benefit plan subject to the Employee Retirement Income Security Act and/or section 4975 of the Internal Revenue Code.Willis Towers Watson is not a law, accounting or tax firm, and this presentation should not be construed as the provision of legal, accounting or tax services or advice. Some of the information included in this presentation might involve the application of law; accordingly, we strongly recommend that audience members consult with their legal counsel and other professional advisors as appropriate to ensure that they are properly advised concerning such matters. In preparing this material, we have relied upon data supplied to us by third parties. While reasonable care has been taken to gauge the reliability of these data, we provide no guarantee as to the accuracy or completeness of these data, and Willis Towers Watson and its affiliates and their respective directors, officers and employees accept no responsibility and will not be liable for any errors or misrepresentations in the data made by any third party.In the absence of its express written permission to the contrary, Willis Towers Watson and its affiliates and their respective directors, officers and employees accept no responsibility and will not be liable for any consequences howsoever arising from any use of or reliance on the contents of this document, including any opinions expressed herein.Views expressed by other Willis Towers Watson consultants or affiliates may differ from the information presented herein. Actual recommendations, investments or investment decisions made by Willis Towers Watson and its affiliates, whether for its own account or on behalf of others, may not necessarily reflect the views expressed herein. Investment decisions should always be made based on an investor’s specific financial needs.Media contactEd Emerman: +1 609 275 5162eemerman@eaglepr.com"
    },
    {
        "title": "Willis Towers Watson Reports Strong Fourth Quarter and Full Year 2019 Earnings",
        "subtitle": "",
        "date": "Feb 6, 2020 6:00AM EST",
        "content": "ARLINGTON, Va. and LONDON, Feb.  06, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW) (the “Company”), a leading global advisory, broking and solutions company, today announced financial results for the fourth quarter and full year 2019, which ended December 31, 2019.“For the year, Willis Towers Watson generated 5 percent organic revenue growth, which was broad-based across all our businesses and 6 percent growth overall. In addition to our continued progress on the operational front, we successfully completed the acquisition of TRANZACT which helped significantly strengthen Willis Towers Watson’s overall growth profile as total revenue increased 13% in the fourth quarter versus prior year”, said John Haley, Willis Towers Watson’s chief executive officer. “As we look ahead to fiscal year 2020, we remain focused on executing our strategy and confident in our ability to continue delivering significant value for our clients, colleagues and shareholders.”Company HighlightsRevenue was $2.69 billion for the fourth quarter of 2019, an increase of 13% (14% increase constant currency and 6% increase organic) as compared to $2.37 billion for the same period in the prior year.For the year ended December 31, 2019, revenue was $9.04 billion, an increase of 6% (9% increase constant currency and 5% increase organic) as compared to $8.51 billion for the same period in the prior year.Net income attributable to Willis Towers Watson for the fourth quarter of 2019 was $544 million, an increase of 44% from $378 million for the prior-year fourth quarter. For the quarter, diluted earnings per share were $4.18 and adjusted diluted earnings per share were $4.90. The U.S. GAAP income tax rate for the quarter was 18.3%, and the adjusted income tax rate for the quarter used in calculating adjusted diluted earnings per share was 19.4%.For the year ended December 31, 2019, net income attributable to Willis Towers Watson was $1.04 billion, a 50% increase from $695 million for the same period in the prior year. Diluted earnings per share were $8.02, and adjusted diluted earnings per share were $10.96 for the year ended December 31, 2019. Net income attributable to Willis Towers Watson and diluted earnings per share for the year ended December 31, 2019 included pre-tax $13 million of transaction and integration expenses related to the TRANZACT acquisition. For the year ended December 31, 2019, the U.S. GAAP income tax rate was 18.8%, and the adjusted income tax rate used in calculating adjusted diluted earnings per share was 20.3%.Net income for the fourth quarter of 2019 was $551 million, or 20.5% of revenue, an increase from net income of $383 million, or 16.1% of revenue for the prior-year fourth quarter. Adjusted EBITDA for the fourth quarter of 2019 was $930 million, or 34.6% of revenue, an increase from adjusted EBITDA of $774 million, or 32.6% of revenue for the prior-year fourth quarter.For the year ended December 31, 2019, net income was $1.07 billion, or 11.9% of revenue, an increase from net income of $715 million, or 8.4% of revenue for the same period in the prior year. Adjusted EBITDA for the year ended December 31, 2019 was $2.3 billion, or 25.4% of revenue, an increase from adjusted EBITDA of $2.0 billion, or 23.9% of revenue for the same period in the prior year.Operating income margin improved by 570 basis points to 25.5% from 19.8% for the prior-year fourth quarter. Adjusted operating income margin improved by 270 basis points to 30.1% from 27.4% in the prior-year fourth quarter.For the year ended December 31, 2019, operating income margin improved by 520 basis points to 14.7% from 9.5% for the same period in the prior year. Adjusted operating income margin improved by 220 basis points to 20.3% from 18.1% for the same period in the prior year.Cash flows from operating activities for the year ended December 31, 2019 were $1.08 billion compared to $1.29 billion for the prior year. Free cash flow for the year ended December 31, 2019 and 2018 was $835 million and $1.02 billion, respectively. The Company repurchased approximately $3 million of Company stock during the fourth quarter of 2019. For the full year, the Company repurchased approximately $150 million of Company stock.Segment HighlightsHuman Capital & BenefitsThe Human Capital & Benefits (HCB) segment had revenue of $865 million, an increase of 3% (4% increase constant currency and 4% increase organic) from $843 million in the prior-year fourth quarter. On an organic basis and after factoring in the first-year adoption impact of ASC 606 in the prior year, Health and Benefits delivered revenue growth, driven by increased consulting and brokerage services, growth in specialty products in North America, and expansion of our client portfolio outside North America for both local and global appointments. Retirement revenue grew primarily as a result of increased de-risking work in North America. The remainder of the segment’s revenue growth was generated by increased demand for advisory work and administration activity in our Talent and Rewards and Technology and Administration Solutions businesses. For further discussion of the impact of the adoption of ASC 606 on our results for the year ended December 31, 2018, see our Form 10-K filed with the SEC on February 27, 2019. The HCB segment had an operating margin of 30.1% as compared to 29.9% for the prior-year fourth quarter.Corporate Risk & BrokingThe Corporate Risk & Broking (CRB) segment had revenue of $877 million, an increase of 7% (9% increase constant currency and 9% increase organic) from $816 million in the prior-year fourth quarter. The segment had solid growth across all geographies. On an organic basis, North America continued to lead the segment with new business generation. International, Western Europe and Great Britain also contributed meaningful growth for the segment, related to strong management of the renewal book portfolio alongside new business wins. The CRB segment had an operating margin of 30.3%, as compared to 29.4% for the prior-year fourth quarter.Investment, Risk & ReinsuranceThe Investment, Risk & Reinsurance (IRR) segment had revenue of $314 million, an increase of 12% (14% increase constant currency and 12% increase organic) from $280 million in the prior-year fourth quarter. On an organic basis, all lines of business contributed to the growth. Reinsurance and Wholesale growth was driven by net new business growth and favorable renewal factors while Insurance Consulting and Technology revenue grew from strong technology sales. Max Matthiessen revenue increased as a result of overall growth in net commissions. Revenue growth in the Investment businesses was a result of client wins in the delegated business. The IRR segment had an operating margin of 9.1%, as compared to 1.9% for the prior-year fourth quarter.Benefits Delivery & AdministrationThe Benefits Delivery & Administration (BDA) segment had revenue of $595 million, an increase of 53% (53% increase constant currency and 3% increase organic) from $390 million in the prior-year fourth quarter. BDA’s organic growth continued to be led by its expanded client base and increased demand for project work in the mid-market and large-market spaces. On July 30, 2019, the Company acquired TRANZACT, which operates as part of the BDA segment. In the fourth quarter, TRANZACT generated revenue of $195 million. The BDA segment had an operating margin of 52.4%, as compared to 61.4% for the prior-year fourth quarter.Conference CallThe Company will host a live webcast and conference call to discuss the financial results for the fourth quarter and full year of 2019. It will be held on Thursday, February 6, 2020, beginning at 9:00 a.m. Eastern Time, and can be accessed via the Internet at www.willistowerswatson.com. The replay of the call will be available shortly after the live call for a period of three months. A telephonic replay of the call will also be available for 24 hours at 404-537-3406, conference ID 6187339.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has more than 45,000 employees and services clients in more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Select Questions and Answers Q1: Why was your free cash flow below your guidance?Our efforts to transform the contract-to-cash process across all of our businesses have proven more challenging than we had originally anticipated. We have defined and focused plans on improving this going forward. The year-over-year decline in free cash flow is primarily due to higher cash payments of approximately $130 million for income taxes, resulting from U.S. and Global Tax Reform, unfavorable working capital changes particularly in accounts receivables and the negative cash flows of TRANZACT.Q2: What was the impact of foreign currency movements for the fourth quarter and on a full year basis?For the quarter ended December 31, 2019, currency translation caused a decrease in our consolidated revenue of $22 million, and was a $0.05 headwind to adjusted diluted earnings per share. For the twelve months ended December 31, 2019, currency translation caused a decrease in our consolidated revenue of $192 million, resulting in a decrease of $0.16 to adjusted diluted earnings per share.Q3. What was the impact to the Health and Benefits’ business line’s revenue growth this quarter and for the full year 2019 related to the recovery of revenue not recognized last year with the new revenue standard adoption (ASC 606) in 2018?  The Health and Benefits (H&B) business recorded $8 million of revenue recapture in the fourth quarter of 2019. For the full year, H&B has recorded approximately $57 million of revenue or 100% of the total expected revenue recapture.Q4.  How do you see Brexit impacting the Company?Willis Towers Watson is committed to providing continuity of service and transition plans for its clients and partners post Brexit. While there are still significant uncertainties with respect to Brexit and its impact on the regulatory environment, we believe that our Company is well-positioned to operate in a post-Brexit environment, given our extensive footprint across Europe and the UK. Regardless of the final Brexit outcome, we are fully committed to helping clients understand and navigate its impact to their business and the resulting changing regulatory landscape.Q5. What was the impact of the Company’s adoption of the new lease accounting standard (ASC 842, Leases)?  ASC 842 became effective, and was adopted by the Company, on January 1, 2019. The adoption of this new guidance had no material impact to the amounts and classifications of the balances within our consolidated statements of income. On our consolidated balance sheet we recognized an additional $1.2 billion of lease liabilities; $1.0 billion of right-of-use assets; additional deferred tax assets of $252 million and deferred tax liabilities of $252 million on the gross lease-related liabilities and gross right-of-use assets, respectively. See Note 14 – Leases, within the Company’s Form 10-K for the year ended December 31, 2019 to be filed with the SEC by February 28, 2020 for a full description of the impact on the Company from adoption, adoption elections made and the newly-required disclosures.Q6: How should we think about the impact of currency for 2020?Assuming foreign exchange rates remain at current levels, we expect a modest negative impact of about $0.10 to Adjusted Diluted Earnings per Share primarily due to fluctuations in the Euro and Pound Sterling.Willis Towers Watson Non-GAAP MeasuresIn order to assist readers of our consolidated financial statements in understanding the core operating results that Willis Towers Watson’s management uses to evaluate the business and for financial planning, we present the following non-GAAP measures: (1) Constant Currency Change, (2) Organic Change, (3) Adjusted Operating Income/Margin, (4) Adjusted EBITDA/Margin, (5) Adjusted Net Income, (6) Adjusted Diluted Earnings Per Share, (7) Adjusted Income Before Taxes, (8) Adjusted Income Taxes/Tax Rate and (9) Free Cash Flow.The Company believes that these measures are relevant and provide useful information widely used by analysts, investors and other interested parties in our industry to provide a baseline for evaluating and comparing our operating performance, and in the case of free cash flow, our liquidity results.Within these measures referred to as ‘adjusted’, we adjust for significant items which will not be settled in cash, or which we believe to be items that are not core to our current or future operations. Some of these items may not be applicable for the current quarter, however they are expected to be part of our full-year results. These items include the following:We evaluate our revenue on an as reported (U.S. GAAP), constant currency and organic basis. We believe presenting constant currency and organic information provides valuable supplemental information regarding our comparable results, consistent with how we evaluate our performance internally.Willis Towers Watson considers Constant Currency Change, Organic Change, Adjusted Operating Income/Margin, Adjusted EBITDA/Margin, Adjusted Net Income, Adjusted Diluted Earnings Per Share, Adjusted Income Before Taxes, Adjusted Income Taxes/Tax Rate and Free Cash Flow to be important financial measures, which are used to internally evaluate and assess our core operations and to benchmark our operating and liquidity results against our competitors. These non-GAAP measures are important in illustrating what Willis Towers Watson’s comparable operating and liquidity results would have been had the Company not incurred transaction-related and non-recurring items. Willis Towers Watson’s non-GAAP measures and their accompanying definitions are presented as follows:Constant Currency Change – represents the year-over-year change in revenue excluding the impact of foreign currency fluctuations. To calculate this impact, the prior year local currency results are first translated using the current year monthly average exchange rates. The change is calculated by comparing the prior year revenue, translated at the current year monthly average exchange rates, to the current year as reported revenue, for the same period. We believe constant currency measures provide useful information to investors because they provide transparency to performance by excluding the effects that foreign currency exchange rate fluctuations have on period-over-period comparability given volatility in foreign currency exchange markets.Organic Change – excludes the impact of fluctuations in foreign currency exchange rates, as described above and the period-over-period impact of acquisitions and divestitures on current-year revenue. We believe that excluding transaction-related items from our U.S. GAAP financial measures provides useful supplemental information to our investors, and it is important in illustrating what our core operating results would have been had we not included these transaction-related items, since the nature, size and number of these translation-related items can vary from period to period.Adjusted Operating Income/Margin – Income from Operations adjusted for amortization, transaction and integration expenses and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted Operating Income Margin is calculated by dividing adjusted operating income by revenue. We consider adjusted operating income/margin to be important financial measures, which are used to internally evaluate and assess our core operations and to benchmark our operating results against our competitors.Adjusted EBITDA/Margin – Net Income adjusted for provision for income taxes, interest expense, depreciation and amortization, transaction and integration expenses, (gain)/loss on disposal of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted EBITDA Margin is calculated by dividing adjusted EBITDA by revenue. We consider adjusted EBITDA/margin to be important financial measures, which are used to internally evaluate and assess our core operations, to benchmark our operating results against our competitors and to evaluate and measure our performance-based compensation plans.Adjusted Net Income – Net Income Attributable to Willis Towers Watson adjusted for amortization, transaction and integration expenses, (gain)/loss on disposal of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results, the related tax effect of those adjustments and the tax effects of internal reorganizations. This measure is used solely for the purpose of calculating adjusted diluted earnings per share.Adjusted Diluted Earnings Per Share – Adjusted Net Income divided by the weighted-average number of shares of common stock, diluted. Adjusted diluted earnings per share is used to internally evaluate and assess our core operations and to benchmark our operating results against our competitors.Adjusted Income Before Taxes – Income from operations before income taxes adjusted for amortization, transaction and integration expenses, (gain)/loss on disposal of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted income before taxes is used solely for the purpose of calculating the adjusted income tax rate.Adjusted Income Taxes/Tax Rate – Provision for income taxes adjusted for taxes on certain items of amortization, transaction and integration expenses, (gain)/loss on disposal of operations, the tax effects of internal reorganizations, and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results, divided by adjusted income before taxes. Adjusted income taxes is used solely for the purpose of calculating the adjusted income tax rate. Management believes that the adjusted income tax rate presents a rate that is more closely aligned to the rate that we would incur if not for the reduction of pre-tax income for the adjusted items and the tax effects of our internal reorganizations, which are not core to our current and future operations.Free Cash Flow – Cash flows from operating activities less cash used to purchase fixed assets and software for internal use. Free Cash Flow is a liquidity measure and is not meant to represent residual cash flow available for discretionary expenditures. Management believes that free cash flow presents the core operating performance and cash generating capabilities of our business operations.These non-GAAP measures are not defined in the same manner by all companies and may not be comparable to other similarly titled measures of other companies. Non-GAAP measures should be considered in addition to, and not as a substitute for, the information contained within our condensed consolidated financial statements.Reconciliations of these measures are included in the accompanying tables with the following exception.The Company does not reconcile its forward looking non-GAAP financial measures to the corresponding U.S. GAAP measures, due to variability and difficulty in making accurate forecasts and projections and/or certain information not being ascertainable or accessible; and because not all of the information, such as foreign currency impacts necessary for a quantitative reconciliation of these forward-looking non-GAAP financial measures to the most directly comparable U.S. GAAP financial measure, is available to the Company without unreasonable efforts. For the same reasons, the Company is unable to address the probable significance of the unavailable information. The Company provides non-GAAP financial measures that it believes will be achieved, however it cannot accurately predict all of the components of the adjusted calculations and the U.S. GAAP measures may be materially different than the non-GAAP measures.Willis Towers Watson Forward-Looking StatementsThis document contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements and other forward-looking statements in this document by words such as “may”, “will”, “would”, “expect”, “anticipate”, “believe”, “estimate”, “plan”, “intend”, “continue”, or similar words, expressions or the negative of such terms or other comparable terminology. These statements include, but are not limited to, such things as our outlook, future capital expenditures, ongoing working capital efforts, future share repurchases, growth in revenue, the impact of changes to tax laws on our financial results, business strategies and planned acquisitions (including the acquisition of TRANZACT and our proposed acquisition of Unity Group), demand for our services and competitive strengths, goals, the benefits of new initiatives, growth of our business and operations, our ability to successfully manage ongoing organizational and technology changes, including investments in improving systems and processes, our ability to meet financial guidance, and plans and references to future successes, including our future financial and operating results, plans, objectives, expectations and intentions and other statements that are not historical facts. Such statements are based upon the current beliefs and expectations of Willis Towers Watson’s management and are subject to significant risks and uncertainties. Actual results may differ from those set forth in the forward-looking statements. All forward-looking disclosure is speculative by its nature.There are important risks, uncertainties, events and factors that could cause our actual results or performance to differ materially from those in the forward-looking statements contained herein, including the following: the ability of the company to successfully establish, execute and achieve its global business strategy as it evolves; changes in demand for our services, including any decline in consulting services, defined benefit pension plans or the purchasing of insurance; changes in general economic, business and political conditions, including changes in the financial markets; significant competition that the company faces and the potential for loss of market share and/or profitability; the impact of seasonality and differences in timing of renewals; failure to protect client data or breaches of information systems or insufficient safeguards against cybersecurity breaches or incidents; the risk of increased liability or new legal claims arising from our new and existing products and services, and expectations, intentions and outcomes relating to outstanding litigation; the risk the Stanford litigation settlement approval will be overturned on appeal, the risk that the Stanford bar order may be challenged in other jurisdictions, and the risk that the charge related to the Stanford settlement may not be deductible; the risk of material adverse outcomes on existing litigation or investigation matters; changes in the regulatory environment in which the company operates, including, among other risks, the impact of pending competition law and regulatory investigations; various claims, government inquiries or investigations or the potential for regulatory action; the company’s ability to make divestitures or acquisitions and its ability to integrate or manage such acquired businesses (including the recently completed acquisition of TRANZACT and our proposed acquisition of Unity Group); our ability to integrate direct-to-consumer sales and marketing solutions with our existing offerings and solutions; the ability to comply with complex and evolving regulations related to data privacy and cyber security; the ability to successfully manage ongoing organizational changes, including investments in improving systems and processes; disasters or business continuity problems; the potential impact of Brexit; our ability to successfully enhance our billing, collection and other working capital efforts, and thereby increase our free cash flow; the potential impact of the change in the method for determining LIBOR; the ability of the company to properly identify and manage conflicts of interest; reputational damage, including from association with third parties; reliance on third-party services; the loss of key employees; doing business internationally, including the impact of exchange rates; compliance with extensive government regulation; the risk of sanctions imposed by governments, or changes to associated sanction regulations; our ability to effectively apply technology, data and analytics changes for internal operations, maintaining industry standards and meeting client preferences; changes and developments in the insurance industry or the United States healthcare system, including those related to Medicare; the risk that the company may not be able to repurchase the intended number of outstanding shares due to M&A activity or investment opportunities, market or business conditions, or other factors; the inability to protect the company’s intellectual property rights, or the potential infringement upon the intellectual property rights of others; fluctuations in the company’s pension liabilities; the ability of the company to meet its financial guidance, the company’s capital structure, including indebtedness amounts, the limitations imposed by the covenants in the documents governing such indebtedness and the maintenance of the financial and disclosure controls and procedures of each; the ability of the company to obtain financing on favorable terms or at all; adverse changes in the credit ratings of the company; the impact of recent changes to U.S. tax laws, including on our effective tax rate, and the enactment of additional, or the revision of existing, state, federal, and/or foreign regulatory and tax laws and regulations; U.S. federal income tax consequences to U.S. persons owning at least 10% of the company’s shares; changes in accounting principles, estimates or assumptions; fluctuation in revenue against the company’s relatively fixed or higher than expected expenses; the laws of Ireland being different from the laws of the United States and potentially affording less protections to the holders of our securities; and the company's holding company structure potentially preventing it from being able to receive dividends or other distributions in needed amounts from our subsidiaries. These factors also include those described under “Risk Factors” in the company’s most recent 10-K filing and subsequent filings filed with the SEC.  Although we believe that the assumptions underlying our forward-looking statements are reasonable, any of these assumptions, and therefore also the forward-looking statements based on these assumptions, could themselves prove to be inaccurate. In light of the significant uncertainties inherent in the forward-looking statements included in this document, our inclusion of this information is not a representation or guarantee by us that our objectives and plans will be achieved.Our forward-looking statements speak only as of the date made and we will not update these forward-looking statements unless the securities laws require us to do so. In light of these risks, uncertainties and assumptions, the forward-looking events discussed in this document may not occur, and we caution you against relying on these forward-looking statements.ContactINVESTORSInvestor Relations | +1 215 246 3961 | Investor_Relations@willistowerswatson.com WILLIS TOWERS WATSONSupplemental Segment Information(In millions of U.S. dollars)(Unaudited) __________(i) Components of revenue change may not add due to roundingSEGMENT OPERATING INCOME (i) __________(i) Segment operating income excludes certain costs, including amortization of intangibles, transaction and integration expenses, and to the extent that the actual expense based upon which allocations are made differs from the forecast/budget amount, a reconciling item will be created between internally allocated expenses and the actual expenses reported for U.S. GAAP purposes. SEGMENT OPERATING MARGINSRECONCILIATIONS OF SEGMENT OPERATING INCOME TO INCOME FROM OPERATIONS BEFORE INCOME TAXES               __________(i)  Includes transaction costs related to the TRANZACT acquisition in 2019, and transaction and integration expenses related to the Merger and the acquisition of Gras Savoye for prior years.(ii)  Includes certain costs, primarily related to corporate functions which are not directly related to the segments, and certain differences between budgeted expenses determined at the beginning of the year and actual expenses that we report for U.S. GAAP purposes.WILLIS TOWERS WATSONReconciliations of Non-GAAP Measures (In millions of U.S. dollars, except per share data)(Unaudited)RECONCILIATIONS OF NET INCOME ATTRIBUTABLE TO WILLIS TOWERS WATSON TO ADJUSTED DILUTED EARNINGS PER SHARE__________(i) The tax effect was calculated using an effective tax rate for each item.(ii) Per share values and totals may differ due to rounding.__________(i) The tax effect was calculated using an effective tax rate for each item.(ii) Per share values and totals may differ due to rounding.RECONCILIATIONS OF NET INCOME TO ADJUSTED EBITDA RECONCILIATIONS OF INCOME FROM OPERATIONS TO ADJUSTED OPERATING INCOME RECONCILIATIONS OF GAAP INCOME TAXES/TAX RATE TO ADJUSTED INCOME TAXES/TAX RATE __________(i) The tax effect was calculated using an effective tax rate for each item.RECONCILIATION OF CASH FLOWS FROM OPERATING ACTIVITIES TO FREE CASH FLOWWILLIS TOWERS WATSONConsolidated Statements of Income(In millions of U.S. dollars, except per share data)(Unaudited)WILLIS TOWERS WATSONConsolidated Balance Sheets(In millions of U.S. dollars, except share data)(Unaudited)_________(i) Equity includes (a) Ordinary shares $0.000304635 nominal value; Authorized 1,510,003,775; Issued 128,689,930 (2019) and 128,921,530 (2018); Outstanding 128,689,930 (2019) and 128,921,530 (2018); (b) Ordinary shares, €1 nominal value; Authorized and Issued 40,000 shares in 2019 and 2018; and (c) Preference shares, $0.000115 nominal value; Authorized 1,000,000,000 and Issued none in 2019 and 2018.WILLIS TOWERS WATSONConsolidated Statements of Cash Flows(In millions of U.S. dollars)(Unaudited)_________(i)  As a result of the acquired TRANZACT collateralized facility, cash, cash equivalents and restricted cash at the end of the year included $8 million of restricted cash at December 31, 2019, which is included within prepaid and other current assets on our consolidated balance sheet. There were no restricted cash amounts held at December 31, 2018 and 2017."
    },
    {
        "title": "Employers boosting efforts to create respect and dignity at work",
        "subtitle": "",
        "date": "Feb 5, 2020 10:53AM EST",
        "content": "ARLINGTON, Va., Feb.  05, 2020  (GLOBE NEWSWIRE) -- Amid growing recognition of a connection to business performance, more employers plan to bolster their efforts to build a culture of “workplace dignity,” according to new research by Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, in collaboration with Robert F. Kennedy Human Rights. The research also revealed a great disparity between employees’ perspectives on how they are treated in the workplace and those of employers.“Human rights don’t give way at the workplace door,” said Kerry Kennedy, president of Robert F. Kennedy Human Rights. “People spend countless hours at work, and ‘just and favorable conditions of work’ are elemental to the United Nations Universal Declaration of Human Rights.” A culture of workplace dignity promotes an environment in which employees can experience a sense of self-respect, pride and self-worth, and it influences an organization’s ability to foster wellbeing, engage talent and drive business results. The Willis Towers Watson Workplace Dignity Survey examined barriers employers face in building a culture of dignity over the next three years.Virtually all employers (94%) recognize workplace dignity will be important to their future success, including their ability to attract and retain talent, promote employee wellbeing, engage employees and boost productivity. That’s a big increase from 70% over the past three years; however, three in 10 employers (30%) have experienced difficulties in building and maintaining a culture of dignity. One in three employers (34%) cited a lack of diversity as a barrier to a culture of dignity while one in four (26%) cited abuse of power (e.g., not holding employees accountable for their actions) as a barrier.In response, the vast majority of employers (87%) plan to take steps to overcome barriers and build a culture of dignity over the next three years, up sharply from only 59% in the previous three years. Among the key barriers they plan to address are lack of diversity (89%), discrimination (88%), exclusion (86%), abuse of power (85%) and bullying (82%) within the workplace.“Employers increasingly recognize that providing a culture of workplace dignity truly matters,” said John Bremen, managing director, Human Capital and Benefits, Willis Towers Watson. “The concept of workplace dignity has many facets starting with respect and relationships at work. Yet it also extends to a sense of meaning and pride in one’s work, and ensuring the resources to thrive physically, emotionally, financially and socially. It’s very encouraging to see more employers making this a high priority.”Indeed, nine in 10 employers (91%) say psychological safety — allowing employees to speak up without fear of negative consequences — will be an important priority in building or maintaining a culture of dignity in the next three years, compared with 50% over the past three years. Providing employees with learning and growth opportunities will also receive heightened attention in the next three years (90%), compared with the past three years (59%), which will be critical given the focus on job reskilling. Almost as many employers (88%) said they will make inclusion and belonging — fostering a work environment in which employees are valued and heard — a top priority the next three years, versus 58% over the past three years.Gap between employers’ and employees’ perspectivesResults from the Workplace Dignity Survey and the Willis Towers Watson 2019/2020 Global Benefits Attitudes Survey found significant gaps exist between U.S. employees’ and employers’ perspectives in several key workplace areas:“Employers agree that a greater focus on dignity can create a positive impact on multiple stakeholders,” said Steve Nyce, senior economist at Willis Towers Watson. “And with a keen understanding of the key dimensions of dignity, they can set priorities and develop strategies to overcome the barriers to workplace dignity. With a culture of dignity, employees will feel more respected, less likely to leave and more likely to be highly engaged — all of which can help improve employee and company performance.”“These results affirm that a thriving workplace honors the dignity — the inherent value and worth — of all workers,” Kennedy concluded, “and responsible leaders must take specific actions both to advance workplace dignity and to close the perception gap between what their employees report they are experiencing and what employers think their workplace cultures are delivering.\"About the surveysThe Willis Towers Watson Workplace Dignity Survey was conducted in August and September 2019. Respondents included executives from 129 large and midsize U.S. companies representing 1.4 million employees across a wide range of industries. The survey was conducted in collaboration with Robert F. Kennedy Human Rights.The Willis Towers Watson 2019/2020 Global Benefits Attitudes Survey measured attitudes of over 40,000 employees at medium and large private sector companies in 27 countries. A total of 8,000 U.S. workers participated in the survey, which was conducted between July and September 2019. About Willis Towers Watson Willis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.About Robert F. Kennedy Human RightsRobert F. Kennedy Human Rights is a non-partisan, not-for-profit organization that has worked to achieve Robert F. Kennedy’s dream of a more just and peaceful world since 1968. In partnership with local activists, the organization advocates for key human rights issues, pursuing strategic litigation at home and around the world. And to ensure lasting change, it fosters a social-good approach to business and investment, and educates millions of students on human rights and social justice.Media contacts:Ed Emerman: +1 609 275 5162  eemerman@eaglepr.com (for Willis Towers Watson)Elizabeth Gildersleeve: +1 917 407 7928  gildersleeve@rfkhumanrights.org (for Robert F. Kennedy Human Rights)"
    },
    {
        "title": "Renewable energy industry must face up to new realities says Willis Towers Watson",
        "subtitle": "",
        "date": "Feb 5, 2020 3:00AM EST",
        "content": "LONDON, Feb.  05, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, today launched its inaugural Renewable Energy Market Review for 2020. The Review identifies several new realities that the industry needs to face up to at the beginning of the new decade. These new realities include:Graham Knight, Head of Global Natural Resources, Willis Towers Watson, commented, “We are delighted to be launching this report, but we go to press at a time of unprecedented change in both the renewable and insurance/risk transfer industries. As the industry faces up to these new challenges, we are fully committed to supporting it through the coming evolution; all skills at our disposal will help our renewables clients address this less than certain future.”The full report can be accessed at https://www.willistowerswatson.com/en-GB/Insights/2020/01/renewable-energy-market-review-2020About Willis Towers Watson Willis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactSarah Booker: +44 (0)7917 722040sarah.booker@willistowerswatson.com "
    },
    {
        "title": "Willis Towers Watson introduces suite of services in support of ICHRAs — individual coverage health reimbursement arrangements",
        "subtitle": "",
        "date": "Feb 4, 2020 9:14AM EST",
        "content": "ARLINGTON, Va., Feb.  04, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, announced today that they now offer individual coverage health reimbursement arrangement (ICHRA) solutions to existing and new employer clients through their employee Health Benefits Consulting and Administration businesses. Since 2006, Willis Towers Watson has partnered with over 100 health insurance carriers, guiding millions of people to find and enroll in individual health insurance coverage.“Since the final health reimbursement arrangement (HRA) rule last June, companies were given a potentially game-changing way to provide health care coverage to their populations that could become the 401(k) of health insurance,” said John Barkett, senior director, Policy Affairs, Willis Towers Watson. “Employers that want to forgo the ongoing exercise of managing plan design, carriers, networks and formularies can now meet their employees’ diverse needs and improve the predictability of annual health care costs for their business. The ICHRA model might be the perfect option for companies committed to keeping the long-standing, employer-sponsored health care tradition but want to swap the one-size-fits-all group health insurance plan for a more personalized, defined contribution approach.”In this new type of health insurance coverage, employees choose where their benefit dollars are spent by purchasing their preferred plan on the individual market and receiving a reimbursement through an employer-sponsored HRA.Willis Towers Watson helps employers decide if an ICHRA is right for their organization by:In addition, Willis Towers Watson provides employer subsidy management through HRA administration, while helping employers comply with new ICHRA reporting requirements.With health plan selection now in the hands of employees, Willis Towers Watson also provides employers with configurable communications to ensure their employees are well prepared for the transition from group coverage to individual health insurance. The offering includes best-in-class navigation assistance while shopping for and enrolling in individual health insurance, and employee advocacy for the life of the enrollment.“The new HRA rule allows Willis Towers Watson to continue to do what we do best: analyze an employee population, evaluate which health plan and benefit solutions address key concerns, and then build and administer health and benefit plans that manage employer cost and risk — all while keeping workforces healthy and productive. ICHRA presents one new option for employers in our toolkit as we consult on the best fit for our clients’ needs,” said Ben Pajak, Individual Marketplace leader, Benefits Delivery and Administration, Willis Towers Watson.Over 120 Fortune 500 companies use Willis Towers Watson’s Individual Marketplace, with a remarkable 98% participant satisfaction rate. Their fully owned and integrated HRA administration solution has delivered over $14 billion in reimbursements for individual health insurance premiums and out-of-pocket costs. Willis Towers Watson’s decades of experience advising both employers and individuals on their health care benefits positions them as a leader in developing and delivering effective ICHRA solutions.For more information on Willis Towers Watson’s ICHRA suite of services, please visit ichracoverage.com.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactJulia Mellon: +1 212 584 5474julia@blissintegrated.com "
    },
    {
        "title": "2019 InsurTech investment reaches all-time high with one-third of historic total – almost $2 billion invested in Q4 alone",
        "subtitle": "",
        "date": "Jan 30, 2020 5:02AM EST",
        "content": "LONDON, Jan.  30, 2020  (GLOBE NEWSWIRE) -- Total new worldwide funding commitments to the InsurTech sector in 2019 were US$6.37 billion, 33.9% of the historical total, following a record-breaking $1.99 billion of investment in 75 projects during Q4 2019, according to the new Quarterly InsurTech Briefing from Willis Towers Watson, a leading global advisory, broking and solutions company (NASDAQ: WLTW).During the year, eight “unicorn making” rounds of investment took place, creating five new unicorns (privately held start-ups valued at over $1 billion), of only 10 InsurTechs globally that have reached this threshold. 2019 also saw a 90% jump in investment rounds that exceeded $40 million.In Q4 2019, InsurTechs raised $244 million in early stage funding. P&C start-ups continued to take a greater share of total InsurTech investment than their life and health counterparts, continuing a trend seen since Q3 2016. Early stage funding to P&C companies grew to 69%, up slightly compared with 2019 Q3. Distribution- and MGA-focussed InsurTechs accounted for 57% of all deals by number.Dr Andrew Johnston, global head of InsurTech at Willis Re, said: “2019 was the year when individual InsurTechs began to come to the fore to lead in specific parts of the market, whether in certain lines of business or in the use of particular technologies. For example, UK-based Concirrus is now clearly the forerunner in behavioural-based analytics for the specialty markets. But while InsurTech news is awash with the huge valuations and postulations of the art of the possible, there is also a very real story that is not so positive – individual InsurTech cessations. The number is very difficult to calculate, but our data indicates that during the past three years, approximately 184 funded InsurTechs might have closed their doors.”The latest briefing concludes a year-long review of the ‘functional chain,’ with claims and settlement as the topic in focus. It includes detailed discussions of 10 InsurTechs: Metromile, Benekiva, ClaimVantage, Claimspace, Claim Central, DeepFraud, Global Parametrics, Adjoint, Banqu, and Spixii. The briefing also includes a discussion with Larry Calhoun and Roman Buegler of Munich Re about the reinsurer’s remote industries natural catastrophe claims assessment system; an examination of 2019’s seismic fundraising rounds by InsurTechs focussed on global life and health service provision; and thought leadership from Tom Helm, head of Claims Consulting at Willis Towers Watson’s Insurance Consulting and Technology business, on end-to-end claims technologies.Helm said: “Although the very simplest common claims, such as automobile windscreen, may already be handled entirely by automated systems at some insurers; end-to-end automation can never work in all scenarios, even in consumer lines. Some aspects of the claims process require complex human judgement or investigation, and other cases, such as the need to empathise with a customer who needs support, demand the human touch. This means that claims handlers will remain in the driving seat. It is essential that automated mechanisms are able to identify when a situation needs human intervention, making effective management of the interaction between handler and machine a critical consideration.”View the full report hereAbout Willis ReOne of the world's leading reinsurance brokers, Willis Re is known for its world-class analytics capabilities, which it combines with its reinsurance expertise in a seamless, integrated offering that can help clients increase the value of their businesses. Willis Re serves the risk management and risk transfer needs of a diverse, global client base that includes all of the world's top insurance and reinsurance carriers as well as national catastrophe schemes in many countries around the world. The broker's global team of experts offers services and advice that can help clients make better reinsurance decisions and negotiate optimum terms. For more information, visit willistowerswatson.com/Solutions/reinsuranceAbout Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimise benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas – the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.comMedia contactAnnie Roberts: +44 20 3124 7080annie.roberts@willistowerswatson.com"
    },
    {
        "title": "P&C insurers’ aspirations of implementing advanced analytics into key areas of their business remain elusive",
        "subtitle": "",
        "date": "Jan 28, 2020 11:44AM EST",
        "content": "ARLINGTON, Va., Jan.  28, 2020  (GLOBE NEWSWIRE) -- U.S. and Canadian property & casualty (P&C) insurers revealed they were either overly ambitious in their goals for implementing advanced analytics or had their long-term vision blurred by the realities of day-to-day business and market challenges. Their slower progression in using advanced analytics cuts across the key areas of their business — chiefly customer centricity, claim management and telematics — according to leading global advisory, broking and solutions company Willis Towers Watson’s (NASDAQ: WLTW) new P&C Insurance Advanced Analytics Survey Report, and prior report on this topic from two years ago.“Certainly, there is no lack of ambition when it comes to P&C insurers wanting to use data and advanced analytics for the betterment of their business,” said Lisa Sukow, director, North America P&C practice, Insurance Consulting and Technology, Willis Towers Watson. “But by their own admission, most are falling short of those aspirations right now. One way to recondition their resolve is to align strategy and analytics by identifying what’s core to achieving a competitive edge and steer efforts and resources accordingly. They should avoid getting carried away with analytics for analytics’ sake.”Nearly half (45%) said the prime culprit inhibiting them from making more progress in using advanced analytics centers on problems with information bottlenecks where people and systems typically need to interact. They also cited handling infrastructure constraints (37%) and a lack of sufficient staff to analyze data (37%) — underscored by its notable 13 percentage point rise compared to two years ago — as other top obstacles preventing them from becoming more data-driven.According to the survey, participants surely expected they would be further along than they are in using advanced analytics for enhancing ever-important customer centricity. For example, more than three-quarters (77%) expected to be using internal customer data as a source by now, but only 54% are. Similar gaps in expected versus actual use exist for social media (46% versus 26%) and clickstream (34% versus 14%).“Many insurers collect customer data as part of an application or claim process, which can be of wider value when suitable analytics are run,” said Nathalie Begin, director, North America P&C practice, Insurance Consulting and Technology, Willis Towers Watson. “However, insurers are not maximizing their internal customer data utilization — they shouldn’t overlook what is readily available. They should also take it a step further and supplement internal data selectively with external data sets to improve results.”Survey findings showed all lines of business behind schedule with their use of advanced analytics for claim management, with one notable exception: 53% of commercial lines insurers are utilizing unstructured internal claim information as a nontraditional data source, compared to 41% two years ago. The usage in claims varies by line of business, e.g., more than half (54%) of workers compensation writers said they used advanced analytics in claims, compared to 10% in commercial property.Insurers use of telematics data demonstrated relatively slow volume growth for both personal auto (28% to 30%) and homeowners (2% to 9%) over the last two years. In addition, a relatively high percentage of carriers said they have no plans to use telematics across these and other lines of business in the next five years.Progress around the use of artificial intelligence and machine learning fell short of carriers’ expectations, though the percentage of respondents who use both to build risk models for decision making (26%) and reduce manual input (22%) doubled in the last two years. Over two-thirds (69%) characterized their current state of InsurTech integration as early stage, and more than one-fifth (22%) said they’re not doing anything in this area.“There are levers insurers can pull to sharpen their focus around implementing advanced analytics, such as reviewing staff allocation to get the most from employees who can devote sufficient time and develop their skills in the process,” said Sukow. “Overall, insurers should plot a course for how to apply data and analytics but remain flexible to take advantage of market and technical developments as they arise. Think of the whole process of enhancing analytics capability as a journey, not a destination.”About the surveyWillis Towers Watson’s 2019 Advanced Analytics Survey asked P&C insurance executives in the U.S. and Canada for their insights on the future of advanced analytics relative to where we are today. Ninety-nine P&C insurers participated in two web-based surveys conducted in the second quarter of 2019, from April to July 2019. There were 66 multiline carriers, 23 commercial and 10 personal line carriers. Respondents included eight of the top 20 U.S. P&C insurers and eight of the top 20 Canadian P&C insurers.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactIleana Feoli: +1 212 309 5504ileana.feoli@willistowerswatson.com"
    },
    {
        "title": "Willis Towers Watson enhances modelling Cyber suite with unique SecurityScorecard ratings platform",
        "subtitle": "",
        "date": "Jan 28, 2020 9:00AM EST",
        "content": "ARLINGTON, Va., Jan.  28, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson today announces further expansion of its proprietary cyber risk quantification modelling platform, Cyber Quantified, with the integration of SecurityScorecard security ratings. Cyber Quantified uses predictive analytics to quantify an organization’s risk of cyber loss due to network outage or data compromise.SecurityScorecard, the global leader in cybersecurity ratings, reviews a company’s technical security and can accurately forecast potential data breach frequencies and related impacts. The partnership will enable SecurityScorecard’s proprietary system to be integrated into Willis Towers Watson’s Cyber Quantified suite of analytics. Ratings are provided to companies which can be used to improve their cybersecurity as well as analyzing the security posture of third-party vendors.Tom Srail, Director, Client Relationship Management, Willis Towers Watson, said “Our clients are seeking advanced solutions to better understand the frequency and severity of cyber risk using predictive analytics. This latest enhancement to our cyber analytical tool gives not only increased decision support intelligence, but also provides information security professionals with actionable data to improve their security posture and reduce vulnerabilities. The integration of Cyber Quantified and SecurityScorecard puts Willis Towers Watson in an unparalleled position to assist companies in cyber risk quantification and related risk assessment.”“We are thrilled that Willis Towers Watson has selected SecurityScorecard's security rating services as part of their Cyber Quantified platform,” said Dr. Aleksandr Yampolskiy, CEO and co-founder of SecurityScorecard. “As the only security ratings company with over a million continuously rated companies and a commitment to trust and transparency, we are the best-in-class rating partner for highly regulated industries, with a targeted focus in insurance.”   SecurityScorecard offers a new data point to the Cyber Quantified model in determining a company’s breach frequency and evaluation of how well the company can protect its data assets and prevent a breach. The Willis Towers Watson Cyber Quantified product suite also enables improved accuracy in forecasted cyber insurance as well as evaluating risk scenarios based on mitigating financial risk to the business.About Willis Towers Watson Willis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has over 40,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.About SecurityScorecardSecurityScorecard is the global leader in cybersecurity ratings and the only service with over a million companies continuously rated. Founded in 2013 by security and risk experts Dr. Alex Yampolskiy and Sam Kassoumeh, SecurityScorecard’s patented rating technology is used by over 5,000 organizations for self-monitoring, third-party risk management, board reporting and cyber insurance underwriting; making all organizations more resilient by allowing them to easily find and fix cybersecurity risks across their externally facing digital footprint. SecurityScorecard is the only provider of instant risk ratings that automatically map to vendor cybersecurity questionnaire responses - providing a true 360 degree view of risk. SecurityScorecard continues to make the world a safer place by transforming the way companies understand, improve and communicate cybersecurity risk to their boards, employees and vendors. Every company has the universal right to their trusted and transparent Instant SecurityScorecard rating. For more information, visit securityscorecard.com or connect with us on LinkedIn.Media contactSarah Booker: +44 (0)7917 722040sarah.booker@willistowerswatson.com "
    },
    {
        "title": "Annual natural catastrophe loss costs decline again in 2019",
        "subtitle": "",
        "date": "Jan 23, 2020 8:03AM EST",
        "content": "LONDON, Jan.  23, 2020  (GLOBE NEWSWIRE) -- Insured losses from major natural catastrophes in 2019 totalled roughly $53.0 billion, about 18% lower than the annual average since 2011. This continues a relative period of calm compared to 2017, when the total loss reached a peak of USD 143 billion, according to the Summary of Natural Catastrophe Events 2019, published today by Willis Re, the reinsurance division of Willis Towers Watson, the leading global advisory, broking and solutions company (NASDAQ:WLTW).The total loss figure again arises from a series of smaller and medium-sized events, since no very large natural catastrophe losses were incurred. In contrast, the annual average of $65 billion is driven upwards by peak annual losses of $120 billion in 2011 and $143 billion in 2017, which each brought multiple USD 10 billion+ events. When the average excludes these peak years, the 2019 total is 14% above the annual average.*Willis Re estimates, presented in USD at 1 December exchange rates for the year reportedThe largest insured catastrophe losses in 2019 were in Japan, where tropical cyclones Faxai in September and Hagibis in October delivered insured losses of circa USD 7.0 billion and USD 8.0 billion respectively. In the US, the largest events were Hurricane Dorian with wide ranging loss estimates and a thunderstorm affecting the High and Central Plains and the eastern US, which brought insured losses of between USD 3.0 billion and 4.0 billion. Elsewhere in the world, no billion-dollar losses occurred. At year-end, the total reported loss cost of Australia’s wildfires, which straddled 2019/20, had reached roughly USD 900 million. The loss now exceeds USD 1 billion based on current exchange rates, so the 2019 share of the total may reach the billion-dollar threshold as further claims and their dates of loss are reported.North America had the largest insured catastrophe-loss bill, with around 46% of the global total in 2019, closely followed by Asia Pacific with 38%.Karl Jones, Head of Catastrophe Analytics, Willis Re International, said: “Despite this being a lower than average year compared to the previous decade, we have still seen some extreme and unusual events, including back-to-back typhoon losses in Japan, and the large number and scale of bushfires in Australia.”Vaughn Jensen, Executive Vice President and Head of North America Catastrophe Analytics at Willis Re, said: “The year will come as a relative relief to reinsurers, following the extremely costly events of 2017 and 2018. However, the year did bring the strongest-ever landfalling hurricane in the Atlantic, Hurricane Dorian.”View the complete report hereAbout Willis ReOne of the world's leading reinsurance brokers, Willis Re is known for its world-class analytics capabilities, which it combines with its reinsurance expertise in a seamless, integrated offering that can help clients increase the value of their businesses. Willis Re serves the risk management and risk transfer needs of a diverse, global client base that includes all of the world's top insurance and reinsurance carriers as well as national catastrophe schemes in many countries around the world. The broker's global team of experts offers services and advice that can help clients make better reinsurance decisions and negotiate optimum terms. For more information, visit willisre.com.About Willis Towers WatsonWillis Towers Watson (NASDAQ:WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has over 40,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas – the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.comContacts:MediaAnnie Roberts: +44 20 3124 7080 | Annie.Roberts@willistowerswatson.comInvestorsRich Keefe: +1 215 246 3961 | Rich.Keefe@willistowerswatson.com"
    },
    {
        "title": "Willis Towers Watson included in 2020 Bloomberg Gender-Equality Index",
        "subtitle": "",
        "date": "Jan 21, 2020 7:30AM EST",
        "content": "ARLINGTON, Va., Jan.  21, 2020  (GLOBE NEWSWIRE) -- Leading global advisory, broking and solutions company, Willis Towers Watson (NASDAQ: WLTW) today announced that it is one of 325 companies across 50 industries included in the 2020 Bloomberg Gender-Equality Index (GEI). The GEI expanded in 2020 to represent 42 countries and regions, including firms headquartered in the Czech Republic, New Zealand, Norway, Philippines, Poland, and Russia for the first time. Companies range from a variety of industries, including automotive, banking, consumer services, engineering and construction, and retail.“We are honored to once again be recognized by the Bloomberg Gender-Equality Index,” said John Haley, CEO Willis Towers Watson. “At Willis Towers Watson, we are focused on supporting our female talent and committed to increasing gender balance in leadership levels across the company. We believe a culture of inclusion and diversity is critical and fundamental to everything we do.”The GEI tracks the financial performance of public companies committed to supporting gender equality through policy development, representation, and transparency. The reference index measures gender equality across five pillars: female leadership and talent pipeline, equal pay and gender pay parity, inclusive culture, sexual harassment policies, and pro-women brand. This year, Bloomberg expanded the eligibility for inclusion in the index to nearly 6,000 companies across 84 countries and regions.The 2019 GEI included 230 companies headquartered across 36 countries and regions. Willis Towers Watson was also included in the 2019 GEI.\"The 325 companies included in the 2020 GEI have shown their commitment to transparency and demonstrated leadership in gender-related data reporting,\" said Peter T. Grauer, Chairman of Bloomberg. \"Disclosure of company statistics and practices is an important first step in supporting gender equality globally.\"Through disclosure of gender-related metrics using the GEI framework, the firms included in the 2020 GEI have provided a comprehensive look at their investment in workplace gender equality and the communities in which they operate. Willis Towers Watson was included in this year’s index for scoring at or above a global threshold established by Bloomberg to reflect a high level of disclosure and overall performance across the framework’s five pillars.Both the framework and the GEI are voluntary and have no associated costs. The GEI is a reference index and is not for use as a financial benchmark. The index is not ranked. While all public companies are encouraged to disclose supplemental gender data for their company’s investment profile on the Bloomberg Terminal, those that have a market capitalization of USD1 billion are eligible for inclusion in the index. To learn more please visit the GEI website. Bloomberg Terminal subscribers can access the GEI at {BGEI }.Media contacts Miles RussellWillis Towers WatsonT +44 (0)203 124 7446  M +44 (0)7903262118 Miles.russell@willistowerswatson.com   Veronika HenzeBloomberg LP+1-646-324-1596vhenze@bloomberg.netLiidia LiuksilaBloomberg LP +1 212-617-5424Lliuksila@bloomberg.net  About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has more than 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com."
    },
    {
        "title": "Willis Towers Watson appoints Shai Ganu as Executive Compensation Global Practice Leader",
        "subtitle": "",
        "date": "Jan 21, 2020 2:00AM EST",
        "content": "SINGAPORE, Jan.  21, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, today announces the appointment of Shai Ganu as its Executive Compensation Global Practice Leader.In his new role, Shai is responsible for leading the executive compensation team globally. With a team of over 400 consultants across six continents, the company’s market-leading executive compensation consulting practice is one of the world’s largest. Shai will be based in Singapore.Commenting on the appointment, Mark Reid, global head of Rewards at Willis Towers Watson (WTW) said: “Shai is a renowned expert and thought leader on issues related to executive compensation, board effectiveness and human-capital governance. With his innovative mindset and experience working with both Boards and management, Shai is extraordinarily well positioned to lead our team in helping clients design pay arrangements that are aligned with performance, balance the interests of key stakeholders and stand up to external scrutiny.”   Shai said: \"How executive pay is set, managed and communicated is becoming increasingly sensitive. Executive pay programs have also become more complex. The evolution of corporate governance models around the world behooves us to support our clients’ boards and management teams to navigate these complex changes. I am excited for this opportunity to work with our colleagues globally and provide trusted advisory support to our clients to help balance the interests of all stakeholders”.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas – the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactClara Goh: +65 6958 2542 | clara.goh@willistowerswatson.com"
    },
    {
        "title": "U.S. companies will respond to proxy advisor voting recommendations, if allowed by SEC",
        "subtitle": "",
        "date": "Jan 15, 2020 9:10AM EST",
        "content": "ARLINGTON, Va., Jan.  15, 2020  (GLOBE NEWSWIRE) -- The majority of U.S. publicly traded companies say they won’t remain silent if given the opportunity by the Securities and Exchange Commission (SEC) to respond to proxy advisor voting recommendations, according to a poll by Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company. The poll also found that companies and their compensation committees will place greater emphasis on “people” issues over the next few years.In November, the SEC proposed amendments to its proxy solicitation rules to improve the accuracy and transparency of proxy voting advice. The proposed rule changes would require proxy advisors to disclose any potential conflicts of interest to clients, allow companies to provide feedback on proxy advice (including factual errors) before it is disseminated to institutional shareholders, and permit companies to attach their own hyperlinked statement to the proxy advisors’ recommendations.A large majority of companies (83%) believe the regulations, if finalized, will cause proxy advisors to be more transparent, and 40% would communicate directly to institutional investors with hyperlinked statements to proxy advisor recommendations if they want to provide further communication on their executive pay philosophy. More specifically, 81% would speak up if they found a factual error; six in 10 (59%) companies consider this to be a big problem. Additionally, if companies disagreed with proxy advisor testing methodology, or if they received against voting recommendations, nearly half (46% and 47%, respectively) said they would provide feedback.“We expect companies will welcome the rule changes, if enacted, and take advantage of the opportunities to improve their communication with proxy advisory firms,” said Don Delves, North America head of Executive Compensation, Willis Towers Watson. “These proposals are, above all, about greater transparency and clarity around pay issues and recommendations. They could go a long way toward eliminating errors and ultimately help shareholders make informed proxy voting decisions.”The poll also revealed that companies and their compensation committees will be placing greater emphasis on people issues over the next few years. This comes following an earlier SEC proposal to expand Form 10-K disclosure of human capital measures to enhance shareholder understanding of their importance. More than nine in 10 respondents (92%) say managing human capital resources will be important to their success over the next three years, compared to 71% over the past three years. Additionally, nearly three in four respondents (72%) believe their compensation committees will oversee fair pay and gender pay issues in the next three years, compared to 52% who do so currently. More than half (54%) also say their compensation committees will be responsible for inclusion and diversity issues in the next three years, up from 45%, currently.“The ongoing push to embrace inclusion and diversity initiatives and other critical human capital issues, such as fair and gender pay, is clearly having an impact at all levels of organizations. And this includes compensation committees. While they historically oversee Total Rewards and succession planning programs, some will broaden their focus to include additional human capital elements of culture, reskilling and wellbeing — and their impact on organizational performance,” concluded Delves.About the survey  The Willis Towers Watson poll was conducted in December 2019 and reflects responses from compensation and human resource professionals at 105 publicly traded U.S. companies.About Willis Towers WatsonWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries and markets. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.Media contactEd Emerman: +1 609 275 5162eemerman@eaglepr.com"
    },
    {
        "title": "Willis Towers Watson to Announce Fourth Quarter and Full Year 2019 Earnings on February 6, 2020",
        "subtitle": "",
        "date": "Jan 10, 2020 10:57AM EST",
        "content": "ARLINGTON, Va. and LONDON, Jan.  10, 2020  (GLOBE NEWSWIRE) -- Willis Towers Watson (NASDAQ: WLTW), a leading global advisory, broking and solutions company, will announce its financial results for the fourth quarter and full year 2019 on Thursday February 6, 2020 before the market opens.The company will host a conference call to discuss its financial results at 9:00 a.m. Eastern Time on February 6, 2020. A live broadcast of the conference call will be available online at the Investor Relations section of www.willistowerswatson.com.An online replay at www.willistowerswatson.com will be available shortly after the call.  A telephonic replay of the call will also be available for 24 hours at 404-537-3406, conference ID 6187339.ABOUT WILLIS TOWERS WATSONWillis Towers Watson (NASDAQ: WLTW) is a leading global advisory, broking and solutions company that helps clients around the world turn risk into a path for growth. With roots dating to 1828, Willis Towers Watson has 45,000 employees serving more than 140 countries. We design and deliver solutions that manage risk, optimize benefits, cultivate talent, and expand the power of capital to protect and strengthen institutions and individuals. Our unique perspective allows us to see the critical intersections between talent, assets and ideas — the dynamic formula that drives business performance. Together, we unlock potential. Learn more at willistowerswatson.com.CONTACTINVESTORSRich Keefe | +1 215 246 3961 | rich.keefe@willistowerswatson.com"
    }
]