[
    {
        "title": "Xcel Energy Sets Single-Year Record Cutting Carbon",
        "subtitle": "",
        "date": "Feb 26, 2020 9:00AM EST",
        "content": "\nCompany achieves a 10% decline in emissions from 2018-2019\n    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy hit a significant milestone in its quest to deliver 100% carbon-free electricity to customers by 2050. The company recorded its largest single-year drop in emissions in 2019, cutting carbon by 5.6 million tons, a more than 10% reduction in one year. Since 2005, the company has reduced carbon emissions by 44% as it leads the nation’s clean energy transition.\n\n“We’re making tremendous progress on our clean energy journey. Our 2019 carbon results demonstrate our ability to transition to low-carbon energy resources while keeping service reliable and customer bills low,” said Ben Fowke, chairman, president and CEO of Xcel Energy.\n\nSeveral factors contributed to these results. The company increased wind generation on its system, with wind energy making up more than 20% of its energy supply last year. The increase is due to the completion of three significant wind projects in 2018 and 2019, including Rush Creek in Colorado, and Hale and Bonita in Texas. Other factors include flexible coal plant operations, strong performance from the company’s nuclear fleet and low natural gas prices, which allowed Xcel Energy to continue reducing coal generation.\n\nXcel Energy’s 2019 carbon reductions are well ahead of its industry, which is ahead of any other part of the economy. The electric industry is on pace to reduce carbon emissions about 30% in 2019 from 2005 levels, according to preliminary results from the U.S. Energy Information Administration.\n\n“Just as we’re committed to reducing carbon emissions from the electricity we provide, we’re also working to reduce greenhouse gas emissions from our natural gas business and we’re taking several ambitious steps to do so,” said Fowke.\n\nXcel Energy has joined ONE Future, which is a consortium of natural gas companies working together to voluntarily reduce methane emissions below 1%, by 2025. That’s a level that studies show minimizes impact on the environment.\n\nXcel Energy has pledged to keep its own methane emissions to less than .2% in its natural gas operations. The company will report its methane emissions annually to ONE Future, which has reporting standards that go beyond what regulations currently require.\n\nXcel Energy has also invested more than $1 billion to improve its natural gas pipelines and tighten its system. The company also participates in EPA’s voluntary Natural Gas STAR and its Methane Challenge program.\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200226005126/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy Elects Two New Board Members",
        "subtitle": "",
        "date": "Feb 20, 2020 9:00AM EST",
        "content": "\nNetha Johnson and George Kehl will join the board, effective March 1\n    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy has elected two new members to its board of directors, effective March 1.\n\nNetha Johnson is an executive with more than two decades of leadership experience in billion-dollar global companies, including Albemarle Corporation, where he currently serves as President of Bromine Specialties and Global IT.\n\nPrior to joining Albemarle in 2018, Johnson was well-known for his leadership roles at 3M and at Pentair, where he was directly responsible for over $1 billion in P & L in various divisions, including Electrical Markets and Advanced Materials.\n\nJohnson worked overseas for more than eight years, where he led strategic initiatives to improve processes and grow sales for two different technology companies. Prior to starting his business career, he was an officer in the United States Navy.\n\nJohnson holds a B.S. in Aerospace Engineering from the University of Southern California, Los Angeles and an M.B.A. from Duke University.\n\nGeorge Kehl is a strategic and financial expert who recently retired after a 38-year career at KPMG where he held numerous roles, including managing partner and business unit audit partner in charge. Throughout his career, Kehl provided invaluable audit services to many Fortune 250 companies including: audits of consolidated financial statements, financial reporting and review of internal controls, along with managing regulatory, legal and compliance risks.\n\nAs managing partner, Kehl oversaw two major metropolitan offices driving revenue growth and leading new business development. He recently led the community engagement and brand management efforts in the Minneapolis-St. Paul marketplace where he forged strong relationships with key executives in the community. He also served on many boards, including the Science Museum of Minnesota, the Minnesota Business Partnership and the local chapter of the National Association of Corporate Directors.\n\nKehl is an Audit Committee Financial Expert under Section 407 of the Sarbanes Oxley Act of 2002 and a Certified Public Accountant in Florida and Minnesota. He holds a B.S. in Accounting from the University of Florida.\n\n“We are delighted to welcome Netha and George to join our board of directors and look forward to the wealth of experience they will bring,” said Ben Fowke, chairman, president and CEO of Xcel Energy. “They are both exceptional leaders in their respective fields and will bring fresh perspectives and new skillsets that will serve Xcel Energy well.”\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200220005103/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy Announces Executive Appointments",
        "subtitle": "",
        "date": "Feb 19, 2020 4:15PM EST",
        "content": "\nBob Frenzel to be company’s president, chief operating officer\n    MINNEAPOLIS--(BUSINESS WIRE)--\nTaking a next step in thoughtful succession planning, Ben Fowke, Xcel Energy’s chairman, president and CEO, today announced that Bob Frenzel will be named president and chief operating officer and that Brian Van Abel will be the company’s chief financial officer, both effective March 31.\n\n\"Xcel Energy has built an outstanding leadership team, and these appointments reflect the success we have had in attracting and retaining top talent to lead the company in the years to come,” said Fowke. “Our success in leading the clean energy transition and delivering outstanding value to our customers, communities, and shareholders relies on strong leaders and I am confident we have that team in place.”\n\nAs president and COO, Frenzel will have oversight for Xcel Energy’s four operating companies, including the company’s transmission, distribution and natural gas operations. He will continue to report to Fowke, chairman and CEO.\n\n“Bob has been instrumental in executing our Steel for Fuel growth strategy and will be outstanding in this new role as chief operating officer,” said Fowke. “He is a proven leader in this industry and this company and we are fortunate to have him take on this expanded role at Xcel Energy.”\n\nVan Abel will become Xcel Energy’s executive vice president and chief financial officer. Van Abel is currently serving as senior vice president, Finance and Corporate Development. In his prior role as treasurer, Van Abel oversaw financing billions of dollars in new investments and several successful acquisitions that created tremendous value for both customers and investors.\n\nFowke also announced several key leadership changes. Tim O’Connor will become executive vice president and chief generation officer effective March 31. O’Connor currently serves as the company’s chief nuclear officer, a role he has held for the past eight years. During that time, the company’s nuclear fleet has become the top performing nuclear generating fleet in the nation. O’Connor will retain oversight of nuclear operations in his new expanded role. In addition, Wendy Mahling has been named vice president and Corporate Secretary, replacing Judy Poferl, who will retire March 31, Karen Hyde has been named senior vice president, chief risk, audit and compliance officer, and Frank Prager has been named senior vice president of Strategy, Planning and External Affairs.\n\nIn addition to these appointments, three Xcel Energy officers will be departing the company this spring. David Eves, executive vice president and group president, Utilities, will retire effective May 1 after nearly 39 years of service. Kent Larson, executive vice president and group president, Operations, will be leaving effective May 31 after 38 years of service. Poferl, senior vice president, corporate secretary and executive services, will retire after 23 years of service. Both Eves and Larson will step down from their current roles effective March 30 but will remain to assist with the transition.\n\n“I want to extend my deep thanks to David, Kent and Judy for their tremendous contributions to our company for the benefit of our customers, communities, employees and stakeholders. Their years of service have had a powerful impact on the company, and I am truly appreciative of their leadership.”\n\nAbout Xcel Energy\n\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on LinkedIn, Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005971/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy Inc. Board Increases 2020 Common Dividend 6.2%, Declares Dividend on Common Stock",
        "subtitle": "",
        "date": "Feb 19, 2020 2:24PM EST",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nThe Board of Directors of Xcel Energy Inc. (NASDAQ: XEL) today raised the quarterly dividend on the company’s common stock from 40.5 cents per share to 43 cents per share, which is equivalent to an annual rate of $1.72 per share. The dividends are payable April 20, 2020, to shareholders of record on March 13, 2020.\n\n“Today’s dividend increase of 6.2% marks the seventeenth consecutive year that Xcel Energy has increased its dividend. It reflects the successful execution of our business plan and recognition of the importance of dividend growth to our shareholders,” said Ben Fowke, chairman, president, and CEO of Xcel Energy.\n\nXcel Energy is a major U.S. electricity and natural gas company, with operations in 8 Western and Midwestern states. Xcel Energy provides a comprehensive portfolio of energy-related products and services to 3.7 million electricity customers and 2.1 million natural gas customers through its regulated operating companies. Company headquarters are located in Minneapolis. More information is available at www.xcelenergy.com.\n\nThis information is not given in connection with any sale or offer for sale or offer to buy any securities.\n\nStatements in this press release regarding Xcel Energy’s business which are not historical facts are “forward-looking statements” that involve risks and uncertainties. For a discussion of such risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see “Risk Factors” in the Company's Annual Report on Form 10-K for the most recently ended fiscal year.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200219005884/en/\nXcel Energy, Minneapolis\nShareholder Services\nDarin Norman (612) 337-2310\nor\nPaul Johnson, Vice President, Investor Relations (612) 215-4535\nor\nXcel Energy Media Relations Representatives (612) 215-5300\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy 2019 Year End Earnings Report",
        "subtitle": "",
        "date": "Jan 30, 2020 6:00AM EST",
        "content": "\n \n    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) today reported 2019 GAAP and ongoing earnings of $1,372 million, or $2.64 per share, compared with $1,261 million, or $2.47 per share in 2018.\n\nEarnings reflect higher electric margins primarily due to non-fuel riders and regulatory rate outcomes, higher natural gas margins and lower O&M expenses, partially offset by lower AFUDC, increased depreciation and interest expenses.\n\n“We delivered strong financial results again in 2019, with earnings at the upper end of our guidance range. Xcel Energy continues to deliver consistent and solid performance, meeting or exceeding earnings guidance for the 15th consecutive year,” said Ben Fowke, chairman, president and CEO of Xcel Energy.\n\n“We are proud of our continued progress in leading the clean energy transition on our path to 80% carbon reductions by 2030 and 100% carbon-free electricity by 2050, all while providing great value for our customers, communities, and shareholders. We took important steps on that journey this past year, completing three major Steel for Fuel wind projects, which contribute to the almost 4,700 megawatts of additional wind expected on our system by 2021. We begin the new year well-positioned to deliver on our financial objectives in 2020 and beyond.”\n\nAt 9:00 a.m. CDT today, Xcel Energy will host a conference call to review financial results. To participate in the call, please dial in 5 to 10 minutes prior to the start and follow the operator’s instructions.\n\nThe conference call also will be simultaneously broadcast and archived on Xcel Energy’s website at www.xcelenergy.com. To access the presentation, click on Investor Relations. If you are unable to participate in the live event, the call will be available for replay from 12:00 p.m. CDT on Jan. 30 through 12:00 p.m. CDT on Feb. 2.\n\nExcept for the historical statements contained in this report, the matters discussed herein are forward-looking statements that are subject to certain risks, uncertainties and assumptions. Such forward-looking statements, including the 2020 earnings per share (EPS) guidance, long-term EPS and dividend growth rate, as well as assumptions and other statements are intended to be identified in this document by the words “anticipate,” “believe,” “could,” “estimate,” “expect,” “intend,” “may,” “objective,” “outlook,” “plan,” “project,” “possible,” “potential,” “should,” “will,” “would” and similar expressions. Actual results may vary materially. Forward-looking statements speak only as of the date they are made, and we expressly disclaim any obligation to update any forward-looking information. The following factors, in addition to those discussed in Xcel Energy’s Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 and subsequent securities filings, could cause actual results to differ materially from management expectations as suggested by such forward-looking information: changes in environmental laws and regulations; climate change and other weather, natural disaster and resource depletion, including compliance with any accompanying legislative and regulatory changes; ability of subsidiaries to recover costs from customers; reductions in our credit ratings and the cost of maintaining certain contractual relationships; general economic conditions, including inflation rates, monetary fluctuations and their impact on capital expenditures and the ability of Xcel Energy Inc. and its subsidiaries to obtain financing on favorable terms; availability or cost of capital; our customers’ and counterparties’ ability to pay their debts to us; assumptions and costs relating to funding our employee benefit plans and health care benefits; our subsidiaries’ ability to make dividend payments; tax laws; operational safety, including our nuclear generation facilities; successful long-term operational planning; commodity risks associated with energy markets and production; rising energy prices; costs of potential regulatory penalties; effects of geopolitical events, including war and acts of terrorism; cyber security threats and data security breaches; fuel costs; and employee work force and third party contractor factors.\n\nThis information is not given in connection with any\nsale, offer for sale or offer to buy any security.\n\nXCEL ENERGY INC. AND SUBSIDIARIES\nNotes to Investor Relations Earnings Release (Unaudited)\n\nDue to the seasonality of Xcel Energy’s operating results, quarterly financial results are not an appropriate base from which to project annual results.\n\nNon-GAAP Financial Measures\n\nThe following discussion includes financial information prepared in accordance with generally accepted accounting principles (GAAP), as well as certain non-GAAP financial measures such as ongoing return on equity (ROE), electric margin, natural gas margin, ongoing earnings and ongoing diluted EPS. Generally, a non-GAAP financial measure is a measure of a company’s financial performance, financial position or cash flows that excludes (or includes) amounts that are adjusted from measures calculated and presented in accordance with GAAP. Xcel Energy’s management uses non-GAAP measures for financial planning and analysis, for reporting of results to the Board of Directors, in determining performance-based compensation, and communicating its earnings outlook to analysts and investors. Non-GAAP financial measures are intended to supplement investors’ understanding of our performance and should not be considered alternatives for financial measures presented in accordance with GAAP. These measures are discussed in more detail below and may not be comparable to other companies’ similarly titled non-GAAP financial measures.\n\nOngoing ROE\nOngoing ROE is calculated by dividing the net income or loss of Xcel Energy or each subsidiary, adjusted for certain nonrecurring items, by each entity’s average stockholder’s equity. We use these non-GAAP financial measures to evaluate and provide details of earnings results.\n\nElectric and Natural Gas Margins\nElectric margin is presented as electric revenues less electric fuel and purchased power expenses. Natural gas margin is presented as natural gas revenues less the cost of natural gas sold and transported. Expenses incurred for electric fuel and purchased power and the cost of natural gas are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are generally offset in operating revenues. Management believes electric and natural gas margins provide the most meaningful basis for evaluating our operations because they exclude the revenue impact of fluctuations in these expenses. These margins can be reconciled to operating income, a GAAP measure, by including other operating revenues, cost of sales - other, operating and maintenance (O&M) expenses, conservation and demand side management (DSM) expenses, depreciation and amortization and taxes (other than income taxes).\n\nEarnings Adjusted for Certain Items (Ongoing Earnings and Ongoing Diluted EPS)\nGAAP diluted EPS reflects the potential dilution that could occur if securities or other agreements to issue common stock (i.e., common stock equivalents) were settled. The weighted average number of potentially dilutive shares outstanding used to calculate Xcel Energy Inc.’s diluted EPS is calculated using the treasury stock method. Ongoing earnings reflect adjustments to GAAP earnings (net income) for certain items. Ongoing diluted EPS is calculated by dividing the net income or loss of each subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period. Ongoing diluted EPS for each subsidiary is calculated by dividing the net income or loss of such subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period.\n\nWe use these non-GAAP financial measures to evaluate and provide details of Xcel Energy’s core earnings and underlying performance. We believe these measurements are useful to investors to evaluate the actual and projected financial performance and contribution of our subsidiaries. For the three and twelve months ended Dec. 31, 2019 and 2018, there were no such adjustments to GAAP earnings and therefore GAAP earnings equal ongoing earnings for these periods.\n\nNote 1. Earnings Per Share Summary\n\nThe following summarizes diluted EPS for Xcel Energy:\n\nPSCo — Earnings increased $0.03 per share for 2019, reflecting higher electric margin due primarily to capital riders and increased natural gas margin attributable to capital riders, weather and sales growth, partially offset by lower AFUDC and higher depreciation, interest and O&M.\n\nNSP-Minnesota — Earnings increased $0.08 per share for 2019, reflecting higher electric margin resulting from regulatory rate outcomes and capital riders and lower O&M, partially offset by increased depreciation.\n\nSPS — Earnings increased $0.09 per share for 2019, reflecting higher electric margin attributable to lower capacity costs, regulatory rate outcomes and higher demand revenue and higher AFUDC, partially offset by increased interest and depreciation.\n\nNSP-Wisconsin — Earnings decreased $0.04 per share for 2019, reflecting lower electric margin, primarily related to sales decline and the impact of unfavorable weather, higher depreciation and lower AFUDC.\n\nXcel Energy Inc. and Other — Xcel Energy Inc. and Other primarily includes financing costs at the holding company.\n\nComponents significantly contributing to changes in 2019 EPS compared with the same period in 2018:\n\nThe following summarizes the ROE for Xcel Energy and its utility subsidiaries at Dec. 31:\n\nNote 2. Regulated Utility Results\n\nEstimated Impact of Temperature Changes on Regulated Earnings — Unusually hot summers or cold winters increase electric and natural gas sales, while mild weather reduces electric and natural gas sales. The estimated impact of weather on earnings is based on the number of customers, temperature variances, the amount of natural gas or electricity historically used per degree of temperature and excludes any incremental related operating expenses that could result due to storm activity or vegetation management requirements. As a result, weather deviations from normal levels can affect Xcel Energy’s financial performance.\n\nDegree-day or Temperature-Humidity Index (THI) data is used to estimate amounts of energy required to maintain comfortable indoor temperature levels based on each day’s average temperature and humidity. Heating degree-days (HDD) is the measure of the variation in the weather based on the extent to which the average daily temperature falls below 65° Fahrenheit. Cooling degree-days (CDD) is the measure of the variation in the weather based on the extent to which the average daily temperature rises above 65° Fahrenheit. Each degree of temperature above 65° Fahrenheit is counted as one CDD, and each degree of temperature below 65° Fahrenheit is counted as one HDD. In Xcel Energy’s more humid service territories, a THI is used in place of CDD, which adds a humidity factor to CDD. HDD, CDD and THI are most likely to impact the usage of Xcel Energy’s residential and commercial customers. Industrial customers are less sensitive to weather.\n\nNormal weather conditions are defined as either the 20-year or 30-year average of actual historical weather conditions. The historical period of time used in the calculation of normal weather differs by jurisdiction, based on regulatory practice. To calculate the impact of weather on demand, a demand factor is applied to the weather impact on sales. Extreme weather variations, windchill and cloud cover may not be reflected in weather-normalized estimates.\n\nPercentage increase (decrease) in normal and actual HDD, CDD and THI:\n\nWeather — Estimated impact of temperature variations on EPS compared with normal weather conditions:\n\nSales Growth (Decline) — Sales growth (decline) for actual and weather-normalized sales in 2019 compared to the same period in 2018:\n\nYear-to-date weather-normalized electric sales growth (decline)\n\nYear-to-date weather-normalized natural gas sales growth\n\nElectric Margin — Electric revenues and fuel and purchased power expenses are impacted by fluctuations in the price of natural gas, coal and uranium used in the generation of electricity. However, these price fluctuations have minimal impact on electric margin due to fuel recovery mechanisms that recover fuel expenses. In addition, electric customers receive a credit for PTCs generated in a particular period.\n\nElectric revenues and margin:\n\nChanges in electric margin:\n\nNatural Gas Margin — Natural gas expense varies with changing sales and the cost of natural gas. However, fluctuations in the cost of natural gas has minimal impact on natural gas margin due to cost recovery mechanisms.\n\nNatural gas revenues and margin:\n\nChanges in natural gas margin:\n\nO&M Expenses — O&M expenses decreased $14 million, or 0.6%, for 2019. Significant changes are summarized below:\n\nDepreciation and Amortization — Depreciation and amortization increased $4 million, or 0.9%, for the fourth quarter of 2019 and $123 million, or 7.5%, for 2019. Increase was primarily driven by capital investment including the Rush Creek, Hale, Foxtail and Lake Benton wind farms going into service, natural gas and distribution/transmission replacements, and various software solutions. These increases were partially offset by lower levels of accelerated amortization of PSCo’s prepaid pension asset.\n\nTaxes (Other than Income Taxes) — Taxes (other than income taxes) increased $2 million, or 1.4%, for the fourth quarter of 2019 and $13 million, or 2.3%, for 2019. Increase was primarily due to higher property taxes in Colorado and Minnesota (net of deferred amounts).\n\nAFUDC, Equity and Debt — AFUDC decreased $11 million for the fourth quarter of 2019 and $42 million for 2019. Decrease was primarily due to the Rush Creek wind project being placed in-service in 2018, partially offset by the Hale wind project, which went into service in June 2019, and other capital investments.\n\nInterest Charges — Interest charges increased $19 million, or 10.8%, for the fourth quarter of 2019 and $73 million, or 10.4%, for 2019. Increase was primarily due to higher debt levels to fund capital investments, changes in short-term interest rates and implementation of lease accounting standard (offset in electric margin).\n\nIncome Taxes — Income taxes increased $13 million for the fourth quarter of 2019. The increase was primarily driven by higher pretax earnings and a reduction in excess utility nonplant deferred tax amortization. These were partially offset by an increase in wind PTCs. Wind PTCs are credited to customers (recorded as a reduction to revenue) and do not have a material impact on net income. The ETR was 2.3% for the fourth quarter of 2019 compared with (2.9%) for 2018.\n\nIncome taxes decreased $53 million for 2019, primarily driven by an increase in wind PTCs. Wind PTCs are credited to customers (recorded as a reduction to revenue) and do not have a material impact on net income. These were partially offset by higher pretax earnings in 2019 and investment tax credits in 2018. The ETR was 8.5% for 2019 compared with 12.6% in 2018.\n\nAdditional details provided below:\n\nNote 3. Xcel Energy Capital Structure, Financing and Credit Ratings\n\nFollowing is the capital structure of Xcel Energy:\n\nCredit Facilities — As of Jan. 27, 2020, Xcel Energy Inc. and its utility subsidiaries had the following committed credit facilities available to meet liquidity needs:\n\nTerm Loan Agreement — In December 2019, Xcel Energy Inc. entered into a $500 million 364-Day Term Loan Agreement to pay down borrowings and terminate the expiring $500 million 364-Day Term Loan Agreement.\n\nAs of Dec. 31, 2019, Xcel Energy Inc.’s term loan borrowings were as follows:\n\nBilateral Credit Agreement — In March 2019, NSP-Minnesota entered into a one-year uncommitted bilateral credit agreement. The credit agreement is limited in use to support letters of credit.\n\nAs of Dec. 31, 2019, NSP-Minnesota’s outstanding letters of credit were as follows:\n\nForward Equity Agreements — In 2018, Xcel Energy entered into a forward equity agreement. In August 2019, Xcel Energy settled the forward equity agreement by delivering 9.4 million shares in exchange for $453 million.\n\nIn November 2019, Xcel Energy Inc. entered into forward equity agreements in connection with a $743 million public offering of 11.8 million shares, which is expected to be settled in shares in 2020.\n\nCredit Ratings — Access to the capital markets at reasonable terms is partially dependent on credit ratings. The following ratings reflect the views of Moody’s, S&P Global Ratings, and Fitch. In May 2019, Fitch revised its criteria for assigning short-term ratings and designated SPS’ short-term credit ratings (used for commercial paper) under criteria observation for a potential downgrade. In October 2019, Fitch removed SPS’ short-term credit ratings (used for commercial paper) from under criteria observation and affirmed SPS’ previous short-term rating of F2.\n\nThe highest credit rating for debt is Aaa/AAA and the lowest investment grade rating is Baa3/BBB-. The highest rating for commercial paper is P-1/A-1/F-1 and the lowest rating is P-3/A-3/F-3. A security rating is not a recommendation to buy, sell or hold securities. Ratings are subject to revision or withdrawal at any time by the credit rating agency and each rating should be evaluated independently of any other rating.\n\nAs of Jan 27, 2020, the following represents the credit ratings assigned to Xcel Energy Inc. and its utility subsidiaries:\n\n2019 Debt Financing — During 2019, Xcel Energy Inc. and its utility subsidiaries issued the following debt securities:\n\n2020 Planned Debt Financing — During 2020, Xcel Energy Inc. and its utility subsidiaries anticipate issuing the following:\n\nXcel Energy Inc. plans to issue approximately $75 to $80 million of equity through the Dividend Reinvestment and Stock Purchase Program and benefit programs.\n\nFinancing plans are subject to change, depending on capital expenditures, regulatory outcomes, internal cash generation, market conditions and other factors.\n\nNote 4. Rates and Regulation\n\nMinnesota Electric Rate Case and Stay-out Petition — In November 2019, Northern States Power Company-Minnesota (NSP-Minnesota), a Minnesota corporation, and a wholly owned subsidiary of Xcel Energy Inc. (Xcel Energy), filed a three-year electric rate case with the Minnesota Public Utilities Commission (MPUC). The proposed electric rates reflect a three-year increase in revenues of approximately $201.4 million in 2020, with subsequent incremental increases of $146.4 million in 2021 and $118.3 million in 2022. The rate case was based on a requested ROE of 10.2%, a 52.5% equity ratio, an average electric rate base of $9.0 billion for 2020, $9.3 billion for 2021 and $9.8 billion for 2022. In addition, NSP-Minnesota requested interim rates of $122.0 million to be implemented in January 2020 and an incremental $144.0 million to be implemented in January 2021.\n\nIn December 2019, the MPUC approved NSP-Minnesota’s stay-out petition, which includes the extension of the sales, capital and property tax true-up mechanisms and delay of any increase to the Nuclear Decommissioning Trust annual accrual until Jan. 1, 2021.\n\nMankato Energy Center (MEC) Acquisition — In November 2018, NSP-Minnesota agreed to purchase MEC, a 760 MW natural gas combined cycle facility, for approximately $650 million from Southern Power Company (a subsidiary of Southern Company).\n\nIn September 2019, the MPUC denied NSP-Minnesota's request to purchase MEC as a rate base asset. In January 2020, the MPUC approved Xcel Energy’s plan to acquire MEC as a non-regulated investment and step into the terms of the existing PPAs with NSP-Minnesota. A newly formed non-regulated subsidiary of Xcel Energy completed the transaction to purchase MEC on Jan. 17, 2020.\n\nJeffers Wind and Community Wind North Repowering Acquisition — In October 2019, the MPUC approved NSP-Minnesota’s request to acquire the Jeffers Wind and Community Wind North wind facilities from Longroad Energy. The wind farms will have approximately 70 MW of capacity after being repowered. The repowering is expected to be completed by December 2020, at which time NSP-Minnesota anticipates finalizing the acquisition and to qualify for the full PTC. The $135 million asset acquisition is projected to provide customer savings of approximately $7 million over the life of the facilities.\n\nNSP-Minnesota — Mower Wind Facility — In August 2019, NSP-Minnesota filed a petition with the MPUC to acquire the Mower wind facility from affiliates of NextEra Energy, Inc. for an undisclosed amount. The Mower facility is currently contracted under a PPA with NSP-Minnesota through 2026. Mower is expected to continue to have approximately 99 MW of capacity following a planned repowering. The acquisition would occur after repowering, which is expected to be complete in 2020 and qualify for 100% of the PTC.\n\nNSP-Minnesota will need approval from both the MPUC and FERC to complete the transaction. The Department of Commerce filed comments in opposition due to modeling concerns, which we are working to address. NSP-Minnesota anticipates an MPUC decision in the second quarter of 2020. NSP-Minnesota anticipates receiving FERC approval in the third quarter of 2020.\n\nPSCo — Colorado 2019 Electric Rate Case — In October 2019, PSCo filed rebuttal testimony requesting net rate increase of $108 million. This is based on a $353 million increase, offset by $245 million of previously authorized costs currently recovered through various rider mechanisms. The request was based on a ROE of 10.20%, an equity ratio of 55.61% and a current test year, which includes certain forecasted plant additions through December 2019.\n\nIn December 2019, the Colorado Public Utilities Commission (CPUC) held deliberations and approved a current test year ended Aug. 31, 2019, a 9.3% ROE, an equity ratio of 55.61%, the implementation of decoupling in 2020 and other items. This resulted in an estimated $42 million net base rate revenue increase, pending the CPUC’s written decision. Final rates are expected to be implemented in February 2020.\n\nSPS — New Mexico 2019 Electric Rate Case — In July 2019, SPS filed an electric rate case with the New Mexico Public Regulation Commission (NMPRC) seeking an increase in retail electric base rates of approximately $51 million. The rate request is based on a ROE of 10.35%, an equity ratio of 54.77%, a rate base of approximately $1.3 billion and a historic test year with rate base additions through Aug. 31, 2019. In December 2019, SPS revised its base rate increase request to approximately $47 million, based on a ROE of 10.10% and updated information. The request also included an increase of $14.6 million for accelerated depreciation including the early retirement of the Tolk Coal Plant in 2032.\n\nOn Jan. 13, 2020, SPS and various parties filed an uncontested comprehensive stipulation, which includes the following terms:\n\nHearings are scheduled for Feb. 17-21, 2020 with a NMPRC decision later in the year. SPS anticipates final rates will go into effect in the second or third quarter of 2020.\n\nSPS — Texas 2019 Electric Rate Case — In August 2019, SPS filed an electric rate case with the Public Utility Commission of Texas (PUCT) seeking an increase in retail electric base rates of approximately $141 million. The filing is based on a ROE of 10.35%, a 54.65% equity ratio, a rate base of approximately $2.6 billion and historic test year that ended June 30, 2019. In September 2019, SPS filed an update to the electric rate case and revised its requested increase to approximately $136 million.\n\nThe following table summarizes SPS’ base rate increase request:\n\nThe procedural schedule is as follows:\n\nThe final rates are expected to be made effective relating back to Sept. 12, 2019. SPS expects a decision from the PUCT in the third quarter of 2020.\n\nNote 5. Xcel Energy Earnings Guidance and Long-Term EPS and Dividend Growth Rate Objectives\n\nXcel Energy 2020 Earnings Guidance — Xcel Energy’s 2020 GAAP and ongoing earnings guidance is a range of $2.73 to $2.83 per share.(a)\n\nKey assumptions as compared with projected 2019 levels unless noted:\n\n(a) Ongoing earnings is calculated using net income and adjusting for certain nonrecurring or infrequent items that are, in management’s view, not reflective of ongoing operations. Ongoing earnings could differ from those prepared in accordance with GAAP for unplanned and/or unknown adjustments. Xcel Energy is unable to forecast if any of these items will occur or provide a quantitative reconciliation of the guidance for ongoing EPS to corresponding GAAP EPS.\n\nLong-Term EPS and Dividend Growth Rate Objectives — Xcel Energy expects to deliver an attractive total return to our shareholders through a combination of earnings growth and dividend yield, based on the following long-term objectives:\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20200130005162/en/\nPaul Johnson, Vice President, Investor Relations (612) 215-4535\n\nFor news media inquiries only,\nplease call Xcel Energy Media Relations (612) 215-5300\n\nXcel Energy website address: www.xcelenergy.com\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy Named a World's Most Admired Company for Sixth Consecutive Year",
        "subtitle": "",
        "date": "Jan 21, 2020 12:14PM EST",
        "content": "\nMinneapolis-based utility recognized by peers for quality of management, social responsibility and financial soundness\n    MINNEAPOLIS--(BUSINESS WIRE)--\nFor the sixth year in a row Xcel Energy has been honored as one of the World’s Most Admired Companies by Fortune Magazine. The Minneapolis-based utility ranked among the most admired gas and electric companies in the country.\n\nThe ranking is based on nine criteria including innovation, investment potential, financial soundness and quality of management, along with social responsibility and the ability to attract talent.\n\n“We are honored to make Fortune magazine’s list of the World’s Most Admired Companies for the sixth year in a row,” said Ben Fowke, chairman, president and CEO of Xcel Energy. “Being recognized by our peers reinforces our vision of delivering 100 percent carbon-free electricity by 2050, while keeping service reliable and customer bills low.”\n\nXcel Energy is the first major U.S. utility to announce a commitment to reducing carbon emissions by 80% (from 2005 levels) by 2030, with a vision of delivering 100% carbon-free electricity by 2050. That announcement in late 2018 has prompted many other companies to commit to their own clean energy goals.\n\nFortune magazine partnered with Korn Ferry to conduct the survey on corporate reputation, focusing on large companies with revenue of $10 billion or more. The complete list can be found at www.Fortune.com.\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121005883/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy Names New Chief Security Officer",
        "subtitle": "",
        "date": "Jan 14, 2020 4:00PM EST",
        "content": "\nJames W. Sample will join the company as vice president overseeing cyber and physical security\n    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy announced today that James W. Sample will join the company as Vice President, Chief Security Officer. Sample will lead the company’s security risk management program, overseeing all aspects of security including cybersecurity, physical security and the safety of personnel. He will also serve as the North American Electric Reliability Corporation’s (NERC) senior manager for Critical Infrastructure Protection.\n\n“Jamey brings a wealth of experience and expertise to Xcel Energy’s security operations,” said Brett Carter, Executive Vice President and Chief Customer and Innovation Officer. “Cybersecurity, along with the protection of our infrastructure and our people, are critically important to Xcel Energy. Sample is particularly qualified to help us continue to protect against the evolving security threats our industry faces today.”\n\nAs it leads the clean energy transition, Xcel Energy is also a recognized leader for its innovative Enterprise Security Organization, which operates 24/7 to protect critical assets including data, infrastructure, the grid and employees at all times.\n\n“Xcel Energy is a world-class company that is focused on providing safe, reliable, and affordable energy services. Their strategy and vision are industry-leading,” said Sample. “We have an opportunity to innovate and lead in the way we protect Xcel Energy assets and services in order to strengthen the safety, resiliency, and affordability.”\n\nPrior to joining Xcel Energy, Sample held leadership roles at Ernst & Young LLP, Pacific Gas and Electric, Tennessee Valley Authority and California Independent System Operator. He also served as a member of the Center for Strategic and International Studies Cyber Policy Task Force, advising the White House on cybersecurity. Additionally, Sample served in the United States Navy as a cryptologic technician.\n\nSample will begin his new role at Xcel Energy on Jan. 27.\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200114005679/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy 4th Quarter 2019 Earnings Conference Call",
        "subtitle": "",
        "date": "Jan 6, 2020 6:00AM EST",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nOn Thursday, January 30, 2020, Xcel Energy (NASDAQ: XEL) will host a conference call to review fourth quarter 2019 financial results. Earnings will be released prior to the opening of trading.\n\nThe call will begin at 9:00 a.m. Central Time. To participate in the conference call, please dial in at least 5-10 minutes prior to the scheduled start and follow the operator’s instructions. You will be asked for the conference ID number.\n\nUS Dial-In: 800-367-2403\nInternational Dial-In: 800-714-1899\nConference ID: 8911094\n\nThe conference call will also be simultaneously broadcast and archived on our website, along with an MP3 download, at the following location:\n\nhttp://www.xcelenergy.com\nUnder Company, select: Investor Relations\n\nIf you are unable to participate in the live event, the call will be available for replay from 12:00 p.m. on January 30 through 12:00 p.m. on February 2, Central Time.\n\nReplay Numbers\nUS Dial-In: 888-203-1112\nInternational Dial-In: 719-457-0820\nReplay Passcode: 8911094\n\nFinancial analysts may call:\nPaul Johnson, Vice President - Investor Relations 612-215-4535\n\nNews media inquiries please call Xcel Energy Media Relations at 612-215-5300.\nInternet: www.xcelenergy.com\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200106005160/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy Inc. Board Declares Dividend on Common Stock",
        "subtitle": "",
        "date": "Dec 11, 2019 2:08PM EST",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nThe Board of Directors of Xcel Energy Inc. (NASDAQ: XEL) today declared a quarterly dividend on its common stock of 40.5 cents per share. The dividends are payable January 20, 2020, to shareholders of record on December 26, 2019.\n\nXcel Energy is a major U.S. electricity and natural gas company, with operations in 8 Western and Midwestern states. Xcel Energy provides a comprehensive portfolio of energy-related products and services to 3.6 million electricity customers and 2.0 million natural gas customers through its regulated operating companies. Company headquarters are located in Minneapolis. More information is available at www.xcelenergy.com.\n\nThis information is not given in connection with any sale or offer for sale or offer to buy any securities.\n\nStatements in this press release regarding Xcel Energy’s business which are not historical facts are “forward-looking statements” that involve risks and uncertainties. For a discussion of such risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see “Risk Factors” in the Company's Annual Report on Form 10-K for the most recently ended fiscal year.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191211005833/en/\nXcel Energy, Minneapolis\nShareholder Services\nDarin Norman (612) 337-2310\nor\nPaul Johnson, Vice President, Investor Relations (612) 215-4535\nor\nXcel Energy Media Relations Representatives (612) 215-5300\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy Announces Redemption of Outstanding 4.70% Senior Notes, Series due May 15, 2020",
        "subtitle": "",
        "date": "Nov 22, 2019 10:45AM EST",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) announced today that it has submitted a redemption notice to the trustee to redeem all of its outstanding 4.70% Senior Notes, Series due May 15, 2020 (Notes) on December 23, 2019, (Redemption Date). The redemption price is the outstanding principal amount of the Notes, plus accrued and unpaid interest to the Redemption Date. The aggregate principal amount of Notes currently outstanding is $550,000,000. The company issued new debt to fund the redemption of the Notes.\n\nThis press release does not constitute a notice of redemption of the Notes. Holders of the Notes should refer to the notice of redemption to be delivered to the registered holders of the Notes by Wells Fargo Bank, N.A., the trustee with respect to the Notes.\n\nThis press release is not an offer to sell or a solicitation of an offer to buy any securities.\n\nForward Looking Statements\nThis release contains forward-looking statements that are subject to certain risks, uncertainties and assumptions. Such forward-looking statements include the company’s plan to redeem the Notes. Actual results may vary materially. Factors that could cause actual results to differ materially include, but are not limited to: general economic conditions, including the availability of credit, actions of rating agencies and their impact on capital expenditures; business conditions in the energy industry: competitive factors; unusual weather; effects of geopolitical events; including war and acts of terrorism; changes in federal or state legislation; regulation; actions of regulatory bodies; and other risk factors listed from time to time by Xcel Energy in its Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 (including the items described under Factors Affecting Results of Operations) and the other risk factors listed from time to time by Xcel Energy Inc. in reports filed with the SEC.\n\nAbout Xcel Energy Inc.\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191122005378/en/\nXcel Energy\nFinancial analysts:\nPaul Johnson, 612-215-4535\nVice President, Investor Relations\nor\nNews media inquiries:\nXcel Energy Media Relations, 612-215-5300\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy Announces Closing of Common Stock Offering with a Forward Component",
        "subtitle": "",
        "date": "Nov 4, 2019 2:55PM EST",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) (Xcel Energy) announced today the closing of its registered underwritten offering of 11,845,000 shares of its common stock in connection with the forward sale agreements described below, which included the underwriter’s full exercise of its option to purchase an additional 1,545,000 shares of Xcel Energy’s common stock. Citigroup acted as sole book-running manager for the offering.\n\nThe closing will result in approximately $742.6 million of net proceeds, before expenses (assuming each forward sale agreement is physically settled based on the initial forward sale price per share of $62.69, as described more fully below).\n\nIn connection with the offering, Xcel Energy entered into forward sale agreements with an affiliate of Citigroup Global Markets Inc. (the forward purchaser) under which Xcel Energy agreed to issue and sell to the forward purchaser an aggregate of 11,845,000 shares of its common stock at the initial forward sale price of $62.69.\n\nSettlement of the forward sale agreements is expected to occur on or prior to December 31, 2020. Upon any physical settlement of each forward sale agreement, Xcel Energy will issue and deliver to the forward purchaser shares of Xcel Energy’s common stock in exchange for cash proceeds per share, based on the initial forward sale price of $62.69. The initial forward sale price will be subject to certain adjustments as provided in the relevant forward sale agreement. Xcel Energy may, subject to certain conditions, elect cash settlement or net share settlement for all or a portion of its rights or obligations under the forward sale agreements.\n\nIn connection with the forward sale agreements, the forward purchaser borrowed from third-party lenders and sold to the underwriter 11,845,000 shares of Xcel Energy’s common stock at the close of the offering.\n\nIf Xcel Energy elects physical settlement of the forward sale agreements, it expects to use the net proceeds for general corporate purposes, which may include capital contributions to its utility subsidiaries, acquisitions, and/or, repayment of commercial paper, outstanding loans under its revolving credit facility or other debt.\n\nThe offering was made pursuant to Xcel Energy’s effective shelf registration statement with the Securities and Exchange Commission (SEC). The preliminary prospectus supplement and the accompanying prospectus related to the offering are available on the SEC’s website at www.sec.gov. Copies of the preliminary prospectus supplement and the accompanying prospectus relating to the offering may be obtained from the sole book-running manager for the offering:\n\nCitigroup\nc/o Broadridge Financial Solutions\n1155 Long Island Avenue\nEdgewood, NY 11717\nTelephone: 1-800-831-9146\n\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any jurisdiction in which the offer, solicitation or sale of these securities would be unlawful prior to registration or qualification under the securities laws of any jurisdiction. The offering of these securities will be made only by means of a prospectus and a related prospectus supplement meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\n\nAbout Xcel Energy\n\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices.\n\nThis press release contains forward-looking statements regarding, among other things, Xcel Energy’s expectations regarding its offer and sale of common stock and the use of the net proceeds therefrom. Xcel Energy cannot be sure that it will complete the offering or, if it does, on what terms it will complete it. Forward-looking statements are based on current beliefs and expectations and are subject to inherent risks and uncertainties, including those discussed under the caption “Special Note Regarding Forward-Looking Statements” in the prospectus supplement. In addition, Xcel Energy management retains broad discretion with respect to the allocation of net proceeds of the offering. The forward-looking statements speak only as the date of release, and Xcel Energy is under no obligation to, and expressly disclaims any such obligation to update or alter its forward-looking statements, whether as the result of new information, future events or otherwise, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191104005890/en/\nXcel Energy Inc.\nPaul Johnson, 612-215-4535\nVP Investor Relations\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy Announces Pricing of Upsized Common Stock Offering With a Forward Component",
        "subtitle": "",
        "date": "Oct 30, 2019 9:48PM EDT",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) (Xcel Energy) announced today the pricing of a registered underwritten offering of 10,300,000 shares of its common stock at a price per share of $63.32 in connection with the forward sale agreement described below. Subject to certain conditions, all shares are expected to be borrowed by the forward purchaser (as defined below) (or its affiliate) from third parties and sold to the underwriter and offered in connection with such forward sale agreement. Citigroup is acting as the sole book-running manager for this offering. The underwriter may offer shares of Xcel Energy’s common stock in transactions on the Nasdaq Stock Market LLC, in the over-the-counter market, through negotiated transactions or otherwise at either market prices, at prices related to market prices or at negotiated prices. Closing of this offering is expected to occur on or about November 4, 2019, subject to customary closing conditions.\n\nIn connection with the offering, Xcel Energy entered into a forward sale agreement with an affiliate of Citigroup Global Markets Inc. (in such capacity, the forward purchaser) under which Xcel Energy agreed to issue and sell to the forward purchaser 10,300,000 shares of its common stock. In addition, the underwriter of the offering has been granted a 30-day option to purchase up to an additional 1,545,000 shares of Xcel Energy’s common stock upon the same terms. If the underwriter exercises its option, Xcel Energy may elect to enter into an additional forward sale agreement with the forward purchaser with respect to the additional shares or to issue and sell such shares directly to the underwriter.\n\nSettlement of the forward sale agreement is expected to occur no later than December 31, 2020. Xcel Energy may, subject to certain conditions, elect cash settlement or net share settlement for all or a portion of its rights or obligations under the forward sale agreement.\n\nIf Xcel Energy elects physical settlement of the forward sale agreement, it expects to use the net proceeds for general corporate purposes, which may include capital contributions to its utility subsidiaries, acquisitions, and/or, repayment of commercial paper, outstanding loans under its revolving credit facility or other debt.\n\nThe offering is being made pursuant to Xcel Energy’s effective shelf registration statement with the Securities and Exchange Commission (SEC). The preliminary prospectus supplement and the accompanying prospectus related to the offering will be available on the SEC’s website at www.sec.gov. Copies of the preliminary prospectus supplement and the accompanying prospectus relating to the offering may be obtained from the sole book-running manager for the offering:\n\nCitigroup\nc/o Broadridge Financial Solutions\n1155 Long Island Avenue\nEdgewood, NY 11717\nTelephone: 1-800-831-9146\n\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any jurisdiction in which the offer, solicitation or sale of these securities would be unlawful prior to registration or qualification under the securities laws of any jurisdiction. The offering of these securities will be made only by means of a prospectus and a related prospectus supplement meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\n\nAbout Xcel Energy\n\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices.\n\nThis press release contains forward-looking statements regarding, among other things, Xcel Energy’s expectations regarding its planned offer and sale of common stock and the use of the net proceeds from any such sale. Xcel Energy cannot be sure that it will complete the offering or, if it does, on what terms it will complete it. Forward-looking statements are based on current beliefs and expectations and are subject to inherent risks and uncertainties, including those discussed under the caption “Special Note Regarding Forward-Looking Statements” in the prospectus supplement. In addition, Xcel Energy management retains broad discretion with respect to the allocation of net proceeds of the planned offering. The forward-looking statements speak only as the date of release, and Xcel Energy is under no obligation to, and expressly disclaims any such obligation to update or alter its forward-looking statements, whether as the result of new information, future events or otherwise, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030006208/en/\nXcel Energy Inc.\nPaul Johnson, 612-215-4535\nVP Investor Relations\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy Announces Public Offering of Common Stock With a Forward Component",
        "subtitle": "",
        "date": "Oct 30, 2019 4:03PM EDT",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) (Xcel Energy) announced today the commencement of a registered underwritten offering of 7,000,000 shares of its common stock. Subject to certain conditions, all shares are expected to be borrowed by the forward purchaser (as defined below) (or its affiliate) from third parties and sold to the underwriter and offered in connection with the forward sale agreement described below. Citigroup is acting as the sole book-running manager for this offering. The underwriter may offer shares of Xcel Energy’s common stock in transactions on the Nasdaq Stock Market LLC, in the over-the-counter market, through negotiated transactions or otherwise at either market prices, at prices related to market prices or at negotiated prices.\n\nIn connection with the offering, Xcel Energy expects to enter into a forward sale agreement with an affiliate of Citigroup Global Markets Inc. (in such capacity, the forward purchaser) under which Xcel Energy will agree to issue and sell to the forward purchaser 7,000,000 shares of its common stock at an initial forward sale price per share equal to the price per share at which the underwriter purchases the shares in the offering, subject to certain adjustments, upon physical settlement of the forward sale agreement. In addition, the underwriter of the offering expects to be granted a 30-day option to purchase up to an additional 1,050,000 shares of Xcel Energy’s common stock upon the same terms. If the underwriter exercises its option, Xcel Energy may elect to enter into an additional forward sale agreement with the forward purchaser with respect to the additional shares or to issue and sell such shares directly to the underwriter.\n\nSettlement of the forward sale agreement is expected to occur no later than December 2020. Xcel Energy may, subject to certain conditions, elect cash settlement or net share settlement for all or a portion of its rights or obligations under the forward sale agreement.\n\nIf Xcel Energy elects physical settlement of the forward sale agreement, it expects to use the net proceeds for general corporate purposes, which may include capital contributions to its utility subsidiaries, acquisitions, and/or, repayment of commercial paper, outstanding loans under its revolving credit facility or other debt.\n\nThe offering is being made pursuant to Xcel Energy’s effective shelf registration statement with the Securities and Exchange Commission (SEC). The preliminary prospectus supplement and the accompanying prospectus related to the offering will be available on the SEC’s website at www.sec.gov. Copies of the preliminary prospectus supplement and the accompanying prospectus relating to the offering may be obtained from the sole book-running manager for the offering:\n\nCitigroup\nc/o Broadridge Financial Solutions\n1155 Long Island Avenue\nEdgewood, NY 11717\nTelephone: 1-800-831-9146\n\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any jurisdiction in which the offer, solicitation or sale of these securities would be unlawful prior to registration or qualification under the securities laws of any jurisdiction. The offering of these securities will be made only by means of a prospectus and a related prospectus supplement meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\n\nAbout Xcel Energy\n\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices.\n\nThis press release contains forward-looking statements regarding, among other things, Xcel Energy’s expectations regarding its planned offer and sale of common stock and the use of the net proceeds from any such sale. Xcel Energy cannot be sure that it will complete the offering or, if it does, on what terms it will complete it. Forward-looking statements are based on current beliefs and expectations and are subject to inherent risks and uncertainties, including those discussed under the caption “Special Note Regarding Forward-Looking Statements” in the prospectus supplement. In addition, Xcel Energy management retains broad discretion with respect to the allocation of net proceeds of the planned offering. The forward-looking statements speak only as the date of release, and Xcel Energy is under no obligation to, and expressly disclaims any such obligation to update or alter its forward-looking statements, whether as the result of new information, future events or otherwise, except as may be required by law.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030006038/en/\nXcel Energy Inc.\nPaul Johnson, 612-215-4535\nVP Investor Relations\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy Third Quarter 2019 Earnings Report",
        "subtitle": "",
        "date": "Oct 24, 2019 6:00AM EDT",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) today reported 2019 third quarter GAAP and ongoing earnings of $527 million, or $1.01 per share, compared with $491 million, or $0.96 per share in the same period in 2018.\n\nEarnings reflect higher electric margins primarily due to non-fuel riders and regulatory rate outcomes and lower O&M expenses, partially offset by lower AFUDC, increased depreciation and interest expenses.\n\n“Xcel Energy achieved solid quarterly results and as a result we have narrowed our expected earnings to the upper half of our 2019 guidance range. In addition we have issued 2020 earnings guidance of $2.73 to $2.83 per share, which is consistent with our 5-7% growth objective,” said Ben Fowke, chairman, president and CEO of Xcel Energy.\n\n“We have planned capital investments of $22 billion in the next five years to continue our clean energy transition, expand our renewable portfolio and enhance and protect service reliability. These investments will deliver economic and environmental benefits for our shareholders, customers and stakeholders while supporting our drive to achieve an 80 percent reduction in carbon emissions by 2030.”\n\nAt 9:00 a.m. CDT today, Xcel Energy will host a conference call to review financial results. To participate in the call, please dial in 5 to 10 minutes prior to the start and follow the operator’s instructions.\n\nThe conference call also will be simultaneously broadcast and archived on Xcel Energy’s website at www.xcelenergy.com. To access the presentation, click on Investor Relations. If you are unable to participate in the live event, the call will be available for replay from 12:00 p.m. CDT on Oct. 24 through 12:00 p.m. CDT on Oct. 27.\n\nExcept for the historical statements contained in this report, the matters discussed herein are forward-looking statements that are subject to certain risks, uncertainties and assumptions. Such forward-looking statements, including the 2019 and 2020 earnings per share (EPS) guidance, long-term EPS and dividend growth rate, as well as assumptions and other statements are intended to be identified in this document by the words “anticipate,” “believe,” “could,” “estimate,” “expect,” “intend,” “may,” “objective,” “outlook,” “plan,” “project,” “possible,” “potential,” “should,” “will,” “would” and similar expressions. Actual results may vary materially. Forward-looking statements speak only as of the date they are made, and we expressly disclaim any obligation to update any forward-looking information. The following factors, in addition to those discussed in Xcel Energy’s Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 and subsequent securities filings, could cause actual results to differ materially from management expectations as suggested by such forward-looking information: changes in environmental laws and regulations; climate change and other weather, natural disaster and resource depletion, including compliance with any accompanying legislative and regulatory changes; ability of subsidiaries to recover costs from customers; reductions in our credit ratings and the cost of maintaining certain contractual relationships; general economic conditions, including inflation rates, monetary fluctuations and their impact on capital expenditures and the ability of Xcel Energy Inc. and its subsidiaries to obtain financing on favorable terms; availability or cost of capital; our customers’ and counterparties’ ability to pay their debts to us; assumptions and costs relating to funding our employee benefit plans and health care benefits; our subsidiaries’ ability to make dividend payments; tax laws; operational safety, including our nuclear generation facilities; successful long-term operational planning; commodity risks associated with energy markets and production; rising energy prices; costs of potential regulatory penalties; effects of geopolitical events, including war and acts of terrorism; cyber security threats and data security breaches; fuel costs; and employee work force and third party contractor factors.\n\nThis information is not given in connection with any sale, offer for sale or offer to buy any security.\n\nXCEL ENERGY INC. AND SUBSIDIARIES\n\nNotes to Investor Relations Earnings Release (Unaudited)\n\nDue to the seasonality of Xcel Energy’s operating results, quarterly financial results are not an appropriate base from which to project annual results.\n\nNon-GAAP Financial Measures\n\nThe following discussion includes financial information prepared in accordance with generally accepted accounting principles (GAAP), as well as certain non-GAAP financial measures such as electric margin, natural gas margin, ongoing earnings and ongoing diluted EPS. Generally, a non-GAAP financial measure is a measure of a company’s financial performance, financial position or cash flows that excludes (or includes) amounts that are adjusted from measures calculated and presented in accordance with GAAP. Xcel Energy’s management uses non-GAAP measures for financial planning and analysis, for reporting of results to the Board of Directors, in determining performance-based compensation, and communicating its earnings outlook to analysts and investors. Non-GAAP financial measures are intended to supplement investors’ understanding of our performance and should not be considered alternatives for financial measures presented in accordance with GAAP. These measures are discussed in more detail below and may not be comparable to other companies’ similarly titled non-GAAP financial measures.\n\nElectric and Natural Gas Margins\nElectric margin is presented as electric revenues less electric fuel and purchased power expenses. Natural gas margin is presented as natural gas revenues less the cost of natural gas sold and transported. Expenses incurred for electric fuel and purchased power and the cost of natural gas are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are generally offset in operating revenues. Management believes electric and natural gas margins provide the most meaningful basis for evaluating our operations because they exclude the revenue impact of fluctuations in these expenses. These margins can be reconciled to operating income, a GAAP measure, by including other operating revenues, cost of sales - other, operating and maintenance (O&M) expenses, conservation and demand side management (DSM) expenses, depreciation and amortization and taxes (other than income taxes).\n\nEarnings Adjusted for Certain Items (Ongoing Earnings and Ongoing Diluted EPS)\nGAAP diluted EPS reflects the potential dilution that could occur if securities or other agreements to issue common stock (i.e., common stock equivalents) were settled. The weighted average number of potentially dilutive shares outstanding used to calculate Xcel Energy Inc.’s diluted EPS is calculated using the treasury stock method. Ongoing earnings reflect adjustments to GAAP earnings (net income) for certain items. Ongoing diluted EPS is calculated by dividing the net income or loss of each subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period. Ongoing diluted EPS for each subsidiary is calculated by dividing the net income or loss of such subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period.\n\nWe use these non-GAAP financial measures to evaluate and provide details of Xcel Energy’s core earnings and underlying performance. We believe these measurements are useful to investors to evaluate the actual and projected financial performance and contribution of our subsidiaries. For the three and nine months ended Sept. 30, 2019 and 2018, there were no such adjustments to GAAP earnings and therefore GAAP earnings equal ongoing earnings for these periods.\n\nNote 1. Earnings Per Share Summary\n\nThe following summarizes diluted EPS for Xcel Energy:\n\n(a) Amounts may not add due to rounding.\n\nPSCo — Earnings decreased $0.02 per share for the third quarter of 2019 and $0.05 per share year-to-date. The decrease in year-to-date earnings was driven by higher depreciation, O&M, interest expense and lower allowance for funds used during construction (AFUDC), which offsets higher natural gas and electric margin. Changes in depreciation and AFUDC are primarily driven by the Rush Creek wind project that was placed in service in 2018.\n\nNSP-Minnesota — Earnings increased $0.01 per share for the third quarter of 2019 and $0.02 per share year-to-date. Year-to-date results reflect higher electric margin driven by regulatory rate outcomes, partially offset by the negative impact of weather, unfavorable sales and increased depreciation.\n\nSPS — Earnings increased $0.04 for the third quarter of 2019 and $0.08 per share year-to-date. Year-to-date results reflect higher electric margin attributable to regulatory rate outcomes and sales growth despite unfavorable weather. Higher electric margin and AFUDC associated with the Hale wind project were partially offset by increased depreciation, O&M and interest expenses.\n\nNSP-Wisconsin — Earnings were flat for the third quarter of 2019 and decreased $0.03 per share year-to-date. Year-to-date results reflect unfavorable weather, higher depreciation and lower AFUDC.\n\nXcel Energy Inc. and Other — Xcel Energy Inc. and Other primarily includes financing costs at the holding company.\n\nComponents significantly contributing to changes in 2019 EPS compared with the same period in 2018:\n\n(a) Includes production tax credits (PTCs) and timing of tax reform regulatory decisions, which are primarily offset in electric margin.\n\nNote 2. Regulated Utility Results\n\nEstimated Impact of Temperature Changes on Regulated Earnings — Unusually hot summers or cold winters increase electric and natural gas sales, while mild weather reduces electric and natural gas sales. The estimated impact of weather on earnings is based on the number of customers, temperature variances and the amount of natural gas or electricity historically used per degree of temperature. Weather deviations from normal levels can affect Xcel Energy’s financial performance.\n\nDegree-day or Temperature-Humidity Index (THI) data is used to estimate amounts of energy required to maintain comfortable indoor temperature levels based on each day’s average temperature and humidity. Heating degree-days (HDD) is the measure of the variation in the weather based on the extent to which the average daily temperature falls below 65° Fahrenheit. Cooling degree-days (CDD) is the measure of the variation in the weather based on the extent to which the average daily temperature rises above 65° Fahrenheit. Each degree of temperature above 65° Fahrenheit is counted as one CDD, and each degree of temperature below 65° Fahrenheit is counted as one HDD. In Xcel Energy’s more humid service territories, a THI is used in place of CDD, which adds a humidity factor to CDD. HDD, CDD and THI are most likely to impact the usage of Xcel Energy’s residential and commercial customers. Industrial customers are less sensitive to weather.\n\nNormal weather conditions are defined as either the 20-year or 30-year average of actual historical weather conditions. The historical period of time used in the calculation of normal weather differs by jurisdiction, based on regulatory practice. To calculate the impact of weather on demand, a demand factor is applied to the weather impact on sales. Extreme weather variations, windchill and cloud cover may not be reflected in weather-normalized estimates.\n\nPercentage increase (decrease) in normal and actual HDD, CDD and THI:\n\nWeather — Estimated impact of temperature variations on EPS compared with normal weather conditions:\n\nSales Growth (Decline) — Sales growth (decline) for actual and weather-normalized sales in 2019 compared to the same period in 2018:\n\nYear-to-date weather-normalized Electric Sales Growth (Decline)\n\nYear-to-date weather-normalized Natural Gas Sales Growth\n\nElectric Margin — Electric revenues and fuel and purchased power expenses are impacted by fluctuations in the price of natural gas, coal and uranium used in the generation of electricity. However, these price fluctuations have minimal impact on electric margin due to fuel recovery mechanisms that recover fuel expenses. In addition, electric customers receive a credit for PTCs generated in a particular period.\n\nElectric revenues and margin:\n\nChanges in electric margin:\n\n(a) Includes approximately $17 million and $50 million, respectively, of additional PTC benefit (grossed-up for tax) as compared to the same periods in 2018, which are credited to customers through various regulatory mechanisms.\n\nNatural Gas Margin — Natural gas expense varies with changing sales and the cost of natural gas. However, fluctuations in the cost of natural gas has minimal impact on natural gas margin due to cost recovery mechanisms.\n\nNatural gas revenues and margin:\n\nChanges in natural gas margin:\n\nO&M Expenses — O&M expenses decreased $13 million, or 2.2%, for the third quarter of 2019 and increased $35 million, or 2.0%, year-to-date. Significant changes are summarized below:\n\nDepreciation and Amortization — Depreciation and amortization increased $7 million, or 1.6%, for the third quarter of 2019 and $120 million, or 10.0%, year-to-date. Increase was primarily driven by the Rush Creek and Hale wind farms going into service, as well as other capital investments, which was partially offset by accelerated amortization of PSCo’s prepaid pension asset in the third quarter of 2018.\n\nTaxes (Other than Income Taxes) — Taxes (other than income taxes) increased $2 million, or 1.5%, for the third quarter of 2019 and $12 million, or 2.9%, year-to-date. Increase was primarily due to higher property taxes in Colorado and Minnesota (net of deferred amounts).\n\nAFUDC, Equity and Debt — AFUDC decreased $21 million for the third quarter of 2019 and $32 million year-to-date. Decrease was primarily due to the Rush Creek wind project being placed in-service in 2018, partially offset by the Hale wind project, which went into service in June 2019, and other capital investments.\n\nInterest Charges — Interest charges increased $22 million, or 12.4%, for the third quarter of 2019 and $55 million, or 10.5%, year-to-date. Increase was primarily due to higher debt levels to fund capital investments, changes in short-term interest rates and implementation of lease accounting standard (offset in electric margin).\n\nIncome Taxes — Income taxes decreased $1 million for the third quarter of 2019. Higher pre-tax earnings were offset by an increase in wind PTCs and tax benefit adjustments attributable to the tax return filed for 2018. Wind PTCs are credited to customers (recorded as a reduction to revenue) and do not have a material impact on net income. The ETR was 12.0% for the third quarter of 2019 compared with 12.9% for the same period in 2018, largely due to the adjustments above.\n\nIncome taxes decreased $66 million for the first nine months of 2019, primarily driven by additional wind PTCs and lower pre-tax earnings. Wind PTCs are credited to customers (recorded as a reduction to revenue) and do not have a material impact on net income. The ETR was 10.1% for the first nine months of 2019 compared with 15.2% for the same period in 2018, largely due to the adjustments above.\n\nAdditional details provided below:\n\n(a) Regulatory differences for income tax primarily relate to the credit of excess deferred taxes to customers through the average rate assumption method and the timing of regulatory decisions regarding the return of excess deferred taxes. Income tax benefits associated with the credit of excess deferred credits are offset by corresponding revenue reductions and additional prepaid pension asset amortization.\n\nNote 3. Xcel Energy Capital Structure, Financing and Credit Ratings\n\nFollowing is the capital structure of Xcel Energy:\n\nCredit Facilities — As of Oct. 21, 2019, Xcel Energy Inc. and its utility subsidiaries had the following committed credit facilities available to meet liquidity needs:\n\n(a) Credit facilities expire in June 2024.\n\n(b) Includes outstanding commercial paper and letters of credit.\n\nTerm Loan Agreement — In December 2018, Xcel Energy Inc. renewed its $500 million 364-Day Term Loan Agreement. No additional capacity remains as loans borrowed and repaid may not be redrawn.\n\nAs of Sept. 30, 2019, Xcel Energy Inc.’s term loan borrowings were as follows:\n\nBilateral Credit Agreement — In March 2019, NSP-Minnesota entered into a one-year uncommitted bilateral credit agreement. The credit agreement is limited in use to support letters of credit.\n\nAs of Sept. 30, 2019, NSP-Minnesota’s outstanding letters of credit were as follows:\n\nForward Equity Agreement — In 2018, Xcel Energy entered into a forward equity agreement. On Aug. 29, 2019, Xcel Energy settled the forward equity agreement by delivering 9.4 million shares in exchange for $453 million.\n\nCredit Ratings — Access to the capital markets at reasonable terms is partially dependent on credit ratings. The following ratings reflect the views of Moody’s, S&P Global Ratings, and Fitch. In May 2019, Fitch revised its criteria for assigning short-term ratings and designated SPS’ short-term credit ratings (used for commercial paper) under criteria observation for a potential downgrade. In October 2019, Fitch removed SPS’ short-term credit ratings (used for commercial paper) from under criteria observation and affirmed SPS’ previous short-term rating of F2.\n\nThe highest credit rating for debt is Aaa/AAA and the lowest investment grade rating is Baa3/BBB-. The highest rating for commercial paper is P-1/A-1/F-1 and the lowest rating is P-3/A-3/F-3. A security rating is not a recommendation to buy, sell or hold securities. Ratings are subject to revision or withdrawal at any time by the credit rating agency and each rating should be evaluated independently of any other rating.\n\nAs of Oct. 21, 2019, the following represents the credit ratings assigned to Xcel Energy Inc. and its utility subsidiaries:\n\nCapital Expenditures — The estimated base capital expenditures for Xcel Energy for 2020 through 2024 are shown in the table below:\n\n(a) Other category includes intercompany transfers for safe harbor wind turbines.\n\nXcel Energy’s capital expenditure forecast is subject to continuing review and modification. Actual capital expenditures may vary from estimates due to changes in electric and natural gas projected load growth, safety and reliability needs, regulatory decisions, legislative initiatives, reserve requirements, availability of purchased power, alternative plans for meeting long-term energy needs, environmental regulation, and merger, acquisition and divestiture opportunities.\n\nFinancing for Capital Expenditures through 2024 — Xcel Energy issues debt and equity securities to refinance retiring maturities, reduce short-term debt, fund capital programs, infuse equity in subsidiaries, fund asset acquisitions and for other general corporate purposes. The current estimated financing plans of Xcel Energy for 2020 through 2024 are shown in the table below:\n\n(a) Net of dividends and pension funding.\n\n(b) Reflects a combination of short and long-term debt; net of refinancing.\n\n2019 Debt Financing — During 2019, Xcel Energy Inc. plans to issue approximately $75 to $80 million of equity through the Dividend Reinvestment and Stock Purchase Program and benefit programs. In addition, Xcel Energy Inc. and its utility subsidiaries issued or anticipate issuing the following debt securities:\n\n2020 Planned Debt Financing — During 2020, Xcel Energy Inc. and its utility subsidiaries anticipate issuing the following:\n\nFinancing plans are subject to change, depending on capital expenditures, regulatory outcomes, internal cash generation, market conditions and other factors.\n\nNote 4. Rates and Regulation\n\nNSP-Minnesota — Mankato Energy Center (MEC) Acquisition — In November 2018, NSP-Minnesota reached an agreement with Southern Power Company (a subsidiary of Southern Company) to purchase the Mankato Energy Center (MEC), a 760 MW natural gas combined cycle facility for approximately $650 million.\n\nOn Sept. 27, 2019, the Minnesota Public Utilities Commission (MPUC) voted to deny NSP-Minnesota's request to purchase MEC. The MPUC determined there was too much uncertainty regarding estimated customer benefits associated with the transaction without being able to fully review NSP-Minnesota's Resource Plan (filed July 2019).\n\nXcel Energy plans to acquire MEC as a non-regulated investment and step into the terms of the existing power purchase agreements (PPA) with NSP-Minnesota. Xcel Energy provided Southern Power Company formal contractual notice of transferring the purchase agreement to a newly formed non-regulated subsidiary and submitted acquisition and affiliated interest filings to the Federal Energy Regulatory Commission (FERC) and MPUC, respectively. Approval is anticipated by the end of 2019.\n\nNSP-Minnesota — Jeffers Wind and Community Wind North Repowering Acquisition — In December 2018, NSP-Minnesota filed a request with the MPUC seeking approval to acquire the Jeffers and Community Wind North wind facilities in western Minnesota from Longroad Energy. The wind farms, currently contracted under PPAs with NSP-Minnesota, will have approximately 70 MW of capacity after being repowered. The repowering and acquisition are expected to be complete by December 2020 and qualify for the 100% PTC benefit. The $135 million asset acquisition is projected to provide customer savings of approximately $7 million over the life of the facilities, compared to the amended PPAs. The FERC approved the acquisition in July 2019.\n\nThe DOC filed initial comments in support of NSP-Minnesota continuing to contract for the assets under the amended PPAs, but not the acquisition. In reply comments, NSP-Minnesota indicated it would be willing to acquire the wind facilities as a non-regulated investment and step into the terms of the PPAs, similar to MEC. In October, Xcel Energy filed with FERC requesting contingent approval for a non-regulated subsidiary to acquire the facilities, depending on the MPUC decision. The MPUC decision is expected in the fourth quarter of 2019.\n\nNSP-Minnesota — Mower Wind Facility — On Aug. 30, 2019, NSP-Minnesota filed a petition with the MPUC to acquire the Mower wind facility from affiliates of NextEra Energy, Inc. for an undisclosed amount. The Mower facility is located in southeastern Minnesota and is currently contracted under a PPA with NSP-Minnesota through 2026. Mower will be repowered and continue to have approximately 99 MW of capacity. The acquisition would occur after repowering which is expected to be complete in 2020 and qualify for 100% of the PTC. NSP-Minnesota will need approval from both the MPUC and FERC to complete the transaction. Timing of approval is uncertain.\n\nNSP-Wisconsin — Rate Case Settlement — In September 2019, the PSCW issued an interim order approving a settlement agreement. The settlement agreement results in no change to base electric rates through Dec. 31, 2021. For the natural gas utility, there would be a $3.2 million (4.6%) decrease to base rates, effective Jan. 1, 2020, and no additional changes to base rates through Dec. 31, 2021. The settlement is based on a return on equity (ROE) of 10.0% and an equity ratio of 52.5%. It also includes an earnings sharing mechanism, which would return to customers 50% of earnings between 10.25% and 10.75% ROE and 100% of earnings equal to or in excess of 10.75% ROE.\n\nPSCo — Colorado 2019 Electric Rate Case — In May 2019, PSCo filed a request with the Colorado Public Utilities Commission (CPUC) seeking a net rate increase of approximately $158 million, or 5.7%. The filing also requests the transfer of $249 million of rider revenue to base rates, which will not impact overall customer bills as the revenue is currently being recovered through various riders. The request is based on a ROE of 10.35%, an equity ratio of 56.46%, a rate base of approximately $8.2 billion, a historic test year ended Dec. 31, 2018 (adjusted for 2019 capital investment) and incorporates the full impact of tax reform.\n\nIn October 2019, PSCo filed rebuttal testimony and revised its request seeking a net increase to retail electric base rate revenue of $108.3 million, reflecting a $353.3 million increase offset by $245.0 million of previously authorized costs (currently recovered through various rider mechanisms). The rebuttal includes certain forecasted plant additions through June 2019 based on a 13-month average rate base convention, a ROE of 10.20%, an equity ratio of 55.61% (based on a 13-month average equity ending Aug. 31, 2019) and inclusion of short-term debt in the capital structure and CWIP in rate base.\n\nThe procedural schedule is as follows:\n\nIn September 2019, the CPUC Staff, FEA, OCC and CEC filed comprehensive answer testimony. Several other parties filed additional testimony.\n\nRecommendations and the estimated impact on PSCo’s filed electric rate request as calculated by the filing parties, but with our estimate of the impact of their recommendations on riders are as follows:\n\n(a) Staff, OCC and CEC have incorporated corrections to the filed case of ($4) million identified by PSCo.\n\n(b) Amounts derived from intervenors’ positions attributable to previously authorized costs (existing riders), impacted by proposed differences in weighted average cost of capital.\n\n(c) Amounts may not add due to rounding.\n\nPositions on PSCo’s filed electric rate request are as follows:\n\n(a) Incorporated 13-month average of proposed forecasted plant additions and rejected adjustments for wildfire mitigation improvements.\n\n(b) Incorporated year-end rate base and rejected proposed forecasted plant additions. Except for the transmission portion, the FEA supported portions of wildfire mitigation improvements and included 2019 distribution capital and O&M in its cost of service amount.\n\n(c) Incorporated proposed 13-month average rate base while rejecting the proposed forecasted plant additions including amounts requested for AGIS and wildfire mitigation improvements.\n\n(d) Rejected proposed forecasted plant additions and the majority of the adjustment for wildfire mitigation improvements.\n\nPSCo — Colorado 2019 Steam Rate Case — In May 2019, PSCo filed an unopposed settlement agreement with CPUC Staff and the City of Denver. The settlement reflects a rate increase of $7 million, a ROE of 9.67% for AFUDC purposes, an equity ratio of 56.04% and utilization of tax reform benefits. In September 2019, the CPUC approved the Settlement Agreement without modification. The first stepped increase went into effect Oct. 1, 2019, with full rates effective Oct. 1, 2020.\n\nSPS — Texas 2019 Electric Rate Case — In August 2019, SPS filed an electric rate case with the Public Utility Commission of Texas (PUCT) seeking an increase in retail electric base rates of approximately $141 million. The filing requests an ROE of 10.35%, a 54.65% equity ratio, a rate base of approximately $2.6 billion and is built on a 12 month period that ended June 30, 2019. In September 2019, SPS filed an update to the electric rate case and revised its requested increase to approximately $136 million.\n\nThe following table summarizes SPS’ base rate increase request:\n\nThe procedural schedule is as follows:\n\nThe final rates established at the end of the rate case are expected to be made effective relating back to Sept. 12, 2019. SPS expects a decision from the PUCT in the second quarter of 2020.\n\nSPS — New Mexico 2019 Electric Rate Case — In July 2019, SPS filed an electric rate case with the New Mexico Public Regulation Commission (NMPRC) seeking an increase in retail electric base rates of approximately $51 million. The rate request is based on a ROE of 10.35%, a 54.77% equity ratio, a rate base of approximately $1.3 billion and a historic test year with rate base additions through Aug. 31, 2019. SPS anticipates final rates will go into effect in the second or third quarter of 2020.\n\nSPS' proposed increase in base rates would be partially mitigated by savings to New Mexico customers achieved through fuel cost reductions and PTCs attributable to wind energy provided by the Hale Wind Farm. SPS’ $51 million requested increase in base rates would be offset by approximately $25 million of savings resulting in a net revenue increase of approximately $26 million, or 5.7%.\n\nThe following table summarizes SPS’ base rate increase request:\n\nThe procedural schedule is as follows:\n\nNote 5. Xcel Energy Earnings Guidance and Long-Term EPS and Dividend Growth Rate Objectives\n\nXcel Energy 2019 Earnings Guidance — Xcel Energy narrows its 2019 earnings guidance to $2.60 to $2.65 per share from $2.55 to $2.65 per share.(a)\n\nKey assumptions as compared with 2018 levels unless noted:\n\nXcel Energy 2020 Earnings Guidance — Xcel Energy’s 2020 GAAP and ongoing earnings guidance is a range of $2.73 to $2.83 per share.(a)\n\nKey assumptions as compared with projected 2019 levels unless noted:\n\n(a) Ongoing earnings is calculated using net income and adjusting for certain nonrecurring or infrequent items that are, in management’s view, not reflective of ongoing operations. Ongoing earnings could differ from those prepared in accordance with GAAP for unplanned and/or unknown adjustments. Xcel Energy is unable to forecast if any of these items will occur or provide a quantitative reconciliation of the guidance for ongoing EPS to corresponding GAAP EPS.\n\nLong-Term EPS and Dividend Growth Rate Objectives — Xcel Energy expects to deliver an attractive total return to our shareholders through a combination of earnings growth and dividend yield, based on the following long-term objectives:\n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20191024005177/en/\nPaul Johnson, Vice President, Investor Relations (612) 215-4535\n\nFor news media inquiries only,\nplease call Xcel Energy Media Relations (612) 215-5300\n\nXcel Energy internet address: www.xcelenergy.com\nSource: Xcel Energy Inc."
    },
    {
        "title": "Xcel Energy, EVRAZ North America and Lightsource BP announce that one of Colorado’s largest solar projects is moving forward",
        "subtitle": "",
        "date": "Sep 27, 2019 12:30PM EDT",
        "content": "\nPueblo facility will deliver clean, cost-effective energy to EVRAZ North America steel mill\n    PUEBLO, Colo.--(BUSINESS WIRE)--\nPlans to build one of the state’s largest solar facilities are a step closer to reality as Xcel Energy, EVRAZ North America and Lightsource BP announced today they have reached a long-term agreement to develop a new 240-megawatt solar facility in Pueblo.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20190927005389/en/\nLightsource BP will finance, build, own and operate the Bighorn Solar project and sell all the electricity it generates to Xcel Energy under a long-term power purchase agreement. It will be located on EVRAZ Rocky Mountain Steel property in Pueblo, making it the largest on-site solar facility dedicated to a single customer in the country. This innovative agreement makes possible EVRAZ North America’s planned long-term investment in Colorado, while supporting the goals of Xcel Energy’s partners and community.\n\n“We’re thrilled to partner with EVRAZ North America and Lightsource BP, two companies committed to creating innovative solutions, while developing new solar energy sources within the state,” said Alice Jackson, president of Xcel Energy Colorado. “Working together, we’re benefiting the environment and the local economy by retaining a valued company in southern Colorado.”\n\n“This pioneering partnership with Xcel Energy and Lightsource BP marks a milestone for the development of our new rail mill and will make EVRAZ North America the industry leader in the use of renewable energy to produce the greenest steel and engineered steel products in the world, from rail to rod & bar,” said Skip Herald, president and chief executive officer of EVRAZ North America. “This long-term agreement is key to our investment in Colorado’s new sustainable economy.”\n\n“Xcel Energy and EVRAZ North America have been excellent partners for Lightsource BP and we look forward to our continued collaboration as we bring this significant project online. The project highlights the tremendous potential that Colorado offers for large-scale solar and serves as a creative multi-stakeholder model to meet increasing demand for affordable, clean energy,” commented Kevin Smith, Lightsource BP’s Chief Executive Officer of the Americas. “We’re committed to building on this momentum and replicating this model across the U.S. as we grow our suite of clean energy solutions that boost local economies.”\n\nThe partners’ agreement requires final review by the Colorado Public Utilities Commission. It complements the broader Colorado Energy Plan, which will deliver 55% renewable energy to the grid by 2026 and reduce carbon emissions by 60%. The agreement is also part of Xcel Energy’s commitment to collaborate on solutions that benefit customers, communities and local economies.\n\nEVRAZ North America is Xcel Energy’s largest retail electric customer in Colorado and one of Pueblo’s largest employers. The companies agreed to work towards a long-term electricity contract in 2018 that gives the steel mill price certainty through 2041. With its 20-year, fixed rate structure, the project provides EVRAZ North America with predictable electricity prices and allows the mill, which employs about 1,000 workers, to stay in Pueblo.\n\nLightsource BP and project investors will invest an estimated $250 million into the solar facility. In addition to providing low cost-energy and budget certainty, the project will create about 300 jobs in construction, operations, maintenance and asset management. It will also contribute over $22 million in property tax revenue over the project life, benefitting local schools, street maintenance fire stations, parks and other community public services. The project is expected to go online by the end of 2021.\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\n\nAbout EVRAZ North America\nEVRAZ North America plc is a wholly-owned subsidiary of EVRAZ plc, one of the largest vertically integrated steel and mining businesses in the world. The company is a leading North American producer of engineered steel products for rail, energy and industrial end markets. Based in Chicago, Ill., the company has six production sites located in the United States (Portland, Oregon; Pueblo, Colorado) and Canada (Regina, Saskatchewan; Calgary, Camrose and Red Deer, Alberta).\n\nAbout Lightsource BP\nLightsource BP is an independent, global leader in the development, financing and long-term management of utility-scale solar PV projects with over US$3.4 billion of project investment raised and deployed across more than 2 GW of solar projects globally. Leveraging a strategic partnership with BP and through its integrated platform, structured finance, in-house engineering excellence and dedicated O&M division, Lightsource BP is helping drive the global energy transition with competitively priced, dependable, clean energy for businesses and communities. Lightsource BP comprises a team of over 350 industry specialists in 11 offices across four continents. Lightsource BP in the US is headquartered in San Francisco with its east coast office in Philadelphia and has a development portfolio of more than 4 GW of solar projects across the United States. For more information visit lightsourcebp.com, follow us on Twitter @lightsourceBP and Instagram @lightsourcebp or view our LinkedIn page.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190927005389/en/\nXcel Energy Media Relations\nMichelle Aguayo\n(303) 294-2300\nmediainquiries@xcelenergy.com\n\nEVRAZ North America\nPatrick Waldron\n(312) 320-2609\npatrick.waldron@evrazna.com\n\nLightsource BP\nMary Grikas\n(732) 429-3908\nMary.grikas@lightsourcebp.com\nSource: Xcel Energy / EVRAZ North America / Lightsource BP"
    },
    {
        "title": "Xcel Energy 3rd Quarter 2019 Earnings Conference Call",
        "subtitle": "",
        "date": "Sep 26, 2019 5:00AM EDT",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nOn Thursday, October 24, 2019, Xcel Energy (NASDAQ: XEL) will host a conference call to review third quarter 2019 financial results. Earnings will be released prior to the opening of trading.\n\nThe call will begin at 9:00 a.m., Central Time. To participate in the conference call, please dial in at least 5-10 minutes prior to the scheduled start and follow the operator’s instructions. You will be asked for the conference ID number.\n\nUS Dial-In: 720-543-0214\nInternational Dial-In: 400-120-8590\nConference ID: 8800386\n\nThe conference call will also be simultaneously broadcast and archived on our website, along with an MP3 download, at the following location:\n\nhttp://www.xcelenergy.com \nUnder Company, select: Investor Relations\n\nIf you are unable to participate in the live event, the call will be available for replay from 12:00 p.m. on October 24 through 12:00 p.m. on October 27, Central Time.\n\nReplay Numbers \nUS Dial-In: 719-457-0820\nInternational Dial-In: 888-203-1112\nReplay Passcode: 8121013\n\nFinancial analysts may call:\nPaul Johnson, Vice President - Investor Relations           612-215-4535\n\nNews media inquiries please call Xcel Energy Media Relations at 612-215-5300.\nInternet: www.xcelenergy.com\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190926005112/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy and Itron Collaborate to Bring Advanced Technology to Energy Industry",
        "subtitle": "",
        "date": "Sep 17, 2019 4:00PM EDT",
        "content": "\nThe strategic relationship is a key next step in developing smart meter capabilities and an advanced electrical grid\n    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy announced today that it entered an agreement with Itron to secure smart meters to install across its system. The agreement creates a new strategic collaboration with Itron to develop industry-leading smart technology for the energy grid and to give customers more insight into their energy usage, while enhancing grid reliability and improving response time to outages.\n\nThe relationship will help bring cutting-edge smart meters to Xcel Energy customers over the next five years and create opportunities for innovative new software applications, or apps, which will enable customers to transform the way they use energy. Ultimately, the goal is to help people save energy and money, while helping the industry shift to cleaner sources of power on an even more reliable advanced energy grid.\n\n“This collaboration is exciting because we’re not just developing the next generation of smart meters,” said Brett Carter, Xcel Energy’s chief customer and innovation officer, and executive vice president. “Combining forces with Itron allows us to work together on new applications to benefit our customers and build the electrical grid of the future.”\n\n“Itron’s proven solution connects millions of devices to deliver real-time solutions to today’s challenges,” said Sharelynn Moore, senior vice president of Networked Solutions at Itron. “We are thrilled to collaborate with Xcel Energy to improve customer experience by harnessing the connectivity and intelligence of the Industrial IoT to deliver smarter solutions.”\n\nThe new apps are expected to be able to generate real-time energy usage information for homes and businesses, in order to help customers save electricity and money. The technology will be capable of things like monitoring the energy efficiency of individual appliances in customers’ homes and allow for the development of submetering for charging electric vehicles. Ultimately, even more apps will be developed to provide for things like flexible billing and potentially, even prepaid electricity plans.\n\nSmart meters and the support for innovative new apps are an important step in Xcel Energy’s efforts toward building an advanced electrical grid that will supply clean, reliable energy and provide customers with new ways to save money and control their energy usage. Xcel Energy plans to eventually install smart meters throughout its entire service territory, subject to regulatory approval.\n\nAbout Xcel Energy\nXcel Energy (NASDAQ: XEL) provides the energy that powers millions of homes and businesses across eight Western and Midwestern states. Headquartered in Minneapolis, the company is an industry leader in responsibly reducing carbon emissions and producing and delivering clean energy solutions from a variety of renewable sources at competitive prices. For more information, visit xcelenergy.com or follow us on Twitter and Facebook.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190917006098/en/\nXcel Energy Media Relations\n(612) 215-5300\nwww.xcelenergy.com\nSource: Xcel Energy"
    },
    {
        "title": "Xcel Energy Second Quarter 2019 Earnings Report",
        "subtitle": "",
        "date": "Aug 1, 2019 6:00AM EDT",
        "content": "    MINNEAPOLIS--(BUSINESS WIRE)--\nXcel Energy Inc. (NASDAQ: XEL) today reported 2019 second quarter GAAP and ongoing earnings of $238 million, or $0.46 per share, compared with $265 million, or $0.52 per share in the same period in 2018.\n\nEarnings reflect higher electric and natural gas margins primarily due to non-fuel riders and regulatory rate outcomes, more than offset by 5 cents per share of unfavorable weather, increased depreciation, interest and operating and maintenance expenses.\n\n“Despite the milder than normal weather in the second quarter, Xcel Energy’s year-to-date earnings are on track and we are well-positioned to deliver earnings within our guidance range for the year,” said Ben Fowke, chairman, president and CEO of Xcel Energy.\n\n“I am pleased that we have filed our Upper Midwest Resource Plan, which is another significant step forward in our industry leading drive to reduce carbon emissions while ensuring reliability and affordability,” said Fowke. “This plan achieves an 80% reduction in carbon emissions in the region by 2030, through the early retirement of the remaining coal units in the Upper Midwest, by substantially growing the amount of renewables on our system and adding new firm peaking resources to ensure continued reliability. This plan is a key stepping stone toward the company achieving its vision to provide customers 100% carbon-free electricity by 2050.”\n\nAt 9:00 a.m. CDT today, Xcel Energy will host a conference call to review financial results. To participate in the call, please dial- in 5 to 10 minutes prior to the start and follow the operator’s instructions.\n\nThe conference call also will be simultaneously broadcast and archived on Xcel Energy’s website at www.xcelenergy.com. To access the presentation, click on Investor Relations. If you are unable to participate in the live event, the call will be available for replay from 12:00 p.m. CDT on Aug. 1 through 12:00 p.m. CDT on Aug. 4.\n\nExcept for the historical statements contained in this report, the matters discussed herein are forward-looking statements that are subject to certain risks, uncertainties and assumptions. Such forward-looking statements, including the 2019 earnings per share (EPS) guidance, long-term EPS and dividend growth rate, as well as assumptions and other statements are intended to be identified in this document by the words “anticipate,” “believe,” “could,” “estimate,” “expect,” “intend,” “may,” “objective,” “outlook,” “plan,” “project,” “possible,” “potential,” “should,” “will,” “would” and similar expressions. Actual results may vary materially. Forward-looking statements speak only as of the date they are made, and we expressly disclaim any obligation to update any forward-looking information. The following factors, in addition to those discussed in Xcel Energy’s Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2018 and subsequent securities filings, could cause actual results to differ materially from management expectations as suggested by such forward-looking information: changes in environmental laws and regulations; climate change and other weather, natural disaster and resource depletion, including compliance with any accompanying legislative and regulatory changes; ability of subsidiaries to recover costs from customers; reductions in our credit ratings and the cost of maintaining certain contractual relationships; general economic conditions, including inflation rates, monetary fluctuations and their impact on capital expenditures and the ability of Xcel Energy Inc. and its subsidiaries to obtain financing on favorable terms; availability or cost of capital; our customers’ and counterparties’ ability to pay their debts to us; assumptions and costs relating to funding our employee benefit plans and health care benefits; our subsidiaries’ ability to make dividend payments; tax laws; operational safety, including our nuclear generation facilities; successful long-term operational planning; commodity risks associated with energy markets and production; rising energy prices; costs of potential regulatory penalties; effects of geopolitical events, including war and acts of terrorism; cyber security threats and data security breaches; fuel costs; and employee work force and third party contractor factors.\n\nThis information is not given in connection with any\nsale, offer for sale or offer to buy any security.\n\nXCEL ENERGY INC. AND SUBSIDIARIES\nNotes to Investor Relations Earnings Release (Unaudited)\n\nDue to the seasonality of Xcel Energy’s operating results, quarterly financial results are not an appropriate base from which to project annual results.\n\nNon-GAAP Financial Measures\n\nThe following discussion includes financial information prepared in accordance with generally accepted accounting principles (GAAP), as well as certain non-GAAP financial measures such as electric margin, natural gas margin, ongoing earnings and ongoing diluted EPS. Generally, a non-GAAP financial measure is a measure of a company’s financial performance, financial position or cash flows that excludes (or includes) amounts that are adjusted from measures calculated and presented in accordance with GAAP. Xcel Energy’s management uses non-GAAP measures for financial planning and analysis, for reporting of results to the Board of Directors, in determining performance-based compensation, and communicating its earnings outlook to analysts and investors. Non-GAAP financial measures are intended to supplement investors’ understanding of our performance and should not be considered alternatives for financial measures presented in accordance with GAAP. These measures are discussed in more detail below and may not be comparable to other companies’ similarly titled non-GAAP financial measures.\n\nElectric and Natural Gas Margins\nElectric margin is presented as electric revenues less electric fuel and purchased power expenses. Natural gas margin is presented as natural gas revenues less the cost of natural gas sold and transported. Expenses incurred for electric fuel and purchased power and the cost of natural gas are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are generally offset in operating revenues. Management believes electric and natural gas margins provide the most meaningful basis for evaluating our operations because they exclude the revenue impact of fluctuations in these expenses. These margins can be reconciled to operating income, a GAAP measure, by including other operating revenues, cost of sales - other, operating and maintenance (O&M) expenses, conservation and demand side management (DSM) expenses, depreciation and amortization and taxes (other than income taxes).\n\nEarnings Adjusted for Certain Items (Ongoing Earnings and Ongoing Diluted EPS)\nGAAP diluted EPS reflects the potential dilution that could occur if securities or other agreements to issue common stock (i.e., common stock equivalents) were settled. The weighted average number of potentially dilutive shares outstanding used to calculate Xcel Energy Inc.’s diluted EPS is calculated using the treasury stock method. Ongoing earnings reflect adjustments to GAAP earnings (net income) for certain items. Ongoing diluted EPS is calculated by dividing the net income or loss of each subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period. Ongoing diluted EPS for each subsidiary is calculated by dividing the net income or loss of such subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period.\n\nWe use these non-GAAP financial measures to evaluate and provide details of Xcel Energy’s core earnings and underlying performance. We believe these measurements are useful to investors to evaluate the actual and projected financial performance and contribution of our subsidiaries. For the three and six months ended June 30, 2019 and 2018, there were no such adjustments to GAAP earnings and therefore GAAP earnings equal ongoing earnings for these periods.\n\nNote 1. Earnings Per Share Summary\n\nThe following summarizes diluted EPS for Xcel Energy:\n\n(a) Amounts may not add due to rounding.\n\nPSCo — Earnings decreased $0.04 per share for the second quarter of 2019 and $0.03 per share year-to-date. The decrease in year-to-date earnings was driven by higher O&M and depreciation partially offset by the timing of gas rates in 2018 and higher gas sales.\n\nNSP-Minnesota — Earnings increased $0.01 per share for the second quarter of 2019 and $0.01 per share year-to-date. The increase in year-to-date earnings primarily reflects higher electric margins driven by rate case outcomes, partially offset by increased depreciation and O&M expenses.\n\nSPS — Earnings were flat for the second quarter of 2019 and increased $0.04 per share year-to-date. Year-to-date results reflect higher electric margin attributable to rate case outcomes, sales growth and lower purchased capacity costs, despite unfavorable weather. Higher electric margin and AFUDC associated with the Hale County wind project were partially offset by increased depreciation, O&M and interest expenses.\n\nNSP-Wisconsin — Earnings decreased $0.01 per share for the second quarter of 2019 and $0.03 per share year-to-date, largely due to unfavorable weather, higher depreciation and O&M expenses.\n\nXcel Energy Inc. and other — Xcel Energy Inc. and other primarily includes financing costs at the holding company.\n\nComponents significantly contributing to changes in 2019 EPS compared with the same period in 2018:\n\n(a) Includes flow back of production tax credits (PTCs) and timing of tax reform regulatory decisions, which are primarily offset in revenue.\n\nNote 2. Regulated Utility Results\n\nEstimated Impact of Temperature Changes on Regulated Earnings — Unusually hot summers or cold winters increase electric and natural gas sales, while mild weather reduces electric and natural gas sales. The estimated impact of weather on earnings is based on the number of customers, temperature variances and the amount of natural gas or electricity historically used per degree of temperature. Weather deviations from normal levels can affect Xcel Energy’s financial performance.\n\nDegree-day or Temperature-Humidity Index (THI) data is used to estimate amounts of energy required to maintain comfortable indoor temperature levels based on each day’s average temperature and humidity. Heating degree-days (HDD) is the measure of the variation in the weather based on the extent to which the average daily temperature falls below 65° Fahrenheit. Cooling degree-days (CDD) is the measure of the variation in the weather based on the extent to which the average daily temperature rises above 65° Fahrenheit. Each degree of temperature above 65° Fahrenheit is counted as one CDD, and each degree of temperature below 65° Fahrenheit is counted as one HDD. In Xcel Energy’s more humid service territories, a THI is used in place of CDD, which adds a humidity factor to CDD. HDD, CDD and THI are most likely to impact the usage of Xcel Energy’s residential and commercial customers. Industrial customers are less sensitive to weather.\n\nNormal weather conditions are defined as either the 20-year or 30-year average of actual historical weather conditions. The historical period of time used in the calculation of normal weather differs by jurisdiction, based on regulatory practice. To calculate the impact of weather on demand, a demand factor is applied to the weather impact on sales. Extreme weather variations, windchill and cloud cover may not be reflected in weather-normalized estimates.\n\nPercentage increase (decrease) in normal and actual HDD, CDD and THI:\n\nWeather — Estimated impact of temperature variations on EPS compared with normal weather conditions:\n\nSales Growth (Decline) — Sales growth (decline) for actual and weather-normalized sales in 2019 compared to the same period in 2018:\n\nWeather-normalized Electric Sales Growth (Decline)\n\nWeather-normalized Natural Gas Sales Growth\n\nElectric Margin — Electric revenues and fuel and purchased power expenses are impacted by fluctuations in the price of natural gas, coal and uranium used in the generation of electricity. However, these price fluctuations have minimal impact on electric margin due to fuel recovery mechanisms that recover fuel expenses. In addition, electric customers receive a credit for PTCs generated in a particular period.\n\nElectric revenues and margin:\n\nChanges in electric margin:\n\n(a) Includes approximately $20 million and $32 million, respectively, of additional PTC benefit (grossed-up for tax) as compared to the same periods in 2018, which are flowed back to customers.\n\nNatural Gas Margin — Natural gas expense varies with changing sales and the cost of natural gas. However, fluctuations in the cost of natural gas has minimal impact on natural gas margin due to cost recovery mechanisms.\n\nNatural gas revenues and margin:\n\nChanges in natural gas margin:\n\nO&M Expenses — O&M expenses increased $8 million, or 1.4%, for the second quarter of 2019 and $49 million, or 4.3%, year-to-date. Significant changes are summarized below:\n\nDepreciation and Amortization — Depreciation and amortization increased $62 million, or 16.4%, for the second quarter of 2019 and $112 million, or 14.7%, year-to-date. Increase was primarily driven by the Rush Creek wind project being placed in-service (recovered in riders), additional amortization of a prepaid pension asset in Colorado related to tax reform settlements (offset in income taxes) and other capital investments.\n\nTaxes (Other than Income Taxes) — Taxes (other than income taxes) increased $5 million, or 3.6%, for the second quarter of 2019 and $10 million, or 3.5%, year-to-date. Increase was primarily due to higher property taxes in Colorado and Minnesota (net of deferred amounts).\n\nAFUDC, Equity and Debt — AFUDC decreased $7 million for the second quarter of 2019 and $11 million year-to-date. Decrease was primarily due to the Rush Creek wind project being placed in-service in 2018, partially offset by the Hale wind project, which went into service in June 2019, and other capital investments.\n\nInterest Charges — Interest charges increased $14 million, or 8.0%, for the second quarter of 2019 and $33 million, or 9.5%, year-to-date. Increase was primarily due to higher debt levels to fund capital investments, changes in short-term interest rates and implementation of lease accounting standard (offset in electric margin).\n\nIncome Taxes — Income taxes decreased $30 million for the second quarter of 2019 compared with 2018. The decrease was primarily driven by lower pretax earnings, an increase in wind PTCs and an increase in plant-related regulatory differences. Wind PTCs flow back to customers and do not have a material impact on net income. The ETR was 9.2% for the second quarter of 2019 compared with 16.9% for the same period in 2018, largely due to the adjustments above.\n\nIncome taxes decreased $65 million for the first six months of 2019 compared with 2018. The decrease was primarily driven by an increase in wind PTCs, an increase in plant-related regulatory differences, lower pretax earnings and a reversal of a valuation allowance. Wind PTCs flow back to customers and do not have a material impact on net income. The ETR was 8.1% for the first six months of 2019 compared with 17.0% for the same period in 2018, largely due to the adjustments above. The following table reconciles the difference between the statutory tax rate and the ETR:\n\n(a) Regulatory differences for income tax primarily relate to the flow back of excess deferred taxes to customers through the average rate assumption method and the impact of AFUDC - Equity. Quarterly variations primarily relates to the deferral of the flow back of excess deferred taxes in 2018, as a result of pending regulatory decisions. Treatment of most tax reform items was established prior to the first quarter of 2019, resulting in a reduction in deferred amounts. Income tax benefits associated with the flow back of excess deferred credits are offset by corresponding revenue reductions and additional prepaid pension asset amortization.\n\nNote 3. Xcel Energy Capital Structure, Financing and Credit Ratings\n\nFollowing is the capital structure of Xcel Energy:\n\nCredit Facilities — In the second quarter of 2019, Xcel Energy renewed and increased the level of its credit facilities. As of July 29, 2019, Xcel Energy Inc. and its utility subsidiaries had the following committed credit facilities available to meet liquidity needs:\n\n(a) Credit facilities expire in June 2024.\n(b) Includes outstanding commercial paper and letters of credit.\n\nTerm Loan Agreement — In December 2018, Xcel Energy Inc. renewed its $500 million 364-Day Term Loan Agreement. No additional capacity remains as loans borrowed and repaid may not be redrawn.\n\nAs of June 30, 2019, Xcel Energy Inc.’s term loan borrowings were as follows:\n\nBilateral Credit Agreement — In March 2019, NSP-Minnesota entered into a one-year uncommitted bilateral credit agreement. The credit agreement is limited in use to support letters of credit.\n\nAs of June 30, 2019, NSP-Minnesota’s outstanding letters of credit were as follows:\n\nCredit Ratings — Access to the capital markets at reasonable terms is partially dependent on credit ratings. The following ratings reflect the views of Moody’s, S&P Global Ratings, and Fitch. In May 2019, Fitch revised its criteria for assigning short-term ratings and designated SPS’ short-term credit ratings (used for commercial paper) under criteria observation for a potential downgrade.\n\nThe highest credit rating for debt is Aaa/AAA and the lowest investment grade rating is Baa3/BBB-. The highest rating for commercial paper is P-1/A-1/F-1 and the lowest rating is P-3/A-3/F-3. A security rating is not a recommendation to buy, sell or hold securities. Ratings are subject to revision or withdrawal at any time by the credit rating agency and each rating should be evaluated independently of any other rating.\n\nAs of July 29, 2019, the following represents the credit ratings assigned to Xcel Energy Inc. and its utility subsidiaries:\n\n2019 Planned Financing Activity — During 2019, Xcel Energy Inc. plans to issue approximately $75 to $80 million of equity through the Dividend Reinvestment and Stock Purchase Program and benefit programs. In addition, Xcel Energy Inc. and its utility subsidiaries issued and anticipate issuing the following debt securities:\n\nFinancing plans are subject to change, depending on capital expenditures, regulatory outcomes, internal cash generation, market conditions and other factors.\n\nNote 4. Rates and Regulation\n\nNSP-Minnesota — Mankato Energy Center (MEC) Acquisition — In November 2018, NSP-Minnesota reached an agreement with Southern Power Company to purchase the 760 megawatt (MW) natural gas combined cycle (CC) facility for approximately $650 million. NSP-Minnesota currently purchases the energy and capacity of this facility through purchase power agreements (PPAs). The acquisition is projected to provide net customer savings of approximately $50 million to $150 million over the life of the plant.\n\nIn May 2019, NSP-Minnesota entered into a partial settlement agreement with several environmental organizations and the Laborers’ International Union of North America. Under the terms of the agreement, the settling parties supported the MEC acquisition and NSP-Minnesota agreed to include (in its preferred plan in the Minnesota resource plan filing) early retirement of the Sherco 3 and King coal plants, as well as 3,000 MW of solar additions before 2030.\n\nIn May 2019, the Federal Energy Regulatory Commission (FERC) approved the purchase. In July 2019, the Minnesota Department of Commerce (DOC) and the Minnesota Office of the Attorney General (OAG) recommended the MPUC deny approval of the Mankato acquisition. The DOC and OAG also recommended that if the MPUC were to approve the transaction, that the Commission disallow all or a portion of the acquisitions adjustment as well as require certain other customer protections. The MPUC is expected to hold hearings and make a decision in the third quarter.\n\nNSP-Minnesota — Minnesota Resource Plan — In July 2019, NSP-Minnesota filed its Minnesota resource plan, which runs through 2034. The preferred plan would result in an 80% carbon reduction by 2030 and puts NSP on a path to achieving its vision of being 100% carbon-free by 2050. The preferred plan includes the following:\n\nIntervening parties will provide recommendations and comments on the resource plan. The MPUC is anticipated to make a final decision on the resource plan in late 2020 or the first half of 2021.\n\nNSP-Minnesota — Jeffers Wind and Community Wind North Repowering Acquisition — In December 2018, NSP-Minnesota filed a request with the MPUC seeking approval to acquire the Jeffers and Community Wind North wind facilities in western Minnesota from Longroad Energy. The wind farms, currently contracted under PPAs with NSP-Minnesota, will have approximately 70 MW of capacity after being repowered. The repowering and acquisition are expected to be complete by December 2020 and qualify for the 100% PTC benefit. The $135 million asset acquisition is projected to provide customer savings of approximately $7 million over the life of the facilities, compared to the amended PPAs. The FERC approved the acquisition in July 2019.\n\nThe DOC filed initial comments in support of NSP-Minnesota continuing to contract for the assets under the amended PPAs, but not the acquisition, pending additional information, including a purchase and sales agreement. NSP-Minnesota subsequently filed additional information, including an executed purchase and sale agreement, to address DOC concerns. Reply comments are due in August, with an MPUC decision expected in the second half of 2019.\n\nNSP-Wisconsin — Rate Case Settlement — In May 2019, NSP-Wisconsin filed an application with the Public Service Commission of Wisconsin (PSCW) seeking approval of a rate case settlement with various intervenors. For NSP-Wisconsin’s electric utility, the settlement agreement results in no change to base rates through Dec. 31, 2021. For the natural gas utility, there would be a $3.2 million (4.6%) decrease to base rates, effective Jan. 1, 2020, and no additional changes to base rates through Dec. 31, 2021. The settlement is based on a return on equity (ROE) of 10.0% and an equity ratio of 52.5%. It also includes an earnings sharing mechanism, which would return to customers 50% of earnings between 10.25% and 10.75% ROE and 100% of earnings equal to or in excess of 10.75% ROE. A PSCW decision is expected during the third quarter of 2019.\n\nPSCo — Colorado 2019 Electric Rate Case — In May 2019, PSCo filed a request with the Colorado Public Utilities Commission (CPUC) seeking a net rate increase of approximately $158 million, or 5.7%. The filing also requests the transfer of $249 million of rider revenue to base rates, which will not impact overall customer bills as the revenue is currently being recovered through various riders. The request is based on a ROE of 10.35%, an equity ratio of 56.46%, a historic test year ended Dec. 31, 2018 (adjusted for 2019 capital investment) and incorporates the full impact of tax reform. PSCo has requested rates effective Jan. 1, 2020.\n\n(a) Roll-in of Clean Air Clean Jobs Act (CACJA), transmission cost adjustment (TCA) and Rush Creek Wind Project (excluding PTCs) amounts into base rates will not impact total revenue as costs are currently recovered from customers through riders or the fuel clause.\n(b) Base rate request does not include the impact of the proposed Colorado Energy Plan.\n(c) Amounts may not add due to rounding.\n\nThe procedural schedule is as follows:\n\nPSCo — Colorado 2019 Steam Rate Case — In January 2019, PSCo filed a steam rate case in Colorado seeking a rate increase of $7.3 million, based on a ROE of 10.65%, an equity ratio of 56.29%, a rate base of $63 million and a 2017 historical test year including a capital reach forward for investments in the steam system.\n\nIn May 2019, PSCo filed an unopposed settlement agreement with CPUC Staff and the City of Denver. The settlement reflects a rate increase of $6.6 million, a ROE of 9.67% for AFUDC purposes, an equity ratio of 56.04% and utilization of tax reform benefits. Final rates would be effective in October 2020, with an initial step increase in October 2019. In July 2019, the Administrative Law Judge recommended that the settlement agreement be approved without modification. The settlement is pending a CPUC decision.\n\nSPS — New Mexico 2019 Electric Rate Case — In July 2019, SPS filed an electric rate case with the New Mexico Public Regulation Commission (NMPRC) seeking an increase in retail electric base rates of approximately $51 million. The rate request is based on a ROE of 10.35%, a 54.77% equity ratio, a rate base of approximately $1.3 billion and a historic test year with rate base additions through Aug. 31, 2019. SPS anticipates final rates will go into effect in the second or third quarter of 2020. SPS' net revenue increase to New Mexico consumers is expected to be approximately $26 million, or 5.7%, due to fuel cost reductions and PTCs attributable to wind energy provided by the Hale Wind Project. PTCs are being credited to customers through the fuel clause.\n\nThe following table summarizes SPS’ base rate increase request:\n\nThe procedural schedule is as follows:\n\nNote 5. Xcel Energy Earnings Guidance and Long-Term EPS and Dividend Growth Rate Objectives\n\nXcel Energy 2019 Earnings Guidance — Xcel Energy's 2019 GAAP and ongoing earnings guidance is a range of $2.55 to $2.65 per share.(a) Key assumptions:\n\n(a) Ongoing earnings is calculated using net income and adjusting for certain nonrecurring or infrequent items that are, in management’s view, not reflective of ongoing operations. Ongoing earnings could differ from those prepared in accordance with GAAP for unplanned and/or unknown adjustments. Xcel Energy is unable to forecast if any of these items will occur or provide a quantitative reconciliation of the guidance for ongoing EPS to corresponding GAAP EPS.\n\nLong-Term EPS and Dividend Growth Rate Objectives — Xcel Energy expects to deliver an attractive total return to our shareholders through a combination of earnings growth and dividend yield, based on the following long-term objectives:\n\n \n\n \nView source version on businesswire.com: https://www.businesswire.com/news/home/20190801005191/en/\nPaul Johnson, (612) 215-4535\nVice President, Investor Relations\n\nFor news media inquiries only:\nXcel Energy Media Relations, (612) 215-5300\nXcel Energy internet address: www.xcelenergy.com\nSource: Xcel Energy Inc."
    },
    {
        "title": "Atlantic Power Announces Agreement for the Sale of Manchief Plant",
        "subtitle": "",
        "date": "May 28, 2019 7:30AM EDT",
        "content": "DEDHAM, Mass., May 28, 2019 /PRNewswire/ -- Atlantic Power Corporation (NYSE: AT) (TSX: ATP) (\"Atlantic Power\" or the \"Company\") announced today that it has executed an agreement to sell its Manchief power plant to Public Service Co. of Colorado (\"PSCo\") for $45.2 million, subject to working capital and other customary adjustments. PSCo, a subsidiary of Xcel Energy, Inc. (NASDAQ: XEL), is the current customer under the Manchief Power Purchase Agreement (\"PPA\"). Closing of the sale is expected to occur in May 2022, following the expiration of the PPA. Manchief is an approximately 300 megawatt gas-fired peaking facility that entered commercial operation in July 2000. The plant is dispatchable by the customer under the terms of the PPA. In November 2017, the Company submitted several proposals in PSCo's 2017 All-Source Solicitation for its longer-term energy supply needs. In June 2018, the Company was notified by PSCo that PSCo had selected the proposal under which it would acquire Manchief from the Company at the end of the PPA term. \"We are pleased to announce this transaction, which is a positive financial outcome for Atlantic Power and also helps our customer to meet its power needs,\" said James J. Moore, Jr., President and CEO of Atlantic Power. \"By retaining Manchief for the next three years, we will continue to realize the cash flows for the remaining PPA term. In addition, upon expiration of the PPA in 2022, the sale of the plant will provide us with a cash purchase price that eliminates uncertainty about post-PPA revenue and will support continued debt reduction.\"  The sale is subject to various closing conditions and approvals, including the receipt of regulatory approvals from the Colorado Public Utilities Commission and the Federal Energy Regulatory Commission, which are expected within approximately 11 months of filing. Proceeds of the sale are expected to be used to reduce the remaining principal amount of the Company's Senior Secured Term Loan.About Atlantic PowerAtlantic Power is an independent power producer that owns power generation assets in nine states in the United States and two provinces in Canada. The generation projects sell electricity and steam to investment-grade utilities and other creditworthy large customers predominantly under long‑term PPAs that have expiration dates ranging from 2019 to 2037. The Company seeks to minimize its exposure to commodity prices through provisions in the contracts, fuel supply agreements and hedging arrangements. The projects are diversified by geography, fuel type, technology, dispatch profile and offtaker (customer). The majority of the projects in operation are 100% owned and directly operated and maintained by the Company. The Company has expertise in operating most fuel types, including gas, hydro, and biomass, and it owns a 40% interest in one coal project. Atlantic Power's shares trade on the New York Stock Exchange under the symbol AT and on the Toronto Stock Exchange under the symbol ATP. For more information, please visit the Company's website at www.atlanticpower.com or contact:Atlantic Power Corporation Investor Relations (617) 977-2700 info@atlanticpower.comCopies of the Company's financial data and other publicly filed documents are available on SEDAR at www.sedar.com or on EDGAR at www.sec.gov/edgar.shtml under \"Atlantic Power Corporation\" or on the Company's website.Cautionary Note Regarding Forward-Looking StatementsTo the extent any statements made in this news release contain information that is not historical, these statements are forward-looking statements within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the U.S. Securities Exchange Act of 1934, as amended, and forward-looking information under Canadian securities law (collectively, \"forward-looking statements\"). Certain statements in this news release may constitute \"forward-looking statements\", which reflect the expectations of management regarding the future growth, results of operations, performance and business prospects and opportunities of the Company and its projects. These statements, which are based on certain assumptions and describe the Company's future plans, strategies and expectations, can generally be identified by the use of the words \"may,\" \"will,\" \"should,\" \"project,\" \"continue,\" \"believe,\" \"intend,\" \"anticipate,\" \"expect\" or similar expressions that are predictions of or indicate future events or trends and which do not relate solely to present or historical matters. Examples of such statements in this press release include, but are not limited, to statements with respect to the following:Forward-looking statements involve significant risks and uncertainties, should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether or not or the times at or by which such performance or results will be achieved. Please refer to the factors discussed under \"Risk Factors\" and \"Forward-Looking Information\" in the Company's periodic reports as filed with the U.S. Securities and Exchange Commission (the \"SEC\") from time to time for a detailed discussion of the risks and uncertainties affecting the Company. Although the forward-looking statements contained in this news release are based upon what are believed to be reasonable assumptions, investors cannot be assured that actual results will be consistent with these forward-looking statements, and the differences may be material. These forward-looking statements are made as of the date of this news release and, except as expressly required by applicable law, the Company assumes no obligation to update or revise them to reflect new events or circumstances.   View original content:http://www.prnewswire.com/news-releases/atlantic-power-announces-agreement-for-the-sale-of-manchief-plant-300857141.htmlSOURCE  Atlantic Power Corporation"
    }
]