[
    {
        "title": "Xilinx Launches Industry's First SmartNIC Platform Bringing Turnkey Network, Storage and Compute Acceleration to Cloud Data Centers",
        "subtitle": "",
        "date": "Mar 3, 2020 9:00AM EST",
        "content": "SAN JOSE, Calif., March 3, 2020 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX) today announced the industry's first SmartNIC platform delivering true convergence of network, storage and compute acceleration functions on a single device. The Alveo™ U25 SmartNIC is designed to bring the greater efficiency and lower TCO benefits of SmartNICs to cloud service providers, telcos, and private cloud data center operators struggling with increasing networking demands and rising costs. The U25 combines a highly optimized SmartNIC platform with a powerful and flexible FPGA-based engine that supports full programmability and turnkey accelerated applications. The U25 delivers a comprehensive SmartNIC platform to address the industry's most challenging demands and workloads such as SDN, virtual switching, NFV, NVMe-oF, electronic trading, AI inference, video transcoding, and data analytics.\n                        \n                    \n                In addition, Xilinx announced its first XtremeScale™ Ethernet adapter card in the Open Compute Project (OCP) Spec 3.0 form factor and a proof of concept for the world's first FPGA-based OCP Accelerator Module (OAM).\"The SmartNIC market is forecast to surpass $600M and comprise 23 percent of the worldwide Ethernet adapter market by 2024,\" according to Baron Fung, research director at Dell'Oro Group. \"As cloud service providers scale capacity upwards, they are increasing their deployment of SmartNICs to free up valuable CPU cores for business applications, optimizing server utilization. The telco service providers, another market with strong growth potential, are looking to integrate SmartNICs from the core to the edge of the network for applications such as NFV and AI inferencing. FPGA-based SmartNICs such as the Alveo U25 are well positioned to address this growing market opportunity.\" Converged SmartNIC Platform for Accelerated CloudsAs network port speeds continue to increase, tier 2 and 3 cloud service providers, telcos, and private cloud data center operators are facing mounting networking challenges and costs. Still, the significant R&D investments required to develop and deploy SmartNICs have hindered broader adoption. The Alveo U25 SmartNIC platform addresses these barriers by providing true plug-and-play capabilities that make SmartNICs accessible for more widespread deployments.Powered by Xilinx's industry-leading FPGA technology, the Alveo U25 SmartNIC provides higher throughput and a far more adaptable engine than SoC-based NICs to allow cloud architects to accelerate a wide range of functions and applications quickly. The platform enables 'bump-in-the-wire' network, storage, and compute offload and acceleration functions for maximum efficiency by avoiding unnecessary data movements and CPU processing. This dramatically reduces the CPU burden and reclaims resources to run more applications. Embedded ARM processors provide unique and critical control plane processing to support emerging bare metal server use cases. The baseline NIC delivers ultra-high throughput, small packet performance, and low-latency. Standard full-featured NIC functionality and drivers, including Onload® application acceleration software, can reduce latency up to 80 percent and improve transmission control protocol (TCP)-based server application efficiency by up to 400 percent in cloud-based applications.  \"Today's cloud infrastructures suffer from critical data bottlenecks caused by server I/O,\" said Donna Yasay, vice president of marketing, Data Center Group at Xilinx. \"With up to 30 percent of data center compute resources allocated for networking I/O processing, overhead continues to grow along with CPU cores. Xilinx is addressing the challenges resulting from the increased demands on networking by providing an easier to deploy SmartNIC with turnkey accelerated applications and out-of-the-box capabilities that go far beyond fundamental networking.\" Out-of-the-Box Accelerated Applications for Faster Time-to-MarketThe Alveo U25 SmartNIC platform enables turnkey accelerated applications that make it easier for non-tier-1 cloud data center operators to deploy SmartNICs and quickly reap the benefits. The U25 SmartNIC supports turnkey applications from both Xilinx and independent software vendors. The programming model supports high-level network programming abstractions such as HLS and P4, as well as compute acceleration frameworks such as the Vitis™ unified software platform to enable Xilinx and third party accelerated applications. The first out-of-the-box accelerated application available on the Alveo U25 SmartNIC is support for Open vSwitch (OVS) offload and acceleration. The plug-and-play solution will offload over 90 percent of OVS processing from the server to improve packet throughput by over 5X. Future turnkey solutions from Xilinx are planned for security functions such as IPSec, SSL/TLS, AES-256/128, and distributed firewall as well as AI inference acceleration.The Alveo U25 SmartNIC is currently sampling with early access customers. General availability is expected in the third calendar quarter of 2020. First OCP 3.0 Ethernet Adapter and OCP Accelerator ModuleXilinx also unveiled the new XtremeScale X2562 10/25Gb Ethernet adapter card based on the OCP Spec 3.0 form factor. Designed for high-performance electronic trading environments and enterprise data centers, the X2562 features sub-microsecond latency and high throughput with ultra-scale connectivity for real-time packet and flow information to thousands of virtual NICs. The X2562 is currently sampling and will be generally available in the second calendar quarter of 2020.  Additionally, Xilinx announced a proof of concept for the world's first FPGA-based Open Compute Accelerator Module (OAM). Based on the Xilinx® UltraScale+™ VU37P FPGA with 8GB of HBM memory and compliant with Open Accelerator Infrastructure (OAI), the mezzanine-based card supports seven 25Gbps x8 links to enable rich inter-module system topologies for distributed acceleration.Follow Xilinx on Twitter, LinkedIn and Facebook.About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.© Copyright 2020 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.PR Contact:Brian Garabedianbrian.garabedian@xilinx.com\n                        \n                    \n                 View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-launches-industrys-first-smartnic-platform-bringing-turnkey-network-storage-and-compute-acceleration-to-cloud-data-centers-301014893.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Recommends Rejection of TRC Capital's \"Mini-Tender\" Offer",
        "subtitle": "",
        "date": "Feb 21, 2020 5:00PM EST",
        "content": "SAN JOSE, Calif., Feb. 21, 2020 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX) today announced that it has been notified of an unsolicited \"mini-tender\" offer by TRC Capital Investment Corporation to purchase up to 1.5 million shares of its common stock (approximately 0.6 percent of outstanding shares) at $81.75 per share. The offer price is approximately 4.52 percent below the $85.62 per share price that Xilinx common stock closed at on February 7, 2020 – the last trading day prior to the date when TRC Capital commenced its mini-tender offer – and is approximately 8.95 percent below the $89.79 per share at which Xilinx common stock closed on February 20, the day prior to this release.Xilinx does not endorse TRC Capital's unsolicited offer and recommends that Xilinx stockholders reject the offer and not tender their shares in response to it. Not only is the mini-tender offer at a price below the market price for Xilinx shares, as of today's date, it is also subject to numerous conditions, including TRC Capital's ability to obtain financing. Xilinx is not associated in any way with TRC Capital, its mini-tender offer or the offer documentation, nor did Xilinx have advance notice of this mini-tender offer.TRC Capital has made numerous similar, unsolicited mini-tender offers for shares of other publicly traded companies. Mini-tender offers are designed to seek to acquire less than five percent of a company's outstanding shares, thereby avoiding many disclosure and procedural requirements of the Securities and Exchange Commission (\"SEC\"), which applies to tender offers for more than five percent of a company's outstanding shares. As a result, mini-tender offers do not provide investors with the same level of protections as provided by larger tender offers under United States securities laws. The SEC's guidance to investors on mini-tender offers is available here. This alert advises that mini-tender offers \"have been increasingly used to catch investors off guard. Many investors who hear about mini-tender offers surrender their securities without investigating the offer, assuming that the price offered includes the premium usually present in larger, traditional tender offers. But they later learn that they cannot withdraw from the offer and may end up selling their securities at below-market prices.\"Like TRC Capital's other offers, this one puts individual investors at risk because they may not realize they are selling their shares at a discount. Xilinx urges investors to obtain current market quotations for their shares, review the conditions to the offer, consult with their broker or financial adviser and to exercise caution with respect to TRC Capital's mini-tender offer. Xilinx stockholders who have already tendered are advised that they may withdraw their shares by providing the written notice described in the TRC Capital offering documents prior to the expiration of the offer, which is currently scheduled at 12:01 a.m. Eastern Daylight  Time on Wednesday, March 11.Xilinx requests that a copy of this press release be included with all distributions of materials relating to TRC Capital's offer.Xilinx encourages brokers and dealers, as well as other market participants, to review the SEC's letter regarding broker-dealer mini-tender offer dissemination and disclosures here, and the NASD Notice to Members 99-53 issued in July 1999 regarding guidance to members forwarding mini-tender offers to their customers, which can be found here. Follow Xilinx on Twitter, LinkedIn and Facebook.About Xilinx Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies - from the endpoint, to the edge, to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future. For more information, visit www.xilinx.com.© Copyright 2020 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.PR Contact:Tara Simsmedia@xilinx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-recommends-rejection-of-trc-capitals-mini-tender-offer-301009333.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Adds Advanced Machine Learning Capabilities for Pro AV and Broadcast Platforms",
        "subtitle": "",
        "date": "Feb 10, 2020 3:00AM EST",
        "content": "AMSTERDAM, Feb. 10, 2020 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced a range of new and advanced machine learning (ML) capabilities for Xilinx devices targeted at the professional audio/video (Pro AV) and broadcast markets. Additionally, Xilinx unveiled the industry's first demonstration of a programmable HDMI 2.1 implementation on its 7nm Versal™ devices. Xilinx is showcasing these capabilities and more at Integrated Systems Europe (ISE) 2020, taking place this week in Amsterdam. These and other highly adaptable Xilinx solutions for the Pro AV and broadcast markets are designed to help customers reduce costs and future proof investments while keeping pace with new usage models and evolving industry standards. Advanced ML capabilities for AI edge processingNewly available ML capabilities for Xilinx Pro AV and broadcast platforms include region-of-interest encoding, intelligent digital signage, automatic object tracking and window cropping, and speech recognition. Customers can now take advantage of these ML capabilities on Xilinx devices, including the already highly integrated Zynq® UltraScale+™ MPSoC platform, for AI edge processing. The combination of real-time audio and video processing, AV connectivity interfaces, codecs, IP networking, CPU, and GPU into an adaptable and scalable single-chip solution can provide users with significant space, power, and cost savings.\"Machine learning is a rapidly developing technology that is stimulating new usage models in Pro AV and broadcast,\" said Ramesh Iyer, director of Pro AV & Broadcast at Xilinx. \"Adding ML into Xilinx's adaptable platforms provides a highly integrated AV processor that delivers proven support for 8K video, AV-over-IP, and compression, and now adds advanced capabilities for monetizing analytics, improving workflow efficiency and enhancing usability. Ultimately, these integrated ML features will allow companies to increase innovation, differentiate themselves, and accelerate time-to-market.\"Pro AV market customers can apply the new ML capabilities across many applications and workloads. Key examples, include:First HDMI 2.1 implementation on 7nm devicesAt ISE 2020, Xilinx will demonstrate the industry's first programmable HDMI 2.1 implementation on its 7nm Versal™ devices, built on the first adaptive compute acceleration platform (ACAP). The ACAP is a revolutionary new category of heterogeneous compute devices with capabilities far exceeding those of conventional CPUs, GPUs and FPGAs.With data rates up to 48Gbps, HDMI 2.1 supports a range of higher video resolutions and frame rates, including 8K60 and 4K120, for a more immersive experience in LED walls, large format displays, digital signage, and applications that rely on fast-moving video such as live sports. Developed in preparation for this, HDMI 2.1 support on Versal ACAP will allow customers to transmit, receive and process up to 8K (7680 x 4320 pixels) ultra-high-definition (UHD) video.The 7nm Versal ACAP offers scalar, adaptable and intelligent engines in a software-programmable silicon infrastructure, providing a tight coupling between embedded software, multichannel AV processing pipelines, and AI inferencing. Additionally, combining real-time video processing, AV connectivity interfaces, codecs, IP networking, CPU, GPU and more into a single-chip solution means that customers can save space, power, and cost. Integrated Systems Europe 2020 Xilinx will be showcasing the newly available ML capabilities, first programmable HDMI 2.1 implementation on a 7nm device, and other cutting-edge solutions for the Pro AV and broadcast markets at ISE 2020 this week in Amsterdam, Netherlands, in booth #15-D240. For more information on the demos Xilinx will showcase, visit: https://www.xilinx.com/about/events/2020/ise-2020.html Follow Xilinx on Twitter, LinkedIn and Facebook.About Xilinx Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint, to the edge, to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.© Copyright 2020 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.PR Contact: Christelle Moragacmoraga@xilinx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-adds-advanced-machine-learning-capabilities-for-pro-av-and-broadcast-platforms-301001204.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Reports Fiscal Third Quarter 2020 Results",
        "subtitle": "",
        "date": "Jan 28, 2020 4:20PM EST",
        "content": "SAN JOSE, Calif., Jan. 28, 2020 /PRNewswire/ -- Xilinx, Inc. (Nasdaq: XLNX), the leader in adaptive and intelligent computing, today announced revenues of $723 million for the third quarter of fiscal year 2020, down 13% from the prior quarter and down 10% year over year. GAAP net income for the December quarter was $162 million, or $0.64 per diluted share.  Non-GAAP net income for the December quarter was $171 million, or $0.68 per diluted share.  The Xilinx Board of Directors declared a quarterly cash dividend of $0.37 per outstanding share of common stock payable on February 20, 2020 to all stockholders of record at the close of business on February 11, 2020.Additional third quarter of fiscal year 2020 comparisons are provided in the charts below. Xilinx also announced cost-saving measures designed to drive structural operating efficiencies across the company. Xilinx expects to reduce its global workforce by approximately 7% through a targeted reduction in force and meaningfully slower hiring to replace attrition. In addition to the targeted reduction in force, Xilinx is taking other measures to reduce operating expenses, including further reducing discretionary spend and targeting additional operating efficiencies across the business. As a result of these measures, Xilinx expects to generate non-GAAP cost and operating expense savings of approximately $17M to $20M in the fourth quarter.  Additionally, Xilinx expects to incur a GAAP pre-tax charge of approximately $25M to $30M in the fourth quarter of fiscal 2020 primarily related to severance pay expenses. \"As expected, our fiscal third quarter was a challenging quarter and our revenue came in near the midpoint of our guidance. Given the revenue headwinds we experienced during the quarter, we took  actions to reduce our operating expenses which delivered earnings greater than our expectations.\"Fiscal fourth quarter revenue is expected to grow on a sequential basis as a result of strength in our core vertical markets and a moderate resumption of growth in our data center business. However, we are seeing greater than expected weakness in our wired and wireless business due to a slowdown in both 5G and wired infrastructure deployments, in addition to ongoing global trade headwinds. \"We expect some of these headwinds in our wired and wireless business to be persistent, resulting in revenue growth lower than our prior expectations.  We are, therefore, taking several actions to further reduce our operating expenses this quarter.\"These are difficult actions, but we believe the decisive steps we are taking to reset our operating expenses will allow us to drive our growth strategy and technology roadmap while enabling a more appropriate level of operating profitability.  We remain extremely focused on our mission and long-term growth opportunities as the leader in adaptable platforms from the cloud to edge to endpoints,\" said Victor Peng, president and chief executive officer. Product and Financial Highlights – Fiscal Third Quarter 2020Business Outlook – Fiscal Fourth Quarter 2020The following guidance is based on current expectations and estimates, and as indicated, is presented on a GAAP and non-GAAP basis. This guidance is forward-looking and actual results may differ materially, as a result of, among other things, the important factors discussed and referred to at the end of this release.  Conference CallA conference call will be held today at 2:00 p.m. Pacific Time to discuss the December quarter financial results and management's outlook for the March quarter and fiscal year 2020. The webcast and subsequent replay will be available in the investor relations section of the Company's web site at www.investor.xilinx.com.  A telephonic replay of the call may be accessed later in the day by calling (855) 859-2056 and referencing confirmation code 9868367. The telephonic replay will be available for two weeks following the live call.  Non-GAAP Financial InformationFiscal third quarter 2020 results and business outlook for the March quarter include financial measures which are not determined in accordance with the United States generally accepted accounting principles (GAAP), as indicated.  Non-GAAP measures should not be considered as a substitute for, or superior to, financial measures determined in accordance with GAAP. The presentation of non-GAAP financial measures has been reconciled, in each case, to the most directly-comparable GAAP measure, as indicated in the accompanying tables. The Company's calculation of such non-GAAP measures may not be comparable to similarly-titled measures used by other companies.Management uses the non-GAAP financial measures disclosed herein to evaluate the Company's financial results from continuing operations (excluding the impact of acquisitions) and compare to operating performance in past periods.  Similarly, Management believes presentation of these non-GAAP measures is useful to investors because it enables investors and analysts to evaluate operating expenses of the Company's core business, excluding the impact of non-core business expenses such as acquisition-related amortization and non-recurring items.M&A related expenses: These expenses mainly consist of legal and consulting fees associated with acquisition activities.  The Company believes these costs do not reflect its current operating performance. Consequently, the non-GAAP adjustments exclude these charges to facilitate an evaluation of the Company's current operating performance and comparisons to its past operating performance.Amortization of acquisition-related intangibles:  Amortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology acquired in connection with business combinations. The non-GAAP adjustments exclude these charges to facilitate an evaluation of the Company's current operating performance and comparisons to its past operating performance.Inventory valuation adjustment: Business combination accounting principles require the Company to measure acquired inventory at fair value. The fair value of inventory reflects the acquired company's cost of manufacturing plus a portion of the expected profit margin. The non-GAAP adjustment to the Company's cost of revenues excludes the expected profit margin component that is recorded under business combination accounting principles associated with the Company's acquisitions. The Company believes the adjustment is useful to investors as an additional means to reflect cost of revenues and gross margin trends of its business.Gain on investment related to acquisition: The Company excludes the accounting gain resulting from revaluation of its prior minority investment in DeePhi Tech. The Company believes excluding this gain will facilitate a comparable evaluation of its current operating performance to its past operating performance. Income taxes: The Company excludes the income tax effects of non-GAAP adjustments reflected in Operating expenses and Other income, as detailed above. It also excludes U.S. tax reform related items and other significant tax effects of post-acquisition tax integration transactions.  The Company believes excluding U.S. tax reform and post-acquisition tax integration items will facilitate a comparable evaluation of its current performance to its past performance. The fourth quarter of fiscal 2020 outlook does not reflect other tax related items which the Company is not able to predict without unreasonable efforts due to their inherent uncertainty.Severance-related expenses:  These expenses primarily consist of severance-related pay and benefits in connection with the targeted reduction in force.  The Company believes excluding these charges will facilitate a comparable evaluation of its current operating performance to its past and future performance. Forward-Looking StatementsThis release contains forward-looking statements and projections. Forward-looking statements and projections can often be identified by the use of forward-looking words such as \"expect,\" \"believe,\" \"may,\" \"will,\" \"could,\" \"anticipate,\" \"estimate,\" \"continue,\" \"plan,\" \"intend,\" \"project\" or other similar expressions.  Statements that refer to or are based on projections, uncertain events or assumptions also identify forward-looking statements.  Such forward looking statements include, but are not limited to, statements related to the semiconductor market, the growth and acceptance of our products, expected revenue growth, the demand and growth in the markets we serve, opportunity for expansion into new markets, and our expectations regarding our business outlook for the March quarter.  Undue reliance should not be placed on such forward-looking statements and projections, which speak only as of the date they are made. We undertake no obligation to update such forward-looking statements.  Actual events and results may differ materially from those in the forward-looking statements and are subject to risks and uncertainties including, among others, customer acceptance of our new products, current global economic conditions, our dependence on certain customers, trade and export restrictions, the condition and performance of our customers and the end markets in which they participate, our ability to forecast end customer demand, a high dependence on turns business, more customer volume discounts than expected, greater product mix changes than anticipated, fluctuations in manufacturing yields, our ability to deliver product in a timely manner, our ability to successfully manage production at multiple foundries, variability in wafer pricing, costs and liabilities associated with current and future litigation, our ability to generate cost and operating expense savings in an efficient and timely manner, our ability to realize the goals contemplated by our acquisitions and strategic investments, the impact of current and future legislative and regulatory changes, the impact of new accounting pronouncements and tax laws, including the U.S. Tax Cuts and Jobs Act, and interpretations thereof, and other risk factors described in our most recent Forms 10-Q and 10-K.About Xilinx Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future. For more information, visit www.xilinx.com.Xilinx, the Xilinx logo, Artix, ISE, Kintex, Spartan, Virtex, Zynq, Vivado, Alveo, Versal and other designated brands included herein are trademarks of Xilinx in the United States and other countries. All other trademarks are the property of their respective owners.XLNX-FInvestor Relations Contact:Suresh Bhaskaran Xilinx, Inc.(408) 879-4784          ir@xilinx.com       View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-reports-fiscal-third-quarter-2020-results-300994832.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Files Patent Infringement Lawsuit Against Analog Devices",
        "subtitle": "",
        "date": "Jan 21, 2020 7:49AM EST",
        "content": "    SAN JOSE, Calif.--(BUSINESS WIRE)--\nXilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced that it has filed claims against Analog Devices, Inc., asserting infringement of eight United States patents in the United States District Court for the District of Delaware. The lawsuit details the unauthorized use by Analog Devices of certain Xilinx technologies involving serializers/deserializers (SerDes), high-speed analog-to-digital converters (ADCs) and digital-to-analog converters (DACs), as well as mixed-signal devices targeting 5G and other markets. In addition to seeking damages, Xilinx is requesting that Analog Devices be enjoined from selling, offering to sell, or importing into the United States, products that infringe Xilinx’s asserted patents.\n\n“Xilinx has made important advances in RF signal chain technologies and has been awarded a significant number of fundamental patents by the U.S. Patent and Trademark Office,” says Catia Hagopian, senior vice president, General Counsel, Xilinx, Inc. “As our claims indicate, we believe Analog Devices is infringing our intellectual property rights and we are committed to protecting our innovations.”\n\nThe claims, which were filed as part of counterclaims in the parties’ existing lawsuit, can be found here.\n\nAbout Xilinx\n\nXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint, to the edge, to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.\n\n© Copyright 2020 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20200121005582/en/\nTara Sims\nmedia@xilinx.com\nSource: Xilinx"
    },
    {
        "title": "Xilinx Issues Statement in Response to Analog Devices Patent Infringement Lawsuit",
        "subtitle": "",
        "date": "Dec 5, 2019 2:12PM EST",
        "content": "SAN JOSE, Calif., Dec. 5, 2019 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today issued a response to the patent infringement lawsuit filed today by Analog Devices, Inc.  The statement is the following:On December 5, 2019, a patent infringement lawsuit was filed by Analog Devices against Xilinx and our Zynq UltraScale+ RFSoC in the United States District Court for the District of Delaware. We intend to vigorously defend against this lawsuit. Xilinx has a history of creating pioneering technology spanning multiple decades. We created what many thought could not be done with the introduction of the Zynq UltraScale+ RFSoC - the industry's only single-chip adaptable radio platform.  Through its patent lawsuit, Analog Devices has chosen to litigate rather than compete in the market.About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.© Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.PR Contact:Tara Simsmedia@xilinx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-issues-statement-in-response-to-analog-devices-patent-infringement-lawsuit-300970248.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Vitis AI Now Available for Download",
        "subtitle": "",
        "date": "Dec 2, 2019 8:00PM EST",
        "content": "BEIJING, Dec. 2, 2019 /PRNewswire/ -- (Xilinx Developer Forum China 2019) – Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced its AI inference development platform, Vitis™ AI is available for immediate download free of charge. Combined with the Vitis unified software platform, Vitis AI empowers software developers with deep learning acceleration, as part of their software code. Vitis AI integrates a domain-specific architecture (DSA) and configures Xilinx hardware to be optimized and programmed using industry-leading frameworks like TensorFlow and Caffe. It provides the tools to optimize, compress and compile trained AI models running on a Xilinx device in as little as one minute. Xilinx has also open sourced Vitis accelerated libraries and Vitis AI models, as well as corresponding example designs that can be used from endpoint to edge in addition to cloud platforms.At the Xilinx Developer Forum (XDF) Americas in early October, Xilinx first unveiled Vitis (pronounced Vī-tis), a unified software platform that enables a broad new range of developers – including software engineers and AI scientists – to take advantage of the power of hardware adaptability. Five years and a total of 1,000 man years in the making, Vitis automatically tailors the Xilinx hardware architecture to the software or algorithmic code without the need for hardware expertise. Rather than imposing a proprietary development environment, the Vitis platform plugs into common software developer tools and utilizes a rich set of optimized open source libraries, enabling developers to focus on their algorithms. Vitis is separate to the Vivado® Design Suite, which will still be supported for those who want to program using hardware code, but the new platform can also boost the productivity of hardware developers by packaging hardware modules as software-callable functions. The Xilinx developer site provides easy access to examples, tutorials and documentation, as well as a portal to connect the Vitis and Vitis AI developer community. ADDITIONAL RESOURCESInformation on Xilinx, Inc. General information on the Vitis unified software platform Detailed information on the Vitis unified software platform Information in Vitis AI  Information on the Vitis developer libraries Join the Xilinx developer site Sign up for Vitis alerts Follow Xilinx on Twitter, LinkedIn, and FacebookAbout XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.© Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.PR Contact:Tara Simsmedia@xilinx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-vitis-ai-now-available-for-download-300967735.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Vitis Unified Software Platform Now Available for Download",
        "subtitle": "",
        "date": "Nov 12, 2019 3:00AM EST",
        "content": "THE HAGUE, Netherlands, Nov. 12, 2019 /PRNewswire/ -- Xilinx Developer Forum Europe 2019 -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced its new Vitis™ unified software platform and optimized open source libraries are available for immediate download, and free of charge. Vitis enables a broad range of developers – from software engineers to AI scientists – to work with and benefit from the power of Xilinx's adaptable hardware, using software tools and frameworks they already know and understand. Using the Vitis platform, software developers can accelerate their applications with Xilinx® adaptive hardware, without the need for hardware expertise. Rather than imposing a proprietary development environment, the Vitis platform plugs into common software developer tools and utilizes a rich set of open source libraries optimized for Xilinx hardware. The associated Xilinx developer site provides easy access to examples, tutorials and documentation, as well as a space to connect the Vitis developer community. It is managed by Xilinx Vitis experts and enthusiasts, providing valuable information on the latest Vitis updates, tips and tricks.  ADDITIONAL RESOURCESInformation on Xilinx, Inc. General information on the Vitis unified software platform Detailed information on the Vitis unified software platform  Information in Vitis AI   Information on the Vitis developer libraries  Join the Xilinx developer site  Sign up for Vitis alerts Follow Xilinx on Twitter, LinkedIn, and FacebookAbout XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.PR Contact:Tara Simsmedia@xilinx.com © Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-vitis-unified-software-platform-now-available-for-download-300955390.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Announces the World's Highest Performance Adaptive Devices for Advanced ADAS and AD Applications",
        "subtitle": "Xilinx automotive-qualified line now scales from edge sensors to complex domain controllers",
        "date": "Nov 12, 2019 3:00AM EST",
        "content": "THE HAGUE, Netherlands, Nov. 12, 2019 /PRNewswire/ -- Xilinx Developer Forum Europe 2019 -- Xilinx, Inc., (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced the expansion of its automotive-qualified 16 nanometer (nm) family with two new devices – the Xilinx® Automotive (XA) Zynq® UltraScale+™ MPSoC 7EV and 11EG. These two new parts deliver the highest programmable capacity, performance and I/O capabilities enabling high-speed, data aggregation, pre-processing, and distribution (DAPD), as well as compute acceleration for L2+ to L4 advanced driver-assistance systems (ADAS) and autonomous driving (AD) applications. With these new additions, Xilinx now offers the world's highest level of silicon integration that meets the safety, quality and reliability requirements for automotive, with a comprehensive line of products scaling from small devices powering edge sensors to new high-performance devices for centralized domain controllers.The new XA Zynq UltraScale+ MPSoC 7EV and 11EG devices were developed as a result of customer demand. The devices offer over 650,000 programmable logic cells – and nearly 3,000 DSP slices, which is 2.5X increase versus the previous largest device. In addition, the XA 7EV contains a video codec unit for h.264/h.265 encode and decode, while the XA 11EG includes 32 12.5Gb/s transceivers and provides four PCIe® Gen3x16 blocks. The addition of these high-performance devices to the XA portfolio enables carmakers, robotaxi developers, and Tier-1 suppliers to perform the DAPD and compute acceleration in a power envelope that allows for scalable production deployments for AD vehicles.  \"The new additions to our automotive portfolio expand our proven offering to the market,\" said Emre Onder, senior vice president, marketing, Xilinx. \"Through customer-driven requests, we've broadened our XA product family to meet the complex levels of today's ADAS and autonomous driving systems. With these additions to the Zynq UltraScale+ product line, Xilinx delivers unmatched processing flexibility and scalability vital for today's rapidly changing requirements. Whether customers are developing for L1 or for L4 systems, we have a solution that meets their needs.\"The XA Zynq UltraScale+ MPSoC portfolio is qualified according to AEC-Q100 test specifications and integrates both Xilinx programmable logic and a feature-rich 64-bit quad-core Arm® Cortex®™-A53 and dual-core Arm Cortex-R5 based processing system that is certified to ASIL-C level in the low power domain. The combination of these features, paired with the high data throughput capability of the new devices, accelerate the deployment of autonomous vehicles on the road today. To date, Xilinx has shipped more than 67 million auto-qualified solutions for ADAS systems and AD production vehicles to over 200 automotive companies including global Tier-1 suppliers, OEMs and start-ups. The new XA Zynq UltraScale+ MPSoC devices are available for order today.  Full technical details on the XA family can be found here. All XA devices are supported by Vitis™ and Vitis AI, the company's new unified software platform that enables a broad range of developers to take advantage of the power of hardware adaptability. For more information, visit: https://www.xilinx.com/products/silicon-devices/soc/xa-zynq-ultrascale-mpsoc.html. About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.PR Contact:Tara Simsmedia@xilinx.com© Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo, and other designated brands included herein are trademarks of Xilinx in the United States and other countries. Arm and Cortex are registered trademarks of Arm Limited in the EU and other countries. PCIe is a trademark of PCI-SIG and used under license. All other trademarks are the property of their respective owners. View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-announces-the-worlds-highest-performance-adaptive-devices-for-advanced-adas-and-ad-applications-300955153.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Alveo Accelerators Power SK Telecom's Real-Time AI-based Physical Intrusion and Theft Detection Service",
        "subtitle": "",
        "date": "Oct 31, 2019 9:30PM EDT",
        "content": "SAN JOSE, Calif. and SEOUL, South Korea, Oct. 31, 2019 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX) and SK Telecom (NYSE: SKM) today announced that SK Telecom has adopted Xilinx® Alveo™ Datacenter Accelerator cards to power a real-time AI-based physical intrusion and theft detection service. SK Telecom's AI inference accelerator (AIX) implemented on Xilinx Alveo cards provides efficient and accurate physical intrusion detection using deep neural networks. ADT CAPS CO., LTD., South Korea's second largest physical security company, licenses and commercially deploys the physical intrusion detection service.SK Telecom's AI-based physical intrusion detection service, T viewTM, monitors hundreds of thousands of customers' commercial and home camera systems in real-time and dispatches security guards under physical intrusion circumstances. Processing a large volume of data from thousands of cameras using deep neural networks necessitates a powerful AI accelerator that can provide enough throughput and accuracy. T view uses SK Telecom's AI inference accelerator (AIX), implemented on Xilinx Alveo U250 cards. Running on servers in SK Telecom's data center, Alveo U250 cards have demonstrated high throughput and accuracy in theft detection services. The cards deliver lower detection latency and have achieved superior throughput (frames per second) compared to leading GPUs and have proven to be more cost effective. The improved throughput and accuracy delivered by Alveo cards means more customers will have access to real-time, AI-based security services, and a more reliable protection against security threats.\"In the era of Artificial Intelligence where new services are being deployed at unprecedented rates, we keep pursuing to innovate our cloud systems to deliver more value to our customers with more reliable and efficient services across diverse segments,\" said Park Jin-hyo, Chief Technology Officer and Head of ICT R&D Center of SK Telecom. \"AIX in collaboration with Xilinx represents one of our efforts to streamline the cloud system for AI services.\" Xilinx Alveo accelerator cards are designed to meet the performance and flexibility needs of data center AI workloads, providing 10X higher performance1 for AI-based speech translation and over 3X higher throughout2 for video analytics pipelines compared to GPUs. Built on the Xilinx® 16nm UltraScale+™ architecture, Alveo accelerators are adaptable to changing algorithms and acceleration requirements, enabling domain specific architectures that optimize performance for a range of workloads without changing hardware, and while reducing overall cost of ownership.The commercial deployment of Xilinx Alveo cards in SK Telecom's data center for AI services builds upon the announcement and success of SK Telecom's automated speech-recognition (ASR) application powered by Xilinx FPGAs to accelerate NUGU, a voice-activated assistant. \"This represents an important win in the commercial AI services space and builds upon our collaboration with SK Telecom to significantly improve theft detection and prevention, where our leadership in real-time compute and analysis helps to promote AI-based services to the South Korea market,\" said Donna Yasay, vice president of marketing, Data Center Group, at Xilinx. \"The adaptability, low latency and high throughput delivered by our Alveo accelerators makes them ideally suited for the visual AI inference workloads in the T view service.\" Availability SK Telecom's AIX accelerator, implemented on the Alveo U250, and the T view service are currently available in South Korea and are expected to be available globally in fall 2020. The T view is also expected to be commercially available as a rebranded solution from other SK Telecom licensed companies. About SK TelecomSK Telecom is the largest mobile operator in Korea with nearly 50 percent of the market share. As the pioneer of all generations of mobile networks, the company has commercialized the fifth generation (5G) network on December 1, 2018 and announced the first 5G smartphone subscribers on April 3, 2019. With its world's best 5G, SK Telecom is set to realize the Age of Hyper-Innovation by transforming the way customers work, live and play. Building on its strength in mobile services, the company is also creating unprecedented value in diverse ICT-related markets including media, security and commerce. For more information, please contact skt_press@sk.com.About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future. For more information, visit www.xilinx.com.1.  Transformer NMT (symbols/sec) benchmark of Nvidia Tesla T4 GPU and Alveo U50 2.  Full video analytics pipeline including decode and CNN inference – compared to NVIDIA Tesla T4 vs Alveo U200 of 1080p60 video streams© Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo, and other designated brands included herein are trademarks of Xilinx in the United States and other countries. All other trademarks are the property of their respective owners.PR Contact:Brian Garabedianmedia@xilinx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-alveo-accelerators-power-sk-telecoms-real-time-ai-based-physical-intrusion-and-theft-detection-service-300949437.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Reports Fiscal Second Quarter 2020 Results",
        "subtitle": "Company now expects full year revenue growth of approximately 6%",
        "date": "Oct 23, 2019 4:20PM EDT",
        "content": "SAN JOSE, Calif., Oct. 23, 2019 /PRNewswire/ -- Xilinx, Inc. (Nasdaq: XLNX), the leader in adaptive and intelligent computing, today announced revenues of $833 million for the second quarter of fiscal year 2020, down 2% from the prior quarter and up 12% year over year. GAAP net income for the September quarter was $227 million, or $0.89 per diluted share.  Non-GAAP net income for the September quarter was $240 million, or $0.94 per diluted share.The Xilinx Board of Directors declared a quarterly cash dividend of $0.37 per outstanding share of common stock payable on December 3, 2019, to all stockholders of record at the close of business on November 12, 2019.  The Xilinx Board of Directors also approved a new authorization for the Company to repurchase up to $1.0 billion of its common stock.  The timing of share repurchases and exact number of common shares to be purchased will depend upon prevailing market conditions and other factors.Additional second quarter of fiscal year 2020 comparisons are provided in the charts below.Q2 2020 Financial Highlights\n(In millions, except EPS)      \"I am pleased to report that we were able to exceed the midpoint of our revenue guidance for the fiscal second quarter amidst a challenging business environment driven by global trade disputes.  Overall, the first half of our current fiscal year remained strong despite the impact of continued business restrictions related to Huawei which was offset by higher than expected 5G product demand from other global communications OEMs and stronger than expected growth in our data center business,\" said Victor Peng, president and chief executive officer.  \"However, we are seeing a combination of headwinds in the second half related to continuing business restrictions, weaker demand for communications products and macro-related weakness offsetting strong overall growth in data center and improvement across our core vertical markets. For fiscal 2020, we believe that third quarter will be our low point and we expect to see a return to sequential revenue growth in our fourth quarter.  Despite the weaker third quarter, we expect fiscal year 2020 revenues to grow approximately six percent compared to fiscal year 2019, which represents the midpoint of our guidance.\"Products are classified as follows:Advanced Products: Alveo, UltraScale+, UltraScale and 7-series products. \nCore Products: Virtex-6, Spartan-6, Virtex?5, CoolRunner?II, Virtex-4, Virtex-II, Spartan-3, Spartan-2, XC9500 products, configuration solutions, software & support/services.Key Statistics: \n(Dollars in Millions)Product and Financial Highlights - Fiscal Second Quarter 2020Business Outlook - Fiscal Third Quarter 2020 & Fiscal Year 2020 The following guidance is based on current expectations and estimates, and as indicated, is presented on a GAAP and non-GAAP basis. This guidance is forward-looking and actual results may differ materially, as a result of, among other things, the important factors discussed and referred to at the end of this release.Xilinx's fiscal third quarter and fiscal year 2020 guidance takes into account the impact from the U.S. government's announced export restriction to one of our customers in China and assumes no revenues from that customer.Fiscal Third Quarter 2020Fiscal Year 2020Conference CallA conference call will be held today at 2:00 p.m. Pacific Time to discuss the September quarter financial results and management's outlook for the December quarter and fiscal year 2020. The webcast and subsequent replay will be available in the investor relations section of the Company's web site at www.investor.xilinx.com.  A telephonic replay of the call may be accessed later in the day by calling (855) 859-2056 and referencing confirmation code 5089455. The telephonic replay will be available for two weeks following the live call.Non-GAAP Financial InformationFiscal second quarter 2020 results and business outlook for the December quarter and fiscal year 2020 include financial measures which are not determined in accordance with the United States generally accepted accounting principles (GAAP), as indicated.  Non-GAAP measures should not be considered as a substitute for, or superior to, financial measures determined in accordance with GAAP. The presentation of non-GAAP financial measures has been reconciled, in each case, to the most directly-comparable GAAP measure, as indicated in the accompanying tables. The Company's calculation of such non-GAAP measures may not be comparable to similarly-titled measures used by other companies.Management uses the non-GAAP financial measures disclosed herein to evaluate the Company's financial results from continuing operations (excluding the impact of acquisitions) and compare to operating performance in past periods.  Similarly, Management believes presentation of these non-GAAP measures is useful to investors because it enables investors and analysts to evaluate operating expenses of the Company's core business, excluding the impact of non-core business expenses such as acquisition-related amortization and non-recurring items.M&A related expenses: These expenses mainly consist of legal and consulting fees associated with acquisition activities.  We believe these costs do not reflect the Company's current operating performance. Consequently, the non-GAAP adjustments exclude these charges to facilitate an evaluation of the Company's current operating performance and comparisons to its past operating performance.Amortization of acquisition-related intangibles:  Amortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology acquired in connection with business combinations. The non-GAAP adjustments exclude these charges to facilitate an evaluation of the Company's current operating performance and comparisons to its past operating performance.Inventory valuation adjustment: Business combination accounting principles require us to measure acquired inventory at fair value. The fair value of inventory reflects the acquired company's cost of manufacturing plus a portion of the expected profit margin. The non-GAAP adjustment to our cost of sales excludes the expected profit margin component that is recorded under business combination accounting principles associated with our acquisitions. We believe the adjustments are useful to investors as an additional means to reflect cost of sales and gross margin trends of our business.Gain on investment related to acquisition: The Company excludes the accounting gain resulting from revaluation of its prior minority investment in DeePhi Tech. The Company believes excluding this gain will facilitate a comparable evaluation of its current operating performance to its past operating performance.Income taxes: The Company excludes the income tax effects of non-GAAP adjustments reflected in Operating Expenses and Other Income, as detailed above.  It also excludes U.S. tax reform related items.  The Company believes excluding U.S. tax reform related items will facilitate a comparable evaluation of its current performance to its past performance.  The third quarter of fiscal 2020 and fiscal year 2020 outlook does not reflect other tax related items which we are not able to predict without unreasonable efforts due to their inherent uncertainty.Forward-Looking StatementsThis release contains forward-looking statements and projections. Forward-looking statements and projections can often be identified by the use of forward-looking words such as \"expect,\" \"believe,\" \"may,\" \"will,\" \"could,\" \"anticipate,\" \"estimate,\" \"continue,\" \"plan,\" \"intend,\" \"project\" or other similar expressions.  Statements that refer to or are based on projections, uncertain events or assumptions also identify forward-looking statements.  Such forward looking statements include, but are not limited to, statements related to the semiconductor market, the growth and acceptance of our products, expected revenue growth, the demand and growth in the markets we serve, opportunity for expansion into new markets, and our expectations regarding our business outlook for the December quarter and for fiscal year 2020.  Undue reliance should not be placed on such forward-looking statements and projections, which speak only as of the date they are made. We undertake no obligation to update such forward-looking statements.  Actual events and results may differ materially from those in the forward-looking statements and are subject to risks and uncertainties including, among others, customer acceptance of our new products, current global economic conditions, our dependence on certain customers, trade and export restrictions, the condition and performance of our customers and the end markets in which they participate, our ability to forecast end customer demand, a high dependence on turns business, more customer volume discounts than expected, greater product mix changes than anticipated, fluctuations in manufacturing yields, our ability to deliver product in a timely manner, our ability to successfully manage production at multiple foundries, variability in wafer pricing, costs and liabilities associated with current and future litigation, our ability to realize the goals contemplated by our acquisitions and strategic investments, the impact of current and future legislative and regulatory changes, the impact of new accounting pronouncements and tax laws, including the U.S. Tax Cuts and Jobs Act, and interpretations thereof, and other risk factors described in our most recent Forms 10-Q and 10-K.About Xilinx Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies - from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future. For more information, visit www.xilinx.com.Xilinx, the Xilinx logo, Artix, ISE, Kintex, Spartan, Virtex, Zynq, Vivado, Alveo, Versal and other designated brands included herein are trademarks of Xilinx in the United States and other countries. All other trademarks are the property of their respective owners.XLNX-FInvestor Relations Contact:\nSuresh Bhaskaran \nXilinx, Inc.\n(408) 879-4784\nir@xilinx.comView original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-reports-fiscal-second-quarter-2020-results-300944295.htmlSOURCE  Xilinx, Inc.Xilinx, Inc."
    },
    {
        "title": "Lifshitz & Miller LLP Announces Investigation of Altria Group, Inc., Chardan Healthcare Acquisition Corporation, Premier, Inc., Restoration Robotics, Inc., Vivint Solar, Inc., Waitr Holdings Inc., Xilinx, Inc., and Zscaler, Inc.",
        "subtitle": "",
        "date": "Oct 10, 2019 2:53PM EDT",
        "content": "NEW YORK, Oct. 10, 2019 /PRNewswire/ --Altria Group, Inc. (MO)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that MO conducted insufficient due diligence into JUUL prior to its $12.8 billion investment.If you are a MO investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Chardan Healthcare Acquisition Corporation (CHAC)Lifshitz & Miller announces investigation into possible breach of fiduciary duties in connection with the merger of Chardan with BiomX Ltd. If you are a CHAC investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Premier, Inc. (PINC)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that Premier is temporarily generating twice the earnings which its business model can sustain organically.If you are a PINC investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Restoration Robotics, Inc. (HAIR)Lifshitz & Miller announces investigation into possible breach of fiduciary duties in connection with the sale of HAIR to Venus Concept Ltd. for 8.6506 Venus shares per share.If you are a HAIR investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Vivint Solar, Inc. (VSLR)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that Vivint forged customer contracts or otherwise engaged in fraud or deception.If you are a VSLR investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Waitr Holdings Inc. (WTRH)Lifshitz & Miller announces investigation into possible securities laws violations in connection with allegations that WTRH unilaterally broke low-rate contracts and imposed significantly higher rates, in addition to refusing to pay drivers for mileage related expenses.If you are a WTRH investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Xilinx, Inc. (XLNX)Lifshitz & Miller announces investigation into possible securities laws violations in connection with its CFO stepping down to pursue another executive opportunity.If you are a XLNX investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.Zscaler, Inc. (ZS)Lifshitz & Miller announces investigation into possible securities laws violations in connection with Zscaler's disclosure that its larger deals were taking longer to close.If you are a ZS investor, and would like additional information about our investigation, please complete the Information Request Form or contact Joshua Lifshitz, Esq. by telephone at (516)493-9780 or e-mail at info@jlclasslaw.com.ATTORNEY ADVERTISING.© 2019 Lifshitz & Miller LLP. The law firm responsible for this advertisement is Lifshitz & Miller LLP, 821 Franklin Avenue, Suite 209, Garden City, New York 11530, Tel: (516)493-9780. Prior results do not guarantee or predict a similar outcome with respect to any future matter.Contact:Joshua M. Lifshitz, Esq.Lifshitz & Miller LLPPhone: 516-493-9780Facsimile: 516-280-7376Email: info@jlclasslaw.com  View original content:http://www.prnewswire.com/news-releases/lifshitz--miller-llp-announces-investigation-of-altria-group-inc-chardan-healthcare-acquisition-corporation-premier-inc-restoration-robotics-inc-vivint-solar-inc-waitr-holdings-inc-xilinx-inc-and-zscaler-inc-300936726.htmlSOURCE  Lifshitz & Miller Law Firm"
    },
    {
        "title": "Xilinx Announces Vitis - a Unified Software Platform Unlocking a New Design Experience for All Developers",
        "subtitle": "Vitis empowers software developers with adaptable hardware, while accelerating productivity for hardware designers",
        "date": "Oct 1, 2019 12:00PM EDT",
        "content": "SAN JOSE, Calif., Oct. 1, 2019 /PRNewswire/ -- XILINX DEVELOPER FORUM (XDF) AMERICAS 2019 - Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced Vitis™ (pronounced Vī-tis), a unified software platform that enables a broad new range of developers – including software engineers and AI scientists – to take advantage of the power of hardware adaptability. Five years and a total of 1,000 man years in the making, the Vitis unified software platform automatically tailors the Xilinx hardware architecture to the software or algorithmic code without the need for hardware expertise. Rather than imposing a proprietary development environment, the Vitis platform plugs into common software developer tools and utilizes a rich set of optimized open source libraries, enabling developers to focus on their algorithms. Vitis is separate to the Vivado™ Design Suite, which will still be supported for those who want to program using hardware code, but Vitis can also boost the productivity of hardware developers by packaging hardware modules as software-callable functions.  \"With exponentially increasing compute needs, engineers and scientists are often limited by the fixed nature of silicon,\" said Victor Peng, president and chief executive officer, Xilinx. \"Xilinx has created a singular environment that enables programmers and engineers from all disciplines to co-develop and optimize both their hardware and software, using the tools and frameworks they already know and understand. This means that they can adapt their hardware architecture to their application without the need for new silicon.\"  THE VITIS STACK The Vitis platform is built on a stack-based architecture that plugs seamlessly into open-source standard development systems and build environments, but most importantly, it includes a rich set of standard libraries.  The base layer is the Vitis target platform, which includes a board and preprogrammed I/O. The second layer, called the Vitis core development kit, encompasses the open-source Xilinx runtime library to manage the data movement between different domains, including the subsystems, the AI Engine in the forthcoming Versal ACAP™, as well as an external host, if required. This layer also includes the core development tools such as compilers, analyzers and debuggers. While Xilinx provides a world-class design environment, these tools are designed to integrate seamlessly with industry-standard build systems and development environments. In the third layer are more than 400 optimized and open-source applications across eight Vitis libraries. These include the Vitis Basic Linear Algebra Subprograms (BLAS) library, the Vitis Solver library, the Vitis Security library, the Vitis Vision library, the Vitis Data Compression library, the Vitis Quantitative Finance library, the Vitis Database library and the Vitis AI library. These enable software developers to call pre-accelerated functions using a standard application programming interface (API).  VITIS AI AND DOMAIN-SPECIFIC ARCHITECTURES The fourth and most game-changing element of the platform is Vitis AI, which integrates a domainspecific architecture (DSA). The DSA configures Xilinx hardware to be optimized and programmed using industry-leading frameworks like TensorFlow and Caffe. Vitis AI provides the tools to optimize, compress and compile trained AI models running on a Xilinx device in about one minute. It also delivers specialized APIs for deployment from edge to cloud, all with best-in-class inference performance and efficiency. Xilinx will soon be releasing another DSA, called Vitis Video, to enable video encoding directly from FFmpeg for the same, ultra-simple, highly powerful end-to-end solution. DSAs available from partner companies include Illumina, which integrates with GATK for genome analysis, and BlackLynx, which integrates with ElasticSearch for big data analytics, along with proprietary DSAs that are currently being utilized by our customers. VITIS DEVELOPER SITE Xilinx also today announced it has launched a developer site that provides easy access to examples, tutorials and documentation, as well as a space to connect the Vitis developer community.  It will be managed by Xilinx and Vitis experts and enthusiasts, and will provide valuable information on the latest Vitis updates, tips and tricks.   VITIS AVAILABILITY  The Vitis unified software platform, which provides software developers the efficiency of applicationspecific hardware without the need for new silicon, is free for Xilinx boards and will be available for download next month. Sign up for Vitis alerts to be notified.  ADDITIONAL RESOURCES Check out Xilinx's XDF 2019 Media Kit General information on the Vitis unified software platform  Detailed information on the Vitis unified software platform   Information in Vitis AI   Information on the Vitis developer libraries  Join the Xilinx developer site  Sign up for Vitis alerts  Follow Xilinx on Twitter, LinkedIn, and Facebook About Xilinx Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com. PR Contact: Tara Sims media@xilinx.com © Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.   View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-announces-vitis--a-unified-software-platform-unlocking-a-new-design-experience-for-all-developers-300928305.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Announces Chief Financial Officer Transition",
        "subtitle": "",
        "date": "Sep 19, 2019 4:10PM EDT",
        "content": "SAN JOSE, Calif., Sept. 19, 2019 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced that Lorenzo Flores, Executive Vice President and Chief Financial Officer, is stepping down from his position to pursue another executive opportunity. Flores plans to leave Xilinx following the company's second quarter fiscal year 2020 earnings on October 23, to ensure a smooth transition. The company has initiated a formal search for a new Chief Financial Officer. \"On behalf of the Board of Directors and the entire management team, I would like to thank Lorenzo for his contributions and dedication to the company during the past 11 years,\" said Victor Peng, President and Chief Executive Officer, Xilinx. \"In particular, as Chief Financial Officer over the last three years, he has been integral to our efforts to grow our business and execute on our transition to a platform company. We wish him continued success in his next chapter.\" \"It has been an honor to serve the shareholders, employees and customers of Xilinx during my tenure. I am proud of all we have accomplished together, particularly the outstanding financial performance of the company,\" said Flores.  \"Xilinx is extremely well-positioned in the industry and I am highly confident that the broad strength of the organization and management will ensure its continued success.\"In connection with today's announcement, the company has appointed Sumeet Gagneja, Corporate Vice President, Finance and Corporate Controller, as Chief Accounting Officer and, Matt Poirier, Senior Vice President, Corporate Development and Investor Relations, will assume responsibilities of Treasurer. Gagneja and Poirier will report to Peng, who will provide oversight of finance operations while the company conducts its search for a new CFO.About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.PR Contact:Tara Simsmedia@xilinx.comIR Contact:Reuben Gallegosir@xilinx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-announces-chief-financial-officer-transition-300922014.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Announces the World's Largest FPGA Featuring 9 Million System Logic Cells",
        "subtitle": "New Virtex UltraScale+ Device Enables the Creation of Tomorrow's Most Complex Technologies",
        "date": "Aug 21, 2019 9:00AM EDT",
        "content": " SAN JOSE, Calif., Aug. 21, 2019 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today announced the expansion of its 16 nanometer (nm) Virtex® UltraScale+™ family to now include the world's largest FPGA — the Virtex UltraScale+ VU19P. With 35 billion transistors, the VU19P provides the highest logic density and I/O count on a single device ever built, enabling emulation and prototyping of tomorrow's most advanced ASIC and SoC technologies, as well as test, measurement, compute, networking, aerospace and defense-related applications.The VU19P sets a new standard in FPGAs, featuring 9 million system logic cells, up to 1.5 terabits per-second of DDR4 memory bandwidth and up to 4.5 terabits per-second of transceiver bandwidth, and over 2,000 user I/Os. It enables the prototyping and emulation of today's most complex SoCs as well as the development of emerging, complex algorithms such as those used for artificial intelligence, machine learning, video processing and sensor fusion. The VU19P is 1.6X larger than its predecessor and what was previously the industry's largest FPGA — the 20 nm Virtex UltraScale 440 FPGA.  \"The VU19P enables developers to accelerate hardware validation and begin software integration before their ASIC or SoC is available,\" said Sumit Shah, senior director, product line marketing and management, Xilinx. \"This is our third generation of world-record FPGAs. First was the Virtex-7 2000T, followed by the Virtex UltraScale VU440, and now the Virtex UltraScale+ VU19P. But this is more than silicon technology; we're providing robust and proven tool flows and IP to support it.\"The VU19P is supported by an extensive set of debug, visibility tools, and IP, providing customers with a comprehensive development platform to quickly design and validate next-generation applications and technologies. Hardware and software co-validation allows for developers to bring up software and implement custom features before physical parts are available. Moreover, the design flow can be co-optimized by using the Xilinx Vivado® Design Suite, which reduces cost and tape-out risk, and improves efficiency and time-to-market.\"Arm relies on Xilinx devices as part of our process for validating our next-generation processor IP and SoC technology,\" said Tran Nguyen, director of design services, Arm. \"The new VU19P will further enable Arm, and many others in our ecosystem, to accelerate the design, development and validation of our most ambitious roadmap technologies.\" The VU19P will be generally available in the fall of 2020. To learn more about the VU19P as well as Xilinx's complete line of Virtex UltraScale+ FPGA products, visit www.xilinx.com/products/silicon-devices/fpga/virtex-ultrascale-plus-vu19p.html. About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent, and connected world of the future. For more information, visit www.xilinx.com.© Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo and other designated brands included herein are trademarks of Xilinx in the United States and other countries.PR Contact:Tara Simsmedia@xilinx.com  View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-announces-the-worlds-largest-fpga-featuring-9-million-system-logic-cells-300904650.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "Xilinx Expands Alveo Portfolio with Industry's First Adaptable Compute, Network and Storage Accelerator Card Built for Any Server, Any Cloud",
        "subtitle": "First low-profile PCIe Gen 4 card delivers dramatic improvements in throughput, latency and power efficiency for critical data center workloads",
        "date": "Aug 6, 2019 9:00AM EDT",
        "content": "SAN JOSE, Calif., Aug. 6, 2019 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, today expanded its Alveo data center accelerator card portfolio with the launch of the Alveo™ U50. The U50 card is the industry's first low profile adaptable accelerator with PCIe Gen 4 support, uniquely designed to supercharge a broad range of critical compute, network and storage workloads, all on one reconfigurable platform.The Alveo U50 provides customers with a programmable low profile and low-power accelerator platform built for scale-out architectures and domain-specific acceleration of any server deployment, on-premise, in the cloud and at the edge. To meet the challenges of emerging dynamic workloads such as cloud microservices, Alveo U50 delivers between 10-20x improvements in throughput, latency and power efficiency. For accelerated networking and storage workloads, the U50 card helps developers identify and eliminate latency and data movement bottlenecks by moving compute closer to the data. Powered by the Xilinx® UltraScale+™ architecture, the Alveo U50 card is the first in the Alveo portfolio to be packaged in a half-height, half-length form factor and low 75-Watt power envelope. The card features high-bandwidth memory (HBM2), 100 gigabit per second (100 Gbps) networking connectivity, and support for the PCIe Gen 4 and CCIX interconnects. By fitting into standard PCIe server slots and using one-third the power, the Alveo U50 significantly expands the scope in which adaptable acceleration can be deployed to unlock dramatic throughput and latency improvements for demanding compute, network and storage workloads. The 8GB of HBM2 delivers over 400 Gbps data transfer speeds and the QSFP ports provide up to 100 Gbps network connectivity. The high-speed networking I/O also supports advanced applications like NVMe-oF™ solutions (NVM Express over Fabrics™), disaggregated computational storage and specialized financial services applications.  From machine learning inference, video transcoding and data analytics to computational storage, electronic trading and financial risk modeling, the Alveo U50 brings programmability, flexibility, and high throughput and low latency performance advantages to any server deployment. Unlike fixed architecture alternatives, the software and hardware programmability of the Alveo U50 allows customers to meet ever-changing demands and optimize application performance as workloads and algorithms continue to evolve.  Alveo U50 accelerated solutions deliver significant customer value across a range of applications, including: \"Ever-growing demands on the data center are pushing existing infrastructure to its limit, driving the need for adaptable solutions that can optimize performance across a broad range of workloads and extend the lifecycle of existing infrastructure, ultimately reducing TCO,\" said Salil Raje, executive vice president and general manager, Data Center Group, at Xilinx. \"The new Alveo U50 brings an optimized form factor and unprecedented performance and adaptability to data center workloads, and we continue to build out solution stacks with a growing ecosystem of application partners to deliver previously unthinkable capabilities to a range of industries.\" Industry Support\"The forthcoming 2nd Gen AMD EPYC processor is ideally suited for data center-first accelerators like the Alveo U50 that combine compute, network and storage acceleration all on the same platform,\" said Raghu Nambiar, vice president & CTO of application engineering at AMD. \"Taking advantage of AMD's leadership, first x86 server-class PCIe 4.0 CPU, the Alveo U50 will be the industry's first adaptable accelerator card with PCIe 4.0 support. We look forward to working with Xilinx to combine the benefits of AMD EPYC based solutions with Alveo acceleration to hyperscale and enterprise customers.\"\"IBM is excited about the expansion of the Xilinx Alveo portfolio with the addition of the Alveo U50 adaptable accelerator card,\" said Steve Fields, Chief Architect for IBM Power Systems. \"We believe the combination of low-profile form-factor, HBM2 memory performance, and PCIe Gen 4 speed to interface with IBM Power processors will enable the OpenPOWER ecosystem to provide cutting edge adaptable acceleration solutions.\"  \"With the smaller design and advanced features of the Alveo U50, Xilinx is well positioned to expand the markets for acceleration with configurable logic,\" said Karl Freund, senior analyst, HPC and deep learning, Moor Insights & Strategy. \"The new Alveo U50 should allow them to break through the market noise with demonstrated and dramatic performance advantages in high-growth use cases.\"\"We are excited to be collaborating with Xilinx at FMS, showcasing the flexibility and performance of the Alveo U50 and our OpenFlex composable NVMe-oF platform,\" said Scott Hamilton, senior director of product management, Data Center Systems business unit at Western Digital. \"Xilinx is leading the charge in fabric-based computational storage using NVMe-oF to enable full disaggregation of server resources. We believe the new Alveo U50 will be an important part of the ecosystem as organizations take a truly disaggregated approach to SDS infrastructure.\"Availability: The Alveo U50 is sampling now with OEM system qualifications in process. General availability is slated for fall 2019. Flash Memory Summit:  Xilinx will be showcasing the Alveo U50 and other product demonstrations in booth 313 at Flash Memory Summit (FMS) 2019, taking place August 6-8 at the Santa Clara Convention Center in Santa Clara, Calif.  Additionally, Salil Raje, executive vice president and general manager, Data Center Group, at Xilinx, will be giving a keynote titled, \"FPGAs: The Key to Accelerating High-Speed Storage Systems\" on August 7 at 2:40 p.m. PT in the Mission City Ballroom. About XilinxXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs, and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future. For more information, visit www.xilinx.com.Footnotes: © Copyright 2019 Xilinx, Inc. Xilinx, the Xilinx logo, and other designated brands included herein are trademarks of Xilinx in the United States and other countries. NVMe-oF and NVM Express over Fabrics are trademarks of NVM Express, Inc. PCI, PCIe and PCI Express are trademarks of PCI-SIG and used under license.  All other trademarks are the property of their respective owners.PR Contact:Brian Garabedianmedia@xilinx.com   View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-expands-alveo-portfolio-with-industrys-first-adaptable-compute-network-and-storage-accelerator-card-built-for-any-server-any-cloud-300896576.htmlSOURCE  Xilinx, Inc."
    },
    {
        "title": "InvestorsObserver releases option trade data on AMD, Bank of America, D.R. Horton, 3M, and Xilinx",
        "subtitle": "",
        "date": "Apr 26, 2019 9:31AM EDT",
        "content": "NEW YORK, April 26, 2019 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for AMD, BAC, DHI, MMM, and XLNX.Click a link below then choose between in-depth options trade idea report or a stock score report.Options Report – Ideal trade ideas on up to seven different options trading strategies. The report shows all vital aspects of each option trade idea for each stock.Stock Report - Measures a stock's suitability for investment with a proprietary scoring system combining short and long-term technical factors with Wall Street's opinion including a 12-month price forecast.(Note: You may have to copy this link into your browser then press the [ENTER] key.) View original content:http://www.prnewswire.com/news-releases/investorsobserver-releases-option-trade-data-on-amd-bank-of-america-dr-horton-3m-and-xilinx-300839001.htmlSOURCE  InvestorsObserver"
    },
    {
        "title": "Xilinx to Acquire Solarflare",
        "subtitle": "Acquisition Enables Converged SmartNIC Solutions to Address Dynamic Workloads in the Data Center",
        "date": "Apr 24, 2019 4:20PM EDT",
        "content": "SAN JOSE, Calif., April 24, 2019 /PRNewswire/ -- Xilinx, Inc. (NASDAQ: XLNX), the leader in adaptive and intelligent computing, announced today that it has entered into a definitive agreement to acquire Solarflare Communications, Inc., an Irvine, Calif.-based privately-held company. Solarflare is a leading provider of high-performance, low latency networking solutions for customers spanning FinTech to cloud computing. The acquisition will enable Xilinx to combine its industry-leading FPGA, MPSoC and ACAP solutions with Solarflare's ultra-low latency network interface card (NIC) technology and Onload application acceleration software, to enable new converged SmartNIC solutions, accelerating Xilinx's \"data center first\" strategy and transition to a platform company. Xilinx and Solarflare have been collaborating on advanced networking technology for the last two years, with Xilinx becoming a strategic investor in 2017. The two companies recently demonstrated their first joint solution – a single-chip FPGA-based 100G SmartNIC, processing 100 million packets per-second receive and transmit, all at less than 75 watts.\"The Solarflare team has worked very closely with Xilinx on next-generation networking technology and business collaboration since Xilinx became a strategic investor,\" says Russell Stern, chief executive officer, Solarflare. \"Our shared vision for the future of data center and cloud computing and the integration of our respective technologies makes this acquisition the ideal next step for our customers, employees, and investors, as well as the broader data center industry.\" \"Solarflare has been a pioneer in key areas such as high-speed Ethernet, application acceleration, and NVMe-over-fabrics, which are the critical components needed to build the next generation of SmartNICs for cloud and enterprise technologies,\" says Salil Raje, executive vice president and general manager, Data Center Group, Xilinx.  \"Acquiring Solarflare brings Xilinx both market-leading technology and exceptional engineering talent with expertise in networking hardware, software, firmware and drivers. We are very excited about the possibilities with Solarflare as part of the Xilinx family to enable the adaptable, intelligent world.\"The acquisition is expected to close in Xilinx's second quarter of fiscal year 2020, following regulatory review and other customary closing conditions. Xilinx Chief Executive Officer, Victor Peng, will address the acquisition as part of today's Q4 and FY19 financial results call, scheduled for 2:00 p.m. Pacific time/5:00 p.m. Eastern. For more information on Xilinx and its adaptable, intelligent technologies, please visit www.xilinx.com, or follow Xilinx on Twitter, LinkedIn, and Facebook. About Xilinx, Inc.Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies – from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP, designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future. For more information, visit www.xilinx.com.PR Contact: Tara Sims media@xilinx.com View original content to download multimedia:http://www.prnewswire.com/news-releases/xilinx-to-acquire-solarflare-300837025.htmlSOURCE  Xilinx, Inc."
    }
]